["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In June 2020, a set of images started to circulate on social media supposedly showing screen grabs from an episode of \"The Simpsons\" in which the long-running animated show \"predicted\" the death of George Floyd, a black man whose death while in Minneapolis Police custody sparked nationwide protests:", "These images do not show a \"prediction\" that \"The Simpsons\" made in the 1990s.", "The image on the right showing Chief Wiggum kneeling on a black man's neck — a scene reminiscent of George Floyd's death — while Lisa Simpson stands by holding a \"Justice for George\" sign was created by Instagram user Yuri Pomo. This image did not appear in an episode of \"The Simpsons\" and it was posted to Pomo's Instagram account on May 30, five days after Floyd's death.", "Pomo captioned the image on Instagram:", "Normally you’re used to see colorful and cheerful drawings from me, but since i’ve got quite a good audience, i’d like to use it as much as i can in the right way when the situation requires it, and bring something good, and useful with my drawings, and you guys know it.", "Especially in this exact moment.", "With this piece i’d like you to think deeply, Taking the chance to bring The Simpsons as an example for the cause. The Simpsons has always been everyone’s childhood, so the message will be clear and strong enough i suppose.", "Imagine you’re sat with you daughter/son watching the Simpsons, and all of a sudden this scene happens in the show, as cruel as it has been, no jokes, no irony, nothing that the Simpsons normally has, and what it’s loved for. Imagine that, how would you feel? ... Think about that deeply, and give yourself an answer, no need to add anything else!", "The above-displayed collage also implies that \"The Simpsons\" predicted that a police station would be lit on fire.", "Although a precinct in Minneapolis, Minnesota, was truly set ablaze, the image in this collection does not show that fire. The photograph in the bottom left corner of this collection actually shows an unfinished housing complex. That photograph is available via The Associated Press and captioned as follows:", "A multi-story affordable housing complex under construction near the Third Precinct, burns on Wednesday, May 27, 2020 in Minneapolis, Minn. Protests were sparked by the death of George Floyd at the hands of a Minneapolis Police officer Monday. (Mark Vancleave/Star Tribune via AP)", "The image on the top left, showing the Springfield police station on fire, truly does come from an episode of \"The Simpsons.\" However, this image has nothing to do with protests, riots, George Floyd, or police violence. Instead, it refers to a joke \"The Simpsons\" made about police incompetence.", "In the episode \"Hello Gutter, Hello Fadder\" (Season 11, Episode 6), Homer decides to bypass traffic by driving along the grassy area next to the highway. He is pulled over by Springfield's Police Chief Wiggum, who asks: \"Alright smart guy, where's the fire?\"", "Homer replies \"over there\" and points to a flaming Springfield police station. Chief Wiggum responds: \"Okay, you just bought yourself a 317, pointing out police stupidity... Or is that a 314? Nah nah, 314 is a dog uh, in, no or is that a 315?... You're in trouble pal.\"", "We have not been able to find a publicly available version of this clip to share in this article, but here's a GIF capturing the moment:", "In sum, \"The Simpsons\" didn't predict Floyd's death or the resulting protests or fires. The image of Chief Wiggum kneeling on a black man's neck was shared in the days after Floyd's death and didn't appear in an official episode of the show. Although the image of the Springfield police station burning did come from an episode of \"The Simpsons,\" this clip had nothing to do with Floyd or the 2020 protests.", "The Associated Press.   \"Minneapolis Police Station Torched Amid George Floyd Protest.\"\r\n    29 May 2020.", "BBC News.   \"George Floyd: What Happened in the Final Moments of His Life.\"\r\n    30 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]