["A well-worn Democratic attack line is being repeated in Nevada’s Senate race, with a major union dropping seven figures on a new television ad attacking Republican candidate Joe Heck.", "The political arm of the American Federation of State, County and Municipal Employees is running several ads warning viewers that Heck would be a \"threat\" to the future of the entitlement program.", "\"In Washington, Congressman Joe Heck supports privatizing it, turning our savings over to Wall Street and risking it on the stock market.\" the ad says. \"Heck's plan means billions more for Wall Street, and they've donated over half a million dollars to his campaign.\"", "The donations aspect of the ad is relatively straightforward, as the securities and investment industry has donated $525,569 to Heck throughout his congressional career, according to an OpenSecrets.com tally (roughly 73 percent of that sum coming during his current Senate run).", "But the main claim of the ad, that Heck would \"privatize\" Social Security and subsequently jeopardize the program’s fiscal stability, is one that PolitiFact and other Nevada journalists have called inaccurate on multiple occasions.", "Democrats have used the specter of Republican-led efforts to privatize Social Security as a political boogeyman since at least 2005, when then-President George W. Bush unsuccessfully proposed a plan to quasi-privatize the entitlement program for younger workers.", "Many Republicans (not just Heck and Bush) have supported adding optional private accounts for younger workers as a way to extend the life of the entitlement program, which is scheduled to run out of reserve funds in 2034 and be unable to pay out full benefits to future beneficiaries.", "Here’s what Heck has actually proposed or has mentioned as a potential change for the entitlement program:", "Indexing the retirement age from 67 to 69 by one month per year for the next 24 years;", "Allowing younger workers to voluntarily invest retirement funds directed toward Social Security into other private markets;", "Possibly raising the cap on earnings to which the Social Security tax applies ($118,500 in 2015).", "It’s that second point that AFSCME says backs up the claim that Heck wants to \"privatize\" Social Security. (Heck calls it a \"diversified investment.\")", "This is somewhat of an argument over semantics: Is Heck’s proposal privatization or not? PolitiFact has generally found that support for voluntary private Social Security accounts for younger workers doesn’t merit the sort of concerns or consequences implied by a \"full privatization\" of the program.", "The vast majority of Republicans, including Heck, say they’re adamantly opposed to making any changes that would affect those already receiving benefits or about to enter the program. It’s misleading of the ad to suggest that Nevada senior citizens could lose \"our savings\" given that Heck has never called for changes to be made for current beneficiaries.", "AFSCME did point to several reports on the potential fiscal cost of a quasi-privatized option, most of which were published nearly a decade ago when the Bush administration was pushing for changes to the entitlement program. Heck was elected to Congress in 2010.", "As the ad points out, Bush’s plan to shift to a partially privatized version of Social Security would likely lead to billions of dollars in fees for the brokerages and mutual fund businesses who would oversee the new individual accounts.", "Heck has previously said he’s more concerned about securing retirement for individuals than ensuring the future solvency of the program.", "\"It’s not about making Social Security solvent,\" Heck said to the Las Vegas Sun in 2010. \"It’s about securing people’s retirement.\"", "In 2011, Heck did join House Republicans in a vote against an amendment that would have prohibited the use of appropriated funds to cut or \"privatize\" Social Security and other entitlements.", "Heck campaign spokesman Brian Baluta said in an email that private investments could potentially entail anything from U.S. Treasury securities, annuities, CDs, money market funds, interest-bearing savings accounts or employer-matched retirement savings account.", "\"But all this is moot, because it’s a theoretical discussion about how to address the long-range insolvency of (Social Security),\" Baluta said in an email. \"There is no Joe Heck plan to privatize Social Security.\"", "This isn’t the first time AFSCME has gone after Heck on this particular issue — the union was sharply criticized over a similar ad in 2010 by journalists including Jon Ralston, who accused the union of \"blatant fear mongering.\"", "Our ruling", "A new AFSCME ad claims that Heck \"supports privatizing (Social Security), turning our savings over to Wall Street, and risking it on the stock market.\"", "Heck has stated an openness to supporting optional, private retirement accounts for people under a certain age as an alternative to the existing Social Security program, but AFSCME is bending the truth.", "Despite what the ad implies, Heck has never suggested a mandatory privatization of the entitlement system that would forcibly \"turn our savings over to Wall Street.\"", "Because this ad is partially accurate but takes things way out of context, we rate it Mostly False.", "Email interview with Brian Baluta, Joe Heck campaign spokesman, Aug. 9, 2016", "Email interview, Tiffany Ricci, AFSCME spokeswoman, Aug. 8, 2016", "KTNV, \"Union coming with seven-figure buy against Joe Heck,\" Aug. 2, 2016", "PolitiFact, \"Clinton exaggerates Republicans' plans to 'privatize' Social Security,\" April 15, 2016", "Reno Gazette-Journal, \"Heck pivots to social security on 'Joe Knows Jobs' tour,\" Aug. 11, 2015", "Las Vegas Review-Journal, \"Nevada congressional hopeful blames Republicans for Ebola,\" Oct. 20, 2014", "PolitiFact, \"David Jolly 'supports privatizing Social Security,' Democrats say,\" Feb. 17, 2014", "PolitiFact, \"Ann McLane Kuster accused Charlie Bass of wanting to privatize Social Security,\" Oct. 22, 2012", "Las Vegas Sun, \"Social Security a political battleground for candidates,\" Sept. 10, 2010", "Las Vegas Sun, \"Union ad against Joe Heck inaccurate again,\" Aug. 31, 2010", "Las Vegas Sun, \"AFSCME ad against Joe Heck full of inaccuracies,\" Aug. 25, 2010", "PolitiFact, \"Barack Obama claims Republican leaders plan to privatize Social Security,\" Aug. 18, 2010", "Nevada News & Views, \"CANDID CANDIDATE: An e-Interview with Joe Heck,\" May 4, 2010", "Brookings, \"Why the 2005 Social Security Initiative Failed, and What it Means for the Future,\" Sept. 21, 2007", "Los Angeles Times, \"Wall Street Lying Low on Social Security,\" Jan. 18, 2005", "NBC News, \"Wall Street steers clear of Social Security debate,\" Dec. 28, 2004", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]