["The IRS will send $1,400 stimulus checks to Americans under the latest COVID relief bill. (Bloomberg photo)", "Democrats rejected a Republican amendment that would have barred prisoners from receiving $1,400 stimulus checks.", "Democrats said the plan would hurt the families of prisoners, making it harder for them to pay their monthly bills.", "Both parties supported past stimulus bills that sent checks to prisoners.", "In the long hours of debate before Senate Democrats passed their sweeping COVID-19 relief package, Republicans offered amendments designed to put Democrats on record on very particular policy points.", "Sens. Tom Cotton, R-Ark., and Bill Cassidy, R-La., put forward one that would prevent $1,400 stimulus checks from going to prisoners. The amendment failed on a party-line vote.", "Cotton tweeted that this was another example of spending tucked in the bill that had nothing to do with pandemic.", "\"Senate Democrats just voted to give stimulus checks to criminals in prison,\" he tweeted March 6. \"They haven’t lost their jobs, they aren’t worried about paying rent or buying groceries.\"", "Senate Democrats just voted to give stimulus checks to criminals in prison. They haven’t lost their jobs, they aren’t worried about paying rent or buying groceries. Another example of the unrelated spending in the Democrats’ partisan slush fund.", "Cotton repeated his point March 8 on Fox News, saying \"every single Democrat\" wanted to send checks to prisoners — invoking Boston Marathon bomber Dzhokhar Tsarnaev and Charleston, S.C., church shooter Dylann Roof.", "The record shows that Democrats rejected the amendment to prevent payments to prisoners.", "Sen. Dick Durbin, D-Ill., said it would harm prisoners’ families.", "\"Given the stark racial disparities in our criminal justice system, this would cause the most harm to Black and brown families and communities already harmed by mass incarceration,\" Durbin said on the Senate floor. \"Children should not be forced to go hungry because a parent is incarcerated.\"", "Prisoners qualify for stimulus payments because of broad eligibility requirements in this relief bill — and others. Prisoners must be a citizen or legal resident, and either need to have filed a tax return, possibly as part of a joint filing, or complete an Internal Revenue Service form requesting payment.", "It’s worth noting that the two previous rounds of stimulus checks during the Trump administration — in the CARES Act in March, and the supplemental package in December — allowed prisoners to receive checks, too.", "Cotton voted for both of those bills.", "His press secretary James Arnold said circumstances were different. In the CARES Act, the issue was \"an unanticipated problem,\" and in December, there was no opportunity to amend the bill.", "The issue had come up before.", "In 2009, President Barack Obama’s economic recovery package barred stimulus checks for most prisoners. Only a few thousand got them, through an exception in the law for those who had just gone to jail.", "In 2020, Washington put a priority on getting checks to people as quickly as possible. The CARES Act kept the eligibility rules broad and simple. Basically, anyone who was an American citizen or permanent legal resident, wasn’t claimed as a dependent by someone else, and had filed a tax return (or didn’t need to because they made very little), could get a check.", "With the December bill, Republicans could have added a prisoner ban to the legislation before it came to an up-or-down vote.", "The issue of prisoners and stimulus checks had long been in the news. Earlier in the year, the IRS blocked CARES Act payments to prisoners. That prompted a class action lawsuit on behalf of incarcerated people, arguing that the IRS rule was arbitrary and unlawful.", "In October, a federal judge ruled against the IRS and said the government had to issue the checks. The judge ruled that the CARES Act had no language restricting payments to prisoners, and the administration couldn’t invent one. That only applied to the CARES Act, but the point is, Republicans had ample opportunity to grapple with the issue as the December bill was being written.", "Despite having the right to stimulus checks, many prisoners hit a stumbling block: The IRS sent the inmates debit cards that some states couldn’t process.", "Cotton said Democrats voted to give stimulus checks to people in prison.", "They did, arguing that to do otherwise would harm the families of prisoners. It’s worth noting that Cotton and other Senate Republicans voted for previous relief packages that also resulted in prisoners getting checks.", "With that clarification, we rate this claim Mostly True.", "Tom Cotton, tweet, March 6, 2021", "U.S. Congress, Senate debate: American Rescue Plan Act, March 6, 2021", "Prison Policy Initiative, Stimulus, round 2: Incarcerated people will be eligible for new round of payments, Dec. 30, 2021", "Associated Press, 3,900 Stimulus Checks Went to Prison Inmates, Aug. 2, 2010", "National Public Radio, Stimulus Debit Cards Unusable For Prison Inmates In At Least Four States, Fb. 6, 2021", "CNN, Fact check: Prisoners also got relief checks from the pandemic bills Trump signed and Cotton voted for, March 8, 2021", "Washington Post, Murderers, undocumented immigrants: Hyped-up claims about who’s getting stimulus checks, March 9, 2021", "IRS.gov, Economic Impact Payment Information Center — Topic A: EIP Eligibility; Definition of Adjusted Gross Income", "Email exchange, James Arnold, press secretary, Office of Sen. Tom Cotton, March 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]