["About this rating", "Four of Donald Trump's five children were born to immigrant mothers, and Trump has proposed a plan ending birthright citizenship for children of undocumented immigrants.", "Trump's children weren't born to mothers with questionable immigration statuses and thus wouldn't have been affected by his proposed plan.", "On 16 August 2015, real estate developer turned GOP presidential hopeful Donald Trump proposed draconian new immigration policies as a plank of his candidacy's platform. Of the several strategies Trump embraced, the most controversial was a challenge to the concept of birthright citizenship (which stipulates that all individuals born within the boundaries the United States are considered U.S. citizens from birth, regardless of the nationality or immigration status of their parents):", "End birthright citizenship. This remains the biggest magnet for illegal immigration. By a 2:1 margin, voters say it's the wrong policy, including Harry Reid who said “no sane country” would give automatic citizenship to the children of illegal immigrants.", "Naturally, Trump's proposal (like much of his campaign) attracted a firestorm of controversy. On 18 August 2015, Trump debated Fox News host Bill O'Reilly during that evening's O'Reilly Factor program over the birthright citizenship aspect of his proposed immigration policy. O'Reilly opined that a challenge to the 14th Amendment wouldn't withstand legal tests: that amendment (adopted in 1868 as part of the Reconstruction amendments dealing with the citizenship status of freed slaves) holds:", "All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside.", "Trump (who later told NBC the \"good people\" could swiftly return) maintained he'd \"much rather find out if anchor babies are actually citizens\":", "Among criticisms of Trump's plan were observations that Trump's first and third wives (Ivana Trump and Melania) Knauss Trump are themselves immigrants. Some surmised (perhaps in jest) that three children born of his marriage to Ivana Trump and one born to current wife Melania Knauss Trump would be subject to deportation under the birthright citizenship portion of his immigration plan:", "But the legal status of any given immigrant prior to achieving naturalization or permanent residency is a complex topic. Similarly, determining the legal status of his first and third wives at the time of the births of four of Trump's five children is challenging. Trump was a real estate developer at the time of his first marriage; and he was not nearly as entrenched in politics at the time of his third marriage (and thus his wives' respective immigration statuses attracted far less attention).", "Ivana Trump moved to New York from her native Czechoslovakia around 1976 and married Trump in April of 1977. Their eldest child, a son named Donald Jr., was born in December 1977. It's likely the Trumps settled any lingering immigration matters during the time between their marriage and Trump Jr.'s birth in late 1977. More to the point: even if Ivana Trump had not yet been granted permanent residency in the U.S., their son would be entitled to citizenship under Trump's plan because he was born in the United States to an American citizen father.", "Slovenia-born Melania Knauss Trump moved to New York City (prior to any relationship with Trump) in 1996. While her citizenship status from that point in time forward was not publicly disclosed, she maintained a career as a model and did not marry Trump until January 2005. Their son Barron was born in March 2006, more than a year after the Knauss-Trump wedding (and again, within the United States to an American citizen father).", "It's true that Trump's proposition has been widely decried as incongruent with the 14th Amendment's granting birthright citizenship to all individuals born inside the United States. It's also true that Trump's proposal could easily be construed as hypocritical to a degree, given that four of his five children were born to mothers who immigrated to the United States. However, since Trump was married to all of his children's mothers at the time of the children's births, his wives would consequently be afforded stronger chances to attain permanent residency via spousal petition. (Both women were already of above-average means and later married a business mogul, further bolstering their ability to navigate a path to legal status.)", "But even if Trump wasn't married to the mothers of his children at the time of their births (he was), and their immigration statuses appeared to be in dispute (of which we could find no indication), all four of the five Trump children born to immigrant mothers were born inside the United States to an American citizen father. As such, even Trump's strict proposal against birthright citizenship would be unlikely to affect the statuses of his own children had they been born under it.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]