["As President Donald Trump campaigned in Wisconsin for Republicans seeking election in November, he turned to a repeated line of attack against Democrats on immigration.", "\"Democrats oppose any effort to secure our border,\" Trump said Oct. 24 in Mosinee, Wis., prompting boos from rally-goers.", "Trump went on to claim that construction of the U.S.-Mexico border wall was underway: \"We started the wall, $1.6 billion, another $1.6 billion, and we have another, but we want to build it very quickly all at one time, and we'll get it done.\"", "It’s Mostly False that his promised border wall is under construction — what’s in the works is replacement fencing.", "His claim that Democrats oppose any effort to secure the border is also untrue.", "Democrats generally oppose the border wall, saying it would be too expensive and not in line with Trump’s promise that Mexico would pay for it. But they favor other security measures, including more Border Patrol agents and technology surveillance. They’ve introduced and co-sponsored legislation toward those goals.", "And the $1.6 billion Trump claims is financing the border wall came from a $1.3 trillion spending package passed in the House and Senate with support from Democrats.", "The White House did not provide supporting evidence for Trump’s claim nor comment on the record.", "Trump in March reluctantly signed a $1.3 trillion spending bill, setting aside his threats to veto it because it did not include all the money he wanted for a border wall.", "The bill included $1.6 billion explicitly designated for new and replacement fencing along the southwest border. That amount also covered $38 million for border barrier planning and design, and $196 million for acquisition and deployment of border security technology.", "Although the appropriations bill said the money was for fencing, Trump has touted it as being money for the wall he promised. In his claims, he’s left out that some Democrats supported the measure.", "The spending package passed in the Senate, 65-32, with 39 Democrats voting in its favor. In the House, it passed 256-167, with 111 Democrats supporting it.", "Democrats have criticized a full-length version of Trump’s proposed border wall as a waste of money. Instead most have pushed for other ways to secure the border.", "They also opposed a June immigration bill introduced by Rep. Bob Goodlatte, R-Va., (which Trump initially supported). Aside from border wall funding, Goodlatte’s bill included cuts to legal immigration and allowed so-called Dreamers to stay in the United States on a renewable nonimmigrant status. Democrats and moderate Republicans said the bill did not offer a permanent solution for Dreamers.", "Over the years, Democrats have sponsored and supported proposals to help secure the border and voted in favor of appropriation bills funding U.S. Customs and Border Protection, the federal agency in charge of enforcing immigration laws at the border.", "Democratic Sen. Chuck Schumer of New York in 2013 sponsored a bill directing the Secretary of Homeland Security to submit two reports on border security strategy, including one on where fencing, infrastructure and technology should be used; authorized the use of the National Guard to help secure the border; called for an increase in the number of Border Patrol agents at the southern border, and other border security measures. The Senate passed the bill but it was not taken up in the House.", "More recently, 30 Democrats co-sponsored a House bill introduced in January by Republican Rep. Will Hurd of Texas.", "The bill intended to protect Dreamers from deportation. It also called for the deployment of \"the most practical and effective technology\" to achieve operational control of the border. Within a year of the bill’s enactment, it directed the Department of Homeland Security to submit to Congress a comprehensive southern border strategy that included details on physical barriers, levees, technologies, tools, and other devices to secure the border.", "Democratic U.S. Sen. Chris Coons of Delaware and the late Sen. John McCain of Arizona in February sponsored legislation similar to Hurd’s House version. That proposal also authorized $110 million per year for five years for collaboration between local law enforcement and CBP.", "Rep. Luis Gutierrez, D-Ill., in January said that while the border wall was \"a monumental waste of taxpayers’ money,\" he would be in favor of it if that’s what it took to help Dreamers.", "Trump said, \"Democrats oppose any effort to secure our border.\"", "Trump’s broad swipe fails to capture other actions under border security that Democrats have supported. Democrats have sponsored and backed legislation for border security, including surveillance technology.", "Trump also claims that the border wall is under construction and that he got $1.6 billion from Congress for it, but leaves out that Democrats also voted in favor of that appropriation.", "Trump’s claim is inaccurate. We rate it False.", "C-SPAN, President Trump Campaign Rally in Wisconsin, President Trump Campaign Rally in Wisconsin, Oct. 24, 2018", "PolitiFact, Donald Trump wrongly claims border wall is under construction, April 4, 2018", "Senate.gov, Roll Call Vote 115th Congress - 2nd Session, Question: On the Motion (Motion to Concur in the House Amendment to the Senate Amendment to H.R. 1625 )", "Congress.gov, H.R.1625 - Consolidated Appropriations Act, 2018; H.R.6136 - Border Security and Immigration Reform Act of 2018; S.744 - Border Security, Economic Opportunity, and Immigration Modernization Act; H.R.244 - Consolidated Appropriations Act, 2017; H.R.2029 - Consolidated Appropriations Act, 2016; H.R.4796 - USA Act of 2018", "Sen. Chris Coons’ website, McCain-Coons Uniting and Securing America (U.S.A.) Act", "CBS Chicago, Rep. Luis Gutierrez Willing To Fund Border Wall To Protect Dreamers, Jan. 21, 2018", "PunditFact, Did Senate pass immigration bills in 2006, 2013 and House failed to vote on them?, Jan. 26, 2018", "Govtrack.us, H.R. 1625: Consolidated Appropriations Act, 2018", "CBSNews.com, Trump claims he never pushed GOP to pass immigration bill, contradicting previous tweet, June 30, 2018", "Dallasnews.com, House overwhelmingly rejects immigration bill despite Trump's call to pass it, June 27, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]