["A viral image circulating on Facebook purports to show dozens of vehicles headed to Washington, D.C., to protest election results.", "\"Caravans from all over the Nation headed to DC for Jan. 6th protest ... 10 million people are expected,\" reads a Jan. 3 Facebook post with over 2,000 shares. Accompanied with the text is a photo of vehicles waving Trump and American flags.", "\"These great patriots are heading to DC to support our President Trump on January 6,\" one user wrote on Jan. 2 along with the image.", "USA TODAY reached out to the users for comment.", "Fact check:Wisconsin bill does not decertify results and give Trump the win", "A reverse Google image search reveals that the photo purporting to show cars heading to Washington is actually a truck rally in support of President Donald Trump that took place in October in San Francisco.", "The photo was captured by Matt Boone of San Francisco radio station KCBS Radio and appears in an article published on Oct. 24, \"Thousands show up for Bay Area truck rally in support of President Trump.\"", "The parking lot of a local mall was filled with American flags, Trump flags and some Confederate flags, KCBS reported. Organizers estimated that 2,000 to 3,000 vehicles showed up in the Bay Area for the rally.", "The gathering was the group's second Tri-Valley Trump truck rally in the Bay Area. A similar demonstration was held in late September with large turnout, according to Patch.", "Fact check:False news report indicates Biden plans to step down as president-elect", "In Washington, thousands of Trump supporters are expected to protest on Jan. 6 as Congress formally declares Joe Biden as president-elect, USA TODAY reported. The National Park Service confirmed that three protests have been awarded permits, which would allow 15,000 protesters.", "There are no reports or images of trucks at the protests taking place in Washington.", "Fact check:Trump pressured officials in Georgia to recalculate state's vote in his favor", "The image claiming to show a caravan of Trump supporters heading to Jan. 6 protests in Washington is FALSE, based on our research. The photo shows a pro-Trump truck rally from October in San Francisco.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]