["In the months since former Vice President Joe Biden tapped Sen. Kamala Harris to be his running mate, the prosecutor-turned-senator has become a household name.", "Her success, though, has also rekindled recognition for another woman: Charlotta Bass.", "A post on Facebook seeks to counter claims that Harris is the first Black woman to run for vice president.", "\"How Can Harris Be The 1st Black Woman to Run for VP? or Person of Color?\" the post reads. \"MEET Charlotta Bass.\"", "It describes her as \"an activist and journalist\" who \"became the first Black woman to run for vice president in the United States in the 1952, running on the Progressive Party ticket.\"", "\"YOU CAN'T CHANGE HISTORY TO FIT THE NARRATIVE,\" it concludes.", "The user who wrote the post did not respond to a request from USA TODAY for comment.", "Bass was born in South Carolina in 1874, less than a decade after the abolition of slavery. She later moved to Rhode Island and enrolled in the women's college adjunct to Brown University.", "But her barrier-breaking career began in Los Angeles in 1910.", "At first, she sold subscriptions for a local newspaper, the California Eagle. But when its founder was on his deathbed, he asked her to take over the publication.", "She agreed, and hired an accomplished editor – Joseph Blackburn Bass, whom she later married – to help. They ran the paper together until he died in 1934, at which point she ran the paper on her own. That made her the first Black woman to own and operate a newspaper in the United States.", "It wasn't just any newspaper, either; by the 1930s, the California Eagle was the largest African American paper on the West Coast. Bass used the paper to push for reforms against police brutality, restrictive housing, and the Ku Klux Klan.", "She was also active in the NAACP, the Urban League, the Civil Rights Congress and the Universal Negro Improvement Association.", "She sold the California Eagle and dedicated herself to activism full time in 1951. Bass co-founded the Sojourners for Truth and Justice, which brought together Black women to rally and lobby politicians in Washington, D.C.", "And in 1952, she became the vice presidential candidate for the Progressive Party, on the ticket alongside lawyer Vincent Hallinan.", "In the speech to accept her nomination, Bass declared, “This is a historic moment in American political life. Historic for myself, for my people, for all women.\"", "\"For the first time in the history of this nation a political party has chosen a Negro woman for the second-highest office in the land,\" she said.", "That November, Republican Dwight Eisenhower won in a landslide over Democrat Adlai Stevenson. Hallinan and Bass came in third, with roughly 140,000 votes.", "But winning was never the point – after all, Bass campaigned with the slogan, “Win or Lose, We Win by Raising the Issues.”", "The connections between Charlotta Bass and Kamala Harris", "In 1952, Bass became the first Black woman to run for vice president. In 2020, Harris became the first Black woman to be a major-party candidate for vice president.", "Martha Jones, a historian at Johns Hopkins University, told The Washington Post that Bass does not take away from Harris.", "“Charlotta Bass is not a detractor,\" Jones said. \"To the contrary, it shows how far we have come.”", "Likewise, Mikki Wosencroft – a great-great-grandniece of Bass – told The New York Times that watching Harris accept the vice presidential nomination gave her \"goosebumps to see how far we’ve come.\"", "There are similarities between the two women's acceptance speeches, too.", "In her speech, Bass remarked, \"I am strengthened by thousands on thousands of pioneers who stand by my side and look over my shoulder – those who have led the fight for freedom – those who led the fight for women’s rights – those who have been in the front line fighting for peace and justice and equality everywhere.\"", "Likewise, Harris opened her speech with the line, \"That I am here tonight is a testament to the dedication of generations before me – women and men who believed so fiercely in the promise of equality, liberty, and justice for all.\"", "Besides, the connections between the two are more than just symbolic.", "Four decades after Hallinan lost his bid for the White House, his son Terence Hallinan won a race to serve as the district attorney of San Francisco. He lasted two terms before he was ousted in 2003 by his former deputy: Kamala Harris.", "Based on our research, the claim that Charlotta Bass was the first Black woman to run for vice president is TRUE. The trailblazing journalist and activist was the vice presidential candidate for the Progressive Party in 1952.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]