["“Special report: Singh Sidhu returns from Pakistan wearing a green turban. Interacting with the media, he said ‘Allah Hu Akbar’ instead of his usual ‘Thoko Taali’ (translation)”. These words along with a photograph of Navjot Singh Siddhu in which he is seen wearing a green coloured turban has gone viral on social media. It has been shared by multiple individual users on Facebook.", "This was first presented as a report by a Twitter account ‘Times Wow‘ which is a parody handle of Times Now.", "खास ख़बर :- पाकिस्तान से हरे रंग की पगड़ी पहन कर लौटे नवजोत सिंह सिद्धू ||मीडिया से रूबरू होते समय \" ठोको ताली \" की जगह बोले \" अल्लाह हूँ अकबर \" || pic.twitter.com/q2t0ougt5f", "— TIMES WOW (@TimesWow) August 19, 2018", "It was posted by the Twitter handle ‘@TimesWow‘ at 5:26 pm on August 19, and at the time of writing this article, it had been retweeted over 1,000 times and ‘liked’ over 2,300 times.", "In the above image, we have shown the difference between the Twitter handles of Times Wow and Times Now. As can be seen, the parody handle has a logo almost identical to that of Times Now. It has replaced ‘N‘ with ‘W‘ and clearly mentions that it is a parody account for entertainment purposes. The Times Now account has a blue tick which indicates that this is the official account of the channel. However, social media users tend to be deceived and are unable to spot the difference.", "The photograph of Sidhu wearing a green turban has a watermark of ANI, which indicates that the photograph has been taken by the news agency. Alt News found that this photo had been posted by ANI at 3:26 pm on August 19 with the message, “If someone (Pak Army Chief General Bajwa) comes to me&says that we belong to the same culture & we’ll open Kartarpur border on Guru Nanak Dev’s 550th Prakash Parv, what else I could do? Navjot Singh Sidhu on hugging Bajwa at Pak PM Imran Khan’s oath-taking ceremony in Islamabad.”", "If someone (Pak Army Chief General Bajwa) comes to me&says that we belong to the same culture & we'll open Kartarpur border on Guru Nanak Dev's 550th Prakash Parv, what else I could do?: Navjot Singh Sidhu on hugging Bajwa at Pak PM Imran Khan's oath-taking ceremony in Islamabad pic.twitter.com/BMXowapA8q", "— ANI (@ANI) August 19, 2018", "Navjot Singh Sidhu was present at the oath taking ceremony of Imran Khan on August 18. Sidhu’s act of hugging the Pakistani Army Chief General Qamar Bajwa has already created a huge controversy. On returning from Pakistan and speaking to reporters, Sidhu had said what has been reported by ANI.", "Spreading disinformation in the garb of news through parody accounts of Times Now has happened earlier as well. There is another parody handle of Times Now called Times How which often posts false information. Many social media users have believed Times HOW‘s posts as real news.", "We have seen on numerous occasions how tweets by parody accounts of news channels are presented as actual news and how social media users are foxed.", "There are a number of examples whereby tweets by Times HOW were construed as real and shared by social media users. Some months back, a parody account of ANI was spreading disinformation on social media. The account was suspended by Twitter after it was reported by ANI editor Smita Prakash.", "This is a fake handle, peddling fake news under the garb of 'parody'. He/She is illegally using ANI pix as well as mirroring the logo of @ANI & @ani_digital . @TwitterIndia I hope you expand your scope of cracking down on fake news like @facebook is doing https://t.co/LQAnjuqgCt", "— Smita Prakash (@smitaprakash) April 30, 2018", "Therefore, it is perplexing as to why Times Now hasn’t taken any action against these parody handles who are putting out misinformation by impersonating their brand. Times HOW has managed to hoodwink even sections of mainstream media. News channels are at the very least expected to complain against parody accounts posting fake news in their name.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]