["After the results of the assembly elections in five states were announced on December 11, a message began circulating on multiple social media platforms and WhatsApp. It was claimed to be the observation of an ‘author’ of The New York Times, the popular American newspaper. The message was presented as an analysis of the recently concluded assembly election by this ‘author’. The complete message is as follows:", "*New York Times news…….*  *…Few lessons from Indians voting pattern are clear*", "– Indian public does not understand Fiscal deficit & are not bothered whether it is 2.4% or 3.4%. They do not understand that subsidies & Freebees mean borrowing & borrowing have to be paid one day by someone.", "Indian public also not bothered about GDP rate it increasesed from 3.8 to 7.4 from last four years which is more then USA, UK , japan…..", "– Indian public will always complain. If it is not about price of Onions or Thur Dal, it will be about Petrol or Diesel. They must get everything cheap but at the same time Farmers must get good price", "– Don’t ask Indian public to change old habits. It is Govt’s job to change everything", "– Indian public is not bothered about fixing long term issues. They want it today. Not even today. NOW.", "– Indian public has short memory & narrow vision. They forget & forgive pasts.", "-they intextualy vote as per cast pattern…. Castisum is major enemy for Indian politics which divides indian youth from growth… And PaK and chine pramote castisum in India with help of there own native peoples because both directly depends on India for open market..GDP…..", "Indian defence system are more stronger as compared to last five years and PaK and gulf countrys are not able to ruled on India…thier for they fundings in billion to destroy Indian system and only Modi is fight against them……but Indian don’t know this..", "If Mr. Modi continues fixing long term problems for remaining 5 months, he will loose 2019. A dead soldier can not do anything for country. He must live to comeback for next 5 years. Now he must become a politician for remaining 5 months. If Public wants cheap Petrol & Diesel give to them. If farmers want loan waiver, give it to them,", "They don’t know about sabka sath sabaka vikas", "We advise to Mr. Modi will be to apply for 5 month’s leave from being statesman & become politician. After 2019 victory back to being statesman because India can only grow under statesman Modi & not Politician Modi.", "—-By New York Times author", "The message seeks to build a wave of sympathy for Prime Minister Narendra Modi and the Bharatiya Janata Party. It denigrates Indian citizens for having a “short memory and narrow vision”, for failing to recognize the need to “fix long term issues” which PM Modi is successfully doing.", "Renuka Jain, who is followed on Twitter by Prime Minister Narendra Modi, posted this message on her Facebook page on December 14.", "Several individual users too have posted this message on their timelines.", "The identical nature of the text in all these messages suggest that it has been uploaded from WhatsApp where it has been shared heavily.", "The write-up attributed to a New York Times author, not only doesn’t specify the name of the author, but is also replete with spelling and grammatical errors. For example, the word ‘increased‘ has been spelled as ‘increasesed‘, ‘their‘ is spelled as ‘thier‘, ‘promote‘ as ‘pramote‘, and so on. This was the initial indicator that this was possibly a fake message that was being circulated.", "Alt News found that there is no such article on The New York Times listing out the contents of the viral message. A search on the website of the newspaper with the key words ‘Narendra Modi’ revealed that the most recent article about PM Modi is of December 11, when the result of the assembly elections was declared. Titled ‘Modi’s Party Is Trounced in India’s ‘Semifinal’ Elections’, the factors listed out in the article for the BJP’s recent defeat do not even remotely match the contents of the viral message. Instead, the article talks of farmer distress, inflation and cow vigilantism as the causes of the defeat, among others.", "Such messages extolling the virtues of PM Modi are not a new phenomenon. Earlier, Alt News had busted the myth about a bureaucrat claiming that PM Modi works 18-20 hours in single day. In another instance, Alt News had revealed how an emotional post praising PM Modi was falsely attributed to Arnab Goswami. Messages like these seek to inject credibility to false and motivated claims by appropriating the name of a globally renowned publication like The New York Times.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]