["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Facebook was but a gleam in a Harvard student’s eye the last time Paul Sadler held public office. But the former Democratic state legislator embraced the social networking site’s political potential after he declared his candidacy to succeed the retiring U.S. Sen. Kay Bailey Hutchison late last year.\n\nAnd on Jan. 27, 2012, Sadler posted this Facebook update: \"In the time I worked on education issues, we passed 3 pay increases for teachers and provided them with health insurance.\"\n\nTeachers got all that in Sadler’s legislative era? We wondered.\n\nSadler, a lawyer who works with the Wind Coalition energy advocacy group, won election to the Texas House on Nov. 6, 1990. For 12 years, he represented the East Texas district around Henderson, and for eight years he chaired the House Public Education Committee. Also, in 1997 and 2001, he headed committees on taxes and public school financing. During his legislative tenure, he also served on and chaired committees on health insurance for teachers and other education subcommittees.\n\nIn response to our inquiry, Sadler campaign spokesman Jeff Rotkoff told us that in 1995, Sadler helped lead an overhaul of state education laws that tied teacher pay hikes to increases in state education aid, which brought raises in 1997 and 1998. And in 1999, Rotkoff said, Sadler sponsored a $3,000-a-year pay raise for teachers.\n\nIn 2001, Rotkoff said, Sadler wrote a proposal that created a health insurance program for school employees.\n\nSeparately, we confirmed that:", "So, multiple raises accounted for.\n\nAnd what about Sadler’s claim about \"providing\" teacher health insurance?\n\nIn 2001, Sadler authored House Bill 3343, the \"Texas School Employees Uniform Group Health Coverage Act\" (that’s TSEUGHCA, if you speak Gaelic), which was signed into law June 15, 2001. It created the TRS-ActiveCare program, a state-managed insurance pool.\n\nAt the time, most districts offered insurance plans to their employees, including teachers, according to an August 2000 TRS study. Texas Education Agency data show teachers made up about half of school employees in 2000.\n\nThe TRS study says, though, that only 38 percent of about 535,000 Texas public school employees had coverage comparable to that of state employees. Some 50 percent had insurance that did not compare favorably to state coverage, and 12 percent of employees did not sign up for district-offered coverage, the study says.\n\nOnly 350 employees in 17 of the state’s 1,000-plus districts were offered no coverage at all, the study says.\n\nSadler told us his 2001 proposal was intended both to extend coverage to all school employees and to raise the quality of coverage so that all employees had access to comparable insurance.\n\nAccording to a 2001 report by the nonpartisan House Research Organization, the 1991 Legislature had directed school districts to give employees coverage equivalent to that of state workers, but the law lacked enforcement provisions.\n\nGregg told us in interviews that the 2001 TRS-ActiveCare program was created to acquire and administer group insurance from a third party, and the law also gave all teachers $1,000 per year toward its cost. Association of Texas Professional Educators lobbyist Josh Sanderson told us via email that the $1,000 stipend was intended to be an annual payment but was cut to $500 in 2003 for full-time teachers and then, in a 2006 special session, rolled into a $2,500 raise in educators’ pay.\n\nAccording to a May 2002 guide to the law produced by the Legislative Budget Board, after the first sign-up deadline of Sept. 30, 2001, small districts and other entities employing a total 147,000 people had joined TRS-ActiveCare. Larger districts were added later, though not all chose to participate.\n\nCurrently, Texas State Teachers Association spokesman Clay Robison told us by email, all Texas teachers have access to insurance comparable to state employees’. ActiveCare covers more than 445,000 employees and dependents, he said, and 89 percent of eligible districts and similar education entities participate in the program. Austin and Houston are examples of large districts that have their own health plans, he said.\n\nSadler said that although nearly 40 percent of school employees had comparable coverage before 2001, he believes such accounting doesn’t give an accurate picture of the 2001 law’s impact. He said he didn’t remember the 1991 mandate that districts offer comparable coverage, but it obviously had little effect.\n\nOf his work on teacher pay raises and insurance, Sadler said, \"I know it changed the landscape.\"\n\nTeacher lobby groups have hailed Sadler’s advocacy.\n\nIn a Dec. 2, 2001, Statesman news story, TSTA director of governmental relations Jay Levin credits Sadler with helping to bring about the 1999 raise of $3,000 and the health insurance program for teachers. Robison told us it’s fair for Sadler to claim credit for the pay raises and insurance initiative because he chaired the public education panel through those years. Gregg likewise said Sadler merits a goodly share of the credit. \"Sadler was the leading proponent for pay increases and later health insurance for educators,\" Gregg said.\n\nOur ruling\n\nSadler played a pivotal role in ensuring several teacher pay raises and also was key to lawmakers giving school workers including teachers access to insurance benefits equal to those accorded state employees.\n\nHowever, contrary to Sadler’s Facebook wording, the latter development did not provide teachers with insurance. Nearly every Texas teacher had access to some kind of coverage before the 2001 action. Still, the Sadler-authored change gave every school employee access to insurance equivalent to state workers’ coverage.\n\nWe rate Sadler’s claim Mostly True.", "Facebook company timeline, facebook.com, accessed February 16, 2012\n\nAustin American-Statesman blog post, \"Democrat Paul Sadler enters U.S. Senate race,\" December 19, 2011\n\nSadler for Senate page on Facebook.com, status update, January 27, 2012\n\nWind Coalition press release, \"The Wind Coalition Announces New Role for Paul Sadler,\" February 7, 2012\n\nEmail interview with Wind Coalition associate director Lindsey Hughes, February 9, 2012", "Legislative Reference Library of Texas web page, \"Member profile\" of Paul Sadler, accessed February 16, 2012\n\n\"Texas State Directory,\" 1991-2003 editions\n\nEmail interviews with Jeff Rotkoff, political consultant to Sadler campaign, February 1-16, 2012\n\nSenate Bill 1, 74th Texas Legislature, www.legis.state.tx.us\n\nEmail and telephone interviews with Association of Texas Professional Educators director of governmental relations Brock Gregg, February 10-14, 2012\n\nEmail interview, Texas Education Agency information specialist DeEtta Culbertson, February 14, 2012\n\nEmail and telephone interviews with U.S. Senate candidate Paul Sadler, February 9-15, 2012\n\nSenate Bill 4, 76th Texas Legislature, www.legis.state.tx.us\n\nAustin American-Statesman news story, \"Education bill praised by some as more equitable plan for poorer districts,\" May 31, 1999\n\nHouse Research Organization report, \"Summary of SB 4: School Finance and Property Tax Relief,\" June 4, 1999\n\nHouse Bill 3343, 77th Legislature, www.legis.state.tx.us\n\nTeacher Retirement System web site, \"TRS-ActiveCare Introduction,\" accessed February 16, 2012\n\nTexas Education Agency Snapshot 2000, \"District Size\" table, accessed February 16, 2012\n\nTelephone and email interviews with Teacher Retirement System director of government relations Ray Spivey, February 13-15, 2012\n\nTeacher Retirement System of Texas, \"1999-2000 Certification Report and Comparability Study,\" August 2001\n\nHouse Research Organization, \"Teacher Health Insurance: The Multibillion Dollar Question,\" February 23, 2001\n\nEmail interview with Association of Texas Professional Educators lobbyist Josh Sanderson, February 15, 2012\n\nTexas Education Agency, \"Frequently Asked Questions: House Bill 1,\" August 24, 2006\n\nLegislative Budget Board, \"Guide to the Texas School Employees Uniform Group Health Coverage Act (House Bill 3343),\" May 2002\n\nEmail interviews with Texas State Teachers Association public affairs specialist Clay Robison, February 9-14, 2012\n\nAustin American-Statesman news story, \"Sadler will not return to House,\" December 2, 2001", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]