["Motorcyclists from around the country converged on Sturgis, South Dakota, for the town’s annual motorcycle rally in August — most unmasked and ignoring social distancing guidelines. Some on social media are claiming the event had little effect on the spread of COVID-19.", "“Mass testing of Sturgis workers, residents result in no more positive results % than the rest of the state average,” a screenshot of a post reads. “Actually on the low end of the scale. All positive cases were asymptomatic.\"", "The post goes on to say the South Dakota Department of Health is allegedly attributing 88 positive tests to the rally, and that with 450,000 rally attendees, that’s a 0.02% infection rate.", "The screenshot has been shared by Facebook group Bikers for Trump and multiple individuals. That group did not respond to USA TODAY’s request for comment and clarification.", "Fact check:Cloth masks ineffective against wildfire smoke, still slow spread of COVID-19", "The post doesn't quite get the facts right – or the math. South Dakota confirmed 124 COVID-19 cases tied to the Sturgis Rally as of Sept. 8, and other states have reported at least 290 people in 12 states testing positive after attending the rally. About 460,000 people attended the rally. The infection rate based on the above numbers is 0.09%, found by dividing 414 (South Dakota's cases plus the other states' cases) by 460,000, and multiplying that by 100. If there had been just 88 cases, the infection rate would have been 0.02%, as the original poster said.", "A recent study found the rally could have resulted in 260,000 cases. But the study has been criticized and faced some questions about its conclusions and methodology and it is not yet peer-reviewed.", "As of Sept. 8, the South Dakota Department of Health reported 124 cases among South Dakota residents who got sick after attending the rally, the Argus Leader reported. State health officials have tracked those cases through contact tracing.", "The Associated Press reported that at least 290 people in 12 states have also tested positive since attending the rally.", "One person has died so far from COVID-19 who attended the rally, a Minnesota man in his 60s with underlying health conditions, Minnesota Department of Health Infectious Disease Director Kris Ehresmann said at a briefing on Sept. 9.", "If there had been just 88 cases connected, that would be an infection rate of 0.02%, as the claim purports. The correct figure from the South Dakota Department of Health and other states’ reports together make up an infection rate of 0.09%.", "More:Study says sturgis bike rally was a 'super-spreader' event, led to 260,000 COVID-19 cases", "But Robert J. Kim-Farley told USA TODAY that’s likely \"the tip of the iceberg.\"", "Kim-Farley, a professor of epidemiology and community health sciences at the UCLA Fielding School of Public Health, told USA TODAY that COVID-19 is a particularly difficult virus to trace to its infection point. Symptoms might not show up for weeks, if at all, in an infected person. That person could be spreading the virus without knowing.", "The state's cumulative test positivity rate is 8.6%, and its positivity rate in the last two weeks is 10.4% as of Sept. 17, according to the state's data.", "Fact check:False claim that FEMA offers hazard pay because of pandemic", "A California research group set out to estimate the impact of a single COVID-19 “super-spreader” event – and in the case of the Sturgis Rally, the impact was large.", "The study, released by the Center for Health Economics and Policy Studies at San Diego State University, estimates that 266,796 COVID-19 cases across the country in the month following the Sturgis Motorcycle Rally can be traced back to the event, which took place from Aug. 7-16. That figure is 19% of the 1.4 million COVID-19 cases between Aug. 2 and Sept. 2.", "The researchers used cellphone data to identify areas that saw a large number of rally-goers and tracked cases both before and after the event, the Argus Leader reported.", "More:South Dakota dismisses 'elite class of so-called experts,' carries on with state fair after Sturgis rally fueled COVID-19 surge", "Both South Dakota’s governor and secretary of health have criticized the study, the Argus Leader reported.", "\"Under the guise of academic research, this report is nothing short of an attack on those who exercised their personal freedom to attend Sturgis,” Kristi Noem, governor of South Dakota, said in a statement. \"Predictably, some in the media breathlessly report on this non-peer reviewed model, built on incredibly faulty assumptions that do not reflect the actual facts and data here in South Dakota.\"", "\"I would just caution you about putting too much stock into models ... that can't be verified by other factual numbers,\" Kim Malsam-Rysdon, the state’s secretary of health, said in reference to the study. \"I think that is the case with that particular white paper.\"", "Fact check:CDC's data on COVID-19 deaths used incorrectly in misleading claims", "South Dakota state epidemiologist Josh Clayton was critical of the study, noting it is not yet peer-reviewed.", "\"The results do not align with what we know for the impacts of the rally,\" Clayton said Sept. 8.", "He also told the Washington Post that the study doesn’t account for an already-increasing trend of case counts in South Dakota or that school reopenings might have contributed to the rise.", "Independent experts were wary of the study’s scope, too. Devin Pope, a professor of behavioral sciences and economics at the University of Chicago, told USA TODAY that while he thinks the study uses reasonable methods, it’s likely that the numbers are heavily overstated.", "More:First COVID-19 death linked to massive Sturgis biker rally; cases reported across the nation", "The study uses a synthetic control, which means the researchers looked for other locations around the U.S. that are similar to the focus of the study, tracing what those counties’ trajectories looked like before and after the Sturgis Rally. But in order to avoid a spillover effect, bordering states were excluded, which Pope said could drastically change the numbers.", "“In their current study, I don't think they have a problem with spillover effects because they exclude them by design, but by excluding those areas, they're also making their synthetic control not as good,” he said. “And so there's a tradeoff there between having spillover effects potentially kind of influence the results, but also having a better control.”", "The researchers have stood by their work.", "\"We stand by the entirety of our coronavirus research,\" Dhaval Dave, one of the researchers, told NBC News. \"We used publicly available data that other researchers have used, including the CDC (Centers for Disease Control and Prevention). These are not forecasting exercises.\"", "Fact check:Tuberculosis is more dangerous than COVID-19, but context matters", "We rate the claim that the Sturgis Motorcycle Rally led to 88 positive tests attributed to the rally, which is a 0.02% infection rate among attendees, as FALSE because it was not supported by our research. The state of South Dakota has attributed 124 cases in the state to the rally. The Associated Press reported that at least 290 people in 12 states who attended the rally have also tested positive. Taken together, that's an infection rate of 0.09%.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]