["About this rating", "A popular story that has been in circulation online since at least 2010 is one that involves long-haired Native Americans serving as scouts in the Vietnam War. The earliest mention of the tale we found was an 8 December 2010 post from the self-described “Indiana Jones of the superfoods and longevity universe,” David ‘Avocado’ Wolfe.", "As the story goes, a woman married to a Veterans Affairs medical hospital psychologist caught wind (via her husband) of top secret information about how the military recruited scouts on Native American reservations for the Vietnam War. But once the scouts' hair was cut to regulation military length, they lost their preternatural tracking skills. Later tests showed that long, flowing hair was an essential component of those skills:", "It seems that during the Vietnam War special forces in the war department had sent undercover experts to comb American Indian Reservations looking for talented scouts, for tough young men trained to move stealthily through rough terrain. They were especially looking for men with outstanding, almost supernatural, tracking abilities. Before being approached, these carefully selected men were extensively documented as experts in tracking and survival ...", "Once enlisted, an amazing thing happened. Whatever talents and skills they had possessed on the reservation seemed to mysteriously disappear, as recruit after recruit failed to perform as expected in the field.", "Serious causalities and failures of performance led the government to contract expensive testing of these recruits, and this is what was found. When questioned about their failure to perform as expected, the older recruits replied consistently that when they received their required military haircuts, they could no longer 'sense' the enemy, they could no longer access a 'sixth sense', their 'intuition' no longer was reliable, they couldn't 'read' subtle signs as well or access subtle extrasensory information.", "The author of the tale attempted to explain a possible scientific rationale for such an occurrence:", "Hair is an extension of the nervous system, it can be correctly seen as exteriorized nerves, a type of highly evolved 'feelers' or 'antennae' that transmit vast amounts of important information to the brain stem, the limbic system, and the neocortex.", "Not only does hair in people, including facial hair in men, provide an information highway reaching the brain, hair also emits energy, the electromagnetic energy emitted by the brain into the outer environment. This has been seen in Kirlian photography when a person is photographed with long hair and then rephotographed after the hair is cut.", "When hair is cut, receiving and sending transmissions to and from the environment are greatly hampered. This results in numbing-out. Cutting of hair is a contributing factor to unawareness of environmental distress in local ecosystems.", "This story presented two separate areas in need of fact-checking: the historical claim that the United States military recruited Native Americans as scouts during the Vietnam era and later commissioned a study to find out why they were not performing as expected, and the scientific claim that hair functioned as an aid in military scouting activities.", "The historical account given here is dubious at best, and the claim that it stemmed from a \"secret\" project challenges us to prove a negative. Logical fallacies notwithstanding, the confirmable facts are that numerous Native American soldiers served in Vietnam, a large majority of whom volunteered for their service before being drafted and were integrated into regular units, and no historical accounts exist of specialized scouting units composed of long-haired Native American soldiers.", "We reached out to the military regarding the possibility that such a program may have occurred, and F. Lee Reynolds with the United States Army Center of Military History provided us with the following statement:", "We reviewed your request to validate or not validate the story on Native American Scouts in Vietnam. We did not find any information (official or unofficial) here to acknowledge the information is correct so we reached out to our historians with Army Special Forces to see if there was a local program conducted by Special Forces. The response back was that the story is \"pure mythology.\"", "An actual United States military project to recruit scouts from a specific ethnic group did exist, but  the targeted group was Viet Cong defectors recruited to serve as intelligence scouts. This setup makes a good deal more sense relative to the Native American claim, given the Viet Cong’s actual knowledge of the land and its inhabitants.", "The scientific claims are no less dubious. While it is borderline accurate to say that hair plays a role in the nervous system, that does not mean it serves as some sort of “antenna” into the ineffable aspects of our own consciousness. The reality is a bit less grandiose, according to the New England Journal of Medicine:", "The hair follicle acts as a sensory organ and immunologic sentinel for the skin. Hairs detect mechanical stimuli above the surface of the skin, and the slightest bend in a hair activates neuroreceptors in the follicle, relaying important sensory information to the nervous system. The Langerhans’ cells at the opening of the follicle detect surface pathogens and activate the immune system.", "In other words, the two primary functions hair has on a sensory level are to signal physical movement of the hair and to detect pathogens. In both cases, however, it is not the hair itself that is talking to the nervous or immune systems, but the cells of the follicle to which the hair is attached. It is unclear how the subtle movement of one’s hair or the ability to detect pathogens via the scalp would have any bearing on scouting in the Vietnam War.", "The original article on this subject went on to claim that hair both emits and receives electromagnetic signals to and from the brain:", "Not only does hair in people, including facial hair in men, provide an information highway reaching the brain, hair also emits energy, the electromagnetic energy emitted by the brain into the outer environment. This has been seen in Kirlian photography when a person is photographed with long hair and then rephotographed after the hair is cut.", "When hair is cut, receiving and sending transmissions to and from the environment are greatly hampered. This results in ‘numbing-out’.", "The notion that hair emits electromagnetic energy is demonstrably false. Hair is a terrible conductor of electricity and is actually comparable in electrical resistivity to rubber, which commonly used to protect against the flow of an electric current. Other less well-defined terms such “intuition” are harder to refute, but it should be noted that not a single version of this story provided any sort of mechanism outside of the implausible and vague notion of electromagnetic signals.", "Kirlian photography, the only piece of “evidence” provided for the nebulous claim of hair as an intuition antenna, is a common topic on new age, alternative health, and metaphysical websites. In broad terms, it is a collection of techniques used to photograph an electric field, which new age and alternative health practitioners sometimes describe as an “aura” that is medically or spiritually informative.", "Science finds no support for such a claim, however. Any differences in a before/after photographs of hair would almost certainly represent nothing more than the moisture content of the hair or lack thereof, as later studies into the topic revealed.", "As Native American writer and creator of the blog “Native Skeptic” Noah Nez wrote on a post for the Center for Inquiry, hair plays an important role in many tribes' religious beliefs, but those views have often been co-opted by various New Age movements:", "Close investigation into various tribal beliefs might help explain the origin of this story. Though Native American legends and belief systems do incorporate terms for the supernatural, they do not use phrases found in New Age mysticism like “aura” or “sixth sense\" ... While there might be some variability in the details regarding the reasons for long hair from tribe to tribe, there is one major component that has remained consistent: long hair has never been about aesthetics but instead is a religious concern.", "This fanciful tale relies on the unsourced and unverifiable claim from a website that frequently peddles highly shareable stories having little to no scientific legitimacy, and it appears that the tale of long-haired Native American scouts in Vietnam belongs to that genre. Not a single piece of historical evidence supports the claims of Native American scout recruitment by the U.S. military, and no scientific evidence that holds up to any level of scrutiny supports  the idea of heightened intuition resulting from longer hair.", "davidwolfe.com.   \"“Hair Is an Extension of the Nervous System” – Why Native Americans Keep Their Hair Long.\"\r\n    15 November 2015.", "U.S. State Department, Office of the Historian..   \"National Security Act of 1947.\"", "LeMay, Konnie.   \"A Brief History of American Indian Military Service.\"\r\n    Indian Country Media Network.   28 May 2012.", "Nez, Noah.   \"Geronimo’s Hair.\"\r\n    Committee for Skeptical Inquiry: Skeptical Briefs.   Summer 2012.", "Pehek, J.O. et al.   \"Image Modulation in Corona Discharge Photography.\"\r\n    Science.   15 October 1976.", "Pilkington, Mark.   \"Bodies of Light.\"\r\n    The Guardian.   4 February 2004.", "Feughelman, M.   \"The Physical Properties of Alpha-Keratin Fibers.\"\r\n    Journal of the Society of Cosmetic Chemistry.   December 1982.", "Paus, R., and G. Cotsarelis.   \"The Biology of Hair Follicles.\"\r\n    New England Journal of Medicine.   August 1999.", "loc.gov.   “Veteran’s History Project.” \r\n    Accessed 6 December 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]