["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There was a malfunction with Trump’s microphone during the first general election debate in 2016 that the Commission on Presidential Debates said affected the “sound level in the debate hall,” but not for viewers at home.", "We found no evidence that the group sent him an apology letter.", "The nonprofit organization did not admit to any deliberate tampering, nor did it publicly apologize to Trump over the issue.", "After refusing to participate in a virtual debate, President Donald Trump continued to wage a war with the Commission on Presidential Debates, saying that the group chooses biased moderators and that it apologized after tampering with his microphone when he debated Hillary Clinton in 2016.", "In an Oct. 8 phone interview with Fox News host Sean Hannity, Trump resurfaced his unfounded claim that the commission interfered with his microphone during the 2016 presidential debates, when he faced off against Hillary Clinton, and said the group wrote him an apology letter at the time.", "\"Now you have this debate commission is a joke. The commission's a joke,\" Trump told Hannity. \"Take a look at the letter they wrote me four years ago, when they apologized. They were oscillating my mic. They were turning it up and down when I was speaking to Hillary, crooked Hillary.\"", "We found no evidence the commission sent Trump an apology letter in 2016 due to what happened with his mic.", "The only letter we find referenced in 2016 news archives involving Trump and the commission is one from the NFL that it denied sending.", "When we reached out to the Trump campaign and the White House for evidence of this letter, we did not hear back.", "Trump first raised issues about what he said was a \"defective mic\" during the first general election debate in 2016. He suggested the malfunction may have been deliberate. Later, in 2019, Trump repeated the claim and said the commission was \"forced to publicly apologize.\"", "The commission, a nonprofit that sponsors the presidential debates, did not publicly apologize. It acknowledged in a short, one sentence statement four days after the debate that \"there were issues regarding Donald Trump’s audio that affected the sound level in the debate hall.\" The malfunction was confined to the room, and did not affect Trump’s audio for the 84 million people who watched the debate on TV.", "A contemporaneous report by the New York Times noted that there was \"no evidence of sabotage,\" but said the commission released no other information about the malfunction, including how it was discovered or what equipment was to blame.", "PolitiFact contacted the commission about the issue, and asked whether it sent Trump an apology letter. We did not hear back.", "In a February 2019 CNN op-ed, two of the three co-chairs for the commission — Frank J. Fahrenkopf, former chairman for the Republican National Committee, and Dorothy S. Ridings,  former journalist and president of the League of Women Voters — wrote that the organization is \"run by an independent board made up of independents, Republicans and Democrats. It receives no party or government funding, and no major party official serves in any capacity with the CPD.\"", "President Trump said that the Commission on Presidential Debates wrote him an apology letter in 2016 over oscillating his microphone during the first general election debate against Hillary Clinton.", "The organization released a one-sentence statement that noted that there was an issue with Trump’s audio that affected the sound level in the debate hall, but not his audio for Americans who watched the debate on TV.", "The group was not forced to publicly apologize for the malfunction and we found no evidence that it sent Trump a letter doing so.", "Trump’s claim is unsubstantiated. We rate it False.", "YouTube, Interview: Sean Hannity Interviews Donald Trump Live Via Telephone, Oct. 8, 2020", "YouTube, Interview: Maria Bartiromo Interviews Donald Trump on Fox Business, Oct. 8, 2020", "Twitter, Donald Trump tweet, Oct. 9, 2020", "CBS News, NFL denies sending Donald Trump letter over presidential debates, July 31, 2016", "George Washington University, Steve Scully biography, Accessed Oct. 9, 2020", "FactCheck.org, Trump Renews Unfounded Claim on Debate Mic, Dec. 16, 2019", "New York Times, Actually, a Malfunction Did Affect Donald Trump’s Voice at the Debate, Sept. 30, 2016", "CNN, This is how presidential debates actually work, Feb. 8, 2019", "Commission on Presidential Debates, Statement about first debate, Sept. 30, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]