["About this rating", "An image of a purported 1998 letter from actor Sean Connery (famous for his portrayal of agent James Bond) to Apple CEO Steve Jobs, caustically rebuffing an offer to become a pitchman for Apple Computers, hit the Internet in June 2011.", "Despite the letter's seeming verisimilitude, it was merely a bit of humor created as an accompaniment to an article published on the satirical site Scoopertino, which spoofs on all things Apple under the motto \"All the News That's Fit to Fabricate\".", "Scoopertino's 19 June 2011 article entitled \"EXPOSED: The iMac disaster that almost was\" purported to offer a (fictional) episode from Apple's history, taken from the (equally fictional) book iMaculate Conception: How Apple's iMac Was Born, in which Apple CEO Steve Jobs supposedly sought to boost flagging holiday sales by soliciting actor Sean Connery to lend his name and visage to a 1998 Apple Christmas ad campaign:", "As [former Apple marketing executive Frederica] Woods spins the tale, it was just weeks before iMac's first Christmas in 1998 when slowing holiday sales rang the alarm in the CEO's office.", "Steve Jobs, a lifelong fan of James Bond (he'd originally wanted to name the revolutionary computer \"Double-O-Mac\"), instructed his agency to begin work on a special celebrity Christmas ad featuring 007 himself, Sean Connery — even though Connery had yet to be signed.", "\"The ad was of dubious quality, clearly not one of the agency's finer moments,\" says Woods.", "The article noted that \"Connery's final rejection was accompanied by a note revealing one mightily peeved film star,\" as revealed in the fabricated letter reproduced above.", "Other spoofs from Scoopertino include \"Madame Tussauds opens Apple iChamber of Horrors,\" \"Bill Gates predicts 'Apple Rapture': all Macs to explode in 2012,\" and \"VATICAN SHOCKER: Cardinals tap Siri as next pope.\"", "Acierno, Louis J. \"The History of Cardiology.\"\r\n   Parthenon Publishing Group. 1994. ISBN 1-85070-339-6 (pp. 469-476).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]