["About this rating", "In early August 2020, Snopes readers asked whether an photograph really showed evangelical Christian leader Jerry Falwell, Jr. holding a drink and standing next to a woman, both of them with their pants unzipped:", "The picture is real, as Falwell himself has confirmed it. He originally posted the photograph to, and then deleted it from, Instagram.", "The image drew immediate criticism from many quarters. Falwell is president of the private, evangelical school Liberty University in Lynchburg, Virginia, where students \"are told to dress 'modestly' and are banned from consuming media that feature nudity or sexual content.\" The photograph prompted U.S. Rep. Mark Walker, R-North Carolina, a former instructor at Liberty, to demand Falwell's resignation:", "Falwell apologized for posting the picture. Speaking to Lynchburg radio station WLNI, he explained how the photograph came about: Describing the woman in the image as his wife's assistant (he didn't name her), Falwell said the picture was meant as a joke.", "\"She's pregnant, so she couldn't get her pants zipped,\" Falwell said. \"I had on a pair of jeans that I haven't worn in a long time, so I couldn't get mine zipped either. And so I just put my belly out like hers.\"", "The governing board of Liberty University wasn't laughing at the joke. Falwell agreed to take an \"indefinite leave of absence\" from his role as university president upon the request of the university's board.", "Downen, Robert.   \"Jerry Falwell Jr. Explains What Was Going On in That Now-Deleted Instagram Photo.\"\r\n    Houston Chronicle. 5 August 2020.", "WLNI-TV.   \"Jerry Falwell Jr. Addresses Deleted Unzipped Pants Instagram Photo with WLNI.\"\r\n    6 August 2020.", "Rankin, Sarah.   \"Liberty University’s Falwell Taking Leave of Absence.\"\r\n    Associated Press.   7 August 2020.", "Armus, Teo.   \"Jerry Falwell Jr. Said a Racy Photo Was 'In Good Fun.' A GOP Lawmaker Says He Should Resign.\"\r\n    The Washington Post.   7 August 2020.", "Associated Press.   \"Liberty University President Urges: 'End Those Muslims' Via Concealed Gun Carry.\"\r\n    5 December 2015.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]