["The three-minute, four-second video was published in this Facebook post on September 2, 2019. It has been viewed more than 200 times.", "Below is the screenshot of the misleading Facebook post:", "The Indonesian-language caption translates to English as: “This morning, on September 2, 2019, in the Land of the Bird of Paradise… the people of Papua unify and clamorously welcome Ustadz Abdul Somad (UAS). When the President of the Republic of Indonesia himself doesn’t come and visit Papua, so it is seen that Ustadz Abdul Somad (UAS) brings serenity to those who welcome him and as if he is a cure for peacefulness to those whose hearts want to be independent from the grip of the mafia's regime until the people of the Papua feel the independence.”", "“Ustadz” is a title given to a Muslim preacher. Ustadz Abdul Somad, better known by his initials UAS, is a popular Muslim preacher in Indonesia.", "“The Bird of Paradise”, or cenderawasih, is a bird native to the island of Papua, as explained in this article published on the Indonesia’s Environment and Forestry Ministry website.", "“The Land of the Bird of Paradise” is a nickname given to Indonesia’s Papua region.", "A series of demonstrations and violence have rocked Papua since August 2019. AFP has reported on the recent unrest here and here.", "The video was also published alongside on Facebook here, and on YouTube here with a similar claim.", "The video is being shared in a misleading context; it was filmed during Abdul Somad’s visit to Papua in 2018.", "A high-definition version of the video, which is also three minutes and four seconds long, was published in this Facebook post on September 22, 2018.", "The Indonesian-language caption translates to English as:\n\t“Picking up Ustad.Abdul Somad (UAS)\n\tWELCOME UAS TO SORONG WEST PAPUA.”", "Sorong is a city in Indonesia’s West Papua province.", "Below is a screenshot comparison between the video in the misleading post (L) and the genuine video (R):", "This Instagram post, dated September 22, 2018, shared a photo of Abdul Somad receiving a traditional hat.", "Ustadz Abdul Somad, Lc. MA dipasangkan topi Cenderawasih oleh Kepala Suku Moi saat acara penyambutan di Bandara Domine Eduard Osok, Kota Sorong, Papua Barat pagi ini (Sabtu, 22/9/2018) Dalam acara ini, juga dilaksanakan \"injak piring\" sebagai salah satu tradisi dalam menyambut tamu kehormatan di Papua Barat.", "A post shared by  Tafaqquh Online (@tafaqquhonline) on Sep 21, 2018 at 4:51pm PDT", "The first paragraph of the Instagram post's Indonesian language caption translates to English as: “Ustadz Abdul Somad, Lc. MA received a cendrawasih hat from the Moi tribal chief during a welcome ceremony at Domine Eduard Osok airport, Sorong city, West Papua, this morning (Saturday, September 9, 2018).”", "The scene captured in the photo, shown below (R), can also be seen at the 1:17 mark in the misleading Facebook video (L):", "Abdul Somad’s arrival at the Sorong airport was also reported in this article published by Indonesian media outlet Tribunnews on September 22, 2018.", "The first three paragraphs translate to English as: “Ustaz Abdul Somad, Lc.MA on Saturday (22/9/2018) arrived in Sorong, West Papua.", "“Ustaz Abdul Somad arrival in Sorong, Papua is welcomed with enthusiasm by local residents.", "“During the welcome ceremony at Domine Eduard Osok Airport in Sorong, West Papua, Ustaz Abdul Somad received a Cendrawasih hat from the Moi tribal chief on Saturday, September 22, 2018.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]