["The misleading claim was published to Facebook here. The post was shared more than 300 times.", "The post claims “two family members” died in hospital after catching leptospirosis and that the “infective organism was on tin cans they drank without use of glasses / cups”. “Cans were infected with dried urine of MIce containg [sic] leptospira,” the post reads.", "The post goes on to state: “Cans are stored in warehouses & delivered to retail stores without cleaning. Study shows than top of all beverage cans are more contaminated than public toilets.”", "Leptospirosis is a zoonotic disease caused by the bacteria leptospira, which can be found in infected animal urine and tissue. Humans are typically infected with leptospira through contact with contaminated animals, soil or water. Symptoms of the disease include fever, chills, headaches, nausea and diarrhoea.", "A similar claim about the disease has also been shared tens of thousands of times by Facebook users around the world since at least 2013. See examples here, here, here, here and here.", "The claim, however, is misleading.", "Jackie Benschop, an associate professor of Veterinary Science at Massey University currently studying leptospirosis in New Zealand, said it is unlikely someone would catch the disease from a soft drink can.", "“The idea of lepto sitting on the top of a can… is unlikely, but it’s possible,” she told AFP in an interview on December 3, 2020.", "Leptospira bacteria, Benschop said, need a moist environment in order to stay alive and infect someone, normally through mucous membranes or open cuts. “One could well imagine that on the surface of a can, [leptospira] would find it hard to remain moist,” she added.", "Benschop and the New Zealand Ministry of Health say most Leptospirosis cases in New Zealand originate in the meat-processing industry or on farms, not through consumption of food. The Institute of Environmental Science and Research has recorded 40 cases of leptospirosis in New Zealand in 2020; see the data here.", "“In NZ we associate leptospirosis with people who produce food, it’s not because people are getting it through their food -- it’s because they are in contact with animal urine,” Benschop said.", "Leptospirosis.org addressed similar misleading social media posts here that have circulated online since 2002.", "In a 2005 blog post, the organisation states the “statistical risk” of catching leptospirosis from a soft-drink can “is extremely small”.", "\"Leptospira require constant immersion in water to survive, and so drying of the surface for any length of time will permanently kill the bacteria. Given that drinking containers are non-porous, surface moisture dries very quickly and cannot possibly contaminate the contents,” blog reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]