["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks with Mike Herrick, with Putnam County Rescue Squad, as he tours damage from a tornado on March 6, 2020, in Cookeville, Tenn. (AP)", "• President Trump visited Putnam County, Tennessee, on March 6, days after tornadoes tore through the area and killed 25 people.", "• There is no evidence Trump wrote personal checks to individuals in need.", "• There is also no evidence Trump brought his personal accountant to Tennessee.", "President Donald Trump visited Tennessee on March 6 to see the damage done by severe tornadoes that killed 25 people. He expressed his support for the affected communities after unlocking federal disaster relief funding for the region. But there were no reports that he wrote checks to anyone during his visit, despite what some social media posts are saying.", "A Facebook post, which had been shared 20,000 times by March 17, says that Trump wrote personal checks to those affected by the tornadoes.", "\"So Trump comes to Nashville to oversee damage from the tornado. He flies into the area in a helicopter to get there without further traffic problems in the city,\" the post reads. \"He writes PERSONAL checks to those in need, with his personal accountant in tow.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The White House did not respond to PolitiFact’s request for comment on the claim, and neither did the user on Facebook who posted the claim originally.", "Trump flew into Berry Field Air National Guard Base in Nashville on Air Force One, according to the Tennessean.", "Tennessee's U.S. senators, Lamar Alexander and Marsha Blackburn, accompanied Trump on his flight from Washington, the Tennessean reported. He was accompanied by other officials, too, according to reports. But not one mentioned Trump’s personal accountant making the trip.", "Tennessean photos show that Trump took Marine One, the presidential helicopter, from the Nashville base to Cookeville, one of the areas hit hardest by the tornadoes. Trump surveyed the damage from the air in the helicopter, but he also spent some time on the ground, White House Press Secretary Stephanie Grisham confirmed via tweet.", "Trump pledged federal support for the community. A day earlier, Trump also issued a federal disaster declaration for the region, making federal funding available for relief efforts.", "\"We're going to take care of what they need,\" Trump said during his visit. \"We're going to be with them all the way.\"", "But there were no reports of Trump writing any checks during the visit, let alone personal ones.", "Without evidence to substantiate the claim, we rate this post False.", "Tennessean, \"Trump pledges support, aid for Tennessee tornado victims: ‘We're going to be with them all the way,’\" March 6, 2020", "The Hill, \"Trump to visit Nashville as death toll from tornadoes jumps,\" March 3, 2020", "Tennessean, \"Trump to Tennessee storm victims: 'We're going to be with them all the way.'\" March 5, 2020", "WRCB TV, \"UPDATE: President Trump praises tornado victims during Cookeville visit,\" March 5, 2020", "ABC News, \"Trump surveys tornado damage, marvels at 'tremendous heart,'\" March 6, 2020", "Snopes.com, \"Did Trump Write Personal Checks to Tornado Victims in Nashville?\" March 10, 2020", "Stephanie Grisham via Tweet, White House Press Secretary accessed March 18, 2020", "Stephanie Grisham via Tweet, White House Press Secretary accessed March 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]