["The 11-minute video was posted here on YouTube on January 19, 2021 and been viewed more than 2,000 times.", "“BREAKING NEWS~HUNDREDS OF PEOPLE FAINT AND COLLAPSE AFTER GETTING SINOVAC VACCINE,” the Indonesian-language caption reads.", "The footage shows people laid on the ground and being carried, while additional clips included in the video show a woman and two men interviewed about Covid-19 vaccines.", "Indonesia launched its Covid-19 vaccination campaign on January 13, 2021, when President Joko Widodo received the country’s first shot of CoronaVac, made by Chinese company Sinovac.", "The clip has also appeared with a similar claim on Facebook here, here and here; on YouTube here; and on TikTok here, where it has been viewed more than 30,000 times.", "However, the claim is false.", "A reverse image search found that the part of the video showing people being carried to hospital was taken from a video posted on YouTube on February 11, 2018 titled “Oh God, People Are Rushed to Hospital After Receiving Diphtheria Vaccinations.”", "Below are comparisons of the misleading video (L) and the genuine YouTube video (R):", "A scene in the original video at the 0:06 mark shows an ambulance with a sticker that says: “DINKES KAB. PAMEKASAN”, which translates as “Pamekasan Regency Health Agency”.", "Pamekasan Regency is located on Madura island in Indonesia’s East Java province.", "The Indonesian Ministry of Health released a statement on February 13, 2018, titled: “THIS IS THE HEALTH MINISTRY’S EXPLANATION ABOUT MUSLIM BOARDING SCHOOL STUDENTS WHO GOT SICK AFTER ORI” — referring to the outbreak response immunisation programme.", "“Following news about students at Muslim boarding schools Al Falah and Mubtadiin Kadur in Pamekasan, East Java, who fell sick after a diphtheria ORI, the East Java Province Health Agency reported that the sickness had nothing to do with diphtheria immunisations,” it said.", "“The incident was due to the reactions of the female students after they were given Td vaccinations and their conditions who didn’t have breakfast after immunisations.”", "“Td” refers to tetanus-diphtheria vaccines that are usually given to adolescents and adults; here is a list of common side effects of diphtheria vaccines.", "The statement also said the local public clinic vaccinated around 500 students at the two Muslim boarding schools on February 10, 2018.", "Local media outlets also reported on students falling ill after receiving diphtheria vaccines in Pamekasan.", "Interview clips", "The sequence of an interview with a woman in a pink hijab matches a January 5, 2021 YouTube video from Indonesian news site Detik.com. “WHY VACCINE? PKS DEMANDS ANSWER FROM HEALTH MINISTER,” the Indonesian-language headline reads.", "The woman who gave the interview is Netty Prasetiyani, a lawmaker from the Justice and Development Party (PKS).", "The sequence showing two men talking about Covid-19 vaccination was taken from a TV interview from Indonesian broadcaster Kompas TV, published here on YouTube on October 22, 2020. It is titled: “Scientists Talk About Coronavirus Vaccines: Virus May Be More Dangerous.”", "The Kompas TV interview identifies the two men seen in the misleading video as Kusnandi Rusmil, head of Covid-19 vaccine clinical research team at Padjadjaran University, and Chairul Anwar Nidom, head of coronavirus research and vaccine formulation at Professor Nidom Foundation.", "In both interviews, which were conducted before the Covid-19 vaccination programme began, neither Netty nor the two scientists discussed people getting sick from Covid-19 vaccines.", "AFP has previously debunked false claims about people falling ill from Covid-19 vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]