["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, as debate continued in the U.S. about the need to keep social-distancing restrictions in place to limit the spread of the COVID-19 coronavirus disease, a popular social media post cited an 1866 legal precedent that supposedly precluded governments from using a state of emergency (such as a pandemic) as a reason for restricting individuals' rights to freely travel or earn a living:", "The social media post (a lengthier version of which can be found here) read as follows:", "This is NOT an opinion.", "This was the ruling of The United States Supreme Court shortly after the “civil war” in Ex parte Milligan, 71 U.S. 2 (1866) which yet stands to this day: “Neither the legislature nor any executive or judicial officer may disregard the provisions of the constitution in case of emergency ...\"", "”Section 98 therefore, ANYONE who declares the suspension of constitutionally guaranteed rights (to freely travel, peacefully assemble, earn a living, freely worship, etc.) and or attempts to enforce such suspension within 50 independent, sovereign, continental United States of America is making war against our constitution(s) and, therefore, we the people. They violate their constitutional oath and, thus, immediately forfeit their office and authority and their proclamations may be disregarded with impunity and that means ANYONE; even the governor and President.\"", "However, the cited case, Ex parte Milligan, 71 U.S. 2 (1866), was a Civil War-era case about an Indiana resident named Lambdin P. Milligan who was arrested in 1864 by order of a military commander, tried by a military commission, and sentenced to death. Milligan contended that as he was not serving in the U.S. military, was not a prisoner of war, and was not living in a part of the U.S. that was in rebellion against the federal government, the U.S. military had no jurisdiction to arrest, try, and sentence him. The U.S. Supreme Court agreed with him that it was unconstitutional for civilians to be tried by military tribunals while civil courts and authority were still functioning. The Milligan case has no real relevance to the issue of whether federal, state, or local governments may impose mandatory temporary restrictions on movement and travel and business operations in order to deal with emergencies, such as pandemics.", "Moreover, the quoted material cited in the post was not part of the Milligan decision (obviously no mid-19th century source would make reference to the U.S. having 50 states), nor part of any valid court ruling or law that we could find. (What source the cited \"Section 98\" refers to remains a mystery to us.)", "Moreover, states have previously used police powers to protect the health, safety, and welfare of persons within their borders and to control the spread of disease within their borders, including enforcing the use of isolation and quarantine. Such powers have been upheld in other legal rulings, such as Jacobsen v. Massachusetts — a 1905 Supreme Court case affirming the legal right of state legislatures to pass laws mandating use of smallpox vaccine by residents — which held that state governments may enact \"reasonable regulations\" in order to \"protect the public health and safety\" so long as those regulations do not conflict with federal constitutional authority:", "The police power of a State embraces such reasonable regulations relating to matters completely within its territory, and not affecting the people of other States, established directly by legislative enactment, as will protect the public health and safety.", "While a local regulation, even if based on the acknowledged police power of a State, must always yield in case of conflict with the exercise by the General Government of any power it possesses under the Constitution, the mode or manner of exercising its police power is wholly within the discretion of the State so long as the Constitution of the United States is not contravened, or any right granted or secured thereby is not infringed, or not exercised in such an arbitrary and oppressive manner as to justify the interference of the courts to prevent wrong and oppression.", "The liberty secured by the Constitution of the United States does not import an absolute right in each person to be at all times, and in all circumstances, wholly freed from restraint, nor is it an element in such liberty that one person, or a minority of persons residing in any community and enjoying the benefits of its local government, should have power to dominate the majority when supported in their action by the authority of the State.", "It is within the police power of a State to enact a compulsory vaccination law, and it is for the legislature, and not for the courts, to determine in the first instance whether vaccination is or is not the best mode for the prevention of smallpox and the protection of the public health.", "Likewise, the U.S. federal government is authorized under section 361 of the Public Health Service Act (42 U.S. Code § 264) to take measures to prevent the entry and spread of communicable diseases from foreign countries into the United States and between states.", "Justia.   \"Jacobson v. Massachusetts, 197 U.S. 11 (1905).\"\r\n    Accessed 27 April 2020.", "Justia.   \"Ex parte Milligan, 71 U.S. 4 Wall. 2 2 (1866).\"\r\n    Accessed 27 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]