["By D'Angelo Gore", "Posted on March 11, 2021", "Sen. John Barrasso of Wyoming defended his vote against the American Rescue Plan Act, in part, by claiming that the legislation would provide $1,400 stimulus checks to prisoners and “illegal immigrants” who shouldn’t receive them.", "But, last year, when he and his fellow Republicans controlled the Senate and the White House, Barrasso voted for the Coronavirus Aid, Relief, and Economic Security Act in March and the Consolidated Appropriations Act in December. Those bills — which included stimulus checks to individuals of up to $1,200 and $600, respectively — also didn’t prohibit payments to prisoners. And the bills included the same language denying checks to “any nonresident alien individual” that Barrasso now claims is insufficient.", "During a March 7 interview on NBC’s “Meet the Press,” Barrasso said this about checks in the current relief bill that passed in the Senate with only votes from the Democratic caucus: “[W]ith this bill, they’re going to people in prison, they’re going to people who are illegal immigrants, they’re going to people who make much more money than you would expect people to actually need relief or help at this point.”", "We’ll start by addressing the misleading GOP talking point about checks to “illegal immigrants,” and later we’ll provide the full context for the claim about payments to prisoners.", "Barrasso may have left the impression that stimulus checks are going out to the estimated 10.5 million immigrants living in the U.S. illegally. That’s not the case.", "Instead, his office said he was referring to the potential for a specific subset of those immigrants — those who overstayed a work visa — to get the checks.", "Democrats in the House passed the Senate version of the American Rescue Plan Act on March 10, and it will now go to the White House for President Joe Biden to sign into law.", "The bill includes $1,400 checks for single tax filers earning less than $75,000 and $2,800 to married couples who file jointly and make less than $150,000. They would also receive an additional $1,400 for each of their dependents.", "Individuals who meet the income requirements need to supply a Social Security number to the IRS to qualify for the one-time payments — which are actually refundable tax credits — and the bill says “any nonresident alien individual” isn’t eligible. That’s the same language that was included in the two COVID-19 relief bills that Barrasso and over 40 other Senate Republicans voted for in 2020.", "The IRS says a “nonresident alien” is someone who isn’t a U.S. citizen (or a U.S. national for those born in possessions of the U.S.) and also hasn’t passed the green card test or the substantial presence test for those considered U.S. residents for tax purposes.", "Most people living in the U.S. illegally don’t have Social Security numbers — which are typically issued to citizens, lawful permanent residents and noncitizens with work authorization. So they would be ineligible for the stimulus checks.", "Unlike last year’s CARES Act, the American Rescue Plan Act does allow checks to go to qualifying individuals who file taxes with someone who uses an Individual Taxpayer Identification Number instead of a Social Security number. But the Consolidated Appropriations Act that Barrasso voted for in December also allowed payments to some people in such households. (The ITIN is used by individuals — including immigrants living in the U.S. illegally — who are required to file taxes but aren’t eligible for a Social Security number.)", "Barrasso, however, wasn’t referring to those particular households in the interview.", "On the day the Senate voted on the most recent relief bill, Republican Sen. Ted Cruz of Texas argued that the bill’s language disqualifying any “nonresident alien” would still allow some people living in the U.S. illegally to receive the checks. He offered an amendment with alternative language saying that an “alien who is not lawfully present” in the U.S. would not be eligible, but his proposal failed on a 49-50 vote along party lines.", "Barrasso’s communications director, Bronwyn Lance, told FactCheck.org that Cruz’s amendment was necessary to “address a loophole” allowing a specific subset of immigrants in the country illegally to potentially get the stimulus payments.", "“An immigrant who obtains a work visa can also apply for a Social Security number,” she wrote in an email. “If that immigrant subsequently overstays their work visa, they are in the country illegally, but they can still be considered a ‘resident alien’ if they pass the IRS’ substantial presence test. Therefore illegal aliens could receive a recovery rebate payment.”", "As of 2018, an estimated 4.9 million people in the country illegally had overstayed a temporary visa — but we don’t know how many of them had a work visa.", "A senior visiting fellow with the Center for Migration Studies, Robert Warren, who calculated that estimate, told us in a phone interview that “a very high percentage of the people who overstay are overstaying a tourist visa” — not a work visa. But he couldn’t provide more specific figures.", "We also don’t know if the IRS is able to determine which tax filers with Social Security numbers overstayed a work visa in order to deny them the payments.", "We asked the IRS about that, but we haven’t received a response.", "It’s true that qualifying individuals in jail or prison will be eligible to receive stimulus payments, if they filed a tax return or apply to get the money. That’s because a Republican-sponsored amendment to deny payments to incarcerated individuals also was defeated in a 49-50 vote — again along party lines.", "On the Senate floor on March 5, Democratic Sen. Dick Durbin of Illinois argued against the amendment and said the proposal would harm the families of inmates.", "“Given the stark racial disparities in our criminal justice system, this would cause the most harm to Black and Brown families and communities already harmed by mass incarceration,” he said. “Children should not be forced to go hungry because a parent is incarcerated. Relief payments would allow families to replace lost income and pay rent and put food on the table.”", "But what Barrasso neglected to mention in his interview is that prisoners also weren’t barred from receiving stimulus payments included in the two relief bills that he supported last year when Republicans were running the Senate and the White House.", "After then-President Donald Trump signed the CARES Act into law in March, the IRS issued guidance in early May saying that the checks of up to $1,200 shouldn’t go to prisoners and that prisoners who received the payments should return the money.", "That IRS rule was challenged in a class-action lawsuit, and a federal judge ultimately ruled in October that inmates were entitled to the checks because Congress hadn’t included language denying them the payments in the bill that became law.", "That’s notable because, even after that ruling, the Republicans in the Senate opted not to include language disqualifying incarcerated people from receiving the stimulus payments of up to $600 that were authorized in the appropriations bill that Trump signed in December.", "And even though many people in jail or prison qualify for the stimulus payments, not all of them have received the funds.", "The IRS sent some inmates money on debit cards they couldn’t use in prison, while others have had either part or all of their stimulus checks garnished by correctional facilities for fees related to their convictions and other reasons.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]