["NC Senate Leader Phil Berger addresses the audience at The Male Leadership Academy of Charlotte in Charlotte, NC on Thursday, February 21, 2019 about the importance of people applying for the Opportunity Scholarship program. (McClatchy)", "North Carolina lawmakers want to make more people eligible for private school subsidies from the state.", "The subsidies come in the form of vouchers known as Opportunity Scholarships, a program that provides up to $4,200 to families interested in sending their students to private schools.", "State law currently limits vouchers to families earning about $63,000 a year, WRAL reported. But a GOP-backed bill, SB 609, would raise the limit to families making up to $70,000 a year.", "The NC Senate on May 8 voted 27-18 to approve the bill and send it to the House — against the wishes of Democrats who said the state shouldn’t spend tax dollars on private schools.", "During debates, a pair of Mecklenburg County Democrats suggested program expansion isn’t needed. Sen. Jeff Jackson tweeted that \"demand has been low.\" Sen. Natasha Marcus, meanwhile, said during a floor speech that there’s \"no wait list\" for the vouchers.", "\"To the extent there’s any wait list, it’s that these parents make too much money to qualify,\" she said.", "Jackson’s claim is debatable. Marcus’s claim, however, is misleading.", "520 STUDENTS", "For the current school year, 7,593 of 8,113 eligible applicants got Opportunity Scholarships.", "Those 520 students weren’t rejected because their parents made too much money, as Marcus said. They were blocked from receiving vouchers due to a cap that limits state spending on kindergartners and first-grade students, as PolitiFact reported in a previous fact check.", "Students of any grade can receive vouchers. But the state \"can only award 40 percent of the money to kindergarten and first grade,\" said Kathryn Marker, director of grants, training, and outreach at the North Carolina State Education Assistance Authority.", "The so-called wait list evaporates after each year. In other words, the 520 students left out last year won’t automatically be first in line when the application window opens this year.", "So, technically, there’s no wait list at this moment. But Marcus is wrong to suggest that scholarships were given to every eligible family.", "Contacted by PolitiFact, Marcus said her comment was made in the context of funding.", "\"I was referring to the fact that no children were denied a voucher due to lack of funding, as is so often the case with Pre-K wait lists,\" Marcus said in an email. \"The arguments on the floor in defense of this expansion seemed to suggest we needed more funding to alleviate a waitlist.\"", "However, that distinction isn’t clear upon reviewing her full comments during the May 8 debate.", "\"There’s some talk about a wait list and some suggestion that not every kid who wants a voucher for private schools is able to get one and we need to expand,\" Marcus said during the May 8 debate.", "\"I want to be clear, as far as I know — and someone can correct me in this body if I’m wrong — every student who has requested a voucher for private school in this state, every year that this program has happened, has received the full voucher amount to which they were eligible,\" she said. \"To the extent there’s any wait list, it’s that these parents make too much money to qualify. Every student who’s eligible right now has received a voucher, and there’s still $13 million left in this fund, sitting there held hostage for two years before it reverts back to the general fund. So, there’s no wait list.\"", "INTEREST RISING", "Before we rule on Marcus’s statement, we also wanted to weigh in on Jackson’s tweet.", "\"A few years ago, we (controversially) started subsidizing private schools with vouchers. It was limited to low income families,\" Jackson tweeted. \"But demand has been low, so now they want to raise the income eligibility.\"", "The word \"low\" can be somewhat subjective and hard to define since the program is only five years old. There are also restrictions on who can qualify for the vouchers, so the pool of potential recipients is limited.", "Still, in each year of its existence, the number of new applicants and the number of recipients has gone up.", "\"Clearly, there’s steady interest. We feel the program is growing in a sustainable way. It’s not that it’s flat, it’s growing,\" Marker said.", "Contacted by PolitiFact, Jackson said unspent money is evidence of low demand \"relative to expectations.\" He pointed to money left on the table, as reported by the Charlotte Observer and NC Policy Watch, a liberal advocacy group.", "Scholarship allocation data doesn’t necessarily represent the total cost of the Opportunity Scholarship program, Marker said. According to Marker, the leftover money amounted to:", "2017-2018: $6.3 million", "2016-2017: $2.7 million", "2015-2016: $4.1 million", "2014-2015: $5.8 million", "OUR RULING", "Marcus said there’s \"no wait list,\" and the only people who didn’t receive scholarships weren’t eligible. That’s not telling the full story.", "There is not a wait list in the sense that eligible applications exceed demand, and the ones who didn’t get a scholarship were rolled over to next year. But more than 500 families were left without scholarships last year — even though they were deemed eligible — because of a cap on vouchers to kindergarten and first grade students. Her claim is partially accurate but leaves out important details or takes things out of context, so we rate it Half True.", "Correction: A previous version of this story included inaccurate numbers for the amount of Opportunity Scholarship funding left unspent in fiscal years 2016-2017 and 2017-2018. The change doesn't influence our ruling. Our Truth-O-Meter rating remains the same.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "Audio of the NC Senate debate on May 8, 2019.", "North Carolina State Education Assistance Authority, \"Opportunity Scholarship Program Summary of Data as of May 1, 2019.\"", "PolitiFact, \"Civitas Institute mostly correct on school choice waitlists in North Carolina,\" published Feb. 5, 2019.", "Associated Press, \"North Carolina legislature wraps up pre-deadline work,\" published May 8, 2019.", "News & Observer, \"Should a family making $70,000 get a private school voucher? Some NC lawmakers say yes.\" published May 8, 2019.", "Charlotte Observer, \"NC voucher fund leaves millions unspent while growing by $10 million a year,\" published Feb. 11, 2019.", "WUNC, \"North Carolina’s School Voucher System Continues to Grow: How Did We Get Here?\" published May 14, 2018.", "Email correspondence with NC Sen. Jeff Jackson, a Democrat from Mecklenburg County.", "Email correspondence with NC Sen. Natasha Marcus, a Democrat from Mecklenburg County.", "Email and telephone correspondence with Kathryn Marker, director of Grants, Training, and Outreach at the North Carolina State Education Assistance Authority.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]