["About this rating", "UPDATE Nov. 11, 2020: For 2020, we are including USA Today and Delish's list of places where veterans and military personnel can get free meals or deals:", "7-Eleven: Veterans with a Veterans Advantage account can link their account to the convenience store chain's 7Rewards loyalty program to get special offers including a free cup of coffee for Veterans Day.", "Applebee's - November 11, 2020\nFree meal from a special menu but offers can vary.", "Bar Louie - November 11, 2020\nFree burger or flatbread.", "Beef 'O' Brady's - November 11, 2020\nFree meal up to $10. No purchase required.", "Ben's Soft Pretzels - November 11, 2020 \nFree jumbo soft pretzel.", "Biggby Coffee - November 11, 2020\nFree hot brewed coffee up to 24 ounces.", "BJ’s Restaurant & Brewhouse - November 11, 2020\nFree meal up to $14.95 and free Dr Pepper beverage.", "Black Angus Steakhouse - November 11, 2020\nFrom restaurant open until close—3p.m. to 9p.m. local time—Black Angus Steakhouses will offer veterans the All-American Steak Plate for just $10.99.", "Bob Evans - November 11, 2020\nFree meal from a special menu.", "Bonefish Grill - November 11, 2020\nOngoing 10% discount daily.", "Buffalo Wild Wings - November 11, 2020\nFree order of 10 boneless wings and fries.", "California Pizza Kitchen - November 11, 2020\nFree meal from a special menu.", "Captain D's - November 11, 2020\n10% off meals for veterans.", "Caribou Coffee - November 11, 2020\nFree small coffee.", "Carrabba’s Italian Grill - November 11, 2020\nFree order of calamari with any purchase to all veterans, active military, police officers and firefighters with a valid ID through Wednesday. The chain also has an ongoing 10% discount for active and retired service members.", "Casey's General Store - November 11, 2020\nFree coffee.", "Chicken Salad Chick - November 11, 2020\nFree Chick Special and regular drink.", "Chili's Grill & Bar - November 11, 2020\nFree meal from a special menu.", "Chopt Creative Salad Co. - November 11, 2020\n30% off military discount.", "Cicis Pizza - November 11, 2020\nFree adult buffet for veterans with military ID and a coupon posted at www.cicis.com/veteransday.", "Country Pride - November 11, 2020\nFree meal for veterans Wednesday.", "Cousins Subs - November 11, 2020\nFree regular side with purchase of a 7.5-inch sub. The side can be a free chocolate or vanilla shake or float, fries, chips or Wisconsin Cheese Curds.", "Cracker Barrel - November 11, 2020\nFree slice of Double Chocolate Fudge Coca-Cola Cake.", "D'Angelo Grilled Sandwiches - November 11, 2020\n50% off entire order Wednesday for walk-in and carry-out orders. Not valid online, on lobster or gift cards.", "Denny's - November 11, 2020\nFree \"Build Your Own Grand Slam\" from 5 a.m. to noon Wednesday.", "Dickey's Barbecue Pit - November 11, 2020\nFree Pulled Pork Classic Sandwich.", "Dunkin' - November 11, 2020\nFree doughnut of your choice.", "Einstein Bros. Bagels - November 11, 2020\nFree hot or iced medium coffee when veterans state that they are a veteran.", "Famous Dave's - November 11, 2020\nFree Lunch Georgia Chopped Pork Sandwich with side.", "Farmer Boys - November 11, 2020\nFree Big Cheese for veterans.", "Fazoli’s - November 11, 2020\nFree spaghetti Wednesday.", "Fogo de Chão - November 11, 2020\n50% off entire meal in all U.S. and Puerto Rico locations, and 10% off meals for up to three additional guests.", "Friendly's - November 11, 2020\nFree All-American meal for lunch or dinner.", "Freddy's Frozen Custard & Steakburgers - November 11, 2020\nFree combo meal cards for veterans and active-duty military who visit a Freddy's location Wednesday. The cards are good through Nov. 30.", "Golden Corral - November 11, 2020\nThrough Nov. 30, Golden Corral is handing out free meal and beverage cards to all active-duty military and veterans. The cards can be used once through May 31 for lunch or dinner Monday through Thursday.", "Grimaldi's Pizzeria - November 11, 2020\nYear-round 15% discount, and 25% off an entire purchase on Veteran's Day.", "Hooters - November 11, 2020\n10 free boneless wings with the purchase of 10 wings.", "Huddle House - November 11, 2020\nFree MVP Breakfast Platter.", "Iron Skillet - November 11, 2020\nFree meal for veterans Wednesday.", "Juice It Up! - November 11, 2020\nFree 20-ounce classic smoothie.", "Kolache Factory - November 11, 2020\nFree breakfast for veterans, which includes one free kolache of any kind and one cup of any size brewed coffee.", "Krispy Kreme - November 11, 2020\nFree doughnut of choice and small hot or iced coffee.", "Landry’s Inc. - November 11, 2020\nThe company with more than 60 brands – including Morton’s The Steakhouse, Del Frisco’s Double Eagle Steakhouses, Bubba Gump Shrimp Co. and Rainforest Cafe – is offering military veterans and active members 20% off Wednesday for up to four people. Excludes Golden Nugget restaurants and McCormick & Schmick’s locations.", "Little Caesars - November 11, 2020\nFree lunch combo between 11 a.m. and 2 p.m. Wednesday.", "Logan’s Roadhouse- November 11, 2020\nFree meal between 3 to 6 p.m. Wednesday from the American Roadhouse menu.", "Love's Travel Stops and Country Stores - November 11, 2020\nPurchase one roller grill item and get a second free and a fountain drink or coffee of any size for free.", "Macaroni Grill - November 11, 2020\nFree Mom's Ricotta Meatballs + Spaghetti.", "Maxwell House Coffee - November 9-16, 2020\nStarting November 9 at 12 p.m. EST, veterans and active servicemen and women can visit coupons.com to download a coupon, while supplies last, for a free canister of Maxwell Houses for Heroes pack (1lb or 3lbs). The coupon can be redeemed online or at participating retailers through November 16.", "Menchie's Frozen Yogurt - November 11, 2020\nFirst six ounces of frozen yogurt are free for veterans.", "Metro Diner - November 11, 2020\n50% off breakfast, lunch or dinner.", "Mission BBQ - November 11, 2020\nFree sandwich for veterans.", "Nekter Juice Bar - November 11, 2020\nFree 16-ounce Fresh Juice or Superfood Smoothie.", "Ninety Nine Restaurant & Pub - November 11, 2020\nFree meal from a special Veterans Day menu with the purchase of another meal and proof of service from 11 a.m. to 5 p.m. Wednesday.", "O'Charley's - November 11, 2020\nFree meal from special menu Wednesday. Plus, the chain has a 10% military discount daily.", "Outback Steakhouse - November 11, 2020\nFree Bloomin’ Onion and Coke product Wednesday. Also, the chain has a daily heroes discount offering 10% off entire checks to all servicemen and -women, police officers, firefighters and first responders with a valid state or federal service ID.", "Papa Gino's - November 11, 2020\n50% off whole pizzas for walk-in and carry out orders.", "Pie Five Pizza - November 11, 2020\nParticipating Pie Five Pizza locations are offering a free personal pizza.", "Pilot Flying J - November 11, 2020\nFree breakfast combo, which includes coffee, for veterans and military on the Pilot Flying J app through Nov. 15.", "Qdoba- November 11, 2020\n50% off any entree Wednesday.", "Red Lobster - November 11, 2020\nFree appetizer or dessert.", "Red Robin - November 11, 2020\nThis deal starts the day after Veterans Day. From Thursday through Nov. 30, veterans and active military who are current Red Robin Royalty members can get a free tavern burger served with bottomless fries.", "Romano's Macaroni - November 11, 2020\nVeterans get a free Mom's Ricotta Meatballs + Spaghetti entrée at all U.S. locations.", "Scooter's Coffee- November 11, 2020\nFree drink in any size.", "Sheetz - November 11, 2020\nFree 6-inch turkey sub, a regular fountain drink and a free car wash at Sheetz locations that have car washes.", "Shoney’s- November 11, 2020\nFree breakfast bar from open to 11 a.m.", "Smashburger - November 11, 2020\nFree Double Burger with any purchase.", "Smokey Bones - November 11, 2020\nFree meal from a special menu. Plus, the chain has a 10% military discount daily.", "Smoothie King - November 11, 2020\nFree 20-ounce smoothie of choice.", "Sonny’s BBQ - November 11, 2020\nFree pork sandwich Wednesday, plus service people that stop by on Veterans Day will also receive a voucher for a free BBQ Egg Roll appetizer, redeemable with a valid military ID from Dec. 1-15.", "Starbucks - November 11, 2020\nFree tall hot brewed coffee for veterans, active service members and their spouses Wednesday.", "Travelcenters of America - November 11, 2020\nFree meals for veterans at participating Country Pride, Iron Skillet or a TA Petro quick service restaurants.", "Taco John's - November 11, 2020\nFree small beef #1 Combo Meal. Military personnel can redeem the offer in the Taco John’s app by entering the promo code VETERAN under the “More” tab.", "TacoTime - November 11, 2020\nFree meal up to $10.", "TCBY - November 11, 2020\nFree six ounces of frozen yogurt.", "TGI Fridays - November 11, 2020\nFree select meal from 11 a.m. to 2 p.m.\n\nThe Rustic - November 11, 2020\nFree Rustic burgers are available on November 11.", "Torchy's Tacos - November 11, 2020\nFree taco and non-alcoholic beverage from a special Veterans Day menu.", "Twin Peaks - November 11, 2020\nFree meal from a special menu at corporate locations Wednesday.", "Wawa - November 11, 2020\nFree coffee of any size to veterans, active military members and their families, all day Wednesday, with no military ID required.", "Wendy's - November 11, 2020\nFree small breakfast combo with valid military ID from 6:30 to 10:30 a.m. Hours can vary by location. Service members enrolled in the Veterans Advantage program can get a free breakfast sandwich with any breakfast purchase from Wednesday through Dec. 31.", "Wienerschnitzel - November 11, 2020\nFree Chili Dog, small fries and small Pepsi.", "White Castle - November 11, 2020\nFree combo meal or breakfast combo.", "Yard House - November 11, 2020\nFree appetizer Wednesday.", "Zaxby's - November 11, 2020\nFree Boneless Wings Meal with proof of military service Wednesday.", "In recent years, some national restaurant chains have begun the practice of demonstrating appreciation for U.S. military personnel (both veterans and those on active duty) by offering them free meals in observance of Veterans Day (November 11). Here are some of the chains that will be participating in such programs in 2019, according to the U.S. Department of Veterans Affairs blog:", "Hometown Buffet – November 11, 2019\nActive duty, reserve, or retired military personnel in uniform or with a valid ID receive 15% discount on Military Mondays (Every Monday including Memorial Day) at Hometown Buffet. Be sure to ask your server for more details. Visit the BJs Wholesale website for details.", "Old Country Buffett – November 11, 2019\nActive duty, reserve, or retired military personnel in uniform or with a valid ID receive 15% discount on Military Mondays (Every Monday including Memorial Day) with up to four members of the family at Old Country Buffett. Be sure to ask your server for more details. Visit the BJs Wholesale website for details.", "Applebee’s – November 11, 2019\nVeterans and active-duty military receive a free meal from a limited menu at participating Applebee’s on November 11. Dine-in only. Visit the Applebee’s website for details.", "Chili’s Grill & Bar – November 11, 2019\nAll Veterans and active duty military personnel can get a free meal on Veteran’s Day Monday, November 11, 2019, at all participating Chili’s Grill and Bar restaurants. Please call ahead to your local Chili’s restaurant if you have any questions about your Veteran’s Day meals. Visit the Chili’s website for details.", "Baker’s Square – November 11, 2019\nAll Veterans and active duty service members receive a free meal on Veteran’s Day (November 11, 2019) from Baker’s Square. Visit the Baker’s Square website for details.", "54th Street Grill and Bar – November 11, 2019\nVeterans + Active Duty military personnel who dine inside a 54th Street Grill and Bar receive a free entrée up to $12 on Veteran’s Day (11-11-2019). Visit the 54th Street Grill and Bar website for details.", "Golden Corral – November 11, 2019\nMilitary Veterans, retirees, and active duty members are being offered a free sit-in “thank you” dinner on Monday, November 11, 2019, from 5pm -9pm. For more details visit the Golden Corral website.", "Red Robin – November 11, 2019\nVeteran’s and Active Duty Military are being offered a free dine-in Red’s Tavern Double Burger and Bottomless Steak Fries on Veteran’s Day, 11/11/2019. Visit the Red Robin website for details.", "Mission BBQ – November 11, 2019\nVeterans and active duty members will receive a free sandwich and slice of cake (while supplies lasts) at Mission BBQ on Veteran’s Day, 11/11/2019. Visit the Mission BBQ website for details.", "O’Charley’s Restaurant – November 11, 2019\nVeterans of the armed forces and/or officers still serving, you can enjoy a free meal at O’Charley’s this Veterans Day, with several fan favorites from the restaurant’s menu to choose from. Visit the O’Charley’s website for details.", "Grub Burger – November 11, 2019\nVeterans and active military members can get a free meal at a Grub Burger Bar location on Saturday, November 11, for Veterans Day. Visit the Grub Burger website for details.", "IHOP – November 11, 2019\nAll Active duty and Retired Veterans in observance of Veteran’s Day, November 11, are invited to come in to IHOP and enjoy a “free” breakfast. Visit the IHOP website for details.", "Lucille’s BBQ – November 11, 2019\nVeterans and active duty military will enjoy a complimentary dessert with proof of service on November 11. Visit the Lucille’s BBQ website for details.", "Fogo De Chao – November 8-11, 2019\nVeterans and active duty personnel receive discounts on November 8-11, which includes 50% towards their meal at Fogo De Chao, in addition up to three of their guests enjoy 10% off. Visit the Fogo-De-Chao website for details.", "Texas Road House – November 11, 2019\nVeterans and active military receive a free lunch on November 11, from 11 a.m. to 4 p.m. at all Texas Roadhouse locations. Visit the Texas Road House website for details.", "TGI Fridays – November 11, 2019\nMilitary guests with a valid military ID will be treated to a free lunch menu item up to $12 on November 11, from 11 a.m. to 2 p.m. These guests also will receive a $5 coupon for their next meal at Fridays. Call your local TGI Fridays for details.", "Subway – November 11, 2019\nMilitary Veterans with a valid ID are being offered a free six-inch sub on November 11 at select locations. Call or visit your nearest location for details.", "Outback – November 11, 2019\nVeterans with a military ID can get a free Bloomin’ Onion and non-alcoholic beverage on November 11, and 20 percent off their check Nov. 12 to Dec. 31. Call or visit your nearest location for details.", "BJs Restaurant Brewhouse – November 11, 2019\nMilitary and Veteran’s with a valid ID are being offered a free entree up to $14.95 and a free Dr. Pepper beverage on November 11. Call your local BJs Restaurant Brewhouse for details.", "Bandanas BBQ Restaurant – November 11, 2019\nVeterans and active duty military are being offered a free meal on November 11. Call or visit your nearest location for details.", "Manhattan Bagel Company – November 11, 2019\nAll active, former and retired military personnel with valid identification are invited to enjoy a free bagel and cream cheese at Manhattan Bagel Company’s participating locations on Veterans Day November 11. No additional purchase is required. Call or visit your nearest location for details.", "Houlihan’s – November 11, 2019:\nAll military members – both active-duty and Veterans – will receive a free and complimentary meal on Veterans Day. Guests must come with proof of duty by an I.D., photo in uniform, earning receipt or any other form of proof. Call or visit your nearest location for details.", "Bombshells Restaurant & Bar – November 11, 2019\nVeteran’s families and active service members receive free meals at Bombshells Restaurant & Bar on November 11 from 11 AM – 2 AM. Please call ahead to your local Bombshell’s restaurant if you have any questions about your Veteran’s Day meals.", "California Pizza Kitchen – November 11, 2019\nVeterans and active U.S. military members with proof of service have an invitation to enjoy a complimentary meal from CPK’s Veterans Day menu at all participating California Pizza Kitchen locations nationwide. Please call ahead to your local California Pizza Kitchen if you have any questions about your Veteran’s Day meal.", "The Chop House – November 11, 2019\nVeterans receive a 50% discount with a valid military ID on November 11. This does not apply to alcoholic beverages. Please call ahead to your local Chop House if you have any questions about your Veteran’s Day Discount.", "Cici’s Pizza – November 11, 2019\nAll active duty or retired military with a valid military ID are being offered a free pizza buffet on November 11. Please call ahead to your local Cicis Pizza if you have any questions about your Veteran’s Day Discount.", "Connors Steak & Seafood – November 11, 2019\nVeterans with a valid military ID receive a 50% discount on November 11. This offer does not apply to alcoholic beverages. Please call ahead to your local Connors Steak & Seafood if you have any questions about your Veteran’s Day Discount.", "Cotton Patch Cafe – November 11, 2019\nAll Veterans and active military members are being offered a free Chicken Fried Steak or Chicken Fried Chicken with a drink on November 11. Please call ahead to your local Cotton patch café if you have any questions about your Veteran’s Day Discount.", "Famous Dave’s – November 11, 2019\nMilitary personnel and Veterans are being offered a free meal on November 11th at participating locations only. Proof of military service is required. Please call ahead to your local Famous Dave’s if you have any questions about your Veteran’s Day Discount.", "Farmer Boys – November 11, 2019\nVeterans and active duty military with valid proof of service get a free cheese cheeseburger on November 11. Please call ahead to your local Farmer Boys if you have any questions about your Veteran’s Day Discount.", "Firebirds Wood Fired Grill – November 11, 2019\nVeterans and active duty military with valid proof of service get a free lunch or dinner entree on November 11. Please call ahead to your local Firebirds Wood Fired Grill if you have any questions about your Veteran’s Day Discount.", "Fired Pie – November 11, 2019\nVeterans and active duty military with valid proof of service or are in uniform on receive a free entree November 11 for Veterans Day. Please call ahead to your local Fired pie if you have any questions about your Veteran’s Day Discount.", "Joe’s Crab Shack – November 11, 2019\nVeterans and active duty military with valid ID will enjoy 20 percent off on November 11. Please call ahead to your local Joe’s Crab Shack if you have any questions about your Veteran’s Day Discount.", "Little Caesars Pizza – November 11, 2019\nVeterans and active duty military with valid ID will receive a free $5 hot-n-ready lunch combo.On November 11, from 11am to 2pm. Please call ahead to your local Little Caesars Pizza if you have any questions about your Veteran’s Day Discount.", "Logan’s Roadhouse – November 11, 2019\nVeterans and active duty military with valid proof of service will receive a free American Roadhouse Meal on Veterans Day. Please call ahead to your local Logan’s Roadhouse if you have any questions about your Veteran’s Day Discount.", "Luna Grill – November 11, 2019\nVeterans, military service men and women with valid proof of service will receive their choice of a complimentary meal when they purchase a meal from November 9-11. Please call ahead to your local Luna Grill if you have any questions about your Veteran’s Day Discount.", "Menchie’s – November 11, 2019\nVeterans, military service men and women with valid proof of service will receive the first 6 ounces of frozen yogurt free on November 11. Please call ahead to your local Menchie’s if you have any questions about your Veteran’s Day Discount.", "Orange Leaf Frozen Yogurt – November 11, 2019\nRetired and active duty military with valid proof of service will receive a free froyo at participating locations on November 11. Please call ahead to your local Orange Leaf Frozen Yogurt if you have any questions about your Veteran’s Day Discount.", "Updated with promotions for the current year.", "Updated with promotions for the current year.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]