["About this rating", "Early on in his bid for the United States presidency, Donald Trump adopted a catchphrase that encapsulated his entire political philosophy in just two words: \"America first.\"", "The slogan was front and center in Trump's first major foreign policy speech as a candidate in April 2016:", "My foreign policy will always put the interests of the American people and American security above all else. It has to be first. Has to be. That will be the foundation of every single decision that I will make. America first will be the major and overriding theme of my administration.", "He then used the phrase to characterize his planned approach to immigration policy, which would be much more restrictive than policies of the previous few decades:", "We need a system that serves our needs, not the needs of others. Remember, under a Trump administration it's called America first. Remember that.", "To choose immigrants based on merit. Merit, skill, and proficiency. Doesn't that sound nice? And to establish new immigration controls to boost wages and to ensure that open jobs are offered to American workers first.", "It would also become the centerpiece of Trump's inauguration address in January 2017:", "We assembled here today are issuing a new decree to be heard in every city, in every foreign capital, and in every hall of power. From this day forward, a new vision will govern our land. From this day forward, it's going to be only America first, America first.", "Every decision on trade, on taxes, on immigration, on foreign affairs will be made to benefit American workers and American families. We must protect our borders from the ravages of other countries making our products, stealing our companies and destroying our jobs.", "In addition to figuring prominently in his speeches, \"America first\" has turned up regularly in Trump's tweets, often paired with his other favorite rallying cry, \"Make America great again\":", "In trade, military and EVERYTHING else, it will be AMERICA FIRST! This will quickly lead to our ultimate goal: MAKE AMERICA GREAT AGAIN!", "— Donald J. Trump (@realDonaldTrump) May 23, 2016", "A vote to CUT TAXES is a vote to PUT AMERICA FIRST. It is time to take care of OUR WORKERS, to protect OUR COMMUNITIES, and to REBUILD OUR GREAT COUNTRY! https://t.co/wW3QNxcCHf pic.twitter.com/sRL2yRK6k2", "— Donald J. Trump (@realDonaldTrump) November 29, 2017", "As Trump's critics have accurately observed, the president did not invent the phrase \"America First,\" nor was he the first public figure to sloganize it. More to the point, they say, many of the social and political contexts in which it has been used in the past were unsavory.", "The Anti-Defamation League noted in an April 2016 statement urging Trump to reconsider his use of it that \"America First\" was associated before and during World War II with an isolationist political organization some of whose members openly displayed pro-Nazi and anti-Semitic tendencies:", "The most noteworthy leader of the \"America First Committee\" was Charles Lindbergh, who sympathized with the Nazis and whose rhetoric was characterized by anti-Semitism and offensive stereotypes, including assertions that Jews posed a threat to the U.S. because of their influence in motion pictures, radio, the press, and the government.", "\"The undercurrents of anti-Semitism and bigotry that characterized the America First movement — including the assumption that Jews who opposed the movement had their own agenda and were not acting in America’s best interest — is fortunately not a major concern today,” said Jonathan A. Greenblatt, ADL CEO. “However, for many Americans, the term ‘America First’ will always be associated with and tainted by this history. In a political season that already has prompted a national conversation about civility and tolerance, choosing a call to action historically associated with incivility and intolerance seems ill-advised.\"", "Other Trump critics identify the slogan with the infamous white supremacist hate group the Ku Klux Klan, one of whose ex-leaders, David Duke, himself ran for public office in 2016 on an \"America first\" platform. Social media memes critical of Trump's enthusiasm for the slogan use archival images and Klan memorabilia to make the point that its history is anything but innocuous:", "The images above are authentic. The photo of KKK members marching with an \"America first\" banner dates from the 1920s and can be found in the Getty Images archive. The Ku Klux Klan \"coin\" (actually a token) bearing the slogans \"America First\" and \"Preserve Racial Purity\" on one face and \"The Invisible Empire\" on the other was struck in 1965 to celebrate the centennial of the KKK's founding, numismatists say, although it was never officially endorsed by the organization.", "The phrase \"America first\" also appears in Klan literature as part of a longer credo, \"America first, last and forever,\" or its variant \"America first, last and always,\" as uttered by a KKK speaker quoted in the Binghamton, New York Press and Sun-Bulletin in 1923:", "\"I stand for America first, last and always,\" the speaker began. \"I am opposed to any organization which tries to bring in foreign and alien ideals.\"", "Another variant is enshrined in an \"Imperial Proclamation\" submitted as evidence during a Congressional hearing on the Klan's activities in 1921:", "[The Klan] stands for America first — first in thought, first in affections, and first in the galaxy of nations. The Stars and Stripes forever above all other and every kind of government in the whole world.", "Despite their embrace of the slogan, however, there is no evidence that the Ku Klux Klan invented it, as has sometimes been alleged. There are instances of its use by politicians predating any examples we've found directly attributable to the Klan.", "President Woodrow Wilson ran for re-election on an \"America first\" platform in 1916, for example, in that instance using the phrase to remind voters that his isolationist stance had kept U.S. troops out of the burgeoning conflict in Europe (never mind that he abandoned that position and sent them to fight in World War I during his second term). A popular song called \"America First!\" was dedicated to Wilson and published in 1917.", "For that matter, Presidents Calvin Coolidge, Warren G. Harding, and William McKinley all used the catchphrase at one time or another to promote isolationist and/or protectionist foreign policies (we found an instance of McKinley being touted as having an \"America first\" agenda as long ago as 1896).", "In sum, the political slogan \"America First\" has a pedigree stretching back more than a hundred years, with connotations ranging from anti-expansionism and trade protectionism to outright racism and anti-Semitism. Although it has been trumpeted over time by hate groups such as the Ku Klux Klan, its use does not automatically confer the most heinous of those attitudes on the user — although given its less savory associations, one wonders why any informed person would embrace it today.", "Beckwith, Ryan Teague.  \"Read Donald Trump's 'America First' Foreign Policy Speech.\"\r\n  Time.  27 April 2016.", "Blake, Aaron.  \"Trump's Full Inauguration Speech Transcript, Annotated.\"\r\n  The Washington Post.  20 January 2017.", "Bump, Philip.  \"Here's What Donald Trump Said in His Big Immigration Speech, Annotated.\"\r\n  The Washington Post.  31 August 2016.", "Grinolds, Dick.  \"More on the Invisible Empire Tokens.\"\r\n  E-Sylum.  11 June 2017.", "Nelson, Libby.  \"America First\": Donald Trump's Slogan Has a Deeply Bigoted Backstory.\"\r\n  Vox.  1 September 2016.", "Rauchway, Eric.  \"President Trump's 'America First' Slogan Was Popularized by Nazi Sympathizers.\"\r\n  The Washington Post.  20 January 2017.", "Albany Evening Herald.  \"Mysterious Ku Klux Klan Organizing Quietly.\"\r\n  15 August 1921.", "Anti-Defamation League.  \"ADL Urges Donald Trump to Reconsider 'America First' in Foreign Policy Approach.\"\r\n  28 April 2016.", "Binghamton Press and Sun-Bulletin.  \"Near Riot Ensues in Chase After Citizen Who Upholds Klan.\"\r\n  28 August 1923.", "Getty Images.  \"Ku Klux Klan 'American First Parade.\"\r\n  Accessed 9 February 2018.", "U.S. Government Printing Office.  \"The Ku Klux Klan: Hearings Before the Committee on Rules, House of Representatives.\"\r\n  1921.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]