["“Can you believe this, and what Democrats are allowing to be done to our Country?” Trump tweeted on October 18, a missive retweeted nearly 27,000 times. The Republican president’s message is accompanied by a video showing two people handing out money to people in a line.", "One day before Trump’s tweet, Gaetz had tweeted the clip with the message: “BREAKING: Footage in Honduras giving cash 2 women & children 2 join the caravan & storm the US border @ election time. Soros? US-backed NGOs? Time to investigate the source!”", "The tweet went viral prior to November 6, when American voters went to the polls to determine make-up of the next US Congress.", "Trump’s commentary on the video was quickly picked up and portrayed as the truth by Spanish language media. On Facebook, for example, it was shared more than 3,500 times in Spanish, and hundreds of times in English.", "The day Trump’s tweet went viral, Open Society, the foundation Soros created, dismissed on Twitter the notion that it had any relationship with the migrant caravan.", "“We can save you the trouble, Congressman: Neither Mr. Soros nor Open Society are funding this effort,” the foundation tweeted. “We do support the historic U.S. commitment to welcoming people fleeing oppression and violence in their homelands. Maybe you could investigate why they feel the need to flee.”", "We can save you the trouble, Congressman: Neither Mr. Soros nor Open Society are funding this effort. We do support the historic U.S. commitment to welcoming people fleeing oppression and violence in their homelands. Maybe you could investigate why they feel the need to flee.", "It’s not the first case linking Soros to supporting migrants. In November Snopes disproved that the billionaire was funding the distribution of prepaid debit cards to refugees via the United Nations.", "Several comments on the Facebook post make it clear that the video was filmed in Guatemala, with one user specifying it was in Chiquimula.", "At one point in the video the name of a store -- “Auto polarizado y accesorios para carros” -- is visible. A Facebook search with both terms turns up the following image confirming the video was recorded in the Guatemalan town.", "The post also specifies it is located in the Las Rosas district, located in the municipality’s zone five, which is crossed by a single road visible on Google Street View.", "An AFP check found the exact place where the video was recorded, although the palm tree was smaller and the auto shop was still for rent.", "In a search with a keyframe from the video, obtained by using the InVID tool, AFP found a Twitter thread that included reference to the video. It was posted on October 18 by Guatemalan journalist Luis Assardo.", "“I managed to talk to locals and they told me that merchants in the area collected money and gave it to people from #CaravanaDeMigrantes,” his Spanish-language tweet reads.", "Logré hablar con pobladores del lugar y me comentaron que entre comerciantes del sector reunieron dinero y se los dieron a gente de la #CaravanaDeMigrantes.\n\t\tCon esto se confirma que lo publicado por @RepMattGaetz es impreciso y tendencioso. Así se difunde desinformación.", "In a later interview with AJ+ in Spanish, Assardo said concerning money that “people usually do not want to talk about it,” due to drug trafficking issues in the region.", "In the video, one of the people distributing cash has a gun tucked in the waistband of his pants. A few days later, Gaetz told The New York Times that he suspected the men handing out money were cartel members.", "Queried by AFP, the police chief of Guatemala’s eastern region, which includes Chiquimula, said he knew of the video and had followed up on it, but said he was unable to determine who was distributing the funds.", "AFP journalists in Guatemala found that a local group of farmers who are linked to drug trafficking activities often distribute food, clothing and medicine.", "Though the origin of the money given out in the video remains unknown, the claim that it came from George Soros and his organization is unfounded -- and the video was clearly shot in Guatemala, not Honduras.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]