["About this rating", "On 23 June 2016, Britain voted to leave the European Union, a decision that has rocked Europe and left its future uncertain.", "While the Brexit (a portmanteau of \"British exit\") vote had some immediate consequences — for example, the pound's value plunged and markets dropped precipitously; other countries' politicians called for similar referendums; UK Prime Minister David Cameron resigned — it will take time to see the full effects of Britain's decision.", "One change that won't happen, however, is the removal of a star from the European Union flag.  Shortly after the Brexit vote, people on social media started posting pictures of the EU flag with one star missing, as a critique or a commentary on the decision:", "The commentary became confused with the reality (as happens so often on social media), with many people believing that a star actually would be removed from the European Union's flag.  However, there are no plans to alter it, as the stars on the flag don't actually represent the number of countries in the union:", "The European flag symbolises both the European Union and, more broadly, the identity and unity of Europe.", "It features a circle of 12 gold stars on a blue background. They stand for the ideals of unity, solidarity and harmony among the peoples of Europe.", "The number of stars has nothing to do with the number of member countries, though the circle is a symbol of unity.", "The current design of the union's flag dates back to 1955, when it was first used by the Council of Europe, but it wasn't adopted by the European Economic Community until 1985.", "The European Union did have twelve members between 1986 and 1994, but the number of member countries now tentatively sits at 28 (and it will drop to 27 if and when Britain officially leaves the European Union).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]