["On February 21, social media user Avi Dandiya had uploaded a Facebook Live video where he claimed to have revealed a massive plan concocted by the BJP to rig EVMs before elections. His conspiracy theory was espoused by an alleged audio conversation between BJP chief Amit Shah and national security advisor Ajit Doval. Dandiya’s Live video attracted over 5 lakh views and more than 20,000 shares. A quick scroll through the comments section suggests a large number of people believed the alleged scheming to be true.", "भारत से महत्वपूर्ण कोई नही ना कोई राजनेतीक पार्टी ना कोई नेता ना कोई मीडिया। एक देश एक परिवार Mohabbat KeDange", "Posted by Avi Dandiya on Thursday, 21 February 2019", "Alt News had earlier debunked another audio clip uploaded by Avi Dandiya according to which the BJP had orchestrated the Pulwama terror attack. Social media user Smit Amin had reached out to us regarding the previous manufactured clip. Amin also alerted us about the EVM conspiracy audio conversation posted by Dandiya. Upon scrutinising the original videos shared by Amin, Alt News confirmed that the clip was manufactured.", "In the first few seconds of the alleged conversation, Amit Shah can be heard saying, “ये तो तीन दिन से तैयारी चल रही थी (Preparations have been going on for three days.)” This statement was picked up from an interview that the BJP chief had given to Zee News’s Sudhir Chaudhary in 2018. He said the aforestated words in relation to a question posed by Chaudhary regarding the PDP-NC-Congress alliance in J&K last year.", "At about 20 minutes into Dandiya’s Live video, the man who was claimed to be Ajit Doval warned Shah of the consequences of hacking EVMs and said that they might get into trouble if an investigation was to follow. “अब इसकी जाँच कौन करेगा बताओ? अमेरिका? (Who is going to investigate this? America?)” was the BJP chief’s reply. This statement was manufactured by conjoining two different parts of the Sudhir Chaudhary interview. At 29:13 minutes, Shah said, “अब इसकी जाँच कौन करेगा बताओ? (Who is going to investigate this?”), with regard to the CBI corruption scandal. At 27:47 minutes he used the word “अमेरिका (America)” while talking about the devaluation of the rupee against the dollar and the rising petrol prices.", "The part in the manufactured audio conversation where Shah said – “आप पहले समझ लीजिये की कन्फूज़न कहा से खड़ा होता है| मुझे कोई कन्फूज़न नहीं है| अरे यार कोई आर्गुमेंट तो ढंग का करो उनको आप समझाए क्यों नहीं? जहा तक मसले का सवाल है मुझे तो कोई पूछेगा नहीं| Please understand where the confusion arises from. I have no confusion. At least give good arguments; why didn’t you make him understand? With regard to the issue, no one is going to question me.” – was lifted from different parts of the 2016 India Today conclave addressed by the BJP chief.", "At 50:50 minutes in the address, Shah said, “आप पहले समझ लीजिये की कन्फूज़न कहा से खड़ा होता है| (Please understand where the confusion arises from.)” At 8:53 minutes, he said, “मुझे कोई कन्फूज़न नहीं है| (I have no confusion.)” At 8:35 minutes, he said, “अरे यार कोई आर्गुमेंट तो ढंग का करो (At least give good arguments.)” The last portion of the statement – “मुझे तो कोई पूछेगा नहीं (No one is going to question me)” – was lifted from the Sudhir Chaudhary video. Shah uttered these words at 13:56 minutes into the interview.", "Towards the end of the manufactured audio conversation, Amit Shah said, “वेल प्लांड, आप रिकॉर्ड चेक कर सकते हो| (well planned, you can check the records).” This too was picked up from the BJP president’s interview with Zee News. At 9:41 minutes, he used the phrase “वेल प्लांड (well planned)” and at 15:23 minutes, he said, “आप रिकॉर्ड चेक कर सकते हो (you can check the records.)”", "While the complete audio clip could not be transcribed due to the incoherence of words, the above-stated examples are substantial to prove that the conversation was manufactured. Moreover, the voice ascribed to Ajit Doval was not his, as found after comparing the audio clip with the national security advisor’s voice in publicly available speeches. Avi Dandiya morphed a conversation between political leaders associated with the BJP to falsely claim that they were scheming to hack EVMs before elections.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]