["About this rating", "A December 2014 viral video encouraged children to take their parents' guns in order to reduce violence in schools.", "The video was produced by an individual filmmaker and not by an established advocacy or government group.", "On 13 December 2014, filmmaker Rejina Sincic and her company Sleeper 13 Productions released a video titled \"Stop Gun Violence — PSA,\" depicting a child stealing a weapon from his parents and bringing it to school to turn in to his teacher. Both gun rights groups and anti-gun organizations were quick to criticize the actions depicted in the video:", "https://youtu.be/uad2wYfoj_w", "Alan Gottlieb, Chairman of the Citizens Committee for the Right to Bear Arms, called the video a \"public disservice announcement\" in a press release on 23 December 2014:", "The series of crimes depicted in this video is simply astonishing. We're talking about felony theft of a firearm, illegal possession of a handgun by a minor, having a gun in a school, illegal concealed carry by a minor, brandishing and maybe one or two other crimes, depending upon the jurisdiction.", "The fact that the gun appears to be a very real-looking BB pistol is not the point. The scenario obviously depicts what some youngster should do with a real handgun. Besides, even bringing a BB gun to school is against the law, and at the very least, the boy in this video would wind up being arrested and face felony charges.", "We understand from published reports that angry messages have been showing up on this company's Facebook page and rightly so. The message of this video is so monumentally stupid that if any youth does something like this after watching it, the producers should face charges. If someone is hurt, they should face both criminal and civil liability.", "This video isn't a public service announcement but a public dis-service and the producers ought to be ashamed.", "While the video was presented as if it were an official public service announcement from an established, reputable anti-gun organization, no evidence suggested this short film was produced by any recognized advocacy group. The credits at the end of the \"PSA\" stated the film was produced by an individual, Bethanny Line, rather than an organization. Furthermore, when The Coalition to Stop Gun Violence asked Rejina Sincic about who was behind the video, the filmmaker responded to say the film was self-funded:", "While it's not possible to decipher the filmmaker's intent in producing this \"public service announcement,\" it's clear Sincic enjoyed the attention her video has created, as she tweeted: \"Lot of people are afraid to share my PSA! If you are not a coward please share #gunviolence\"", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]