["About this rating", "Kicking, punching, or squeezing testicles has long been prized as an effective means to briefly incapacitate men, as it brings about a powerful full-body pain. The reasons for such a blow's power stems from the lack of protection the testes receive from the scrotum, the high concentration of pain receptors called nociceptors surrounding them, and the myriad interconnections between testicular nerves and organs throughout your body.", "The pain, medically called \"blunt scrotal trauma,\" typically subsides without incident. However, more serious complications can arise with enough force. Have such injuries resulted in death? Potentially, though most agree that other exacerbating factors have to be considered in addition to the testicular trauma.", "Perhaps one the earliest purported cases of death resulting from injury to the testicle was found in a brief but terrifying case report from 1843, which reads:", "In some parts of Germany a barbarous custom exists, in cases of quarrel, of violently compressing the testicles. M. Schlesier, of Peitz, relates a case of sudden death from this species of injury. The patient fell to the ground, was seized with violent convulsions, and died in a few minutes.", "Without further information, it is impossible to say what exactly happened in that specific incident. The reported heart attack suffered by thirteen-year-old boy whose testicles were squeezed as part of a schoolyard prank in 2014, however, may be illustrative of how (under rare and specific extenuating circumstances) stress from that kind of trauma could result in an immediate reaction similar to the 19th-century German account.", "Speaking to Vice News about the 2014 incident, Dr. Marc Bjurlin, a clinical instructor in Urologic Oncology at New York University, said that he can \"only speculate\" that the teenager had a hidden condition:", "“If that’s true in the case, I suspect the boy had an underlying etiology and that the scrotal injury, perhaps from the pain, resulted in a vasovagal response which may have lowered his blood pressure and exacerbated a cardiac etiology,” Bjurlin said.", "The sheer pain response from having one’s testicles yanked is more than enough to exacerbate any number of underlying conditions, he said.", "A 2008 case report of a different thirteen-year-old who had been kicked in the groin during a football game describes how he came down with a life-threatening, infection-mimicking condition called systemic inflammatory response syndrome (SIRS) after the trauma. This case report concluded that death from testicular trauma is a possibility that must be considered:", "In our case, the patient initially presented with a minor scrotal injury; swelling and pain without ecchymosis were the only symptoms. Then, without evidence of infection, he gradually progressed to a life-threatening condition, unresponsive to empiric antibiotics and standard fluid resuscitation.", "Now recovered, the patient continues to be monitored for any long-term consequences of his injury. Initially patients with acute scrotal pain are told to look for signs of injury and infection, but they should also be aware of the signs of sepsis and SIRS. Although rare, death is no longer beyond the realm of consequences from testicular injury and physicians must be prepared to deliver appropriate care.", "SIRS was, additionally, blamed for the death of an eighteen-year-old male in India who injured himself riding a bicycle:", "Few cases of acute scrotal pain might lead to Systemic Inflammatory Response Syndrome (SIRS), which is a life threatening condition. We report a case of an 18 year old boy who sustained testicular trauma while riding a bicycle and two months post trauma developed severe pain in left inguino-scrotal region, fever and subsequently died. The authors intend to report this unusual case as cases of testicular trauma resulting in shock and SIRS have been reported in literature but were unable to find cases of death occurring due to SIRS.", "Outside these rare (and still somewhat ill-defined) examples, the most plausible complications from testicular trauma are generally not life-threatening, though some (most notably trauma-induced testicular torsion) can lead to a loss of fertility or even the removal of a testicle if not properly treated. A 2004 consensus paper in BJU International outlined the potential injuries as a result of testicular trauma:", "Blunt trauma may cause local haematoma, ecchymosis of the scrotum, or injuries to the testicle, epididymis or spermatic cord. In testicular rupture the tunica albuginea is disrupted, while in intratesticular haematoma the tunica albuginea remains intact. Haematoceles, in which blood accumulates in the space between the tunica albuginea and tunica vaginalis, and hydroceles, can be the result of trauma. Traumatically induced testicular torsion is another well recognized entity.", "While there have been cases in both the media and the scientific literature that report a connection between testicular trauma and fatalities, these case reports are speculative, sparse, and do not provide enough information to confidently demonstrate the mechanisms hypothesized behind them. A kick in the balls may lead to serious complications, but most urologists agree that death is not one of them.", "Zerman, Dirk-Henrik, et al.   \"The Male Chronic Pelvic Pain Syndrome.\"\r\n    World Journal of Urology.   June 2001.", "Provincial Medical Journal.   \"Sudden Death from Injury to the Testicles.\"\r\n    18 February 1843   (page 412).", "Barna, Maxwell.   \"The Deadly Science Behind Testicle Squeezing.\"\r\n    Vice News.   20 April 2014.", "Okonkwo, Kingsley C., et al.   \"Testicular Trauma Resulting in Shock and Systemic Inflammatory Response Syndrome: a Case Report.\"\r\n    Cases Journal.   12 May 2008.", "Shashank, Pooniya, et al.   \"Testicular Trauma Resulting in Death Due to Shock and Systemic Inflammatory Response Syndrome (SIRS): A Case Report.\"\r\n    Journal of Indian Academy of Forensic Medicine.   3 March 2017.", "Morey, Allen F., et al.   \"Consensus on Genitourinary Trauma: External Genitalia.\"\r\n    BJU International.   25 August 2004.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]