["The unexpected death of U.S. Supreme Court Justice Antonin Scalia has thrown Washington, D.C., into tumult, with Democrats and Republicans clashing loudly about the timing of a replacement.", "The clash is especially notable in high-profile U.S. Senate races, including the one in New Hampshire that pits Republican Sen. Kelly Ayotte against her challenger, Democratic Gov. Maggie Hassan.", "Ayotte almost immediately backed Republican Majority Leader Mitch McConnell’s pledge not to take action on a Supreme Court nominee until after the election of the next president. And the state’s Democratic Party was quick to criticize.", "In a Feb. 16, news release, the party put it this way: \"Fearing discontent from her far-right base and pressure to appease her party bosses, Senator Kelly Ayotte has rejected her constitutional duty and decided to back Mitch McConnell’s controversial decision to block the Senate from giving fair and timely consideration to President Obama’s next Supreme Court nominee -- a move that would leave the nation’s highest court with an unprecedented year-long vacancy.\"", "While much of that statement is political boilerplate, we were interested in the last clause -- that refusing to bring up any Obama nominee would lead to an \"unprecedented year-long vacancy\" on the court.", "We decided to check it out.", "Asked for comment, the state Democratic Party directed us to two news stories. The first was an article from NPR that noted the longest time a Supreme Court nominee waited to receive a vote. That was in 1916, when Louis Brandeis waited 125 days. And a quick look at the calendar reminds us that Obama has more than 300 days remaining in office.", "Those are interesting numbers, and certainly suggest that if the Senate refuses to act on Obama’s nomination, there would be an unprecedented wait for a vote. But that’s not what the party’s press release said. It referred to a \"vacancy\" on the court itself, which is different.", "Later in the same NPR article, which cites the Congressional Research Service as a source, it’s said that:", "\"The longest vacancy on the Supreme Court was 27 months between the Tyler and Polk administrations before the Civil War. Tyler, derided as ‘His Accidency,’ because he was the first vice president elevated to the White House, also holds the distinction of a record eight nominees rejected or withdrawn.\"", "Tyler actually had another Supreme Court seat open up, and that one took more than 400 days to fill on its own. Taking those two openings from 1843 and 1844 into account, it certainly looks like a yearlong wait for a justice to be seated has precedence.", "The party also pointed to an article on the Time magazine website. This article, however, says that since the Supreme Court has had nine members -- going back to 1869 -- the court went 391 days without a ninth justice in 1969 and 1970. Over that time, the Senate rejected two nominations from President Richard Nixon.", "So while this article indicates that a yearlong vacancy on the court would be unusual, it wouldn’t be unprecedented. Even restricting our view of the court to its existence as a nine-member panel, it has spent one lengthy span -- less than 50 years ago -- without a ninth justice.", "There is one way in which McConnell’s threat would be unusual. As PolitiFact noted this week, it would be unheard of for the Senate to spend more than a year without acting on a Supreme Court nomination after such an appointment is made. In the past, extended vacancies on the court resulted from nominees being rejected sequentially, rather than not acted upon at all.", "Our ruling", "The New Hampshire Democratic Party said that not confirming a Supreme Court nominee from President Obama \"would leave the nation’s highest court with an unprecedented year-long vacancy.\"", "While the lack of Senate vote on an actual nominee would indeed be unprecedented, there are at least three examples of a seat in the Supreme Court going unfilled for more than a year, one of them within the last half century. The statement contains an element of truth, but ignores critical facts. We rate the statement Mostly False.", "\"Scalia’s death adds new dimension to presidential, New Hampshire Senate races,\" Concord Monitor, Feb. 16, 2016", "\"On Supreme Court Confirmation, Ayotte Kowtows to Far Right, Forgoes Constitutional Duty & Ignores People of New Hampshire,\" New Hampshire Democratic Party, Feb. 16, 2016", "Correspondence with New Hampshire Democratic Party, Feb. 17-18, 2016", "\"7 Things To Know About Presidential Appointments To The Supreme Court,\" NPR, Feb. 17, 2016", "\"There’s Ample Precedent For Rejecting Lame Duck Supreme Court Nominees,\" The Federalist, Feb. 13, 2016", "\"Antonin Scalia’s Open Supreme Court Seat Could Set Record For Vacancy,\" Time, Feb. 14, 2016", "Supreme Court Nominations, present-1789, United States Senate website", "\"Fact-checking claims about the 80-year SCOTUS nomination ‘tradition,’ \" PolitFact, Feb. 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]