["The video has been viewed more than six million times since it was posted to Twitter here on April 2.", "The caption of the 16-second clip states: “Sandra the orangutang started washing her hands because she saw all the zookeepers doing it repeatedly during the COVID-19 crisis.”", "COVID-19 has killed more than 62,000 people and infected over 1.1 million others worldwide as of April 6, according to the World Health Organization.", "Below is a screenshot of the misleading post:", "The video was also shared alongside a similar claim on Facebook here, here, here; Twitter here, here and here; and YouTube here.", "The claim is false.", "A reverse Google image search found a longer version of the video published here on Facebook on November 13, 2019, weeks before the novel coronavirus outbreak.", "The video, uploaded on the verified Facebook account of Florida-based animal sanctuary Center for Great Apes, carries the following caption: “Sandra washes her hands at the Center for Great Apes.", "“Sandra has daily pools of water and really likes to wash things -- her toys, her surroundings, and her hands! Sandra loves to clean up! #orangutancaringweek #cleanhands #bubblesarebest”.", "Below is a screenshot of the video in the misleading posts (L) and the Center for Great Apes video (R):", "The footage was filmed shortly after the 34-year-old orangutan arrived at the centre in November 2019, according to the sanctuary’s website.", "Echoing advice from health agencies on proper hand washing techniques during the COVID-19 pandemic, the Center for Great Apes reposted the video of Sandra here on Facebook on March 15 alongside the caption: “She definitely scrubbed her hands for longer than 20 seconds, good job Sandra! #washyourhands”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]