["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden has tapped Rachel Levine, a pediatrician and Pennsylvania’s health secretary, as his assistant secretary of health. If her nomination succeeds, Levine would become the first openly transgender federal official confirmed by the U.S. Senate. It has also inspired transphobic attacks against her.", "One doctored photo that’s spreading on social media wrongly says the image shows Levine and her family. The photo of three people standing arm in arm has been altered to look like Levine is in the center holding a dog.", "A description at the top of the photo reads, with typos: \"Biden’s new overweight transgender health secretary and her/his healthy family. Dr. Rachel Levine, she will be in charged of our healthy lifestyle. Congratulations America!!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The original photo shows Philip Chawner flanked by his daughters, Samantha and Emma. The British family appeared on a reality weight loss show called \"Lorraine Kelly’s Big Fat Challenge.\"", "Before being tapped for the Biden administration, Levine garnered national attention for her work overseeing Pennsylvania’s coronavirus response in the face of repeated attacks on her gender identity.", "We rate this Facebook post Pants on Fire.", "Facebook post, Jan. 29, 2021", "NBC News, Biden nominee Dr. Rachel Levine met with transphobic smear campaign, Jan. 26, 2021", "The Washington Post, Biden selects transgender doctor Rachel Levine as assistant health secretary, Jan. 19, 2021", "Irish Mirror, Mum walks out on TV reality fat family with a combined weight of 83 STONE, July 4, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]