["About this rating", "Donald Trump mentioned the word \"pizzagate\" during a 2011 interview.", "He was referring to a \"controversy\" concerning his use of a fork and knife to eat a slice of pizza, not the pedophilia conspiracy theory that clouded the 2016 election.", "In August 2017, months after the \"Pizzagate\" conspiracy theory was roundly disproved, a piece of video appeared that purportedly shows featuring Donald Trump talking to television anchor Piers Morgan in 2011 about the Anthony Weiner scandal.", "This time, however, it was repackaged as \"proof\" that the future president was one of the first to know about the debunked conspiracy theory that Washington, D.C.'s elite run a pedophilia ring out of a popular pizzeria's basement. For example, one YouTube user preceded the video by the following narration:", "This is an interview from 2011 with Donald Trump and Piers Morgan, i think that's his name, the scum bag guy that worked with Alex Jones for the second amendment. Blah blah blah you know the story. Anyway, Donald Trump is doing the interview with this guy and out of the blue he mentions pizzagate. This is 2011. Pizzagate. It's clear as a bell. You can't miss it. Now I ran back through 2011 and I can't find anything pizzagate related besides Donald Trump mentioning it.", "The YouTuber who posted the augmented video said that he couldn't find anything else from 2011 that was called or related to anything named Pizzagate, implying that Trump had perhaps predicted the manufactured 2016 controversy; however, we found several mentions of a 2011 Pizzagate moniker that had nothing to do with pedophile rings.", "This Pizzagate came from a June 2011 lunch meeting between Trump and former Alaska governor Sarah Palin. The two discussed various political matters, but much of the media was focused on a different detail: Trump ate his pizza with a fork. The revelation sparked a wave of opinion pieces about the proper way to eat pizza:", "Several thinkpieces were published around that time, bearing headlines such as: \"Donald Trump responds to Pizzagate 2011,\" \"Attention Hog? Donald Trump Addresses ‘Pizza-gate’ Via Strange Homemade Video,\" and \"Herman Cain On Trump’s ‘Pizzagate’: If You’re Born With A Silver Spoon, You Eat Pizza With Utensils\".", "Trump's 2011 interview with CNN aired amidst this tempest:", "Ever since former president Richard Nixon's Watergate scandal became enshrined in history, \"-gate\" has been a suffix tacked onto nouns in order to imply either political misconduct or impropriety, or a flurry of public outrage (sometimes facetiously). The fact that the word \"Pizzagate\" was used to describe two pizza-related attempts at manufacturing a national outcry is so inevitable that it cannot even charitably be described as a coincidence.", "Hamby, Peter.   \"Palin, Trump discuss 'potential candidates' over pizza in New York.\"\r\n    CNN.   1 June 2011.", "Martel, Franciz.   \"Herman Cain On Trump’s ‘Pizzagate’: If You’re Born With A Silver Spoon, You Eat Pizza With Utensils.\"\r\n    Mediate.   4 June 2011.", "Grant, Drew.   \"Donald Trump Responds to Pizzagate 2011.\"\r\n    Salon.   2 June 2011.", "Alvarez, Alex.   \"Attention Hog? Donald Trump Addresses ‘Pizza-gate’ Via Strange Homemade Video.\"\r\n    Mediate.   2 June 2011.", "Siegel, Joel.   \"Sarah Palin, Donald Trump Lambasted for Pizza Faux Pas.\"\r\n    ABC.   2 June 2011.", "Passikoff, Robert.   \"Politically Correct Pizza Party.\"\r\n    Forbes.   2 June 2011.", "Roberts, Christine.   \"Use Your Hands! New Yorkers Respond to Sarah Palin, Donald Trump Pizza-Eating Faux Pas.\"\r\n    New York Daily News.   1 June 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]