["About this rating", "A woman developed a life-threatening skin condition after she cut herself shaving.", "She did not get sick immediately, but several days later. The original story omitted the fact that the woman's immune system was already compromised.", "In April 2017, British tabloid the Daily Mail reported that a woman had developed a life-threatening skin infection after shaving in 2012:", "Dana Sedgewick, 44, from Sheffield, trimmed her pubic area with a brand new razor but ended up cutting a spot on her groin. Her body almost immediately went into shock, causing a red rash on her legs before they turned black from necrotising fasciitis — a flesh-eating infection.", "Rushed to intensive care, doctors operated to remove as much of the rotting skin as they could - but she developed sepsis during the procedure. She was placed in a coma as her family were told she had just a 30 percent chance of survival as her kidneys failed and her heart stopped four times.", "Necrotizing fasciitis is often referred to by the misnomer “flesh-eating bacteria.” It is often caused by common bacteria like Streptococcus, E. coli, and Staphylococcus -- but rather than actually consuming flesh, they release a toxin that can destroy skin and other surrounding cells. Necrotizing fasciitis happens when those bacteria infect a layer of connective tissue underneath the skin called fascia. The Centers for Disease Control and Prevention describes the condition this way:", "In cases of necrotizing fasciitis, bacteria spread quickly once they enter the body. They infect the fascia, connective tissue that surround muscles, nerves, fat, and blood vessels. The infection also damages the tissues next to the fascia. Sometimes toxins (poisons) made by these bacteria destroy the tissue they infect, causing it to die. When this happens, the infection is very serious and those infected can lose limbs or die.", "The infection can often begin with an extremely minor cut to the skin — something like a small cut during shaving would certainly count. A 2009 case report described one patient whose infection purportedly developed from the tiny prick of an acupuncture needle.", "Necrotizing fasciitis is uncommon. That same case report estimated that “most primary care physicians will be involved with managing at least one case during their time in practice, but [it is] infrequent enough for most to be unfamiliar with the disease.” The condition is less rare, however, in people with compromised immune systems, which make them unable to prevent bacteria from breaching into the fascia in the first place.", "We spoke to Sedgewick via Facebook. She told us that, while she has no personal recollection of the illness because she blacked out, the Daily Mail report appeared to mostly match what had been told to her by her nurses and doctors. However, she said, it also omitted key information.", "Most significantly, the numerous tabloid stories omitted the fact that her immune system was severely compromised when her infection began. The writer also took liberties with the timeline. While the story lead with the claim that she “almost immediately went into shock” after shaving, the reality is that she first felt ill two days later.", "Sedgewick, who still requires continued operations twenty-six surgeries later, told us that Daily Mail never interviewed her, but that their story was based on an account she told a UK press agency. She told us she had hoped to raise awareness about sepsis, a life-threatening complication of infections, but that the press agency’s process had led to the omission of information about her immune system and the sensationalization of some details.", "Matthews, Stephen.   \"Mother-of-three, 44, Develops Deadly Infection and Nearly Loses Her Legs After Trimming Her Pubic Hair With a Brand New Razor.\"\r\n    Daily Mail.   26 April 2017.", "Centers for Disease Control and Prevention.   \"Necrotizing Fasciitis.\"\r\n    Accessed 20 December 2017.", "Puvanendran, Rukshini, et al.   \"Necrotizing Fasciitis.\"\r\n    Canadian Family Physician.   October 2009.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]