["About this rating", "A GoFundMe credited to a Catherine Elizabeth Clennan boasts a goal of raising five million dollars to move to California and become independent.", "Whether the viral campaign is authentic or simply a social media publicity hoax.", "On 23 December 2016, a woman identifying herself as Catherine Elizabeth Clennan created a GoFundMe campaign destined for viral attention, in which she asked donors to supply her with US$5,000,000 in order to fulfill her \"lifelong dream\" (of having five million dollars).", "Clennan's bid for money stated that at 27, she dreamed of one day being independent of her family who \"pay for everything\" for her. Although she said that she hoped to raise $2,000,000 to buy a home in California, the campaign's goal was set at more than twice that amount:", "My name is Catherine Elizabeth Clennan and my whole life I have been trying to live by other's definitions of who I 'should be'. I have been trying so hard to live this lie that I came face to face with a choice: either live as others definitions of you and die OR strike out on your own and find for yourself who you really are. Well I chose life. I chose to live by my own definition ... With this choice I am in the process of turning my life in a new direction. Currently I live in Laramie, Wyoming. in a property owned by my family. They pay everything for me - and I am 27 years old. I feel that as long as I live by their definition I am 'taken care of', but this definition is leading me to deaths door - it forces me to live a lie - to turn my back to who I really am; a free spirit, an artist, a woman, a lesbian, a civil rights activist, a woman who goes against the grain, a woman who knows that not everything is as it seems.", "I need $2,000,000 dollars to purchase my dream home in California. I need the money to help me walk out of the lie that I am living, but more importantly I need the money to live my dream - which is to live as much as my life in the spiritual dimension as possible.", "The money will go towards the purchase of a new home, new transportation, and the various fees and taxes that accumulate with a move across the country.", "These funds will help me live the life that I feel I am meant to live, the life I want to live - the life defined not by other people - but by me. These funds will help me break free from the tyranny of what other people think is 'right'. The 'right' job, the 'right' education, the 'right' way to earn a living...", "Although GoFundMe marked the campaign as \"trending\" as of 28 December 2016, Clennan had only received $21 of that goal on that date:", "Although she has not indicated that her campaign is a hoax or prank (and GoFundMe has not flagged or removed it), Clennan does not appear to have much of an online footprint other than this campaign, aside from a LinkedIn profile and what may be a Huffington Post contribution (which as of April 2016 indicated she was an active student). That single article led some social media users to claim Clennan worked for the Huffington Post, but it looked as if she had submitted only one piece as a contributor.", "In that article, Clennan expressed a desire to \"be a public figure\":", "Exposing my vulnerabilities publicly and confidently gave that girl the strength she needed to participate. That’s when I knew exactly what I wanted to do with my life — I want to use computer science to inspire other women to explore computer science.", "I want to be a public figure in computer science that is the exact opposite of what you would typically expect to find in the field. I want to be that girl who no one thought she could, who had all the odds against her, that everyone thought was dumb, and yet she becomes incredibly successful in computer science. Then I want to turn that success around and use it as a pedestal to expose every wound, every failure, every painful vulnerability I have, even with my hands trembling,", "Clennan invited potential donors to visit her Facebook page for more information, but few additional details were available there. It remains possible that her goal is genuine and presented honestly with no expectations that it would go over poorly or go viral, but also within the realm of possibility that the GoFundMe request was a step in her stated aim to become a public figure.", "Clennan, Catherine.   \"The Benefits Of Being A ‘Dumb’ Girl In Computer Science.\"\r\n    Huffington Post.   12 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]