["On February 3, BJP spokesperson Sambit Patra tweeted a 45-second video clip with the claim, “वो जीना चाहते है और हमारे बच्चे मरने को तैयार है (They want to live and our children are ready to die) Dangerous very Dangerous Wake Up before it’s too late!!”. The tweet has amassed close to 5,000 retweets so far. In the clip, a Muslim clergyman while making a provocative statement says*, “The way they have been torturing us. If we give a signal and instigate our young children then our children have way more strength than them. It’s because they find them alone. Remember they are our children, through the media, we want to let the whole people of this country know that we are the children of the man who stood on the dome of Kubbat Al Sakhra and said to Jews that Jews, you have ten people who want to live and I have the ones who want to die. We are the community, which embraces death.” It is important to note here that the clip is being shared in the backdrop of protests against the Citizenship Amendment Act (CAA) and ahead of the upcoming Delhi assembly elections.", "“वो जीना चाहते है और हमारे बच्चे मरने को तैयार है” Dangerous very Dangerous.. Wake Up before it’s too late!! pic.twitter.com/g8bstexmnW", "— Sambit Patra (@sambitswaraj) February 3, 2020", "[Translation: जिस तरीके से वो हमारे साथ वो साथ अत्याचार करे रहे है। अगर हमारे नौजवान बच्चों को हमने एक दफा इशारा कर दिया और उकसा दिया। तो हमारे बच्चे उनसे कई ज्यादा ताकत रखते है। वो अकेला पाके। हमारे बच्चे, को याद रखना, हमारे बाचे, हम, याद रखना की हम उस आदमी की औलाद है, मीडिया के माध्यम से पुरे मुल्के उन खुराफाती लोगों से ये बात पहुंचा दो की हम उस आदमी की औलाद है जिन्होंने कुब्बत अल सख़रा के गुंबद पर खड़े होके कहा था की यहूदियों तुम्हारे पास दस ऐसे लोग है जो जीना चाहते है और मेरे पास एक लोग है जो मरना चाहते है। हम मौत को गले लगाने वाली कौम है।]", "Swarajya columnist Shefali Vaidya also quote-tweeted the same video posted by one Geetika Swami and opined, “Where is the outrage on this?”. The combined retweet count of Swami and Vaidya’s post exceed 4,500.", "With a keyword search on Google, Alt News found that the same video was shared by Facebook page ‘Yogi Adityanath -True Indian‘ in July 2019. Thus, the video is not recent and unrelated to anti-CAA protests.", "Mufti Raees Ahmed, the district president of Jamiat Ulema-e-Hindi, had participated in a protest organized by the Muslim community on June 27, 2019. It was a demonstration outside at Dehradun court in the wake of Tabrez Ansari’s lynching in Jharkhand. He gave the objectionable speech while speaking to media persons and according to a Times of India report, a case was registered with the Kotwali police under section 153 A (1)(b) [promoting enmity between different groups on grounds of religion] and 505-2 [hate speech] of the Indian Penal Code (IPC).", "A longer version of the statement issued by Mufti Raees Ahmed can be heard in the video clip posted below.", "In conclusion, an old video of a provocative statement given by a Muslim clergyman after Tabrez Ansari’s lynching was shared by BJP spokesperson Sambit Patra in the backdrop of anti-CAA protests and the run-up to the assembly elections in Delhi on February 8, 2020. Patra has tweeted the video without context, giving the impression that it is a recent speech. Moreover, the speech was made in Uttarakhand and not Delhi, as claimed on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]