["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A headline on a North Dakota political blog wrongly said Sen. Heidi Heitkamp, D-N.D., high-fived Sen. Chuck Schumer, D-N.Y., following a controversial abortion vote.", "\"Heitkamp High-Fives Schumer After Voting Against 20-Week Abortion Ban,\" the headline reads.", "The vote in question was to proceed to a motion that would make nearly all abortions after 20 weeks illegal and subject anyone who performed the procedure to prison time or fines. The 51-46 yea-to-nay vote fell below the filibuster threshold of 60 votes, and Heitkamp’s vote was one of those nays.", "But did Heitkamp follow up her vote with a celebratory high-five with the Senate minority leader?", "The main image, a screen grab from C-SPAN, certainly makes it seem that way. But the video, which is embedded in the story, shows more of an awkward greeting than a crude celebration.", "The footage shows Heitkamp walking into the chamber as she converses with Cory Booker, D-N.J.. She responds to the clerk’s roll call in the negative, and resumes chatting.", "As they speak, Schumer approaches Booker and Heitkamp, and Heitkamp catches his eye. They each wave hello with their hands up, and Heitkamp reaches her hand out to meet Schumer’s as he lands at their side. They clasp hands, exchange a few inaudible words, and let go as Booker pats Schumer’s shoulder. The vote was about halfway through, so the hand clasp was not in reaction to a final tally.", "Typical high fives involve slapping of two hands in celebration. This was a very gradual meeting of awkwardly waving hands.", "\"They were greeting each other to say hello, as senators often do during votes,\" said Abigail McDonough, Heitkamp’s communications director.", "Justin Goodman, Schumer’s press secretary, confirmed the senators did not speak about the vote when they greeted each other.", "The vote was held on a Monday night, so it was the first time a lot of the senators would have seen each other since the previous week.", "Rob Port, the editor of the blog, did not provide any evidence that the hand-gesture was about the vote.", "\"Looked like a high five to me, but the video speaks for itself I think,\" Port said.", "The clip was generated by a C-SPAN user, who titled it \"Heitkamp & Schumer High-Five Over Abortion Vote.\" Tom Campbell, Heitkamp’s Republican challenger, posted the clip to his Facebook page three hours before the SayAnythingBlog post was published.", "A SayAnythingBlog.com headline said, \"Heitkamp High-Fives Schumer After Voting Against 20-Week Abortion Ban.\"", "The headline suggests the celebration of a pro-abortion victory, but that’s not what the footage shows.", "The video shows an awkward hand waving-turned-holding between Schumer and Heitkamp on a Monday night. Both senators said they did not mention the vote on the floor, and that they were simply greeting each other. Port provided no evidence that the two were celebrating the vote.", "We rate this statement False.", "Say Anything Blog, Video: Heitkamp High-Fives Schumer After Voting Against 20-Week Abortion Ban, Jan. 29, 2018", "C-SPAN, Heitkamp & Schumer High-Five Over Abortion Vote, Jan. 29, 2018", "C-SPAN, Senate Session, Jan. 29, 2018", "Email interview with Rob Port, SayAnythingBlog.com editor, Feb. 5, 2018", "Email interview with Justin Goodman, Chuck Schumer press secretary, Feb. 5, 2018", "Email interview with Abigail McDonough, Heidi Heitkamp communications director, Feb. 5, 2018", "Congress.gov, S.2311 - Pain-Capable Unborn Child Protection Act, Jan. 29, 2018", "Merriam Webster, High five, accessed Feb. 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]