["About this rating", "On 29 January 2016, the web site Disclose TV published an article that was rife with sensational and misleading claims, chief among them that the country Iceland had forgiven its entire population of (mortgage) debt, but a \"total US media blackout\" prevented most Americans from learning about this remarkable turn of events that had taken place three years earlier:", "The US Rothschild Controlled Media (RCM) has completely BLACKED OUT/CENSORED any news about Iceland's DEBT FORGIVENESS. If you Google \"ICELAND FORGIVES ENTIRE POPULATION OF MORTGAGE DEBT\" you will get 'About 359,000 Results'. Not one of them is a Media Outlet in the US. Not one single Major or Minor news outlet in America has mentioned a single word about this story.", "This is TOTAL MEDIA CENSORSHIP and a TOTAL MEDIA BLACKOUT, and it should tell you who owns and runs the Media in America. We are allowed to see a tortured, bleeding, dying Gaddafi anywhere, but we are not allowed to know about Debt Forgiveness.", "There were two major problems with the above-referenced article. First, Iceland did not forgive the debt of its entire population. Second, there was no media blackout imposed on U.S. news outlets about covering the financial crisis in Iceland.", "The source of this story was a 2012 news broadcast on the Spanish-language network TeleSur. Disclose TV likely chose this Spanish-language broadcast in order to enforce the idea that a \"total US media blockout\" had prevented American new outlets from covering the story, which simply wasn't the case.  Sources as diverse as Bloomberg, Think Progress, NPR, and the Washington Post all reported on this issue well before 2016.", "While it's true that searching \"ICELAND FORGIVES ENTIRE POPULATION OF MORTGAGE DEBT\" on Google in February 2016 yielded few results from the United States, that wasn't because of a media blackout. One reason for this phenomenon because the issue was three years in the past at that point. Another reason was because the claimed event simply didn't happen: Iceland never forgave its entire population of all their mortgage debt.", "Reports from 2012 (many of which were written by U.S. media outlets) noted that while Iceland forgave a large amount of mortgage debt in order to boost the economy's recovery from a financial crisis, this action did not entail entirely wiping out all home mortgages held by all citizens of Iceland.  Rather, it involved forgiving a portion of some mortgage debt that was tied to inflation:", "In Iceland, a lot of people have these odd mortgages that adjust with inflation. And when the financial crisis happened, there was a lot of inflation in Iceland. [One woman] remembers getting these statements saying she owed more and more. And I don't mean she just owed more that month. The total amount she owed to the bank went up by 30 percent. It's, like, if you'd borrowed $100,000 for your house, all of the sudden, you owed a $130,000.", "After the crisis, people were stuck with much larger mortgages than they'd started with. It was this wound that just would not go away. So last year, when Iceland's Progressive Party found itself with very low poll numbers, it proposed the [debt forgiveness] jubilee, though it didn't call it that.", "The party promised to go back and correct everyone's mortgages — basically, forgive the additional debt everyone had built up in 2008 and 2009. It's a beautiful idea that you could go back in time and try to undo this one very painful part of the financial crisis, make it like it had never happened. One problem with the jubilee idea of forgiving debt is that there's always someone on the other side, someone who lent the money.", "But there is a plan to make even this part feel painless. The money to pay for the jubilee would come from a tax on three dead Icelandic banks — banks that many people blamed for Iceland's part in the financial crisis. A lot of people were really into the proposal. The Progressive Party ran on the jubilee idea and won.", "As Bloomberg noted, the mortgage debt forgiveness program reportedly only affected about a quarter of Iceland's population (and given that the home ownership rate in Iceland in 2012 was 77.9%, it's likely that far more than that proportion of the population was carrying mortgage debt):", "Since the end of 2008, the island's banks have forgiven loans equivalent to 13 percent of gross domestic product, easing the debt burdens of more than a quarter of the population, according to a report published this month by the Icelandic Financial Services Association.", "The Washington Post's Wonkblog took a more skeptical view of the matter, opining that the Icelandic government's mortgage relief policy hadn't done much more than undo a portion of a serious financial problem that their \"bizarre\" laws had made much worse in the first place:", "Most mortgages are indexed either to a foreign currency or inflation, so the former doubled when the krona crashed and the latter, well, inflated when inflation subsequently took off. The perverse result is that devaluation and inflation have actually made Iceland's household debt problem worse, not better. That's why the headlines about Iceland writing off 13 percent of GDP of household debt are so misleading. That's just making up for the fact — and maybe not even then — that Iceland's bizarre borrowing laws have pushed up their households' debt burdens so much.", "Iceland's recovery has become a myth wrapped in a legend inside a legend. It let its banks fail, slashed household debt, let its currency collapse, put capital controls in place — and now it's doing better than those countries that did austerity! In reality, Iceland let its banks fail for foreigners, wrote down household debt only after their laws had made it worse, had no choice but to watch the krona plummet, but, at the same time, tried to keep it from plunging too far by limiting how much money people could take out of the country.", "Or, as one online commentator on the issue observed:", "This wasn't really much of a jubilee: You have people who got [home] loans they could afford, but which had a provision that could add a lot of principal to the debt if something unexpected happened, which did happen. Then you had some different people pay off the difference. Asking if people are happy about this is like [asking if everybody is happy they] got an inappropriate $100,000 charge on their phone bills, and the government came in and got some rich foreigners to pay it.", "A more sensible plan might be to say that the lenders' inflation hedge can't be applied as originally specified, and people owe closer to the amount of money they actually got their loans for (rather than the amount of money that's now worth what that money was worth then).", "Kestenbaum, David.   \"Iceland Experiments with a Jubilee of Debt Forgiveness.\"\r\n    NPR.   11 December 2014", "Valdimarsson, Omar R.   \"Iceland Reveals $1.25 Billion in Mortgage Reductions.\"\r\n     Bloomberg Business.   2 December 2013.", "O'Brien, Matt.   \"The Miraculous Story of Iceland.\"\r\n    The Washington Post.   17 June 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]