["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the campaign trail, Democratic presidential candidate Hillary Clinton has pitched herself as someone who will continue many of President Barack Obama’s policies.", "At a campaign rally in Kentucky May 16, Clinton praised the 2009 auto industry bailout, which people view as an Obama success.", "\"We saved the auto industry,\" she said. \"That’s important in Louisville. It’s important in Bowling Green. It’s important in Northern Kentucky. It’s important across this commonwealth. That’s a big difference between me and my opponent in the primary. I voted to save the auto industry, he voted not to. It’s important to know that it was the right vote because we just had the best year for the auto industry in America in history.\"", "We’ve already looked into how Clinton’s primary opponent, Sen. Bernie Sanders, voted on the auto bailout, which totaled an estimated $85 billion. But we were also curious about Clinton’s claim that 2015 was \"the best year for the auto industry in America in history.\"", "This is true by one big measure: Americans bought more cars and trucks in 2015 than ever before. But that success might mask long-term issues with American manufacturers, especially given foreign manufacturers’ growing market share.", "In 2015, Americans bought more than 17.5 million cars. The last peak was 17.3 million in 2000, followed by a collapse to 10.4 million at the height of the recession in 2009.", "Additionally, the past six years have been the longest period of sustained year-over-year growth in auto sales since the 1920s, according to Auto Alliance, a vehicle manufacturer association.", "Vehicle sales wax and wane with the economy. Wards Auto, an analytics organization, has tracked vehicle sales since 1963.", "When times are tough, vehicles become a discretionary purchase that consumers are willing to put off. Analysts believe car sales have done so well in the past couple of years because of a combination of the improving economy, cheap gas prices, available credit and low interest rates for loans.", "Experts we asked agreed with Clinton’s claim, saying the sales figures are a reasonable way to measure the auto industry’s health.", "\"She's right,\" said Bruce Belzowski, managing director of the automotive futures group at the University of Michigan Transportation Research Institute. \"By any objective measure, the auto industry bailout is an Obama success story.\"", "The Detroit Three big automakers — Ford, General Motors and Fiat Chrysler — reported strong sales in 2015 and projections for 2016. But it’s worth remembering that the record-breaking total vehicle sales figure isn’t just for American-made cars. It includes foreign models sold in the United States, too. Of the 2.4 million cars sold so far in 2016, 71 percent were imports, according to the Wall Street Journal.", "David Lewis, a professor emeritus of business history at the University of Michigan, compared 2015 to the golden age of the American car industry.", "\"Think of 1955, a record sales year, and a time in which well over 90 percent of the vehicles sold in the U.S. were manufactured by American companies,\" Lewis said.", "Even taking into account the number of foreign versus American car purchases, Clinton’s claim is reasonable because foreign car sales count as part of the \"auto industry,\" said Clifford Winston, a senior fellow in economic studies at the Brookings Institution. Foreign cars have been a growing part of the U.S. auto market since the 1980s.", "But it might not be fair to take her claim as proof of the long-term health of American manufacturers, Winston said. While the bailout resurrected struggling American auto manufacturers, it’s possible that it just stalled the companies’ eventual decline as consumers choose foreign cars instead. He also noted potential future threats from ride-sharing services and self-driving cars.", "\"Let us not get too excited about one or even a few years of successes with this industry that has been extremely turbulent and repeatedly rescued by the government,\" Winston said. \"All the while, the Detroit share has gone down. So that tells you something that any given year still may mask long-term issues.\"", "This is partially reflected in employment data. Employment among car dealers has in fact returned to its pre-recession high of about 1.2 million, according to the Bureau of Labor Statistics. But employment in the motor vehicle and parts manufacturing sector hasn’t completely recovered. About 1.3 million people worked in this sector in the early 2000s; that figure dropped to about 620,000 at the height of the recession in 2009, and it has risen to about 920,000 in early 2016.", "But \"for the factories that made it out of the recession, all is well,\" Belzowski said.", "U.S. vehicle production in 2015 was the eighth-largest in history, at 11.9 million. That’s high — and almost double production in 2009 — but still not quite as high as it was in the late 1990s and early 2000s.", "Some industry analysts expect the good times to keep coming for the next few years, with 2016 breaking more records, according to the Detroit Free Press.", "\"It’s a great time to be in the automobile business, and it’s particularly sweet for those who lived through the dark days of 2009 and 2010,\" said IHS Automotive analyst Tom Libby.", "Our ruling", "Clinton said, \"We just had the best year for the auto industry in America in history.\"", "With sales figures that exceed the pre-recession high, 2015 was a great year for the auto industry, including American manufacturers.", "This high point should be taken with a grain of salt because it might mask long-term issues with American manufacturers, especially given foreign manufacturers’ growing market share.", "Clinton’s statement is nearly accurate but requires that extra bit of context, so we rate it Mostly True.", "Wards Auto, \"U.S. Car and Truck Sales, 1931-2015,\" Jan. 22, 2016", "Auto Alliance, Sales Data, accessed May 20, 2016", "Bureau of Labor Statistics, \"Automotive Industry: Employment, Earnings, and Hours,\" May 18, 2016", "Car and Driver, \"Boom! We Look Back at 2015 U.S. Auto Sales, the Best Year Ever,\" Jan. 8, 2016", "Wall Street Journal, Market Data Center: Auto Sales, May 3, 2016", "Wall Street Journal, \"U.S. Car Sales Set Record in 2015,\" Jan. 5, 2016", "Detroit Free Press, \"Detroit Three auto sales soar in record year,\" Jan. 7, 2016", "Washington Post, \"U.S. car sales hit record high in 2015,\" Jan. 5, 2016", "PolitiFact, \"Did President Obama save the auto industry?\" Sept. 6, 2012", "Phone interview, Brookings senior fellow Clifford Winston, May 19, 2016", "Emails, Bruce Belzowski, managing director of the automotive futures group at the University of Michigan Transportation Research Institute, May 18, 2016", "Emails, David Lewis, a professor emeritus of business history at the University of Michigan, May 19, 2016", "Emails, James Rubenstein, geography professor at Miami University, May 18, 2016", "Emails, Clinton spokesman Josh Schwerin, May 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]