["About this rating", "On 29 April 2019, Chase Bank generated a spate of online anger by posting a tweet advising people to cut back on eating out and buying coffee to avoid low account balances. Although the tweet was deleted, images of it were captured and shared on Twitter by users who thought the statement to be tone deaf and insulting.", ".@Chase: Stop spending the money you earn.\nUs: I have student loans\nUs: My rent is skyrocketing\nUs: Chase charges me a fee for having <$1500 in my account. pic.twitter.com/uPQf9GqRl5", "— Allied Progress (@AlliedProgress) April 29, 2019", "Some, like presidential candidate and U.S. Senator Elizabeth Warren (D-Massachusetts), criticized the bank for admonishing customers amid rising costs of living and after taking billions in federal bailouts.", ".@Chase: why aren’t customers saving money?\nTaxpayers: we lost our jobs/homes/savings but gave you a $25b bailout\nWorkers: employers don’t pay living wages\nEconomists: rising costs + stagnant wages = 0 savings\nChase: guess we’ll never know\nEveryone: seriously?\n#MoneyMotivation pic.twitter.com/WcboMr5MCE", "— Elizabeth Warren (@SenWarren) April 29, 2019", "Others pointed to the tweet as symptomatic of the times we live in.", "This is the ideology of our age captured in a single tweet.", "Systemic problems recast as individual problems. Corporate greed recast as personal failure. A bank claiming to \"motivate\" its customers by mocking them for structural economic problems the bank is complicit in causing. pic.twitter.com/4I0pK6xKJm", "— Anand Giridharadas (@AnandWrites) April 29, 2019", "Amid blowback, Chase acknowledged its misstep in a follow-up tweet and pledged to do better.", "Our #MondayMotivation is to get better at #MondayMotivation tweets. Thanks for the feedback Twitter world.", "— Chase (@Chase) April 29, 2019", "It's not the first time a major corporation had to backtrack on so-called financial advice meted out to members of the public. In 2013, McDonald's was on the receiving end of public backlash after trying to teach its employees how to create a personal budget, which assumed they had to work two jobs to survive but also failed to account for such necessities as child care and groceries.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]