["About this rating", "In November 2015, social media rumors claimed Tidy Cats Lightweight cat litter was making pets ill (in particular, causing \"breathing problems\"):", "Hearing cats experiencing severe respiratory issues and death from usage of Tidy Cats Lightweight Litter.", "I believe Tidy Cat lightweight litter either caused my cats death or contributed to it. She was 19 years old and had never been sick in her life. About 6 months ago or a little longer we started using this litter and about 4 months ago she started having breathing issues. After many trips to the vet and a lot of money spent we finally had to put her down about 3 weeks ago. The day we were taking her for her final trip to the vet we noticed that her feet were caked with this litter. Not only that but it was on her stomach. Also every place she had been laying for the past month was coated in cat litter as well.", "Multiple e-mails we received referenced Amazon.com  reviews (dating back as far as February 2014) that described instances in which cats were purportedly sickened by Tidy Cats Lightweight cat litter:", "... it took her coming down with strange upper respiratory infection symptoms and then spraying blood all over the floor of her room for me to realize what was wrong. This litter made her sick! The dust made it seem like she had a cold. Then she ingested some of the litter while trying desperately to get it out from between her toes, and it tore up her tummy. I was horrified. Originally the vet thought her bloody symptoms might have been due to an infection, but her tests came back clean. Then it dawned on me that it was all the litter. I mentioned that to the vets and they agreed.", "This litter may cause harm to your pets. Over the weekend an acquaintance of mine purchased this litter for the first time and her cat, who has never had any respiratory problems, began wheezing which escalated into a severe asthma attack and had to stay in an oxygen cage to recover. The cat now may have a lifelong asthma when she never had it before. Many people spoke of the dust hurting their lungs when scooping and their pets sneezing and wheezing after using their boxes. Please be aware of this product and what could happen. I have had to edit my review. The cat that was affected so severely by this litter has passed away. Stay away from this product.", "We bought this last week to replace the normal tidy cats formula that we use and we began seeing sneezing and respiratory issues with our cats and even with our dogs (even though they don't use the litter boxes). We noticed a warning online about this formula and contacted Tidy Cats directly and were told to keep an eye on them and take them to the vet as needed. We were also informed that. and this was yesterday (5/14/2014) that they have received a large number of similar reports and that there had been a total of 7 deaths among cats reported to them in the past 5 days. Today, 5/15/2014, they received another report of a death as a result of their litter. One of our cats passed this afternoon due to severe respiratory issues. The other cats are being closely watched and we have removed all traces of the litter from the home. Depending on the outcome with the Purina company we may be filing a lawsuit against them.", "Clearly, the rumors about Tidy Cats Lightweight and respiratory problems in cats circulated for several months, at least via Amazon reviews. However, some of the top-rated reviews described anecdotal experiences with the product (via an acquaintance), others mentioned an unsubstantiated suspicion with which a vet purportedly agreed, and a third claimed she was \"informed\" of a cluster of cat deaths without indicating by whom she was given such information. (Did it come from Purina, or was it a social media rumor?) A Reddit user surmised their cat's death was attributable to Tidy Cats Lightweight, but fellow users of the site pointed out that the pet in question was 19 years old at the time of its demise.", "Some versions of the rumor maintained that rather than altering the formula in response to the purported cat deaths, Purina opted to quietly compensate grieving pet owners to quash rumors:", "@TidyCats @howdycuz2 according to a friend of mine they're paying people off when they complain", "— erika lauren (@erikalauren) November 18, 2015", "We were unable to find any first-hand reports of Tidy Cats customers receiving compensation for illness or injury to their pets, though the image-based example seen above included a claim that a \"friend\" had received a $300 check from Purina for a portion of veterinary expenses. In response to Twitter queries about the rumor, the @TidyCats account responded:", "@RussellMadison_ Pets are our passion. Rest assured all our products are completely safe. Reach out with questions: https://t.co/22GQLHNOud — Tidy Cats (@TidyCats) November 13, 2015", "On 7 December 2015, we received a response from a Purina representative regarding an inquiry about the rumor:", "Tidy Cats Lightweight litter is safe for cats. We understand cat owners’ concerns when they see negative posts on social media, but the rumor about Tidy Cats LightWeight litter is not true. Unfortunately, social posts like this are often anonymous, based on hearsay, or contain unsupported information. People empathize and share the posts, which unfortunately spreads more confusion.", "Nearly half of all cat-owning households use Tidy Cats. As with any product used by more than 16 million households, consumers occasionally post on social media or contact us to express concerns, particularly when their pet is having other issues. We take every consumer inquiry seriously and encourage any consumer with a concern about their pet’s experience to consult with their veterinarian, and to call our toll-free number so we can better understand and address their specific concern.", "We are cat-lovers too, and our number one commitment is the health and well-being of pets. We conduct extensive testing of our litter products, including for dust and a safety review by a veterinary toxicologist of all materials used in the manufacturing process. Consumers can continue to purchase Tidy Cats with confidence.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]