["About this rating", "In January 2019, a number of online trolls spread a graphic accusing Sen. Elizabeth Warren (D-Mass.) of keeping an object of racist memorabilia -- a caricature figurine depicting a black child eating a slice of watermelon -- atop her kitchen cabinets.", "This spurious claim was initially pushed by users on the Internet forum 4Chan and the r/The_Donald section of Reddit, but it was also promoted to a larger audience by Fox News contributor Tomi Lahren (who later deleted her tweet on the subject):", "This accusation was based solely on an obscured glimpse of an object that was only partly visible in the background of an Instagram Live Q&A video. While some Internet users apparently saw what they wanted to see when they glimpsed this object, a closer inspection revealed that the knickknack on Warren's shelf was not in fact a piece of antiquated racist memorabilia.", "Here's a better look at what's actually on Senator Warren's shelf.  The supposed \"racist figurine\" appears to be nothing more than an ordinary reproduction of a Greek urn or vase:", "Kristen Orthman, Warren's press secretary, provided us with a few photographs showing the items atop the senator's kitchen cabinets. The first image is a screenshot of Warren's Instagram Live video, the second is a photograph taken from a similar angle as the Instagram Live video, and the final photograph provides an unimpeded look at the object on Warren's shelf:", "Senator Elizabeth Warren does not have a racist piece of memorabilia atop her kitchen cabinets. This accusation was made in bad faith and without evidence in an attempt to smear the Massachusetts politician.", "CBS News.   \"Elizabeth Warren Talks Iowa Trip, Drinking Beer on Instagram Live.\"\r\n    2 January 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]