["About this rating", "In May 2017, the federal National Marine Fisheries Service decided not to implement a proposal that would have shut down one particular fishery off the coast of California if a certain number of protected marine mammals were entangled in fishing nets and killed.", "The decision was not made by Donald Trump himself, nor did it overturn or cancel several other existing protections for marine mammals both off the West Coast and nationwide.", "In the summer of 2017, reports emerged that the administration of President Donald Trump had reversed existing plans to enhance protections for certain marine animals off the West Coast of the United States.", "On 12 June 2017, the Washington Examiner published an article with the headline \"Trump cancels whale and sea turtle protections,\" which was shared more than 62,000 times on Facebook and read:", "The Trump administration on Monday tossed out a rule on marine protection for whales and sea turtles caught in fishing nets off the West Coast.", "The rule change was made despite the fishing industry's having proposed the measures in the first place, according to the Associated Press. The National Marine Fisheries Service, a division within the Commerce Department, said it decided the new protection rules were not warranted.", "\"Under the proposed regulations, caps would have been established for five marine mammal species and four sea turtle species,\" the agency explained in a final action published in the Federal Register Monday afternoon. \"When any of the caps were reached, the fishery would have been closed for the rest of the fishing season and possibly through the following season.\"", "The decision has continued to cause concern among some observers throughout the ensuing 12 months, and enjoyed a resurgence of online attention in July 2018.", "The Washington Examiner article, unlike other more comprehensive (but less widely shared) reports from June 2017, contained a mix of accurate statements and incomplete or misleading characterizations of the decision made at that time.", "Background", "In 2015, the Pacific Fisheries Management Council recommended to the National Marine Fisheries Service (which is part of the National Oceanic and Atmospheric Administration, or NOAA) that they introduce \"hard caps\" on the number of marine mammals, including whales and sea turtles, that could be \"taken\" (i.e., caught up in fishing nets) in a particular type of fishing along the West Coast.", "The fishery in question involves around 20 vessels, mainly targets swordfish off the coast of California, and uses a method called \"drift gillnet\" (DGN) fishing, which involves wide mesh nets lowered under the surface of the water to passively catch the target fish as they move into the paths of the nets.", "Because of the passive nature of this fishing method (which literally involves casting a very wide net), other species are sometimes inadvertently caught up and killed and then thrown back into the sea. This process is known as \"bycatch.\"", "Under the 2015 proposal, if the bycatch met or exceeded a certain level, the entire fishery of 20 vessels would be shut down for at least the remainder of that fishing season.", "The fisheries service drafted a proposed new rule (RIN 0648-BG23) based on these recommendations, then oversaw a period of consultation and consideration of alternatives to the proposal, its potential impacts, and so on — a process known as a \"regulatory impact review.\" This process is standard practice in federal agencies across government departments when considering a possible change to regulations. Some proposals are ultimately adopted, and others are not.", "In the end, the Pacific Fisheries Management Council, which advises and guides regulatory actions and policy-making by the fisheries service, recommended implementing the hard caps. However, the fisheries service disagreed and in May 2017 decided not to implement the proposed rule.", "Michael Milstein, a spokesperson for the fisheries service, told us that it is \"somewhat unusual\" for the fisheries service to go against the recommendations of the Pacific Fisheries Management Council but explained the rationale behind the decision, which was ultimately overseen by Barry Thom, regional administrator for the NOAA Fisheries west coast region.", "According to Milstein, during the 1970s and 1980s, non-target species, including some animals designated as protected and even endangered, were being entangled in drift gillnets used for commercial swordfish and shark fishing — hundreds per year at one point. \"Historically, there was a clear problem,\" he told us.", "In response to this, the fisheries service set up task forces known as \"take reduction teams,\" composed of scientists and fishermen, whose function was to find ways to reduce the number of animals being entangled and killed in commercial fishing.", "Along the West Coast, the take reduction team came up with several ways to minimize and mitigate against the unintended bycatch resulting from drift gillnet fishing, including \"pingers\" and \"net extenders.\" According to Milstein, these innovations have dramatically reduced the number of non-target species being entangled in drift gillnets:", "Pingers are devices that hang on the net and emit sounds to alert whales and marine mammals that the nets are there, so they can avoid them...They also developed what are called \"net extenders.\" A drift gillnet looks kind of like a curtain, and these net extenders — instead of having the top of the curtain right up against the surface of the water, which is where many marine mammals travel — these net extenders essentially lower the net down at least 36 feet beneath the surface. So that allows the space above them for animals to travel back and forth.", "Milstein also pointed to the protected areas that have been established off the west coast, in which drift gillnet fishing has been banned entirely, in order to protect sea turtles in particular.", "So there are strong protections for marine mammals, and there was a dramatic reduction in the numbers of animals entangled, as a result.", "Milstein's assertion is supported by scientific evidence. A NOAA technical memorandum published in January 2017 found that acoustic pingers, in particular, had driven major declines in the level of bycatch among several species of whales, dolphins, and turtles, since the mid-to-late 1990s. Among some species, in particular the beaked whale, bycatch has been close to eliminated.", "For this reason, Milstein told us, the fisheries service decided that the potential benefits of imposing a hard cap on bycatch numbers, which were already low and declining, were outweighed by the potential economic damage done to the fishery, if it were to be shut down:", "We concluded that it would essentially cost the fishermen significantly more — because of the risk of being shut down entirely — for no real benefit, because we've already brought the number of entanglements and deaths down dramatically, to the point where there are very few animals taken [entangled] each year.", "Some environmental activists have rejected this rationale. Catherine Kilduff, a lawyer for the Center for Biological Diversity, told the Associated Press in June 2017 that even relatively small numbers of deaths can have an outsized impact on communities of endangered species. \"If they catch one, it’s a huge problem for the population,\" she argued.", "Todd Steiner, director of the California-based Turtle Island Restoration Network, told the Los Angeles Times that the Trump administration had \"declared war on whales, dolphins and turtles off the coast of California.\" He claimed that the overall number of animals taken in drift gillnets had declined because the fishery itself had shrunk, but the rate of bycatch had not gone down, which would imply that the overall number of animals killed could increase again if the fishery experienced a resurgence.", "Milstein said the potential economic damage caused to some fishermen by shutting down the entire fishery would be \"hard for them to bear,\" and suggested such an outcome would be especially unfair for those fishermen who were \"doing everything right\" and properly implementing existing take reduction measures.", "In their final ruling on the proposal in May 2017, the fisheries service wrote:", "[The National Marine Fisheries Service] found that implementing the [Pacific Fisheries Management] Council’s proposed regulations to establish protected species hard caps for the [drift gillnet] fishery would have minor beneficial effects to target and non-target fish species and protected species at the cost of significant adverse economic effects to the participants in the fishery if and when closures would occur.", "In particular, the fisheries service indicated that the economic costs to a fisherman of a one or two-season closure could force them into alternative employment altogether, and if that were not available to them, these short-term costs could easily escalate into long-term economic damage if the hard caps were implemented.", "Conclusion", "The Washington Examiner's headline — \"Trump cancels whale and sea turtle protections\" — was misleading. First, the decision was not taken by President Trump himself, but rather was overseen by NOAA Fisheries West Coast regional administrator Barry Thom, after an extensive period of consultation and a standard regulatory impact review. Thom was appointed to the post in October 2016, during the administration of President Barack Obama.", "Second, the headline could give rise to the impression that President Trump (or his administration) had terminated all protections for whales and sea turtles or had actively unraveled existing protections. This was not the case, as we have explained. Several protections, proven to be effective, remain in place.", "And finally, the article described the May 2017 decision as a \"rule change,\" but in fact it was the opposite. What had been proposed was a new rule, not a change, and the fisheries service's decision simply meant that that new rule would not be implemented, keeping in place the status quo.", "Siciliano, John.  \"Trump Cancels Whale and Sea Turtle Protections.\"\r\n  The Washington Examiner.  12 June 2017.", "Knickmeyer, Ellen.  \"US Cancels New Protection for Endangered West Coast Whales.\"\r\n  Associated Press.  12 June 2017.", "Weikel, Dan.  \"Trump Administration Cancels Proposed Limits on Marine Mammals and Sea Turtles Trapped in Fishing Nets.\"\r\n  &nbsp Los Angeles Times.   12 June 2017.", "National Marine Fisheries Service, West Coast Region.  \"Final Regulatory Impact Review and Final Regulatory Flexibility Analysis for the Protected Species Hard Caps for the California/Oregon Large-Mesh Drift Gillnet Fishery Proposed Rule, RIN 0648-BG23.\"\r\n  National Marine Fisheries Service, National Oceanic and Atmospheric Administration.  May 2017.", "National Oceanic and Atmospheric Administration.  \"Proposed Rule — Fisheries Off West Coast States; Highly Migratory Fisheries; California Drift Gillnet Fishery; Protected Species Hard Caps for the California/Oregon Large-Mesh Drift Gillnet Fishery.\"\r\n  Federal Register.  13 October 2016.", "Caretta, James V. er al.  \"Technical Memorandum -- Regression Tree and Ratio Estimates of Marine Mammal, Sea Turtle and Seabird Bycatch in the California Drift Gillnet Fishery: 1990-2015.\"\r\n    National Marine Fisheries Service, National Oceanic and Atmospheric Administration.   January 2017.", "National Marine Fisheries Service, West Coast Region.   \"Two Decades Later, Focused Efforts on Reducing Entanglements in Gillnet Fishery Still Paying Off.\"\r\n    June 2017.", "Northwest Fishletter.   \"Thom Is New NOAA Regional Leader, Norman Appointed to Power Council, Wilson Hired by Snake River Alliance.\"\r\n    Northwest Fishletter.   3 October 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]