["One of the posts, which we’ve archived here, shows a photo of a huge tortoise stretching its neck, with the caption, ‘A 344 year old tortoise popularly known as ALAGBA in the palace of the Soun of Ogbomoso has passed on. The scared tortoise which was the oldest in Africa, was sick for a few days before her demise on Thursday.’ The post has been shared more than 200 times on Facebook.", "The same photo was also shared in this Facebook post, which similarly claims that it shows the famous Alagba. The same photo identifying the tortoise as the world’s oldest has also been circulating in French, shared more than 6,000 times here on Twitter and more than 1,600 times here on Facebook.", "The wrong tortoise", "A famous tortoise known as Alagba did die last month in the palace of the traditional ruler of Ogbomoso in southwestern Nigeria, as AFP reported on October 5, 2019. ‘Although animal experts doubt the tortoise could have attained such an advanced age, its royal owners say Alagba, meaning Elder, had lived in the palace for centuries,’ AFP reported.", "A Google image search for ‘Alagba’ reveals a photo and video of the famous tortoise posted to an Ogbomoso community website and YouTube account. These images suggest that the animal is much smaller than the one in the photo shared thousands of times on Facebook and Twitter.", "Where does the giant tortoise photo come from?", "As for the picture of the giant tortoise, a reverse image on Google shows that it was published on the Australian Daily Telegraph news website in an article published on April 30, 2014 about the birth of two Galapagos tortoises at Taronga Western Plains Zoo in New South Wales, Australia.", "The Galapagos tortoise, hailing from the islands of the same name in the Pacific, is the largest tortoise species in the world, measuring up to 1.5 metres (five feet) long, according to National Geographic.", "We checked the Daily Telegraph article by visiting the zoo’s website and following a link to its official Instagram page, where we found the same photo of the giant tortoise in a post from April 30, 2014. “Taronga Western Plains Zoo has continued its Galapagos Tortoise breeding success, welcoming two new hatchlings!” the caption reads. “The hatchings will take 20-25 years to reach their full size and may live up to 150 years!”", "“Our photo shows the tiny pair next to three-year-old hatchling, NJ and one of our adult males,” it adds.", "Small, bigger, biggest! ? Taronga Western Plains Zoo has continued its Galapagos Tortoise breeding success, welcoming two new hatchlings! The hatchlings will take 20-25 years to reach their full size and may live up to 150 years! Our photo shows the tiny pair next to three-year-old hatchling, NJ and one of our adult males.", "Une publication partagée par  Taronga Zoo (@tarongazoo) le 29 Avril 2014 à 9 :36 PDT", "Contacted by AFP, a spokeswoman for Taronga Western Plains Zoo confirmed that the giant tortoise seen in the photo is a Galapagos tortoise at the zoo known as ‘A11’.", "“The tortoise in the photo is still alive today and would be in its 50s. They can live up to 150 years,” she told us by email.", "A 344-year-old tortoise?", "As mentioned in AFP’s article on the death of Alagba, experts doubt the Nigerian tortoise could have made it to the ripe old age of 344.", "“The maximum lifespan for a tortoise is well over 100 years, but the average lifespan is less. A tortoise that looks ancient is often only 30-40 years old,” Craig Stanford, professor of biological sciences and anthropology at the University of Southern California in Los Angeles, told us by email.", "“You could say that a tortoise could live to 150, but usually much less,” added Stanford, whose 2010 book “The Last Tortoise” is about extinction threats faced by the species.", "According to the Guinness World Records, the oldest living tortoise is believed to be Jonathan, a Seychelles giant tortoise living on the South Atlantic island of St Helena. Aged at least 187 -- though no one knows for certain -- Jonathan’s age has been estimated by the fact that he ‘was said to be “fully mature” (and hence at least 50 years old) when he arrived on the island in 1882”. He is currently listed by Guinness as the oldest known living land animal, as well as the oldest tortoise.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]