["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A TV attack ad portrays Florida Democrat Andrew Gillum as so \"far out\" that he is on another planet.", "\"Gillum wants to increase Florida taxes by a billion dollars. Disaster for the economy,\" says an ad by the Republican Governors Association showing Gillum’s headshot floating in space.", "The 30-second ad also attacks Gillum over his support for Medicare for All and abolishing the U.S. Immigration and Customs Enforcement. But here, we’ll focus on whether Gillum wants to raise Florida taxes by $1 billion.", "He does, though the ad doesn’t make clear what taxes Gillum wants to raise, who would pay, and how Florida would spend the additional revenue.", "Gillum has proposed increasing Florida’s corporate tax rate from 5.5 percent to 7.75 percent to generate an additional $1 billion a year. His opponent, Republican Ron DeSantis, has signed a pledge not to raise taxes.", "Gillum said he would put that extra revenue toward education, including a minimum teacher salary of $50,000 and raising pay for veteran teachers to the national average. Gillum also plans to invest in early childhood education programs and vocational training.", "The state corporate tax currently generates about $2.5 billion a year. Most businesses, however, are exempt from paying any tax because the state exempts the first $50,000 in taxable income.", "Gillum’s campaign said he would keep that exemption to protect small businesses, but said he wants to close loopholes that allow other corporations to avoid paying taxes.", "Put simply, Gillum’s plan is to have Florida’s biggest corporations pay $1 billion more a year in taxes. That could affect average Floridians, experts told us. But it is difficult to put a dollar figure on it.", "Kurt Wenner, vice president of research at Florida TaxWatch, said that if a business is forced to pay more in taxes, it can raise prices, reduce employment, reduce costs or investment, or reduce profits.", "\"Those outcomes would all potentially have negative impacts on residents,\" Wenner said. \"The magnitude of those impacts would be hard to quantify, especially factoring in any economic increase from increase government spending.\"", "There’s also no way to guarantee that the full $1 billion would flow into the state’s revenues. Corporations could take legal tax planning measures to reduce their liability. That could make funding Gillum’s education priorities more challenging.", "At the same time, an increase in the tax rate could have negative impacts on corporations’ decisions about where to locate and whether to expand.", "Richard Auxier, research associate at the Urban-Brookings Tax Policy Center, said the cost of corporate taxes is shared among stockholders and, unintuitively, among a broader group of workers and investors. The Tax Policy Center assumes 80 percent of the burden is borne by investment returns (dividends, interest, capital gains, etc.), with the remaining 20 percent weighing on wages and other labor income.", "\"Would average Floridians pay some of a corporate tax hike (in the form of lower wages and/or higher prices)? Yes. Would they pay a lot? Nope,\" Auxier told PolitiFact. \"Would investors and managers (who are not all in Florida because multi-state companies pay the tax, too) pay a lot? Yup.\"", "Randall G. Holcombe, a Florida State University economics professor, said that a higher tax would discourage business.", "\"Floridians who do not directly pay corporate income tax will still bear a cost of slower economic growth in Florida,\" he said. \"They may also pay higher prices if corporations are able to pass through that tax increase to customers, but the big cost will be slower economic growth.\"", "The Republican Governors Association said that \"Gillum wants to increase Florida taxes by a billion dollars.\"", "The ad leaves out the details that voters might want to know about Gillum’s proposal. Gillum proposes raising the corporate tax rate from 5.5 to 7.75 percent, generating about an extra $1 billion from Florida’s biggest corporations to put toward education.", "The tax wouldn’t directly target the average Floridian, but experts say at least some of the cost could trickle down.", "The claim is accurate but needs additional information. We rate it Mostly True.", "Republican Governors Association, Ad, Sept. 12, 2018", "Andrew Gillum, Campaign website, Accessed Sept. 12, 2018", "Tampa Bay Times \"Andrew Gillum proposes corporate tax hike for more education funding,\" Jan. 19, 2018", "Americans for Tax Reform, \"Gillum Wants 40 percent corporate tax rate hike,\" Aug. 29, 2018", "Tax Foundation, \"State Corporate Income Tax Rates and Brackets for 2018,\" Feb. 7, 2018", "Tax Policy Center, \"Who bears the burden of the corporate income tax?\" Accessed Sept. 12, 2018", "Florida Department of Revenue, Corporate income tax, Accessed Sept. 13, 2018", "Enterprise Florida, Tax advantages, Accessed Sept. 13, 2018", "Florida Center for Fiscal and Economic Policy, \"Keeping and modernizing Florida’s corporate income tax will best serve the state,\" March 2015", "PolitiFact, \"No, Florida's Andrew Gillum does not have a far left socialist platform,\" Sept. 6, 2018", "PolitiFact, \"Ron DeSantis leaves out context in claim that Andrew Gillum wants to abolish ICE,\" Sept. 11, 2018", "PolitiFact’s Scott-O-Meter, Eliminate Florida's corporate income tax over 7 years, Last update Jan. 6, 2016", "PolitiFact, \"Rick Scott says majority of businesses are exempt from business taxes,\" Sept. 6, 2013", "Interview, Jon Thompson, Republican Governors Association spokesman, Sept. 12, 2018", "Interview, Franco Ripple, Andrew Gillum campaign researcher, Sept. 12, 2018", "Interview, Kurt Wenner, Florida TaxWatch vice president of tax research, Sept. 12, 2018", "Interview, Richard Auxier, research associate in the Urban-Brookings Tax Policy Center at the Urban Institute, Sept. 12, 2018", "Interview, Katherine Loughead, Tax Foundation policy analyst, Sept. 12, 2018", "Interview, Randall G. Holcombe,  Florida State University economics professor, Sept. 12, 2018", "Interview, Valerie Wickboldt, Florida Department of Revenue spokeswoman, Sept. 12, 2018", "Interview, McKinley Lewis, Gov. Rick Scott spokesman, Sept. 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]