["Republican presidential candidate Rick Santorum made a number of claims about prenatal testing and abortion on CBS News' \"Face the Nation\" on Feb. 20, 2012. We checked some of them out.", "During an interview on CBS News' Face the Nation on Feb. 19, 2012, Rick Santorum got into a lengthy discussion of prenatal issues with host Bob Schieffer. We’re looking at two claims from that exchange; but here we’re focusing on here is that \"90 percent of Down syndrome children in America are aborted.\"\n   \nLet’s first look at the context of Santorum’s claim.\n   \nReferring to a comment Santorum had made on the campaign trail in Columbus, Ohio, Schieffer said, \"You sound like you're saying that the purpose of prenatal care is to cause people to have abortions, to get more abortions in this country. … any number of people would say that's not the purpose at all.\"\n   \nSantorum responded, \"Well, Bob, that's simply not true. The bottom line is that a lot of prenatal tests are done to identify deformities in utero, and the customary procedure is to encourage abortions. … You said prenatal care. I didn't say prenatal care shouldn't be covered. We're talking about specifically prenatal testing, and specifically amniocentesis, which is a procedure that actually creates a risk of having a miscarriage when you have it and is done for the purposes of identifying maladies of a child in the womb. In many cases, and in fact most cases physicians recommend, particularly if there's a problem, recommend abortion. We know, Bob, that 90 percent of Down syndrome children in America are aborted.\"\n   \nFirst, let’s recap what PolitiFact Florida found when it checked a similar claim in April 2011 that came up during a daylong debate over six abortion bills in the Florida House of Representatives.\n   \nRepublican state Rep. Richard Corcoran said -- and the Florida Alliance of Planned Parenthood Affiliates publicized it on Twitter -- that \"90 percent of babies with Down syndrome are aborted.\"\n       \nCorcoran cited a New York Times article from 2007 that discussed how effective prenatal testing to detect Down syndrome could reduce the number of children born with the genetic condition, and how parents of children with Down syndrome were trying to convince others not to abort fetuses that tested positive for the condition. The story included almost the same line that Corcoran used -- that \"about 90 percent of pregnant women who are given a Down syndrome diagnosis have chosen to have an abortion.\"\n   \nThe story did not say specifically where the statistic came from. However, the online version did include a link to an abstract of a medical study discussing abortion rates after a prenatal diagnosis of Down syndrome. The study is from 1999 by the Psychology and Genetics Research Group at King's College in London. It compiled 20 other studies measuring abortion rates and concluded that, following a prenatal diagnosis of Down syndrome, 92 percent of women chose to have an abortion.\n       \nWe searched and found other studies that showed similar percentages.\n       \nA study from researchers at Wayne State University in Michigan examined the cases of 145 pregnancies with a prenatal diagnosis of Down syndrome from 1988-97. The study found that 19 (13.1 percent) women chose continuation of the pregnancy, while 126 (86.9 percent) chose termination. Another study examined 131 prenatally diagnosed cases of Down syndrome in Hawaii from 1987-96. The study found that women in 110 of those cases (84 percent) chose to have their pregnancies terminated. A study in San Francisco published in 2006 found an overall rate of 81 percent.\n       \nThat's three different medical studies, all reaching similar conclusions. Similar statistics were referenced in two books we found about prenatal testing (here and here).\n       \nHowever, in additional research for this article, we’ve found information that makes the question less cut-and-dried.\n\nIn a joint statement, the American College of Obstetricians and Gynecologists and other groups cautioned against generalizing about national patterns from a series of smaller, local studies.\n   \n\"No current, comprehensive estimate of the number of pregnancy terminations following prenatal diagnosis exists,\" the statement said. \"Several studies reporting older data, studies from single centers and studies from other countries have reflected variation in the number of pregnancies terminated. These studies are frequently cited, but given their limitations, are difficult to generalize to the current population of pregnant women in the United States. Undocumented observations from prenatal genetic counselors in the United States suggest that the rate of termination for prenatally diagnosed Down syndrome may vary across the country. New research is called for to comprehensively explore the uptake of prenatal testing and the outcomes of prenatally diagnosed pregnancies in order to more accurately define how women currently incorporate prenatal testing into their lives.\"\n\nACOG suggested we talk to Mark I. Evans, a physician and president of the Fetal Medicine Foundation of America and a professor of obstetrics and gynecology at Mt. Sinai School of Medicine. He emphasized that the percentage can vary significantly based on region and other factors.\n\n\"In liberal areas such as New York City, probably 80 to 90 percent of patients with severe abnormalties do choose to terminate when legal to do so,\" Evans said. \"In conservative areas, the proportion of terminations is much lower, perhaps as little as 10 percent\" in some cases.\n\nWe also located a paper in the journal Issues in Law & Medicine, titled \"Informed Consent or Institutionalized Eugenics? How the Medical Profession Encourages Abortion of Fetuses with Down Syndrome.\" The paper cites the example of a professor and practitioner, Elizabeth Gettig, who found that \"almost 100 percent\" of women with a Down syndrome diagnosis chose to abort when she practiced in North Carolina, but the number dropped to about half when she relocated to Pittsburgh. Gettig offered several reasons for the disparity.\n\n\"First, the Pittsburgh region has a higher percentage of Catholics,\" the paper said. \"Second, there are more services than most cities in Pittsburgh to assist children who have disabilities.\"\n   \nOur ruling\n   \nA number of scientific studies have shown an abortion rate from 80 percent to 90 percent -- close to what Santorum said -- but all have been localized. Since there’s evidence that the decision to abort can vary by region, we think it’s an overstatement for Santorum to say that after prenatal diagnosis, \"90 percent of Down syndrome children in America are aborted.\" There are no standardized, national numbers, so his use of the term \"in America\" is problematic. On balance, we rate his statement Half True.", "Rick Santorum, interview on CBS News' Face the Nation, Feb. 19, 2012", "PolitiFact Florida, \"Rep. Richard Corcoran says 90 percent of prenatal Down syndrome cases result in abortion,\" April 28, 2011", "Florida House, floor debate, April 27, 2011", "Florida Alliance of Planned Parenthood Affiliates Twitter account, April 27, 2011", "New York Times, \"Prenatal Test Puts Down Syndrome in Hard Focus,\" May 9, 2007", "U.S. National Library of Medicine, National Institutes of Health, \"Termination rates after prenatal diagnosis of Down syndrome...\" Sept. 19, 1999", "U.S. National Library of Medicine, National Institutes of Health, \"Determinants of parental decisions after the prenatal diagnosis of Down syndrome,\" Sept. 23, 1998", "U.S. National Library of Medicine, National Institutes of Health, \"Prenatal diagnosis and elective termination of Down syndrome in a racially mixed population in Hawaii, 1987-1996,\" Feb. 19, 1999", "U.S. National Library of Medicine, National Institutes of Health, \"Variation in the decision to terminate pregnancy in the setting of fetal aneuploidy,\" Aug. 2006", "U.S. National Library of Medicine, National Institutes of Health, \"Prenatal diagnosis, pregnancy terminations and prevalence of Down syndrome in Atlanta,\" Sept. 2004", "Fetal Diagnosis and Therapy, \"The Choices Women Make About Prenatal Diagnosis,\" 1993\n\nObstetrics & Gynecology, \"Determinants of Parental Decision to Abort or Continue After Non-Aneuploid Ultrasound-Detected Fetal Abnormalities,\"  July 1992\n\nPrenatal Diagnosis, \"Variation in the decision to terminate pregnancy in the setting of fetal aneuploidy,\" 2006\n\nIssues in Law & Medicine, \"Informed Consent or Institutionalized Eugenics? How the Medical Profession Encourages Abortion of Fetuses with Down Syndrome,\" Summer 2008", "Norman Ford, \"The prenatal person: ethics from conception to birth,\" accessed April 27, 2011", "Rayna Rapp, \"Testing women, testing the fetus: the social impact of amniocentesis in America,\" accessed April 27, 2011", "\"Toward Concurrence: Understanding Prenatal Screening and Diagnosis of Down Syndrome from the Health Professional and Advocacy Community Perspectives,\" June 17, 2009", "Interview with Rep. Richard Corcoran, April 27, 2011", "Interview with Mark I. Evans, president of the Fetal Medicine Foundation of America and professor of obstetrics and gynecology at Mt. Sinai School of Medicine, April 22, 2011", "Email interviews with Rebecca Wind, spokeswoman for the Guttmacher Institute, April 27, 2011 and Feb. 21, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]