["A mob, frustrated with stringent lockdown rules, pelted stones at policemen in Ahmedabad’s Shahpur area on May 8. The clashes reportedly erupted when cops and paramilitary forces tried to enforce the curfew and asked locals to stay indoors. Speaking with International news agency Reuters, Ahmedabad police commissioner Ashish Bhatia informed that the police fired teargas shells to disperse the crowd and that the attack left one policeman injured.", "Local Gujarati news channels also reported the incident. ABP Asmita aired a visual allegedly showing the policemen being chased away by locals in Shahpur. In the visual, a group of men can be seen chasing the policemen along with the RAF personnel. ABP Asmita’s broadcast video was posted by Twitter user Chintan Joshi.", "The video is also viral on WhatsApp with the claim that it depicts the incident in Ahmedabad’s Shahpur area.", "Alt News found that the video broadcasted by ABP Asmita actually depicts a similar incident that recently took place in Howrah, West Bengal. Police personnel were attacked by a crowd defying the lockdown in Tikiapara area of the city.", "#WATCH: A crowd, which had gathered at a market place in Tikiapara of Howrah today – defying the lockdown, attacked Police personnel & pelted stones at them when they asked the crowd to return to their homes. 2 police personnel injured. #WestBengal (Video source: Amateur video) pic.twitter.com/EAZbm5wWlc", "— ANI (@ANI) April 28, 2020", "On April 28, The Telegraph reported, “Around 200 men had attacked policemen in uniform with stones and damaged at least two police vehicles when the cops had tried to enforce the lockdown.” According to the report, two cops were injured in the attack while 13 people were arrested by the police.", "In conclusion, ABP Asmita relayed a visual of an attack on police personnel in Howrah, West Bengal as a similar incident from Ahmedabad, Gujarat.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]