["Sara Meaney, Wisconsin's tourism secretary, says the state has 15,000 lakes -- \"More than Minnesota.\" (Michael Sears/Milwaukee Journal Sentinel)", "Wisconsin and Minnesota have no shortage of regional squabbles.", "Packers vs. Vikings. Badgers vs. Gophers. Soda vs. pop (it’s soda).", "Better cold tolerance? Nicer people?", "More lakes?", "New state Tourism Secretary Sara Meaney stuck her toe into the lake dispute May 9, 2019 during an appearance on \"Wisconsin’s Afternoon News\" on WTMJ radio.", "\"Wisconsin, many people may not be aware, actually has 15,000 freshwater lakes,\" she said.", "\"More than Minnesota?\" asked host John Mercure.", "\"More than Minnesota,\" said Meaney. \"Absolutely. We win. We win.\"", "Minnesota is the \"Land of 10,000 Lakes,\" as the state’s license plates declare. But Wisconsin isn’t exactly a desert.", "As residents of both states head for the nearest body of water in droves this Memorial Day weekend, we thought we would, well, dive into this one.", "Who has more lakes?", "Not an easy question", "Our quest begins with the simplest version of this question.", "Hey Wisconsin, how many lakes do you have?", "15,074, says the Wisconsin Department of Natural Resources.", "Hey Minnesota, how many lakes do YOU have?", "11,842, says the Minnesota Department of Natural Resources.", "Congratulations, Wisconsin, you win?", "Nope. It's not nearly that simple.", "What makes a lake?", "Let's start by figuring out what a lake is. Does a lake have to have a name? Be a certain size? What if it’s actually a flowage? (And what the heck is a flowage?) What about intermittent lakes, that come and go by season (as opposed to year-round lakes)?", "Minnesota defines a lake as a body of water greater than 10 acres. That’s how it got the 11,482 number in its Public Waters Inventory.", "Wisconsin defines a lake as, well, anything it feels like calling a lake. Thousands are less than 10 acres. Of the 15,074 \"documented lakes\" in the state, 60% don’t even have a name.", "If we use Wisconsin’s lake database and apply the same 10-acre standard as Minnesota, Wisconsin has only 5,898 lakes. But the two state databases have different criteria for inclusion so this alone doesn’t settle our debate.", "Peter Boulay, a climatologist with the Minnesota DNR, said different agencies use different definitions of lake for their own purposes, but there is no nationally accepted definition. He deferred to Paul S. Welch, a University of Michigan professor who in 1935 literally wrote the book on limnology — the study of lakes and other bodies of fresh water.", "Welch wrote that generally accepted definitions of lake describe \"a body of standing water completely isolated from the sea and having an area of open, relatively deep water sufficiently large to produce somewhere on its periphery a barren, wave-swept shore.\"", "But he pointed out unique lake shapes and makeup create problems for this definition and chose instead to define lakes by exclusion. Welch said ponds are \"very small, very shallow bodies of standing water in which quiet water and extensive occupancy by higher aquatic plants are common.\"", "Anything larger, he said, is a lake.", "Meanwhile, the U.S. Geological Survey doesn’t officially define lakes.", "Its National Hydrography Dataset merges lakes and ponds into a single category. And the agency notes at least 54 generic terms have characteristics similar to a lake. Examples include a basin, a pond, a reservoir and a flowage (water accumulated upstream from a dam).", "Meaney’s office wasn’t much help on the definition issue. When we reached out seeking backup for the claim, spokesman Craig Trost shared this via email:", "\"Three facts are undeniable:", "1. Minnesota boasts more than 10,000 lakes.", "2. Wisconsin boasts more than 15,000 lakes.", "3. 15,000 is larger than 10,000.\"", "Of course, that just puts us back where we began.", "Still, our pursuit is not hopeless. We just need to use the same measuring stick for each side.", "We turned to Stephen Aichele, a geographer with the U.S. Geological Survey. He used the National Hydrography Dataset — which combines all inland water bodies into a lake/pond category — to compare Wisconsin and Minnesota bodies of water using various thresholds.", "And, in Aichele’s words, \"each variant of the question comes up the same way.\"", "Based on the federal data:", "— Minnesota has 124,662 lake/pond features, while Wisconsin has 82,099.", "— Minnesota has 8,784 lake/pond features with a name, while Wisconsin has 5,481.", "— Minnesota has 14,444 lake/pond features of 10 acres or more, while Wisconsin has 6,176.", "For context, 10 acres is about seven-and-a-half football fields (including end zones). That’s also the cutoff Minnesota uses to define lakes.", "Using a 25-acre cut off, Minnesota also has more than twice as many lakes — 8,466 to 3,350.", "Fear not, Wisconsin readers.", "Our research did uncover a couple lake metrics where Minnesota is lacking.", "Deepest lake: The deepest natural lake in either state is Green Lake in central Wisconsin, with a maximum depth of 236 feet. That’s 27 feet deeper than Minnesota’s deepest entry, Ten Mile Lake. (Wisconsin’s Wazee Lake in Jackson County is a whopping 350 feet at its deepest, but it’s a manmade lake made from an abandoned iron mine.)", "Surface area: Wisconsin also dominates in the percentage of surface area covered by lakes, with 17% compared to 8% for Minnesota.", "Of course, that tally is dramatically skewed by the inclusion of Lake Michigan on the Wisconsin side of the ledger, which vastly outstrips the small corner of Lake Superior claimed by Minnesota.", "Removing the Great Lakes from the equation, Minnesota has 5.4% of its surface area covered by lakes compared to 2.7% for Wisconsin.", "Minnesota also has the largest lake, with Red Lake (288,000 acres) easily topping Wisconsin’s Lake Winnebago (137,708).", "Meaney claimed Wisconsin boasts more than 15,000 lakes — \"more than Minnesota.\"", "But those numbers use vastly different definitions of \"lake,\" with thousands counting toward the tally in Wisconsin that wouldn’t meet the definition in Minnesota. If both states used Minnesota’s 10-acre minimum standard — or really any other reasonable metric — Minnesota has about twice as many lakes.", "We rate Meaney’s statement False.", "But we’ll still give the tourism department’s spokesman the last word here:", "\"At the end of the day,\" Trost said, \"we are happy to let Minnesota count their lakes and their Super Bowl championships, and we’ll count our own.\"", "WTMJ radio, Wisconsin’s Afternoon News, interview with Wisconsin Tourism Secretary Sara Meaney, May 9, 2019", "Wisconsin State Journal, \"Just Ask Us: Minnesota or Wisconsin — which state has more lakes?\" Feb. 5, 2018", "KARE11, \"VERIFY: Does Minnesota or Wisconsin have more lakes?\" Nov. 15, 2017", "Email exchange with Peter Boulay, Assistant State Climatologist, Minnesota State Climate Office, May 10-13, 2019", "Minnesota Department of Natural Resources, Lakes, rivers, and wetlands facts, accessed May 10, 2019", "Wisconsin Department of Natural Resources, Find a Lake, accessed May 13, 2019", "Wisconsin DNR, Wisconsin Lakes, 2009", "Email exchange with Sarah Hoye, spokeswoman, Wisconsin DNR, May 10-17, 2019", "Email exchange with Stephen Aichele, geographer with the U.S. Geological Survey, May 17-20, 2019", "Email exchange with Craig Trost, spokesman, Wisconsin Department of Tourism, May 10-17, 2019", "Paul S. Welch, \"Limnology,\" 1935", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]