["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Rush Holt says the federal mandate requiring most health care plans to offer free contraceptive coverage makes sense.\n\nAnd he claims a majority of Americans agree with him.\n\nFierce debate on the issue erupted when guidelines issued by the U.S. Health and Human Services Department that required insurance plans to cover birth control as preventive services, without co-pays or deductibles, were made final without exemptions for some employers with religious affiliations. On Feb. 10, President Barack Obama announced a compromise: if a religious-affiliated employer objected to providing contraceptive coverage, the responsibility would fall on the insurance company.\n\nIn a Feb. 24 e-mail newsletter explaining his support for Obama’s decision, Holt (D- 12th Dist.) said: \"Nearly all American women, including women of faith, have used contraception sometimes, and a clear majority of Americans support removing the cost-sharing requirement for prescription contraceptive coverage.\"\n\nOur colleagues at PolitiFact national recently ruled on a claim that addressed the first half of Holt’s statement. A White House official said: \"Most women, including 98 percent of Catholic women, have used contraception.\" That claim earned a Mostly True.\n\nWith the birth control plan still under fierce scrutiny, we questioned Holt’s other claim. Despite all the rancor, do Americans favor the plan?\n\nHolt’s spokesman, Thomas Seay, pointed to a February health tracking poll from the Kaiser Family Foundation that found that 63 percent of respondents support the \"new federal requirement that private health insurance plans cover the cost of birth control\" and 33 percent oppose it. The margin of error was 3 percentage points.\n\nBut that’s just one poll of 1,519 adults. We found seven other surveys that asked respondents about their views on requiring health care plans to cover birth control. Five support Holt’s claim.\n\nA CBS News/New York Times poll found an even larger majority of Americans -- 66 percent -- support the plan requiring private health insurance plans to cover the full cost of birth control. About a quarter of respondents opposed the plan, with a margin of error of 3 percentage points. When asked specifically about the same requirement for employers with religious affiliations, support decreased slightly, with 61 percent in favor and 31 percent opposed.\n\nA recent Fox News poll found 61 percent of respondents supported \"requiring employer health plans to cover birth control for women\" and 34 percent opposed. The poll had a margin of error of 3 percentage points.\n\nA survey by the Democratic firm Public Policy Polling conducted on behalf of Planned Parenthood and a poll by the Public Religion Research Institute both found majorities in support of employers providing health care plans that would cover the cost of birth control.\n\nAnother poll conducted for NBC News and the Wall Street Journal found 53 percent of respondents favored the requirement and 33 percent opposed it, with a margin of error of 3.5 percentage points. That’s a majority, but one that could possibly be affected by the margin of error.\n\nTwo of the polls we reviewed found opposition to providing free birth control coverage.\n\nA Quinnipiac University poll with a margin of error of 1.9 percentage points found a split of 47 percent in support of requiring private employers to offer free birth control coverage and 48 percent opposed.\n\nA poll conducted by Rasmussen Reports -- widely considered Republican-leaning -- found 46 percent opposed the plan and 43 percent supported it. The survey had a margin of error of 3 percentage points.\n\nOur ruling\n\nHolt  said \"a clear majority of Americans support removing the cost-sharing requirement for prescription contraceptive coverage.\"\n\nWe found eight polls that recently asked respondents whether they supported or opposed requiring health care plans to cover the cost of birth control.\n\nIn six of those surveys there was majority support, only one of which could be impacted by a margin of error. Two others polls showed more opposition than support. Still, Holt’s claim is backed by most of the polls we reviewed.\n\nOverall, this claim is Mostly True.", "To comment on this ruling, go to NJ.com.", "U.S. Rep. Rush Holt, E-Mail Newsletter, Feb. 24, 2012\n\nThe Henry J. Kaiser Family  Foundation, Kaiser Health Tracking Poll, February 2012\n\nPublic Religion Research Institute, Majority of Catholics Think Employers Should Be Required to Provide Health Care Plans that Cover Birth Control at No Cost, Feb. 7, 2012\n\nQuinnipiac University Polling Institute, American Voters Hum, 'happy Days Are Here Again,' Quinnipiac University National Poll Finds; But Confidence Does Not Lift Obama,  Feb. 23, 2012\n\nPublic Policy Polling, Americans Support Obama on Prescription Birth Control Benefit, Feb. 10, 2012\n\nGuttmacher Institute, Insurance Coverage of Contraceptives, March 2012\n\nPolitiFact, White House official says 98 percent of Catholic women have used contraception, Feb. 6, 2012\n\nGuttmacher Institute, \"Contraceptive Use Is The Norm Among Religious Women,\" April 13, 2011\n\nEmail interview with Thomas Seay, spokesman for U.S. Rep. Rush Holt, March 7-8, 2012\n\nFoxNews.com, Fox News Poll Methodology, Feb. 10, 2012\n\nCNN.com, CNN Poll: Half oppose Obama birth control insurance plan, Feb. 16, 2012\n\nCBSNews.com, Poll: Most back mandating contraception coverage, Feb. 14, 2012\n\nCBS News/New York Times Poll, Some Good Economic News; the President and the November Election, Feb. 14, 2012\n\nRasmussen Reports, 50% Oppose Gov't Mandate for Religious Organizations to Provide Contraceptives, Feb. 8, 2012\n\nRasmussen Reports, Questions - Contraceptive Mandate - February 6-7, 2012, accessed March 7, 2012\n\nPolitiFact, The health care law, Catholics and birth control, Feb. 10, 2012\n\nThe White House, FACT SHEET: Women’s Preventive Services and Religious Institutions, Feb. 10, 2012\n\nWall Street Journal, Romney Advances As Obama Gains, March 5, 2012\n\nNational Journal, Public Divided Over Birth-Control Coverage, Feb. 28, 2012\n\nPew Research Center, Public Divided Over Birth Control Insurance Mandate, Feb. 14, 2012\n\nPrinceton Survey Research Associates International for National Journal, Final Topline Results, Feb. 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]