["About this rating", "The English word “holocaust” derives from Greek words meaning \"whole (holos) and \"burnt\" (kaustos), and generally describes destruction or slaughter on a mass scale. Holocaust as a proper noun (typically \"the Holocaust\") specifically refers to the state-sponsored persecution and mass murder of European Jews and others at the direction of the German Nazi government between 1933 and 1945.", "Many attempts have been made to try to represent the overwhelming scale and enormity of Holocaust in an easily assimilable form, including the following meme, which holds that \"If we held a moment of silence for every victim of the Holocaust, we would be silent for eleven and a half years\":", "Is this example an accurate representation of the sheer number of victims who perished in the Holocaust?", "This premise involves a few variables which are not defined in the meme, such as the length of a \"moment of silence.\" One minute is a typical period of time employed in such silent reflections and contemplation, so that's what we'll use here.", "We also have no precise accounting of how many European Jews died as the direct result of Nazi policies, but the rounded-off estimate of 6 million is a commonly accepted figure. (We note that this number does not encompass the many other groups who were also victims of Nazi policy, such as the Roma, the disabled, Serb civilians, Jehovah's Witnesses, etc., or persons who may have died indirectly as a result of such policies, or combatant and civilian deaths stemming from the European war between 1939-45.)", "One year comprises 525,960 minutes (60 minutes/hour x 24 hours/day x 365.25 days/year), so 6 million minutes (one for each Holocaust victim) divided by 525,960 minutes (the number of minutes in a year) brings us to the result that serially observing an individual moment of silence for each victim would indeed span 11.4 years. Given the caveats of the above-mentioned estimates, then, this meme can be considered reasonably accurate.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]