["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Wikimedia commons)", "The West Virginia Republican Party recently tweeted praise for President Donald Trump’s handling of the economy, particularly as it relates to women.", "On Aug. 27, the state party tweeted, \"Women’s unemployment has been lower under President Trump than it’s been in nearly 70 years. #WVGOP #WomenforTrump #WV4Trump.\"", "Women's unemployment has been lower under President Trump than it's been in nearly 70 years. #WVGOP #WomenforTrump #WV4Trump https://t.co/88rzHcS16h", "Is that correct? We took a closer look. (The West Virginia Republican Party did not respond to an inquiry for this article.)", "According to the Federal Reserve Economic Data website, the U.S. Bureau of Labor Statistics reported that the unemployment rate for women was 3.7% in July 2019, the latest data that was known at the time of the party’s tweet. In August 2019, the rate ticked down slightly, to 3.6%; the best showing came in April, with a rate of 3.4%.", "Here’s a chart showing the full run of data for women’s unemployment.", "The data shows one period with a lower unemployment rate for women: a 12-month period in 1952 and 1953. That’s about 66 years ago, which qualifies as \"nearly 70 years\" ago.", "Brian Lego, an economist at West Virginia University, told PolitiFact that the Korean War in the early 1950s created some labor market distortions. Because the military draft pulled men out of the labor market, temporary jobs opened up for women.", "It’s important to note that presidents don’t deserve either full credit or full blame for the unemployment rate on their watch. The president is not all-powerful on economic matters; broader factors, from the business cycle to changes in technology to demographic shifts, play major roles.", "In fact, the unemployment rate for women has been falling since 2010, when President Barack Obama was president. The unemployment rate for women fell from 8.7% in October 2010 to 4.7% when Obama left office in January 2017 -- a decline of four percentage points, or almost half.", "Since Trump entered the White House, women’s unemployment has fallen by one point, or almost one-fifth.", "The West Virginia Republican Party said, \"Women’s unemployment has been lower under President Trump than it’s been in nearly 70 years.\"", "The actual number is 66 years, which qualifies as \"nearly 70.\" However, it’s important to note that presidents don’t deserve full credit or blame for such statistical changes on their watch.", "The statement is accurate but needs additional context, so we rate it Mostly True.", "WV GOP, Tweet, September 14, 2019", "Federal Reserve Bank of St. Louis, women’s unemployment, accessed Sept. 25, 2019", "Email interview with Brian Lego, West Virginia University economist, Sept. 17, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]