["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Refugees and migrants, mostly from Syria and Iraq, disembark from a vessel at the northeastern Greek island of Lesbos. (AP)", "Republican presidential candidate Jeb Bush has said the United States should give preference to Christians fleeing the bloodshed in the Middle East. While many Americans and lawmakers view Muslims with suspicion, Bush argued this should not impede providing shelter to people of various Christian sects.", "This raises the question of how resettlement workers would be able to verify that the person who claims to be a Christian actually is one. In an interview on radio station WGIR in New Hampshire, Bush said there are many telltale signs.", "\"You can tell when someone is a Christian in the Middle East, I can promise you that,\" Bush said on NH Today. \"By name, by where they’re born, their birth certificates. There are ample means by which to know this.\"", "We thought we’d explore the markers of Christian identity in the Middle East.", "The Bush campaign did not provide more details, so we turned to specialists in Middle Eastern religion and society.", "Lucas Van Rompay, a professor of religious studies at Duke University, said it would not be easy to tell.", "\"Some Christians do have specifically Christian names, but many don’t,\" Van Rompay said. \"In addition, the Qur’an knows the biblical names of Abraham, Joseph, Jesus, Mary, etc. so these names may be found among Muslims. The place where people are born may be relevant in some cases, such as some entirely Christian villages in northern Iraq, but most Christians live in cities or areas which have a mixed population.\"", "Father Patrick Ryan, a Jesuit priest and professor of religion and society at Fordham University echoed those points, noting that many Arabs deliberately choose \"ambiguous names so you won’t be able to identify them religiously.\" Ryan added that whether a woman is veiled is also unreliable.", "\"Many (non-Muslim) women in the Middle East cover their heads and necks,\" Ryan said.", "On the other hand, he noted that some Coptic Christians have distinctive tatoos.", "Many refugees do have their birth certificates, and ones from Syria list the person’s religion.", "Still, Van Rompay said truly verifying that a person is what he says he is can take a long time. Middle Eastern Christians tend to be well integrated into their communities.", "\"Even sitting down with someone and having a conversation about some of the tenets of Christianity or some basic prayers (Our Father, the Creed) would be problematic,\" Van Rompay said. \"Middle Eastern Christians are as diverse as Western Christians are, and some will be much more knowledgeable than others, and much more able to express themselves than others.\"", "Our ruling", "Bush said there are ample ways to determine if a Middle Eastern refugee is a Christian and suggested that names, birthplace and birth certificate would be key. The experts we reached agreed that there are many ways to verify that a person is a Christian, but they warned that it would be far more complicated than Bush presented. For many Christians, neither their names nor where they were born confirms their religion.", "A birth certificate could prove helpful, but if one doubted its authenticity, a more arduous verification task lies ahead.", "Based on what the experts said, Bush misrepresented the power of the indicators he mentioned and the effort needed to go beyond them. We rate this statement Half True.", "WGIR, NH Today, Nov. 24, 2015", "Buzzfeed, Jeb Bush: Christian Refugees Are Identifiable By Name, Birth Certificate, Nov. 24, 2015", "Email interview, Lucas Van Rompay, Professor, Religious Studies, Duke University, Dec. 1, 2015", "Email interview, Patrick Ryan, professor of religion and society, Fordham University, Dec. 1, 2015", "Interview, Annie Wilson, executive vice-president,  Lutheran Immigrant and Refugee Service, Nov. 30, 2015", "Email interview, Mark Hetfield, president, HIAS, Dec. 1, 2015", "Interview, Sanja Bebic, refugee integration, Center for Applied Linguistics, Dec. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]