["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump, who once called climate change a hoax spread by China, downplayed concerns about global temperature trends in an interview with Piers Morgan.", "Morgan asked Trump if he believed that climate change exists.", "\"There is a cooling and there is a heating and I mean, look – it used to not be climate change – it used to be global warming,\" Trump said in an interview broadcast Jan. 26. \"That wasn’t working too well, because it was getting too cold all over the place. The ice caps were going to melt, they were going to be gone by now, but now they’re setting records, so okay, they’re at a record level.\"", "We looked at what’s been going on with the polar ice.", "Trump is wrong that the ice caps are at record levels.", "In March 2017, NASA published a news brief with the headline, \"Sea Ice Extent Sinks to Record Lows at Both Poles.\"", "Researcher Julienne Stroeve with the National Snow and Ice Data Center said Trump’s claim was \"odd.\"", "Stroeve said polar ice is at \"a record low in the Arctic (around the North Pole) right now and near record low in the Antarctic (around the South Pole).\"", "The National Snow and Ice Data Center gathers data under contracts with NASA, the National Science Foundation and the National Oceanic and Atmospheric Administration.", "For both the Arctic and Antarctic ice caps, the extent of the ice is down from the 30-year average. The key difference between the two polar zones is that the levels have bounced around more in Antarctica. This chart, based on National Snow and Ice Data Center numbers, shows the yearly averages back to 1979.", "In no way are the ice caps at record highs.", "Physicist Kent Moore at the University of Toronto said the satellite record going back to 1979 is well validated and reliable. For the Arctic ice certainly, but also broadly for the Antarctic too, Moore said \"there is variability from year to year but the long-term trend is downwards.\"", "Moore did note though that some climate models are predicting a slower rate of loss than scientists have seen in the past.", "The White House press office pointed to a 2015 NASA report that found ice was forming in parts of Antarctica at a faster rate than it was being lost in other areas of the continent. In other words, there was a net increase in the ice mass on the continent.", "But a full reading of the report showed that the gains were slowing down and researchers said that in 20 to 30 years, losses would outstrip gains.", "We note that the study is not directly comparable to other data because it measures the ice in tons, while historically, researchers have tracked how far the ice is spread out, that is, its area, not its weight. Moore and Stroeve said the area measurements are more reliable because the observational data has been gathered over many decades. More accurate volume measurements have only recently come on line.", "Moore said recent work at the University of Washington suggests that even in terms of volume, the amount of polar ice has been falling.", "Trump said that the ice caps are at record levels. They are not. The numbers show that the extent of the ice at both poles is smaller than it was decades ago. The shrinkage is more striking in the Arctic, but the overall trend is downward at both ends of the earth.", "By no means are the ice caps at record high levels.", "We rate this claim Pants on Fire!", "The Spectator, Donald Trump’s interview with Piers Morgan: full transcript, Jan. 29, 2018", "The Independent, Donald Trump appears to misunderstand basic facts of climate change in Piers Morgan interview, Jan. 28, 2018", "NASA, NASA Study: Mass Gains of Antarctic Ice Sheet Greater than Losses, Oct. 30, 2015", "NASA, Sea Ice Extent Sinks to Record Lows at Both Poles, March 22, 2017", "National Snow and Ice Data Center, Charctic Interactive Sea Ice Graph, accessed Jan. 29, 2018", "National Snow and Ice Data Center, Baked Alaska and 2017 in review, Jan. 3, 2018", "San Jose State University, Polar Ice and Global Warming, accessed Jan. 29, 2018", "Email interview, Julienne Stroeve, senior research scientist, National Snow and Ice Data Center, Jan. 29, 2018", "Email interview, Kent Moore, professor of physics, University of Toronto, Jan. 29. 2018", "Email interview, Steven Cheung, spokesman, White House press office, Jan. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]