["“After meeting thousands of Syrian Refugees and learning more about their faith, I have learned to love Islam. Islam promotes peace and is in fact more peaceful than Christianity. Islam is the religion that I identify with.”", "This quote was attributed to Trudeau, and shared several thousand times on social media since August 29. It was illustrated by a headshot of the prime minister donning a white head garb reminiscent of a keffiyeh.", "The first iteration of this picture and text together appeared on a Facebook page “Justin Trudeau Not” on August 29. It then migrated to Twitter the next day and was widely shared for the following week.", "The quote most likely originated from an August 28, 2016 article from the Vatican Enquirer, a news website that claims to take a “satirical look at headlines around the world”. However, most articles on the website show no obvious signs of satire and the disclaimer is not accessible from the front page, leaving many people to share the news as true. This particular article was shared nearly 8,000 times according to social media monitoring tool CrowdTangle.", "The article claims that the quote came from the Global Sun, another news website which no longer exists. The quote in the Vatican Enquirer article and in the more recent meme posts are almost identical.", "Trudeau is said to have announced his conversion to Islam on August 26, 2016. On that day, the prime minister was in Saguenay, a city in the province of Québec, for the National Caucus summer meeting of the Liberal party, as his official itinerary shows.", "He did hold a press conference that day, but did not make any mention of Islam. Later that day, a video was released of Trudeau advertising Muslim Fest, an annual two-day festival in Mississauga, Ontario, that celebrates Muslim artists, musicians and comedians. Trudeau did not utter the words attributed to him in that video either.", "The close-up photo of the prime minister was taken on October 31, 2016, while Trudeau was out trick-or-treating with his son for Halloween. Hadrien Trudeau was dressed as The Little Prince, a fictional character from Antoine de Saint-Exupery’s eponymous novel, while the prime minister was dressed as the airplane pilot from the same story.", "The original photo was flipped in order to make it invisible to a reverse image search, a common practice by someone who intends to use a photo  out of context. After an AFP journalist recognized the photo, we flipped the photo back in order to confirm its origin.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]