["A fake news story circulating for several months on Facebook claimed that employees at a Walmart in Decatur, Ala., were operating a meth lab in the store, leading to one of the biggest police drug busts in decades.", "\"Police discover meth lab in back room of Alabama Walmart,\" stated a headline on the website ufconly.com on Dec. 10.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. This article is bogus.", "The same story appeared in March 2017 on the website Empire News, a website with a disclaimer that it is for entertainment purposes only.", "The story said that police received an anonymous tip about a horrible burning smell from the back of the Walmart. An officer discovered a meth lab that took up the entire back room.", "The story stated that an \"unofficial spokesperson did say that they were ‘disappointed’ that they weren’t able to use their company discount to get meth before the place was shut down.\"", "One sign that this story is fake news: It provides a lengthy quote from \"Chief Robert Garner,\" even though in Decatur the police chief’s name is Nate Allen. He told PolitiFact that there was no such bust.", "\"This is fake news, and no, we don’t have a Chief Robert Garner,\" Allen said in an email.", "Tara Aston, a spokeswoman for Walmart, told PolitiFact in an email that the company was unaware of any meth lab being discovered at an Alabama store.", "While we found no news reports about busts of meth labs inside an Alabama Walmart, we did find some news reports about busts involving mobile meth labs in Walmart parking lots. In August 2016, police discovered a meth lab inside a 6-foot-high drainage pipe under a Walmart parking lot in Amherst, N.Y.", "The \"about\" section of the Ufconly website doesn’t describe the website’s content and instead stated that \"Ufconly is a small village in the mountains of the Western Cape, South Africa.\" We found no such place.", "There is no evidence that police discovered a meth lab inside a Walmart in Decatur, Ala.", "We rate this claim Pants on Fire.", "Ufconly, \"Police Discover Meth Lab In Back Room of Alabama Walmart,\" Dec. 10, 2017", "Empire News, \"Police Discover Meth Lab In Back Room of Alabama Walmart,\" March 30, 2017", "Decatur Alabama Police Department, Website, Accessed Dec. 30, 2017", "The Valdosta Daily Times (Georgia), \"Two arrested in meth lab at Walmart,\" Aug. 15, 2017", "Washington Post, \"A suspected meth lab beneath a Walmart parking lot has officials ‘completely astounded,’\" Aug. 10, 2016", "Snopes, \"Did Police Discover a Meth Lab in a Back Room of an Alabama Walmart?\" Dec. 27, 2017", "Interview, Decatur Police Chief Nate Allen, Dec. 31, 2017", "Interview, Tara Aston, Walmart spokeswoman, Jan. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]