["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The rumor, which tells people to stock up on food and water and warns against traveling to large cities, was initially promoted by known conspiracy theorists and has no basis in truth.", "Military and federal communications officials both rejected the claims, and President Donald Trump has signaled he would support a peaceful transition to a new administration.", "The warnings across social media are plentiful. Alarmist claims advise people to stock up on food, water, medicine and weapons. In the days following the Jan. 6 riots on the U.S. Capitol, online message boards and social media platforms are filled with assertions that a nationwide military takeover is coming.", "Most versions of the rumor say the plan is being implemented by President Donald Trump, the final step in an elaborate scheme to release damning information about his enemies that will land them in jail and allow him to remain in office for another four years.", "But these lengthy and detailed narratives simply are not rooted in reality.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Most variations of the rumor, like this Facebook post, claim without evidence that \"military takedowns\" and arrests will begin soon and continue up to Jan. 20, Inauguration Day: \"Everyone will be getting emergency alerts on their phones, tv's, radios & internet. It will override all other broadcasts and could last for several hours at a time.\"", "\"DO NOT travel to any large cities (especially Philadelphia) for the rest of the month. Military operations will be taking place in many of the major corrupt cities,\" the post continues. \"...The implementation of the Insurrection Act began after the raid on the Capitol and was marked by Trump's broadcast to the people to disband and return home. This broadcast wound up being blocked, for the most part, by the media. Nevertheless, his address fulfilled the requirements to initiate the Act.\"", "It went on to claim that the Federal Communications Commission told media organizations they can’t \"block the flow of intel\" and concluded that Trump has no plans to concede and that he will remain in office for another four years.", "But Trump has not invoked the Insurrection Act, and the military is not being sent to take over \"major corrupt cities,\" by him or anyone else. There are no planned nationwide emergency alerts, and Trump signaled he will support a smooth transition of power, adding that he would not be attending President-elect Joe Biden’s inauguration.", "Any ramp up in military responses in the coming days is directly related to securing the inauguration, military officials told PolitiFact.", "\"From the Department of Defense’s perspective, we are not taking any stance or position, or moving people anywhere to address any of those concerns,\" said DOD spokesperson Christopher Sherwood. \"Other than supporting the National Guard for the inauguration on Jan. 20, the DOD is not taking further action as far as I am aware.\" The Defense Department encompasses the U.S. Army, Navy and Air Force.", "There is also no evidence that U.S. citizens will soon receive emergency alerts on their devices.  The notion that the Federal Communications Commission told media organizations they can’t \"block the flow\" of the alleged intel is a severe misreading of a routine advisory that was published on Jan. 7, an FCC spokesperson said.", "\"Our Enforcement Bureau periodically issues advisories to promote compliance with FCC rules and, as detailed in the first paragraph, this advisory was informed by the results of the 2019 nationwide Emergency Alert System test,\" spokesperson Will Wiquist wrote in an email, characterizing this particular advisory as \"very routine.\"", "Some of the speculation about the advisory may have come from a portion of the document that states that presidential messages must be transmitted in national emergencies. But this does not mean that the FCC was warning broadcast and other communications providers against blocking an incoming Trump message.", "The Emergency Alert System is a national public warning system that the FCC, FEMA and the National Weather Service are charged with maintaining. It is commonly used by state and local authorities to deliver important emergency information, such as weather and AMBER alerts. It also enables the president to communicate via live audio transmission to the public during a national emergency.", "The conspiracy theory was initially pushed by QAnon accounts, which are banned on Facebook and Twitter but have found ways to persist. The original posts were turned into forwarded text messages before morphing back into more widespread social media posts.", "The overarching theme relies on the belief that Trump’s campaign will culminate in a sort of judgment day when he will unmask and punish his enemies. Q, the anonymous internet persona behind QAnon, has predicted that this would happen on several different days, none of which panned out.", "Viral social media posts say Trump has ordered the military to take over \"corrupt major cities\" in order to stay in office and that U.S. citizens will receive emergency alerts on their devices.", "The rumor was created by known conspiracy theorists and has no basis in truth. Military and federal communications officials both rejected the claims and Trump signaled he would support a peaceful transition to a \"new\" administration.", "We rate it Pants on Fire!", "RELATED: Fact-checking claims about the Insurrection Act, martial law after Capitol riot", "Facebook post, Jan. 13, 2021", "Facebook post, Jan. 13, 2021", "PolitiFact, There’s no evidence Trump has invoked the Insurrection Act, Jan. 11, 2021", "PolitiFact, Fact-checking claims about the Insurrection Act, martial law after Capitol riot, Jan. 11, 2021", "Federal Communications Commission, The Emergency Alert System (EAS), Accessed Jan. 13, 2021", "Federal Communications Commission, Enforcement Bureau Reminds EAS Participants of Compliance Obligations, Jan. 7, 2021", "NBC News, QAnon falsehoods move to text message chains, Jan. 12, 2021", "Phone interview, Christopher Sherwood spokesperson for the Department of Defense, Jan. 13, 2021", "Email interview, Will Wiquist spokesperson for the Federal Communications Commission, Jan. 13, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]