["Since the last three weeks of May, the India-China border dispute continues in the eastern parts of Ladhak. In the backdrop on this, Mahesh Vikram Hegde’s Postcard News shared an image on social media that juxtaposes quotes attributed world leaders — Israel, Russia, America and Japan.", "The following quotes are given in the infographic:", "1. Those who are planning to attack India need to face us – Israel (Benjamin Netanyahu) 2. We are always with India – Russia (Vladimir Putin) 3. India is our friend & we are always with India – America (Donald Trump) 4. If in case china attacks India then the end of China will begin – Japan (Shinzo Abe)", "On May 30, fake news portal Postcard News posted this image on their Facebook. It was shared over 850 times (archive link).", "[Also read: Postcard ‘News’ – A mega factory of fake news that continues to spew venom]", "Alt News received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "Alt News searched for all the quotes mentioned in the viral image but could not find any relevant results. In fact, the US and Russia have given official statements on the stand-off between India and China but they are not even minutely close to what is being shared on social media.", "On May 27. US President Trump offered to mediate between the two Asian giants.", "We have informed both India and China that the United States is ready, willing and able to mediate or arbitrate their now raging border dispute. Thank you!", "— Donald J. Trump (@realDonaldTrump) May 27, 2020", "The next day, President Trump claimed that he spoke with PM Modi who told him that he wasn’t in a “good mood” over the “big conflict” between India and China.", "But the Government of India dismissed President Trump’s claim that he spoke with PM Modi on the issue of the Line of Actual Control, as untrue.", "On June 1, Russian envoy Roman Babushki while speaking with India Today commented on the border dispute. He said, “…there are dedicated special mechanisms and tools developed by both countries, including hotlines, special representatives dialogue and even informal summits. We are confident that Indian and Chinese friends are duly equipped to find the way out for mutual satisfaction. We would encourage every endeavour in this regard.”", "Japan and Isreal have not made any public comments on the issue. It is pertinent to note that over the past few years China has increased trade with the latter each year since 2004, as per a report by Nikkei Asian Review. In an interview with the organisation, Professor Shaul Chorev, Director of the Maritime Policy and Strategy Research Center at the University of Haifa, said that Israel is “very happy” with Chinese investment and it should not be expected to “work only according to US wishes.”", "Thus, the viral image doesn’t indicate the respective country’s support to India if tensions between India and China escalate. Over the past few weeks, due to border skirmishes, there has an increase in misinformation about India and China. On May 29, Alt News reported that Times Now aired old videos during a broadcast on the recent tensions. On May 21 and June 2 we reported that old videos were floating on social media with similar claims.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]