["About this rating", "During an interview with television host Jimmy Kimmel, Donald Trump said he would debate Democratic candidate Bernie Sanders. Trump was initially rumored to have been joking about the debate, then hinted he might participate, then said such a debate would be \"inappropriate.\"", "Bernie Sanders and Donald Trump formally agreed to debate after Hillary Clinton backed out of a fourth and final debate with Sanders.", "On 26 May 2016, conflicting media and social media rumors claimed that Republican frontrunner Donald Trump and Democrat candidate Bernie Sanders agreed to debate before California's primary.", "Previously, Clinton had agreed to but then backed out of a final debate with Sanders before the primary in California (and one in New Jersey on the same date). On 24 May 2016, a spokesperson stated that Clinton would not be participating in any further debates, due to time constraints:", "Hillary Clinton will not debate Bernie Sanders in California, her top campaign spokeswoman said Monday.", "\"As we have said previously, we plan to compete hard in the remaining primary states, particularly California, while turning our attention to the threat a Donald Trump presidency poses,\" Jennifer Palmieri, Clinton's spokeswoman, said. \"We believe that Hillary Clinton's time is best spent campaigning and meeting directly with voters across California and preparing for a general election campaign that will ensure the White House remains in Democratic hands.\"", "The report originated with Trump's 25 May 2016 appearance on Jimmy Kimmel Live:", "The idea of a debate between the two men came up on Wednesday when Mr. Trump was appearing on “Jimmy Kimmel Live” and Mr. Kimmel said that Mr. Sanders had passed along an invitation to Mr. Trump, the presumptive Republican nominee. Mr. Trump, who opted out of a debate in Iowa in January and decided that he would no longer participate in primary debates after the Republican field narrowed to three candidates, said he would be open to debating Mr. Sanders if the proceeds were donated to charity, although there were conflicting reports about how serious he was.", "Just before his interview with Kimmel, Trump knocked Clinton on Twitter for her lengthy and arduous primary contest against Sanders:", "Crooked Hillary Clinton just can't close the deal with Bernie. I had to knock out 16 very good and smart candidates. Hillary doesn't have it — Donald J. Trump (@realDonaldTrump) May 25, 2016", "Almost immediately after the Kimmel segment aired, Sanders tweeted a response to Trump's remarks:", "Game on. I look forward to debating Donald Trump in California before the June 7 primary.", "— Bernie Sanders (@BernieSanders) May 26, 2016", "On the morning of 26 May 2016, CNN reported that Trump appeared to be serious about the prospect of debating Sanders before the California primary:", "Trump made it clear that he wants to follow through with the debate. \"I'd love to debate Bernie. He's a dream,\" he said in Bismarck, North Dakota. \"If we can raise for maybe women's health issues or something. If we can raise $10 or $15 million for charity, which would be a very appropriate amount.\" \"I understand the television business very well. I think it would get high ratings,\" Trump added. The Republican nominee said his team has been in conversations with several networks about hosting the debate. \"It should be in a big arena somewhere. And we can have a lot of fun with it. I'd love to debate Bernie\" he said. \"The problem with debating Bernie is he's going to lose. Because honestly his system is rigged. Just like our system is rigged.\"", "However, those reports were soon contradicted, and then potentially reconfirmed:", "Donald Trump said that he would “love to” debate Bernie Sanders, a day after discussing the prospects of a debate with the Democratic insurgent on a late night talk show. Trump laid out his conditions for a potential debate with Sanders, saying he would want it to raise “$10 million or $15 million for charity,” including women’s health issues, adding he would want to do it in a large arena. Trump’s high bar for the debate make such a meeting before the California primary highly unlikely, but Trump sees it as a win-win proposition, as it puts likely Democratic nominee Hillary Clinton in a bind. Clinton declined earlier this week to debate Sanders before the June 7 vote. A Trump aide initially dismissed the candidate’s openness to the debate as a joke, but the candidate again entertained the prospect after this article was published.", "That afternoon, Sanders followed up on Twitter to say:", "I am delighted that @realDonaldTrump has agreed to debate. Let’s do it in the biggest stadium possible. — Bernie Sanders (@BernieSanders) May 26, 2016", "As of 26 May 2016, the probability of the debate remained unclear. However, political news outlet The Hill noted that a \"bipartisan debate between the two while the primaries are still ongoing would be unprecedented.\" In the latter part of the day, a spokesperson for Trump provided an ambiguous response to Reuters:", "Trump spokeswoman Hope Hicks said in an email to Reuters there were no formal plans yet for such an event.", "Representatives for the Sanders campaign did not immediately respond to a request for comment.", "On 27 May 2016, Donald Trump issued a statement saying that it would be \"inappropriate\" of him to debate Sanders:", "Based on the fact that the Democratic nominating process is totally rigged and Crooked Hillary Clinton and Deborah Wasserman Schultz will not allow Bernie Sanders to win, and now that I am the presumptive Republican nominee, it seems inappropriate that I would debate the second place finisher. Likewise, the networks want to make a killing on these events and are not proving to be too generous to charitable causes, in this case, women’s health issues. Therefore, as much as I want to debate Bernie Sanders —  and it would be an easy payday — I will wait to debate the first place finisher in the Democratic Party, probably Crooked Hillary Clinton, or whoever it may be.", "The hashtags #BernieTrumpDebate (and variations thereof) began trending on Facebook and Twitter in anticipation of the suggested matchup.", "Cassella, Megan.   \"Sanders May Debate Trump, Not Clinton, Before California Contest.\"\r\n    Reuters.   26 May 2016.", "Frizell, Sam.   \"Donald Trump Might Debate Bernie Sanders, After All.\"\r\n    TIME.   26 May 2016.", "Merica, Dan and Brian Stelter.   \"Clinton Declines To Debate Sanders In California.\"\r\n    CNN.   24 May 2016.", "Rappeport, Alan.   \"Donald Trump And Bernie Sanders Contemplate A Debate.\"\r\n    New York Times.   26 May 2016.", "Savransky, Rebecca.   \"Sanders Calls For Trump Debate In 'Biggest Stadium Possible'.\"\r\n    The Hill.   26 May 2016.", "Wright, David and Eugene Scott.   \"Sanders Camp: We Hope Trump Doesn't 'Chicken Out' On Debate.\"\r\n    CNN.   26 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]