["About this rating", "As state lawmakers in New York focus on changing sexual misconduct laws, a Democrat who has aligned himself with Republicans drew scrutiny for being involved despite being accused of harmful behavior by a former campaign volunteer.", "The allegations against state Sen. Jeff Klein (D-New York) by Erica Vladimer were first published in the Huffington Post on 10 January 2018. She told the news site that Klein had forced himself on her outside of a bar in April 2015.", "Klein is the leader of the Independent Democratic Conference, a group of eight Democratic lawmakers who caucus with state Senate Republicans. The senator has not been charged in connection with the alleged encounter. He has expressed support for Gov. Andrew Cuomo's plan to expand anti-sexual harassment laws, saying:", "I think we have to strengthen our sexual harassment laws, and I intend to push to make that happen.", "Vladimir, who volunteered for Klein during his 2014 campaign, said she was smoking a cigarette with the senator when he accosted her:", "All of a sudden there was a hand on the back of my head and he shoved his tongue down my throat. In my head it lasted forever, I don't think it lasted even three seconds.", "Both Klein and his longtime partner, fellow Democratic state Sen. Diane Savino, have denied Vladimir's account. The day that Vladimir's accusation was published, said in a conference call:", "I want to be crystal clear: This alleged incident never happened nor did anything inappropriate happen in any fashion that evening.", "Klein called for an investigation on the matter by the Joint Commission on Public Ethics. Vladimir issued a statement saying that she did not plan to sue Klein, and that she would cooperate with the commission's investigation.", "Cuomo called for legislation that would curtail the use of confidentiality agreements in harassment cases involving members of \"all public entities and branches of government — state and local — unless it is the express preference of the victim.\" He also said during an appearance at the New York City edition of the Womens' March on 20 January 2018 that abusers and harassers should be on the hook for settling or fighting lawsuits out of pocket, instead of using taxpayer dollars to do so:", "We have proposed in Albany an unprecedented women's empowerment agenda that says no more government money for sexual harassment. If someone wants to abuse a woman's right, then they're liable, pay for it with their own money, not government money.", "However, at least one state Democrat, Sen. Liz Krueger, was critical of what she described as a lack of inclusion of female lawmakers in discussions on the matter:", "I always think women should be in every negotiation. We're 52 percent of the population of New York state so I don't see any reason for us to be locked out of the room.", "But Klein's director of communications, Candice Giove, told us via e-mail that the office rejects the idea that women are being left out of the process:", "\"Four men\" in a room is a myth. The Secretary to the Governor, Senator Klein's Chief of Staff and a number of other women in senior positions who work for the executive and the legislature are in the room, and integral to budget negotiations.", "We contacted Cuomo's office as well as the New York State Democratic Committee seeking comment.", "Murdock, Sebastian.    \"EXCLUSIVE: New York State Sen. Jeff Klein Accused Of Sexual Misconduct.\"\r\n   Huffington Post.    10 January 2018.", "McKinley, Jesse and Wang, Vivian.    \"Calls to Investigate State Senator Persist. But Will It Happen?\"\r\n   New York Times.   15 January 2018.", "Campbell, Jon.    \"NY Sen. Jeff Klein Accused of Forcibly Kissing Staff Member.\"\r\n   Rochester Democrat and Chronicle.    10 January 2018.", "Reisman, Nick.    \"Klein Calls For JCOPE Investigation Of Allegation Against Him.\"\r\n   State of Politics.    11 January 2018.", "Hamilton, Matthew.    \"Klein: 'We Have to Strengthen our Sexual Harassment Laws.'\"\r\n    Albany Times-Union.    16 January 2018.", "Governor Andrew Cuomo.\r\n    \"Governor Cuomo Unveils 18th Proposal of 2018 State of the State: Combat Sexual Harassment in the Workplace.\"   2 January 2018.", "Governor Andrew Cuomo.\r\n    \"Audio & Rush Transcript: Governor Cuomo Delivers Remarks at the 2018 Women's March on New York City.\"    20 January 2018.", "Spectrum News.\r\n   \"Should 'Four Men In a Room' Decide New Sexual Harrassment Laws?\"    24 January 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]