["Kenyan newspaper the Star said that “all” of the country’s taxation money is spent paying back debt. We checked their claim.", "Kenya’s Star newspaper claimed that according to the parliamentary budget office all of the country’s ordinary revenue is spent repaying national debt.", "The relevant report from the budget office makes no such claims. Treasury data shows Kenya’s ordinary revenue would have paid for debt due a number of times over.", "Revenue raised from taxes is also used to pay recurrent government expenses like salaries and pensions, and disbursed to Kenya’s 47 counties.", "Preparing the budget for the 2020/21 financial year promises to be a tough balancing act for Kenya, with the Covid-19 pandemic ripping up economic growth projections everywhere.", "In early April 2020 the country joined a continental push for “the suspension of interest payments” on “public and private debt” for Africa.", "But in February 2020, just before the enormity of the Covid-19 health crisis became apparent, Kenya’s parliamentary budget office raised concerns about the country’s public debt, and the pressure it was putting on spending plans.", "The budget office is a non-partisan team of technocrats that advises parliamentarians on the economy, tax and the budget.", "Reporting on the budget office’s presentation to lawmakers, Kenyan newspaper the Star said that “all” of the country’s taxation money is spent paying back debt.", "“All the ordinary revenue collected by Kenya Revenue Authority is used to repay the loans – local and foreign – currently worth more than KSh6 trillion [US$56.5 billion],” the daily claimed.", "Does Kenya spend all its “ordinary” revenues paying back local and foreign debts? We ran the numbers.", "As the source of its claim, the Star cited a budget office report, “The Shuteye Economy: Unpacking the 2020/21 Budget Policy Statement”. (Note: The budget statement can be read here.)", "Africa Check obtained a copy of the report from parliament. This showed that from the 2014/15 financial year to 2019/20 interest payments have not been more than 24% of ordinary revenue.", "But the report did not state how much of the principal debt was repaid. To get a sense of this we turned to treasury data.", "What counts as ordinary revenue?", "Ordinary revenue refers to all taxes collected by the country’s tax authority and the money collected by government ministries usually referred to as appropriation-in-aid, said Kwame Owino, the chief executive of the Institute of Economic Affairs Kenya.", "The economic thinktank defines appropriation-in-aid as “revenue in the form of receipts from user charges, collected by ministries or departments that is over and above the required amount and is spent by the entity that raised the revenue”.", "Ordinary revenue thus refers to “excise duty, value-added tax, income tax, corporation tax, pay-as-you-earn, and all the taxes that Kenya Revenue Authority is authorised to collect, plus appropriation-in-aid”, Owino told Africa Check.", "Kenya’s national treasury is required to publish a report on the financial and non-financial position of the national government every quarter. The most recent report placed the public debt at KSh6.05 trillion in December 2019. (Note: Treasury’s most recent policy paper from February 2020 on government borrowing gave a similar figure of KSh6.01 trillion at December 2019, or 58% of GDP.)", "This comprised:", "Domestic debt of KSh2.94 trillion or 49% of the total.", "External debt of KSh3.1 trillion or 51% of the total.", "For the current 2019/20 financial year, the treasury budgeted KSh572.9 billion as total debt repayment - both principal and interest. In 2018/19 KSh642 billion was used to repay debt.", "Ordinary revenue has grown from KSh974 billion in 2013/14 to KSh1.5 trillion in 2018/19. But the forecasted KSh1.85 trillion for 2019/20 is likely to be impacted by the Covid-19 pandemic.", "Taken together, all ordinary revenue would have met the country’s debt obligations at least twice over.", "In that period ordinary revenue has also been used to pay recurring expenditure such as wages and salaries, pensions, and allocations to county governments.", "The Star left out these other payments when it said that all ordinary revenue raised was used to repay debt. In addition, all debt is not due at the same time.", "The newspaper claim that all ordinary revenue was used to repay loans is incorrect, John Kinuthia, lead research analyst with the International Budget Partnership, told Africa Check.", "“That is just misleading,” Kinuthia said.", "Reporting on a presentation to Kenya’s senate about the country’s growing debt, a national newspaper claimed that all the tax revenue collected by the state tax agency is used to repay local and foreign debt.", "A review of the documents used by the parliamentary budget office shows that this “ordinary” revenue has gone to more than just debt. It has also paid recurrent costs, like salaries, and been disbursed to Kenya’s 47 counties", "Treasury documents also show that the ordinary revenue raised in recent financial years would have met the country’s debt obligations a number of times over. In 2018/19repayment of debt due was about 43% of ordinary revenue", "We therefore rate this claim incorrect.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]