["By Eugene Kiely and D'Angelo Gore", "Posted on April 5, 2018", "In his latest attack on Amazon, President Donald Trump made some unsupported and distorted claims about the U.S. Postal Service and its relationship with the giant online retailer:", "Jeff Bezos owns the Washington Post and is the founder and chief executive officer of Amazon. Both of his companies have been frequent targets of the president.", "At an April 3 press conference, the president — who has tweeted frequently about Amazon in recent days — was asked, “What’s Amazon done that bugs you, sir?” He then accused Amazon of ripping off the U.S. Postal Service and U.S. taxpayers.", "Trump, April 3: [T]he Post Office is losing billions of dollars and the taxpayers are paying for that money because it delivers packages for Amazon at a very below cost. And that’s not fair to the United States. It’s not fair to our taxpayers.", "It’s true that the Postal Service has run up large annual deficits for years. “The Postal Service has incurred cumulative net losses of $65.1 billion from 2007 through 2017,” according to the 10-K form that it filed with the U.S. Securities and Exchange Commission in 2017.", "But there’s no evidence that Amazon is to blame for the red ink. In fact, the USPS parcel services used by Amazon and other businesses is the fastest-growing category of its delivery services, raising billions of dollars to help cover institutional costs.", "Let’s review what we know — and don’t know — about USPS, its finances and its contract with Amazon.", "Amazon has a negotiated contract with USPS for competitive parcel shipping services, but it is not publicly available — so we don’t know how much Amazon pays for this service. In a 2017 report, the Government Accountability Office said, “USPS is not required to disclose information of a commercial nature which under good business practice would not be publicly disclosed.”", "However, we do know that a federal law requires USPS to charge enough to cover the cost of delivering packages for companies like Amazon.", "Under the Postal Accountability and Enhancement Act of 2006, the Postal Service’s so-called “competitive products” must “cover attributable costs and contribute to institutional costs.” (The law classifies USPS products into two categories: market-dominant products, such as regular mail service, and competitive products, such as the packages that it delivers in competition with UPS, FedEx and other delivery companies.)", "In fiscal year 2017, the U.S. Postal Service reported revenue of $69.6 billion — a decline of $1.8 billion from the previous fiscal year. But that was due largely to a decline in mail services, not package services.", "In a press release on FY2017, USPS said that “mail volumes declined by approximately 5.0 billion pieces, or 3.6 percent, while package volumes grew by 589 million pieces, or 11.4 percent, continuing a multi-year trend of declining mail volumes and increasing package volume.” Revenue from its parcel services increased by $2.1 billion, or 11.8 percent, in FY2017.", "The Postal Service declined to comment on its financial relationship with Amazon or the president’s remarks about it.", "However, in response to an op-ed that appeared in the Wall Street Journal last year, USPS Chief Financial Officer Joseph Corbett wrote that it is “inaccurate” to say that the Postal Service delivers packages “below cost.”", "“By law our competitive package products, including those that we deliver for Amazon, must cover their costs. Our regulator, the Postal Regulatory Commission (PRC), looks carefully at this question every year and has determined that they do,” Corbett wrote. “The PRC has also noted that competitive products help fund the infrastructure of the Postal Service. It is that infrastructure that enables us to fulfill our universal service obligation to deliver to each and every address in the United States at an affordable rate.”", "“Last year, competitive products contributed $6 billion to covering these [infrastructure] costs,” USPS said in a Nov. 16, 2017, letter to Forbes magazine.", "The Postal Service might be able to make more money from delivering packages if it charged higher rates — which is Trump’s argument.", "In his remarks, the president also said that “every time they deliver a package,” the Postal Service “loses one dollar and 47 cents.” That’s not accurate, either.", "The president was referring to an April 2017 study by Citi Research, the research arm of Citigroup Global Markets. The study assumed that “a day of reckoning is approaching” where USPS will have to raise rates for “competitive parcel products.” Under that assumption, the study considered the possible impact of increased rates on specific businesses, including Amazon, FedEx and UPS.", "The study — which was done for Citigroup clients, not the Postal Service — said that USPS could charge more now that its “competitive products” make up a larger share of its business than it did in 2006, when the Postal Accountability and Enhancement Act became law.", "“When the PAEA was passed, competitive products were assigned a 5.5% share of the USPS’ institutional costs and this percentage has remained unchanged despite” the steady growth of package volume and revenue.", "The Citigroup report estimated that the Postal Service would need to charge an additional $1.46 per parcel package in FY2017, $1.41 in FY2018 and $1.36 in FY2019 in order to break even in three years — that is, to cover its operating costs and prefund the Postal Service Retiree Health Benefits Fund, which it hasn’t done since fiscal year 2012.", "But that does not mean that USPS is losing $1.46 per parcel package, as Trump said. That’s the amount that Citigroup estimates the Postal Service would need to close its revenue gap, assuming Amazon and others would pay the higher rates and not take their business to other shipping services.", "Trump also said Amazon’s shipping rates are “not fair to our taxpayers,” claiming taxpayers are “subsidizing” Amazon’s delivery costs. But the USPS does not receive money from the federal government for its operating costs, as Trump’s statement may have suggested.", "A page on the USPS website listing “The Top 10 Things You Should Know About the U.S. Postal Service” says, “The Postal Service receives NO tax dollars for operating expenses and relies on the sale of postage, products and services to fund its operations.”", "That’s been the case since 1982, according to its most recent 10-K form.", "The Postal Service does receive an annual appropriation from Congress for providing “free and reduced” mailing services for certain people, including the blind and overseas voters. That amount was $48 million in 2017, the SEC filing says.", "The USPS has also borrowed a larger amount, $15 billion — the maximum allowed by law — from the Treasury Department’s Federal Financing Bank. But the funds are not directly related to any services provided to Amazon.", "The 2006 postal act also required the USPS to prefund the Postal Service Retiree Health Benefits Fund for its employees. As a result, the USPS was obligated to contribute more than $5 billion to the fund each year from fiscal 2006 to fiscal 2016. The fund contributions are still required, although the level of funding is now set by the Office of Personnel Management.", "The money it has borrowed from the Treasury has been used for that purpose.", "In a 2015 blog post, the Postal Service Office of the Inspector General said the USPS benefits fund is “much better [funded] than the rest of the federal government,” but it has come at a high cost. “The Postal Service’s $15 billion debt is a direct result of the mandate that it must pay about $5.6 billion a year for 10 years to prefund the retiree healthcare plan.”", "And a 2016 Congressional Research Service report said that, as of FY2015, the USPS had made $20.9 billion in payments to the fund, but had also defaulted on $28.1 billion in additional payments. It defaulted on another $5.8 billion payment in FY2016, too. Those payments still have to be made in the future, though.", "“The Postal Service remains obligated to fund the $33.9 billion in PSRHBF prefunding payments that it defaulted on for the years 2012 through 2016,” according to its 10-K form.", "Perhaps making more money from its deals with Amazon and other companies would allow the Postal Service to pay down its debt sooner. That said, the loan from the Treasury still has to be repaid with interest.", "As a matter of fact, a 2015 white paper by the Postal Service OIG said that the arrangement to prepay employee health benefits was intended to protect taxpayers. It says, “The prefunding requirement began as an effort to ensure Postal Service liabilities would not become a taxpayer burden if the Postal Service were to someday cease to exist.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]