["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A version of this post was debunked in April 2019 by AFP.", "A Facebook post with a fabricated quote about killing non-Muslims seeks to sow distrust and fear of Muslims in Congress.", "The post features a headshot of a bearded man and text next to his face that says: \"Jihad will continue until all the Hindus, Christians, Buddhists, Atheists are killed. Your secularism & tolerance can not change our ideology. Quran does NOT permit survival of Non-Muslims.\" That quote is attributed to \"Abdullah Zuber.\"", "Below the quote and headshot is text, purportedly written by a Randy McDaniels on Dec. 21, 2018, that says: \"Keep this in mind as new members of Congress who are Muslim are sworn into office on this book of death and inequality.\"", "In November 2018, two Muslim women were elected to the U.S. Congress for the first time, Democrats Rashida Tlaib of Michigan and Ilhan Omar of Minnesota.", "The Facebook post, published Feb. 20, 2019, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A version of this post was debunked in April 2019 by AFP, which said the image has circulated online at least since 2017. The news agency found that the false quote and the image also appeared after the 2019 mosque shooting in Christchurch, New Zealand. The caption for that post claimed that a man named Abdullah Zuber made the remark to the BBC after the shooting. But the BBC told AFP it had not interviewed a person by that name.", "The man pictured in the Facebook post was acquitted in 2014 by a court in Kolkata, India, after spending eight years in jail on terror charges; his name is Abdullah Juber, not Zuber, AFP reported.", "The AFP also linked to a 2017 report on TwoCircles.net that said Juber’s photo was \"being circulated for nefarious purposes with the aim of creating hatred towards Muslims.\"", "\"Juber’s photograph which was exclusively captured by TwoCircles.net is being photoshopped and being circulated online with a quote which Juber never said,\" the 2017 TwoCircles.net post said.", "A quote about killing Hindus, Christians, Buddhists, Atheists and attributed to \"Abdullah Zuber\" is not real.", "We rate this Facebook post Pants on Fire!", "Facebook post, Feb. 20, 2019", "AFP,  No, this man did not tell the BBC after the New Zealand mosque shootings that ‘jihad will continue until all Hindus, Christians, Buddhists, Atheists are killed’, April 1, 2019", "Internet Archive, 2017 TwoCircles.net post on Abdullah Juber, 2014 post on Abdullah Juber’s acquittal", "Lead Stories, Fact Check: Man Pictured In Meme Did NOT Say That \"Jihad Will Continue\", Feb. 26, 2020", "The Washington Post, The nation’s first two Muslim congresswomen are sworn in, surrounded by the women they inspired, Jan. 3, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]