["By Lori Robertson", "Posted on November 16, 2016 | Corrected on December 13, 2016", "House Speaker Paul Ryan falsely claimed that “because of Obamacare, Medicare is going broke.” The law actually improved Medicare’s financing, and the program isn’t going “broke.”", "After a 2016 campaign virtually devoid of talk about Medicare policy, Ryan’s recent remark on Fox News — flagged by our fact-checking colleagues at the Washington Post — was a blast from the past. The comment is like something right out of the Medicare-filled 2012 election, a contest so packed with scary claims about seniors’ health care that we dubbed it “A Campaign Full of Mediscare.” Both President Obama’s and Mitt Romney’s campaigns — with Ryan as Romney’s running mate — spread falsehoods about what their opponent would do to Medicare.", "As we wrote then, both campaigns had proposed ways to shore up Medicare’s shaky financing, but they disagreed on how best to do that.", "In his recent comments, Ryan said that since part of the Affordable Care Act concerned Medicare, a repeal of the law would impact the program. But then Ryan went off into the realm of Mediscare.", "Ryan, Nov. 10 on Fox News: So what a lot of folks don’t realize is this 21-person board called the IPAB is about to kick in with price controls on Medicare. What people don’t realize is because of Obamacare, Medicare is going broke. Medicare is going to have price controls. Because of Obamacare, Medicaid is in fiscal straits. So you have to deal with those issues if you are going to repeal and replace Obamacare. Medicare has got some serious problems because of Obamacare. So those things are part of our plan to replace Obamacare.", "Let’s start with the claim that Medicare “is going broke.” It isn’t. One part of Medicare, though, is expected to face financial shortfalls in the future without changes to either revenues or spending, or both.", "Medicare is made up of four parts. What was originally enacted in the 1960s is Part A, which covers payments to hospitals, and Part B, which covers payments to physicians. Other parts were added later — Part C (Medicare Advantage, or private insurance options) and Part D (prescription drug coverage). Part A is funded by a payroll tax that goes into a trust fund, similar to Social Security trust funds, while the physician and prescription drug aspects of Medicare are mainly paid for with general government revenues.", "It’s that Part A trust fund that’s expected to run out of money. The current exhaustion date is 2028, according to the latest report from the Medicare trustees. “HI [hospital insurance trust fund] expenditures have exceeded income annually since 2008. However, the Trustees project slight surpluses in 2016 through 2020, with a return to deficits thereafter until the trust fund becomes depleted in 2028,” the 2016 trustees report says.", "But that doesn’t mean Medicare would be “broke.” There are other parts of Medicare, and Part A would still have revenue through payroll tax receipts, though not enough to cover all of the expected expenses.", "“HI revenues would cover only 87 percent of estimated expenditures in 2028 and 80 percent in 2050,” the trustees report says.", "Predictions of financing shortfalls have surrounded Part A almost since it became law in 1965. By 1970, the trustees report projected that “the trust fund would be exhausted in fiscal year 1973, unless additional financing is provided.”", "In 1980, exhaustion was expected in 1994; in 1990 the insolvency date was 2003. But Congress has repeatedly pushed back those dates, mainly through increasing taxes — both the payroll rate and wages subject to the tax. Right now, that tax rate is 1.45 percent on wages for employees and employers each, with no ceiling on wages subject to the tax since 1993. (The Affordable Care Act added a Medicare surcharge on high-income wage earners, as we will explain later.)", "To be sure, Congress will need to act again to push back the current exhaustion date for the Part A trust fund. The trustees report urges policymakers to “determine effective solutions to the long-range HI financial imbalance.” But it is an exaggeration to say that Medicare is going broke.", "We’ve fact-checked similar claims from both Republicans, including Ryan, and Democrats in the past.", "As for Ryan’s claim that Obamacare had worsened Medicare’s financing, that’s not the case, either. In fact, the law both expanded Medicare funding — adding a 0.9 percent tax on earnings above $200,000 for single taxpayers or $250,000 for married couples — and cut the growth of future spending. Additional revenue and savings actually extend the life of the trust fund.", "The trustees’ 2010 report estimated that the ACA had added 12 years to the life of the Part A trust fund. “The financial status of the HI trust fund is substantially improved by the lower expenditures and additional tax revenues instituted by the Affordable Care Act,” the report said. “These changes are estimated to postpone the exhaustion of HI trust fund assets from 2017 under the prior law to 2029 under current law.” The trustees also put the exhaustion date at 2028 under an “alternative scenario” in which not all of the ACA changes or existing physician-payment changes, which Congress has repeatedly overridden, are enacted. This presents a “more plausible outcome for future spending,” says the Medicare actuary.", "Republicans have long lambasted the ACA for reducing future growth in Medicare spending – which was estimated at $716 billion in savings over 10 years, primarily by reducing the future growth of payments to hospitals. But cutting future growth in spending improves Medicare’s financing. That’s the opposite of what Ryan claimed.", "As we’ve written before, experts, including Medicare’s own chief actuary, have doubted that all of the ACA cuts would be implemented as planned. “Many experts doubt the feasibility of such sustained improvements and anticipate that over time the Medicare price constraints would become unworkable and that Congress would likely override them,” the 2010 trustees report said.", "It’s worth noting that Ryan’s own budget plan in 2011-2012 actually kept some of the law’s cuts to the growth in Medicare spending. (In 2012, the Romney campaign argued that the ACA double-counted the savings — both to extend the life of the Part A trust fund and pay for other aspects of the law — and that it was a “raid” on Medicare. But, as we explained, that’s how government accounting works: After Treasury issues a bond that it will have to pay later, it can, and often does, spend the money it received on other things. Whenever Medicare wants to cash in trust fund bonds, however, Treasury must pay them.)", "In his comments to Fox News, Ryan mentions a “21-person board called the IPAB” that would enact “price controls on Medicare.” The Independent Payment Advisory Board — created by the ACA — is tasked with making recommendations on how Medicare can cut costs.", "The 15-member, independent board — which would be appointed by the president and confirmed by the Senate — would make binding recommendations if Medicare spending exceeded certain levels. But no one has yet been appointed to this board, and its actions haven’t been triggered, due to slow growth in per-enrollee health care spending. In other words, the IPAB hasn’t been formed because it hasn’t been needed.", "As the nonpartisan Kaiser Family Foundation explains in a July 2016 report, the IPAB process is set to be triggered for the first time next year, based on the Medicare actuary’s most recent spending projections. Without a board in place, the secretary of Health and Human Services would be tasked with making the recommendations for spending growth reductions, to start in 2019.", "Under the ACA, the IPAB’s (or HHS secretary’s) recommendations could be replaced by other measures passed by Congress to reduce spending, or overridden altogether. But that would require a three-fifths majority in each house. The board is limited in what it can do. It can’t raise taxes, premiums or cost-sharing; restrict benefits; or otherwise ration care. According to an analysis by the Kaiser Family Foundation, any recommended reductions would come from “Medicare Advantage, the Part D prescription drug program, skilled nursing facility, home health, dialysis, ambulance and ambulatory surgical center services, and durable medical equipment.”", "And with a new administration coming into office in January, it’s unclear what would happen to these provisions of the law. But if the growth in spending were to be reduced — whether through IPAB or other means — that would improve the outlook for Medicare’s financing.", "Correction, Dec. 13: We originally wrote that Part A was the only part of Medicare first enacted in the 1960s. Part B was also enacted then. We have corrected the error. We also made clear that it is Part B and Part D that are mainly paid for with general government revenues.", "https://www.sharethefacts.co/share/0276d17e-86b0-4ceb-84e2-296349dd45d3", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]