["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "During the 2020 presidential campaign season, supporters of U.S. President Donald Trump circulated memes and video clips purportedly documenting Trump's opponent, former Vice President Joe Biden, referring to Black people using the racial slur commonly known as the \"n-word\":", "It's true that Biden said the words captured above during the course of a U.S. Senate hearing, but the presentations seen here omit the crucial context that Biden was expressing neither his own words nor his own thoughts.", "On June 5, 1985, Biden -- who was then a U.S. Senator representing Delaware and a member of the Senate Judiciary Committee -- was questioning William Bradford Reynolds, the assistant U.S. attorney general for the Civil Rights Division, who had recently been nominated by President Ronald Reagan for promotion to associate attorney general.", "Biden opposed Reynolds' nomination on the grounds that Reynolds \"had pursued a conservative political agenda and had shown contempt for civil rights laws,\" particularly by opposing a redistricting plan (i.e., the \"Nunez plan\") that would have eliminated gerrymandering to create a majority Black congressional district in Louisiana, and by ignoring racist comments issued by the state's lawmakers.", "During a committee hearing on Reynolds' nomination, Biden pointed out that Reynolds had approved a redistricting plan that favored Republicans over the state's Black residents, and that Reynolds had been made aware, via a memo from his staff, that legislators who opposed the Nunez plan had engaged in making racially disparaging comments. It was in that context, then, that Biden confronted Reynolds by reading out loud portions of the memo detailing racial slurs used by Louisiana legislators: “[Your staff] brought to your attention the allegation that important legislators in defeating the Nunez plan, in the basement, said, ‘We already have a n----- mayor [in New Orleans], we don’t need any more n----- big shots.’”", "Biden's point was that those comments, among other evidence, should have alerted Reynolds to issues with approving the Louisiana governor’s redistricting plan over the so-called Nunez plan. Biden's efforts in opposing Reynolds were successful, as the Senate Judiciary Committee ultimately rejected his nomination for promotion.", "Garcia, Philip J.   \"Assistant Attorney General William Bradford Reynolds, the Justice Department's Controversial Civil Rights Chief, Resigned Wednesday Effective Dec. 9.\"\r\n    UPI.   9 November 1988.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]