["The eight-minute 24-second video was published here in a Facebook post on November 23, 2020.", "The post's Hindi-language caption translates to English as: “A rare video of our Prime Minister doing yoga in his young days.”", "Indian Prime Minister Narendra Modi successfully proposed creating International Yoga Day -- now celebrated every year on June 21 -- at the United Nations General Assembly in 2014.", "The video was also shared here, here, here and here on Facebook, here and here on Twitter, and here and here on YouTube alongside an identical claim.", "The claim is false.", "A reverse image search on Google by keyframes of the video obtained using digital verification tool InVID-WeVerify found this yoga website, where a photo of a similar looking man is shown. He can be seen doing the identical yoga position seen in the Facebook video.", "According to the website, the man seen in the photo is B.K.S.Iyengar, a renowned Indian yoga teacher who popularised this art and Indian philosophy in the west.", "A keyword search found this 11-year old YouTube video published here alongside an article about teachings and style of Iyengar yoga.", "“Krishnamacharya & B.K.S. Iyengar in 1938 with Yoga Sutras, Part 1of 6,” reads the YouTube video description.", "Several other videos of the yoga teacher can be seen on the YouTube channel.", "B.K.S. Iyengar can be seen practicing difficult yoga positions in the photos published here on his official website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]