["A video capturing the aftermath of a road accident involving several buses is being circulated on social media. Multiple dead bodies are seen lying on the road while a person shoots the video of the surrounding. A Facebook user Nakki Mogi posted the video claiming to be of an accident that took place on Ajmer Highway.", "“अजमेर रोड , हाईवे पर खतरनाक एक्सीडेंट जिसमें 22 लोगों की मौत हो गई है और करीब 10 घायल हो गए हैं तो इसलिए आपसे विनम्र निवेदन है कि इस पोस्ट को ज्यादा से ज्यादा शेयर करें की जिनका परिवार इंतजार कर रहे हैं उन्हें पता चल जाएँ धन्यवाद जी (In a road accident which took place at Ajmer Highway, 22 people died and around 10 were injured. Hence you are humbly requested to share this post as much as possible so that the families of these people are informed -translated)”, reads the text posted along with the video.", "अजमेर रोड , हाईवे पर खतरनाक एक्सीडेंट जिसमें 22 लोगों की मौत हो गई है और करीब 10 घायल हो गए हैं तो इसलिए आपसे विनम्र निवेदन है कि इस पोस्ट को ज्यादा से ज्यादा शेयर करें की जिनका परिवार इंतजार कर रहे हैं उन्हें पता चल जाएँ धन्यवाद जी", "Posted by Nakki Mogi on Sunday, 28 July 2019", "Twitter user Rajeev Pandey posted the video with the identical narrative.", "The video is also circulating on WhatsApp.", "Watching the video frame-by-frame, Alt News found a plate, in one of the frames, which suggested that it could be from Harare, Zimbabwe.", "With a keyword search on Google, we found that a collision between two buses took the lives of nearly 50 people in Zimbabwe in November 2018. According to a report published by News 24, two buses traveling in the opposite direction collided near Rusape, which is located about 170 km east of the capital Harare.", "Moreover, we also found a video news report by Africanews, published on November 9, 2018. In the comparison below, we have juxtaposed an image published in a report of the said incident in Daily Mail in 2018 with a screenshot of the destroyed bus from the viral video. This comparison further corroborates that the video is from Zimbabwe and is of the same incident as reported by several international media outlets.", "In conclusion, an old video depicting the aftermath of a road accident in Zimbabwe was falsely shared on social media with the narrative that the said incident took place at Ajmer Highway in Rajasthan.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]