["About this rating", "In June 2020, an image supposedly showing a fundraising email for U.S. President Donald Trump's 2020 re-election campaign in which people were urged to join the \"Trump Army\" in order to fight the \"liberal MOB\" started to circulate on social media:", "This is a genuine fundraising email for the Trump campaign. The above-displayed image was originally shared on Twitter by Aaron Blake, a senior political reporter with The Washington Post. Blake forwarded a copy of this email to us so that we could verify that this message was truly sent by an email address (contact@action.gop.com) connected to Trump's re-election bid.", "The email featured a link to a WinRed URL, a fundraising platform endorsed by the Trump campaign and the Republican National Committee, which contained a similar message informing people that they could receive a \"Camo Keep America Great\" hat by joining the Trump Army. The WinRed site stated that all donations will benefit the \"Trump Make America Great Again Committee,\" one of the campaign's fundraising committees:", "The Southern Poverty Law Center released a statement calling this fundraising email \"appalling\":", "“It’s appalling to see President Trump’s reelection campaign trying to exploit our nation’s crisis during these trying times and incite division. The campaign is not only taking advantage of people’s current fears and insecurities, but, by using language that pins Americans against each other, they are inciting violence against the same people Trump swore to serve.\"", "While many people encountered the \"Trump Army\" for the first time due to Blake's tweet on June 4, 2020, this is not the first time that this language has accompanied a fundraising email for the Trump campaign. The Twitter account @TrumpEmail, a social media account that archives Trump fundraising emails, shared a similar message that was sent out circa May 5, 2020.", "That message read, in part:", "“The Trump Army is made up of the President’s fiercest defenders who are willing to go to battle with the Left-wing MOB whenever they come after us. Just take a look at everything they’ve fought for so far:”", "After Blake's tweet went viral, @TrumpEmail reported that they had received at least four emails containing the words \"Trump Army\" since March 2020:", "On March 2, 2020, the Trump Campaign put out a press release announcing the launch of Army for Trump, \"a website dedicated to recruiting and mobilizing Americans across the country who are committed to fighting to re-elect President Trump.\" While the Army for Trump website does use some military terms (they ask supporters to \"enlist\" for campaign updates, instead of \"join\" or \"register\"), the website's main objective is to \"provide a one-stop online destination to get involved with President Trump's re-election campaign, allowing people to become a volunteer or activist in communities throughout the country.\"", "Todd, Chuck; Murray, Mark; Dann, Carrie; Holzberg, Melissa.   \"As Minneapolis Burns, Trump Fans the Flames.\"\r\n    NBC News.   29 March 2020.", "Markay, Lachlan.   \"The Republican Party’s Big New Online Donor Portal Is Off to a Bumpy Start.\"  \r\n  Daily Beast.   6 August 2019.", "Bland, Scott.   \"Trump-Backed Online Donor Platform Launches at State Level Ahead of Redistricting.\"\r\n    Politico.   17 April 2020.", "Yin, eon; Jeffries, Adrianne; Matu, Surya.   \"How We Examined Gmail’s Treatment of PoliticalEmails.\"\r\n    The Markup.   26 February 2020.", "Donaldjtrump.com.   \"Trump Campaign Announces Launch of 'Army for Trump' Website Ahead of the 2020 Election.\"\r\n    2 March 2020.", "SLPC.   \"SPLC Action Fund: Trump Campaign Email Incites Division and Violence.\"\r\n    5 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]