["By Robert Farley", "Posted on August 28, 2018", "In announcing a tentative agreement with Mexico, President Donald Trump called Mexico “a very large trading partner” and said negotiations would now begin with Canada, which he called a “smaller segment.” But U.S. trade with Canada was about $57 billion larger than trade with Mexico in 2017.", "Trump’s comment came during a phone call with President Enrique Peña Nieto of Mexico to announce what Trump called the “United States-Mexico Trade Agreement.” Trump said the new pact would replace the North American Free Trade Agreement, or NAFTA, which also includes Canada. (We should note that it is far from a done deal. An agreement would still have to be approved by the U.S. Congress, as well as by Mexican lawmakers.)", "Left unresolved was whether Canada would be a part of the new deal, though Trump said negotiations with the U.S. northern neighbor would begin “pretty much immediately.” (Indeed, Canadian Foreign Affairs Minister Chrystia Freeland arrived in Washington the following day for talks.)", "Although Peña Nieto made clear in the call that he wants Canada to be incorporated into the deal, Trump said that when it comes to Canada, “We can have a separate deal or we can put it into this deal.” Alternatively, Trump said that the U.S. might impose tariffs on U.S. imports of cars from Canada.", "“But one way or the other, we have a deal with Canada,” Trump said. “It will either be a tariff on cars, or it will be a negotiated deal.”", "Trump, Aug. 27: We made the deal with Mexico. And I think it’s a very — deal. We’re starting negotiations with Canada, pretty much immediately. I can’t tell you where those negotiations are going. It’s going to be a — it’s a smaller segment, as you know. Mexico is a very large trading partner. But we’ve now concluded our deal and it’s being finalized.", "We reached out to the White House and the Office of the U.S. Trade Representative for clarification of the president’s remark about the Canadian deal being a “smaller segment.” We did not get a response. In context, the president appears to be saying that Mexico is a larger trading partner with the U.S. than Canada. And that’s not the case.", "According to the U.S. Census Bureau, Canada and Mexico are the second and third largest trading partners for the U.S., in that order.", "In 2017, the U.S. did nearly $680 billion worth of trade in goods and services with Canada, the Census Bureau reports — $341.3 billion in exports and $338.5 in imports. That was about $57.7 billion more in trade with Canada than with Mexico. The U.S. did $622.1 billion worth of trade with Mexico — $276.7 billion in exports and $345.4 billion in imports.", "China was tops in combined trade with the U.S. at $711.7 billion.", "Figures from the Office of the U.S. Trade Representative show similar results. According to its estimates, U.S. goods and services trade with Canada totaled $673.1 billion in 2017. That’s $57.2 billion more than the $615.9 billion in total U.S. goods and services trade with Mexico last year. (The Census and USTR trade numbers differ slightly because the Census numbers are on a “balance of payments basis,” an adjustment made by the Bureau of Economic Analysis, as we’ve explained before.)", "We will update this item if we hear back from the White House.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]