["The photo was published here on Facebook on February 11, 2019. It has been shared more than 250 times.", "The text superimposed at the bottom of the image reads: “Lynn Rothschild and her eating babies decor”.", "Lynn Forester de Rothschild, or Lady de Rothschild, is married to Evelyn de Rothschild, a member of the Rothschild banking family. The family is one of the richest in the world, according to the Financial Times.", "The image was also shared on Facebook here, here, here and here, and on Twitter here, here and here alongside a similar claim. Some of the posts also describe Lady de Rothschild “evil” and a “mass murderer”.", "The claim is false; the original photo of Lady de Rothschild does not include the same painting in the background.", "Original photo", "A reverse image search on Google found a similar photo of Lady de Rothschild posing in front of a different painting.", "The photo appeared in this May 2014 Harper's Bazaar article titled “At Home With Lady de Rothschild”.", "The photograph's caption reads: “The main house at Ascott contains Rothschild family heirlooms and art, including the painting Five Brood Mares at the Duke of Cumberland's Stud Farm, by George Stubbs.” The image was credited to Simon Upton, a UK-based photographer.", "In response to an AFP enquiry, Upton’s representative, Karen Howes, said: “The original portrait taken by Simon Upton of Lady de Rothschild is the one as published in Harper’s Bazaar in 2014.”", "The UK’s National Trust confirms on its website that the 1765 painting by renowned English artist George Stuggs is part of its collection at Ascott Estate. The Ascott Estate was donated to the National Trust in 1949 but “remains the countryside residence for the de Rothschild family.”", "'Baby-eating' painting", "The “eating babies decor”, as stated in the misleading claim, was in fact a copy of an image at the bottom right-hand corner of The Last Judgment, an early 15th-century painting by Italian Renaissance painter Fra Angelico.", "According to the website Art in Tuscany, “the painting depicts the Demons of Hell torturing the souls of the wicked. The very bottom shows Satan chewing on some of the souls”.", "The original photograph of Lady de Rothschild has also been photoshopped in other ways, including here where she appears to be posing in front of a painting of US President Donald Trump, and here with an image of a red devil behind her.", "Other conspiracy theories targeting the Rothschilds include one that alleges the family is behind the novel coronavirus pandemic, and another that states it controls the weather to profit off natural disasters, as reported by Forbes and The Washington Post here and here. The family is also often associated with rumours about the Illuminati and satanism.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]