["About this rating", "The video shows a small group of people in London chanting in support of Donald Trump. At least one of them is from London.", "The video was filmed in March 2017, has nothing to do with the June 2017 terrorist attack, and shows a small group of far-right extremists counter-protesting an anti-racism rally where thousands expressed opposition to Donald Trump and his policies.", "On 5 June 2017, the Red State Watcher web site posted two articles featuring a video that appeared to show Londoners chanting U.S. President Donald Trump's name in the aftermath of a terrorist attack in the city two days earlier, which left at least victims dead, as well as the three attackers.", "One article carried the headline \"Wow! Londoners chant President Trump's name instead of mayor,\" and another was headlined \"Sadiq Khan May Be In Trouble - Look What Londoners Are Doing!\"", "That story went on to claim:", "Londoners are fed up [with] Sadiq's [sic] Khan's soft stance on terrorism. As British citizens die, Kahn [sic] tells the public \"not to be alarm.\" [sic] This did not settle well with some citizens.", "Some Londoners took [to] the streets and instead of chanting Khan's name, they chanted Donald Trump's.", "Both stories included the following video:", "Sadiq Khan is an EMBARRASSMENT", "? Londoners chant #Trump's name instead of hispic.twitter.com/flBWoTEKGN@realDonaldTrump #MAGA #LondonBridge", "— Boca Vista (@bocavista2016) June 5, 2017", "The articles, the posting of the video, and the text that accompanied it - which labelled London Mayor Sadiq Khan an \"embarrassment\" - all came in the context of a high-profile dispute between Khan and Trump.", "The morning after the attack, Trump grossly misrepresented comments made by Khan, claiming that the London Mayor had told the people of the British capital there was \"no reason to be alarmed\" at the attack.", "In fact, Khan was referring specifically to increased police patrols on the streets of London, and reassuring its residents not to be unduly concerned by that escalation.", "A spokesperson for the London Mayor then issued a statement calling Trump's tweet \"ill-informed\" and accusing him of deliberately taking Khan's comments out of context.", "The following day, Trump doubled down on his attack, saying the mayor's explanation of his remarks - which was accurate - was a \"pathetic excuse.\"", "Contrary to what the Red State Watcher articles implied, however, the video had nothing to do with that dispute, or with the June 2017 terrorist attack.", "In fact, Paul Golding, leader of the right-wing extremist group Britain First, shot the video in March 2017:", "London today! \"DONALD TRUMP WE LOVE YOU!\" pic.twitter.com/AOryV4RtND", "— Paul Golding (@GoldingBF) March 18, 2017", "The video shows a small group of far-right activists engaged in a counter-protest at a much larger anti-racism rally in London on 18 March, at which demonstrators carried signs saying \"Stand up to Trump.\"", "It's possible some of those chanting in favor of the US President are from London - Paul Golding himself is from the British capital - but the video does not show a spontaneous assembly of non-aligned Londoners favoring Donald Trump over Sadiq Khan in their dispute, following a 3 June 2017 terrorist attack in the city.", "Bowden, George.  \"March Against Racism Demo Attracts Thousands, Including Britain First, to Central London.\"\r\n  Huffington Post UK.  18 March 2017", "Bulman, May; Agerholm, Harriet.  \"30,000 Join March Against Racism in 'Defiance and Unity' Against Brexit and Donald Trump.\"\r\n  The Independent.  18 March 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]