["Donald Trump was at Trump Tower in New York City on Sept. 28, 2015 when he announced his tax reform plan. (Getty Images photo)", "For being Hillary Clinton surrogates, two Wisconsin lawmakers sounded rather like Bernie Sanders when they got on the phone with reporters to denounce Donald Trump’s tax plan.", "\"For the billionaires, by the billionaires,\" state Rep. Cory Mason of Racine declared in the May 11, 2016 teleconference, which was arranged by Clinton’s Wisconsin campaign.", "Mason was joined by fellow Democrat Jennifer Shilling of La Crosse, the Senate minority leader. Her attack was more specific.", "Shilling stated that with Trump’s plan, \"the top 0.1 percent of taxpayers -- people earning multiple millions of dollars a year, on average -- would get more tax relief than the bottom 60 percent of taxpayers combined.\"", "Economic inequality has been a signature issue for Sanders, whose presidential campaign has kept Clinton from claiming the presumptive nominee title Trump has on the Republican side.", "When Sanders said in Madison that the top one-tenth of 1 percent of Americans own almost as much wealth as the bottom 90 percent, we rated his claim Mostly True  .", "Let's take a look at Shilling’s one-tenth of 1 percenters claim -- which, as we’ll see, was made at something of a moving target.", "The figures", "Standing in the lobby of Trump Tower in midtown Manhattan in September 2015, Trump rolled out his tax reform plan -- which some analysts immediately saw as a boon for the wealthy.", "He proposed significant cuts across the board, PolitiFact National found, but the wealthiest would get the most in tax cuts. For the highest income earners, the top income tax rate would drop from 39.6 percent to 25 percent.", "When we asked about Shilling’s claim, Clinton’s Wisconsin campaign cited an analysis by the nonpartisan Tax Policy Center, a joint venture of two Washington, D.C. think tanks: the Urban Institute and the Brookings Institution.", "The analysis found that on average, under Trump’s plan, households at all income levels would receive tax cuts -- but the highest-income households would receive the largest cuts, both in dollars and as a percentage of income.", "More specific to Shilling’s claim:", "The highest-income 0.1 percent of taxpayers -- those who had an income of over $3.7 million in 2015 -- would get an average tax cut of more than $1.3 million in 2017.", "That same group would receive 18 percent of the tax reduction, while the bottom 60 percent of taxpayers would receive 16.4 percent of the reduction.", "At our request, the liberal Citizens for Tax Justice also did calculations, which came out nearly the same: The top 0.1 percent would get 17 percent of Trump's proposed tax cuts and the bottom 60 percent would get 13 percent of the cuts.", "To some extent, this isn’t a surprise, in that the wealthiest pay the lion’s share of income taxes. In a June 2015 report, the Tax Policy Center said the top 0.1 percent pay 21.1 percent of all individual income taxes and the bottom 60 percent pays 1.5 percent.", "Alan Cole, an economist with the Tax Foundation, also ran the numbers and told us Shilling’s claim is accurate. But Cole noted that under Trump’s plan:", "-- People in the 40th to 60th percentiles have about 99 percent of their income tax liability removed.", "-- People in the 0 to 40th percentiles who paid positive income taxes have about 100 percent of their income tax liability removed.", "\"So the reason Trump’s plan doesn’t cut middle-class income taxes by more than that is, well, you can’t cut middle-class income taxes by more than that,\" Cole said.", "So, the figures back Shilling.", "The thing is, shortly before she made her claim, Trump’s tax proposal was changing. Sort of. Maybe. Or was it?", "Trump’s equivocation", "In the three days prior, Trump said he might raise, not lower, taxes on the wealthy. Then he indicated the wealthy would get tax cuts, but the cuts might be less than what is in his plan. And then Politico reported that Trump’s campaign had enlisted conservative economists to revise his plan, and that they were advising a top tax rate of 28 percent -- higher than the 25 percent in Trump’s proposal.", "All of which has caused some confusion as to what Trump would do with taxes.", "Nevertheless, by the time Shilling made her statement, Trump had not changed his tax proposal, which remained on his campaign website.", "(Indeed, for what it's worth, the day after Shilling’s claim, a Trump spokeswoman told the New York Times: \"There are no changes being made to the plan.\")", "Our rating", "Shilling said that under Trump's tax plan, \"the top 0.1 percent of taxpayers -- people earning multiple millions of dollars a year, on average --  would get more tax relief than the bottom 60 percent of taxpayers combined.\"", "A report from a respected nonpartisan research group calculates that the 0.1 percent -- those making more than $3.7 million per year -- would receive 18 percent of the tax cuts under Trump’s proposal. The bottom 60 percent of taxpayers, meanwhile, would enjoy only 16.4 percent of the cuts. Another tax group found similar figures.", "Trump has indicated he might make alter his tax proposal, but he hadn’t as of when Shilling made her statement -- so we rate the statement True.", "Watch the WTMJ-TV PolitiFact segment on this fact check. PolitiFact segments air during the 6 p.m. newscasts Wednesdays and Fridays.", "State Sen. Jennifer Shilling conference call with reporters, May 11, 2016", "Interview, Hillary Clinton Wisconsin campaign communications director Gillian Drummond, May 17, 2016", "Interview, Tax Policy Center senior research associate Joseph Rosenberg, May 17, 2016", "PolitiFact National, \"PolitiFact's guide to the 2016 presidential candidate tax plans,\" April 7, 2016", "PolitiFact National, \"Trying to pin down what Donald Trump thinks about abortion, the minimum wage, taxes, and U.S. debt,\" May 11, 2016", "Tax Policy Center, analysis (Table 6) of Donald Trump’s tax plan, Dec. 22, 2015", "Politico, \"Trump launches tax plan rewrite,\" May 10, 2016", "Citizens for Tax Justice, \"Donald Trump's Tax Plan Would Cost $12 Trillion,\" March 17, 2016", "Tax Foundation, \"Details and Analysis of Donald Trump’s Tax Plan,\" Sept. 29, 2015", "Interview, Tax Foundation director of federal projects Kyle Pomerleau, May 18, 2016", "Email, Citizens for Tax Justice director Bob McIntyre, May 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]