["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This claim is complete nonsense and disproves itself within the story.", "The bill cited as proof says nothing about decertifying or awarding Wisconsin votes to Trump.", "It simply says the Legislature will prioritize legislation addressing election laws.", "The disinformation onslaught of 2020 isn’t exactly reversing course in the new year.", "The runup to the Jan. 6 finalizing of the Electoral College vote brings us one particularly absurd example from Gateway Pundit, a far-right online publication that routinely publishes stories unburdened by facts or common sense.", "The headline published late Jan. 4, 2021, said this: \"BREAKING: Wisconsin Legislature Announces Resolution To Be Introduced on Thursday Which Will Likely Decertify State and Award to President Trump.\"", "This article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook).", "The claim isn’t remotely true, and the ill-conceived story itself provides evidence of that.", "The story begins with a paragraph largely restating the headline, then embeds a tweet making the same outlandish claim.", "The story then links to and quotes the resolution in question, 2021 Assembly Resolution 3, proposed by state Rep. Scott Allen, R-Waukesha. The Republican-controlled Assembly passed the bill Jan. 4 by a voice vote near the end of inauguration ceremonies, which most Democrats skipped over concerns that COVID-19 precautions were inadequate.", "But the story ignores that the bill says nothing about decertifying.", "Here’s the actual closing of the bill, where the \"Resolved\" sections indicate the action it is seeking:", "Resolved by the assembly, That: the Wisconsin State Assembly recognizes that the most important function for a government is to conduct fair and honest elections that follow the duly enacted law; and, be it further", "Resolved, That when there are significant portions of the population that question the integrity of the elections due to the failure of election officials to follow the letter of the law, it is incumbent upon the legislature to address the issues that are in question; and, be it further", "Resolved, That the members of the Wisconsin State Assembly place the redress to these and other election law violations and failed administrative procedures as its highest priority and shall take up legislation crafted to ensure civil officers follow the laws as written.", "It doesn’t take a degree in English literature to discern this doesn’t award anything to President Donald Trump. Trump lost Wisconsin to former Vice President Joe Biden by 20,000 votes, as confirmed by a canvas and recount.", "The bill simply says the Legislature should make it a priority to take up legislation ensuring election officials follow laws as written.", "The timeline in the Gateway Pundit story is also divorced from reality. The \"Thursday\" cited here would be a day after Congress meets to finalize the election results.", "And the deadline for action to alter Wisconsin’s slate of electors has long-since passed. The state’s 10 Biden electors cast their votes on Dec. 14. As expected based on election returns confirmed as fair and legitimate by election and government officials from both parties nationwide, that gave Biden a 306 to 232 victory over Trump, handing him the White House.", "Gateway Pundit Editor Jim Hoft did not immediately reply to an email seeking evidence of this article’s claim.", "Allen declined to comment on how the story characterized his resolution, saying the text speaks for itself.", "Gateway Pundit, a regular purveyor of disinformation, says Wisconsin is introducing a resolution to decertify the state’s election results and award its Electoral College votes to Trump.", "The article conveniently includes the text of the bill, allowing readers to see for themselves this claim is 100% fabricated.", "The bill simply says the Legislature would prioritize legislation addressing election laws. It says nothing remotely related to decertification or awarding the state to Trump. And in any case, the state’s electoral votes were already cast for Biden weeks ago.", "This is disinformation in its most transparent form.", "We rate this Pants on Fire!", "Gateway Pundit, BREAKING: Wisconsin Legislature Announces Resolution To Be Introduced on Thursday Which Will Likely Decertify State and Award to President Trump, Jan. 4, 2021", "Wisconsin Legislature, Assembly Resolution 3, passed Jan. 4, 2021", "The Associated Press, Electoral College makes it official: Biden won, Trump lost, Dec. 14, 2020", "Milwaukee Journal Sentinel, Wisconsin's 10 Electoral College votes cast for Biden as GOP pushes an alternate slate, Dec. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]