["Several users have shared a PDF file or its screenshot which appears to be a notice from the Ministry of Health & Family Welfare, Government of India. The subject line states it is a ‘clarification regarding the declaration of holidays for the states – Maharasthra, Gujrat, Uttar Pradesh and Sikkim.’ It further states –", "Alt News has received several requests to fact-check this image on WhatsApp (+917600011160) and on our official Android application.", "On March 13, Ministry of Health tweeted the screenshot of their press release debunking the viral claim. The tweet also has a link to its official website.", "#CoronaVirusUpdate :", "Fact check on fake O.M of Health Ministry.", "Details can be seen here: https://t.co/e9BFk3M70b@PMOIndia @drharshvardhan @AshwiniKChoubey @PIB_India @MIB_India @DDNewslive @ANI @DG_PIB @PTI_News pic.twitter.com/YPghdkZM76", "— Ministry of Health (@MoHFW_INDIA) March 13, 2020", "The press release was posted on March 13 at 7:19 PM by PIB Delhi. It informed, “A fake O.M. from the Ministry of Health & Family Welfare has been doing the rounds today. The fake O.M. is regarding the subject “Clarification regarding declaration of holidays for the States” and is dated March 13, 2020. It is clarified that the above mentioned O.M is fake and has NOT BEEN issued by the Ministry of Health & Family Welfare. Necessary action under extant law is being initiated.”", "Therefore, the viral document which states it offers “clarification regarding the declaration of holidays for the states- Maharasthra, Gujrat, Uttar Pradesh and Sikkim” is false. It was debunked by the Ministry of Health via press release. Alt News has debunked several other misinformation around coronavirus, including a fake health advisory circulating in the name of UNICEF.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]