["About this rating", "On 20 May 2016, the Facebook page \"American News\" shared a post claiming that President Obama had declared Islam \"as America's religion\":", "The post linked to a 20 May 2016 article published by the web site American News, which significantly backpedaled from the headline:", "Throughout the course of his presidency, President Barack Obama has tried to assert that he is a Christian man. Time and time again, his claims have been tested by actions that demonstrate that his loyalties clearly lie elsewhere.", "That was confirmed at the National Prayer Breakfast, where Obama called Islam an American religion.", "While the article appeared on 20 May 2016, the comments were excerpted from President Obama's official remarks at the National Prayer Breakfast on 5 February 2015:", "Our job is not to ask that God respond to our notion of truth -- our job is to be true to Him, His word, and His commandments.  And we should assume humbly that we’re confused and don’t always know what we’re doing and we’re staggering and stumbling towards Him, and have some humility in that process.  And that means we have to speak up against those who would misuse His name to justify oppression, or violence, or hatred with that fierce certainty.  No God condones terror.  No grievance justifies the taking of innocent lives, or the oppression of those who are weaker or fewer in number.", "And so, as people of faith, we are summoned to push back against those who try to distort our religion -- any religion -- for their own nihilistic ends.  And here at home and around the world, we will constantly reaffirm that fundamental freedom -- freedom of religion -- the right to practice our faith how we choose, to change our faith if we choose, to practice no faith at all if we choose, and to do so free of persecution and fear and discrimination.", "[...]", "The Torah says “Love thy neighbor as yourself.”  In Islam, there is a Hadith that states: \"None of you truly believes until he loves for his brother what he loves for himself.”  The Holy Bible tells us to “put on love, which binds everything together in perfect harmony.”  Put on love.", "President Obama's remarks at the National Prayer Breakfast on 4 February 2016 made a single mention of Islam, in an excerpt during which the President affirmed his own faith as Christian:", "Now, those two stories, they give me courage and they give me hope.  And they instruct me in my own Christian faith.  I can’t imagine a moment in which that young American sergeant expressed his Christianity more profoundly than when, confronted by his own death, he said “We are all Jews.”  (Applause.)  I can’t imagine a clearer expression of Jesus’s teachings.  I can’t imagine a better expression of the peaceful spirit of Islam than when a Muslim father, filled with fear, drew from the example of a Baptist preacher and a Jewish rabbi to teach his children what God demands.", "American News regularly publishes outdated, misleading, or otherwise inaccurate items with clickbait headlines designed to attract traffic via social media. Previous inaccurate or false items from that web site included claims Texans were being forced to pay reparations for slavery, Canada banned Beyonce due to her Super Bowl 2016 performance, President Obama personally prohibited a Navy Admiral from distributing Bibles to servicemen, and that FEMA opened a concentration camp in Arizona.", "The White House Office of the Press Secretary.   \"Remarks By The President At National Prayer Breakfast.\"\r\n5 February 2015.", "The White House Office of the Press Secretary.   \"Remarks By The President At National Prayer Breakfast.\"\r\n4 February 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]