["A minute-long video of the event was published on Facebook here on January 26, 2021.", "“Thank you every Indian who supported the protest that Indian Flag has been replaced by Khalistan Flag and thank you Home Minister Amit Shah for being ignorant,” reads the post's caption.", "“Khalistan flag raised at Red Fort on Republic Day,” reads red and white text superimposed on the footage.", "The video was widely shared online (including here, here and here) soon after a group of protesters stormed the historic Red Fort in Delhi on January 26, 2021, as AFP reported here.", "Indian farmers, mainly Sikhs from the northern states of Punjab and Haryana, have been protesting against the new agriculture laws introduced by the Indian government. They took part in a mass tractor rally in Delhi on the sidelines of the country’s Republic Day parade on January 26, 2021.", "Khalistan is a Sikh political ideology that calls for an independent homeland for Indian Sikhs. Amit Shah is India's home minister.", "However, the claim that the footage shows protesters replacing the Indian flag with the Khalistan flag is false.", "A keyword search found the clip shared in the misleading Facebook posts was taken from a video shot and tweeted here by Indian news agency ANI on January 26, 2021.", "#WATCH A protestor hoists a flag from the ramparts of the Red Fort in Delhi#FarmLaws #RepublicDay pic.twitter.com/Mn6oeGLrxJ", "An analysis of the video shows India’s national tricolour flag remained untouched and intact throughout the duration of the video, as highlighted in the screenshots below:", "The Indian national flag also remains untouched in other visuals published by national and international media throughout the occupation of the Red Fort; for example here by AFP, here by Al Jazeera and here by The Indian Express.", "A further analysis of the video found the flag seen in the protester’s  hand does not match with the flags seen at pro-Khalistan events around the world.", "Nishan Sahib", "The light yellow triangular flag with a khanda — a double-edged sword symbol — printed in the centre is known as Nishan Sahib, a symbol of Sikh spirituality.", "Below is a screen comparison screenshot of the flag seen in the man’s hand in Facebook video (L) and and photo of Nishan Sahib (R) published here on a Sikh-religious website:", "On the other hand, Khalistan supporters are usually seen with yellow, saffron or blue flags with \"Khalistan\" printed on them in Punjabi or English,as seen in the below screenshots of AFP photos taken at different pro-Khalistan events:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]