["One of the videos was tweeted by the White House director of social media, Dan Scavino, and the other by Charlie Kirk, the founder of Turning Point USA, a conservative student organization.", "In the clips, Biden says: “Turn this primary from a campaign that’s about negative attacks into one about what we’re for, because we cannot get re-elect, we cannot win this re-election, excuse me, we can only re-elect Donald Trump.”", "“I agree with Joe!” Trump commented when he retweeted Scavino.", "“Sleepy Joe in St. Louis, Missouri today: ‘We can only re-elect @realDonaldTrump,’” Scavino tweeted, while Kirk wrote: “I finally agree with Joe Biden on something! He’s exactly right—If we don’t want 4 years of this, we can only re-elect @realDonaldTrump.”", "The Trump campaign’s official Twitter account tweeted a shorter version of the clip that ends as if it were an ad, with the president’s voice saying: “I’m Donald J. Trump, and I approve this message.”", "But in this video of Biden's remarks -- which shows him speaking in Kansas City, Missouri, not St. Louis as Scavino claimed -- it is clear he is not admitting defeat.", "“If you want a nominee who will bring this party together, who will run a progressive, positive campaign and turn, turn this primary from a campaign that’s about negative attacks into one about what we’re for, because we cannot get re-elect, we cannot win this re-election, excuse me, we can only re-elect Donald Trump if in fact we get engaged in this circular firing squad here. It’s gotta be a positive campaign, so join us,” he says.", "Twitter has marked Scavino’s tweet as “manipulated media,” spokesperson Trenton Kennedy said.", "“I can confirm... that this Tweet was labeled based on our Synthetic and Manipulated Media policy,” Kennedy told AFP by email.", "It is not the first misleading video about a Democratic presidential candidate to be spread by Trump: in January 2020, the president retweeted a misleadingly edited clip of Tom Steyer in which the now former candidate said Democrats would destroy the economy.", "But Steyer’s full remarks showed that he was characterizing Trump's position, not his own.", "An account managed by Trump’s campaign tweeted a video of Pete Buttigieg -- who has also since left the race -- the following month, falsely claiming that he “doesn’t care” if Americans lose health insurance they have through their employers.", "But sections of Buttigieg’s remarks that were not included in the clip made clear that he was speaking about giving people a choice between public and private insurance options, not expressing indifference about them losing existing coverage.", "Michael Bloomberg -- who has dropped out of the race for the Democratic nomination -- also tweeted a video in February that had been misleadingly edited to make it appear that his Democratic rivals were left speechless for a lengthy period by a comment that he made during a debate.", "In reality, Bloomberg quickly resumed speaking following the remark.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]