["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In an interview on Fox News on June 26, 2011, host Chris Wallace asked Republican presidential candidate Rep. Michele Bachmann about a story that appeared in the Los Angeles Times the day before that accused her of being hypocritical in her opposition to farm subsidies because her late father-in-law's farm, in which she and her husband own a partnership stake, has received nearly $260,000 worth of crop subsidies.\n\n\"Regarding the farm,\" Bachmann said. \"The farm is my father-in-law’s farm. It’s not my husband’s and my farm. It’s my father-in-law’s farm and my husband and I have never gotten a penny of money from the farm.\"\n\nThe farm in question sits on 949 acres in Independence, Wis., and was operated by Bachmann's father-in-law, Paul Bachmann. The congresswoman told The Associated Press that her husband became a trustee of the farm because his father had dementia before he died in May 2009, and that her husband \"oversees the legal entity.\"\n\nHowever, records show the Bachmann Farm Family Limited Partnership was formed in 2001, and Rep. Bachmann and her husband have a stake in it. All of Rep. Bachmann's financial disclosure forms, filed with the Clerk of the House, list the Bachmann Farm Family LP as an asset of hers worth between $100,000 and $250,000.\n\nPaul Bachmann received nearly $260,000 in farm subsidies between 1995 and 2007, according to U.S. Department of Agriculture data compiled by the Environmental Working Group. The lion's share, about $250,000 of it, was corn and dairy program subsidies. There are no records of any crop subsidies after 2007.\n\nIn December, 2010, Bachmann told the Minneapolis Star-Tribune that any subsidies going to the farm were for her in-laws. \"I'm very proud of them,\" she said. \"They came to the United States essentially to get away from socialism in Europe.\"\n\nDespite hundreds of thousands of dollars in farm subsidies applied for, and awarded to, her father-in-law, Bachmann has consistently positioned herself against them. In 2008, for example, she voted against a $290 billion, five-year farm bill (which passed despite the veto of President George W. Bush).\n\n\"It exemplifies the very worst of Washington's ways,\" Bachmann said in a May 23, 2008, Gannett News Service story. \"It is loaded with unbelievably outrageous pork and subsidies for agricultural business and ethanol growers.\"\n\n\"Americans are being squeezed by taxes and rising living costs, and Congress wants them to pick up the tab for pet earmarks and wealthy landowners,\" she said.\n\nAs she did in her Fox News interview on June 26, 2011, Bachmann told the Minneapolis Star-Tribune last December that she has never received \"one penny\" from her in-laws' family farm in Independence, Wis.\n\nBut her congressional financial disclosure forms say she has.\n\nAccording to her 2009 financial disclosure form, the Bachmann Farm Family LP brought her income between $15,001 and $50,000. The form even has \"farm income\" written in to describe the type of income. The 2008 form shows the same thing, farm income between $15,001 and $50,000. The 2007 also lists farm income, but the online copy does not make clear which income range Bachmann checked that year. The 2006 form lists farm income between $2,501 and $5,000.\n\nIn other words, at a minimum Bachmann has received somewhere between $32,503 and $105,000 in farm income between 2006 and 2009, according to her disclosure forms. That's a lot of pennies.\n\nWe got no response to queries sent to the Bachmann campaign. But Matt Lewis of the Daily Caller reported on May 15, 2011, \"Bachmann’s team tells me the family farm was put in a trust in order to provide for succession, which means that while the financial disclosure paperwork shows her as benefiting by virtue of her role as trustee, she has not received any of the money and is not involved in any operational decisions.\"\n\nBut that doesn't add up, according to several campaign finance experts we spoke to.\n\n\"I don’t know of any other possible explanation for her financial disclosure reports (other than that she received income from the farm partnership),\" said Brett Kappel, a lawyer with the firm Arent Fox LLP who specializes in campaign finance law. \"If she was just a trustee and received no income she would have to report her position as a trustee, but wouldn’t have had to report any income from the farm.\"\n\nSaid Jock Friedly, whose website Legistorm tracks data on congressional salaries: \"There does appear to be a conflict between her claims to the AP, to Fox News and on the financial disclosures. In particular, if her husband 'oversees the legal entity' but she and her husband and dependents have no personal stake, they need not report it as far as I can see from reading the House ethics manual. As a practical matter, I have seen some people report on the financial disclosures that they oversee assets but point out that they are not their own and that they have no personal stake in them. Most people will report it in the 'Agreements' or 'Positions' section of their disclosure instead of under assets, since that’s where it really belongs if you are entrusted with managing someone else’s money.\"\n\nFriedly said it's possible that she technically didn't get a penny because the profits may have been treated as retained earnings and invested in things such as new tractors.\n\n\"But the key point here is that while she may not have received a distribution yet, that’s because in theory the entire enterprise is more valuable, with more money in the bank account or in farm equipment. She will get it later on. So from her perspective, she hasn’t gotten one penny. And even worse than that from her perspective, she’s stuck with the tax bill of having to report it on her 1040 Schedule K as a partnership distribution.  And while it may seem unfair to get taxed and not get benefit, presumably over time that money will actually come into her bank account and she won’t have to report the distributions.\"\n\nIn short, something's not right here. Either Bachmann reported something that didn't need to be disclosed or she got money from the farm at the same time it was benefiting from crop subsidies. Perhaps, as Friedly said, Bachmann won't see her first penny until she draws down the assets of the limited partnership.", "If that's the case, and it's a matter of delayed earnings, we still think it would be misleading for Bachmman to claim she hasn't made any money from the farm. Unless or until Bachmann steps forward to explain the discrepancy between her financial disclosure statements and her public pronouncements, we have to rely on the disclosures, which say she received at least $32,501 in income. So we rate her claim as False.", "Fox News Insider, \"Michele Bachmann Sizes Up Her 2012 Competition,\" June 27, 2011\n\nLos Angeles Times, \"Bachmann's had her share of government aid,\" by Melanie Mason and Matea Gold, June 26, 2011\n\nWisconsin Department of Financial Institutions, Corporate records: Bachmann Farm Family Limited Partnership\n\nOpenSecrets.org, Michele Bachmann personal finance profiles 2005-2009\n\nEnvironmental Working Group, Farm subsidy database: Paul Bachmann\n\nThe Minnesota Independent, \"Bachmann on media stalkers and government help,\" by Paul Schmelzer, Oct. 9, 2009\n\nMinneapolis Star-Tribine, \"Bachmann attacks $1.2B payout for black farmers,\" by Kevin Diaz, Dec. 1. 2010\n\nMinnPost.com. A guest Post: \"Rep. Michele Bachmann, opponent of farm subsidies, benefits from them,\" by Karl Bremer, Nov. 8, 2007\n\nGannett News Service, \"Coleman, Klobuchar vote to override farm bill veto,\" by Pamela Brogan, May 23, 2008\n\nE-mail interview with Jock Friedly of Legistorm, June 30, 2011\n\nE-mail interview with Brett Kappel, a lawyer with the firm Arent Fox LLP, June 30, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]