["About this rating", "A photograph captures hundreds of people who died after an oil tanker exploded in the Democratic Republic of the Congo in 2010.", "The photograph does not depict Christians who were burned alive by Muslims in Nigeria.", "A horrifying photograph showing dozens of charred corpses has been frequently passed around online over the last several years along with the false claim that the image depicts Christians who were \"burned alive\" by Muslims in Nigeria:", "Although the photograph has been included in dozens of articles about a purported act of genocide, it was actually taken after an oil tanker exploded in the Democratic Republic of Congo on 2 July 2010, killing at least 230 people and injuring nearly 200 more:", "At least 230 people were killed when a fuel tanker overturned and exploded in eastern Democratic Republic of Congo, unleashing a fire ball that tore through homes and cinemas packed with people watching World Cup soccer.", "Officials said the explosion late on Friday also injured 196 people, adding that the death toll could rise.", "They described scenes of devastation in the town of Sange, where houses were burned and bodies littered the streets. Some people died while trying to steal fuel leaking from the tanker, but most were killed at home or watching World Cup soccer in cinemas.", "Many of the bodies were charred beyond recognition.", "Confusion about the nature of the image began almost immediately after it was initially published. Articles about the Jos riots, a series of  violent incidents between Christian and Muslim groups in 2010 in Nigeria, frequently included this photograph and claimed that it captured a massacre of Christians killed by Muslims who burned them alive or wielded machetes against them. Other pictures of the scene clearly show, however, that the grisly scene recorded by this particular photograph was the result of an accident and not an act of violence:", "Video reports from the incident also show several additional images from the tragedy:", "While the photograph is real, it shows the scene of an industrial accident, not an act of intentional slaughter motivated by religion (or any other cause).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]