["About this rating", "A kind of symbolic war played out in Hollywood during the summer of 2018, when some critics and opponents of President Donald Trump turned their attentions to his star on Hollywood Boulevard's Walk of Fame.", "In July, comedian George Lopez simulated urinating on the square block of pavement dedicated to the former host of The Apprentice. Later that month a vandal almost completely destroyed the star using a pick-axe, and in August the West Hollywood City Council voted in favor of a motion calling for the permanent removal of the president's star, citing \"his disturbing treatment of women and other actions that do not meet the shared values of the City of West Hollywood, the region, state, and country.\"", "However, supporters of President Trump have also intervened to defend the slab of pavement. The symbolic war turned physical in July, when a violent brawl between the president's supporters and critics was followed by a separate incident involving scuffles a few days later.", "On 9 August, reports and photographs emerged suggesting that someone had supplemented President Trump's smashed-up star with several replicas, sticking them via adhesive to squares of pavement along the famous thoroughfare. One widely-shared meme showed a police officer inspecting the stickers with the caption \"Someone printed Trump Star stickers and is putting them all over Hollywood walk\":", "That meme was accurate. On the morning of 9 August 2018, dozens of adhesive Donald Trump \"stars\" were stuck to the pavement along the Walk of Fame.", "A group called \"The Faction,\" led by an anonymous self-described \"rogue right-wing street artist\" claimed responsibility for the stunt, a claim made credible by a video posted to their Instagram account which showed the group applying the adhesive replicas to the pavement.", "Their caption for the video warned that: \"Destroy Trumps [sic] Star, and we will install 30 more. We will shower you Useful Idiots in glorious memes to manifest your Trump Derangement Syndrome demons. Glorious. Keep it up.\"", "Destroy Trumps Star, and we will install 30 more. We will shower you Useful Idiots in glorious memes to manifest your Trump Derangement Syndrome demons. Glorious. Keep it up. #maga #streetartistry #pepe #kek #streetart #trump #trumpmemes #winning", "A post shared by  The Faction (@thefaction1776) on Aug 9, 2018 at 2:15pm PDT", "The Hollywood Reporter posted several photographs corroborating the authenticity of the adhesive stars but also reported that they were quickly removed:", "One Ripley's Believe It or Not! employee said the stars began to be peeled off because \"we didn't want to have what happened to the old star here. Not only would the star be destroyed, but it would damage our property.\"", "A member of the cleaning service that deals with daily graffiti and vandalism on the Walk of Fame said, \"We started at 5 o'clock in the morning and we've found about 50 stars.\"", "Associated Press.   \"Trump's Hollywood Walk of Fame Star Vandalized.\"\r\n    25 July 2018.", "Schmidt, Samantha.   \"Trump's Walk of Fame Star: The West Hollywood City Council Wants It Permanently Removed.\"\r\n    The Washington Post.   7 August 2018.", "Selk, Avi.   \"A Bloody Brawl Erupted Over Trump's Hollywood Star Hours After It Was Destroyed With a Pickax.\"\r\n    The Washington Post.   29 July 2018.", "TMZ.   \"Trump Walk of Fame Star -- New Street Brawl Breaks Out.\"\r\n    30 July 2018.", "Bond, Paul and Bryan White.   \"After Being Destroyed, Trump's Walk of Fame Star Multiplies.\"\r\n    The Hollywood Reporter.   9 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]