["“Wayanad People Celebrating Rahul Gandhi’s Victory with Pakistani Flags”, posted a user named Laishram Somorendro, with a video where people can be seen waving green flags and heard shouting ‘Rahul Gandhi Zindabad’. The user claimed that Pakistani flags were waved at Rahul Gandhi’s victory procession in Wayanad.", "Many other individual users on Facebook and Twitter have posted the video with an implicit message, “Wayanad after election result. Every hindu must watch.”", "Wayanad after election result. Every hindu must watch. pic.twitter.com/T2tZcEsTYK", "— Abhishek Gupta (@f4e9324f85684fc) May 26, 2019", "“No this is not in Pakistan this is Celebrations in wayanad after @RahulGandhi winning the seat. Congress has to DIE!”, posted BJP IT cell member Vikas Pandey along with the video.", "No this is not in Pakistan this is Celebrations in wayanad after @RahulGandhi winning the seat. Congress has to DIE! pic.twitter.com/9SSxIfRSnK", "— Vikas Pandey (@MODIfiedVikas) May 25, 2019", "Alt News had earlier debunked a video where it was claimed by netizens that Pakistani flags were waved at Rahul Gandhi’s pre-nomination rally in Wayanad, Kerala. In the video, the green flags waved by the crowd are Indian Union Muslim League (IUML) flags and NOT Pakistani flags. IUML is one of the six parties in the United Democratic Front (UDF) alliance, which includes the Congress party. The distinction between the Pakistani’s national flag and IUML flag can be seen in the comparison posted below.", "As far as the video in question is concerned, Alt News reverse searched the key-frames extracted from the video via Invid, a digital image and video verification tool, and found that it is NOT from Wayanad but Malappuram, Kerala. This video was uploaded on April 23, 2019, which clearly suggests that it is not representative of Rahul Gandhi’s victory procession in Wayanad.", "Moreover, in the video, the people can be heard chanting, “Let this time, CPI(M) sit at home, smoke a beedi and read desabhimani (the party paper), let Satheesh Chandran(LDF candidate) sit at home…let Unnithan(UDF candidate) win and go to parliament..let Modi rule be destroyed..let fascism be destroyed. (translation)”. Reading the translation, it is evident that the crowd was chanting slogans in support of the United Democratic Front candidate Rajmohan Unnithan in a campaign rally and not in a celebratory procession. Rajmohan Unnithan, a Congress candidate under the UDF alliance, had won the elections from Kasargod Lok Sabha constituency. It was earlier fact-checked by The Quint.", "An old video of a IUML campaign rally was shared on social media with the false claim that Pakistani flags were waved by supporters of Rahul Gandhi after his electoral victory in Wayanad, Kerala. As it turned out, these were IUML flags and not Pakistani flags.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]