["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "There have been many wide-ranging allegations surrounding voter fraud in the United States’ 2020 presidential elections, particularly from Republicans, who allege that voter fraud by Democrats was \"widespread,\" despite a dearth of concrete evidence.", "In December 2020, one known case of a dead voter was discovered in a Pennsylvania county by officials, but the posthumous vote wasn't for Democratic U.S. President-elect Joe Biden. A man in Delaware County was found to have carried out election fraud by registering and voting as his dead mother for incumbent President Donald Trump, a Republican.", "Bruce Bartman was charged with unlawful voting and perjury, in what was the only documented case of an actual ballot cast in the name of a verified dead person in that county during the 2020 election. It was the third reported case of election fraud in the state of Pennsylvania. According to a statement from the district attorney for the county, Jack Stollsteimer:", "Voter records show that on August 20, 2020 Mr. Bartman used the Commonwealth of Pennsylvania’s online Voter Registration portal to register both his deceased mother, Elizabeth Bartman and his deceased mother-in-law, Elizabeth Weihman, who died in 2019. Mr. Bartman is a registered Repubican and he illegally registered both deceased individuals as Republican voters.", "Ultimately, Bartman submitted an online request for just one absentee ballot for his deceased mother, which he fraudulently filled out in her name and cast for Trump, and the vote was counted for the November election. He admitted to registering the names of his deceased relatives and filling out his deceased mother's absentee ballot. Bartman was arraigned in mid-December, and released on $100,000 unsecured bail. If convicted on all charges, the 70-year-old man could face up to 19 years in prison.", "Voter fraud occurs but is extremely rare in the United States. Snopes has covered alleged voter fraud stories before. Stollsteimer added, “For all the conspiracy theorists out there, this case today does not represent widespread voter fraud. This case was evidence that one person committed voter fraud by casting an improper and illegal ballot.”", "Trump’s campaign flagged Elizabeth Bartman’s name as an alleged case of voter fraud in an email blast to their supporters back in November.", "Given the statements from prosecutors confirming this case, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]