["About this rating", "Thanks to 150 years of fictionalization in dime novels, Hollywood films, and television shows, that hallowed time and place in American history known as the Old West is as much a figment of the national imagination as it was a historical reality. So deep a wellspring of myth and legend is it, in fact, that people are still making up stories about the Old West today on that most modern of misinformation sources, the Internet.", "Consider the origin of the expression \"a shot of whiskey.\" In 2016, a social media meme shared via Facebook popularized a long-established folk etymology holding that the phrase originated in frontier saloons with cowboys trading bullets for drinks:", "Although the meme is of recent origin, Internet mentions of this alleged historical fact date to at least 2003. Significantly, however, we were unable to trace it back any further than that, nor could we find any credible support for the general claim that it was common to use ammunition as a substitute for hard currency in frontier drinking establishments.", "Was the price of a single .45 six-gun cartridge equivalent to that of a shot of whiskey in the Old West, as claimed? It doesn't appear so. The 1891 edition of Chicago hardware dealer Hibbard, Spencer, Bartlett & Co.'s General Catalog lists Smith & Wesson .45 cartridges at a price of $25 per thousand, or 2-1/2 cents per cartridge. For the price of a shot of whiskey, we consulted Kelly J. Dixon's 2005 book Boomtown Saloons: Archaeology and History in Virginia City, which notes that the average cost of a measure of any drink was around two bits, or 25 cents (although the cost later dropped as competition increased when more Americans moved west). Using those figures as our base prices, one shot of whiskey would have cost the equivalent of 10 cartridges. Even allowing for price variations according to time and place, it appears highly doubtful a one-to-one correspondence between the price of a cartridge and the cost of a drink ever existed in the Old West.", "We also looked into the etymology of the noun shot, which has a long and interesting history as well as many shades of meaning. It derives from the Old English verb scēotan (later scot), meaning \"to shoot,\" or \"let loose a projectile.\"", "The earliest known usage of \"shot\" in the sense of \"a measure of liquor\" appeared in the autobiography of the Rev. Oliver Heywood (1630-1702), in which we find the phrase \"their vain way of drinking shots.\" Unfortunately for the trading-cartridges-for-shots theory, the usage predates the time period of the Old West (which, by convention, was roughly 1850 to 1900) by some 150 years.", "Interestingly enough, the term \"shot\" was also at one time synonymous with \"a charge to be paid\" (and, in a more specific usage, \"a bill or one's share of it, especially in a pub or bar\"), according to the Oxford English Dictionary. Again, however, those meanings predate the Old West era, in this case going all the way back to 15th-century England, hundreds of years before saloons and cowpokes dotted the western frontier of the United States.", "Despite their sharing the same derivation, it's unclear precisely how these three disparate senses of the word came to be associated with one another. A theory advanced on the Etymology Online web site suggests that the expression \"throw down\" (as in \"throw down one's money\") may link them:", "Meaning \"discharge of a bow, missile,\" also is from related Old English gesceot. Extended to other projectiles in Middle English, and to sports (hockey, basketball, etc.) 1868. Another original meaning, \"payment\" (perhaps literally \"money thrown down\") is preserved in scot-free. \"Throwing down\" might also have led to the meaning \"a drink,\" first attested 1670s, the more precise meaning \"small drink of straight liquor\" by 1928 (shot glass by 1955).", "Finally, when we used Google's Ngram Viewer to chart how frequently the exact phrase \"shot of whiskey\" appeared in published sources from the year 1800 on, we found that it didn't actually become common until the mid-20th century, by which time all that was left of the Old West were fading memories, rusting artifacts, and folklore.", "Martin, Katherine Connor.   \"What Is the Origin of the Term 'Scot-Free.'\"\r\n    Oxford Dictionaries.   15 April 2015.", "Simmons, Brian M.   \"Dime Novels: The Rise of the American Hero.\"\r\n    Baylor University.   13 August 2013.", "Smith, Gavin D.   A-Z of Whisky.\r\n    Castle Douglas, Scotland: Neil Wilson Publishing, 2011.   ISBN 9781906476199   p. 250.", "Etymology Online.   \"Shot.\"\r\n    Accessed 13 October 2017.", "World Wide Words.   \"Shot.\"\r\n  Accessed 13 October 2017.", "Kim LaCapria is a former writer for Snopes.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]