["A video clip circulated on social media is being shared with the claim that it represents a massive crowd of people that gathered in support of prime minister Narendra Modi on his way to filing nomination papers for the Lok Sabha elections. “इसे कहते है फार्म भरने जाना,,आंखें फाड़ के देख लो चमचों शेर की चाल (This is called filing nomination. Open your eyes wide, bootlickers, and see the walk of a lion),” is the caption used to circulate the clip. From the individual account of one Srishtiraj Chauhan, the video received over 68,000 views.", "इसे कहते है फार्म भरने जाना,,आंखें फाड़ के देख लो चमचों शेर की चाल", "Posted by Srishtiraj Chauhan on Tuesday, 9 April 2019", "Other individual users have also shared the identical clip with a similar narrative.", "The viral video shows PM Modi and BJP chief Amit Shah surrounded by security personnel and walking behind a vehicle decorated with flowers. If one looks closely, hoardings with the photograph of former prime minister Atal Bihari Vajpayee are visible on the side of the procession.", "Alt News searched for videos on YouTube with the keywords – ‘Atal Bihari Vajpayee procession’ – and the first result that turned up was a video similar to the one currently viral on social media.", "The video represents the funeral procession of former PM Vajpayee, which was broadcast by multiple media outlets. Boomlive had earlier fact-checked the viral clip.", "Moreover, prime minister Narendra Modi is yet to file his nomination papers. The PM will likely file his nomination from Varanasi on April 26.", "The 17th Lok Sabha elections have witnessed numerous cases of misinformation circulated with regard to the polls. Another old, unrelated video was viral last week to portray Burqa-clad women giving fake votes in the general elections.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]