["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Few things anger New Jerseyans more than higher costs – and that just may be the point of a recent radio ad critical of Gov. Chris Christie’s time in office.", "One New Jersey, a Democratic grass-roots group, released the ad May 3. It uses the sound effects of a deck of cards being shuffled and cut to emphasize a theme that Christie’s gubernatorial tenure thus far has stacked the deck against taxpayers. Christie is up for re-election in November. His lone challenger is state Sen. Barbara Buono (D-Middlesex).", "The ad goes after Christie in a number of areas but we’re looking at issues that are near and dear to many New Jerseyans: toll costs, public transportation, education and the wealthy paying their fair share in taxes.", "\"Under Republican Governor Chris Christie, tolls cost more. Train and bus rides cost more. College tuition goes up. But Christie protected a tax cut for millionaires,\" a portion of the 60-second ad states.", "Most of the claims are accurate but some details are lacking.", "Let’s start by reviewing toll hikes.", "One New Jersey is correct that tolls are higher under Christie, but doesn’t mention that the state has had two major toll increases in recent years – the larger of which was courtesy of Democrat Jon Corzine, not Christie.", "In August 2011, Christie and New York Gov. Andrew Cuomo agreed to raise trans-Hudson tolls by $1.50 starting in September 2011, followed by additional hikes of 75 cents annually through 2015 to fund a $33 billion capital plan for the Port Authority of New York and New Jersey. Those increases affected the Lincoln and Holland tunnels, the Outerbridge Crossing and the Goethals, Bayonne and George Washington bridges.", "The Corzine-approved hike that took effect Jan. 1, 2012 increased tolls 53 percent on the New Jersey Turnpike and 50 percent on the Garden State Parkway. Those hikes were the second part of a two-phase toll increase adopted by the Turnpike Authority in October 2008, when Corzine was governor.", "And costs also have increased for train and bus rides since Christie became governor in January 2010.", "Three months after Christie took office, NJ Transit approved its largest fare hike in history to help close a $300 million budget gap for the fiscal year beginning that July 1.", "The hikes, the first since 2007, amounted to 25 percent for train and some bus riders and 10 percent for local bus riders and light rail commuters.", "In February 2010 Christie called NJ Transit a \"political patronage pit\" that needed to cut costs and said fare hikes would be unavoidable since drivers of the state’s roads had just experienced another toll hike.", "Next, let’s look at college tuition.", "Christie cut funding for county colleges by 10 percent in 2010, a year that also saw record enrollment increases at the state’s two-year schools. Tuition increased an average of 4.4 percent. Also, 24 of New Jersey’s four-year colleges and universities raised tuition and fees in 2010 faster than the inflation rate, according to a Star-Ledger survey that year. Still, tuition generally increases annually at most schools.", "Finally, did Christie protect a tax cut for millionaires?", "Democrats approved a bill in May 2010 renewing a one-year tax rate increase of 10.75 percent for those with taxable income above $1 million. The rate had expired before Christie became governor. Christie, who campaigned that he wouldn’t raise taxes, vetoed the surcharge -- protecting the rich, some claim -- and Democrats couldn’t override it.", "\"Plain and simple, Christie picks and chooses when and how to use his power – and on whose behalf,\" One New Jersey spokesman Joshua Henne said in an e-mail. \"He used his power to roll back a tax hike on millionaires, but chose not to use his power to roll back toll, tuition and fare increases that disproportionately hurt New Jersey’s middle-class and working families.\"", "Christie for Governor spokesman Kevin Roberts declined comment.", "Our ruling", "Part of an ad about Christie claims, \"Under Republican Governor Chris Christie, tolls cost more. Train and bus rides cost more. College tuition goes up. But Christie protected a tax cut for millionaires.\"", "The ad is correct that tolls, train and bus fares, and college tuition increased on Christie’s watch but disregards that some of those increases resulted because the governor slashed funding in an effort to close budget gaps. As for protecting a tax cut for millionaires, we’ve heard this one before and we’ll point out again that Christie technically didn’t cut the millionaire’s tax since it expired before he took office. Still, opinions vary wildly on that claim. We rate this portion of the ad Mostly True.", "To comment on this story, go to NJ.com.", "One New Jersey website, One NJ Releases 1st Radio Commercial – The Deck Is Stacked Against New Jerseyans, May 3, 2013, accessed May 4 and 13, 2013", "E-mail interview with Joshua Henne, spokesman, One New Jersey, May 9, 2013", "NJ.com, This toll hike could be just the beginning, Jan. 1, 2012, accessed May 13, 2013", "NJ.com, Parkway, Turnpike commuters brace for 50 percent increases, Dec. 27, 2011, accessed May 13, 2013", "NJ.com, Gov. Christie, N.Y. Gov. Cuomo say OK to scaled-back toll hikes, Aug. 19, 2011, accessed May 13, 2013", "NJ.com, New Year gift from the N.J. Turnpike Authority: Higher tolls, Jan. 1, 2012, accessed May 13, 2013", "NJ.com, Port Authority toll hikes were unavoidable, chairman says, Aug. 19, 2011, accessed May 13, 2013", "NJ.com, NJ Transit’s record 25 percent fare hike troubles those who rely on buses, trains, March 5, 2010, accessed May 13, 2013", "NJ.com, NJ Transit approves largest fare hike in agency history, April 14, 2010, accessed May 13, 2013", "NJ.com, NJ Transit fare hearing draws angry response from commuters, March 25, 2010, accessed May", "13, 2013", "NJ.com, NJ Transit trims proposed local bus fare hikes to 10 percent, April 12, 2010, accessed May 13, 2013", "NJ.com, NJ Transit director says fare hikes would come with job cuts to reduce costs, Feb. 18, 2010, accessed May 14, 2013", "NJ.com, N.J. colleges expect tuition increases after Christie’s budget cuts $173M, March 23, 2010, accessed May 13, 2013", "NJ.com, College tuition keeps rising in N.J., outpacing rate of inflation, Oct. 14, 2012, accessed May 13, 2013", "NJ.com, Tight budgets, increased enrollment cause tuition hikes at N.J. county colleges, Aug. 8, 2010, accessed May 13, 2013", "NJ.com, N.J. college students’ tuition bills continue to rise despite increased financial aid, Oct. 28, 2010, accessed May 13, 2013", "PolitiFact New Jersey, New anti-Chris Christie ad by Democratic group mostly on target, April 14, 2013, accessed May 13 and 14, 2013", "E-mail interview with Kevin Roberts, spokesman, Christie for Governor, May 14 and 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]