["About this rating", "On 14 November 2015, a series of English language and Russian language social media accounts appeared online with the sole purpose of promoting a new petition on the web site Change.org. That petition called for the construction of a monument to recognize the destruction of Native American communities during the colonization and expansion of the United States. It suggested the monument be placed outside the U.S. Embassy in Moscow (translated from Russian):", "#ПамятникИндейцам [A monument to the Indians]", "The Russian people have always been responsive to the troubles of others. Our history has many examples of times when our people were forced to stand up for their homeland. Despite its position as the \"world's police\", the United States does not recognize the destruction of more than 15 million indigenous people in North America.", "We, the undersigned, in the name of the bright memory of the Indians who died bravely in an unequal war with treacherous invaders, ask the President of the Russian Federation V.V. Putin, the Public Chamber of the Russian Federation, the City Administration and the Mayor of Moscow Sobyanin SS permission to install a memorial to the genocide of the Indians near the U.S. Embassy in Moscow.", "The petition was created by Vladimir Larin, a Russian videoblogger who founded \"patsan.tv,\" which frequently posts videos with a pro-Russian view on the conflict in the Ukraine and advocates for a Russia with pre-1991 Soviet-era borders.", "The petition gathered only 7,962 signatures, but it did receive the endorsement from one member of the Public Chamber of the Russian Federation, a civic body tasked with roles similar to oversight committees in the United States government. In a story reported by RT — an English-language media outlet run by the Kremlin formerly known as Russia Today — Public Chamber member Valery Korovin praised the effort:", "Public Chamber member Valery Korovin said in comments to RIA Novosti that the petition was timely and official support for it was very likely. “The initiative to install this monument is very urgent today because it would remind everyone how the history of the United States started. It must become a silent reproach to the modern-day American elites who have seriously diverged from the ideals that were made a foundation of American statehood,” Korovin told reporters.", "Thanks to the English-language coverage of the story by RT, which was published on 12 January 2016, the story made its way into the United States media market. On 22 January 2016, the Observer ran a story highlighting the petition and the statements made by Korovin with the headline \"Russia to Construct American Indian Genocide Memorial in Front,\" despite the fact that no plans had been finalized:", "Another piece of #russian #propaganda: Statue of american indians in front of #us embassy in #moscow?! https://t.co/smWGSt6lfI @20committee", "— Botond Feledy (@botidoki) February 1, 2016", "Following the coverage by the Observer, the story found its way into a number of Native American specific media venues. A 4 February 2016 article based on the Observer story titled \"Indians Killed in American Genocide Memorialized in Moscow?\" ran in the publication Indian Country Today, followed by a 2 March 2016 story in Native Sun News Today titled \"Russia to honor the American Indians,\" also largely based on the Observer story.", "The brutal treatment of Native Americans throughout United States history is a dark chapter that deserves to be memorialized, but it is important to put this specific effort into its proper political context. Valery Korovin, the Russian politician quoted by RT and subsequent U.S outlets — like videoblogger and petition-creator Vladimir Larin — is an outspoken supporter of political movements that seek greater Russian control over Ukraine, including the \"New Russia Party,\" which aids pro-Russia Ukrainian separatists and which was sanctioned by the United States in 2014.", "Russia's National Liberation Movement, which frames geopolitical problems in Russia as a result of the collapse of the Soviet Union at the hands of American imperialism, promoted the petition on their YouTube channel; they frequently frame Russia’s current political situation as negatively affected by American \"colonization\" — language that frames a Russian nationalism as similar to Native Americans' fight against European colonists. RT, which brought the story to the American media market, has been accused by the United States Intelligence Community as directing a campaign to \"undermine faith in the U.S. Government and fuel political protest.\"", "Finally, the concept of a memorial meant to antagonize the embassy of another country is a concept with which Russia is very familiar. In 1984, the United States Congress renamed the block in front of the Soviet Embassy in Washington, D.C. as \"Andrei Sakharov Plaza,\" after a famous Soviet dissident. The petition and its promotion within Russia suggest its creators were animated more by the notion of trolling the United States by reminding Americans of a dark chapter of its history than by the plight of its treatment of indigenous peoples.", "There is no evidence, however, that the monument ever was constructed or even approved for construction, and there has been no real internet discussion of the monument since 2016. The idea started and ended with a Change.org petition, and therefore we rank the claim that this monument exists as false.", "RT.   \"Activists Call for American Indian Genocide Monument Near Moscow US Embassy.\"\r\n    12 January 2016.", "Klikushin, Mikhail.   “Russia to Construct American Indian Genocide Memorial in Front of U.S. Embassy.”\r\n    Observer.   22 January 2016.", "Pember, Mary Annette.   “Indians Killed in American Genocide Memorialized in Moscow?”\r\n    Indian Country News.   4 February 2016.", "Paul, Daniel N.   “Russia to Honor the American Indians”\r\n    Native Sun News Today.   2 March 2016.", "Gessen, Masha.   The Future Is History: How Totalitarianism Reclaimed Russia.\r\n    Penguin, 2017.   0698406206", "U.S. State Department.   \" Treasury Targets Additional Ukrainian Separatists and Russian Individuals and Entities.\"\r\n    19 December 2014.", "Office of the Director of National Intelligence.   \"Assessing Russian Activities and Intentions in Recent US Elections.\"\r\n    6 January 2017.", "Washington Post.   \"Rename the Block in Front of the Russian Embassy.\"\r\n    30 November 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]