["By D'Angelo Gore", "Posted on June 10, 2016", "Hillary Clinton said that Donald Trump cited hosting the Miss Universe pageant in Russia when “asked about his foreign-policy experience.” That’s not how the exchange went.", "Fox News’ Bret Baier didn’t ask Trump for an example of his foreign-policy experience. He tried to get Trump, the presumptive GOP nominee for president, to say whether he had talked to Russian President Vladimir Putin. Trump wouldn’t answer Baier’s question, but he did say “I know Russia well” because “I had a major event in Russia two or three years ago,” referring to the 2013 Miss Universe pageant.", "Clinton, the presumptive Democratic nominee, made the claim about Trump’s foreign-policy experience during a June 6 campaign event in California (at 19:28 in the video).", "Clinton, June 6: He was asked about his foreign-policy experience. He said, “Well, he had taken the Miss Universe contest to Moscow.”", "She made a similar claim during a June 2 foreign-policy address where she attacked Trump on some of his foreign-policy positions.", "Clinton, June 2: He says he has foreign-policy experience because he ran the Miss Universe pageant in Russia.", "In an email, the Clinton campaign pointed to a May 6 USA Today article with the headline, “Trump Attributes Russia Knowledge To Hosting Miss Universe Pageant There.”", "It would be accurate for Clinton to say, as USA Today did, that Trump said he has knowledge of Russia because he hosted a pageant there. Trump, who sold the Miss Universe Organization to the WME-IMG talent agency in 2015, held the 2013 Miss Universe contest in Moscow.", "However, Trump didn’t go so far as to say that that was an example of his foreign-policy experience, and Baier never asked him that question.", "Here is that part of the interview:", "Baier, May 5: About Russia, you were asked yesterday if you’ve ever spoken to Vladimir Putin. And you said, ‘I don’t want to say.’", "Trump: Yes, I have no comment on that. No comment. I was in Russia —", "Baier: But one of the things people like about you is to answer any question.", "Trump: Yes. But I don’t — let’s assume I did. Perhaps it was personal. You know I don’t want to — I don’t want to hurt his confidence. But I know Russia well. I had a major event in Russia two or three years ago. Miss Universe contest which was a big, big incredible event, an incredible success.", "Baier: OK. So we can say you talked to him.", "Trump: No. I got to meet a lot of people. And you know what? They want to be friendly with the United States. Wouldn’t it be nice if we actually got along with somebody?", "At a Republican debate in November, Trump previously said that he knew Putin “very well” because they were “stablemates” on CBS’ “60 Minutes.” But as we wrote, Trump and Putin did not appear on the show together because they were interviewed separately — Trump in the U.S. and Putin in Russia.", "This time, it’s Clinton who is being misleading. She claims that Trump gave an answer to a question that he was never asked.", "https://www.sharethefacts.co/share/63a70a4c-13a0-4554-b6d1-3857b6c744e4", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]