["A case regarding a Democratic activist has recently resurfaced on social media in an attempt to provide evidence of voter fraud in the 2020 presidential election.", "Several posts on Facebook claim an Indiana woman was recently arrested for allegedly delivering 400 mail-in ballots with Democratic candidates already filled out.", "“Interesting to note that u will not see her on any MSM FakeNews report so let’s do our thing and make her famous,\" reads a Dec. 5 Facebook post with over 2,300 shares, accompanied by an mugshot of Janet Reed, the alleged offender.", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "Other users posted similar meme versions of the claim, some sharing screen shots of the posts from Parler.", "USA TODAY reached out to the Facebook users for comment.", "Reed, 68, is a Vanderburgh County Democratic Party activist and was accused in May of sending voters pre-selected absentee ballot applications, giving voters no choice but to participate in the primary election, the Courier and Press reported.", "She is charged with one count of unauthorized absentee ballot, a felony that could result in a probationary sentence.", "Reed was arrested on suspicion of allegedly changing more than 400 absentee ballot applications for Indiana’s June 2020 primary election in which she allegedly pre-selected Democrats in the section of application that allows voters to choose a party, the Courier and Press reported.", "\"The applications Reed mailed to hundreds of registered voters in Vanderburgh County have preselected the Democratic Party as the major political party of the Absentee Ballot that was sent to the voter upon completion and return of the Application to the Vanderburgh County Election Office,\" Vanderburgh County Election Board Attorney Douglas Briody wrote in an affidavit.", "Indiana law states that a person may not provide an application for absentee ballot to an individual with \"the major political party ballot\" already printed or set forth.", "According to the probable cause affidavit, election officials had told Reed that her action violated Indiana state law and requested that she stop immediately, but postmarks on several envelopes indicated she continued to mail out the applications.", "While voters are able to pick candidates regardless of party affiliation during general elections in Indiana, voters are required to choose between voting in a Republican or Democratic primary election, according to voter information from indy.gov.", "Fact check:School bus in Arizona was full of office equipment, not voting machines", "Reed used a yellow highlighter to preselect 300 applications that signed voters up for the Indiana Democratic primary without their consent, according to the affidavit.", "Local news outlet 14 News also reported that Reed sent 300 modified absentee applications.", "Fact check:A 37-vote change in Georgia was the result of human error, not vote-flipping", "Court filings state that the tainted applications were eventually returned to the Vanderburgh County Election Department and election officials said they were aware of Reed's alleged actions and sent those voters new applications. She also reportedly refused to cooperate once arrested, according to the affidavit.", "Local Democratic Chair Edie Hardcastle said Reed was not working for the Vanderburgh County Democratic Party when she sent the absentee applications, according to the Courier and Press. He said Reed was able to access the county's voter list through her work on E. Thomasina Marsili's campaign.", "The election board referred the case to prosecutor Nick Hermann in May in a four-page letter outlining the allegations against Reed.", "USA TODAY reached out to Hermann and Reed for comment.", "The Vanderburgh County Prosecutor's Office filed a restitution claim in August for $2,740.75 in Circuit Court, the Courier and Press reported.", "Fact check:Trump lost the 2020 presidential election", "The claim that Reed was recently arrested for allegedly delivering 400 mail-in ballots with Democratic candidates already filled out is FALSE, based on our research. The posts do not mention that this was regarding the June 2020 primary, and not the presidential election. Further, Reed was arrested for modifying 300 absentee ballot applications, not 400 ballots, that signed voters up for the Democratic primary without their consent. Election officials were aware of the matter and were able to send voters new applications. No candidates were pre-marked, as the posts claim.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]