["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Public health officials tracked the current measles outbreak to Disneyland in California, but Rush Limbaugh blames immigrant children. (Tom Bricker)", "Conservative radio host Rush Limbaugh says the focus on vaccinations in the wake of the measles outbreak is a \"leftist Democratic trick\" to divert attention from the president’s \"DOA\" budget plan.", "And to the extent that the measles outbreak is real, Limbaugh said Feb. 3, 2015, it was all the fault of the White House anyway.", "\"We have a vaccination problem for one reason: Barack Hussein Obama and his open borders immigration policy, which opened the southern borders to children sick, healthy, you name it, poor, ill-educated, just tens of thousands of kids flooded the southern border all of last year.", "\"They were never examined before they got here. They were never examined after they got here and quarantined if they had a disease. They were just sent out across the country. Many of them had measles.\"", "Other conservative voices have linked measles to illegal immigrants. The conservative website The Blaze wrote about Rep. Mo Brooks, R-Ala., who said the disease was brought into the country by \"illegal aliens.\"", "The common thread in these statements is the idea that these children were never examined, that they had measles, and Washington took no precautions before allowing them to stay.", "None of that holds up, however.", "In fiscal year 2014, over 68,000 unaccompanied minors presented themselves at the border. The crisis spurred a flurry of activity, largely by two government agencies, the departments of Homeland Security and Health and Human Services. Homeland Security set up new processing centers and HHS’s Office of Refugee Resettlement looked after the children until their fates were resolved.", "Contrary to Limbaugh’s assertion, the federal government did examine these kids. The protocol, according to the Office of Refugee Resettlement, was to provide \"vaccinations to all children who do not have documentation of previous valid doses of vaccine.\"", "Limbaugh also claimed that these children were never quarantined if they had a disease. The reverse is true.", "\"Children receive additional, more thorough medical screening and vaccinations at ORR shelter facilities,\" according to the refugee resettlement Web page. \"If children are found to have certain communicable diseases, they are separated from other children and treated as needed.\"", "Latin America outdoes the United States", "Further undermining Limbaugh’s case (we reached out to his show and did not hear back) are the vaccination rates for the key countries involved in the influx of unaccompanied minors -- El Salvador, Guatemala, Honduras and Mexico.", "The latest data from the World Health Organization runs through 2013. As this table shows, over the past four years, the vaccination rates among those countries are on par or exceed the rate in the United States.", "Country", "Measles, mumps, rubella vaccination rate: \n4-year average", "El Salvador", "92 percent", "Guatemala", "90 percent", "Honduras", "94 percent", "Mexico", "95 percent", "United States", "92 percent", "With vaccination rates this high, epidemiologists say there is no particular reason to point to children from these countries as the source of a measles outbreak.", "What we know about the outbreak", "As a final point, the information on the measles cases this year reported to health departments fails to suggest a link to immigrant children.", "The Centers for Disease Control and Prevention said that most of the 102 cases stem from exposures at Disneyland in California. California health officials report that 59 cases emerged directly or indirectly from the amusement park. The core group was made up of 40 people who worked at or visited the park. Neither the CDC nor the California Department of Health have traced the outbreak to one of the young people who entered the country last year.", "In fact, assistant surgeon general Anne Schuchat said in a news conference that \"we assume that someone got infected overseas, visited the parks and spread the disease to others.\"", "Past measles outbreaks have not been linked to Central America. Last year, Ohio saw 382 measles cases. According to state health officials, that began when unvaccinated travelers came back from the Philippines and spread the disease within the local Amish community. The CDC said nearly 80 percent of the cases that year were among people who chose not to be vaccinated due to their religious beliefs.", "Our ruling", "Limbaugh pinned the current measles outbreak on the Central American children who flooded the southern border in 2014. Limbaugh said they were never examined and that many had measles.", "Limbaugh provided no evidence that this is true. Probably, because no evidence exists. The children who came in from Central America were examined and vaccinated as part of a standard routine.", "There is no data that links this or any other outbreak of measles to those immigrants, who are vaccinated at about the same rate as Americans.", "This claim lacks any basis in fact.  We rate it Pants on Fire.", "The Rush Limbaugh Show, Vaccine Storyline Is New War on Women, Feb. 3, 2015", "Centers for Disease Control and Prevention, Measles Cases and Outbreaks, Feb. 2, 2015", "Centers for Disease Control and Prevention, Transcript for CDC Telebriefing: Measles in the United States, 2015, Jan. 29, 2015", "California Department of Public Health, California Department of Public Health Confirms 59 Cases of Measles, Jan. 21, 2015", "California Department of Public Health, Measles, Feb. 2, 2015", "Council on Foreign Relations, Vaccine-Preventable Outbreaks - Measles - 2015", "World Health Organization, Reported measles cases by country 2013-2014, Jan. 15, 2015", "The Blaze, GOP Congressman on Why He Thinks Illegal Immigrants Might be to Blame for Measles Outbreak, Feb. 4, 2015", "Centers for Disease Control and Prevention, Measles — United States, January 1–August 24, 2013, Sept. 13, 2013", "Ohio Department of Health, 2014 Measles Outbreak, Jan. 8, 2015", "World Bank, Immunizations - Measles", "World Health Organization, Measles - country data", "Health and Human Services -  Administration for Children and Families, Unaccompanied Children Frequently Asked Questions", "NBC news, Vectors or Victims? Docs Slam Rumors That Migrants Carry Disease, July 7, 2014", "Photo credit: Tom Bricker, via Flickr Creative Commons", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]