["About this rating", "On 29 May 2018, after a high-profile incident at a Pennsylvania Starbucks in which a white manager called the police on two black men for sitting at a table without ordering a cup of a coffee, the coffee chain closed down some 8,000 locations in order to conduct company-wide racial sensitivity training sessions.", "Not long after that, the following image appeared on social media, and quickly took off:", "Starbucks' focus on racial diversity has been a sticking point in some right-wing communities for years. When the company announced that it would be hiring refugees in January 2017, for example, a hoax #refugeeswelcome campaign was started which asked citizens to give the name \"Aloha Snackbar\" to their barista in order to receive a free coffee.", "A similarly fake advertisement falsely claimed that Starbucks was giving away free coffee to undocumented people for \"Dreamer Day.\" When Starbucks first announced that it would be holding a racial diversity training session, fake apology ads were created offering free coffee exclusively to black customers. It appears that this sign was created in the same vein.", "We have not been able to determine the exact origins of this image yet. It was posted both to the r/The_Donald section of Reddit (a subreddit for supporters of Donald Trump), and an \"IMDB2\" forum on 30 May 2018, along with the claim that it was found on the door of a Starbucks in Denver. The latter also included a message claiming that the original poster would boycott Starbucks over the sign:", "Now, had this said \"Diversity Training\", that'd be different. But no....they had to guarantee that I will never shop there again. (Though technically I haven't since they admitted they would violate hiring laws and give preference to Refugees in the hiring process, which is preference by National origin)", "Another photograph showing a hoax sign taped to a city mailbox was posted to 4chan the day before.", "This sign was not created by Starbucks, and it was not anything like the official sign placed on the windows of stores as they closed for racial diversity training. Images of the real sign can be found via Getty Images, plenty of news articles, and the official Starbucks Instagram account:", "The real sign reads:", "We'll see you tomorrow. At Starbucks we are proud to be a third place — a place between home and work where everyone is welcome. A place where everyone feels that they belong. Today our store team is reconnecting with out mission and with each other. We are sharing our ideas about how to make Starbucks even more welcoming. We look forward to seeing you when we reopen at _____________.", "Starbucks responded to a number of people on social media to try to clear up confusion about which signs were real and which were hoaxes:", "The sign stating that Starbucks was \"closed today to educate white people about their racism\" was not created by the Seattle coffee company. This is nothing more than yet another hoax in a long line of corrosive hoaxes.", "Weiner-Bronner, Danielle.   \"How Starbucks' Racial Bias Training Went Down.\"\r\n    CNN.   29 May 2018.", "Stewart, Emily.   \"What Starbucks is Teaching its Employees During Anti-Bias Training.\"\r\n    Vox.   29 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]