["Gov. John Kasich aimed to plug a projected $8 billion budget shortfall when he announced a two-year spending proposal including big cuts to education and local government. The budget cuts drew criticism from angry school officials, among others.\n\nThe cuts and the anger also concerned state Rep. Ron Amstutz. As chairman of the House Finance and Appropriations Committee, the Wooster Republican had the job of steering the budget through the House.\n\nHe called local governments \"our partners,\" and he said changes would be made in the controversial blueprint for funding schools. But the veteran lawmaker said that cutting the size of state government was not an alternative that would cover the budget gap.\n\n\"Most of the state budget isn't for state government doing things,\" he told a public forum at the Idea Center on Playhouse Square. Most of the budget, he said, goes to such recipients as school districts, local governments, school districts, hospitals, nursing homes and libraries.\n\n\"The state doesn't do much direct service,\" Amstutz said. \"Eighty-five percent of the state budget is transferred to local communities for delivery of service.\"\n\nThat's a hefty percentage. We asked Amstutz how it was figured.\n\nHis office provided a budget overview for fiscal 2010 that was prepared by the nonpartisan Ohio Legislative Service Commission.\n\nA breakdown of spending shows that 85.6 percent of the spending in the General Revenue Fund, the primary operating fund of the state, goes to the category of \"subsidies.\" The total for subsidies is about $20.7 billion of a total $24.1 billion.\n\nThe Legislative Service Commission then provided us with a breakdown of that spending. Two departments account for nearly $17 billion. The Department of Job and Family Services, which handles Medicaid and unemployment compensation, tops the list with about $9.2 billion. The Department of Education, for grades K-12, is budgeted at $7.6 billion.\n\nAmstutz told us he was referring to the General Revenue Fund because it’s money over which the General Assembly has control.\n\nIn the larger all funds budget, which is less discretionary and includes agencies funded completely by fees and federal money, subsidies account for 66 percent of spending, Amstutz said.\n\nA breakdown of the all-funds budget in the Legislative Service Commission report puts subsidies at 66.6 percent of the $55.87 billion in spending for Fiscal 2010. That's still two-thirds of the total, or most of it.\n\nSo how does Amstutz’ claim fare on the Truth-O-Meter?\n\nAmstutz said that most of the state budget isn't for state government doing things and that 85 percent of the money goes back to local communities for services.\n\nWhen we talked to Amstutz and he mentioned the 85 percent figure and specifically referred to the general revenue fund. The budget overview prepared by the Ohio Legislative Service Commission shows he’s right on the money with that figure.\n\nSo Amstutz’ statement is essentially accurate.\n\nAlso to be considered is the all-funds budget. The percentage of money that goes back to communities is smaller, about 67 percent, but it still matches the description of \"most\" that he used at the Ideastream forum. That’s a piece of additional information that provides full understanding.\n\nOn the Truth-O-Meter, Amstutz' statement rates as Mostly True.", "Gov. John Kasich, Communication Dept., \"Kasich unveils the Jobs Budget,\" March 15, 2011\n\nThe Plain Dealer, \"Schools, local governments take hit in Gov. John Kasich's budget proposal,\" March 15, 2011\n\nNPR, \"Gov. Kasich: Ohioans must get used to change,\" March 31, 2011\n\nThe Plain Dealer, \"Ohio GOP lawmakers plan changes to Gov. John Kasich's education budget,\" Monday, April 25, 2011,\n\nIdeastream, \"Cut, Tax or Change: The Kasich Budget Challenge,\" April 18, 2011\n\nEmail from office of Rep. Ron Amstutz, May 18 and 25, 2011\n\nOhio Office of Budget and Management, Budget Summary, H.B. 153, March 15, 2011\n\nOhio Legislative Service Commission, Budget Overview, Jan. 25, 2011\n\nOhio Legislative Service Commission, Budget Overview, breakdown of FY2010 State and Federal GRF Spending by Expense Catagory\n\nOhio Legislative Service Commission, Budget Overview, breakdown of slide 21 in FY2010 State and Federal GRF Spending by Expense Catagory\n\nOhio Legislative Service Commission, \"State Spending by County FY2010,\" December 2010\n\nInterview with Rep. Ron Amstutz, May 25, 2011\n\nEmail from Ohio Legislative Service Commission, May 26, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]