["About this rating", "The shape of the stage resembled a version of the \"Odal rune\" symbol that was used by a number of Nazi divisions during the early 20th century. The stage's design was created by a firm called Design Foundry and approved for CPAC use by the American Conservative Union. The firm said it was unaware that the design resembled any symbol, nor did it intend to create a design that did.", "Without seeing more documentation of the design process, we are unable to verify what the thought process was or wasn't behind the construction of the stage. We have requested such documentation from the design firm and the American Conservative Union.", "The Conservative Political Action Conference (CPAC) was underway in late February 2021 in Orlando, Florida, complete with a golden statue of former U.S. President Donald Trump. And it wasn't long before controversy unfolded.", "Eagle-eyed social media users claimed that the stage where Sen. Ted Cruz, Donald Trump Jr., and others made speeches looked eerily like a Nazi or white supremacist symbol.", "Some even shared images comparing the stage to old uniforms from Nazi Germany. The image below could have been pulled from a Daily Mail article that claims to show a Nazi SS trooper.", "We reviewed videos from CPAC and confirmed that the shape of the stage indeed reflects the images in the above tweets. The first three seconds of the following video show the full stage:", "But was it truly a Nazi symbol?", "The shape of the stage, a diamond with two prongs extending on one end, is indeed similar to an early European Othala rune also known as the \"Odal rune.\" According to the Anti-Defamation League this is a popular Neo-Nazi symbol, but as it is part of an ancient runic alphabet system, it has not solely been used as a hate symbol. It also appears in different forms, sometimes without the two prongs pointing upward.", "It has, however, been used as the insignia of a number of Nazi divisions during the early 20th century. The rune was used as the logo of the Nazi 7th SS Mountain Division that fought in Croatia and the Balkans in the 1940s. One book “7th SS Mountain Division Prinz Eugen at War 1941-1945: A History of the Division,” with photographs of Nazi soldiers collected by Ian Baxter, features the symbol prominently on its cover. Another historical account by Otto Kumm, a Nazi German commander of the SS during World War II, also features the symbol prominently on its cover. This edition, published in 1995, is available on Amazon.", "It was also described as a symbol popular with \"skinheads\" in a 2006 Edmonton Journal article: \"In addition to the swastika, skinheads favor two ancient Nordic runes: the Odal rune which looks like a diamond with tails.\"", "CPAC organizer, Matt Schlapp, responded to the theories surrounding the shape of the stage, calling them \"outrageous\" and \"slanderous\":", "On March 2, in a statement to Jewish media outlet Forward, the company hired to set up the stage at CPAC took full responsibility for the stage design. Design Foundry said they \"had no idea that the design resembled any symbol, nor was there any intention to create something that did.” They added that the American Conservative Union had approved the stage design, which was \"intended to provide the best use of space, given the constraints of the ballroom and social distancing requirements.\"", "The terms of the contract CPAC organizers signed with Design Foundry stated, \"The designs, renderings, drawings, specifications, materials and other documents used or created as part of the proposal are owned by Design Foundry.\"", "Ian Walters, communications director for CPAC, told the Forward that the design firm “provided several options for us to choose from and what we ended up with was the most workable of the options they submitted [...] ACU and CPAC have no interest in promoting antisemitism from our stage, whether it’s what happens on the stage or the design of the stage itself,” he added. “It’s clear that the company we retained designed a stage that has become an unwelcome distraction. As a result, we will not be using that company’s services going forward at future events.”", "We reached out to CPAC organizers, and Design Foundry for details regarding the process of designing and selecting this stage. We will update this post as more information becomes available", "The shape of the Nazi symbol is eerily similar to the shape of the stage at CPAC. However, without documentation detailing the process of designing this stage, we are presently unable to confirm whether this was a deliberate choice made by the event organizers. At the moment, we rate this claim as “Mixture.”", "Feb. 28, 2021: Update added with CPAC organizer's tweeted response.", "March 3, 2021: Updated added with stage design company and CPAC communications director's statement to Forward.", "March 3, 2021: Updated rating to \"Mixture\" and edited notes to \"what's true\" and \"what's undetermined\" sections. Updated rating overlay on image.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]