["About this rating", "In the waves of protests that swept across U.S. and European cities beginning in May 2020 after the policy-custody death of George Floyd in Minneapolis, numerous localities removed, or announced plans to remove, various statues and monuments memorializing persons connected with segregation or racism, such as those who were involved with the slave trade or were prominent figures in the Confederacy during the U.S. Civil War.", "In some cases, however, protesters did not wait for official action to take place and instead defaced, vandalized, and/or pulled down statues themselves.  One such instance of this activity that was widely publicized on social media had to do with the mistaken defacement of a statue of someone said to have been a prominent abolitionist:", "The pictured statue is one of Matthias Baldwin which stands outside Philadelphia City Hall.  During the \"early days of unrest in Philadelphia\" following the death of George Floyd, protesters doused the statue with red paint and spray-painted the words \"colonizer\" and \"murderer\" on its pedestal:", "A spokesperson for Philadelphia Mayor Jim Kenney’s office confirmed that “the statue of Matthias Baldwin, along with other statues in the area of Philadelphia’s City Hall, was tagged with paint and graffiti at some point during the first days of protests that took place in Philadelphia. There has been no subsequent vandalism of the Baldwin statue in recent days.\"", "But Baldwin, a 19th century figure most prominent for being the founder of one of Philadelphia's most successful businesses, the Matthias Baldwin Locomotive Works, was an incongruous target of such protests. As his entry in the 1899 National Cyclopaedia of American Biography noted, Baldwin's racial outlook was unusually enlightened for the time and place in which he lived:", "His heart and purse seemed always ready to respond to appeals from deserving sources. He opened a school for colored children in Philadelphia, and for years paid the salaries of its teachers. When, in 1835, an appeal was made for the support of Pompey Hunt, a negro evangelist, he himself guaranteed a generous sum to enable him to continue preaching the Gospel. Mr. Baldwin's interest in the cause of the negro race and his earnest advocacy of abolition were of life long duration, and during the stormy times before the civil war, were very often quoted to his disadvantage by business competitors. But his life was governed by the convictions of his conscience, and, come what might, he could not be moved.", "But the defacement of Baldwin's statue in Philadelphia may have had the silver lining of bringing his laudable historic efforts to public attention, as The Philadelphia Inquirer observed:", "Baldwin, who created one of the largest a locomotive manufacturing firms of his time, was an outspoken critic against slavery during the early 1800s, arguing for the right of African Americans to vote and founding a school in the city for black children. Baldwin’s statue was erected in 1906, and placed in its current spot outside City Hall in 1936.", "Jim Fennell, the president of the volunteer group Friends of Matthias Baldwin Park, said he was upset when he saw the images circulating online, particularly one photo that showed an unidentified protester appearing to whip the statue.", "“He was not the man to whip, because he was ahead of his time,” Fennell said.", "Despite the initial damage, Fennel said the incident has had the unintended effect of causing people to seek out knowledge about Baldwin and why the city erected a statue in his honor.", "“It seems like people are suddenly looking at him and finding out he was an abolitionist and did all sorts of things to support African Americans, including integrating his work force,” Fennell said.", "National Cyclopaedia of American Biography: Volume 9.   \"Matthias William Baldwin.\" \r\nNew York: James T. White & Co., 1899   (p. 476).", "Tornoe, Rob.   \"Photos of Defaced Statue of Philly Abolitionist Matthias Baldwin Go Viral.\"\r\n    The Philadelphia Inquirer.   12 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]