["A Facebook post published on November 15, 2020, and shared more than 2,000 times, shows a screenshot of a tweet that reads: “PADS ARE FREE NOW AT CLICKS”, referring to the large pharmacy and beauty retailer in South Africa.", "Similar claims were made on Facebook here, here, and here, with more than 2,900 shares in total.", "The same claim was also shared on Twitter here and here.", "However, the claim is false and appears to have been confused with a store promotion, as Clicks SA explained to individual users on Twitter: customers who purchase three packs of selected sanitary pads get the cheapest one for free.", "Hi, Buy any 3 selected pads and you get the cheapest one for free? You can view our promotion online here > https://t.co/xRCnFp34ag or in -stores. Our 3for2 promotion on sanitary pads ends on 18 November.", "The affordability of women's sanitary products is a concern around the world and especially in Africa where organisations are working to combat “period poverty” and promote gender equality.", "However, some strides have been made in South Africa in recent years:  VAT taxes were lifted on sanitary pads in the 2020 financial year when the government also allocated R157 million ($10.2 million) towards the provision of sanitary pads for children from low-income households.", "South Africa has further budgeted another R652 million in medium-term spending over the next three years to support its national Sanitary Dignity Programme.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]