["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Wisconsin pundit claims left-wing Bernie Sanders made a rape comment similar to one made by right-wing Rebecca Bradley.", "In this item, we see if what conservative Wisconsin Supreme Court Justice Rebecca Bradley wrote years ago about date rape is similar to something Democratic presidential candidate Bernie Sanders wrote years ago about rape fantasy.", "Yes, the 2016 campaign season has come to this.", "The claim we’re checking was made on March 11, 2016, at the end of a week in which Bradley was in the news for writings she did in college and for a case she handled as a private attorney.", "Bradley viewed the disclosures as aimed at boosting JoAnne Kloppenburg, a state appeals court judge and former Supreme Court candidate who is challenging Bradley in the April 5, 2016 Supreme Court election.", "The claim", "The claim we’re checking was made on \"Here and Now,\" a Wisconsin Public Television public affairs program. There were two Madison-based guests: Scot Ross, executive director of the liberal advocacy group One Wisconsin Now, which revealed Bradley’s college writings; and political consultant Bill McCoshen, a former Republican state official who said Bradley’s commentaries were written too long ago to be relevant.", "Ross said Bradley had written that \"women have a legitimate role in date rape. I mean, these are ugly things to say. They're out of touch ...\"", "McCoshen then interjected, saying:", "\"By the way, that last comment -- Bernie Sanders said something very similar when he was in college, and he just won the Michigan Democratic primary. So, let’s have the same standard for all candidates for public office.\"", "Sanders’ comments about rape also were viewed by some as demeaning to women.", "It’s fair to say up front: Both Bradley’s and Sanders’ comments are open to interpretation.", "What Bradley wrote", "The 1992 student magazine column in question by Bradley (her maiden name was Grassl), who was 21 at the time, was an opinion piece against feminism, which she said \"has adopted an agenda that no longer articulates the feelings of the average American woman; instead, it advocates the extremist platform of the issues advanced by the political left.\"", "The portion of the column highlighted by One Wisconsin Now referenced author Camille Paglia, a professor at University of the Arts in Philadelphia. Bradley wrote that Paglia had been \"prevented from speaking at several colleges\" after Paglia \"legitimately suggested that women play a role in date rape.\"", "(In a column of her own published the previous year, Paglia had written: \"A girl who lets herself get dead drunk at a fraternity party is a fool. A girl who goes upstairs alone with a brother at a fraternity party is an idiot. Feminists call this perspective ‘blaming the victim.’ I call it common sense.\")", "Of Bradley’s column, One Wisconsin Now said: \"It is abhorrent to blame the victim of a sexual assault, whatever the circumstances.\"", "So, in an anti-feminism column, Bradley stated that in her opinion, another writer \"legitimately\" suggested that women play a role in date rape.", "What Sanders wrote", "Sanders’ comments about rape were also in written in a newspaper column and also drew criticism -- although he made them at age 30, eight years after he graduated from the University of Chicago.", "The column generated news in the presidential campaign after it was referenced in a May 2015 profile about Sanders by the magazine Mother Jones.", "Sanders’ column was published in the Vermont Freeman alternative newspaper in 1972, the year he began running for public office. The column was about gender stereotypes and changing gender roles. But it started with what Sanders -- when the issue came up in the presidential campaign -- described as \"bad fiction\":", "\"A man goes home and masturbates his typical fantasy. A woman on her knees. A woman tied up. A woman abused. A woman enjoys intercourse with her man — as she fantasizes being raped by three men simultaneously …. Do you know why the newspapers with the articles like ‘Girl, 12, raped by 14 men’ sell so well? To what in us are they appealing?’’", "New York Post columnist Andrea Peyser, who McCoshen cited to back his claim, wrote in June 2015 that the column \"disgusted\" her, adding: \"Did Sanders confess that he finds real-life instances of sexual violence against children titillating?\"", "So, in a column about changing gender roles, Sanders made reference to a woman fantasizing about being gang raped.", "Our rating", "McCoshen says that when Sanders was in college, he said \"something very similar\" to what Bradley had written -- that \"women have a legitimate role in date rape.\"", "Bradley was in college when, in an anti-feminism column, she wrote that a professor had \"legitimately suggested that women play a role in date rape.\"", "Sanders was eight years out of college when he wrote in a column about gender roles: \"A woman enjoys intercourse with her man — as she fantasizes being raped by three men simultaneously.’’", "So, both Sanders and Bradley wrote about rape in ways that were offensive to some women, although their columns were about different and broader topics.", "For a statement that is partially accurate, we give McCoshen a Half True", "Wisconsin Public Television, \"Here and Now\" show (at 4:00), March 11, 2016", "New York Post, \"Bernie Sanders’ rape-fantasy essay reveals left-wing hypocrisy,\" June 5, 2015", "Email, political consultant Bill McCoshen, March 14, 2016", "Email, One Wisconsin Now executive director Scot Ross, March 14, 2016", "Mother Jones, \"How Bernie Sanders learned to be a real politician,\" May 26, 2015", "Marquette Journal, \"Awaiting feminism’s demise,\" Fall semester 1992", "One Wisconsin Now, news release, March 7, 2016", "One Wisconsin Now, news release, March 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]