["“Let’s get some justice for this poor man! He died of brain injuries because this monster kicked him in the head during the riots,” a Facebook user wrote on June 2, 2020 as people took to the streets across the country to protest the death of Floyd, a black man who was killed during his arrest in Minneapolis on May 25.", "Below the text are five photos, including one of a man lying face down on the ground, seemingly unconscious, while another man standing near him is shown with one foot in the air, about to kick him.", "Three other photos feature the attacker’s face for identification purposes.", "“Post and repost until someone recognizes him,” several users wrote.", "The image of the man about to be kicked is a still from a video posted on May 31. In a later part of the video, the man can be seen walking off stunned, but not dying.", "Warning: Graphic Content", "Show", "Hide", "Warning: Graphic Content", "Show", "Hide", "Video posted on social media of the May 30 protest in the northwestern US city of Portland shows that there were a small number of counter protesters, including the man who was assaulted.", "Some Facebook posts claimed the man was attacked for helping someone carrying an American flag.", "The victim did not die from his injuries, according to local police.", "“The man suffered non-life threatening injuries, and as of this morning is very much alive,” Sergeant Michael Roberts of the Portland Police Bureau told AFP by email.", "Roberts added that “the police have been in contact with the man who was assaulted and then kicked on the ground. This is an open investigation.”", "On June 4, a 14-year old suspect was arrested in connection with the assault, a Portland Police Bureau press release said.", "Since Floyd’s death, protests across the United States have been largely peaceful, but some have degenerated into vandalism and looting, such as in Portland on May 30.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]