["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, many readers asked Snopes to examine the accuracy of social media posts that claimed Republican and former New Jersey Gov. Chris Christie had advised U.S. President Donald Trump to provoke his Democratic rival Joe Biden into stuttering. (Biden has spoken publicly about being a stutterer throughout his life).", "Those posts were shared widely after Oct. 3, when Christie, an adviser to Trump in the 2016 and 2020 elections, announced he had tested positive for COVID-19.", "A typical version of the post read:", "Chris Christie gave Trump only one piece of advice as debate coach: “People who overcome stuttering have a harder time maintaining their train of thought when interrupted. Keep interrupting him and he’ll stumble when he tries to speak. This will enforce the ‘senile’ narrative.”", "Another widely shared version, posted on Sept. 29 after the first presidential debate, misspelled Christie's last name as \"Christy.\" A third version, posted after Christie's COVID-19 diagnosis, claimed that:", "Chris Christie gave Trump debate advice: \"Constantly interrupt Biden. People who struggle with stuttering can lose their train of thought when they're interrupted. Interrupt Biden and we can make him look weak and feeble.\"", "On Oct. 6, the Democratic Coalition, a progressive campaigning organization, also tweeted a similar version of the claim.", "We did not find any publicly available source for the quotations attributed to Christie in those widely shared social media posts, and they appear to be, at best, paraphrases of an alleged broader Trump campaign debate strategy. It's unclear why they were attributed to Christie, in particular.", "The broader claim, that Christie had advised Trump to attempt to provoke Biden to stutter, appears to be based on earlier news reports that cited anonymous sources purportedly familiar with the president's debate preparations.", "On Sept. 4, 2020, three weeks before the first debate, Politico reported that Trump's debate advisers included Christie; campaign adviser Jason Miller; campaign manager Bill Stepien; White House Chief of Staff Mark Meadows; and Trump Senior Adviser Jared Kushner. According to the website, the team was split on whether or not the president should target Biden's stutter:", "There’s some tension among the president’s advisers over whether it’s wise to try to trip up Biden so he stutters, or to box him in on issues. One 2016 Trump campaign official said it’s a “calculated risk” to phrase things in such a way that might cause the former vice president to stammer in his response, acknowledging such a strategy could backfire if Trump deliberately appears to be messing with Biden's history of stuttering — an attribute Biden has used to demonstrate his ability to overcome challenges and his empathy for children in similar situations.", "On Sept. 29, the Washington Post cited another anonymous source as saying that Trump had been advised and was keen to \"make Biden stutter and stammer.\"", "“No one really knows what he’s going to say,” one person with knowledge of preparations said. “But he has certainly been coached to be on offense, and he wants to make Biden stutter and stammer.” Biden has been open about his lifelong struggle to overcome his severe childhood stutter.", "The morning after the first presidential debate, State of New York Geneseo English professor Wes Kennison contributed to the narrative surrounding the Trump campaign's purported \"stutter strategy\" with a viral Facebook post in which he wrote:", "If you know and love a stutterer and you watched the presidential debate last night, within minutes it became obvious what was going on. Abusive tone of voice, rapid fire interruptions, zigzagging change of topic, personal insult and humiliation, and family pain are all tripwires that scramble a stutterer's ability to speak. There was nothing unplanned or spontaneous in the President's strategy. The bastards did not prep him to attack Joe. They prepped him to attack Joe's disability hoping that by triggering his stuttering they might deceive an audience unfamiliar with the disability into thinking that Joe was stupid, weak, uncertain, confused, or lost to dementia.", "Politico and the Washington Post's descriptions of a \"stutter strategy\" came from unnamed sources, meaning we cannot verify that they are accurate. Similarly, we could find no source for the quotations attributed to Christie, in particular, in the social media posts highlighted above. Kennison's Facebook post, although undoubtedly enlightening, constitutes a non-expert inference of Trump's strategy based on one person's viewing of the debate.", "Snopes contacted both the Trump campaign and Christie's lobbying firm, asking for their responses to the allegations made in the widely shared social media posts and news reports highlighted above. We did not receive a response from either in time for publication. If we do, we will update this fact check accordingly.", "On Oct. 6, Christie appeared to refute the allegations, reportedly telling CNN host Jake Tapper that Biden's stutter \"never came up\" in Trump's debate preparations. It's difficult to think of any evidence that Christie or the Trump campaign could present that would demonstrate, in a satisfactory way, that they had not even discussed Biden's stutter as a potential strategic target in debates. They would have to \"prove a negative,\" in that respect.", "For obvious reasons, we cannot accept Christie's denial on its face, even though it has the distinct advantage of being on the record. Equally, we cannot accept the veracity of the anonymously sourced statements included in reports by Politico and the Washington Post, which directly contradict what Christie said later. Therefore, until evidence emerges which settles the dispute in one direction or the other, we are bound to issue a rating of \"Unproven.\"", "Hendrickson, John.   \"What Joe Biden Can’t Bring Himself to Say.\"\r\n    The Atlantic.  January/February 2020.", "Cook, Nancy and Gabby Orr.   \"Trump Team Plots How to Bust Biden in the Debates.\"\r\n    Politico.   4 September 2020.", "Dawsey, Josh.   \"Trump Didn’t Prep for Debate; Advisers Don’t Know What He Will Say.\"\r\n    The Washington Post.  29 September 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]