["Multiple Facebook posts, including this one published May 8, 2019, and shared more than 300 times since, contain the doctored image.", "A caption in Hindi alongside the photo in the post translates to English as: “Rahul Gandhi was given a great welcome in Amethi. He was thrashed badly.”", "Amethi is a constituency in the northern state of Uttar Pradesh where Gandhi is standing for reelection in India’s six-week election. Here are details of his canditature on the Election Commission of India website.", "Below is a screenshot of the misleading post:", "The image has also been shared elsewhere on Facebook with the same claim, for example here – where it has been shared more than 200 times since being published May 8, 2019 – and here, and on Twitter, for example here and here.", "A Google reverse image search led to this report dated September 5, 2018, on the website of Indian broadcaster Republic TV.", "It contains a video that starts with a static image in which Gandhi appears on the right. Below is a screenshot of the full image as it appears in the Republic TV report:", "The image below compares the doctored image of Gandhi in the misleading Facebook post (L) with the picture of him used in the Republic TV report (R):", "Another reverse image search using a cropped version of Gandhi’s photo from the Republic TV image led to this news article on the website of Indian newspaper The Economic Times.", "Below is a screenshot of the original photo as it appears in the September 18, 2018 Economic Times article:", "Recent news reports about Rahul Gandhi's campaign in Amethi – for example here in News18, here in the Economic Times and here in The Hindu – do not mention the politician being beaten up there.", "The picture of the mountain in the background of the Republic TV image is Mount Kailash, a Hindu pilgrimage site in Himalya. Its picture is widely available online, for example here.", "Indian fact-check organisation Alt News has previously debunked this misleading image here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]