["About this rating", "Celebrity marriage gossip has been traditionally reserved for the pages of unreliable tabloids. However, since at least December 2020, various online advertisements claimed without evidence that David Muir was married. Muir is not a Hollywood celebrity. Rather, he is the anchor for the ABC News weeknight edition of \"World News Tonight.\" We decided to take a closer look at the strange ads.", "One ad read: \"[Photos] Take A Look At Who David Muir Is Married To Today.\"", "Another said: \"[Photos] David Muir Is Happily Married To His Partner.\"", "However, both of these were misleading. The first ad landed readers on a lengthy slideshow article on The Financial Mag website. The headline read: \"Huge Bank Balances And True Love – These Celebrity Couples Are Lucky To Have Both!\" Muir was finally mentioned after more than 90 pages.", "But, oddly, the story reported that Muir was still single.", "The second ad also led to a long slideshow article on the Mortgage After Life website. The headline was: \"Celebrity Couple [sic] Who Were Born To Love Each Other Forever.\" Muir appeared after more than 100 pages.", "Neither page said anything about his being married. Further, we found no credible news source that confirmed he was married or had been married in the past.", "This was a variation of another misleading advertisement about the news anchor that we previously reported on in December 2020.", "Another website, Investment Guru, promoted an ad that claimed Muir \"revealed his partner.\" It also showed a picture where he appeared to be doing a newscast while shirtless. However, the photograph was doctored.", "We rated \"false\" the claim that Muir posed shirtless and \"revealed his partner\":", "We also rate the newer variation as \"false\" because Muir is not married, and the websites did not confirm any details about his personal life.", "Have you seen other variations of this claim? Let us know.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]