["The list was published here by a Facebook page called ‘Get Our ABC Back’ on August 18, 2019.", "It has been shared more than 3,000 times. It purports to show the number of coal-fired power stations in a selection of countries around the world.", "The post's text states: “WORLD WIDE COAL PLANTS. \n\t\"Here’s a small sample of how many coal plants there are in the world today\n\t\"The EU has 466 plants, building 27 more for a total of 495\n\t\"Turkey has 56 plants, building 93 more total 149\n\t\"South Africa has 79, building 24 more total 103\n\t\"India has 569, building 446 more total 1036\n\t\"Philippines has 19, building 60 more total 79\n\t\"South Korea has 58, building 26 more total 84\n\t\"Japan has 90, building 45 more total 135\n\t\"AND CHINA has 2363, building 1171 total 3534", "\"AUSTRALIA is planning to shut down their remaining 6 plants and save the planet!”", "Excluding Australia, the post claims that 5,615 coal-fired power stations are operational or being built in the selected countries -- 3,700 active and 1,915 under construction.", "Below is a screenshot of the misleading Facebook post:", "The same list also appears in Facebook posts here, here, here, here and here.", "The figures in the list are out of date. AFP located the current figures for the number of active and under construction coal-fired power plants in the listed countries.", "According to its website, the Global Coal Plant Tracker “provides information on all existing coal plants of 30 MW or larger, as well as every plant proposed since January 1, 2010.”", "The Global Coal Plant Tracker provides summary statistics for the number of coal-fired power plants per country here, as well as by region here.", "As of July 2019, the Global Coal Plant Tracker shows:", "Excluding Australia, the countries listed have 1767 operational coal-fired power plants and a further 196 under construction, for a total of 1963.", "A list of the 20 coal-fired power plants in operation in Australia can also be found on the Australian Clean Energy Regulator’s website here, which was published on March 25.", "The misleading posts wrongly claimed there were 3,700 operational coal-fired power plants and 1,915 under construction, for a total of 5,615.", "A Google search for the numbers and keywords referenced in the misleading posts shows that its text appears to have been sourced from this January 2019 post on a blog called The Saltbush Club.", "The blog describes its purpose as follows: “All Saltbush members are concerned that climate-alarm policies promoted by most politicians are not based on sound science, and are already causing great damage to Australian industry, jobs and consumers.”", "The January 2019 post on The Saltbush Club links back to this July 2017 by a blog called Watts Up With That, which describes itself as “the world's most viewed site on global warming and climate change”.", "The post features a graphic which was first published alongside this article published by British newspaper The Times in December 2015, which shows the figures used in the misleading Facebook posts.", "Below is a screenshot of the graphic in the Times’ article:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]