["The video was shared on Facebook by an Australian-based user here on November 28.", "The man narrating the video shows a purported list of ingredients for the Pfizer-BioNTech COVID-19 vaccine. He then focuses on a yellow tag which reads; “Lipid nanoparticles that carry and protect the mRNA from degradation”.", "The narrator then says: “We know people have been talking about nanotechnology and being injected with nanotechnology. Well there it is, you have to say that is what’s happening, nanotechnology is made of nanoparticles.”", "The narrator then suggests Bill Gates could be involved in creating the technology, echoing long-running Covid-19 conspiracy theories. “We don’t know what's in those particles, but they are so f***in nano that just about you could definitely have little computers in there,” the narrator claims.", "Nanotechnology is the manipulation or creation of materials and devices at the atomic scale. Nanoparticles are microscopic particles that measure less than 100 nanometres. Nano refers to a unit of size on the nanoscale, which is measured in billionths of the metre.", "The video has also been viewed thousands of times in multiple Facebook posts here, here and here alongside similar claims.", "The claims in the video, however, are misleading.", "Griffith University professor of infectious diseases, Nigel McMillan, told AFP in an email that “no such technology exists at this time” that would allow robots or computers to be encased in the lipid nanoparticles found in the new Pfizer/BioNTech vaccine.", "The Pfizer/BioNTech COVID-19 vaccine is an mRNA vaccine, which sends instructions to our cells to create a section of the spike protein found on the surface of the COVID-19 virus, according to the CDC. “Our immune systems recognize that the protein doesn’t belong there and begins building an immune response and making antibodies,” the CDC adds.", "Professor McMillan said the lipid nanoparticles found in the Covid-19 mRNA vaccine are a form of protection for the mRNA vaccine as they enter cells. “They [the lipid nanoparticles] are made of fats that either naturally occur in your body (eg think cholesterol) or are derived from plants (think margarine),” he said in a December 8 email.", "Canadian biotechnology company Acuitas Therapeutics developed the lipid nanoparticles in the Pfizer/BioNTech Covid-19 vaccine and described the process here, explaining: “In simple terms, it takes the mRNA safely through the body and delivers it into our cells, placing it exactly where it needs to be,” the company said.", "Conspiracy theories about Bill Gates and false suggestions that he plans to use the Covid-19 vaccine to microchip people have been circulating online throughout the pandemic. The Bill Gates Foundations told AFP in June the claims were false.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]