["About this rating", "The images above come from, respectively, CNN's television coverage and a photo snapped by freelance photographer Mark D. Phillips (who subsequently sold his picture to Associated Press) as New York's World Trade Center towers burned after the terrorist attack on 11 September 2001. Neither image was manipulated.", "Finding demonic images in photographs and other visual representations — especially those depicting scenes of death and disaster — is an age-old human behavior employed to ascribe catastrophes to evil forces beyond our control, or (as in the following example) to fix blame on a target of choice (rather than the real perpetrators):", "[Collected on the Internet, 2001]", "Don't these photos of Satan at the world Trade Center catastrophe tell us that the current seat of Satan's power is the World Trade Center? Don't these photos depict Satan being awakened from his hiding place in the World Trade Center? For it is the international bankers who operate from Fed, the CFR and the World Trade Center who create first, second and third world debt. Usury according to the Bible is Satan's method for enslaving the world under his priesthood, the accountants and bankers of the world (IMF, World Bank Group, WTO). All of this will usher in 666 which is an economic mark of commerce according to the Book of Revelation (Ch 13,17). This mark will also be a religious affiliation of worship which will damn the soul eternally of all who partake we are told.", "And then there are those who take the additional step of deliberately creating such images:", "Pareidol is the technical term for our penchant for finding specific images amidst randomness. Just as people see all sorts of images in clouds, so viewers can find anything from an ordinary ball of smoke to the face of Satan himself in these kinds of pictures. But do we really need to find the visage of the devil here to know that evil was behind the events pictured?", "ADDITIONAL INFORMATION", "A Face in the Smoke?   (KUSA-TV Denver)", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]