["After the Pulwama terror attack, a message has gone viral on social media claiming that Modi government has started a new scheme exclusively for battle casualties and weapon purchase. It has been shared by many individual users on Facebook and Twitter.", "🙏Pay only Rs1/- (Ruppe one only)Like never before, The Modi government has started a new scheme exclusively for Indian Army Battle Casualties and Weapon Purchase. The government has opened bank account where people can donate funds directly to Army Welfare Account which will be used for purchasing weapons to the Indian Army and providing facilities for war casualties.People had suggested Government to open bank account to collect funds exclusively for battle casualties and purchasing weapons for army, the Modi government has accepted the suggestion and opened an account in Syndicate Bank, New Delhi for the same. The most attractive feature of this scheme is, people can donate the smallest amount of ONE Rupee. Master Stroke by Modi Government. A country’s population of 130 crore of which even 100 crore people (70%) deposit One Rupee Each, the ministry will get 100 crores/day, 3000 crores/month and 36000 crores/year. 36,000 Crore which is greater than Pakistan’s total defence expenditure. We spend hundreds and thousands of rupees on many unnecessary expenditure, but if we can spend ONE RUPEE on army, it can surely make India a SUPER POWER.The money will directly reach the defence ministry for army benefit and war casualties. This is the most unique idea to help our army Jawans who have lost life in battle fields. Come together, show solidarity to our DEFENCE FORCES, PARA MILITARY FORCE and CRPF. JOIN THE MISSION TO MAKE INDIA A SUPER POWER!Bank Details:SYNDICATE BANKA/C NAME: ARMY WELFARE FUND BATTLE CASUALTIESA/C NO: 90552010165915IFSC CODE: SYNB0009055SOUTH EXTENSION BRANCH,NEW DELHI.please circulate to maximum members", "The message is circulated on social media after the terror attack in Pulwama which lead to the deaths of 44 CRPF personnel. Another version of the same message claims that based on a suggestion from Bollywood actor Akshay Kumar, PM Modi decided to setup a fund for battle casualties and weapon purchase.", "In 2016, Indian Army veterans had officially announced that a fund has been setup for the ‘Army Welfare Fund Battle Casualties’. The announcement came in the wake of Siachen avalanche disaster when several organization and personnel wished to financially contribute to the kins of battle casualties. However, the fund is not meant for procurement of weapons for army. The official document issued by the official website of Army veterans states, ” The donations received in the fund are utilized to pay financial assistance / grant to widows of our Battle Casualties, their next of kins and dependents.” It may be noted that the account details given in the viral message are accurate. While the viral message is asking people to donate to Central Reserve Police Force (CRPF), CRPF comes under the Home ministry while the Indian Army comes under Defence ministry. Also, this wasn’t an initiative by actor Akshay Kumar as it is being claimed on social media.", "According to news report, the message had also gone viral on WhatsApp after the Uri attack that took place more than two years ago. Incidentally, the Additional Directorate General of Public Information – Indian Army had also issued a clarification days before the Uri attack. The claim was earlier debunked by The Quint.", "Clarification on the Issue of Army Welfare Fund Battle Casualties pic.twitter.com/U3BjOcwK5t", "— ADG PI – INDIAN ARMY (@adgpi) September 2, 2016", "The ‘Army Welfare Fund Battle Casualties’ was setup for financially supporting the kin of battle casualties, and not for collecting funds for weapon purchase, as suggested by the viral social media message. The message on social media, mentions the correct account number but the description of the objective of the fund is misleading.", "It is also reported that some unscrupulous elements are soliciting contributions from people through other accounts.It is advised that people desirous of supporting families of martyrs of CAPFs should only contribute through the website – https://t.co/wkuXoWnRJL", "— गृहमंत्री कार्यालय, HMO India (@HMOIndia) February 16, 2019", "You can donate to the families of CRPF martyrs on Ministry of Home Affairs’s portal, BharatkeVeer. It was reported in media that the BharatKeVeer portal was Akshay Kumar’s brainchild which Home Ministry executed. However, it may be re-emphasized that the portal aims to help the next kin of slain soldiers financially and not to purchase weapons.", "Such an Honour to Garland the sacred soil of the Sardar Post on #ValourDay. Launching my dream, #BharatKeVeer as we speak!! Jai Hind pic.twitter.com/JbJUoNbq5i", "— Akshay Kumar (@akshaykumar) April 9, 2017", "Alternatively, you could also use UPI to contribute to this account.", "The State Bank of India @TheOfficialSBI has created a UPI for #BharatKeVeer initiative. You can now help the families of India’s bravehearts by contributing through UPI using VPA- bharatkeveer@sbi pic.twitter.com/HoXfODhoYK", "— Bharat Ke Veer (@BharatKeVeer) February 16, 2019", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]