["By Robert Farley", "Posted on March 14, 2019", "With the Senate set to vote on whether to oppose his border emergency declaration, President Donald Trump has called on Republicans to close ranks on what he says is an “80 percent positive issue.” That’s spin.", "A recent poll asked if the U.S. “should have basically open borders or do you think we need secure borders?” and nearly 80 percent responded “secure borders.”", "But when asked directly about the president’s declaration of a national emergency at the southern border, recent polls show a majority of U.S. voters oppose it.", "On Feb. 26, the Democratic-controlled House passed a resolution to block the president’s declaration of a national emergency along the southern border. The declaration would allow the president to access federal funding for construction of border fencing without congressional approval. The Senate is set to vote on the resolution on March 14.", "With the Republicans holding a majority in the Senate, Trump has implored his party to stick together to defeat the resolution, and he accused a united Democratic Party of thwarting the public will. On Twitter, Trump called the vote “an 80% positive issue” in his favor.", "Republican Senators have a very easy vote this week. It is about Border Security and the Wall (stopping Crime, Drugs etc.), not Constitutionality and Precedent. It is an 80% positive issue. The Dems are 100% United, as usual, on a 20% issue, Open Borders and Crime. Get tough R’s!", "— Donald J. Trump (@realDonaldTrump) March 11, 2019", "Two days later, Trump again tweeted the claim that Democrats planned to vote unanimously in favor of the resolution to block his emergency declaration, despite it being a “20% issue” for them.", "Democrats will have a unanimous vote on a 20% issue in opposing Republican Senators tomorrow. The Dems are for Open Borders and Crime!", "— Donald J. Trump (@realDonaldTrump) March 13, 2019", "The White House did not respond to our inquiries seeking clarification of the president’s tweets. But in an interview with NPR in late January, White House spokesman Hogan Gidley used similar language to describe a Harvard-Harris poll that he said showed, “It’s an 80-percent issue, people want to close down the borders.”", "Actually, the monthly Harvard-Harris poll he was referring to posed this question: “Do you think we should have basically open borders or do you think we need secure borders?” To that question, 79 percent responded “secure borders,” including 68 percent of Democrats, while 21 percent said, “basically open borders.”", "As we have written, despite the president’s frequent claims that Democrats in Congress support open borders, none has advocated such a position. There has been disagreement between the two parties about how best to achieve border security. Trump repeatedly has said more border fencing is necessary to secure the southern border. Democrats have largely agreed on the need for some border security, but have described the president’s plan for more border fencing as wasteful and inefficient.", "Two other questions in the Harvard-Harris poll, and in other surveys, show the public holds a more nuanced position than the presidents’ tweets suggest.", "One question in the poll asked, “Do you think current border security is adequate or inadequate?” To that, 61 percent responded “inadequate,” while 39 percent said “adequate.” Another question asked, “Do you support or oppose building a combination of physical and electronic barriers across the U.S.-Mexico border?” Among respondents, 54 percent supported that approach; 46 percent said they opposed it.", "Other polls show consistent opposition to the president’s call for more border fencing.", "A Pew Research Center survey in January found that a majority of Americans (58 percent) opposed “substantially expanding the wall along the U.S. border with Mexico.” A Harvard CAPS/Harris poll released in December found that 56 percent of registered voters surveyed did not support the president’s proposal to construct a wall along the southern border.", "A Quinnipiac poll in late January similarly found that a majority of voters, by a margin of 55 percent to 41 percent, opposed building a wall along the border with Mexico. By a margin of 61 percent to 33 percent, respondents said they support a bill that funds new border security measures but does not fund a wall along the Mexican border, the Quinnipiac poll found.", "More directly on the question of the president’s emergency declaration, a majority of those surveyed — by a margin of 66 percent to 31 percent — said they disapproved of invoking a national emergency to fund a wall along the border, the poll found.", "“Voters buy in on better border security. But that wall…Bad idea,” Tim Malloy, assistant director of the Quinnipiac University Poll, said in a press release. “‘Don’t build it,’ voters say, ‘and it wouldn’t work anyway.'”", "Other polls have found the same thing on the question of the president’s emergency declaration.", "A Politico/Morning Consult poll in early March found that 52 percent of registered voters opposed the president’s declaration, while 38 percent supported it. Among Democrats, the opposition to the emergency declaration was even more strident. Just 10 percent of Democrats in the poll said they supported the president’s emergency declaration, while 83 percent opposed it.", "In other words, the Senate will not be voting on a resolution that is opposed by 80 percent of the American public. Polls show a majority of Americans actually do not support the president’s emergency declaration.", "Even if the Senate passes the resolution, though, Trump has vowed to veto it. It is unlikely there are enough supporters of the resolution in Congress to be able to overturn the president’s veto.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]