["By Lori Robertson and Robert Farley", "Posted on October 26, 2018", "Editor’s Note: For weeks, President Donald Trump has been campaigning in states that are key to the Republican Party’s chances of maintaining control of the House and Senate. We have reviewed seven speeches he gave from Oct. 10 to Oct. 22. This is part of a series of stories on his speeches.", "President Donald Trump has made health care — in particular a “Medicare for All” plan proposed by Sen. Bernie Sanders — a main theme in his campaign rallies across the country.", "He claims that Republicans will “protect” Medicare, while Democrats will “totally obliterate” it. He supports these sweeping pronouncements by making false statements about the cost and details of Sanders’ plan, as well as who actually supports it. In Trump’s telling, all Democrats do, but that’s not the case.", "We also found, in our examination of seven speeches over 12 days in October, that the president falsely told a crowd in Ohio that an opioid bill garnered “very little” support from Democrats, when they actually voted unanimously for it. He also boasted in several states of “incredible” or “tremendous results already” from the “right to try” law aimed at giving terminally ill patients quicker access to unapproved medications — but there’s no evidence anyone has received such access under the law.", "And he continued to make misleading claims about health insurance premiums and protections for preexisting conditions.", "At a rally in Lebanon, Ohio, on Oct. 12, Trump falsely claimed a bill that seeks to address the opioid epidemic passed Congress with “very little Democrat support.” In fact, the legislation was a bipartisan bill offered by two Republicans and two Democrats. It was unanimously supported by Democrats in the House and Senate. In fact, the handful of votes against the bill all came from Republicans.", "“I’ll soon sign into the law the largest legislative effort in history to address the opioid crisis where just this year we got $6 billion from Congress,” Trump said at the rally. “Thanks to [Republican Sen.] Rob Portman and a lot of others. Thank you, Rob. But Rob and so many others helped. Very little Democrat support.”", "Earlier this year, the Senate passed a bipartisan budget bill that included $6 billion to help address the opioid crisis. But the bill Trump referenced was a more recent one, H.R. 6, the “SUPPORT for Patients and Communities Act,” an expansive package aimed at combating the nation’s opioid epidemic.", "The bill, which Trump signed on Oct. 24, includes expanding Medicaid and Medicare coverage for opioid-addicted patients, helping to create comprehensive opioid recovery centers, encouraging the development of non-addictive pain medications, and combating the importation of illegal drugs from overseas. Read here for a section-by-section breakdown of the many provisions in the bill.", "The bill was initially introduced in the House by Republican Rep. Greg Walden, who made clear in a press release that it was a bipartisan offering from himself, Republican Rep. Kevin Brady and Democratic Reps. Frank Pallone Jr. and Richard Neal.", "On the floor of the House, Walden noted that the bill was made up of dozens of pieces of legislation, most of which passed the House with strong bipartisan majorities.", "“You see, at a time when it seems we couldn’t be more divided, it is clear that striking back against addiction is something that transcends politics and brings us together as a community, as a country, and as a Congress,” Walden said.", "Several Democrats spoke from the floor in support of the bill, and noted that it incorporated numerous pieces of legislation first brought to the House by Democrats. Other Democrats said they were concerned that the bill did not do enough to address the opioid crisis, but still voted for it.", "The final version passed the House on Sept. 28 with a vote of 393-8. The eight votes against the bill all came from Republicans. Explaining his opposition to an earlier version of the bill, Republican Rep. Matt Gaetz said that while the bill had an “admirable purpose,” it was “costly, inefficient, and bad governance.”", "Over on the Senate side, as Trump suggested, Republican Sen. Portman was one of the champions of the legislation and added several provisions to the final draft. But Trump is dead wrong to say the bill got “very little” Democratic support.", "The final version of the bill passed the Senate 98-1 on Oct. 3 The lone vote against it came from Republican Sen. Mike Lee.", "In his rallies, Trump makes false and unsupported claims about the “right to try” law he signed on May 30.", "He claims that until he signed the law, “we couldn’t even come close” to letting terminally ill patients use promising, but unapproved, medications. In fact, the FDA for years has approved applications from patients seeking access to investigational drugs through the agency’s “expanded access” program.", "Trump also claims there have been “tremendous” and “incredible results” under the months-old federal law, but we could find no evidence that any drug manufacturers have granted access to any medications under the new law. The Goldwater Institute, the group that pushed for the law, told us only that it has “spoken to interested companies.”", "Trump, Texas, Oct. 22: And what happened is people would be told they’re terminally ill. They have a big problem. And if we had a drug or we had treatment that gave great hope, that looked promising, we couldn’t even come close to letting them use it. …", "And now they sign a simple document and they go out and they get it. And by the way, this we signed three months ago. We have had tremendous results already.", "Trump, Pennsylvania, Oct. 10: We have incredible drugs in the pipeline that can cure really horrible, horrific disease. We wouldn’t let anyone use these drugs because they didn’t want to hurt them, but they’re going to die. They’re terminally ill! I said, what are we doing?", "And two months ago, I signed right to try. Somebody’s terminally ill, we can try. And we’ve had great success. We’ve had great success.", "On Oct. 13 in Kentucky, too, the president said that “we’ve had some incredible results already.”", "The right to try legislation aims to circumvent the FDA and give terminally ill patients access to unapproved drugs more quickly than through the FDA’s expanded access program. But the president is wrong to say “if we had a drug or we had treatment that gave great hope, that looked promising, we couldn’t even come close to letting them use it.”", "FDA Commissioner Dr. Scott Gottlieb testified to Congress in October 2017 that the FDA had approved 99 percent of the more than 1,000 annual applications it gets for “expanded access to treat patients with investigational drugs and biologics.” Gottlieb said that “emergency requests for individual patients are usually granted immediately over the phone and non-emergency requests are generally processed within a few days.”", "The agency has data by fiscal year back to 2010 on its website.", "Under either the FDA’s expanded access program or the new federal right to try law, patients, along with their physicians, can request access to drugs that haven’t yet been approved by the FDA directly from manufacturers if there are no comparable treatments. In the FDA’s program, if a manufacturer agrees to make the drug, or device, available, both the FDA and the medical institution’s institutional review board must approve a treatment protocol before a patient can get the medication. Under right to try, which applies only to drugs, there’s no FDA or IRB oversight.", "In both processes, the drug manufacturer decides whether or not it wants to make the drug available.", "The right to try law is nearly five months old — which isn’t a lot of time to see “incredible results,” as the president claims. And, in fact, we asked the FDA, the Goldwater Institute and an expert on pre-approval access to treatments whether any drug companies have granted access to drugs under the new law, and they knew of no such instances. The White House press office didn’t respond to our inquiry.", "Alison Bateman-House, co-chair of the NYU School of Medicine Working Group on Compassionate Use and Pre-Approval Access, told us she is active in talking with patient groups and pharmaceutical companies, and she is “not aware of anyone getting access” or even the suggestion of someone getting access to drugs via right to try.", "The Goldwater Institute, a libertarian group based in Arizona that has pushed for state and federal right to try laws, said in a statement to FactCheck.org: “Just a few short months since the federal Right to Try was signed, we are now seeing growing interest and enthusiasm from manufacturers and the medical community around Right to Try.” But there have been no announcements of drug access.", "(The group points to a doctor in Texas treating neuroendocrine cancer as an example of that state’s law providing access to unapproved medication in the past. However, the NYU working group disputes this, saying the drug — Lutathera, which received FDA approval in January — was available via pre-approval access already. Regardless, they both agree there’s no example of drug access given under the new federal law.)", "The FDA press office told us that the agency had “convened an internal group to assess how to effectively and efficiently implement the new law. As part of that process, the agency will consider what information the FDA needs to issue to support companies and patients seeking to use the Right to Try pathway, such as guidance, QAs, or other agency recommendations.”", "Bateman-House said it’s doubtful any company would want to give access to drugs through right to try without such guidance to follow.", "It’s possible that the new law has prompted more awareness of the FDA’s existing expanded access program. Bateman-House wrote in an Oct. 25 article for the blog of the Health Affairs journal that “some pharmaceutical and biotech company executives have told me that they’ve experienced an uptick in the number of requests for investigational drugs — requests that they are handling via EA. … In a way, patients may have benefited from RTT after all: not because it created a new pathway that cut the FDA out of the picture, but because it raised awareness that non-trial access was possible, thus galvanizing patients and their doctors to request it.”", "However, we will have to wait “a year or two,” she wrote, for FDA data on the expanded access requests to see whether there has been such an impact.", "Reversing traditional partisan attack lines, Trump claims Democrats are a threat to Medicare, and that he and Republicans are its defenders. But Trump cuts some corners to make his point.", "Trump, Kentucky, Oct. 13: We, unlike the Democrats, will protect Medicare and protect Social Security.", "Trump, Nevada, Oct. 20: We will protect Medicare and we will protect your Social Security. And remember, when I was on that stage, I was the only one that said I’m going to protect your Social Security, and I have. …  Because the Democrats will end up destroying them both, Medicare, Social Security.", "It’s worth noting, as we wrote, Medicare’s finances have worsened since Trump took office. The latest Medicare trustees report says the Medicare Part A trust fund, which covers payments to hospitals, will run out of money by 2026, three years earlier than projected just last year. That’s partly because the tax cut law that Trump signed last year will reduce Medicare revenues and increase expenses.", "The tax law also had a negative effect on Social Security. The Old Age and Survivors trust fund is scheduled to run out of funds one year earlier in 2035.", "Trump also argues a Medicare for All plan championed by Sen. Bernie Sanders would upend the health care program for seniors.", "Trump, Ohio, Oct. 12: Democrats have signed up for a socialist takeover of American health care that would utterly destroy Medicare and rob our seniors of the benefits they paid into their entire lives.", "Trump, Nevada, Oct. 20: Democrats in Congress have already signed up for a socialist takeover of health care that would eliminate the private insurance of 1.6 million people from Nevada. The Democrats want America to become — it’s not even that they want it, but that’s what’s going to happen — Venezuela. Venezuela. How does that sound?", "Trump  is twisting several facts about the bill.", "Sanders’ bill would expand Medicare into a universal health insurance program, phased in over four years. While Trump calls it a “socialist takeover of American health care,” that’s not entirely the case. Under Sanders’ plan, the government would reimburse private hospitals and doctors for health care services, as the Canadian government does. So the government would play the role of health insurer, not provider. That’s different than a wholly government-run health care system, such as in Britain — and Venezuela.", "“Medicare for All would be an expansion of Medicare to a government funded and mostly privately administered and delivered health care system,” Carles Muntaner of the Dalla Lana School of Public Health at the University of Toronto, told us via email. “The Venezuelan system at this point has a variety of government funded health care programs. … This is radically different from the U.S. Medicare for All model.”", "As for Trump’s claim that the plan would “rob our seniors of the benefits they paid into their entire lives,” as we wrote when Trump made a similar claim in an op-ed on Oct. 10, Sanders’ bill, as written, includes an increase in Medicare benefits, including dental, vision and hearing aids, and eliminates deductibles. That would be giving more benefits to seniors, not taking any away.", "And, for the record, while Americans have paid into Medicare their whole working lives, they haven’t paid enough payroll taxes into the Medicare Part A program to cover costs in the near future. And Parts B (physician services) and D (prescription drugs) are mainly paid with general revenues. In other words, seniors are getting more benefits from Medicare than they paid for. In total, Medicare cost $710 billion in 2017 and about 41 percent of that was paid through general revenues. (See Table II.B1 of the latest Medicare trustees report).", "Trump claimed in his rally in Kentucky that under Medicare for All, “your taxes are going to triple if you’re lucky.” That’s based on a cost analysis of Sanders’ plan published by the Mercatus Center at George Mason University, which gets some of its funding from the libertarian Koch brothers. But that’s the net increase in health care spending – there would be offsetting savings for people, businesses and state governments.", "The study’s lead author, Charles Blahous, concluded the plan would increase the federal budget by $32.6 trillion over 10 years and, “Doubling all currently projected federal individual and corporate income tax collections would be insufficient to finance the added federal costs of the plan.” And, he wrote, “It is likely that the actual cost of M4A would be substantially greater than these estimates.”", "An Urban Institute analysis of the Medicare for All plan proposed by Sanders during the 2016 presidential campaign (which differs a bit from the bill Sanders introduced in the Senate) also concluded the federal government would spend about $32 trillion more over 10 years.", "But the Urban Institute study makes clear that this is just one side of the equation. Much of the increase in taxes would be offset by savings from private spending on health care, which would be nearly eliminated. The Urban analysis concluded national health expenditures overall would increase by $6.6 trillion (16.6 percent) between 2017 and 2026.", "Trump also overstates the Democratic consensus around the Medicare for All plan. Sanders’ bill is one of a handful of bills proposed by Democrats in this Congress that would expand the role of public programs in health care.", "Republicans have frequently misidentified Democratic candidates as supporters of Sanders’ Medicare for All plan, even when those candidates have made clear they don’t support it. Our fact-checking colleagues at the Washington Post Fact Checker noted at least 15 such instances.", "Trump made the same mistake when he singled out Democratic congressional candidate Amy McGrath in Kentucky, claiming she “supports a socialist takeover of your health care,” meaning Sanders’ bill. She does not. “I would not cast my vote for [the Sanders Medicare for All bill], not that plan as it is currently laid out,” she told the Lexington Herald Leader.", "As she spells out on her campaign website, McGrath would like to reform the existing Affordable Care Act to include a Medicare buy-in option for those over the age of 55 and “a so-called ‘public option’ to create a government-run health insurance agency that would compete with other private health insurance companies within the country.” The State Public Option Act, which would create a Medicaid buy-in option that states could offer through the ACA marketplace, has 20 Senate co-sponsors, including Sanders. That plan has more Democratic co-sponsors in the Senate that Sanders’ Medicare for All bill.", "In another attack on Medicare for All, Trump says the bill would end Medicare Advantage, which are private plans approved and paid for by Medicare. About a third of Medicare recipients are enrolled in such plans, which generally cost more per beneficiary than traditional Medicare.", "Trump, Nevada, Oct. 20: The Democrat plan would destroy Medicare and terminate Medicare Advantage for almost 200,000 Nevada seniors who depend on it. Democrats plan to kill Medicare Advantage and, really, it’s especially unfair to Hispanic Americans.", "It’s true that Sanders’ Medicare for All plan bans “duplicative” coverage from private insurers. That would effectively eliminate Medicare Advantage plans, but that doesn’t mean people would lose benefits they currently “depend on.” Rather, everyone would be put into a universal Medicare program, one with expanded benefits from today’s Medicare. It would offer most of the benefits that currently attract people to Medicare Advantage plans, such as vision, dental and audiology coverage, according to the bill. And once Medicare for All is fully implemented, there would be no deductibles for patients (except for some co-pays on brand-name drugs if a generic is available).", "“The main benefits of Medicare Advantage plans at the moment are that MA plans have out-of-pocket limits, which traditional Medicare does not have, and MA plans often offer supplemental benefits, especially vision and dental,” said Lori Kearns, a spokesperson for Sanders. “However, those are all things we will be offering under M4A.”", "Kearns noted that while the Medicare for All plan would ban duplicative coverage from private insurers, “it does not ban supplemental coverage. If there are items excluded from coverage, there could still be a private insurance market for those services.”", "Presidents often take credit for the good things that happen on their watch — whether they deserve credit for it or not. Trump has boasted of an expected 2 percent average decrease in benchmark premiums on the HealthCare.gov exchanges, saying it’s due to “good management,” even while he claims that Obamacare has been “very much dismantled, but it will be ultimately totally dismantled.”", "Health care experts told us that most administration actions in the past two years have driven premiums up.", "In Kentucky, Trump claimed: “And what we have done with the remnants of Obamacare is we’ve kept your premiums down far below what anybody would have thought, through good management, through Secretary Alex Azar.” And in Nevada, he lamented that not one Democrat would vote for a GOP repeal and replace plan last year, adding: “But now, if you notice, your premiums are way, way down. Nobody thought that was possible. And it’s been very much dismantled, but it will be ultimately totally dismantled.”", "Experts said lower growth was expected for 2019 for several reasons: less political uncertainty this year compared with 2017, slower growth in medical expenses, an overpricing of plans last year, and insurers’ growing familiarity with the market.", "Kelley Turek, the executive director of employer and commercial policy at the insurer trade group America’s Health Insurance Plans, told us that after several years under the ACA, “we are getting to a point where issuers are getting a better sense of this market,” she said, such as the population, their health costs and how to price plans.", "The president glosses over some inconvenient facts about Republican health care legislation and his administration’s actions when he tells his crowds that “Republicans will always protect patients with preexisting conditions.”", "Trump, Arizona, Oct. 19: And Republicans will always protect patients with preexisting conditions. They’re trying to put a false narrative out there. And if there is a Republican out there that doesn’t, let me know. I’ll — believe me, him or her, we’ll talk them into it. We’re going to protect preexisting conditions. It’s — put it down and bank.", "Trump talks about preexisting conditions because Democrats have made the issue a major campaign theme. In campaign ads, the Democrats have accused Republican incumbents of voting for legislation that guts protections for preexisting conditions.", "Trump complains of a “false narrative,” and we certainly have seen some inaccurate and misleading claims made about Republicans. But the Trump administration does support a lawsuit that it says would lead to the elimination of the Affordable Care Act’s preexisting condition protections.", "In June, the Justice Department said that “[a]fter careful consideration, and with the approval of the President of the United States” it had decided to not defend the U.S. government in a lawsuit seeking to overturn the ACA. The administration said that if the suit were successful, most of the health care law could remain, but two provisions would need to be eliminated: those guaranteeing that people can’t be denied coverage by insurers or charged more based on certain factors, including health status. (For more, see our story “Trump Misleads on Preexisting Conditions.”)", "In addition, it’s worth noting that while the GOP repeal-and-replace bills in 2017 would have continued to prohibit insurers from denying coverage to those with preexisting conditions, they would have changed the ACA’s protections regarding how insurers can price their policies.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]