["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif. gavels as the House votes 232-196 to pass resolution on impeachment procedure. (AP Photo/Andrew Harnik)", "In the days before articles of impeachment were unveiled against President Donald Trump, Wall Street Journal editorial page editor Paul Gigot claimed that a Trump impeachment would be the first of its kind.", "Speaking on the \"Journal Editorial Report,\" a show he hosts on Fox News Channel, Gigot attributed his information to George Washington University law professor Jonathan Turley.", "\"This would be the first impeachment in American history — if it proceeds, as it will — without a specific criminal statute or crime that the president who is impeached would have allegedly committed,\" Gigot said.", "Trump roughly quoted Gigot’s statement in a tweet the next day.", "Neither of the two prior presidential impeachments cited specific criminal violations. But in one instance, a possible prison term was in play and in the other, a felony crime was alleged, though not formally charged. In addition, experts say impeachment isn’t based on citing a particular criminal statute.", "\"Every scholar concedes that the presence or absence of a federal crime is beside the point when it comes to constitutional high crimes and misdemeanors,\" said Harvard law professor Laurence Tribe, co-author of \"To End a Presidency: The Power of Impeachment.\"", "The presidents who have been formally impeached by the U.S. House of Representatives were Andrew Johnson, in 1868, and Bill Clinton, in 1998. Both were acquitted in the U.S. Senate and remained in office.", "(Richard Nixon faced three articles of impeachment, but he resigned in 1974 before the House could take a vote on impeaching him.)", "Turley testified in the impeachment proceedings against impeaching Trump, saying: \"We have never impeached a president solely or even largely on the basis of a non-criminal abuse of power.\"", "Gigot and Turley did not respond to our requests for additional information.", "Constitutional law attorney David Rivkin said on Gigot’s show that he agreed with Gigot. Rivkin told us by email that Johnson violated a federal statute and Nixon and Clinton were \"credibly accused of violating specific criminal law violations,\" but Trump has not.", "In the context of Gigot’s statement, Johnson’s impeachment is tricky, even though he was not charged with violating any criminal code.", "By firing his secretary of war without Senate approval, Johnson allegedly violated the Tenure of Office Act, a civil statute that was later repealed. The statute carried a possible fine of up to $10,000, or prison for up to five years, or both.", "But \"no one was seriously threatening to put Johnson behind bars,\" said University of North Carolina professor of law Michael Gerhardt, who testified in support of Trump’s impeachment and is the author of \"Impeachment: What Everyone Needs to Know.\"", "Clinton’s impeachment also did not cite a specific criminal violation, but his conduct was allegedly criminal in that he was accused of committing perjury.", "The two articles of impeachment said Clinton \"willfully provided perjurious, false and misleading testimony\" to a grand jury related to the Paula Jones and Monica Lewinsky sexual harassment cases, and that he obstructed justice related to the lawsuits against him.", "\"Bill Clinton lied to a grand jury,\" said Republican Rep. Jim Sensenbrenner in the Dec. 12 Judiciary Committee hearing. \"That is a crime.\"", "The impeachment articles against Trump do not cite a specific crime or criminal statute.", "Trump is accused of abuse of power for his alleged efforts to strong-arm Ukraine into investigating his potential Democratic opponent, Joe Biden, by withholding military aid and an Oval Office visit; and of obstruction of Congress, for his efforts to block cooperation with Congress on its impeachment inquiry.", "\"Like the Clinton and Nixon articles, they don’t allege a particular statutory criminal violation by name, but they do allege facts that could be charged as a crime in an ordinary court,\" said Frank Bowman, author of \"High Crimes and Misdemeanors: A History of Impeachment for the Age of Trump\" and a University of Missouri law professor.", "The first article against Trump \"contains language drawn from bribery law, even though it doesn’t use the word bribery,\" Bowman said.", "Gigot said if Trump is impeached, this would be the first impeachment in U.S. history \"without a specific criminal statute or crime that the president who is impeached would have allegedly committed.\"", "The two presidents who have been impeached, Johnson and Clinton, were not charged with violating any criminal code. But that is only part of the story: Johnson was accused of breaking a law that carried a possible prison sentence, and Clinton was accused of the crime of perjury.", "The claim is partially accurate but takes things out of context. We rate the claim Half True.", "Fox News, clip (at 2:45) from \"Journal Editorial Report,\" Dec. 7, 2019", "PolitiFact, \"Should Trump be impeached? What law professors said at the House hearing,\" Dec. 4, 2019", "PunditFact, \"No, Nixon was never officially impeached. He resigned first,\" June 13, 2019", "Interview, Frank Bowman, University of Missouri professor of law and author of High Crimes and Misdemeanors: A History of Impeachment for the Age of Trump, Dec. 10, 2019", "U.S. Senate, Tenure of Office Act, 1867", "Email, Jeffrey Engel, director of the Center for Presidential History at Southern Methodist University and co-author of \"Impeachment: An American History,\" Dec. 10, 2019", "Email, constitutional law attorney David Rivkin, Dec. 10, 2019", "Email, Michael Gerhardt, University of North Carolina professor of law and author of Impeachment: What Everyone Needs to Know, Dec. 10, 2019", "Email, Joel Aberbach, professor of political science and public policy and director of the Center for American Politics and Public Policy at UCLA, Dec. 10, 2019", "United States Senate, \"The Impeachment of Andrew Johnson (1868) President of the United States,\" accessed Dec. 10, 2019", "PolitiFact, \"How the impeachment articles against Trump are similar to, and different from, Clinton and Nixon,\" Dec. 10, 2019", "Email, William Howell, professor in American politics at the University of Chicago, Dec. 10, 2019", "Email, Harvard law professor Laurence Tribe, co-author of \"To End a Presidency: The Power of Impeachment,\" Dec. 10, 2019", "Email, Wayne State University professor of law Peter Henning, Dec. 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]