["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Jeb Bush readies his push to win the Republican nomination, one of the charges he has to fend off is that he lacks conservative zeal. The issue popped up June 14, 2015, on Fox News Sunday, when a viewer suggested in a note to the show that Bush seems like more of a Democrat than a Republican.", "Conservative columnist George Will sprang to Bush’s defense. On cutting taxes and government as governor of Florida, and on social issues, Will said Bush was every bit a conservative as President Ronald Reagan, and maybe more.", "Will downplayed Bush’s electoral challenge even on the hot button issue of immigration.", "\"He happens to be where a majority of Republicans are,\" Will said. \"His (position) is a pathway to legal status.\"", "For the record, Bush’s position on immigration has been complicated. But Bush’s most recent comments suggest a pathway to legal status, so we think Will’s point is fair. The question is: Do most Republicans favor a path to legal status for undocumented immigrants like Bush now does? We looked at what the polls say.", "The latest report from the Pew Research Center bolsters Will’s claim. Pew’s survey found that 56 percent of Republicans favor a path to legal status, not to be confused with citizenship. Legal status would allow undocumented adults to work and pay taxes, but they would not be able to vote.", "However, George Hawley, a political scientist at the University of Alabama, cautions that the Pew survey also shows a complicated set of attitudes.", "\"A majority of Republicans also felt that giving people who came to the United States illegally a way to gain legal status is like rewarding them for doing something wrong,\" Hawley said. \"Further, 42 percent of Republicans felt legal immigration should be decreased, compared to 21 percent who think it should be increased. Also, far more Republicans view immigrants as a burden, 63 percent, than view them as an asset for the country, 27 percent.\"", "At the end of the day, Hawley said he wouldn’t call Will’s statement inaccurate, but it might be misleading.", "\"I would describe Republicans as ambivalent on questions relating to immigration policy,\" Hawley said.", "Timing matters", "Republican support for a path toward legal status has held a slim majority, but there’s been an ebb and flow in the margin depending on the news of the day. When President Barack Obama announced last December that he would hold off deportation for a larger number of undocumented immigrants, feelings among Republicans hardened.", "A December 2014 poll by Pew saw an 11 percentage point drop in support between the beginning and the end of the year. A majority of Republicans still supported legalized status, 53 percent, but it had been as high as 64 percent. The drop put support within the 5 percent margin of error.", "Still, older surveys even show that Republicans could get behind the more contentious goal of citizenship. A 2013 Fox News poll found that 56 percent of GOP voters endorsed a path to citizenship with various conditions such as paying back taxes and learning English.", "Stephen Nuno is a political scientist at Northern Arizona University. \"Republicans generally see mass deportation to be unrealistic, so the strength of their support is usually conditional on the terms of legality, whether it be penalties, stronger border security, and so on,\" Nuno said.", "Nuno also said that when Republicans feel better about the economy, they tend to take a more pragmatic view on undocumented immigrants, and support for legalized status goes up.", "Primary voters", "There is however the question of views among Republican primary voters who generally take a tougher position. One indication of where they stand comes from the 2014 election. According to exit polls reported by National Journal, 57 percent of Republican voters felt that undocumented immigrants should be deported, while just 38 percent favored legal status.", "More recently, an NBC/Marist poll of likely Republican voters in the early primary states of Iowa, New Hampshire and South Carolina probed whether voters could support a candidate who endorsed a path to citizenship. In Iowa, Republicans were evenly split, while in New Hampshire and South Carolina, a slim majority said such a candidate would be unacceptable.", "It’s important to note that the question was about citizenship, not legal status.", "Our ruling", "Will said that a majority of Republicans support Bush’s stance to craft a path to legal status for undocumented immigrants. Polls show that more than half of Republicans do hold that view. Republican positions have shifted over time and Republican primary voters might take a harder line than the typical Republican voter.", "With those caveats in mind, we rate the claim Mostly True.", "Fox News, Fox News Sunday, June 14, 2015", "Pew Research Center, Broad Public Support for Legal Status for Undocumented Immigrants, June 4, 2015", "Polling Report, Immigration", "Associated Press, AP-GfK Poll: Immigration not a deal breaker for Republicans, May 6, 2015", "538.com, Like Bush, many Republicans are moderate on immigration, April 12, 2014", "CNN/ORC Poll, Immigration, Nov. 26, 2014", "Washington Post, Republican voters change their minds about a path to citizenship, Dec. 3, 2014", "Washington Post, Immigration polling tells Congress to act, July 9, 2014", "Fox News, Fox News Poll: 66 percent favor path to citizenship for illegal immigrants, with conditions, Jan. 28, 2013", "Pew Research, Immigration Action Gets Mixed Response, But Legal Pathway Still Popular, Dec. 11, 2014", "National Journal, Is Immigration A Poison Pill For Jeb Bush?, March 23, 2015", "PolitiFact, Has Jeb Bush flip-flopped on immigration and a pathway to citizenship?, March 8, 2013", "Email interview, George Hawley, assistant professor, Department of Political Science, University of Alabama, June 14, 2015", "Email interview, Stephen Nuno, associate professor, Department of Political Science, Northern Arizona University, June 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]