["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic Candidate Tom Suozzi (Courtesy Suozzi's campaign website)", "Nothing, the saying goes, is as certain as death and taxes. Now both are campaign fodder in the race for a congressional seat on Long Island.", "Republicans are using Democrat Tom Suozzi’s record on taxes as Nassau County Executive in the 3rd Congressional District race. One claim followed a newspaper report that two of the voter signatures collected to help get Suozzi on the ballot are from people who had already died.", "\"Long Island voters who are actually living and breathing are clearly still unhappy with Suozzi raising taxes by hundreds of millions of dollars,\" Chris Pack of the National Republican Congressional Committee said.", "Suozzi served as Nassau County Executive from 2002 to 2009. Before that he was the mayor of Glen Cove. He wants to succeed Democrat Rep. Steve Israel, who’s not seeking re-election.", "He faces Republican Jack Martins, who has served in the State Senate since 2011 and also was mayor of the village of Mineola for eight years before that.", "So is the NRCC correct? Did Suozzi raise taxes by hundreds of millions of dollars when he was county executive?", "Raising taxes in Nassau County", "When Suozzi took office in 2002, Nassau County was in rough financial shape, riddled with debt amid a hiring freeze for non-essential workers. The county was trying to figure out how to recover from a fiscal crisis that started under the previous administration.", "The county received a bailout from the state, which also created an independent authority to monitor the financial condition of the county. That authority, the Nassau County Interim Finance Authority, has released reports on the county’s finances since its creation in 2000.", "To restore the county’s financial footing, Suozzi pitched an unusually large tax increase of close to 20 percent. The county legislature approved it,and property taxes increased by more than $125 million for residents that year.", "Though steep, the increase helped stabilize the county’s finances, at least in the short term, said E.J. McMahon of the Empire Center for Public Policy.", "Suozzi kept taxes mostly flat for the remainder of his time in office until 2009 when there was an increase in property tax revenue of close to 4 percent, or about $40 million.", "Suozzi also proposed a tax on energy use for Nassau County residents during his second term. It passed the legislature and took effect in 2009. It was repealed after Suozzi lost re-election. The tax generated close to $40 million for the county before it went off the books in the second half of 2010, according to documents from the county’s budget office.", "Two years after Suozzi lost the county executive’s office, the state took control of the county’s finances again.", "Our ruling", "The National Republican Congressional Committee said in an online post that former Nassau County Executive Tom Suozzi raised taxes by \"hundreds of millions of dollars.\"", "During his time in office, Suozzi raised taxes by more than $200 million by collecting more in property taxes and instituting an energy-use tax. The $40 million collected from the short-lived energy-use tax combined with the $160 million increase in property taxes brings the total above that threshold.", "We rate this claim as True.", "Long Island Democrat relying on dead voters to make the ballot, New York Post, Aug. 9, 2016, Accessed Aug. 18, 2016", "Email and phone conversation with Chris Pack from the National Republican Congressional Committee", "Email conversation with Matthew Fernando, Press Secretary for the Nassau County Legislature Majority (Republican)", "Email conversation with Brian Butry from the State Comptroller’s Office", "Email conversation with Carla Hall D’Ambra, Director of Communications for the Nassau County Comptroller", "Email conversation with E.J. McMahon from the Empire Center for Public Policy", "‘Taxin’ Tom Suozzi sees dead people’ NRCC Blog, Aug. 10, 2016, Accessed Aug. 18, 2016", "Election website biography of Tom Suozzi, Accessed Aug. 19, 2016", "Election website biography of Jack Martins, Accessed Aug. 19, 2016", "Nassau's Tough-Love Budget, April 5, 2002, New York Times, Accessed Aug. 22, 2016", "In Nassau County, a Small Election Will Settle the Political Balance, May 1, 2000, New York Times, Accessed Aug. 22, 2016", "Suozzi Proposes 20% Increase In Taxes For Nassau, March 26, 2002, New York Times, Accessed Aug. 22, 2016", "Review of the Fiscal Year 2009 Budget, Nassau County Legislature, Office of Legislative Budget Review, Oct. 15, 2008, Accessed Aug. 22, 2016", "Data on tax increases found using Open Book New York from the Office of the State Comptroller on Aug. 18, 2016", "Legislature passes Suozzi's heating tax proposal, News 12 Long Island, Feb. 24, 2009, Accessed Aug. 22, 2016", "Press Release: Mangano Repeals Home Energy Tax During Inauguration Address With bi-partisan support from local, state and federal officials, Mangano takes office, January 1, 2010, Accessed Aug. 22, 2016", "Review of Fiscal Year 2011 Budget, Nassau County Legislature, Office of Legislative Budget Review (Shows revenue from energy tax), Oct. 14, 2010, Accessed Aug. 22, 2016", "PATAKI PROPOSES A FISCAL BAILOUT OF NASSAU COUNTY, May 10, 2000, New York Times, Accessed Aug. 18, 2016", "NIFA Review of Proposed Multi-Year Financial Plan for Fiscal Years 2003 - 2006, Oct. 7, 2002, Accessed Aug. 22, 2016", "New York State Seizes Finances of Nassau County, Jan. 26, 2011, New York Times, Accessed, Aug. 22, 2016", "Payroll data found with See Through NY, the Empire Center’s database on state salaries and payments, Accessed Aug. 18, 2016", "Suozzi's in the money Nassau legislature approves pay hikes for executive, clerk, comptroller, assessor and DA effective Jan. 1, Dec. 18, 2007, Newsday, Accessed Aug. 22, 2016", "Suozzi committee to examine pay raises, Dec. 26, 2003, Accessed Aug. 18, 2016", "Nassau Property Taxes: Going Up, Going Down, and Getting Fairer, July 10, 2002, Accessed Aug. 18, 2016", "Suozzi proposes property tax hike, Sept. 25, 2008, LI Herald, Accessed Aug. 22, 2016", "Legislature repeals energy tax, Dec. 23, 2009, LI Herald, Accessed Aug. 18, 2016", "Suozzi pushing 'no-county-tax-increase' budget, Sept. 24, 2009, LI Herald, Accessed Aug. 22, 2016", "New county tax goes into effect; locals are outraged, June 11, 2009, LI Herald, Accessed Aug. 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]