["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Dick Durbin, D-Ill., at rally in support of Deferred Action for Childhood Arrivals outside the Capitol, Jan. 21, 2018, in Washington. (AP)", "Sens. Dick Durbin and Lindsey Graham introduced the Dream Act of 2021, legislation to help certain immigrants who came to the U.S. illegally as children.", "The Center for American Progress, a liberal think tank, estimated that there are 202,500 recipients of Deferred Action for Childhood Arrivals who work in essential jobs amid the pandemic. The number includes 29,000 who are frontline health care workers, and 12,700 in the healthcare industry holding jobs such as custodians, food preparers and management.", "For two decades, U.S. Sen. Dick Durbin, D-Ill., has advocated for passing the Dream Act to grant legal status to certain immigrants brought to the U.S. illegally as children. As he made his case for the 2021 version of the bill, Durbin cited the role of these immigrants as workers in essential sectors.", "\"In the midst of the COVID-19 pandemic, more than 200,000 DACA recipients are essential infrastructure workers,\" Durbin said during a Feb. 4 Senate floor speech, referring to the Obama-era Deferred Action for Childhood Arrivals program, which allowed these immigrants to stay in the country without fear of deportation.", "\"That’s not my term — that is the definition of the Department of Homeland Security under President Donald Trump,\" Durbin said. \"Among these essential workers are 41,700 DACA recipients in the healthcare industry: doctors, intensive care nurses, paramedics, respiratory therapists — all of them in a suspended immigration status because (the) Dream Act is still a bill, not a law.\"", "The number of DACA recipients who hold essential jobs during the pandemic has been a talking point for months among advocates of protecting these immigrants from deportation. A few think tanks — including one cited by Durbin — have tried to estimate their numbers, using varying criteria. Their estimates range from the tens of thousands to as many as 361,000.", "For two decades, Democrats and Republicans in Congress have crafted versions of legislation, sometimes called the Dream Act, that would offer a path to citizenship for immigrants who came here illegally as children. But despite bipartisan enthusiasm in Congress, the bills have stalled.", "In 2012, the Obama administration created DACA as an administrative program to protect these immigrants from deportation, as long as they reapplied every two years and met certain requirements. The Trump administration tried to rescind the program, but encountered legal hurdles. On his first day in office, President Joe Biden issued a memorandum directing federal officials to preserve DACA. There were about 641,000 active DACA recipients as of September.", "Durbin and Sen. Lindsey Graham, R-S.C., introduced the Dream Act of 2021 to allow certain immigrants to earn lawful permanent residence and eventually citizenship if they meet conditions, including passing background checks, and pursue higher education, work lawfully for at least three years, or serve in the military.", "Durbin’s spokesperson said his statistics about essential workers came from an April 2020 report about the demographics of DACA recipients by the Center for American Progress, a liberal public policy research and advocacy organization.", "CAP drew from a March 2020 memo by the DHS’s Cybersecurity and Infrastructure Security Agency identifying essential critical infrastructure workers during the pandemic.", "The analysis by CAP included workers in health care, education and food-related jobs, although CISA’s list also included jobs in other areas such as transportation. CAP also drew on its own analysis of Census data to estimate how many people were DACA recipients, and looked at Bureau of Labor Statistics occupational classifications to come up with its employment numbers.", "\"Across the country, 202,500 DACA recipients are working to protect the health and safety of Americans as the country confronts COVID-19,\" the report stated. \"They are ensuring that children are still being educated; food is still being grown, packaged, cooked, shipped, and put on the shelves of grocery stores; patients are being cared for; and much more.\"", "CAP found that 29,000 DACA recipients are frontline health care workers, while an additional 12,700 work in the healthcare industry as custodians, food preparers ormanagers, among other jobs. Durbin arrived at his figure of 41,700 by adding those two groups.", "We sent the CAP report to the Center for Immigration Studies, a group that advocates for low levels of immigration. Steve Camarota, the group’s director of research, said that some of those CAP counted as health care workers are not on the frontlines of the pandemic, such as dental assistants or technologists or technicians for veterinarians or ophthalmologists.", "\"Honorable work to be sure, but not vital to fighting COVID,\" Camarota said.", "CAP said its analysis includes 6,000 health technologists or technicians, including dietetic technicians, pharmacy technicians, psychiatric technicians, surgical technologists, veterinary technologists and technicians, and ophthalmic medical technicians.", "But CAP’s numbers aren’t out of line with other groups that have come up with estimates of DACA recipients who work in essential industries:", "The Migration Policy Institute, a nonpartisan think tank, concluded that there were between 72,000 and 361,000 essential workers among DACA participants in 2020. The range is based on various definitions of essential industries.", "The Center for Migration Studies, a nonpartisan think tank devoted to studying international migration, concluded there were about 43,500 DACA recipients in health care and social assistance industries and tens of thousands in other essential industries including transportation, warehousing, retail, manufacturing and waste management.", "The New American Economy, a bipartisan group of mayors and business leaders that seeks an overhaul of national immigration policy, found there were 62,600 DACA-eligible individuals in healthcare.", "Durbin said \"More than 200,000 DACA recipients are essential infrastructure workers\" including \"41,700 DACA recipients in the healthcare industry.\"", "Durbin was drawing from an April 2020 report from the liberal Center for American Progress. The statistics come with some caveats, including that they are estimates and include a broad swath of workers in healthcare, including some who aren’t on the front lines of treating COVID-19 patients. Even so, the numbers he cited are lower than some estimates by other groups.", "We rate this statement Mostly True.", "U.S. Sen. Dick Durbin, Twenty Years Since it was First Introduced, Durbin Calls on the Senate to Finally Pass the Dream Act, Feb. 4, 2021", "U.S. Sen. Dick Durbin press release, Durbin: We Must Protect The Immigrant Health Heroes On The Frontlines Of COVID-19 Pandemic, May 21, 2020", "U.S. Citizenship and Immigration Services, Approximate active DACA recipients, Sept. 30, 2020", "Center for American Progress, A Demographic Profile of DACA Recipients on the Frontlines of the Coronavirus Response, April 2020", "Migration Policy Institute, \"Back on the Table: U.S. Legalization and the Unauthorized Immigrant Groups That Could Factor in the Debate,\" February 2021", "Center for Migration Studies, DACA Recipients are Essential Workers and Part of the Front-line Response to the COVID-19 Pandemic, as Supreme Court Decision Looms, 2020", "New American Economy, Undocumented Immigrants and the Covid-19 Crisis, April 4, 2020", "White House, Preserving and Fortifying Deferred Action for Childhood Arrivals (DACA) Jan. 20, 2021", "PolitiFact, Did Obama say he didn't have the right to issue DACA? Jan. 9, 2018", "PolitiFact, Republicans and Democrats claim to support Dreamers. So why can’t they pass a law? July 25, 2020", "PolitiFact, Federal court orders Trump administration to fully reinstate DACA, Jan. 4, 2021", "Email interview, Emily Hampsten, U.S. Sen. Richard J. Durbin spokesperson, Feb. 4, 2021", "Email interview, Alex Nowrasteh, CATO Institute director of immigration studies, Feb. 5, 2021", "Telephone interview,  Nicole Prchal Svajlenka, Center for American Progress, Associate Director, Research, Feb. 5, 2021", "Email interview, Steven Camarota, Director of Research for the Center for Immigration Studies, Feb. 5, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]