["About this rating", "The funds listed for Australia, Canada, Denmark, France, Germany, Ireland, and U.K. accurately show how each country is supporting their respective workforces, notwithstanding currency conversion changes. The U.S. numbers reflect a one-time stimulus check payment for qualifying individuals.", "However, the meme presents an apples-to-oranges comparison. While it shows other countries’ relief funds for workers, the U.S. numbers reflect a one-time stimulus payment that does not account for unemployment benefits that have been boosted during the pandemic.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 pandemic ravaged the global economy in 2020, resulting in growing unemployment, governments scrambled to support people and businesses to varying degrees, announcing a range of stimulus relief funds meant to help struggling businesses and furloughed employees. By December 2020, lawmakers in the U.S. were also running out of time to pass another major coronavirus relief package.", "A meme began circulating in late 2020 that compared the U.S. government’s stimulus checks -- given to a significant portion of the U.S. population -- to coronavirus relief funds deployed around the world. The meme effectively argued that the U.S. was not giving enough money to support workers compared with other countries. We broke down the numbers below and learned that, while the numbers are largely accurate, the meme was comparing apples to oranges.", "Below are the respective stimulus relief funds being provided to populations around the world, particularly across Europe, Australia, and the U.K.", "In March 2020, the Australian government outlined a plan to subsidize the wages of 6 million people in order to keep them in their jobs. The plan would pay employees at any company that saw a 30% reduction in revenue around $1,500 Australian dollars (the equivalent of $928 U.S. dollars according to Reuters) every two weeks.", "This calculation would amount to $1,856 U.S. dollars per month. But according to conversion rates calculated by Newsweek in April, the relief check amounted to around $1,993 per month. Based on current conversion rates calculated on Google Finance, this same amount would now be more than $2,200 every four weeks.", "Australia also had a number of other social security measures including one-off Economic Support Payments of AU$750 in April and July 2020 to qualifying recipients.", "The Canadian government provides $500 Canadian dollars per week for up to 26 weeks for workers who stopped working or had their income reduced by at least 50% due to COVID-19. Based on current conversion rates on Google, this amounts to around $1,565 U.S. dollars per month. The meme presumably pulled their data from Newsweek's April 2020 story, which calculated the amount as being $1,433 U.S. dollars per month at that time.", "Overall, the Canadian government aims to spend up to $75 billion U.S. dollars in emergency aid and economic stimulus to assist members of their population who are struggling financially. Measures include boosting child benefit payments, wage subsidies for small businesses, and tax relief measures.", "The Danish government will cover up to 75% of employee salaries in private companies as long as those companies agree to not fire people. According to Flemming Larsen, a professor at the Center for Labor Market Research at Denmark’s Aalborg University, this would amount to up to $3,288 per month (roughly based on the conversion rate at the time of the interview), which lines up with the number in the meme. For hourly workers who qualify, the government would cover 90% of their wages.", "The deal, which was struck between the government and trade unions, covers companies who have to lay off at least 30% of their staff, or 50 staff or more. But this particular form of coverage does not support the self-employed and other vulnerable groups.", "According to The Guardian, more than 12 million people in France are covered by a partial unemployment scheme that covers 70% of salaries when companies are forced to reduce or suspend work, which is up to 6,927 euros per month (which according to Newsweek’s calculations in April were $7,575 U.S. dollars, but around $8,400 today). Employees previously on minimum wage receive 100% coverage of their salaries.", "The French government is also giving paid leave to parents who cannot work from home and who are responsible for children younger than 16.", "The German scheme covers 10 million workers according to The Guardian, paying up to 67% of net wages lost due to shorter hours, to a maximum of 6,700 euros per month (again, $7,326.78 U.S. dollars in April according to Newsweek, but $8,125 today) for employees with children and 60% for those without children.", "The budget also includes a 50 billion euro program to help the self-employed and small businesses threatened with bankruptcy, giving them direct payments of up to 15,000 euros (more than $18,000).", "Ireland’s temporary wage subsidy scheme allows affected companies to recoup up to 70% of their net income up to 21,400 euros until May. After May 4, 2020, the scheme became more generous, paying an 85% subsidy up to the same amount.", "After May 4, employees would be given a maximum of 350 euros per week if they earned less than or equal to 412 euros per week, and they would receive a maximum of 410 euros per week if they earned between 500 and 586 euros per week. 410 euros amounted to $448.36 U.S. dollars per week according to Newsweek in April, which matches up with the meme’s calculation of $1793.44. Today that amounts to around $1,987.", "The Coronavirus Job Retention Scheme reimburses companies for 80% of their gross salaries up to 2,500 pounds per month (which amounts to around $3,300 U.S. dollars today, and according to Newsweek was $3,084 in April). As of August, some workers were able to return to their jobs part-time, and in November the government extended the scheme until March 31, 2021.", "The U.S. government did indeed give many qualifying people a one-time stimulus relief check of $1,200, which on the surface appears to be to a small fraction of what these other countries appear to be giving workers who are unemployed or in danger of being furloughed. This check was given to individual taxpayers who made less than $75,000 in adjusted gross income in 2018. They would receive between $600 and $1,200 with the highest earners getting the maximum payment.", "But this meme did not account for the overall stimulus package, including unemployment benefits and additional funds granted for dependents. The data from other countries showcased relief funds for helping the unemployed or preventing lay-offs, so the numbers were comparing two totally different items.", "The CARES Act, a $2 trillion dollar relief bill that was passed in March 2020, increased unemployment benefits and added $600 dollars per week from the federal government on top of whatever base amount workers received from their state. The legislation also added 13 weeks of unemployment insurance. However, many of the provisions from this expired in July. The Families First Coronavirus Response Act also expanded paid family and medical leave options for some workers. A new relief bill is being debated by congress, with Republicans and Democrats disagreeing over how much stimulus the U.S. economy needs.", "Given that the numbers cited in the meme compare very different stimulus packages around the world, with a range of complex provisions, to a one-time payment in the U.S. that does not reflect the full stimulus relief package, we rate this claim a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]