["A video of a man and a woman paraded naked while a crowd records their video is circulating on social media. Hushyar Singh Meena (@HushyarMeenaIN) who identifies as ABVP Jaipur state secretary posted the video on June 26 and wrote, “It is being said that this incident took place in Deoria’s Sakrapar. Son and daughter of a Dalit were stripped naked and beaten. The youth were beaten only because they did not come on time to cut the harvest. The accused should be punished irrespective of where this video is from.” Alt News is refraining from embedding the video in this article due to its distressing nature. A screenshot has been attached below.", "[Translated from: ये देवरिया के सकरापार कि घटना बताई है. दलित के लड़के और लड़की को निर्वस्त्र कर मार रहे है. फसल काटने नही आए सिर्फ इसलिए युवक और युवती को निर्दयता से निर्वस्त्र कर पिटाई की गई. ये वीडियो कही का भी हो दोषियों के खिलाफ कार्यवाही होनी चाहिए.]", "The clip is circulating on Facebook and Alt News has also received several fact-check requests.", "This video dates back to April 2017. Alt News has already debunked it in the past. As reported by Hindustan Times, the incident took place in Shambhupura village in Banswara district of Rajasthan. After a Khap like diktat was issued, Kachru (20) and his cousin with whom he was allegedly in a relationship were thrashed and paraded naked in the village. Both the victims belonged to the Bhil tribal community of Rajasthan.", "“The police said that a case has been registered under relevant sections of the IPC and the Information Technology act against five individuals and around 10-12 unidentified persons,” added the report.", "During a Mirror Now broadcast, SP Anand Kumar stated, “A girl and a boy from the same family eloped a few days earlier. Since it was a family affair, they did not inform the police and began a search operation on their own. They were eventually found in Gujarat yesterday, and around 10-11 am they were brought back to the village. No one was informed and they were stripped and thrashed. No one was aware of the incident and the boy was returned to his family while the girl was married off immediately. A WhatsApp video and photos came to the fore, after which the SHO went to the village and spoke to the sarpanch. No one was willing to talk initially but after digging a little it was found that the incident indeed took place. The police traced the boy and has taken him in confidence. He was reluctant to give details at first but eventually filed an FIR. ”", "Therefore, a video of a 2017 incident from Rajasthan was revived with the false claim that a girl and boy from a Dalit family were mercilessly thrashed. However, this was a case of honour-based violence as the couple, who were relatives, eloped together.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]