["About this rating", "On 20 April 2019, the verified Facebook page belonging to the non-profit organization Turning Point USA posted a meme containing a statement falsely attributed to George Washington.", "The statement attributed to the first U.S. president reads, \"Firearms stand next in importance to the Constitution itself. Firearms are the American people's liberty teeth and keystone under independence.\" Much like the cherry tree legend about him, however, the quote appears to be a fabrication.\n\nThe statement, which is often referred to as the \"liberty teeth\" quote, is listed by Mount Vernon (Washington's historical estate) under \"spurious quotations\" attributed to Washington. It \"does not show up in any of Washington's writings, nor does any closely related quote,\" per the estate.", "Nevertheless, the quote gets trotted out with some regularity. In 2013 the progressive media watchdog organization Fairness and Accuracy in Reporting (FAIR) noted it was employed in a Playboy magazine article as far back as 1995, and was thus the subject of a subsequent retraction. The quote was also one of several erroneous ones included in the language of a Washington state bill dubbed the \"firearms civil rights act\" in 2016.", "One of the most famous myths about the first president is probably the story of the cherry tree. In the story, a young Washington takes a hatchet to a cherry tree. When confronted about it by his father, the boy says, \"I cannot tell a lie\" and confesses. Although the tale is meant to demonstrate the virtue of honesty, it is an invention of biographer Mason Locke Weems. The Mount Vernon estate notes that \"Weems’ biography, The Life of Washington, was first published in 1800 and was an instant bestseller. However the cherry tree myth did not appear until the book’s fifth edition was published in 1806.\"", "Santos, Melissa. \"Fake Founding Fathers Quotes Make Their Way Into Gun Bill in Washington.\"\r\n  Sacramento Bee. 6 February 2016.", "Rendall, Steve. \"George Washington on Guns…According to Sean Hannity.\"\r\n  FAIR. 9 January 2013.", "Mount Vernon. \"Spurious Quotations.\"", "Mount Vernon. \"Cherry Tree Myth.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]