["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Dontre Hamilton (left) was shot to death by Milwaukee police officer Christopher Manney after a confrontation in a downtown Milwaukee park.", "The disproportionate incarceration of black males was posed by a Facebook user during the Feb. 11, 2016 Democratic presidential debate, which was hosted by PBS in Milwaukee.", "U.S. Sen. Bernie Sanders responded to the question first. When former Secretary of State Hillary Clinton followed, she made a claim about the 2014 death of a black man at the hands of a white Milwaukee police officer that we want to check.", "Clinton, after alluding to a statistic cited by the questioner, said:", "\"And we know of the tragic, terrible event that led to the death of Dontre Hamilton right here in Milwaukee. A young man, unarmed, who should still be with us. His family certainly believes that. And so do I.\"", "The key word in Clinton’s claim, of course, is unarmed.", "We found this to be one of the more difficult claims we have rated.", "Moments before he was shot to death by the officer, Hamilton had taken the officer’s baton and struck the officer with it.", "But Hamilton, who was mentally ill, had no weapon when he was rousted by the officer shortly after two other officers had allowed Hamilton to continue sleeping in a park.", "In that sense, Hamilton was armed only after he had been struck.", "Sequence of events", "Diagnosed with schizophrenia, Hamilton, 31, was described as having long suffered from mental illness, including making a suicide attempt the year before his death. He had a history of encounters with Milwaukee police, but no convictions for any violent crimes.", "Hamilton was shot to death April 30, 2014 after police were called to Red Arrow Park in downtown Milwaukee.", "Here’s an overview of the incident, based on a report by Milwaukee County District Attorney John Chisholm. Chisholm’s report was based on an investigation done by a division of the Madison-based Wisconsin Department of Justice and a review by Emanuel Kapelsohn of the Peregrine Corp. in Pennsylvania, whom Chisholm cited as a leading national expert in use-of-force reviews.", "First police contacts: Shortly before 2 p.m., an employee of the Starbucks located at Red Arrow Park called police about Hamilton, who was sleeping in the park. The call was classified as a \"welfare check\" -- in other words, to check if Hamilton was OK. A desk sergeant called downtown officer Christopher Manney’s cell phone and left a voicemail message, saying he wanted Manney to go to the park about \"a homeless guy sleeping\" there.", "Manney, a 38-year-old, 13-year veteran of the department, was working another call downtown. Because he didn’t immediately respond to the voicemail, the Starbucks call was referred to a dispatcher, who then dispatched two other officers to the park. They found Hamilton lying on his back with his eyes closed. They nudged Hamilton, he got up and provided identification; he said he was taking a nap and was all right. The officers left, since Hamilton was not disturbing anyone, according to the report.", "About 2:10 p.m., another call to police about Hamilton came from Starbucks. The two officers went to Starbucks and told the employees Hamilton was not doing anything wrong. The officers left shortly before 3 p.m.", "So, at this point, police had no concerns that Hamilton was armed or dangerous.", "Manney responds: Just before 3:30 p.m., Manney listened to the voicemail. He called dispatch and asked if there was an assignment for Red Arrow Park. Told there was not, Manney asked, according to the report, \"that he be recorded as responding to a trouble with subject\" call, and he went to the park. He apparently was not aware the other officers had preceded him.", "Manney approached Hamilton, who was lying down, helped him up and then began to pat him down. Hamilton resisted. Witnesses told police that Manney, who was yelling commands at Hamilton, struck Hamilton one or more times with his baton before Hamilton took the baton and struck Manney with it one or more times, according to the report.", "The witnesses said Hamilton was holding the baton -- one said menacingly --  when Manney fired his service weapon. It was determined that Manney fired the gun 14 times, resulting in 15 gunshot wounds to Hamilton.", "So, Hamilton had no weapon when Manney approached him. He was armed, with Manney’s baton, only after Manney struck him with the baton.", "It’s worth noting that Flynn said, when he later fired Manney, that \"officer-created jeopardy is a term that has real meaning in the training circles of police departments around the country.\" He said officers, in their use-of-force training, \"are taught not to create circumstances that place them at a situation where they have no choice.\"", "(Chisholm opted not to file criminal charges against Manney, saying Manney's use of force was justified self-defense.)", "Our rating", "Clinton said Hamilton, who was killed during a confrontation with Milwaukee police officer Christopher Manney, was \"unarmed.\"", "Hamilton had no weapon when he was confronted by Manney. After Manney rousted Hamilton and began patting him down, a struggle ensued and Manney used his baton to strike Hamilton. Only then did Hamilton take the baton and strike Manney. That’s when Manney shot and killed Hamilton.", "Clinton’s statement is accurate, but needs clarification. That’s our definition of Mostly True.", "More on police use of force", "Milwaukee Police Chief Edward Flynn said that in 2012, there were nearly 12.2 million arrests and only 410 \"uses of deadly force\" by police in the United States. Our rating was Mostly True. Flynn correctly quoted FBI statistics on arrests and justifiable homicides by law enforcement officers, although the 410 appeared to be an undercount of the number of people killed.", "PolitiFact National rated Half True a claim by National Urban League president Marc Morial, who said: \"The number of killings of citizens by police is at a two-decade high.\" The former New Orleans mayor also cited FBI figures. But only a fraction of law enforcement agencies provide such data to the FBI, and the agencies that file the reports change from year to year, complicating comparisons.", "Conservative Michael Medved, a nationally syndicated radio talk show host, said: \"More whites than blacks are victims of deadly police shootings.\" That earned a Half True from our partners at PunditFact. In absolute terms, the claim was accurate. But when comparing death rates, blacks are about three times more likely than whites to die in a confrontation with police.", "PBS, video of Democratic presidential debate (at 22:20), Feb. 11, 2016", "Washington Post, annotated transcript of Democratic presidential debate, Feb. 11, 2016", "Email exchange, Milwaukee police Capt. Mark Stanmeyer, Feb. 15, 2016", "Email exchange, Hillary Clinton campaign spokesman Josh Schwerin, Feb. 15, 2016", "Milwaukee Journal Sentinel, \"Dontre Hamilton shooting, investigations and protests (interactive timeline),\" Dec. 22, 2014", "Milwaukee County District Attorney John Chisholm, report on Dontre Hamilton death, Dec. 20, 2014", "Wisconsin Division of Criminal Investigation, report on Dontre Hamilton death, Sept. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]