["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this April 22, 2020 file photo President Donald Trump watches as Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, speaks about the coronavirus at the White House in Washington. (AP)", "Anthony Fauci is the director of the National Institute of Allergy and Infectious Diseases. He wasn’t on Microsoft’s board of directors — a claim we recently debunked. But more misinformation abounds, and one Facebook post pads his resume with some new positions.", "\"Whoa!\" the May 12 Facebook post says. \"Dr Fauci was on Clinton Foundation Board for 20 yrs? Currently serves on Gates Foundation? #InvestigateFauci\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Brian Cookstra, a spokesperson for the Clinton Foundation, told PolitiFact that Fauci has never served on the board in any capacity. He’s not listed among the current board members, which you can see here, nor did we find any credible news stories or sources online that identify him as a former board member.", "Fauci also is not listed among the leadership team members on the Bill & Melinda Gates Foundation website, including the executive leadership team headed by Bill and Melinda Gates and the global health division. He also isn’t listed on the Scientific Advisory Committee.", "From 2003-10 Fauci, among 21 other scientists, served on a Gates Foundation scientific board to \"guide and direct\" a new initiative to \"identify critical scientific challenges in global health and increase research on diseases that cause millions of deaths in the developing world.\" The Grand Challenges in Global Health Initiative was aimed at AIDS, malaria and other diseases, and Gates announced at the time that it would be administered by the Foundation for the National Institutes of Health, which agreed to provide scientific advice and support. The board that Fauci belonged to was formed to determine what \"grand challenges\" in global health could help thwart disease if they were solved. The initiative then provided grants to scientists around the world to look for solutions to the challenges.", "But we found nothing to support what the Facebook post alleges.", "We rate it False.", "Facebook post, May 12, 2020", "PolitiFact, No, Anthony Fauci wasn’t on Microsoft’s board of directors, May 11, 2020", "Clinton Foundation, Board of directors, visited May 18, 2020", "Bill & Melinda Gates Foundation, Leadership, visited May 18, 2020", "Bill & Melinda Gates Foundation, Scientific advisory committee, visited May 18, 2020", "Bill & Melinda Gates Foundation, Global Grand Challenges scientific board, visited May 18, 2020", "Bill & Melinda Gates Foundation, $200 million grant to accelerate research on ‘grand challenges’ in global health, January 2003", "Email interview with Brian Cookstra, director communications, Clinton Foundation, May 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]