["The photo was published here on Facebook on February 27, 2020. It has been shared more than 500 times.", "Below is a screenshot of the misleading post:", "The post's Hindi-language caption translates to English as: “Those who shout the slogans of ‘Jai Bhim and Jai Meem’ to show unity between Muslims and lower caste Hindus, they have broken the statue of Dr Ambedkar in violence in Delhi’s Seelampur locality.”", "“Jai Bhim and Jai Meem” is a slogan often used by Islamic political parties in India to express unity between the lower caste Hindus and Muslims, as stated in this report by the Indian newspaper Deccan Chronicle.", "Dr. Bhimrao Ambedkar was the primary author of the Indian constitution and India’s first Minister of Law and Justice. Born a Dalit, the lowest social classification in the Hindu caste system, he was also a revered civil rights leader.", "Delhi has experienced its worst sectarian violence in decades, triggered by a new citizenship law which critics say discriminates against Muslims. More than 42 people have been killed and hundreds injured in the violence after it broke out on February 23, 2020. Here is an AFP report on the clashes.", "The photo was also shared alongside a similar claim here, here and here on Facebook; and here and here on Twitter.", "The claim is false.", "Mahesh Pal, a local police officer, told AFP that the photo in the misleading post was taken in the Karaundi Kala area of Uttar Pradesh.", "“The statue is in a park in Karaundi Kala and was damaged on February 25, 2020,\" he said during a phone interview on March 3, 2020. \"We have not made any arrests and our investigation is on, though we suspect some children while playing cricket in the park have broken it.”", "The photo was also published on Twitter here on February 25, 2020. The tweet, which includes another photo of the broken statue taken from a different angle, also states that the incident occurred in Karaundi Kala.", "कल दिनांक 25/2/2020 को ग्राम सभा कटघर, में बाबा साहेब की प्रतिमा कुछ सरारती तत्वों द्वारा तोड़ी गई है आपसे निवेदन है कृपया ऊचित कार्यवाही करें। @Uppolice@112UttarPradesh @dgpup\n\t\tग्राम सभा कटघर, चौहान थाना करौदी कला, कादीपुर, सुलतानपुर उत्तर प्रदेश। pic.twitter.com/MrGTx6I3k1", "Local police responded to the tweet here, stating police action was taken following the incident.", "उक्त प्रकरण में प्रभारी निरीक्षक करौदीकलां द्वारा अवगत कराया गया कि मुकदमा पंजीकृत कर वैधानिक कार्यवाही की जा रही है ।", "The tweet from Sultanpur police translates to English as: “In the above mentioned case, the inspector in Karaundi Kala was informed and a police case is being registered in this regard.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]