["About this rating", "In January 2020, videos supposedly showing people collapsing on the street due to \"coronavirus\" started to circulate on social media. One example that garnered more than 1.2 million views (since removed) is viewable on the Internet Archive's Wayback Machine.", "These videos have been published by a number of tabloids, such as The Daily Mail and The Sun, but not much information about what they show has been confirmed. At the moment, these videos have not been definitively linked to the new coronavirus.", "We reached out to the World Health Organization (WHO) for more information about these videos. While they didn't provide information about any specific footage, they did say that \"sudden collapses\" from the coronavirus would be \"atypical.\"", "Here are a few other videos shared in January 2020 with captions insinuating they showed people infected with the coronavirus collapsing on the street:", "When we examine viral footage like this, one of the first things we do is try to trace the footage back to its source. If we find that the video was circulating before the event it supposedly shows, we can determine that the video was recaptioned and is being shared out of context. In this case, however, we were unable to trace these videos back to a date before the discovery of the coronavirus.", "It appears that these videos were truly taken in January 2020 in various locations around China. According to social media reports, these videos first started circulating on apps such as TikTok and were originally posted by random citizens who had witnessed these events. However, that does not mean that the people featured in this video were infected with this virus.", "If we strip the above-displayed videos of their captions, we can take a look purely at what the videos show. In one case, it looks like a person was the victim of a traffic accident. In another, it appears that a man suffered a head injury. But since these videos appeared online during heightened hysteria about an outbreak of an illness, it's easy to see how a passerby may have made the assumption that these incidents were connected to the coronavirus.", "WHO explained that the coronavirus is a respiratory illness with symptoms such as \"fever, cough, shortness of breath, and breathing difficulties.\" A WHO official also told us that \"sudden collapses\" would be \"atypical\" for this disease. While we have not been able to definitively determine what these videos show, it seems unlikely that these people collapsed on the street due to coronavirus.", "On Jan. 30, 2020, the World Health Organization declared the new coronavirus as a public health emergency:", "The new coronavirus has been declared a global emergency by the World Health Organization, as the outbreak continues to spread outside China.", "\"The main reason for this declaration is not what is happening in China but what is happening in other countries,\" said WHO chief Tedros Adhanom Ghebreyesus.", "The concern is that it could spread to countries with weaker health systems.", "The death toll now stands at 170 people in China.", "The WHO said there had been 98 cases in 18 countries outside of the country, but no deaths.", "Learn more about the outbreak of coronavirus here.", "BBC.   \"Coronavirus Declared Global Health Emergency by WHO.\"     30 January 2020.", "Boseley, Sarah; Devlin, Hannah; Belam, Martin.   \"What is Coronavirus and How Worried Should We Be?\"     The Guardian.   30 January 2020.", "BBC.   \"Coronavirus: A Visual Guide to the Outbreak.\"     22 January 2020.", "Christensen, Jen.   \"Coronavirus Explained: What You Need to Know.\"     CNN.   22 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]