["As some experts have advised Americans to wear higher-quality or multiple face masks to protect against the coronavirus, a recent blog post that’s spreading widely on social media claims the World Health Organization says no masks are necessary.", "\"WHO now saying you do not need to wear a mask,\" reads the headline on a Jan. 25 post on a blog titled \"Did You Know.\"", "The post further claims that the WHO said on Jan. 22 that \"there is no scientific medical reason for any healthy person to wear a mask outside of a hospital.\" It links to what it says is \"the video of the press announcement\" on the WHO’s website.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "After reviewing a transcript of the press conference cited, we didn’t find evidence to support the claim that the WHO said people don’t need to wear masks.", "Rather, Dr. Maria Van Kerkhove, an infectious-disease epidemiologist and COVID-19 technical lead for the WHO, said that \"masks are one aspect of control, one aspect of reducing the spread of this virus, and they can’t be used alone.\"", "\"We need to emphasize that, because not one solution is enough,\" she said. \"Not masks alone, not physical distancing, not hand hygiene.\"", "Later, she said, \"within our guidance itself it is also worth noting that the use of fabric masks, we recommend a three-layer mask and in our guidance materials we have recommendations on the specifications for filtration, for example — what the type of fabric should be for the inner layer, the middle layer and the outer layer. Not all fabric masks are the same and so they need to be produced and made so that they provide the right type of protection and source control.\"", "A page on the WHO’s website that was last updated on Dec. 1 offers guidance on when, where and why people should wear masks, which the site describes as \"a key measure to suppress transmission and save lives.\"", "The WHO recommends medical masks for health workers in clinical settings, anyone feeling unwell, people waiting for COVID-19 test results, people caring for someone with a confirmed or suspected case of COVID-19, people 60 and older, and people with underlying health conditions.", "For everyone else in the general public, non-medical fabric face coverings are OK, according to the WHO.", "We rate this blog post False.", "The Washington Post, Time to double up or upgrade masks as coronavirus variants emerge, experts say, Jan. 28, 2021", "Did You Know, WHO now saying you do not need to wear a mask, Jan. 25, 2021", "World Health Organization press conference, Jan. 22, 2021", "World Health Organization, COVID-19 virtual press conference transcript - 22 January 2021, Jan. 22, 2021", "World Health Organization, Coronavirus disease (COVID-19): Masks, last updated Dec. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]