["About this rating", "With Puerto Rico experiencing a humanitarian and infrastructural crisis in the aftermath of a series of hurricanes, a flurry of stories appeared at the end of September 2017 falsely claiming that a local union representing truck drivers had gone on strike, using the devastation to leverage an improvement in their pay and working conditions.", "On 30 September 2017, the Conservative Treehouse blog quoted extensively (but selectively) from comments given to the Huffington Post by United States Air Force Colonel Michael Valle:", "“The aid is getting to Puerto Rico. The problem is distribution. The federal government has sent us a lot of help; moving those supplies, in particular, fuel, is the issue right now,” says Col. Valle. Until power can be restored, generators are critical for hospitals and shelter facilities and more. But, and it’s a big but, they can’t get the fuel to run the generators.", "They have the generators, water, food, medicine, and fuel on the ground, yet the supplies are not moving across the island as quickly as they’re needed.", "\"It's a lack of drivers for the transport trucks, the 18 wheelers. Supplies we have. Trucks we have. There are ships full of supplies backed up in the ports, waiting to have a vehicle to unload into. However, only 20% of the truck drivers show up to work. These are private citizens in Puerto Rico, paid by companies that are contracted by the government,\" says Col. Valle.", "The Conservative Treehouse then went on to claim, again falsely, that the cause of this shortfall in truck drivers was a deliberate, coordinated strike action by the local Teamsters union. Similar claims were also made by the Gateway Pundit and entrepreneur Kambree Kawahine Koa.", "The International Brotherhood of Teamsters rejected these claims entirely, telling us the reports were \"fake news\" and adding that the Teamsters Local 901 in Puerto Rico was \"doing everything but refuse to help\" in relief efforts.", "In a statement, Teamsters General President Jim Hoffa called the reports \"nothing but lies\":", "These viral stories spreading across the internet are nothing but lies perpetrated by anti-union entities to further their destructive agenda. The fact that they are attempting to capitalize on the suffering of millions of citizens in Puerto Rico that are in dire need of our help by pushing these false stories, just exposes their true nature.", "On 29 September 2017, the International Brotherhood of Teamsters issued a plea for help to members throughout the mainland United States, describing the efforts being made by local truck drivers in Puerto Rico, in the face of infrastructural devastation:", "The Teamsters are doing what they can to improve the lives of our members there. That includes working with Joint Council 16 as well as Local 901 leadership in San Juan to identify ways how the union can help. The Teamsters are also joining together with labor unions from across the nation to identify skilled workers to travel to Puerto Rico next week to provide much needed support in critical areas.", "There is currently a need for volunteer truck drivers who hold a Commercial Driver’s License (CDL) to transport shipping containers from the port to distribution centers throughout the island. Additionally, the Teamsters Freight, Airline, Passenger Transport, Package, Public Services and Waste Divisions are contacting Teamster employers that operate in Puerto Rico and our local unions throughout the U.S. and Canada to identify avenues of support and volunteers.", "At this time, it is unclear if there are trucks available to move the containers, fuel to operate the trucks or road access to the distribution centers. However, the labor movement is working on the ground in Puerto Rico to bring volunteers to meet specific needs.", "Indeed, Colonel Michael Valle — one of the sources cited by the Conservative Treehouse — went on to tell the Huffington Post:", "There should be zero blame on the drivers. They can’t get to work, the infrastructure is destroyed, they can’t get fuel themselves, and they can’t call us for help because there’s no communication. The will of the people of Puerto Rico is off the charts. The truck drivers have families to take care of, many of them have no food or water. They have to take care of their family’s needs before they go off to work, and once they do go, they can’t call home. [Emphasis added].", "A CNBC report cited in the Conservative Treehouse post also undermines the claim that there was a strike. As the reporter explains:", "There are 3,000 cargo containers here at Crowley, one of the biggest shippers in Puerto Rico...Here's the problem - the truck drivers can't get to the terminal to get their containers out...You're looking at truck drivers who can't be reached by their businesses by cell phone, they don't have the gas to get to work, and then even when they do get to work, their semi-trucks don't have fuel. The problem is the supply chain.", "Contrary to all this, the Conservative Treehouse claims that the local Teamsters union, which the article (again, falsely) identifies as Frente Amplio, \"is refusing to move the product.\" A spokesperson for the International Brotherhood of Teamsters confirmed that Frente Amplio is an independent truck drivers' union in Puerto Rico and is not affiliated with the Teamsters in any way.", "In any event, the Conservative Treehouse cites a Wapa TV interview with Victor Rodriguez, President of Frente Amplio, as evidence of a strike by truck drivers. In fact, it is evidence of no such thing. In the interview, Rodriguez criticizes Puerto Rico's governor Ricardo Rosselló for a law he signed in April that changed how truck drivers obtain permits, but he does not declare strike action or a refusal to work on the part of Frente Amplio members. He says:", "The truckers are doing what they need to do. The one not doing what he needs to do is the governor.", "Rodriguez states that his organization had actually called off a planned strike before the arrival of Hurricane Irma, which caused widespread infrastructural damage to Puerto Rico in early September.", "The governor of Puerto Rico was lucky — three weeks before Irma there was going to be a strike because of the law he passed.", "At one point, Rodriguez does point to the power and leverage held by his members, saying:", "The power is with the truckers. If the truckers don't move, this country won't move for two years.", "However, he does not declare a strike or refusal to work and affirms \"the truckers are going to work,\" in this exchange with Wapa TV's Eliezer Ramos:", "Ramos: Are you telling me that truck drivers are not reporting to work because of a law?\nRodriguez: No, we're doing what we need to do.\nRamos: But you just said that because of a law -\nRodriguez: No, excuse me, the truckers are going to work, and I expect truck drivers in the country to keep working with the people, who made it possible for us to use the roads.", "Puerto Rico's Teamsters Local 901 are not on strike or refusing to work, and they are in fact pleading with truck drivers on the United States mainland to help in the distribution of fuel and supplies there.", "The Conservative Treehouse's claims about this are based on cherry-picked quotes from a United States Air Force Colonel and a CNBC reporter, both of whose full remarks make clear that truck drivers in Puerto Rico are hampered by severe problems with infrastructure and distribution, but are not refusing to work.", "On 2 October 2017, a government spokesperson also refuted the rumor in an interview posted by CBS News reporter David Begnaud on Twitter saying, \"Everyone's working and the supplies are getting to where they have to.\"", "Hayes, Penelope Jean.  \"U.S. Military on Puerto Rico: 'The Problem is Distribution\" and Here's Why.\"\r\n  Huffington Post.  29 September 2017.", "Hoft, Jim.  \"Smoking Gun: San Juan Teamsters Didn't Show Up for Work to Distribute Relief Supplies - U.S. Aid Rotting at Ports.\"\r\n  The Gateway Pundit.  30 September 2017.", "Munroe, Galen.  \"Teamsters Denounce False Reports of Work Stoppage by Union Drivers in Puerto Rico.\"\r\n  International Brotherhood of Teamsters.  2 October 2017.", "International Brotherhood of Teamsters.  \"P.R. Teamsters Need Your Assistance Now!\"\r\n  International Brotherhood of Teamsters.  29 September 2017.", "Updated [2 October 2017]: Updated with additional comment from a Puerto Rican government spokesperson in a CBS News interview.", "Arturo Garcia is a former writer for Snopes.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]