["About this rating", "In April 2016, an \"overly affectionate\" woman and a male companion were cited for operating an unlicensed ice cream truck and seat belt violations in Kansas City, Missouri.", "Police confirmed the duo were not kidnappers nor attempted abductors; the incident was the only one we could locate involving questionable ice cream trucks; we found no reports of chloroform-wielding Mr. Softee drivers.", "On 10 June 2016, the Facebook pages \"Trending Styles\" and \"Stylish Guru\" published links to a \"terrifying warning to all mothers of girls\". The linked page claimed people driving ice cream trucks are attempting to kidnap children using chloroform:", "Cases are being reported daily that its happening only to girls and that the Ice-cream truck has attempted to kidnap some girls but has failed due to the amount of people around. Chloroform is an organic compound with formula CHCl3. It is a colorless, sweet-smelling, dense liquid. It has been used before as a kidnapping agent where the criminal puts the cloth over its victims face and the person will then pass out. By using it in ice-cream it works 10 times faster and the girl is subject to being injured very badly due to falling and hitting her head. The ice-cream trucks that were reported to the police were said to have the writing ” Mr Ice Cream Man ” and another reported was ” Mr Softy “.", "Parents are advised to be with their children if they want to give them ice-cream as this is a very serious matter storming your area this summer. Please SHARE this with your friends and family and make sure it does not happen to you. Police are working on the matter to try and catch the perpetrators.", "The rumor lacked any evidence that any such thing had ever happened, much less was a daily occurrence. It also lacked dates, places, police departments involved, the origin of the warning, and links to news where such an act occurred. According to the rumor, ice cream truck drivers had attempted to kidnap \"some girls\" but failed because the \"amount of people around\" (also known as witnesses) prevented it.", "We looked for even one instance of a Mr. Softee truck targeting young girls with chloroform, but came up short. The image used to illustrate the post almost certainly didn't involve a Softee victim to the left, and the photograph to the right was a popular European stock image of an ice cream truck (unrelated to kidnappings or chloroform).", "In April 2016, a single incident involving an unlicensed ice cream truck made headlines in Kansas City, Missouri. On 4 April 2016, the outlet WDAF-TV reported on a mother's concern that an ice cream truck driver planned (not attempted) to kidnap her child:", "[Parent Rebecca]Gleason said she was in her kitchen and a neighbor was keeping an eye on several kids, including her two little ones, as they played in the yard.", "That’s when her son came inside to say a woman was offering his 4-year-old sister free ice cream.", "“Free anything out of a van is just not okay,” Gleason said. “So I immediately knew that that wasn`t right and I darted out my front door and there was a woman outside of this ice cream truck within arm’s reach, trying to grab my daughter, saying ‘Oh baby, come here. Come here,’ in a very uncomfortable, awkward way.”", "A 7 April 2016, a follow-up piece from the same outlet reported that police located the individuals operating the ice cream truck, and cited them for lacking a business license and seat belt violations (not kidnapping):", "After FOX 4’s first story aired, police were tracked down the people inside the truck and took them to jail. Kansas City police arrested Steven Buckle and Lana Moore, calling them \"possible burglary suspects.\"", "But they were later released and now just face municipal charges for operating a business without a license, unlawful riding and seat belt violations.", "The Kansas City Police Department told us that the truck's owners were not suspected in any attempted abductions. The police department representative described the female suspect as \"affectionate,\" but neither dangerous nor suspected of being a potential kidnapper.", "The ice cream truck/chloroform rumor wasn't the first story spread by the multitude of \"Stylish\" or \"Trending\" pages on Facebook. In June 2015, a similar page spread baseless rumors of Facebook scouting by kidnappers. Summer frequently ushers in an uptick of kidnap warnings on social media, many of which lead to additional reports based solely on escalating fears of abduction (but not an actual elevated risk).", "Banks, Katie.   \"Northland Mom Says Strange Woman Offering Free Ice Cream To Kids Causes Alarm.\"\r\n    WDAF-TV.   4 April 2016.", "Banks, Katie.   \"Suspicious Duo In Ice Cream Truck Face Charge Of Operating A Business Without A License.\"\r\n    WDAF-TV.   7 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]