["The image was published to Facebook here on April 2, 2019, where it has been shared more than 300 times, and also here on the same day.", "It shows Philippine Senator Juan Edgardo \"Sonny\" Angara pointing at the sleeve of fellow Senator Vicente \"Tito\" Sotto III.", "Here is Angara’s biography on the senate website. In the image he is standing on the left and Sotto, whose official biography is here, is on the right.", "Sotto’s sleeve is adorned with a large number \"8\" with the word \"DIRETSO!\" purportedly written below that.", "Below is a screenshot of one of the posts:", "Angara is running for reelection in May 2019 mid-term polls and has been endorsed by President Duterte, according to this article by the state-run Philippine News Agency.", "Meanwhile Sotto has expressed support for Duterte’s war on drugs, as reported here by major Philippine media organization ABS-CBN.", "The post's caption, translated to English, says: \"Simple endorsement for #OtsoDiretso\".", "Otso Diretso, which means \"Straight Eight\", is the campaign slogan of the eight senate candidates for the Liberal Party, the country's main opposition party. Here is the group's verified Facebook campaign page.", "A Google reverse image search found the image has been doctored from this photo posted on Angara's official Facebook account, dated March 7, 2019.", "The image below compares the photo in the misleading Facebook post (L) with the original image posted by Angara (R):", "The original photo shows Sotto wearing a shirt with a number \"8\" on its sleeve but without the word \"DIRETSO!\"", "The same photo was posted again on Angara’s Facebook page here on March 19, overlaid with a message from Sotto endorsing Angara.", "The first two lines of text on the photo, translated to English, say: “Make sure that we put Sonny Angara back in the Senate, #8 in the ballot, he has done a lot.”", "That post is embedded below:", "A sample official ballot appears here on a Philippine government website.", "It shows that Angara is number eight on the ballot in the May 13 vote, which covers local and national positions.", "Below is a screengrab of the sample ballot, with Angara's name circled in red:", "Comments such as the one below, with the user's identity redacted, indicate that some people believed the false post.", "Translated into English it says: \"Haha these turncoats are funny, they know Otso Diretso is strong that’s why they have the guts to endorse Big 8\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]