["Thousands of labourers and their families from across the country have embarked upon a journey on foot to their native villages because they are out of jobs and have run out of money. The restriction on public transportation has forced them to walk. Many have died on the way. On May 11, Financial Express reported that Indian Railways started special Shramik trains for migrant workers, tourists, pilgrims and students.", "A one-minute video of a mother and an infant travelling in a train has subsequently gone viral on WhatsApp. The mother is sitting on the lever of a moving train that connects two carriages. She has her child in her arms. Several people have requested Alt News to fact-check the viral video, on WhatsApp (+917600011160) and on our official Android application.", "A Facebook user also posted the viral video and questioned, “What is the condition of our country?”. It was shared over 600 times.", "हाय ये क्या हो रहा है हमारे देश में, फर्जी नेताओं शर्मनाक से डूब मरो", "Posted by Ritu Singh on Wednesday, May 13, 2020", "Alt News performed a keyword search and found that the viral video was uploaded by a YouTube user in 2016.", "As per the video title and description, the video is from Bangladesh.", "Using this as a clue, we looked for an image of Bangladesh Railways on Reuters and performed a visual comparison with a screenshot from the viral video. We found out that both the carriages have two off-white parallel lines — highlighted in red in the image below.", "Prior to our fact-check, Boomlive had published a report and found that the viral video was uploaded by Bangladeshi newspaper Prothom Alo’s YouTube channel on September 13, 2016. The Bangla caption of the video reads, “Eid means returning home physically or mentally (translated from ঈদ মানে বাড়ি ফেরা—সশরীরে বা মনে মনে).”", "In 2017, a YouTube user uploaded this on the occasion of mother’s day video, lauding the woman for travelling without a ticket.", "In 2018, UK-based newspaper Daily Mail (archive link) posted an article along with the viral video claiming it is from India.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]