["After Canada’s Prime Minister Justin Trudeau promised to ban assault rifles on December 6, disinformation on the topic flourished on social media. One item, shared thousands of times, is a screenshot of a United Nations document which looks authentic at first glance because it uses the international body’s visual identity for official reports.", "The “Disarmament Commission - Civilian Weapons Confiscation Study Group” document, dated August 2013, outlines a seven-step plan to confiscate all firearms from civilians, with the assistance of a newly created “United Nations Police Taskforce.”", "A keyword search found that the document had already circulated in the United States as far back as August 2013, the alleged date of the plan’s publication. The report resurfaced in late 2019 in Canada, including a post shared by a former People’s Party of Canada candidate in the central province of Saskatchewan.", "However, several details in the document suggest that it is not authentic. While the United Nations Office for Disarmament Affairs does exist, the Civilian Weapons Confiscation Study Group does not, John Ennis, a UNODA senior political affairs officer, told AFP.", "“This is a false claim that was debunked back in 2013,” Ennis said in a phone interview on December 12.", "The report’s identification number, A/CN.11/L.72, visible on the top right of the page, does not exist in the UN’s official document database.", "Certain versions of the screenshot feature a barcode on the bottom, numbered 12-53542 (E) 091012. If entered in the official document database or on Google, the barcode number turns out to be linked to an official October 2012 communication outlining the provisional agenda for a Disarmament Commission session to take place in New York in April 2013. The UN Disarmament Commission is a branch of UNODA.", "These details suggest the document shared on social media could have been forged using the 2012 provisional agenda as a template.", "The false report mentions that the confiscation plan exists within the framework of the global implementation of Agenda 21. Agenda 21 is a voluntary United Nations agreement that 178 governments, including Canada, adopted at the 1992 UN Conference on Environment and Development in Rio de Janeiro.", "It aims to ensure the sustainable development of the world by implementing anti-poverty measures, ensuring food safety and protecting the Earth’s resources. Agenda 21 is also at the heart of a conspiracy theory so tenacious that the Southern Poverty Law Center, a US non-profit organization which fights for civil rights, dedicated this entire report to it.", "Agenda 21 falls under the prerogative of the UN Commission on Sustainable Development, and as such is unrelated to arms regulations and the UNODA.", "UNODA’s mandate is to reduce the circulation of illegal light weapons, but the emphasis is placed on assisting national governments in combating the proliferation of those weapons.", "“Regulating civilian ownership of weapons is always a prerogative of national authorities,” Ennis told AFP, adding that “when the UN provides assistance to governments to stem the flow of illicit weapons, for instance through improved stockpile management, weapons marking or border controls, it does so only upon request of that government.”", "The US National Rifle Association, a lobby group for gun rights, also declared the memo “suspect” and “implausible” in a statement in 2013. They said, “Gun owners should resist the urge to forward, and thereby propagate, these rumors before verifying their authenticity.”", "While on the campaign trail before his re-election in October, Trudeau committed to banning “all military-style assault-rifles, including the AR-15,” and initiate a gun buyback program. According to his official platform, “A two-year amnesty will be put in place while the program is being set up.”", "On November 21, Bill Blair, the Minister of Border Security and Organized Crime Reduction, said that the ban would be implemented “as quickly as possible,” without providing a specific timeline.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]