["About this rating", "Devotees of the television sitcom \"The Big Bang Theory\" may recall a brief scene in which Raj Koothrappali expressed disdain that the power ring wielded by the Green Lantern superhero character was ineffective against objects that were yellow (modern Green Lantern) or objects that were made of wood (original Green Lantern), meaning that either version of the character could be thwarted \"by a No. 2 pencil\":", "https://youtu.be/Dx1y_sHfoMY\n\nSuch speculation may lie firmly within the realm of fictional characters from comic books and TV series, but in real life a youngster did in fact help subvert an anti-drug campaign via the use of a No. 2 pencil.", "In 1998, The Bureau for At-Risk Youth distributed pencils to schoolchildren bearing the anti-drug slogan \"Too Cool to Do Drugs\":", "However, according to news reports, a 10-year-old student pointed out that successive sharpenings of those writing implements modified the original slogan into various pro-drug versions, thereby prompting a recall of the pencils:", "A company is trying to erase an embarrassing mistake it made on pencils bearing an anti-drug message.", "The pencils carry the slogan: \"Too Cool to Do Drugs.\"But a sharp-eyed fourth-grader in northern New York noticed when the pencils are sharpened, the message turns into \"Cool to Do Drugs\" then simply \"Do Drugs.\"", "As a result of the discovery by 10-year-old Kodi Mosier of Ticonderoga Elementary School, the company, called The Bureau For At-Risk Youth of Plainview, recalled the pencils.", "\"We're actually a little embarrassed that we didn't notice that sooner,\" spokeswoman Darlene Clair told [the] Press-Republican of Plattsburgh.", "Reports at the time suggested the organization would be re-issuing the pencils with the slogan positioned in the opposite direction to eliminate the problem:", "A new batch of pencils will have the message written in the opposite direction, so when they are sharpened, they read \"Too Cool To Do\" and finally \"Too Cool.\"", "For pointing out the botched message, Moiser earned his class a letter of apology from the company and box full of T-shirts.", "Why does Kodi think the company didn't catch the mistake themselves?", "\"I guess they didn't sharpen their pencils,\" he said.", "The Associated Press.   \"Mistake on Anti-Drug Pencil.\"\r\n    11 December 1998.", "Sherman, Fraser.   \"15 Things You Never Knew About Green Lantern's Ring.\"\r\n    ScreenRant.   31 March 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]