["About this rating", "The Chick-fil-A Foundation's November 2019 announcement of a new charitable-donations strategy meant the Salvation Army and the Fellowship of Christian Athletes, both high-profile groups that have been criticized in the past as anti-LGBT, would no longer receive funding in 2020.", "However, the new donations strategy also meant several dozen other groups — with no anti-LGBT record — would not receive funding in 2020 either, and so the strategy does not appear to have been targeted specifically at the Salvation Army and the Fellowship of Christian Athletes. Further, Chick-fil-A has repeatedly declined to specify that the cut to the controversial groups' funding was linked to their LGBT-rights records, and a company spokesperson would not rule out the possibility that the groups could receive funding again in the future.", "In November 2019, we received multiple inquiries from readers about the accuracy of reports that the fast food giant Chick-fil-A had announced it would cut off donations to religious groups whose views and policies on LGBT rights have drawn criticism in the past.", "On Nov. 18, CNN published an article with the headline \"Chick-Fil-A Will No Longer Donate to Anti-LGBTQ Organizations,\" which reported that:", "\"Chick-fil-A is making major changes to its charitable foundation, ending donations to two organizations that have been criticized for being anti-LGBTQ. The fast food chain announced Monday that beginning next year it will only donate to a certain group of charities. That list no longer includes the Salvation Army and the Fellowship of Christian Athletes (FCA). Both organizations have taken controversial stands on homosexuality and same-sex marriage.\"", "CBS News posted an article with the headline \"Chick-Fil-A to Stop Donations to Some Charities After LGBT Protests,\" adding that:", "\"Chick-fil-A is shifting its charitable donations in the new year as the fast-food chain looks to avoid the spotlight that came with its history of financing evangelical groups that opposed LGBTQ rights, including same-sex marriage. The Atlanta-based company in 2020 plans to funnel more of its donations to fewer charities, targeting issues like homelessness, hunger and education, the Chick-fil-A Foundation said Monday.\"", "For its part, The Guardian published a story with the headline \"Chick-Fil-A Pulls Funding for Christian Groups Criticised for LGBT Stance.\"", "There were significant elements of truth to these reports. In November, Chick-fil-A did indeed announce a new charitable-donations strategy for 2020 and beyond, and that strategy no longer involves disbursing funding to groups such as the Salvation Army and the Fellowship of Christian Athletes, connections that have damaged the company's public image in some quarters.", "However, when asked by Snopes, a spokesperson for Chick-fil-A did not link the strategic shift to concerns over the LGBT-rights records of the groups in question, and would not rule out any group receiving funding in future, \"as long as they are highly effective in areas of hunger, homelessness and education.\"", "Furthermore, many news reports markedly failed to mention that the fast food company's change in approach to charitable donations did not appear to have been specifically targeted at Christian organizations perceived as anti-LGBT, and that in fact more than 80 groups — many of them with no religious affiliation — who received funding in 2019, would also no longer be funded.", "On Nov. 18, Chick-fil-A announced a new donations strategy for the Chick-fil-A Foundation, the company's official philanthropic arm. The statement read:", "\"Starting in 2020, the Chick-fil-A Foundation is introducing a more focused giving approach to provide additional clarity and impact with the causes it supports. Staying true to its mission of nourishing the potential in every child, the Chick-fil-A Foundation will deepen its giving to a smaller number of organizations working exclusively in the areas of education, homelessness and hunger.\"", "According to the statement, the new approach will involve the Foundation giving a total of $9 million to Junior Achievement USA, a K-12 educational non-profit; Covenant House International, a non-profit focused on youth homelessness; and donating $25,000 to a food bank in every location where Chick-fil-A opens a new restaurant.", "A company spokesperson confirmed that these would be the only charitable initiatives to which the Foundation would be contributing in 2020, meaning more than 80 other organizations would miss out on funding they had received in 2019, according to a fact sheet published by the company.", "This was an important piece of context, and many news reports misled readers by omitting it. While the shift in strategy would mean an end to funding for controversial Christian groups (in 2020 at least), it would also spell an end to disbursements for several dozen other organizations with no record of anti-LGBT policies, many of them with no religious affiliation. As such, the Salvation Army and Fellowship of Christian Athletes do not appear to have been specifically targeted.", "According to tax documents also published on Nov. 18, the Chick-fil-A Foundation in 2018 gave $1.65 million to the Fellowship of Christian Athletes, a non-profit Christian sports ministry whose \"Statement of Faith\" proclaims:", "\"We believe God’s design for sexual intimacy is to be expressed only within the context of marriage. God instituted marriage between one man and one woman as the foundation of the family and the basic structure of human society. For this reason, we believe that marriage is exclusively the union of one man and one woman.\"", "However, the Foundation emphasized in a press release that the $1.65 million was given in order to \"provide underserved youth with week-long summer sports camps at Historically Black Colleges and Universities,\" adding that \"Students who participate are not required to be members of FCA or sign any FCA pledge.\"", "In 2018, the Foundation also donated $115,000 to the Salvation Army, the well-known Christian church that operates charity shops and homeless shelters in several countries around the world. The Salvation Army has been accused on multiple occasions of anti-LGBT discrimination, and promotes a traditional Christian conception of marriage that precludes same-sex marriage.", "However, in recent years, the organization has sought to fight back against its anti-LGBT public image, and again rejected such characterizations in a strongly worded statement issued in response to the Chick-fil-A's announcement in November 2019:", "\"We serve more than 23 million individuals a year, including those in the LGBTQ+ community. In fact, we believe we are the largest provider of poverty relief to the LGBTQ+ population. When misinformation is perpetuated without fact, our ability to serve those in need, regardless of sexual orientation, gender identity, religion or any other factor, is at risk. We urge the public to seek the truth before rushing to ill-informed judgment and greatly appreciate those partners and donors who ensure that anyone who needs our help feels safe and comfortable to come through our doors.\"", "We asked a spokesperson for Chick-fil-A whether funding had been cut from the Salvation Army and the Fellowship of Christian Athletes as a result of those groups' past records on LGBT rights, or public concerns over those records. The spokesperson did not directly answer that question, instead saying that the strategic shift was intended to \"provide maximum impact and maximum clarity with our charitable dollars.\"", "We asked the spokesperson whether groups such as the Salvation Army and the Fellowship of Christian Athletes, which have been criticized as anti-LGBT, would not be receiving funding for the foreseeable future. The spokesperson did not rule out the possibility that such groups could receive funding again in the future, writing: \"No organization will be excluded from future consideration — faith-based or not — as long as they are highly effective in areas of hunger, homelessness and education.\"", "The Chick-fil-A Foundation's November 2019 announcement never mentioned LGBT rights and never stipulated that certain groups were being excluded from funding in 2020 due to concerns over their policies towards LGBT people. Likewise, a spokesperson for the company did not respond directly to our invitation to confirm that the strategic shift announced in November 2019 was informed by such concerns. The spokesperson also would not rule out the possibility of such controversial groups receiving funding again in the future.", "Moreover, the change in approach does not appear to have been specifically targeted at the Salvation Army or the Fellowship of Christian Athletes. In fact, several dozen separate groups who were funded in 2018 and 2019 — with no record of anti-LGBT policies, and often without even any religious affiliation — would also no longer receive any money from the Chick-fil-A Foundation. News outlets misled readers by failing to report this important piece of contextual information.", "However, it is true that the company's major change in approach to charitable donations did have the effect of ending (at least temporarily) its contributions to two controversial Christian organizations — the Fellowship of Christian Athletes and the Salvation Army — whose links to Chick-fil-A have in recent years proved damaging to the fast food company's public image. As a result, then, we rate this claim \"Mixture.\"", "Valinsky, Jordan.  \"Chick-Fil-A Will No Longer Donate to Anti-LGBTQ Organizations.\"\r\n  CNN.  18 November 2019.", "Gibson, Kate.  \"Chick-Fil-A to Stop Donations to Some Charities After LGBT Protests.\"\r\n  CBS News.  18 November 2019.", "The Guardian.  \"Chick-Fil-A Pulls Funding for Christian Groups Criticised for LGBT Stance.\"\r\n  18 November 2019.", "The Chick-Fil-A Foundation.  \"Statement -- Chick-Fil-A Foundation Announces 2020 Priorities to Address Education, Homelessness, Hunger.\"\r\n  18 November 2019.", "The Fellowship of Christian Athletes.  \"Statement of Faith.\"\r\n  Accessed 19 November 2019.", "The Chick-fil-A Foundation.  \"Statement -- The Chick-Fil-A Foundation Shares Details of 2018 Charitable Donations.\"\r\n  18 November 2019.", "The Salvation Army.  \"FAQ Regarding the Salvation Army's Position on Sexual Orientation.\"\r\n  Accessed 19 November 2019.", "The Salvation Army.  \"Statement From the Salvation Army.\"\r\n  18 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]