["The Nation newspaper quoted the Oando Foundation who claimed 40% of primary school teachers are unqualified, 50% of grade six pupils cant.", "An Oando Foundation brochure claims 44% of Nigeria’s primary school teachers are unqualified and 50% of grade 6 pupils can’t read.", "Education ministry data shows 28% of all primary school teachers – 14% in public schools – do not have the minimum qualification.", "A 2015 survey found that 20% of children in grade 6 couldn’t read at all.", "Nigeria’s ailing education system is shown in the bad shape of its public schools, the head of an educational charity said recently.", "The Nation newspaper quoted the Oando Foundation’s Adekanla Adegoke as saying that “over 40% of primary school teachers are unqualified” and 50% of grade six pupils cannot read at all.", "The Oando Foundation is owned by Oando PLC, a local energy company . The foundation’s Akinpelu Oyeleke, a corporate communications officer, told Africa Check the claims were not a direct quote by Adegoke.", "“It may have been culled from an existing publication, referenced by the foundation and shared in a press kit,” he wrote in an email.", "But is the foundation right about low grade 6 literacy and unqualified teachers? Here’s what education data shows.", "“Over 40% of primary school teachers are unqualified”", "A brochure on the Oando Foundation’s website states that 44% of primary school teachers are unqualified. Africa Check has asked if the figure includes both public and private primary school teachers but the foundation has not responded.", "The National Teachers Institute requires that a teacher has at least a national certificate in education, or NCE, to be qualified to teach in primary school.", "In 2016, according to federal ministry of education data, 550,262 teachers, or 72% of the 764,596 teachers in both public and private primary schools, had an NCE.", "This ratio rises to 86% when only public primary school teachers are considered.", "This means 28% of all primary school teachers, and 14% of teachers in public primary schools, do not have an NCE. We therefore rate the claim as incorrect.", "Julie Ibiam, a professor of childhood education at the University of Nigeria in Nsukka, pointed out that the percentage of unqualified primary school teachers varies across Nigeria’s states, with the northern regions worst affected.", "“If teachers are unqualified, then what do they have to offer children?” she asked.", "“These days, there are so many NCE colleges that claim to be approved, but they aren’t. In the university I lecture, there are teachers on sandwich programmes who can’t write proper English.” (Note: In Nigeria, a sandwich programme is study towards a qualification between periods of being at work.)", "“50% of grade six pupils cannot read at all”", "This claim also appears in the brochure on the foundation’s site with the United Nations Children's Fund (Unicef) cited as its source.", "Geoffrey Njoku, a communication specialist at Unicef, directed us to the 2015 Nigeria education data survey for the most recent statistics on literacy in Nigeria. The survey was carried out by the National Population Commission, the education ministry and the National Bureau of Statistics, with funding from the United States Agency for International Development (USAid).", "Out of 84,832 eligible children interviewed across Nigeria, literacy assessments were done for 79,374 children in both public and private schools.", "Children were considered literate if they could read at least one of three words in English or in one of three national languages presented on a flashcard.", "The survey found that for those in grade 6 (also known as primary 6), the literacy rate was 80%. This meant 20% of children in this grade couldn’t read at all.", "Edited by David Ajikobi", "Further reading:\nhttps://africacheck.org/reports/crisis-in-nigerian-schooling-grading-three-claims-by-presidential-hopeful/\nhttps://africacheck.org/factsheets/factsheet-grading-nigerias-progress-in-education/\nhttps://africacheck.org/factcheck-resource/unesco-analysis-of-education-provision-in-nigeria-in-2015/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]