["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A news release from the Tennessee Republican Party titled \"Anti-Semites For Obama\" seeks to cast doubt on Sen. Barack Obama's public pronouncements of support for Israel, alleging that some of the Obama campaign's key Middle East advisers are anti-Israel.", "Two names getting the most discussion are Zbigniew Brzezinski, a national security adviser to President Jimmy Carter from 1977 to 1981, and Robert Malley, once a special assistant to President Bill Clinton for Arab-Israeli Affairs. These men ring alarm bells for some pro-Israel people who follow Israeli-Palestinian relations.", "Whether either is anti-Israel as described is a matter of opinion. More important, the Obama campaign claims neither is a formal adviser.", "The news release from the Tennessee Republican Party is direct.", "\"You don't have to go outside Obama's campaign to find advisers who are anti-Israel,\" states Bill Hobbs, communications director for the Tennessee Republican Party, in the release. \"Robert Malley, a principal foreign policy adviser to Obama, has advocated negotiating with the Iranian-funded radical terrorist group Hamas and urged that Hamas — which sends suicide bombers to kill innocent women and children — receive international assistance.\"", "The comments appear to parrot several articles written by Ed Lasky for the\n\nAmerican Thinker,\n\na conservative daily Internet publication. In a Jan. 16, 2008, article titled \"Barack Obama and Israel,\" he claims that Obama \"has assembled a body of foreign policy advisers who signal that a President Obama would likely have an approach towards Israel radically at odds with those of previous presidents (both Republican and Democrat).\"", "Lasky claims that \"Brzezinski is well known for his aggressive dislike of Israel\" and that he \"has been an ardent foe of Israel for over three decades.\"", "Marc Zell, co-chairman of Republicans Abroad in Israel, stated in an article in the\n\nJerusalem Post\n\nthat Brzezinski heads up Obama's \"problematic\" Middle East team. Brzezinski is faulted for advocating dialogue with Hamas prior to the November 2007 Middle East peace conference in Annapolis, Md.", "In a meeting with Cleveland Jewish community leaders on Feb. 24, Obama stated that he does not share Brzezinski's views with respect to Israel. Moreover, Obama said, \"He's not one of my key advisers. I've had lunch with him once. I've exchanged e-mails with him maybe three times. He came to Iowa to introduce (me) ... for a speech on Iraq.\"", "Brzezinski, a scholar at the Center for Strategic and International Studies, echoed that in an e-mail to the\n\nSt. Petersburg Times.", "\"I am a private supporter of Sen. Obama, and by not being part of the campaign as such I retain the right to continue advocating publicly my own views regarding policy issues — which I have done for years and on the record,\" Brzezinski wrote. \"My views have been supported by Israelis who desire peace and I have frequently consulted them. The McCarthy-like comments you cite emanate from the fanatical right which for years has opposed any serious effort to end the tragic Middle Eastern conflict.\"", "Malley's chief offense among many pro-Israel activists is a letter he penned to the\n\nNew York Times\n\nin which he claimed all sides, including Israel and not just the Palestinians, were to blame for the failure of the 2000 Camp David Summit.", "The furor against Malley reached such a pitch that five former Middle East policy leaders (including Sandy Berger, former national security adviser, and Daniel Kurtzer, former ambassador to Israel) wrote a statement on Malley's behalf. In part, it read, \"Over the past several weeks, a series of vicious, personal attacks have been launched against one of our colleagues, Robert Malley. ... They claim that he harbors an anti-Israeli agenda and has sought to undermine Israel's security. These attacks are unfair, inappropriate and wrong. They are an effort to undermine the credibility of a talented public servant who has worked tirelessly over the years to promote Arab-Israeli peace and U.S. national interests. They must stop.\"", "Obama's campaign states that while Malley has offered advice and opinions on a couple occasions, he is not a formal adviser either.", "\"The truth is that Obama did ask for advice from some people who might be considered not the most enthusiastic pro-Israel policy wonks in Washington,\" said Shmuel Rosner, chief U.S. correspondent for\n\nHaaretz,\n\na leading Israeli paper, who has written extensively about Obama's Middle East advisers. \"However, these people are not in any way formal advisers that help shape Obama's policy on Israel-related topics.\"", "The day-to-day Middle East policy advisers with Obama's campaign, as confirmed by U.S. Rep. Robert Wexler, who co-chairs Obama's Florida campaign, and other campaign staffers, are: Dan Shapiro, a member of Bill Clinton's National Security Council; Eric Lynn, a former foreign policy adviser to Rep. Peter Deutsch; Tony Lake, a former national security adviser to Clinton; and Dennis McDonough, foreign policy adviser to former Sen. Tom Daschle.", "These advisers are considered centrist Middle East policy wonks, Rosner said, and certainly not anti-Israel.", "\"I don't think their advice would be much different than what Hillary Clinton would get from her advisers, or that (John) McCain would get from his Middle East advisers,\" Rosner said.", "Consider that in position papers and interviews, Obama has said he does not think the United States should be talking to Hamas.", "\"Either he (Obama) didn't ask Malley for his advice, or he did ask for his advice and didn't accept it,\" Rosner said.", "While some would argue that it is problematic for Obama to even talk to people are who are not seen as pro-Israel, Rosner said, \"I think it's all a bit hysterical.\"", "The allegations that Obama has surrounded himself with advisers who are anti-Israel are largely based on two men who, according to Obama's campaign, are simply not key advisers to Obama. Those who do comprise the heart of Obama's Middle East advisory team are described by most as centrists and pro-Israel. We rate the claim from the Tennessee Republican Party news release False.", "Tennessee Republican Party", "WorldNetDaily,\n\n\"Obama worked with terrorist,\"\n\nby Aaron Klein, Feb. 24, 2008", "American Thinker,\n\n\"Barack Obama and Israel,\"\n\nby Ed Lasky, Jan. 16, 2008", "Politico,\n\n\"Obama's Rhetoric Chills Some Supporters of Israel,\"\n\nby Ben Smith, March 19, 2007", "National Jewish Democratic Council,\n\n\"Democratic Candidates Support Israel,\"\n\nan analysis", "Haaretz,\n\n\"Obama: Opponents trying to weaken my support in Jewish community,\"\n\nby Shmuel Rosner, chief U.S. correspondent, Jan. 28, 2008", "Jewish Week,\n\n\"Sniping Intensifies On Campaign Advisers,\"\n\nby James D. Besser, Feb. 13, 2008", "Philadelphia Jewish Voice,\n\n\"American Smear-Artist: Ed Lasky attacks Senator Barack Obama,\"\n\nby Ira N. Forman, executive director of the National Jewish Democratic Council, February 2008", "BarackObama.com,\n\nPosition on Israel", "New York Times,\n\n\"Fictions About the Failure At Camp David,\"\n\nby Robert Malley, July 8, 2001", "Jerusalem Post,\n\n\"Obama and the Jews,\"\n\nby Marc Zell, co-chairman Republicans Abroad in Israel, Feb. 21, 2008", "Jerusalem Post,\n\n\"Obama is a Strong Friend of Israel,\"\n\nby Congressman Robert Wexler, Feb. 27, 2008", "Interview with U.S. Rep. Robert Wexler, co-chair of Obama's Florida campaign, Feb. 29, 2008", "Interview with Shmuel Rosner chief U.S. correspondent for Haaretz, March 5, 2008", "Interview with Steve Rabin, deputy executive director of National Jewish Democratic Council, Feb. 29, 2008", "Interview with Joshua Block, spokesman for AIPAC, March 4, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]