["About this rating", "On 15 April 2018, ABC News seemingly announced that the global McDonald's fast food chain would be \"perminatly (sic) phasing out the iconic Big Mac\" hamburger from their menu in a few months:", "McDonald’s has just announced that it will be phasing out the iconic Big Mac and a number of other menu items by July 1, and most McDonald’s customers are not happy.", "With McDonald’s profits slumping in recent years due to consumers looking for more health conscious alternatives, the company has had to make some tough decisions to find adequate solutions for their financial distress by shaking up the menu. “Our intent is to have a cleaner and healthier menu board that is easier for customers to absorb,” SVP of Corporate Strategy and Business Development, Lucy Brady,  said in a statement. “To do so we must simplify our current menu and adapt to consumer trends, even if this means removing such long-standing menu items such as the Big Mac.”", "According to the McDonald’s executive team, this means the end of the Big Mac. The Big Mac has been as synonymous with Mcdonald’s as the golden arches since the burgers introduction in 1967.  However, the burger’s sales have been in a steady decline since the 90’s as customers move to alternate menu items.", "None of this was true: The fast food behemoth is not ditching their famous Big Mac, \"the only sandwich found on the menu at every McDonald’s location worldwide and is readily recognized as a symbol of the brand.\" In fact, they're celebrating the burger's 50th anniversary.", "This report originated solely with the site abcnews-us.com, a fake news site which is not affiliated with the legitimate ABC News organization. The site mimics the domain name and visual appearance of the real ABC News site in order to lure readers into sharing its fabricated news stories.", "This report originated solely with the site abcnews-us.com, a fake news site which is not affiliated with the legitimate ABC News organization. The site mimics the domain name and visual appearance of the real ABC News site in order to lure readers into sharing its fabricated news stories.", "Bleich, James.   \"McDonald’s Announce They’re Perminatly Removing the Big Mac from Their Menu.\"\r\n    abcnews-us.com.   15 April 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]