["About this rating", "In early June 2017, a photograph appeared showing an astonishing tableau — a tornado raging on the horizon while a man calmly mowed his yard in the foreground:", "This photograph may seem unbelievable at first glance, but we have no reason to believe that it has been doctored. It was originally shared on Facebook by Three Hills, Alberta resident Cecilia Wessels on 2 June 2017, along with the following post:", "My beast mowing the lawn with a breeze in his hair.", "The \"beast\" is apparently her husband Theunis Wessels, and the photograph was taken in their backyard in the town of Three Hills, Alberta, Canada.", "Wessels responded to several comments on her Facebook page, insisting that the image was indeed real. The Wessels also spoke to Canadian network CBC, and noting that as alarming as the photograph might be, the tornado is nowhere near as close as it appears in the picture:", "Theunis Wessels says the tornado was actually much further away than it appears in the photo, and that it was moving away from them.", "[...]", "\"I literally took the picture to show my mum and dad in South Africa, 'Look there's a tornado,' and now everyone is like, 'Why is your husband mowing the lawn?\"' Cecilia Wessels said Saturday.", "\"Our whole street, everyone was on their back patios taking pictures,\" she added.", "Theunis Wessels said he was keeping watch of his surroundings and saw the twister form as the swirling connected from the sky and the ground to form the funnel.", "[...]", "\"It looks much closer if you look in the photo, but it was really far away. Well, not really far, far away, but it was far away from us,\" he said.", "\"I was keeping an eye on it.\"", "A tornado did touch down in Three Hills. Vance Neudorf captured footage of the same tornado as it passed by a field. Another man who is perhaps standing a little too close to this twister can be seen at the end of the following clip:", "According to The Weather Channel, nobody was injured during the tornado — but the storm did damage a few barns in the area.", "CBC.   \"Man Who Mowed Lawn with Tornado Behind Him Says he 'Was Keeping an Eye on it.'\"\r\n    4 June 2017.", "Carr, Ada.   \"Man Casually Mows His Lawn as Tornado Swirls Behind Him in Viral Photo.\"\r\n    The Weather Channel.   4 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]