["“A Vaccine Or A Population Management Story,” says the caption for a clip from the film watched tens of thousands of times on Facebook.", "The clip paints a misleading picture of the efforts to develop a COVID-19 vaccine, questioning the research timeline and the recompense available in the rare case that a person suffered a serious side effect from the immunization.", "Thirty seconds into the clip, Arthur Caplan says: “The shortest time anybody’s ever found a vaccine against any disease that I’m familiar with is about seven years. The average time is 20. To be talking about a magic bullet coming in months, it borders on the absurd.”", "It then cuts to interviews of Microsoft co-founder Bill Gates and Dr Anthony Fauci, the director of the US National Institute of Allergy and Infectious Diseases, talking about shorter time frames.", "Caplan, the director of the division of medical ethics at the New York University School of Medicine, said by phone that he was unaware he was in the film, though the quote, which he gave to CBS’s “60 Minutes” program “seems correct.”", "“I am not worrying quite as much about dangerous vaccines being released, what I am worried about is that we don't find an efficacious vaccine that will let us get back to work and school,” he said.", "There are, however, some reasons for optimism.", "“There are over 160 vaccines being examined for this one virus. That has never happened. We never had that many companies and science groups all working to find something at the same time,” Caplan said.", "“And also, we have never spent so much money so fast to find a vaccine that works. So those are reasons to be hopeful.”", "But he did caution that “the first vaccine is not gonna be the end of COVID,” saying that vaccines are likely to be only partially effective, and some people may not take them.", "AFP Fact Check previously debunked false claims about vaccine safety amid the accelerated timeline for development of a COVID-19 immunization.", "It also includes a segment from CBS News in which Norah O’Donnell asks Bill Gates about the side effects from the Moderna COVID-19 vaccine candidate, which is currently in clinical trials, with the anchor saying that 80 percent of participants experienced a systemic side effect.", "However, a systemic effect is any adverse impact that is not at the injection site.", "According to the National Institutes of Health, “None of the participants experienced serious side effects from the vaccine. However, more than half reported fatigue, headache, chills, or pain at the injection site. These symptoms were most common following the second vaccination and in those who received the highest vaccine dose.”", "One minute and 20 seconds into the clip, Mary Holland of the non-profit anti-vaccine advocacy organization Children’s Health Defense, claims, “If you take COVID-19 vaccines you are absolutely on your own. If you’re permanently injured, if you lose your job, if your health care expenses go through the roof, tough luck.”", "This is false, according to David Bowman, spokesman for the US Health Resources and Services Administration.", "COVID-19 vaccines, which are still in clinical trials, have been designated by the government for coverage under the Countermeasures Injury Compensation Program (CICP).", "Bowman explained by email that the CICP process is administrative, not legal, and a person must request compensation within one year to be eligible.", "“Even though a CICP injury table for COVID-19 countermeasures has not been established yet, requesters who demonstrate that their injury occurred as the direct result of the administration or use of a covered countermeasure based on compelling, reliable, valid, medical and scientific evidence, are eligible for compensation,” Bowman said.", "AFP's full debunk of the film “Plandemic: Indoctornation” is available here.", "Manon Jacob contributed to this article.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]