["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rescued horses eat at the Red Bucket Equine Rescue in Chino Hills, California on July 10, 2014. (Associated Press)", "An old story has reappeared on social media claiming that the U.S. government has approved the sale of horse meat from slaughterhouses for food.", "\"USDA approves slaughterhouses producing horse meat for human consumption,\" read the headline on Newstarget, a website providing information for \"educational and entertainment purposes.\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "Here’s the real story: In 2006, Congress effectively banned horsemeat by forbidding the U.S. Department of Agriculture to spend money on inspecting slaughterhouses. Meat plants can’t operate without USDA inspection.", "The last three slaughterhouses in the United States (two in Texas and one in Illinois) closed in 2007, one year after the ban.", "The ban was part of the annual USDA funding bill and was renewed a year at a time until it expired in 2011.", "In 2011, Congress lifted the five-year-old ban on funding horse meat inspections in a spending bill that former President Barack Obama signed into law. The bill didn’t allocate any new money for inspections, but activists worried that it might eventually lead to sales of horse meat.", "The Newstarget story’s origin is likely from an actual 2012 incident when a New Mexico meat plant received federal approval to slaughter horses for meat, which was met with opposition from many animal rights groups.", "The USDA stated that it was required by law to issue a \"grant of inspection\" to Valley Meat Co. of New Mexico, because it had met all federal requirements.", "While Valley Meat Co. planned to process horse meat for human consumption in Europe and other export markets, as well as sell it for animal feed at U.S. zoos, there is no evidence that they sold the meat for consumption in the United States.", "More recently, a bipartisan ban on slaughtering horses for meat has been included in a spending bill that President Donald Trump signed in March of this year.", "The renewed ban on will continue at least until Oct. 1 when the funding bill expires.", "Our ruling", "An article said that the USDA approved slaughterhouses producing horse meat for human consumption. That still hasn’t happened. We rate this Mostly False.", "Newstarget, USDA approves slaughterhouses producing horse meat for human consumption, February 23, 2016", "Govtrack, H.R. 503 (109th): Horse Slaughter Prohibition bill", "Texas Tribune, Horse Slaughtering to be focus of Senate Hearing, July 10, 2012", "Reuters, U.S. approves a horse slaughterhouse, sees two more plants, June 28, 2013", "Wall Street Journal, New budget effectively bans horse-meat processing, Jan. 17, 2014", "USA Today, Ban on slaughtering horses for meat gets last-minute renewal in spending law Trump signed, March 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]