["About this rating", "On 13 December 2016, Harvard law professor Larry Lessig announced that he was aware of \"at least twenty Republican Electors who are seriously considering voting their conscience — and not voting for Donald J. Trump.\"", "Lessig launched an organization called Electors Trust, where he offers members of the Electoral College — who are scheduled to cast their votes on 19 December 2016 — legal counsel and support for potentially rejecting the votes in their state and refusing to cast their ballots for Trump, thereby blocking him from being elected (a failsafe that was written into the Constitution, but has never been used to overturn a presidency).", "In a press statement, Lessig said:", "Obviously, whether an elector ultimately votes his or her conscience will depend in part upon whether there are enough doing the same. We now believe there are more than half the number needed to change the result seriously considering making that vote.", "Trump won enough votes in key states to achieve the 270 electoral votes needed to win the election. His victory was not without contention; shortly thereafter, Green Party candidate Jill Stein filed petitions for vote recounts in swing states Wisconsin, Pennsylvania and Michigan. Now, Lessig believes he can convince 37 electors to cast \"faithless\" votes and strip Trump of the victory.", "Whether it's true that Lessig has 20 electors on board is impossible to verify unless they make themselves public. So far, only one Republican elector has publicly stated he will not vote for Trump — Chris Suprun of Texas.", "The effort seems unlikely to be successful. While Trump's rival, Hillary Clinton, won the popular vote by roughly 2.8 million votes as of 15 December 2016, Clinton has not contested the election results. Current President Barack Obama has also made it clear there is no question that Trump will succeed him. But Lessig called the ability of electors to take the election away from Trump a \"constitutional emergency brake\":", "Never in our history has the argument for electors exercising their independent judgment been as overwhelmingly strong—because of the concerns about foreign involvement in our election, because of Mr. Trump’s refusal to comply with constitutional limitations on foreign assets, and because of the overwhelming popular vote margin by his opponent.", "Some states require electors by law to vote the way their state voted (although the penalties to vote against their state are relatively low). According to an NPR analysis, that leaves 155 who would still be able to change their votes — however unlikely the prospect seems.", "CNN Politics: \"Presidential Results.\"", "Kurtzleben, Danielle. \"MAILBAG: Could 'Faithless Electors' Keep Donald Trump Out Of The White House?\"\r\n  NPR. 15 December 2016.", "Suprun, Christopher. \"Why I Will Not Cast My Electoral Vote for Donald Trump.\"\r\n  The New York Times. 5 December 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]