["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Source: California High-Speed Rail Authority", "LISTEN TO THIS STORY:", "California’s high-speed rail plan is perhaps best known for its sky-high cost estimates, which at one point spiked to $98 billion.", "The project’s budget was subsequently cut to $68 billion -- still well above the state’s $33 billion price tag in 2008, when voters approved bond funding for the rail network. But questions about cost overruns continue to dog the California High-Speed Rail Authority. A consultant’s draft report was recently made public and indicated the system’s Merced-to-Burbank stretch could cost $8 billion more than expected.", "Rail authority officials said the report was preliminary, and hasn’t increased the current budget.", "In recent weeks, Jeff Morales, the rail authority’s chief executive officer, and other authority leaders, have tried to change the narrative about mounting costs. They’ve started to say that expenses are, in fact, trending down.", "\"The actual (construction) contracts that we’ve awarded to date have come in several hundred million dollars below estimates. That’s the reality of where we are in the program,\" Morales said during a press conference in Madera in late October, captured in the video clip below.", "KSEE TV Fresno, Nov. 1, 2015", "Several hundred million dollars is miniscule compared with the project’s overall cost. But because the CEO’s statement goes against the project’s past financial history, it inspired us to check the facts.", "Checking Morales’ claim", "Rail authority officials clarified that Morales was referring to the project’s first two major construction contracts.", "We dug out those documents for a look. The first is for a 29-mile stretch of track from Madera to Fresno, including a tunnel and several raised crossings, one over the San Joaquin River. The authority’s lowest cost estimate was $1.2 billion. The winning bid was significantly less, at about $1 billion.", "The authority’s second major project is a 60-mile leg from Fresno south to the Tulare-Kern County line. It projected the price as low as $1.5 billion. The winning bid was a slightly more than $1.2 billion. Doing the math, the bids were a combined $480 million less than the lowest estimates. That qualifies as \"several hundred million dollars.\"", "Morales, the rail authority executive, doesn’t call this a ‘savings’ in his statement. He says only that bids came in below estimates, which the authority set for itself.", "On the right track?", "These bids are significantly less than estimated. But is that the end of the story? And does this mean the rail authority will see a cost savings?", "Not likely, said Jan Whittington, a professor at the University of Washington who studies the financing of large-scale infrastructure projects across the globe.", "That’s because there are always unforeseen consequences. Crews could hit harder rock than anticipated, find an endangered species along the route or encounter unstable soil, all adding to the time and cost of the project.", "\"There’s always going to be something that either the project manager or the contractors themselves did not foresee in design that they encounter during construction,\" Whittington said. \"It’s nice to hear that they received bids that were lower than anticipated. But you don’t know how much it costs until they finish constructing it and it’s begun operating.\"", "Still in the hole", "Steve Boilard, who heads Sacramento State University’s Center for California Studies, said any implication that lower construction bids lead to actual savings is wrong. He said these lower bids do little to remove the bullet train’s overall financial uncertainty. The authority lacks funds for the bulk of the project, which would link the Los Angeles and San Francisco metro areas.", "\"With an overall cost of $68 billion, it just means that the hole that we’re in and having to find money, maybe is going to be a little bit less as a result of these lower bids,\" Boilard said.", "Morales isn’t the only rail authority leader to tout the low bids. Dan Richard, the authority’s chairman, recently told Capital Public Radio that that \"costs are coming down\" for much of the system, in part, due to the bids. In a follow up interview, Richard explained that the authority is using design-build agreements that shift some cost overruns to the construction contractor. He said, however, there is no way for the authority to completely avoid unexpected, added expenses.", "Our ruling", "Jeff Morales, the rail authority’s chief executive officer, said in late October: \"The actual (construction) contracts that we’ve awarded to date have come in several hundred million dollars below estimates.\"", "After digging out the original documents, the winning bids are a combined $480 million below the authority’s cost estimates. That works out to \"several hundred\" million.", "Still, the lower bids do nothing to wipe away the overall project’s financial uncertainty, several experts said. Its funding gap remains in the tens of billions of dollars.", "The implication behind Morales’ statement about the bids is that the authority is either controlling its costs or could potentially save money. Officials probably wouldn’t talk about the bids otherwise. Even the authority’s chairman said there’s no way to safeguard against all possible higher expenses.", "The phrase \"to date\" in the CEO’s carefully worded comment may be the most critical going forward. Every independent expert we spoke with suggested future cost overruns are likely for the project.", "Even so, our fact checks evaluate the here and now, and not predictions.", "We rate the claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "California High-Speed Rail Authority, construction estimates for Construction Package 1, March 2012", "California High-Speed Rail Authority, winning bid for Construction Package 1, July 2013", "California High-Speed Rail Authority, construction estimates for Construction Package 2-3, April 2014", "California High-Speed Rail Authority, winning bid for Construction Package 2-3, June 2015", "Phone interview with Steve Boilard, executive director of Sacramento State University Center for California Studies, Nov. 12, 2015", "Phone interview with Jan Whittington, assistant professor of urban design and planning at the University of Washington, Nov. 12, 2015", "Phone interview, Lou Thompson, Chairman of the California High-Speed Rail Peer Review Group, Nov. 10, 2015", "Phone interview, Dan Richard, Chairman of the California High-Speed Rail Authority Board of Directors, Nov. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]