["“Have a look at the Bungalows of…. *Mr. Gulam Nabi Azad* *Mr. Omar Abdullah* *Mr. Farook Abdullah* *Ms. Mehbooba Mufti* Houses in Srinagar, Jammu & Kashmir…. These R Government houses & maintained by the Government too at the cost of public money….  U shall soon come to know Y such people R opposing removal of Artical 370 & 35A….”", "The removal of key provisions of Article 370 has unleashed a wave of misinformation pertaining to the state. National Conference leaders Farooq Abdullah and Omar Abdullah, PDP chief Mehbooba Mufti and Congress leader Ghulam Nabi Azad have been targeted in the above message which accompanies a set of photographs showing what seem like fancy, lavish residential properties, purportedly owned by these leaders.", "Have a look at the Bungalows of…. *Mr. Gulam Nabi Azad* *Mr. Omar Abdullah* *Mr. Farook Abdullah* *Ms. Mehbooba…", "Posted by Venkat Kannan on Monday, August 19, 2019", "The same message and pictures have been circulated on WhatsApp. Verification of this claim was requested by users of the Alt News app.", "There are four pictures along with a message. Let’s take a look at each.", "On reverse-searching the above photograph, Alt News found it in an article on Kashmir Life, dated November 2014, according to which this is the residence of Omar Abdullah at Gupkar road in Srinagar. Gupkar road is a posh area of the city, housing several ministers and top government officials. Interestingly, the Kashmir Life article which carried the photograph was about the luxurious privileges enjoyed by the Chief Minister of J&K. It may be noted that in 2014, Omar Abdullah was the CM of Jammu & Kashmir. According to the affidavit filed by Abdullah before the Election Commission in 2014 ahead of the J&K assembly polls, he resided at G-1, Gupkar road in Srinagar.", "Alt News reverse-searched the above image on Google, and found that it is a photo of a luxury hotel in Srinagar. This is The Lalit Grand Palace, Srinagar. Alt News found a photo of the same structure on the website of the hotel, taken via wide angle lens. Moreover, we confirmed the same by checking travel websites where this photo was listed, and found quite a few which had featured it.", "The above image too is of the Lalit Grand Palace, Srinagar. This was also confirmed by a simple reverse image search. This photo too features on several travel websites and is iconic of the hotel.", "Alt News reverse-searched the above image and found it posted on the travel website Trip Advisor. Once again, this is the Lalit Grand Palace, Srinagar.", "In conclusion, photographs of a luxury hotel in Srinagar have been shared on social media and messaging platforms as grand, opulent bungalows owned by the Abdullahs, Mehbooba Mufti and Ghulam Nabi Azad.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]