["About this rating", "On July 5, 2019, the website BustATroll published an article positing that Alabama had become the first state to ban \"radical Islam\":", "Alabama Becomes the First State to Ban 'Radical Islam'", "Alabama has once again gone where no state has gone before: They’ve banned “radical Islam.” According to lawmakers in Montgomery, the practice is simply not welcome there:", "“The radical Islamatists are not our friends, and we don’t support their ways. The great state of Alabama wants you to know that if you have pledged your loyalties to some extremist group that wants to kill Americans, you are not welcome here.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "The article was later republished verbatim, without satire disclaimers, on several junk news websites, including USANetwork.info, Today Breaking News, and Trump-Feed.com.", "For background, here is why we sometimes write about satire/humor.", "BustATroll.org.   \"Alabama Becomes the First State to Ban 'Radical Islam.'\"\r\n   5 July 2019.", "Daily US Updates.   \"Alabama Becomes the First State to Ban 'Radical Islam.'\"\r\n   22 October 2019.", "Trump-Feed.com.   \"Alabama Becomes the First State to Ban 'Radical Islam.'\"\r\n    November 2019.", "USA Network.   \"Alabama Becomes the First State to Ban 'Radical Islam.'\"\r\n   7 July 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]