["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "First-term U.S. Sen. Ron Johnson, a Republican, is facing former Democratic U.S. Sen. Russ Feingold in the November 2016 election. (Journal Sentinel file photo)", "On a Wisconsin radio talk show on Aug. 1, 2016, U.S. Sen. Ron Johnson was asked about global warming.", "\"Listen, man can affect the environment; no doubt about it,\" Johnson replied. \"We all want a clean environment. It's a goal we all share. I understand that.\"", "Then the Republican incumbent, who faces Democrat Russ Feingold in the November 2016 election, made a statement we want to check, saying:", "\"First of all, the climate hasn't warmed in quite a few years. That is proven scientifically.\"", "Johnson’s comments on WRJN-AM in Racine prompted stories in the national media, including Talking Points Memo, Slate and the Huffington Post, each of which referred to 2015 being the hottest year on record.", "The rate of global warming has slowed in recent years, particularly since 1998, but Johnson’s declaration is, well, overheated.", "Johnson’s evidence", "To back Johnson’s statement, his campaign pointed us to a global \"temperature anomaly\" chart from NASA. A temperature anomaly means a change, up or down, from a long-term average.", "Source: NASA", "Johnson’s campaign argued that the chart shows the anomalies rose sharply from the 1950s to the 1990s, then leveled off.", "The trend on the chart, however, is steadily upward since the 1960s. And there was a \"positive anomaly\" in each of the past four years.", "Past fact checks", "Previous fact checks have found global temperatures hitting record highs in recent years.", "In 2013, when President Barack Obama said that \"the 12 hottest years on record have come in the last 15 years,\" PolitiFact National’s rating was True.", "And in 2014 and 2015, our colleagues rated Mostly False two claims that there had been no global warming in the past 17 years.", "Global surface temperatures remained relatively flat during that period, since the last powerful El Niño, in 1998.", "But the first decade of the 21st century -- even as it’s been relatively stable -- has been the warmest on record.", "NASA/NOAA", "In January 2016, NASA reported that separate, independent analyses by its own scientists and the National Oceanic and Atmospheric Administration found that Earth’s 2015 surface temperatures were the warmest since modern record keeping began in 1880.", "The globally-averaged temperatures in 2015 \"shattered the previous mark set in 2014,\" NASA said.\n\nThe 2015 temperatures, NASA added, \"continue a long-term warming trend\" -- most of the warming has occurred in the past 35 years, with 15 of the 16 warmest years on record occurring since 2001 (as is shown in the chart below).", "Source: National Oceanic and Atmospheric Administration", "So, the warmest year on record was 2015, followed by 2014.", "Moreover, Kevin Trenberth, a senior scientist National Center for Atmospheric Research, told us that temperatures in the first six months of 2016 are even higher.", "Our rating", "Johnson said: \"The climate hasn't warmed in quite a few years. That is proven scientifically.\"", "He argues that temperatures rose sharply from the 1950s to the 1990s, then leveled off, but it’s wrong to say there hasn’t been warming in many years. In fact, 15 of the 16 warmest years on record have occurred since 2001, with the two highest years being 2014 and 2015.", "We rate Johnson’s statement False.", "WRJN-AM, Ron Johnson interview (9:00), Aug. 1, 2016", "Email, Ron Johnson campaign spokesman Will Allison, Aug. 8, 2016", "Email, Russ Feingold campaign spokesman Michael Tyler, Aug. 8, 2016", "NASA, temperature anomaly chart", "NASA, \"NASA, NOAA Analyses Reveal Record-Shattering Global Warm Temperatures in 2015,\" Jan. 20, 2016", "PolitiFact National, \"Ted Cruz's world's on fire, but not for the last 17 years,\" March 20, 2015", "PolitiFact National, \"Barack Obama says the 12 hottest years on record have come in the last 15 years,\" Feb. 15, 2013", "PunditFact, \"Climate change skeptic Patrick Moore says Earth has ‘not warmed for the last 17 years,’\" March 17, 2014", "PolitiFact New Jersey, \"Rush Holt warns ‘millions will die’ from climate change as global temperatures reach historic highs,\" July 28, 2013", "National Oceanic and Atmospheric Administration, \"Global analysis -- annual 2015,\" January 2016", "National Oceanic and Atmospheric Administration, \"Sixteen warmest years\"", "New York Times, \"2015 was hottest year in historical record, scientists say,\" Jan. 20, 2016", "Washington Post Fact Checker, \"Ted Cruz’s claim that there has been ‘zero’ global warning in 17 years,\" March 26, 2015", "Interview, National Center for Atmospheric Research Climate Analysis Section distinguished senior scientist Kevin Trenberth, Aug. 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]