["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Andrew White, speaking here to the Texas AFL-CIO in January 2018, has said Texas schools rank 43rd nationally. MOSTLY TRUE, we found (photo by Mark Matson for the Austin American-Statesman).", "Andrew White, the Houston investor among Democratic aspirants hoping to deny Greg Abbott a second term as governor, says the state’s public schools rank poorly.", "White specified at his December 2017 campaign kickoff: \"For schools, we’re 43rd in the nation. Let me say that again. We’re 43rd in the nation. How can we claim that we’re preparing our kids for tomorrow when we can barely prepare them for yesterday?\"", "It’s not unusual for a candidate to suggest schools need a lift. For instance, Abbott, a Republican, promised on his way to winning the state’s top elected post to make Texas \"No. 1 in the nation for educating our children.\"", "It’s also worth noting there are varied ways of comparing schools. For instance, US News rankings, drawing in part on student scores on national math and reading exams, place Texas’ public schools 41st--though the state's high school graduation rate ranked fifth.", "So White, who continued to cite the state’s No. 43 ranking into 2018, made us wonder.", "White spokeswoman Desi Canela, asked how White reached the declared ranking, pointed out news accounts quoting a study released toward the end of 2015 by Education Week, a national publication that reports on education from kindergarten through high school.", "The stories, posted in January 2016 by Houston Public Media, the San Antonio Express-News and the El Paso Times, each headlined the No. 43 ranking bestowed based on dozens of indicators across the categories of school funding, student achievement and future student success.", "A correction and more recent rankings", "When we turned to verify the No. 43 ranking, we learned that the cited study was amended a few weeks after publication to correct errors in its initial school finance section. As a result, Texas schools edged up to rank 41st among the states (42nd if you count the District of Columbia). Also, we noticed, more recent Education Week studies, released in December 2016 and January 2018, respectively, show Texas schools ranking 40th among the states (41st if you count D.C.).", "To our inquiry, Sterling Lloyd of the Education Week Research Center summed up by email:", "\"In the 2016 report, Texas received an overall grade of C-minus and a score of 69.7. In 2017, it earned a C-minus (70.2). For the 2018 grading, it got a C-minus (70.6).", "\"So, the slight improvement in ranking between 2016 and the subsequent years reflects a modest gain in the state’s numerical score if not its letter grade. This change was driven by an improvement in Texas’ School Finance score, where it gained about a point between 2016 and 2017 and about a point between 2017 and 2018. The improvement for Texas in the School Finance score reflects gains on equity in the distribution of funding across districts within the state. For instance, the gap between the highest- and lowest-spending districts in Texas narrowed from 2016 to 2017 and from 2017 to 2018.\"", "Why Texas placed 40th", "White couldn’t have had the latest rankings when he announced his candidacy. So to learn more about Texas’ ranking, we focused on the second-to-latest breakdown.", "The publication’s web page presenting those state-by-state rankings, dated Dec. 30, 2016, shows Texas’s C-minus score of 70.2 trailing both No. 1 Massachusetts, with a B-grade score of 86.5, and the national C-grade average of 74.2. States with worse-than-Texas rankings included California, New Mexico, Oklahoma and, in last place, Nevada with a D-grade score of 65, the page shows.", "Texas got its C-minus based on the following Education Week-bestowed grades:", "SOURCE: Web page,  \"Quality Counts 2017: State Report Cards Map,\" Education Week, Dec. 30, 2016", "A separate web post elaborates on how Texas fared, specifying that the state ranked 24th among the states and D.C. for its \"K-12 Achievement Index,\" which takes into account 18 indicators; 39th in the \"Chance-for-Success\" category, which considers 13 indicators; and 44th for \"School Finance.\"", "Other takes", "We looked next for perspective outside of Education Week.", "Houston Public Media’s story quoted the Texas Education Agency saying: \"It’s difficult to effectively evaluate the state’s performance from a national report where no state made the highest\" possible \"grade, no state made the lowest grade and the majority of states were all lumped into the same grade category.\"", "When we followed up, the agency’s Lauren Callahan reaffirmed the quoted statement and also said by email that the agency doesn’t comment on rankings \"since each utilizes a different methodology in determining a final grade.\" Callahan noted too that the agency has been assigned by law to implement a system giving A-to-F grades to campuses and districts. \"Specifics of that system will be in place later this year,\" Callahan said.", "We also asked Children At Risk, a Houston-based nonprofit that appraises schools, what it makes of White’s cited rankings. Andy Canales replied by email that the group, which has worked with Education Week,  considers the publication’s reports ranking the schools in each state to be sound studies \"in line with research by Children At Risk.\"", "Holly Eaton of the Texas Classroom Teachers Association, which was among education advocacy groups that we asked to weigh in, pointed out that Texas spends less per student than many states.", "Generally, Eaton said by email, rankings can oversimplify. Notably, she said, the Education Week studies don’t adjust test results that figure into its grades to account for demographic differences. Once that’s done on results on the National Assessment of Educational Progress, Eaton noted, Texas surges close to having the nation’s best student performance results, according to research by the Urban Institute focused on 2013 and 2015 NAEP scores.", "By email, Lloyd agreed that it’s important to consider demographics when thinking about a state’s academic performance. But Education Week, he said, tries \"to make our methodology for the grading as straightforward as possible. Adjusting for demographics can make the grading less straightforward for the public. It adds methodological details that need to be evaluated.\"", "Eaton later commented that Land’s response \"illustrates the classic tension in performance reporting between the desire for clarity (thus oversimplification) vs accuracy (thus complexity).\"", "We shared with Canela the fact that Texas schools lately rank 40th in the rankings and didn’t draw additional comment.", "Our ruling", "White has said Texas schools rank \"43rd in the nation.\"", "In fact, Texas schools ranked 40th among the states heading into 2017, according to the latest Education Week rankings that were public before White spoke.", "We rate his statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Facebook Live video of Andrew White’s campaign kickoff, Andrew White campaign, Dec. 7, 2017 (White statement can be viewed about the 14:35 mark)", "Web posts, Education Week, Quality Counts rankings of public schools by state, \"Quality Counts 2016: State Highlights Reports,\" Dec. 30, 2015;  \"Quality Counts 2017: State Report Cards Map,\" \"Texas Earns a C-Minus on State Report Card, Ranks 41st in Nation,\" Dec. 30, 2016; \"Quality Counts 2018,\" Jan. 17, 2018 (accessed Jan. 22, 2018)", "Emails, Sterling C. Lloyd, assistant director, Education Week Research Center, Jan. 23-24, 2018", "Email, Lauren Callahan, information specialist, Texas Education Agency, Jan. 23, 2018", "Email, Andy Canales, director, Center for Social Measurement & Evaluation, Children at Risk, Jan. 24, 2018", "Emails, Holly Eaton, director of professional development and advocacy, Texas Classroom Teachers Association, Jan. 24, 2018", "Web post, \"How do states really stack up on the 2015 NAEP?,\" Urban Institute, Oct. 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]