["“President Trump won by a landslide. We are going to prove it,” Sidney Powell, an attorney for the president, said in a clip posted November 19, 2020 on this pro-Trump Facebook page.", "It features her speaking that day at a press conference with two other attorneys, Jenna Ellis and Rudy Giuliani, who said they were representing the president and his campaign.", "Powell’s “landslide” claim was repeated on Facebook here in a post that called for people to “surround her with prayer” in her efforts to alter the election’s outcome. The claim also featured in this article from the Falungong-linked Epoch Times, headlined this Daily Wire article, and captioned this YouTube clip of an interview with Powell on Newsmax, a channel that is seeking to attract viewers from Fox News.", "That November 18 clip was viewed almost 700,000 times.", "“The election could not have been more rigged than it was... The math just doesn’t add up for anything,” Powell said in the Newsmax interview. “The will of the people in this country was that Donald Trump win in a landslide. If we can get to the bottom of it, and I am determined to do that, I think we’ll find he had at least 80 million votes.”", "In another Newsmax interview posted November 21 on Facebook, Powell made a similar claim, that “roughly seven million” votes were removed from Trump’s tally.", "US media project that Biden won 306 Electoral College votes -- well above the 270 needed -- compared with Trump’s 232. Biden’s popular vote tally --  around 80 million -- was more than six million ahead of Trump’s 73.9 million, as of November 24.", "According to the Federal Election Commission, Trump won the 2016 ballot with 304 Electoral College votes, and almost 63 million popular votes. His challenger Hillary Clinton topped the popular vote -- with 65.9 million votes -- but had only only 227 votes in the Electoral College.", "In her public comments, Powell, who is licensed as a lawyer in Texas, described a conspiracy in which Dominion Voting Systems and their software, used to conduct much of the US vote, were rigged to flip votes from Biden to Trump.", "Votes for Trump were “so overwhelming in so many of these states that it broke the algorithm that had been plugged into the system and that's what caused them to have to shut down” in some states, forcing use of a “backdoor with all the mail-in ballots, many of which they had actually fabricated,” Powell claimed.", "She said the Dominion Voting system and associated software “were created in Venezuela at the direction of Hugo Chavez to make sure he never lost an election.”", "In a November 17 statement, Dominion Voting Systems denied “false assertions about vote switching and software issues with our voting systems,” after Trump falsely claimed the company deleted 2.7 million of his ballots.", "Dominion added that it is a non-partisan company with offices in the US and Canada, that does not have “any ties to Venezuela.”", "AFP has previously debunked claims, partly tied to Powell, that Dominion used servers in Germany as part of the supposed election plot.", "Claims that computerized voting systems altered ballots have been dismissed by federal and state election officials including the Cybersecurity and Infrastructure Security Agency (CISA), the lead federal agency on election security. They found “no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.”", "Trump said the comments were “highly inaccurate” and fired CISA Director Chris Krebs.", "Even some Republicans and those skeptical of the election outcome said Powell had not presented evidence for her allegations.", "Former New Jersey Republican governor Chris Christie, who helped Trump prepare for a debate with Biden during the campaign, accused Powell of “being unwilling to go on TV and defend and lay out the evidence that she supposedly has. This is outrageous conduct by any lawyer,” he said on November 22.", "“They allege fraud outside the courtroom, but when they go inside the courtroom, they don't plead fraud and they don't argue fraud,” Christie said.", "“We cannot continue to act as if something happened here that didn't happen... The evidence has not been presented,” he added.", "Trump has repeatedly failed to convince judges that there were widespread irregularities in the voting process of  the November 3 election.", "One of the latest defeats came in a US District Court in Pennsylvania on November 21 when Judge Matthew Brann said the Trump team sought to throw out almost seven million legally cast votes in the state but presented only “strained legal arguments without merit and speculative accusations”.  The case involved two voters whose mail-in ballots were cancelled.", "That ruling prompted Pennsylvania Republican Senator Pat Toomey to say Trump, whose accomplishments he praised, had exhausted all plausible legal options to challenge the result in Pennsylvania, which subsequently certified Biden as winner in the state .", "“President Trump should accept the outcome of the election,” Toomey said.", "Asked about Powell’s “landslide” comment, Iowa Republican Senator Joni Ernst said, “There does have to be proof… They have to be able to show that proof” to a court. Ernst criticized as “absolutely outrageous” Powell’s suggestion at the press conference that both Republican and Democratic candidates “paid to have the system rigged.”", "Fox News host Tucker Carlson, who maintains the election was not fair and wanted to see details of Powell’s claims, said in a broadcast that she “never sent us any evidence” despite many requests.", "“She never demonstrated that a single actual vote was moved illegitimately by software from one candidate to another, not one,” Carlson said.", "Following the criticism of Powell, Giuliani and Ellis issued a statement on November 22, saying Powell is “not a member of the Trump Legal Team.”", "A day later the General Services Administration, the US government agency supporting presidential transitions, wrote to Biden to say the process could begin, according to a letter obtained by CNN. The agency’s head, Emily Murphy, cited “recent developments involving legal challenges and certifications of election results” for her decision.", "The GSA does not pick the election winner, but “ascertains the apparent successful candidate once a winner is clear,” the agency’s website says. Murphy had previously been criticized for not endorsing the transition despite Biden’s being the projected victor.", "AFP has debunked dozens of false and misleading claims about the US election, including that hundreds of thousands of votes were added, dumped or mysteriously appeared for Biden in crucial states.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]