["The 43-second video was published on Facebook here on October 10, 2020.", "The post’s caption reads: “The law of this country is meant for the poors only..! #government #indiangovernment #NarendraModi #ArvindKejriwal”.", "Narendra Modi is prime minister of India and Arvind Kejriwal is chief minister of Delhi.", "The video was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside identical claims.", "The claims, however, are misleading.", "The crying man in the video can be heard saying that he would commit suicide by tying a rope around his neck when asked by the reporter what he will do now in Bangla, the national language of Bangladesh that is also spoken in the neighbouring Indian states of West Bengal and Tripura.", "A close examination several billboards in Bangla and a \"Jamuna News\" logo on the red mic seen the video are highlighted in green in the video screenshot below:", "A keyword search on Google found this YouTube channel of Jamuna TV, a 24-hour TV news channel in Bangladesh.", "A longer video report that contains the same footage published in the misleading posts was found published here on the YouTube channel on October 6, 2020.", "“Now I will tie the rope around my neck; screams the rickshaw puller,” reads the video's Bangla description.", "Below is a screenshot comparison of the video shared in the misleading post (L) and the YouTube video (R):", "A further investigation of the video found several clues that show the video was shot in the Dhanmondi area of Dhaka. For example, \"South City Corporation\" is written in Bangla on the JCB machine and a sign for \"Minor Cafe\" is seen in the background.", "Below is a screenshot with the text highlighted in red:", "A keyword search on Google found the website of the South City Corporation, a local administrative civic body in Dhaka. The cafe sign seen is for a cafe called ‘C Minor Music Cafe’, which is located in Dhanmondi, Dhaka.", "Further searches by relevant keywords found the incident was also reported here and here by Bangladshi media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]