["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The winner in a razor-thin congressional election in the Binghamton area still hasn’t been determined, and in the weeks since Election Day with controversies over which ballots to count, Republican candidate Claudia Tenney's campaign has warned of \"utter dysfunction.\"", "On Twitter earlier this month, Tenney retweeted this claim by a group of House Republicans: \"They’re literally finding ballots in random desk drawers in New York. That doesn’t sound fishy at all.\"", "Tenney added: \"Dead people also voted. Ballots sent from NYC in the count as well.\"", "Dead people also voted. Ballots sent from NYC in the count as well. https://t.co/NnEE8XsI9g", "Tenney, seeking a seat she once held, has talked about \"dead\" or \"deceased\" people voting in other forums as well, including in a statement from her campaign in November and in an interview with Fox News this month. As of Dec. 18, Tenney held a 19-vote lead over Democratic incumbent Anthony Brindisi, 155,519 to 155,500, according to unofficial returns from the eight counties in the district. Since this race is attracting so much attention, we wondered if there is any truth to her claim.", "Tenney hasn’t been the only person talking about dead people voting in the 22nd Congressional District, which stretches between the shore of Lake Ontario, Utica and the Pennsylvania border.", "The New York Post, on Nov. 23, published a story headlined: \"Ballots cast by the dead emerge in extremely tight Brindisi-Tenney race.\" The story cited information from a Madison County lawyer, who told the court overseeing the ballot counting that three ballots in that county were disregarded after they were submitted to the Board of Elections, because the voters were \"deceased.\"", "Mary Egger, the Republican elections commissioner in Madison County, told PolitiFact the board discovered three people who voted with absentee ballots died before Election Day, and that those ballots were taken out of the count.", "The Democratic commissioner, Laura Costello, confirmed this.", "\"Before counting our absentees we check for purged voters and pulled these absentees out of the count,\" Costello said.", "In New York state, paper ballots that are submitted early to the Board of Elections are not counted if a board discovers that the voter died before Election Day, according to state Board of Elections Director of Public Information John Conklin. \"This is a common occurrence,\" Conklin said.", "Madison County uses a state registry to determine whether any of the registered voters who voted early died before Election Day.", "\"It is not uncommon,\" Egger said. \"It’s something we check every election, and it does happen.\"", "Madison County did not have a case of anyone trying to vote by impersonating a dead person. \nThere could have been cases where someone voted early on a voting machine in a polling place, and then died before Election Day. Those ballots are still counted, Egger said.", "We reached out to election commissioners in all of the 22nd Congressional District’s eight counties. Half of the counties responded, and they said they were not aware of any person who tried to impersonate a dead person in order to vote.", "In Chenango County, some ballots were returned to the board because the voter had died, said Commissioner Carol Franklin. This happens because people who are on a list to receive an absentee ballot for every election because they have a disability and then die are not promptly removed from the list. There were no instances of someone impersonating a dead person, Franklin said.", "Cortland County pulled six ballots after they were cast because the voters died before Election Day, said Commissioner Robert Howe. In Tioga County, Commissioner James Wahls said they had no known instances where a voter cast an absentee ballot and died before Election Day.", "After Tenney made her claim on Twitter, ballots were under review in Madison County. \nThe Brindisi campaign requested that one of the three ballots the Board of Elections had set aside be considered, unless a death certificate or confirmation of death from an official source could be produced, said Egger, the Republican commissioner. The board was relying on a newspaper obituary to confirm the death, she said. A spokesman for Brindisi, Luke Jackson, confirmed Egger’s story.", "The Tenney campaign is also asking that two other ballots be set aside because they believe the voters died before Election Day, Egger said, adding that the Board of Elections cannot establish that these voters died.  \n \nThese and other questions about which ballots should be counted are under review in State Supreme Court.", "Registered voters who vote by absentee ballot and die before Election Day is not an instance of fraud, said Sean Morales-Doyle, who studies elections and is a deputy director of the Democracy Program at the Brennan Center.", "\"I think the fact that an election official catches the fact that someone died after they cast their ballot but before Election Day is a sign the system is working,\" he said.", "In a decision and order on Dec. 8, State Supreme Court Justice Scott DelConte wrote: \"To be clear, there is absolutely no evidence -- or even an allegation -- before this Court of any fraud on the part of the Boards or the campaigns.\"", "The Tenney campaign said that absentee ballots overwhelmed boards of election, and provided to PolitiFact photos of ballots that were sent to people who had died, and obituaries to corroborate their deaths. These ballots were not filled out by anyone.", "The number of absentee ballots \"made it extremely difficult for officials to verify that every ballot was properly cast by a legal (and living) voter,\" said Sean Kennedy, spokesman for the Tenney campaign.", "\"In this election, multiple ballots were cast by people who were deceased on Election Day,\" Kennedy said. \"Due to insufficient safeguards and the massive volume of mail-in ballots to process, we do not know how many more went undetected and are considered valid votes. Fortunately, the local boards excluded those votes but unfortunately our opponent has now asked that a dead voter’s ballot be counted.\"", "Tenney wrote \"Dead people also voted\" when retweeting a claim implying that something \"fishy\" is going on in ballot-counting in New York.", "It is accurate that living people cast ballots and died before Election Day, according to several election commissioners across the district’s eight counties. Ballots from these known individuals are not part of a board’s vote tally.", "In the case of a single ballot in Madison County set aside because election officials found an obituary causing them to believe the voter died, Brindisi’s campaign is asking that a death certificate be produced before that ballot is disregarded from the count. It will be up to the court to decide whether to count that ballot.", "It is possible that boards of election do not catch every instance of a voter dying after they cast their ballot but before Election Day. In addition, voters who vote early on machines at polling places and die before Election Day have their votes counted. It’s unclear how often this happened in this race, if it happened at all.", "But Tenney offers no proof that anyone used the identities of dead people to cast fraudulent votes, or that ballots cast by voters who died before Election Day are included in the tally. Photos of unfilled ballots are not evidence of voter fraud. The court is dealing with other problems related to timely and accurate ballot counting. Dead people voting isn't one of them.", "We rate Tenney’s claim Pants on Fire!", "Twitter, tweet, @ClaudiaTenney, Dec. 8, 2020.", "Politico, article, \"New York House rematch plays out the only way it could: Strange and complicated,\" Dec. 3, 2020. Accessed Dec. 16, 2020.", "FoxNews, video, Fox & Friends, \"Judge orders partial recount in NY House race,\" Dec. 9, 2020.", "Syracuse.com, \"Tenney leads Brindisi by 19 votes after count of Chenango County ballots,\" Dec. 18, 2020. Accessed Dec. 2020.", "Email, phone interviews, Sean Kennedy, spokesman for Claudia Tenney, Dec. 18.", "Phone interview, Sean Morales-Doyle, deputy director, Democracy Program, Brennan Center, CCC", "Email interview, Luke Perry, professor of political science, Utica College, Dec. 10, 2020.", "Email interview, John Conklin, director of public information, New York State Board of Elections, Dec. 11, 2020.", "Phone, email interviews, Carol Franklin, election commissioner, Chenango County, Dec. 15, 2020.", "Email interview, Laura Costello, election commissioner, Madison County, Dec. 15, 2020.", "Phone interviews, Mary Egger, election commissioner, Madison County, Dec. 15, 16, 2020.", "Email interview, James Wahls, election commissioner, Tioga County, Dec. 16, 2020.", "Email interview, Tom Brown, election commissioner, Cortland County, Dec. 16, 2020.", "Syracuse Post-Standard, article, \"3 people voted by mail in Brindisi-Tenney race, then died. What happens to their votes?\" Nov. 24, 2020. Accessed Dec. 16, 2020.", "New York Post, article, \"Ballots cast by the dead emerge in extremely tight Brindisi-Tenney race,\" Accessed Dec. 16, 2020.", "Phone interview, Luke Jackson, Dec. 17, 2020.", "WBNG, story, \"Brindisi leads Tenney by 13 votes in the race for NY-22,\" Nov. 25, 2020. Accessed Dec. 17, 2020.", "Decision and order, Claudia Tenney vs. Oswego County et. al., Hon. Scott J. DelConte, Supreme Court of the State of New York, Oswego County, Dec. 8, 2020. Accessed Dec. 17, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]