["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assembly Speaker Carl Heastie", "Assembly Speaker Carl Heastie recently appeared before a panel of current and former comptrollers to make the case his colleagues deserve more pay. The panel eventually  recommended substantial raises for New York State’s 213 state legislators.", "During the public hearing in Manhattan, Heastie told the New York State Compensation Committee about several economic indicators, saying that as costs have risen, legislators’ pay has not.", "\"Under any objective measure, our static compensation has failed to keep pace with economic realities,\" he said.", "The consumer price index has risen, as well as the costs of health care, child care, and housing, while the base salary for legislators has remained at $79,500 for the last 20 years, Heastie said.", "\"During this same period, the state median household income has risen by 67 percent,\" Heastie said.", "Has lawmakers’ compensation failed to keep pace with \"economic realities?\"", "We reached out to an economist at the Brookings Institution to ask about the best way to evaluate Heastie’s argument that lawmakers’ salaries have lagged as expenses increased.", "Economist and Senior Fellow Gary Burtless pointed us to the Bureau of Labor Statistics, which offers a tool that calculates how inflation, as measured by the consumer price index, affects the buying power of a certain salary.", "Here’s what the calculator shows: It now takes a $121,954 yearly salary to have the same buying power that the legislators’ base $79,500 salary provided in January 1999, the last time a raise for legislators took effect.", "Burtless said the advantage of using the index when measuring whether wages have kept pace with expenses is that it accounts for all of the goods and services an average American consumes.", "A spokesman for the Federal Reserve Bank of New York also pointed us to the index in evaluating Heastie’s claim.", "Burtless, of the Brookings Institution, agreed with Heastie that the rise in the median household income \"provides additional, helpful information, quite apart from the cost of living.\"", "Heastie’s spokeswoman provided data from U.S. Census Bureau, Current Population Survey and the Annual Social and Economic Supplement for evidence that the median household income in New York has risen as legislators’ base salary has remained the same.", "The data show that in New York, the median household income was $62,447 in 2017, and it was $37,394 in 1998, the last time a raise was approved. The increase between 1998 and 2017 is indeed 67 percent.", "But there are other forms of compensation legislators receive in addition to their base salary.", "Legislators can also take home extra pay for various leadership positions, such as committee chairmanships. This extra pay ranges from $9,000 to $41,500 per year, depending on the job. In general, they can also collect mileage and a per diem rate of $59 for a day trip or $174 for an overnight stay while they are in Albany, which is set by the U.S. General Services Administration and increases over time.", "They can also participate in New York’s Empire Plan, a health insurance policy offered to state and some local government employees, or they can participate in a variety of health maintenance organizations, according to information provided by the state Department of Civil Service.", "\"The Empire Plan's combination of managed care features and reasonable copayments keep benefits rich and costs down,\" according to the state.", "For those in the legislators’ pay group, the state pays 84 percent of the premium for enrollees, and 69 percent for eligible dependents. This is consistent with national trends, according to a 2018 employer health benefits survey of private and non-federal public employers from Kaiser Family Foundation. The survey showed that \"on average, covered workers contribute 18% of the premium for single coverage and 29% of the premium for family coverage.\" The employee share of premiums in the legislators’ pay group for the Empire Plan is $1,490.58 for individuals and $5,831.54 for family coverage. Kaiser found that \"the average annual dollar amounts contributed by covered workers for 2018 are $1,186 for single coverage and $5,547 for family coverage, similar to the amounts last year.\"", "State lawmakers can also have dental and vision coverage, retiree health insurance, defined benefit or defined contribution retirement plans, according to Ken Girardin, a policy analyst with Empire Center for Public Policy, a nonprofit think tank that studies government spending.", "Girardin noted that the New York State Compensation Committee, in its Dec. 10 report, did not include an analysis of the entire compensation package lawmakers receive.", "The recommendation", "The compensation committee recommended incremental pay increases for legislators, reaching $130,000 in 2021. The recommendation stands unless lawmakers take action to stop it before the end of the year, which appears unlikely.", "The four-member panel -- former State Comptroller H. Carl McCall, State Comptroller Thomas DiNapoli, New York City Comptroller Scott Stringer, and former City Comptroller Bill Thompson -- were charged with making recommendations \"with respect to adequate levels of compensation, non-salary benefits, and allowances\" for legislators, statewide elected officials, and certain executive branch commissioners and department heads.\"", "During a public hearing on Nov. 13, the committee said it would consider job performance of state officials, \"overall economic climate,\" inflation rates, changes in public sector spending, pay for comparable positions elsewhere, whether the state can attract talented people given private-sector pay rates, and whether the state can afford to pay these positions more.", "The last raise for lawmakers came in 1998 and took effect in 1999.", "Two years ago, when a pay raise for legislators was under discussion, PolitiFact found Heastie’s claim that the purchasing power of legislators’ base salary was actually only $53,000, when inflation is taken into account, to be Mostly True.", "To support his case that state lawmakers deserve a pay raise, Heastie said that \"under any objective measure,\" lawmakers’ compensation had not kept up with their expenses.", "Data from the Bureau of Labor Statistics and the U.S. Census show how inflation has far outpaced legislators’ static salaries and how other New Yorkers’ have enjoyed growth in their household incomes over the last 20 years. However, a complete look at legislators’ compensation package would include their per diem income, which increases over time, and their health care and retirement benefits.", "We rate Heastie’s claim Mostly True.", "\"New York State Lawmakers Set to Receive First Pay Raise in Two Decades,\" Wall Street Journal, Dec. 6, 2018. Accessed Dec. 6, 2018.", "Public hearing video, New York State Compensation Committee 2018, Nov. 30, 2018. Accessed Dec. 4, 2018.", "Bureau of Labor Statistics CPI calculator. Accessed Dec. 12, 2018.", "Powerpoint presentation, New York State Compensation Committee 2018, Nov. 13, 2018. Accessed Dec. 5, 2018.", "Laws of New York, article 7, section 169. Accessed Dec. 5, 2018.", "Travel and per diem guidelines for Senate members, NYS Senate, Oct. 18, 2018. Accessed Dec. 6, 2018.", "A history of legislative pay raises in New York, Politico, Aug. 23, 2016. Accessed Dec. 6, 2018.", "Email conversation, Speaker Heastie spokeswoman Kerri Biche, Dec. 6, 2018.", "U.S. Census, Current Population Survey, Annual Social and Economic Supplements, Table H-8. Accessed Dec. 6, 2018.", "\"Senate Passes Charter Plan for Schools,\" Dec. 18, 1998, New York Times. Accessed Dec. 6, 2018.", "\"Salary worth less today than for state lawmakers than when first passed,\" PolitiFact New York, Nov. 18, 2016. Accessed Dec. 6, 2018.", "Email conversation, Jian Paolucci, director of public information, NYS Department of Civil Service, Dec. 7, 2018.", "Email conversation, Gary Burtless, economist and senior fellow, Brookings Institution, Dec. 12, 2018.", "Email conversation, Brian Manning, spokesman, Federal Reserve Bank of New York, Dec. 12, 2018.", "\"Highest legislative pay ever?\" Ken Girardin, Empire Center for Public Policy, Dec. 8, 2018. Accessed Dec. 12, 2018.", "Telephone conversation, Ken Girardin, Dec. 13, 2018.", "New York Compensation Committee Report, Dec. 10, 2018. Accessed Dec. 13, 2018.", "Department of Civil Service Health Insurance for Local Governments FAQ. Accessed Dec. 13, 2018.", "NYSHIP Rates and Deadlines 2018. Accessed Dec. 13, 2018.\n2018 Employer Health Benefits Survey, Kaiser Family Foundation, Oct. 3, 2018. Accessed Dec. 13, 2018.", "NYSHIP 2018 General Information Book, New York State Retirees. Accessed Dec. 14, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]