["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A campaign mail piece claiming that Republican Assemblyman Paul Anderson \"supports\" transgender bathrooms", "Several Republican state Assembly hopefuls are using campaign mail pieces to try and tie Nevada lawmakers to the debate surrounding bathroom access for transgender students.", "One such ad by Assembly candidate Steve Sanson depicts Assembly Majority Leader Paul Anderson looming over a bathroom stall, with overlaid text reading: \"Now teenaged boys can shower with your teenaged girls in public school locker rooms.\"", "Another from Assembly hopeful Blaine Jones depicts his primary opponent, Assemblyman Derek Armstrong, peering over a bathroom stall and implying that the Republican supports transgender bathrooms.", "Given recent headlines over bathroom access for transgender students, we thought it was worth checking into how Nevada deals with the issue.", "Legislative flashback", "Nevada lawmakers did tackle a bill in 2015 that would have required all students to use the bathroom that corresponded to their biological sex.", "After heated debate, Assembly members voted down the proposed bill with five Republicans (including freshman Armstrong, another mailer target) breaking rank and joining Democrats to defeat the measure.", "But the mailers themselves appear to be referring to another bill, SB504, which established a statewide anti-bullying program and was approved by all but a handful of legislators.", "The vast majority of that specific bill dealt with setting up a new statewide anti-bullying office and setting stricter requirements for reporting and investigating bullying.", "Several activists seized upon a 2015 legislative briefing released by the conservative Christian group Alliance Defending Freedom, which interpreted the new law as creating a \"new right\" for transgender students to access the bathrooms and shower rooms of their choice.", "In an endorsement letter, Assemblyman Ira Hansen said the new law \"mandated every school district in Nevada make all facilities ‘gender neutral.’\"", "But the law itself isn’t that clear-cut.", "A tangled legal web", "A mandate on bathroom access for transgender students is part of an ongoing legal debate that still doesn’t have a clear answer.", "UNLV law professor Ann McGinley says several federal courts have issued rulings indicating that transgender students fit under Title IX protections for gender equality, but any finality on a federal level will likely come from a future Supreme Court decision.", "McGinley says the question then falls to the state level, where the law is unclear.", "There’s nothing in state law that specifically mandates transgender students have the right to use the bathroom of the gender they identify with, but Republican Gov. Brian Sandoval’s office says the issue is essentially settled through the state’s broadly focused anti-discrimination laws.", "Lawmakers in 2011 expanded the state’s anti-discrimination laws to include gender identity and expression. Because these \"public accommodation\" laws cover \"place(s) of education,\" presumably school districts can’t segregate transgender students from using the gendered bathroom they identify with without violating state law.", "\"No change in policy is necessary and the Obama administration has no need to have concerns about Nevada schools,\" Sandoval spokeswoman Mari St. Martin said in an earlier statement.", "So how does the anti-bullying bill — SB504 — fit into the debate?", "Nestled in the bill are several new definitions of bullying, including \"blocking access to any property or facility of a school.\"", "The Alliance Defending Freedom brief uses that definition, along with the addition of gender identity or expression into classes protected by the legislation, to argue that it creates a \"new right\" for transgender students to use the bathroom of their choice.", "Sanson, one of the \"insurgent Republicans\" running against Anderson, referred to the ADF brief in several blog posts on his website, which also included letters from Assembly members Hansen and Shelly Shelton.", "\"President Obama recently federally mandated all locker-rooms and bathrooms be designated ‘gender-neutral’, but it was already Nevada law because of Anderson’s leadership,\" Hansen said in a letter.", "Anderson called the brief \"irrelevant\" in an interview with PolitiFact. He said the legislation itself was designed to create general anti-bullying guidelines and that the bill’s language was left intentionally vague.", "\"The goal was to create a vague definition so that school districts could apply their own policies,\" he said.", "\"To spin it in any other way is frankly disingenuous,\" he added.", "McGinley says defining the law as creating a \"new right\" is probably too broad, but it’s possible the new anti-bullying legislation creates additional legal standing in the event a school district is challenged in court over their policies around transgender students.", "That’s similar to how the Nevada branch of the American Civil Liberties Union plans to tackle the issue, according to the group’s policy director Holly Welborn. She said the ACLU has received several complaints related to transgender student bathroom access, but any lawsuit brought by the civil liberties group would likely stand on the already-existing public accommodation laws.", "\"It (SB504) certainly isn’t creating a new right, it’s a right that already exists,\" Welborn said.", "Different statewide standards", "Transgender student access to bathrooms and other school facilities is largely dependent on individual policies of school districts.", "The Obama administration used transgender student policy of the Washoe County School District in Reno as an example of best practices for other school districts to follow.", "The district approved regulations last year allowing students to \"use facilities that correspond to their gender identity as expressed by the student and asserted at school\" including access to locker rooms.", "It’s a different case in the rural Elko County, where in 2015 one transgender student’s request to use male-designated school facilities was rejected by the local school board (requiring the student to use unisex bathrooms instead).", "Elko school district officials told a local newspaper that they interpreted the Obama administration’s letter as a \"political statement\" and would continue to make decisions on transgender student access on a case-by-case basis.", "But the vast majority of Nevada’s students are in the Clark County School District (in Las Vegas), which has yet to approve district-wide regulations for transgender students.", "The district circulated an internal draft in 2014 that would have set a more defined policy for transgender student equal access, but it was never made public. Despite a board member’s 2015 request for clarity, the district has yet to approve any policy changes for transgender student access, instead making decisions on a case-by-case basis.", "District spokeswoman Michelle Booth said efforts to adopt a policy are ongoing.", "\"The Clark County School District has received the ‘Letter to Colleagues’ from the U.S. Department of Education and is currently studying the details closely to determine what if any changes we will have to make to remain in compliance with federal guidelines,\" she said in an emailed statement.", "McGinley said the uncertainty on federal and state levels means there’s no clear evidence of a mandate on allowing transgender students the right to use the bathroom of the gender they identify with.", "\"Each county and school district are making these determinations based on how much risk they’re willing to take,\" she said.", "Our ruling", "Several Republican Assembly candidates are claiming that legislators are forcing \"boys to shower with girls.\"", "Putting aside questions about the nature of gender, these ads just aren’t accurate. They refer to a piece of legislation that mostly deals with creating new anti-bullying policies. There is no clearly defined mandate in Nevada state law regarding transgender student access to bathrooms and locker rooms, and school districts around the state have very different standards county-to-county. Given the likelihood of future litigation on both a federal and state level, it’s misleading to connect a vaguely worded anti-bullying bill to the much more complicated area of transgender student rights.", "We rate these ads False.", "https://www.sharethefacts.co/share/5b783899-a799-4b5e-be8a-eae37ab688f1", "Phone interview, Steve Sanson, June 13, 2016", "Phone interview, Paul Anderson, June 13, 2016", "Veterans in Politics, \"ASSEMBLYWOMAN SHELLEY SHELTON’S OPEN LETTER TO VOTERS,\" June 12, 2016", "Email interview, Michelle Booth, Clark County School District spokeswoman, June 8, 2016", "Ralston Reports, \"Most disgusting attack robocall of the season,\" June 8, 2016", "Phone interview, William S. Boyd School of Law professor Anne McGinley, June 8, 2016", "Phone interview with ACLU Nevada Policy Director Holly Welborn, June 7, 2016", "Liberty Voice, \"Assemblyman Ira Hansen Issues Letter to LDS Community Urging Them to Reject Assemblyman Chris Edwards for Re-Election,\" May 27, 2016", "Elko Daily Free Press, \"Elko schools don’t plan to change transgender policy,\" May 18, 2016", "Reno Gazette-Journal, \"White House holds up Washoe schools as model for transgender treatment,\" May 16, 2016", "Las Vegas Review-Journal, \"Clark County schools waiting to comment on federal transgender requirement,\" May 13, 2016", "Associated Press, \"Transgender student's bathroom request stirs Nevada debate,\" Oct. 5, 2015", "EAGNews.org, \"Did Republican NV governor sneak wording into law allowing transgender school bathroom access?,\" June 10, 2015", "Las Vegas Review-Journal, \"CCSD board member requests report on transgender policy progres,\" May 28, 2015", "Las Vegas Review-Journal, \"Transgender student pleads with CCSD to step up, protect her rights,\" May 26, 2015", "Las Vegas Review-Journal, \"Nevada Gov. Brian Sandoval signs anti-bullying legislation,\" May 20, 2015", "Associated Press, \"Assembly rejects transgender ‘bathroom bill,’\" April 22, 2015", "Reno Gazette-Journal, \"NV transgender bill will get hearing, is potentially illegal,\" April 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]