["By Saranac Hale Spencer", "Posted on December 15, 2020", "A video circulating on social media falsely claims that vaccines for COVID-19 have a microchip that “tracks the location of the patient.” The chip, which is not currently in use, would be attached to the end of a plastic vial and provide information only about the vaccine dose. It cannot track people.", "COVID-19 vaccines have begun rolling out, but so has misinformation about them.", "A video claiming that the vials containing the vaccines have a microchip that “tracks the location of the patient” has been viewed more than 225,000 times on Facebook, according to data from CrowdTangle.", "That’s false.", "The claim is based on a misrepresentation of an interview with Jay Walker, an executive for a medical device company called ApiJect.", "That interview was posted in May on the website for the Christian Broadcasting Network, a nonprofit founded by conservative televangelist Pat Robertson. In the interview, Walker explained that his company had received a federal contract to ramp up production of its prefilled syringes so that they would be available for use in administering either vaccines or therapeutics for COVID-19.", "The ApiJect syringes work like an eyedropper, Walker explained, with a plastic pouch as the vial. The syringes can also be made with an optional chip that could be attached to the end of the plastic vial to store information about its contents. The chip is an RFID tag, which is short for radio frequency identification, and requires a device to scan and read the data.", "“What that chip does is it has the unique serial number for each dose,” Walker said in the original interview. “It is designed so that there is no counterfeiting. It is designed so that we’ll know exactly that the right dose hasn’t expired. However, that chip only refers to the dose — there’s no personal information, no patient information. It’s simply like a barcode, only we know instantaneously where and when that dose has been used.”", "That portion of the interview wasn’t included in the video that’s currently circulating. Instead, the video includes the falsehood that the chips would be used to track the location of individual patients.", "It’s unclear how that would even work, though, since the RFID tag is attached to the vial and can’t be injected into a patient. Steven Hofman, spokesman for ApiJect, told us in an interview that the idea of the RFID tags being used to track individuals is “beyond fantasy.”", "In reality, the chip would allow those administering the vaccine to check that the dose hasn’t expired and isn’t counterfeit, Hofman said. “It’s incapable of collecting any personal information,” he said.", "Also, it’s worth noting that ApiJect’s syringes aren’t being used for either the currently available vaccine developed by Pfizer and the German biotech company BioNTech or the next one up for emergency use authorization, which was developed by Moderna.", "“Neither Moderna or Pfizer are using our syringe at this point,” Hofman said.", "Despite the fact that the syringes aren’t currently being used for COVID-19 vaccines and the optional chips they use can’t track individuals, many Facebook users left comments on the video expressing a misunderstanding.", "“Nope, never had flu shot, won’t take this either! Especially one with a tracking device. What a crock,” wrote one user.", "The misconception that vaccines may be used as a vehicle to implant tracking devices isn’t new, though. At the beginning of the pandemic we wrote about a similar claim that anticipated Bill Gates would use a COVID-19 vaccine to track people with microchips. That was bogus, too.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Johnson, Lorie. “RFID Chip May Be Tied to the New Coronavirus Vaccine.” CBN News. 22 May 2020.", "U.S. Department of Defense. Press release. “DOD Awards $138 Million Contract Enabling Prefilled Syringes for Future COVID-19 Vaccine.” 12 May 2020.", "ApiJect. “When COVID-19 vaccine and injectable therapeutics become available, the RAPID Consortium can ease a U.S. supply chain problem by filling and finishing 300+ million prefilled syringes per month.” Accessed 14 Dec 2020.", "Food and Drug Administration. “Radio Frequency Identification (RFID).” 17 Sep 2018.", "Hofman, Steven. Spokesman, ApiJect. Telephone interview. 14 Dec 2020.", "McDonald, Jessica. “A Guide to Pfizer/BioNTech’s COVID-19 Vaccine.” FactCheck.org. Updated 12 Dec 2020.", "Hale Spencer, Saranac. “Conspiracy Theory Misinterprets Goals of Gates Foundation.” FactCheck.org. 14 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]