["About this rating", "The map used in the meme was taken from an article on mass shootings.", "Data exists in a form from which a meaningful side-by-side comparison can be easily made.", "The number of planned or thwarted incidents of Islamic terror in the period cited; the accuracy of visual proportions included on the map.", "On 25 February 2016, a Facebook user shared the above meme:", "Scary map of all Islamic terror attacks in the US. JK, it's just all mass shootings by Americans since Sandy Hook", "The map provided no sources, dates, or information about what constitutes a mass shooting.  As it turned out, it was taken from a 21 February 2016 Vox piece sourced from the Gun Violence Archive, using their specific definition for what makes a \"mass shooting event\":", "The counts come from the Gun Violence Archive, a database that tracks events since 2013 in which four or more people (not counting the shooter) were shot at the same general time and location. The database’s researchers comb through hundreds of news stories, police reports, and other sources each day and individually verify the reports. Still, since some shootings aren't reported, the database is likely missing some shootings, and some are missing details.", "The inconsistency in definitions for the term \"mass shooting\" provided some ambiguity. As Vox noted, the Gun Violence Archive also counted shootings in which individuals were shot but not killed (whereas many others counted only shootings where four or more victims died).", "But not everyone agrees with this definition. Northeastern University criminologist James Alan Fox, for example, defines mass shootings more widely, as any shooting in which at least four people were murdered. Under those terms, mass shootings don’t appear to be increasing.", "Researchers from the Harvard School of Public Health call the definition Fox uses too broad, since it catches domestic, gang, and drug-related shootings that aren’t usually considered mass shootings in layman’s terms.", "The Gun Violence Archive is even broader — counting not just murders but injuries, too.", "The closest match we were able to track down for the original meme looked like this (and the results didn't differ much from PBS's map of 2015 mass shootings):", "We tried to track down a map showing attacks motivated by Islamic terrorism in the United States. We were unable to find either a list or a map that showed that information, although we did find a New York Times article from 2015 contrasting fears of Islamic terror attacks with a measurable number of \"homegrown extremist\" incidents. In 2014, CNN said Muslim extremists had killed 21 people within the United States since 12 September 2001, but the provided citation was no longer available.", "The Federal Bureau of Investigation's \"Terrorism\" page led to a National Counterterrorism Center (NCTC) timeline, as well as a list of major terrorism cases. A direct list of victims of Islamic terrorism on American soil has historically been notoriously difficult to come by.", "Since the Sandy Hook shootings, we found two confirmed instances of attacks that appeared motivated by Muslim extremist ideology on American soil. One was the April 2013 Boston Marathon bombing, the other the December 2015 San Bernardino attacks. Five people died in the Boston attacks, and 14 in San Bernardino (excluding the attackers), bringing the combined total to 19 deaths in the United States attributed to Islamic terrorism since December 2012, when gunman Adam Lanza shot and killed 20 children and six women at Sandy Hook Elementary School.", "An accurate map of fatal incidents on American soil attributable to Islamic terrorism since December 2012 would, then, look something like this:", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]