["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Why people continue to attribute fake quotes to the Founding Fathers, we may never know.", "This time, a Facebook post claims that a quote about the Bible and governing came from none other than the first U.S. president, George Washington.", "The spurious quote attributed to Washington goes as follows: \"It is impossible to rightly govern a nation without God and the Bible.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "You guessed it. There is no evidence to suggest that Washington ever said or wrote this.", "Washington’s Mount Vernon estate included the quotation in its list of \"spurious quotations\" and had this to say about it:", "\"The quote is frequently misattributed to Washington, particularly in regards to his farewell address of 1796. The origin of the misquote is, perhaps, a mention of a similar statement in a biography of Washington first published in 1835. However, the quote that appeared in the biography has never been proven to have come from Washington.\"", "That biography, \"Paulding’s Life of Washington\" by James Kirke Paulding, includes a variation of the quote on page 209: \"It is impossible to govern the universe without the aid of a Supreme Being.\" Even that unsubstantiated listing doesn’t include the words \"a nation,\" \"God\" or \"the Bible.\"", "The quote also does not appear in the \"Complete Works of George Washington\" collection or in databases of his archived speeches or writings.", "David Sewell, manager of digital initiatives at University of Virginia Press for Founders Online, a database of documents from the U.S. Founding Fathers, told PolitiFact it’s safe to say there is no evidence Washington said this quote.", "\"George Washington almost never mentioned the Bible in his diary or correspondence with others,\" Sewell wrote in an email. \"A search in Founders Online returns only ten results, and many of those are in footnotes.\"", "Posts on social media attribute a questionable quote to Washington about the impossibility of governing \"a nation without God and the Bible.\"", "After searching several databases and archives of Washington’s works, we find no evidence he ever said this. Additionally, the leading George Washington scholars say they don’t believe he did, or even would, say it.", "We rate this quote False.", "Correction, July 17, 2019: \"Paulding’s Life of Washington\" by James Kirke Paulding reads, \"It is impossible to govern the universe without the aid of a Supreme Being.\" An earlier version of this post contained a typo in that passage; it has been updated. The ruling remains unchanged.", "Facebook post, July 11, 2019", "MountVernon.org, Spurious Quotations, Accessed July 11, 2019", "CheckYourFact, FACT CHECK: DID GEORGE WASHINGTON SAY IT’S ‘IMPOSSIBLE TO RIGHTLY GOVERN’ WITHOUT GOD, THE BIBLE?, May 31, 2019", "Google Books, \"Paulding’s a Paulding's A Life of Washington\" p. 209; Accessed July 11, 2019", "Founders Online Archive, George Washington, Accessed July 11, 2019", "Google Books, The Complete Works of George Washington, Nov 9, 2017", "MountVernon.org, Speeches, Accessed July 11, 2019", "Email interview, David Sewell manager of digital initiatives at the University of Virginia Press for Founders Online, July 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]