["About this rating", "On 6 August 2017, the fake news web site Loyalys posted an article in which it was reported that Russian scientists have discovered a \"cure to [sic] homosexuality\":", "Novosibirsk | Dr. Dimitri Yusrokov Slamini of the Russian Institute for Medical Science in Novosibirsk and his team of researchers have discovered what they claim to be a new vaccine which could prevent early symptoms and even cure humans from homosexuality, if treated at a young age.", "Russian scientists developed the so-called «antidote» based on a 1959 scientific research published under the title “Organizing action of prenatally administered testosterone propionate on the tissues mediating mating behavior in the female guinea pig” by Charles H. Phoenix, an american researcher. The study concluded that “INAH [part of the hypothalamus] is dimorphic with sexual orientation, at least in men, and suggests that sexual orientation has a biological substrate”.", "Among the discoveries we made while looking into this story was that Loyalys.com was less than two weeks old when the article was published (the domain name was registered on 25 July 2017 by the Albanian owner of another fake news site, OnlineNativeNews.com), yet the text itself dates back to May 2014, when it first appeared, verbatim, on the web site World News Daily Report (WNDR), a tireless purveyor of \"satirical\" content since 2013.", "As to the question of the article's authenticity, then, we refer you to WNDR's own disclaimer, which reads:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "Getting down to specifics, there is no Russian Institute for Medical Science in Novosibirsk, Siberia (although the Russian Academy of Sciences is located there), nor were we able to find evidence of the existence of the two Russian scientists named as participants in the research, Dr. Dimitri Yusrokov Slamini and Dr. Yuri Krutchev.", "So, no, these nonexistent Russian scientists did not discover a \"vaccine\" or \"cure\" for homosexuality (which is neither a disease nor a medical condition in the first place).", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]