["On January 6, Twitter handle Know The Nation (@knowthenation) tweeted a video of Rahul Gandhi addressing the Lok Sabha on the Rafale Deal. In the 9-second clip, the Congress President can be heard saying – “I have no proof so far, but I am very clear that the Prime Minister is directly involved.” This gave the impression that Gandhi was accusing PM Modi of corruption without any evidence. At the time of writing this article, Know The Nation’s video had nearly 1 million views. An archived version of its tweet can be accessed here.", "“I have no proof so far, but I am very clear that the Prime Minister is directly involved”#RafaleDeal pic.twitter.com/54AUXcG7sz", "— Know The Nation (@knowthenation) January 6, 2019", "The clip is also viral on Facebook in varied languages. A page called Youth 4 BJP shared it in Hindi, gaining 67,000 views in just a couple of hours. Another page Hindustan shared the clip in Tamil.", "The 9-second clip is viral on Twitter, circulated by many users followed by senior leaders of the Bharatiya Janta Party. One Mohan Sinha, who is followed by PM Modi, quote tweeted Know The Nation’s video saying that Rahul Gandhi’s “brain is missing a few vital screws.”", "Another user who is followed by BJP Delhi spokesperson Tajinder Pal Singh Bagga shared the same video, attracting over 53,000 views.", "Several handles followed by Railway Minister Piyush Goyal’s Office also tweeted the 9-second clip (1, 2, 3). A few others took a jibe at the Congress President based on the purported quote (1, 2, 3).", "Know The Nation tweeted 9 seconds of a much longer video and placed Rahul Gandhi’s statement out of context. If one listens to his entire speech, Gandhi does not say, “I have no proof so far, but I am very clear that the Prime Minister is directly involved.” In fact, his statement was directed at Defense Minister Nirmala Sitharaman. He says that he does not have any proof so far of her involvement, but the Prime Minister is directly involved in the scam.", "At 4:26 minutes in the full video, Gandhi can be heard saying – “Defense Minister said that we are accusing her…Madam I am not accusing you and I am not accusing Mr Parrikar. I am accusing Mr Narendra Modi. Let it be absolutely clear that you have done nothing other than try to defend a lie. So I do not think that you are involved in the Rafale scam. I have no proof so far to say that you are involved but I am very clear that the Prime Minister is directly involved in the Rafale scam.“", "Know The Nation picked the last portion of Gandhi’s statement (highlighted above), clipped the part where he said – “to say that you are involved” – and presented his assertion as, “I have no proof so far, but I am very clear that the Prime Minister is directly involved.”", "Know The Nation has been around on Twitter since December 2017. Despite a meagre follower count of a little over 2,500, it boasts a few prominent political personalities like Office of Railway Minister Piyush Goyal and BJP Delhi spokesperson Tajinder Pal Singh Bagga among its followers.", "The craftily trimmed video of Rahul Gandhi’s speech owes its existence to the organisation behind the Twitter handle.", "Last year, a company named BlueKraft Digital Foundation was linked for running a website called The True Picture, which is ironically described as a ‘data journalism and fact-checking portal’. It is a go-to website for several Union Ministers, including Textile Minister Smriti Irani, however, has been found spreading misinformation in the past.", "The Indian Express had found that the website shared its landline telephone number with BlueKraft, which was the “technology and knowledge” partner to Prime Minister Modi’s book ‘Exam Warriors’. The company also published a book about PM Modi’s monthly radio broadcast, ‘Mann Ki Baat’, terming it a “social revolution on radio”.", "In an April 2018 report, Boomlive had found several of BlueKraft’s employees directly associated with The True Picture.", "BlueKraft is headed by Akhilesh Mishra, the former director of the BJP government’s online citizen engagement initiative ‘MyGov India’. When contacted by The Indian Express, Mishra had denied any links between his company and The True Picture.", "BlueKraft’s association with the BJP seems to extend further. There is evidence of the company’s connection with three other pro-BJP propaganda platforms – New India Junction, Awemazing World and the protagonist of this story, Know The Nation.", "A Senior Creative Director at BlueKraft, Nilesh Mistry, listed the handles as part of his responsibilities along with The True Picture and called them ‘in-house blogs’. His LinkedIn profile read – “Working on – Government of India’s various schemes print, outdoor and social media advertising. Inhouse blogs: New India Junction, Know The Nation, AwemaningWorld, The True Picture.” After the same was revealed on social media, he removed these references (except New India Junction) from his profile.", "The evidence at hand exhibits the company’s links with multiple propaganda platforms, some of which also disseminate misinformation. Therefore, its apparent closeness with the BJP and the Prime Minister himself is a matter of concern. Alt News has reached out to Akhilesh Mishra for his comments. We will update our story upon receiving a response.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]