["About this rating", "In late August 2018, an image purportedly showing a snake found inside a plastic milk jug started circulating on social media:", "While some social media users presented this picture with first-person phrasing (as if they had personally purchased a snake-infested gallon of milk from the store), this was not a genuine photograph of a snake (or snakes) trapped inside a milk jug.", "This image was created submitted to a 2006 Photoshop contest hosted by the web site Worth1000 by user \"microfracture.\" Worth1000 (now DesignCrowd) frequently held Photoshop contests in which participants were asked to use digital editing tools to create convincing (but fake) images. The picture of the snake in the milk jug was created for the \"Obvious Tampering 2\" contest, which tasked contestants with having \"a little fun with product tampering\":", "In tonight's contest, we're going to have a little fun with product tampering. Everything is saftey sealed for our protection now, so it's already pretty easy to tell if something has been tampered with, but we're asking you to make it *really* obvious ...", "For obvious reasons, you MUST significatly change the name of your product- do NOT use a registered trademark or brandname in your image.", "The rules of the game are thus: Create an image that shows evidence of obvious product tampering, and be sure to change any registered trademarks or brandnames that appear in your image. As always, quality is a must. We will remove poor entries no matter how much we like you. You will have 48 hours for this contest, so make your submissions count.", "This image of a snake in a milk jug did not win the \"Obvious Tampering 2\" contest. However, the fact that it continues to fool some viewers more than a decade after its creation might be considered a worthy consolation prize.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]