["Two pictures of a lady cutting a tricoloured cake are widely shared on social media. It is being claimed that she is Facebook India’s Public Policy Director, Ankhi Das, disrespecting the national flag. Das has been in the news after an investigative report published by The Wall Street Journal revealed that she blocked applying Facebook’s hate speech rules to Hindu nationalists and leaders of the Bharatiya Janata Party (BJP).", "Many users said that if an Indian Muslim had cut a tricoloured cake, the act would’ve received immense outrage and condemnation. Facebook user Abdul Najeeb Khan shared these pictures with the same claim, which was shared 3,300 times. (Archive)", "Across Twitter and Facebook, these pictures are being shared with the same caption: “देश का अपमान नहीं सहेगा हिंदुस्तान की आंखी दास ने तिरंगे का केक बनाकर काटा अगर यही काम किसी मुसलमान ने किया होता मीडिया से लेकर नेता तक विधवा विलाप करने लगते।”", "Alt News also received multiple requests on WhatsApp (+91 7600011160) to verify these claims.", "Upon conducting a reverse-image search, we found a post from August 16 by Sangeeta Bahadur, who is the Indian Ambassador to Belarus. The post mentioned that the Indian Embassy in Minsk celebrated the 74th Independence Day. “In the midst of the ongoing turmoil in Belarus, we celebrated India’s 74th Independence Day at the Embassy in Minsk. Our fears that the very difficult situation in the city would keep most people away proved, however, to be unfounded. Not only did the miniscule but very patriotic Indian community and students turn out in full force; even our Belarusian friends joined us in substantial numbers and participated in the event with affectionate enthusiasm,” she wrote in a post dated August 16. It includes the same picture of Bahadur cutting the cake.", "In the midst of the ongoing turmoil in Belarus, we celebrated India’s 74th Independence Day at the Embassy in Minsk. Our…", "Posted by Sangeeta Bahadur on Saturday, 15 August 2020", "Apart from this, Sangeeta Bahadur and Ankhi Das have facial dissimilarities especially the eyes and nose.", "The website of the Indian Embassy in Belarus had also shared pictures of the recent independence day celebrations. Sangeeta Bahadur can be seen in these pictures.", "Pictures Indian Ambassador to Belarus Sangeeta Bahadur cutting a tricoloured cake during independence day celebrations was shared with the false claim that she is Facebook India’s Public Policy Director, Ankhi Das.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]