["A photograph of policemen making people squat and hold their ears was shared by journalist Rana Ayyub with the claim that these were labourers who were punished for stepping out during the lockdown imposed in light of the coronavirus pandemic. Ayyub later took down her tweet.", "On March 24, Prime Minister Narendra Modi announced a 21-day lockdown in the country, barring essential services. This has left migrant workers across the country on the streets. There have also been reports of police excess on labourers trying to get to their home states on foot.", "The image was also shared by historian William Dalrymple and the official Twitter handle of JNU Students’ Union. Dalrymple subsequently took down the tweet.", "A quick reverse image search on Google redirects to several news reports from March 25 where the photograph has been used – The Hindu, Financial Express and Outlook.", "According to description attached to the image: “Police personnel punish offenders flouting lockdown guidelines, imposed in wake of coronavirus pandemic, at Chakeri area of Kanpur, on March 24, 2020.” The Hindu credited the photograph to PTI.", "Alt News contacted PTI photographer Rahul Shukla who got the photograph shot by a colleague on March 24 after he was informed of the police action. “This picture was shot at around 1:30 pm. Section 144 was imposed and 75 districts in Uttar Pradesh were under lockdown.” It is noteworthy that UP Chief Minister Yogi Adityanath had announced a lockdown in Kanpur starting March 23. “These people had stepped out without any reason. Some were on foot while others were on bikes. None of these people was able to prove to the police that they had stepped out for either ration or medicine,” said Shukla.", "He further informed that the police asked those who violated lockdown protocol to show ID cards. “Had these people been migrant workers from say, Delhi or Bihar, they would’ve shown their Aadhaar cards for proof of residence and the police wouldn’t have punished them. But they were unable to provide ID proof.”", "There are also hints in the photograph which suggest that the people being punished are not migrant workers – motorcycles in the background and the lack of luggage.", "Alt News checked the PTI photo gallery and confirmed that the image was indeed shot on March 24.", "Therefore, a photograph of police in Kanpur punishing people for stepping out during lockdown was shared as migrant workers being mistreated. Both Ayyub and Dalrymple did not provide clarifications on their incorrect tweets.", "After Rana Ayyub’s tweet, several users attempted to fact-check her claim and uploaded screenshots asserting that the photograph is from last year. Among them was BJP leader Varun Gandhi’s secretary Ishita Yadav.", "You “dear country” is already crying because it has people like you, @RanaAyyub. pic.twitter.com/FheERePzoY", "— Ishita Yadav (@IshitaYadav) March 30, 2020", "Twitter handle @TheSquind also claimed that the image is from 2019.", "Why @MumbaiPolice is not taking action against @RanaAyyub for spreading hate & fake News pic.twitter.com/2kwQKZFWn6", "— Isolated Squinty (@TheSquind) March 30, 2020", "So did the handle @erbmjha.", "This is how propaganda works.@RanaAyyub tweeted an old image to defame the govt. @DalrympleWill picked it up & spread the same narrative.", "When it’s done, Rana Ayyub deleted her tweet. Agenda Successful! pic.twitter.com/5oYlQsbQM5", "— BALA (@erbmjha) March 30, 2020", "The image, however, as shown in this article, was shot on March 24, 2020.", "Dates reflected by Google reverse image search are often inaccurate as the search process frequently throws up results for images which are not the featured/primary images associated with the article but thumbnails of other articles. This happens because many websites list articles related to the report one might be reading. While fact-checking, it is important to open the report and ensure that the image returned during the reverse image search process corresponds to the article in question.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]