["About this rating", "In May 2018, a disreputable fake news blog exploited the tragic death of English toddler Alfie Evans, with a clickbait headline falsely claiming that a scientific study had shown aluminum from vaccines played a role in his demise.", "The headline for YourNewsWire.com's article reads \"Study Shows Aluminum Was Present in Baby Alfie Evans' Brain,\" and claims in the story that it came from vaccinations:", "A breakthrough study suggests that aluminum from vaccines was likely present in baby Alfie Evans’ brain, which resulted in his death.", "Alfie Evans was born perfectly healthy, but got a degenerative neurological disorder at a year old after receiving six vaccines in one doctor visit. The vaccines triggered an auto immune disorder that caused his immune system to destroy his brain.", "The study cited by Your News Wire was completed in July 2017 and \"investigated the effect of aluminum adjuvants on social behaviour in mice.\" It did not mention, or even allude to, any specific ongoing medical case, including that of Alfie Evans.", "Evans died on 28 April 2018, just short of his second birthday. He suffered from a rare degenerative brain disease (there is no evidence that aluminum poisoning played any role in the development of his condition) and had been removed from life support five days earlier, after a protracted court battle which saw his parents, Tom Evans and Kate James, petitioning the High Court of England and Wales for permission to remove him from the care of Alder Hey Children's Hospital in Liverpool and take him to Italy for ongoing treatment.", "The High Court denied the parents' appeals, finding that \"Alfie's brain had been so corroded... that there was simply no prospect of recovery.\" As of 2 May 2018, no coroner's inquest into Evans's death had been published, and the infant's exact medical condition was \"undiagnosed with any precision,\" according to the Court of Appeal of England and Wales.", "This information, coupled with the fact that the \"breakthrough study\" cited by Your News Wire did not mention any medical case and that there is no proof Evans received multiple vaccinations (although this is possible), means the web site's central claims about evidence linking Alfie Evans's death with aluminum in vaccines are no more than outrageous and cynical falsehoods.", "Sheth, Sneha K.S.; Li, Yongling; Shaw, Christopher A.  \"Is Exposure to Aluminium Adjuvants Associated With Social Impairments in Mice? A Pilot Study.\"\r\n  Journal of Inorganic Biochemistry.  April 2018.", "Grierson, Jamie.  \"Alfie Evans Dies at Alder Hey Hospital After Life Support Withdrawn.\"\r\n  The Guardian.  28 April 2018.", "McFarlane, Lord Justice Andrew.  \"Judgement -- Applicants: Thomas Evans and Kate James, Respondents: Alder Hey Children's NHS Foundation Trust and Alfie Evans.\"\r\n  Court of Appeal (England and Wales.)  25 April 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]