["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Supreme Court candidate Tim Burns, a Democrat outspoken about his liberal political views, describes himself as the grandson of Mississippi sharecroppers who is running for \"people who struggle.\"", "In his first TV ad, released Feb. 6, 2018, the Madison attorney portrays himself in a similar vein when the narrator says:", "Meet Tim Burns. He grew up without much and became one of America’s leading consumer lawyers.", "But if you’re picturing an attorney who mainly represents individuals,that’s not Burns.", "Burns, who faces left-leaning Milwaukee County Circuit Judge Rebecca Dallet and conservative Sauk County Circuit Court Judge Michael Screnock in the Feb. 20, 2018 primary, has represented individuals in some class-action lawsuits.", "But his specialty is representing big businesses, not consumers, that sue their insurance companies.", "And leaving aside the claim in his TV ad, Burns has often described himself as having major business clients, not as a consumer lawyer.", "Overview of Burns’ legal background", "A Milwaukee Journal Sentinel review of Burns’ legal background found:", "He has a law practice that focuses on suing insurers.", "His clients have included a mining company that couldn’t get an insurance payout when a Colorado quarry collapsed in a landslide and all mining ceased; and Stryker Corp., a Michigan manufacturer suing its insurer because the insurer denied coverage for injury claims filed by people who alleged the company’s \"Uni-knee\" knee replacement product was defective and caused injuries.", "Burns told the Journal Sentinel about representing Stryker: \"I wasn’t representing the client against the little guy. I was representing the client against the big insurance company. … What I’m trying to do is to get the insurance company to pay for the problem because insurance companies have promised to pay for problems.\"", "But, to be clear, in that case Burns was not representing an individual suing a hip replacement manufacturer.", "Rather, he was representing the manufacturer in a lawsuit, with the manufacturer trying to get its insurance company to pay individuals for claims about injuries caused by its products.", "That’s in contrast to consumer attorneys such as Milwaukee lemon law lawyer Vince Megna, who built his career by suing car dealers and manufacturers, and ran for the Supreme Court in 2013.", "Burns’ evidence", "To back Burns’ claim about being a consumer lawyer, his campaign began its description of Burns’ legal work to us by saying he built a national practice representing policyholders, \"otherwise known as insurance consumers.\" Burns himself told us: \"I’m using a dictionary definition of consumer,\" in that businesses consume insurance. \"I am 100 percent a consumer lawyer,\" he said.", "But the usual understanding of a consumer -- particularly in the context of Burns’ campaigning as a fighter for ordinary people -- is an individual. The understanding is not that a business is a consumer simply because it buys insurance.", "Burns’ campaign also cited to us a page from the website of Perkins Coie; Burns is a partner in the Seattle-based law firm’s Madison office. That page says the firm’s insurance recovery attorneys (Burns is one) have helped shape \"pro-policyholder law.\"", "But the page doesn’t mention consumers. In contrast, the firm touts having represented \"leading companies in almost every industry, including Fortune 500 and Global 500 companies, as well as public sector policyholders.\"", "Burns’ campaign also cited a handful of cases in which Burns represented individuals.", "In a 2015 lawsuit, for example, he and other lawyers represented a New York man in a class-action lawsuit. The suit claimed MetLife was not setting aside the required reserves for the purpose of paying potential insurance claims and that MetLife should reimburse him and the other class members for premiums they paid.", "But by and large, Burns’s clients are not individuals, but businesses -- as he himself has stated on at least three occasions.", "Burns’ own statements", "1. Answering candidate questions from the nonpartisan Wisconsin Policy Forum, Burns emphasized his business clients when he wrote:", "I’ve built a national practice as one of America’s leading attorneys in standing up to massive insurance companies. I have been hired by major businesses in three dozen states and 10 foreign countries to handle their most sensitive insurance issues, but I’ve also represented regular working people in class actions seeking to hold insurance companies accountable for financial fraud ….", "In the current field of candidates and on the current Supreme Court, I have the most experience working with American businesses by far. I’ve been hired by the many of the top manufacturing, banking, and investment companies in the world or their boards of directors to advise them on their most sensitive issues concerning liability and insurance.", "2. His campaign website also touts major clients, saying:", "Tim is one of America's leading attorneys in standing up to large insurance companies. Tim has been hired by major clients in three dozen states and ten foreign countries to handle their most sensitive issues.", "3. The profile Burns put on the business networking site LinkedIn says:", "Tim Burns is a member of the Insurance Recovery Practice group at Perkins Coie LLP. The Insurance Recovery Practice group has more than thirty lawyers who devote their practice to representing corporate policyholders in insurance coverage matters.", "And Burns’s profile on his law firm’s website also cites business:", "Tim is favorably ranked in the 2006 (Illinois), 2007 (recommended in \"Insurance\" nationally), and 2008 to 2016 (Band 2 - nationally) editions of Chambers USA: America's Leading Lawyers for Business.", "The picture is clear.", "Our rating", "Burns says he is \"one of America's leading consumer lawyers.\"", "The bulk of his legal work is not representing individual consumers, but rather large businesses that are suing their insurers.", "We rate Burns’ statement False.", "YouTube, Tim Burns ad, Feb. 6, 2018", "Email, Tim Burns campaign spokeswoman Amanda Brink, Feb. 12, 2018", "Interview, Tim Burns, Feb. 13, 2018", "Email, Rebecca Dallet campaign spokeswoman Jessica Lovejoy, Feb. 13, 2018", "The Wisconsin Taxpayer, Wisconsin Policy Forum candidate questions, January 2018", "Milwaukee Journal Sentinel, \"Tim Burns hopes to join state Supreme Court but has only had one case in Wisconsin court,\" Feb. 8, 2018", "Perkins Coie, \"Insurance Recovery Law,\" accessed Feb. 12, 2018", "TopClassActions.com, \"Metlife Hit With Shadow Insurance Class Action Lawsuit,\" Jan. 22, 2015", "Pacer, Continental Materials Corp. vs. Affiliated FM Insurance Co. lawsuit, Nov. 29, 2010", "Pacer, Stryker Corp. vs. National Union Fire Insurance Co. lawsuit, Oct. 4, 2001", "Insurance News Net, \"5 Class Action Suits Target ‘Shadow Insurance,’\" April 13, 2015", "Perkins Coie, Tim Burns profile, accessed Feb. 12, 2018", "U.S. Court of Appeals, decision in Stryker case, June 5, 2012", "Tim Burns campaign website, \"About Tim,\" accessed Feb. 12, 2018", "LinkedIn, Tim Burns profile, accessed Feb. 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]