["On Nov. 7, the day news organizations projected that Joe Biden won the presidential election, Rep. Alexandria Ocasio-Cortez, D-N.Y., celebrated the victory on Twitter.", "\"Congratulations to President-elect Joe Biden & Vice President-elect Kamala Harris,\" she wrote.", "But a fake, sinister-sounding tweet that’s spreading on social media has some people confused about what the lawmaker actually said.", "\"Congrats to President Joe Biden,\" a picture of the tweet says. \"Now let’s begin ‘The Purge’ to roundup all Conservative traitors! Democrats, let’s make Auschwitz look like a picnic!\"", "In some social media posts the image is labeled \"Democrat Party hate speech.\"", "They were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Though the image of the fake tweet uses the same photo of Ocasio-Cortez that her personal account, @AOC, features, this one has been doctored.", "Searching the @AOC account for references to a \"purge,\" we found none matching what was said in the fake tweet. We also didn’t find the word \"purge\" in any of the tweets from the account maintained by her staffers, @RepAOC.", "And we didn’t find the fake tweet among tweets Ocasio-Cortez has deleted from her @AOC or @RepAOC accounts.", "Ocasio-Cortez did recently refer to Auschwitz in a tweet following the Jan. 6 mob attack on the U.S. Capitol. But she appeared to be describing one of the rioters who was photographed inside the Capitol wearing a sweatshirt that said \"Camp Auschwitz.\"", "We rate this Facebook post Pants on Fire.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Jan. 12, 2021", "Alexandria Ocasio-Cortez tweet, Nov. 7, 2020", "Alexandria Ocasio-Cortez tweet, Jan. 9, 2021", "ProPublica, Deleted tweets from Alexandria Ocasio-Cortez, visited Jan. 13, 2021", "@AOC Twitter account, visited Jan. 12, 2021", "@RepAOC Twitter account, visited Jan. 12, 2021", "The New York Times, Rioter wearing ‘Camp Auschwitz sweatshirt is arrested, according to law enforcement, Jan. 13, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]