["About this rating", "Donald Trump's transition team said no exceptions would be allowed for ambassadors requesting to extend their postings past Inauguration Day, while other presidents have made exceptions on a case-by-case basis.", "The resignation of politically appointed ambassadors at the start of a new administration is commonplace, not unprecedented.", "On 5 January 2016, the New York Times published an article concerning a State Department cable sent to diplomats on 23 December 2016 by President-elect Donald Trump's transition team, informing them that they were to leave their posts prior to Inauguration Day \"without exception\":", "President-elect Donald J. Trump's transition staff has issued a blanket edict requiring politically appointed ambassadors to leave their overseas posts by Inauguration Day, according to several American diplomats familiar with the plan, breaking with decades of precedent by declining to provide even the briefest of grace periods.", "The mandate — issued \"without exceptions,\" according to a terse State Department cable sent on Dec. 23, diplomats who saw it said — threatens to leave the United States without Senate-confirmed envoys for months in critical nations like Germany, Canada and Britain. In the past, administrations of both parties have often granted extensions on a case-by-case basis to allow a handful of ambassadors, particularly those with school-age children, to remain in place for weeks or months.", "Mr. Trump, by contrast, has taken a hard line against leaving any of President Obama's political appointees in place as he prepares to take office on Jan. 20 with a mission of dismantling many of his predecessor's signature foreign and domestic policy achievements. \"Political\" ambassadors, many of them major donors who are nominated by virtue of close ties with the president, almost always leave at the end of his term; ambassadors who are career diplomats often remain in their posts.", "A State Department official confirmed to Politico  that the Trump transition team would not be making any exceptions for ambassadors requesting extensions to remain at their posts.", "Aggregated versions of the New York Timess report, social media summaries, and a general misunderstanding of what the New York Times  had& actually reported led many readers to believe that President-elect Trump had broken precedent when he ordered political ambassadors appointed by President Obama to leave their posts by his inauguration date.", "However, the \"precedent\" at the center of the Times article had to do with whether the incoming president would allow exceptions for outgoing ambassadors who wished to remain in their positions for a period of time past Inauguration Day. While previous administrations have allowed exceptions on a case-by-case basis, the incoming Trump administration broke with that tradition by saying that ambassadors had to leave their posts \"without exception.\"", "Asgeir Sigfusson, a spokesperson for the American Foreign Service Association, was even hesitant to say that Trump's no-extensions policy was unprecedented. Instead, Sigfusson noted that AFSA members had called it \"unusual,\" while Ambassador Barbara Stephenson, president of the American Foreign Service Association noted that Trump's policy was atypical:", "\"We go through this process every time there is a change of administration. Political appointees are generally expected to prepare for departure around the time a new President is inaugurated, particularly if there is a change of party. We understand the new administration is adhering strictly to a no-extensions policy, which is not always the case. It's important to point out that embassies have a Deputy Chief of Mission, a career diplomat who serves as chargé d'affaires until a new Ambassador is confirmed. That person is always a career Foreign Service officer, typically with decades of experience, and is selected with the expectation that he or she is fully up to the task of running an Embassy.\"", "John Kirby, Assistant Secretary of State for Public Affairs, also said that the policy was unusual and that previous administrations had granted a \"handful\" of exceptions, but he confirmed that political appointees should have no expectation of staying at their posts beyond the term of the president who appointed them:", "So look, I think I can break this down pretty easily, as I've seen the press coverage on this as well. All political appointees for the Obama Administration were directed to submit their letters of resignation, and the due date was December 7th, and the resignations are to take effect at noon on January 20th. All political appointees were directed to do that. That is common, typical practice. And when you're a political appointee for this or any other administration, you have no expectation of staying beyond the inauguration of a new administration. That's the way it works. For career Foreign Service officers, there this year has been no such directive, no such expectation for them to have to submit resignations at the end of the term.", "Now, I can't speak for the incoming team, but all political appointees — and frankly, even careers as ambassadors or military admirals and generals — you serve at the pleasure of the president. So the incoming team can make decisions on their own about who they want in what chair and for how long. But all political appointees under this Administration, including a knucklehead like me, you have to submit your resignation and be prepared to have January 20th be your last day in office. You serve at the pleasure of the president, and when your president — his terms runs out, you have every expectation that your term will run out. That's the way it works.", "[...]", "You'd have to talk to the Trump transition team about why they decided to not be willing to broker exceptions or waivers, requests to extend. I can't speak to that. That's really for them. But — hang on. But you're right that in the past there have been a handful, a small number, of extension requests granted, but that is totally in the prerogative of the incoming team. And for — it's for them to determine whether they'd be willing to accept or deny individual requests to extend. It's really for them to speak to.", "Peter Cianchette, for instance, was made an ambassador to Costa Rica by President George W. Bush in June 2008, and President Obama allowed Cianchette to remain in his position until July 2009. Similarly, Diane E. Watson, who was appointed an ambassador of Micronesia by former President Bill Clinton, remained at her post long after George W. Bush assumed office. We found similar examples of presidents allowing ambassadors appointed by their predecessors to remain at their posts past Inauguration Day for every presidential transition dating back to 1977, when Jimmy Carter succeeded Gerald Ford.", "When President Obama requested ambassador resignations before the start of his administration in 2009, a State Department official told Agence France-Presse that requests for extensions by political ambassadors would be looked at on a case-by-case basis:", "\"The message was something that is normally sent out (after every election every four years) by the State Department at the request of the White House,\" the State Department official said.", "\"It's a normal procedure for ambassadors, career and non-career, to submit their resignations. And what happens is that all of them do,\" according to the official who added the message was sent out Tuesday.", "\"And in many cases, career ambassadors will be notified that they can stay in place,\" he said.", "\"You also have from time to time political (appointee) ambassadors who come in with requests to maybe extend for a couple of months for family reasons or whatever, and those are looked at on a case-by-case basis,\" he said.", "Agence France-Presse.   \"170 Diplomats to Resign Ahead of Obama's Inauguration.\"\r\n    5 December 2008.", "Diplopundit.   \"Foreign Service Tradition: Political Ambassadors Have to Be Out by January 20.\"\r\n    6 January 2017.", "Nahal, Toosi.   \"Trump Won't Give Grace Period to Obama's Ambassadors.\"\r\n    Politico.   5 January 2017.", "Davis, Julie.   \"In Break with Precedent, Obama Envoys Are Denied Extensions Past Inauguration Day.\"\r\n    The New York Times.   5 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]