["Ahead of the Delhi assembly elections, an alleged letter with the Bharatiya Janata Party’s (BJP) letterhead went viral. The letter carries the alleged signature of BJP Delhi chief Manoj Tiwari who addresses Jagat Prakash Nadda, the newly-elected national president of the BJP. Tiwari is seen advising Nadda that prominent leaders such as Narendra Modi and Amit Shah should not campaign in Delhi as the party’s top leadership will be questioned if they were to lose.", "Several users shared this image on Twitter.", "On December 26, Tiwari had written a letter to Prime Minister Narendra Modi where he suggested that instead of Sikh guru Govind Singh’s death anniversary should be observed as Children’s Day instead of Jawaharlal Nehru’s birthday. On December 27, BJP-MLA Manjinder S Sirsa tweeted (archive) this letter (attached below). Alt News investigated the viral letter with the letter which was shared by Sira and noticed following inconsistencies.", "The ‘Children’s Day’ letter was shared three months ago. Thus, it is unlikely that the design of the letterhead would be amended a few months ahead of elections. The same header can be seen in the letter tweeted by BJP’s official account in July.", "@ManojTiwariMP wrote a letter to CM @ArvindKejriwal regarding exempting women in Delhi from registration fee on purchase of properties in unauthorised colonies. #DelhiWantsBJP pic.twitter.com/wNHvve3IvA", "— BJP Delhi (@BJP4Delhi) July 27, 2019", "Alt News compared the ‘from address’ in both the letters. The letter from December 26 states the address as Pandit Pant Marg. However, in the viral letter, the address mentioned is Pandit Deen Dayal Upadhyay Marg which is the address of BJP headquarters, as per BJP’s official website.", "The orange and green stripe on the letterhead on both letters is visibly different. On a closer look, Alt News noticed the following differences", "Alt News noticed the viral image is not a photo of an actual letter but a digital copy. As a result, Tiwari’s signature on the letter is also a digital one. So far, no political leader has shared a picture of an official letter from their party along with a digital signature.", "Thus, the viral letter by Manoj Tiwari is fabricated and false.", "Donate Now", "Ketan is Senior Editor at Alt News Hindi.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]