["About this rating", "In November 2019, shortly after U.S. Foreign Affairs Specialist Fiona Hill testified during the U.S. House Intelligence Committee's impeachment inquiry into President Donald Trump, a photograph supposedly showing Hill with Russian President Vladimir Putin started to circulate on social media:", "This is a genuine photograph of Putin and Hill.", "While those spreading the above-displayed meme may believe that this photograph is evidence of some sort of nefarious plot — the logic appears to be that Hill was somehow in cahoots with Putin and that her testimony was therefore unreliable — there is a much more logical explanation.", "This photograph was taken at the seventh meeting of the Valdai International Discussion Club, an annual think tank attended by international scholars, historians, politicians and other experts, in Sochi, Russia, in September 2010. Hill attended the conference for the U.S. think tank the Brookings Institution as an analyst of various trends related to Russia's economic and political development.", "Here's a photograph from Russia's government archives that more accurately portrays the numerous people who attended this conference dinner, as well as a second image of Hill:", "Hill presented her findings in an article published by the Brookings Institution in October 2010. Here's how the think tank described the Valdai International Discussion Club and Hill's work (emphasis ours):", "Each annual session of the Valdai Discussion Club has focused on a different theme related to Russia’s development. It has included an expert conference in a series of far-flung locales –– from Yakutsk in the Russian Far East to this year’s seminars in Russian Karelia in the far northwest on the border with Finland –– followed by a series of meetings, for the international participants, with Russian government figures including the President, Prime Minister, Foreign Minister and other ministers, presidential advisors, and regional governors. The first meeting in 2004 took place against the backdrop of the horrifying terrorist attack on the school in Beslan in the North Caucasus. Fiona Hill and Brookings Senior Fellow Clifford Gaddy have, between them, participated in each of the annual seminars from 2004-2010. Brookings CUSE non-resident Senior Fellow and Georgetown Professor Angela Stent has participated in every meeting.", "The theme of this year’s Valdai Club conference was Russia’s history and future development. The conference focused in particular on the parameters and prospects for Russia’s “modernization,” which has become the top domestic and international priority for the Russian government. The first part took place on a riverboat sailing between St. Petersburg and Lakes Onega and Ladoga. A distinguished group of Russian and international historians debated the political legacy of Russia’s Tsarist and Soviet past, against the backdrop of ancient Russian monasteries, Tsarist and Soviet-era prison camps, and monumental canal locks and hydropower stations built by slave labor in the northern network of prison camps — all part of Solzhenitsyn’s gulag archipelago. The second part involved meetings with Russia’s leading female political figure, Governor Valentina Matvienko, in St. Petersburg; dinner with Prime Minister Putin in the opulent Rus’ Sanatorium in his summer residence, the Black Sea resort of Sochi; and a series of off-the-record discussions with other senior officials in Moscow.", "Fiona Hill and Clifford Gaddy, along with other Brookings colleagues and affiliates, are engaged in an ongoing analysis of the trends in Russia’s economic and political development, including the implications of the Russian government’s focus on “modernization.” Fiona Hill’s observations from the Valdai Club meetings are presented in the context of this larger research project. These observations cover the themes of Russia’s recovery from the global financial crisis; the challenges the Russian government faces in upgrading its long-neglected Soviet-era infrastructure; the perceived demographic crisis posed by Russia’s shrinking population in the 1990s; Russian migration to Europe and within Russia itself; the internal Russian debates about what “modernization” actually means and entails, and the role of the state in the process; the prospects for the continuation of Russia’s highly-personalized political system; and the impact of the modernization debate on Russia’s foreign policy.", "Hill is a leading expert on Russia with decades of experience. She has worked as a national intelligence analyst for the National Intelligence Council under Presidents George W. Bush, Barack Obama, and Donald Trump, and served as the director of the Center on the United States and Europe (CUSE) at the Brookings Institution. Hill has also penned a number of books on Russia and Putin.", "In other words, there is nothing particularly unusual about this photograph. It shows a leading expert on Russia at an annual conference hosted in Russia by the country's president.", "Hill, Fiona.   \"Dinner with Putin: Musings on the Politics of Modernization in Russia\"  \r\n  Brookings Institution.   8 October 2010.", "Singh, Maanvi.   \"Who is Fiona Hill and What Can We Expect From Her Impeachment Testimony?\"\r\n    The Guardian.   21 November 2019.", "Singh, Maanvi.   \"Who is Fiona Hill and What Can We Expect From Her Impeachment Testimony?\"\r\n    The Guardian.   21 November 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]