["“If you die within 1 year of taking the COVID V@X Your Life Insurance won’t pay because it is experimental,” says a March 9, 2021 Facebook post.", "Similar claims that vaccination will invalidate life insurance policies spread via other Facebook posts and online articles.", "The American Council of Life Insurers (ACLI) told AFP via email that the claims are “false information.”", "In a statement published on its website on March 12, 2021, a senior vice president, Paul Graham, said: “Life insurance policy contracts are very clear on how policies work, and what cause, if any, might lead to the denial of a benefit. A vaccine for Covid-19 is not one of them.”", "He continued, “Policyholders should rest assured that nothing has changed in the claims-paying process as a result of Covid-19 vaccinations.”", "Insurance associations in Canada and the UK have also issued similar responses to the misinformation.", "When asked if the claims had merit, major insurance companies Northwestern Mutual, MetLife and New York Life all responded with the statement from ACLI.", "Several US states also addressed the claims.", "Oklahoma Insurance Commissioner Glen Mulready said in a statement, “This is simply not true.”", "He explained, “Whether it’s Pfizer, Moderna or Johnson & Johnson, these vaccines received Emergency Use Authorizations after the Food and Drug Administration determined their safety and efficacy. I assure you that getting a Covid-19 vaccine will not impact your life insurance benefits.”", "Similarly, the Insurance Department in North Dakota said in a Facebook post that, “Receiving the Covid-19 vaccine will have no effect on your life insurance policy.”", "And in New York, the Department of Financial Services explained on its website that state law “does not permit life insurance exclusions based on the insured person having received a vaccination.”", "AFP Fact Check previously debunked a similar claim circulating in French and English in Canada that specifically referenced the insurance company Manulife, which said the claim was “false.”", "AFP has fact checked numerous false or misleading claims about Covid-19 vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]