["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An old photo of former President Barack Obama, the actor George Clooney, and another person on a boat is being presented on Facebook without context, making it subject to intense speculation of some social media users who think something sinister is happening.", "\"What was going on then?\" one person wrote in an image that’s being shared on Facebook. \"Why does it look like Clooney is zipping his pants back up? Why does #Obama look stunned? Who is that very young girl? Let’s RT widely and find out the truth! #pedopredators #EpsteinsBlackBook.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But the photo doesn’t capture Obama and Clooney at the scene of a crime, along with a young girl. Contrary to the caption, Clooney appears to be briefly touching his stomach, not zipping up his pants.", "Rather, it shows the men and someone else — we don’t know who — on a boat on Lake Como in Italy with several other people, including Michelle Obama, Amal Clooney, Malia Obama, and other unidentified guests in 2019.", "In photos published by the Daily Mail, different angles of the scene reveal that there are other people nearby but not in view in the image being shared on Facebook.", "Several media outlets covered the boat ride, including USA Today and The Today Show.", "We rate this Facebook post False.", "Facebook post, June 1, 2020", "Daily Mail, The Obamas join the Clooneys aboard a boat on Lake Como as the former first family attend a glamorous event hosted by the Hollywood star’s charity near his multi-million dollar Italian mansion, June 24, 2019", "USA Today, Barack Obama and George Clooney take a boat ride on Lake Como, June 24, 2019", "Today, Vacation buddies? See George Clooney and Barack Obama together in Italy, June 24, 2020", "The Washington Post, He’s on a boat: Obama hangs out with George Clooney in Italy, June 24, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]