["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lee Majors participates in the \"Ash vs. Evil Dead\" panel during the Starz Television Critics Association summer press tour on Aug. 1, 2016, in Beverly Hills, Calif. (AP)", "As millions of Americans celebrated Christmas, some Facebook users were sharing a made-up story about Lee Majors.", "The Dec. 25 article, which was published by AJUAnews.com, claims Majors died from complications during a Penuma surgical procedure. (Penuma is a kind of penile implant.) It also claims the actor, who has starred in movies like \"The Six Million Dollar Man\" and \"Scrooged,\" left $6 million for President Donald Trump’s re-election campaign in his will.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has been shared more than 6,000 times.", "(Screenshot from AJUAnews.com)", "AJUAnews is a hoax news site that has a track record of republishing false, satirical stories without their original context. It also tries to redirect readers to links for anti-virus software they don’t need.", "The original source of the article about Majors is a website called Conservative Tears. It’s run by Christopher Blair, a liberal who tries to trick conservatives into sharing made-up stories on social media. A lot of AJUAnews’ content appears to come from Blair’s network of sites.", "The story on Conservative Tears has several satire labels — including a \"Death Hoax\" tag — while AJUAnews’ version does not. Facebook users and pages have also shared the latter with the assumption that it’s real.", "Majors has been cast in an upcoming movie called \"Narco Sub,\" which is in pre-production for release in 2020. No news outlets have reported that he’s dead.", "The article is inaccurate and makes a ridiculous claim. We rate it Pants on Fire!", "AJUAnews.com, \"‘Bionic Man’ Lee Majors Dead At 83;$6 Million Left To Trump 2020,\" Dec. 25, 2019", "Biography.com, accessed Jan. 2, 2020", "Conservative Tears, \"‘Bionic Man’ Lee Majors Dead At 83;$6 Million Left To Trump 2020\"", "CrowdTangle, accessed Jan. 2, 2020", "IMDB, accessed Jan. 2, 2020", "PolitiFact, \"Fake news site republishes hoax story about Ocasio-Cortez, Omar and Medicare,\" Jan. 2, 2020", "PolitiFact, \"Hoax news site invents attack on Santa by non-existent Cory Booker son,\" Jan. 2, 2020", "PunditFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "Vice, \"There’s an Implant to Make Penises Thicker,\" Aug. 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]