["One of Gov. Scott Walker's 2018 re-election campaign announcement rallies was held Nov. 5, 2017 at Weldall Manufacturing in Waukesha. (Michael Sears/Milwaukee Journal Sentinel)", "Gov. Scott Walker has repeatedly been criticized for not being accessible to the general public.", "In 2013, state Sen. Chris Larson, D-Milwaukee, went extreme, saying Walker \"hasn't done a public event this entire year.\" That rated Pants on Fire. We noted a number of events, such as a Martin Luther King Jr. ceremony in the Capitol rotunda attended by hundreds of people (including a few who booed during Walker’s remarks).", "In 2016, we rated as True a much narrower statement from state Rep. Dana Wachs, D-Eau Claire, that Walker's \"listening sessions\" were \"invite-only and excluding the press.\"", "As he traveled Wisconsin to meet with residents, Walker asked various people, including Democratic lawmakers, for suggestions on who to invite to his listening sessions. But these events -- held by Walker, rather than him attending events staged by others -- were not open to the public or to the press, only to people who were invited.", "Now the 2018 campaign for governor is in full swing, with Wachs among seven Democrats hoping to challenge Walker. And the attacks on Walker’s accessibility are returning.", "On Nov. 3, 2017, Scot Ross, executive director of the liberal advocacy group One Wisconsin Now, was interviewed on \"The Devil’s Advocates,\" a liberal radio talk show based in Milwaukee.", "During a discussion about Walker, host Mike Crute said the governor doesn’t often meet with the general public, \"not unless they’re invited, not unless they own a corporation. What about the town hall meetings or lack thereof, Scot?\"", "Ross replied:", "No, I mean, since 2015, Scott Walker has not done a public event where you don't have to pay admission or be on an approved list. I mean, it is disgraceful, this guy -- I mean since 2015, we’re talking two years you have not been able to go to a Scott Walker event unless you open your checkbook or your organization is a lobbying firm and they open their checkbook.", "As we’ll see, Walker does attend events held by others that are open to the public, but at events he stages, access is more limited.", "Ross’ evidence", "When we asked Ross to back his statement, he reiterated that he was referring to events Walker hosts, not events held by others that Walker attends. He made these points:", "\"The closest you can find to Walker attending events that the public can attend without paying or being on a list were the holiday tree lighting ceremony … and his attendance at the last two Martin Luther King Day Jr. celebrations as a guest of the organizers.\"", "\"Walker doesn't release his schedule publicly.\"", "\"Even Walker's re-election events have all been held at private businesses that do not allow the public to attend.\"", "In July 2016, One Wisconsin Now said it had analyzed campaign contributions of people attending Walker listening sessions during the first three months of the year, and they had made nearly 4,000 contributions totaling over $1 million, overwhelmingly to Republicans and conservatives.", "Walker’s response", "In response, Walker’s campaign cited these events attended by Walker:", "Holiday events: Attending the 2017 Memorial Day ceremony at Wood National Cemetery in Milwaukee and participating in Fourth of July parades, such as the ones in Wauwatosa and in Menomonee Falls in 2017.", "Other events not organized by Walker: Participating in events such as the first lady’s walk, Special Olympics torch run, ceremonies honoring law enforcement officers, groundbreakings and ribbon cuttings.", "Re-election tour: At 14 campaign announcement events around the state in 2017, people were asked to register ahead of time, but were not turned away if they hadn’t, according to the campaign.", "Walker’s campaign also cited a 9/11 event cosponsored by the governor's office and a September 2016 news event in Madison, noting Ross attended, in which Walker made an announcement about refinancing student debt.", "Ross said he heard secondhand about the event, at a UW Credit Union, and that it was not generally known or accessible to the public.", "Our rating", "Ross said: \"Since 2015, Scott Walker has not done a public event where you don't have to pay an admission or be on an approved list.\"", "It’s pretty clear that access to Walker is limited. His schedule is generally not made public ahead of time, making it difficult for people to go to events he attends. There are events that are open to the public, such as holiday ceremonies, that Walker attends. But in terms of events Walker himself holds, his campaign team cited campaign events at which registration is requested but not required, a 9/11 ceremony that the governor's office co-sponsored and a news event that had not been announced to the general public.", "For a statement that is partially accurate, our rating is Half True.", "DARNWI.com, \"Devil’s Advocates\" Scot Ross interview (30:50), Nov. 3, 2017", "Email, Scot Ross, Nov. 10, 2017", "Email, Scott Walker campaign spokesman Nathan Craft, Nov. 13, 2017", "EventBrite.com, campaign rally announcement/RSVP request for Nov. 5, 2017 event", "One Wisconsin Now, news release, July 15, 2016", "La Crosse Tribune, \"Governor touts tourism at visitor center celebration,\" May 6, 2017", "CBS58.com, \"First Lady's \"Walk with Walker\" encourages people to live a healthier lifestyle,\" May 9, 2017", "WKOW-TV, \"Ceremony at Wisconsin State Capitol honors 9/11 victims,\" Sept. 26, 2016", "Fox6Now.com, \"‘Very close to my heart’: Governor Walker participates in 31st annual Law Enforcement Torch Run,\"", "Fox6Now.com, \"‘Freedom isn’t free’: VA holds annual Memorial Day ceremony at Wood National Cemetery,\" May 29, 2017", "Twitter, Scott Walker tweet, July 3, 2017", "Wisconsin State Journal, \"UW Credit Union expands eligibility as Scott Walker touts refinancing for student loans,\" Sept. 28, 2016", "PolitiFact Wisconsin, \"General public and the press not allowed to attend Gov. Scott Walker's 'listening sessions'?\" Aug. 24, 2016", "PolitiFact Wisconsin, \"Scott Walker hasn't done any public events in 2013, Democratic state senator says,\" Sept. 8, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]