["About this rating", "The day after Thanksgiving is the day millions of Americans, enjoying a rare Friday off (and a dearth of football games on television), kick off the Christmas shopping season.", "\"Black Friday\" is regularly cited as \"the busiest shopping day of the year.\" But although Black Friday may be the day the greatest number of holiday shoppers traipse through stores, it isn't necessarily the biggest day of the year in terms of dollars spent:", "Popular belief has it that the Friday after Thanksgiving is the busiest shopping day of the year.", "These days many shoppers buy with the holidays in mind all year long. Decorations go up around Halloween, and some Santa Clauses arrive at malls before Thanksgiving. Some shoppers get an early start Thursday at a limited number of stores like Kmart and Wal-Mart Super Centers, which are open on the holiday. To be sure, there are still intense crowds on the day after Thanksgiving — led by the \"doorbusters\" who show up at dawn for early-bird sales.", "'It's one of the busiest days in terms of traffic but not in sales,' said Pam Rucker, spokeswoman for the National Retail Federation. 'But the mystique is still there.'", "'People just want to get out and do something on that day,' said Jay McIntosh, director of U.S. Retail and Consumer Products for accounting giant Ernst & Young. 'They do because of all of the incentives to shop, but many aren't buying.'", "(\"Black Friday\" supposedly got its name because it's the day when retailers turn the corner and see their income statements move out of the red and into the black; however, originally the phrase was a derisive term applied by police and retail workers to the day's plethora of traffic jams and badly-behaved customers)", "Previous holiday shopping trends showed sales figures spiking on the day after Thanksgiving before suffering a sharp decline through the end of November. However, sales would steadily increase throughout December, peaking on the four days comprising the two weekends before Christmas. As a result, Black Friday sales almost always ranked below the last Saturday before Christmas (or Dec. 23, if Christmas Day falls on a weekend). Up until 2002 it ranked between fourth and eighth on charts of the year's busiest shopping days.", "According to statistics published by the International Council of Shopping Centers (ICSC), the top shopping days for the years 1993 through 2002 were:", "During that period, \"Black Friday\" held the following positions in the ICSC's rankings of year's busiest shopping days:", "Holiday shopping patterns changed in the following years as more shoppers began using on-line sales outlets for their holiday purchases. (Indeed, online retailers coined the term \"Cyber Monday\" to describe the first weekday after the Thanksgiving holiday weekend, a day on which their sales supposedly spike as shoppers pile onto the Internet to buy online whatever they couldn't or didn't get at the mall the previous weekend.)", "But times change. Since 2003 when this page was first published, marketing has become reality and \"Black Friday\" has taken on greater prominence; analytics firm Shoppertrak ranked it the top predicted holiday shopping day in 2015, 2016, and 2017. The National Retail Federation also estimated that 115 million people will do their holiday shopping during \"Black Friday\" in 2017.", "— Former Snopes writers David Mikkelson and Arturo Garcia contributed to this report.", "Nov. 22, 2022: This article was updated to add hyperlinks and meet Snopes' current formatting and editorial standards.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]