["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidates Hillary Clinton and Bernie Sanders sparred over health care policy during a debate in Charleston, S.C., on Jan. 17. At one point, Sanders rejected assertions by Clinton that a Sanders presidency could imperil President Barack Obama’s signature legislative initiative, the Affordable Care Act.", "Clinton said, \"There are things we can do to improve (the Affordable Care Act), but to tear it up and start over again, pushing our country back into that kind of a contentious debate, I think is the wrong direction.\"", "Sanders countered, \"We’re not going to tear up the Affordable Care Act. I helped write it.\"", "We decided to check whether Sanders has a solid claim to have \"helped write\" the Affordable Care Act.", "As our friends at the Washington Post Fact Checker have noted, Sanders pushed hard for a more liberal version of health care reform -- the American Health Security Act of 2009, which would have implemented a national single-payer system. (Under a single-payer system, the government, rather than private health insurers, pays all medical bills, along the lines of Medicare.)", "Sanders backed down after Sen. Tom Coburn, R-Okla., used a procedural move to force a full reading of Sanders’ bill, a move that would have taken hours of floor time and imperiled passage of a more moderate bill backed by Obama and his allies.", "However, as negotiations were in their final stage, Sanders successfully pushed for the inclusion of $11 billion in funding for community health centers, especially in rural areas. The insertion of this funding helped bring together both Democratic lawmakers on the left and Democrats representing more conservative, rural areas.", "\"There was no one who played a more important role than Sen. Sanders\" in securing that funding, Daniel Hawkins, vice president of the National Association of Community Health Centers, told the Intercept last year. (Sanders’ camp forwarded PolitiFact the Intercept article as evidence for his statement.)", "So there’s a good case to be made that Sanders made an important contribution to the final legislation.", "Still, when Sanders says he \"helped write\" the bill, it would be reasonable to imagine that Sanders was an integral player in the crafting of the bill over a long period of time -- an insider in the process. And that’s not the reality.", "Before the final bill was enacted, Sanders and his allies on the party’s left flank regularly expressed frustration at the concessions they had to make during the legislative process.", "\"Public-option proponents, including Sanders and Sen. Sherrod Brown, D-Ohio, say they already have given up enough,\" Politico reported in late November 2009. \"They agreed to forgo a single-payer system. They decided not to push a government plan tied to Medicare rates. And they accepted (Harry) Reid's proposal to include the opt-out provision. That's it, they say.\"", "Politico went on to quote Sanders saying, \"I have made it clear to the administration and Democratic leadership that my vote for the final bill is by no means guaranteed.\"", "A few weeks later, Washington Post columnist Dana Milbank reported that Sanders was still undecided on supporting the primary Democratic bill. \"I am talking to the Democratic leadership, trying my best to salvage some positive things in this bill, so I am not on board yet.\"", "And on Dec. 18, the New York Times quoted Sanders saying, ''I don't sleep well. I am struggling with this issue very hard, trying to sort out what is positive in this bill, what is negative in the bill, what it means for our country if there is no health insurance legislation, when we will come back to it. … And I have to combine that with the fact that I absolutely know that the insurance companies and the drug companies will be laughing all the way to the bank the day after this is passed.''", "Sanders eventually voted for the legislation.", "Our ruling", "Sanders said he \"helped write\" the Affordable Care Act. He deserves credit for one provision of it -- worth a not-insignificant $11 billion. But overall, he was hardly an inside crafter of the bill. Until his effort was blocked by a GOP procedural move, Sanders supported a more aggressive single-payer system, and multiple news articles quoted him as being undecided about supporting the main Democratic bill until late in the process.", "Sanders’ statement contains an element of truth but ignores critical facts that would give a different impression. That meets our definition of Mostly False.", "UPDATE, March 28, 2016: After we published our story, Sanders’ staff provided PolitiFact with several additional examples of provisions the senator helped insert into the Affordable Care Act, sometimes with the cooperation of other lawmakers. According to his staff, these include $1.5 billion in mandatory spending for the National Health Service Corps, a negotiated rule-making process to redefine the criteria for designating medically underserved areas, a waiver for states that want to experiment on health care policy, a provision to double penalties for health care fraud, a provision strengthening the False Claims Act, language to make volunteer ambulance personnel and firefighters who perform emergency medical services eligible for grants and loans, a provision to ease payments to alternative medicine practitioners, higher funding levels for the Public Health and Prevention Fund, and a formula increase in Medicaid funding that benefited his home state of Vermont.", "While this list does provide a more detailed picture of Sanders’ role in the bill’s crafting, none of these provisions involve core elements of the law, such as the exchanges and subsidies, the individual and employer mandates, the Medicaid expansion, the tax changes, the essential benefits package, and the provisions on cost containment. We stand by our original conclusion that, despite making contributions to the final legislation, Sanders was, for most of the process, an outsider pushing for a more aggressive single-payer system rather than an insider negotiating and crafting the final design of the bill. While saying that he \"helped write\" the Affordable Care Act contains an element of truth, Sanders ignores critical facts that would give a different impression. So we still rate his claim Mostly False.", "Bernie Sanders, remarks at the Democratic presidential debate in Charleston, S.C., Jan. 17, 2016", "The Intercept, \"GOP Officials Publicly Denounce Bernie Sanders’ Obamacare Expansion, Quietly Request Funding,\" July 6, 2015", "Washington Post Fact Checker, \"Bernie Sanders’s claim that he would expand, not dismantle, the Affordable Care Act,\" Nov. 23, 2015", "Politico, \"How health care reform could fall apart,\" Nov. 22, 2016", "New York Times, \"Liberal Revolt on Health Care Stings White House,\" Dec. 18, 2009", "Washington Post, \"Obama vs. the liberals: Pass the tea to the left\" (Dana Milbank column), Dec. 17, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]