["By D'Angelo Gore, Lori Robertson, Eugene Kiely and Robert Farley", "Posted on May 23, 2019", "Democratic presidential candidate Beto O’Rourke twisted the facts on several topics, including immigration and gun control, during a CNN town hall.", "The town hall aired on May 21. O’Rourke, a former U.S. representative from Texas, spoke to a crowd at Drake University in Iowa.", "In discussing the current situation at the southwest border, O’Rourke twice said that Trump either wants or is proposing to “build a 2,000-mile wall.”", "O’Rourke: And then let’s focus more of our attention on our own hemisphere. Those people to whom we are connected by land, by culture, and increasingly by families, if we invest in solutions in Guatemala, El Salvador, and Honduras, then fewer people have to flee those countries and come to our border at the United States-Mexico border, where we’re proposing to build a 2,000-mile wall right now.", "He later repeated his claim about “a 2,000-mile wall.”", "O’Rourke: But, Dana, that can’t be the solution in and of itself. We need to invest in solutions in the northern triangle. This president wants to cut $500 million — that’s all that we give to those three countries — and if you put it into perspective, he wants to spend $30 billion on a 2,000-mile wall. He wants to cut that. I would double it.", "We don’t know what the president “wants.” But he has not proposed a 2,000-mile wall, and, in fact, he has said that there is no need to erect barriers the entire length of the border because of natural barriers, such as rivers and mountains.", "It is true that during the 2016 campaign Trump promised he would build “a great, great wall on our southern border.” He provided no specific construction plan during the campaign. His immigration plan simply said, “There must be a wall across the southern border.” And, of course, “Mexico must pay for the wall.”", "Once elected, Trump signed an executive order that directed the secretary of the Department of Homeland Security to “take all appropriate steps to immediately plan, design, and construct a physical wall along the southern border, using appropriate materials and technology to most effectively achieve complete operational control of the southern border.”", "The U.S. Customs and Border Protection, an agency within DHS, developed a 10-year, $18 billion plan, which it submitted on Jan. 5, 2018, to the Senate Committee on Homeland Security and Governmental Affairs. The plan “identified approximately $18 billion in funding needs over a 10-year period for 722 miles of ‘border wall system,’ including ‘316 miles of new primary wall and 407 miles of replacement and secondary wall,’” according to a committee report.", "In a July 2018 report, the Government Accountability Office said it reviewed the CBP’s “Impedance and Denial Prioritization Strategy,” which the GAO said “included an overall estimate of the cost to construct barriers at Border Patrol’s top 17 priority locations — an estimate of $18 billion for 722 miles of barriers.”", "The GAO report also said: “From fiscal year 2005 through fiscal year 2015, CBP increased the total miles of primary barriers on the southwest border from 119 miles to 654 miles — including 354 miles of primary pedestrian barriers and 300 miles of primary vehicle barriers.”", "If the administration does add 316 miles of new primary barriers to the existing 654 miles of primary barriers, then there would be about 970 miles of primary barriers — roughly half the 2,000-mile southern border.", "During the partial government shutdown, which was spurred by the president’s demand for border security funding, Trump addressed the nation on Jan. 19. In his remarks, Trump said he was asking Congress for $5.7 billion in fiscal year 2019 toward construction of what he called “a strategic deployment of physical barriers, or a wall.”", "The president said that there was no need to build “a 2,000-mile concrete structure from sea to sea.” He said, “Much of the border is already protected by natural barriers such as mountains and water.”", "A year earlier, the president told the Wall Street Journal something similar.", "Trump, Jan. 11, 2018: The other thing … so the wall. The wall’s never meant to be 2,100 miles long. We have mountains that are far better than a wall, we have violent rivers that nobody goes near, we have areas …", "But, you don’t need a wall where you have a natural barrier that’s far greater than any wall you could build, OK? Because somebody said oh, he’s going to make the wall smaller. I’m not going to make it smaller. The wall was always going to be a wall where we needed it.", "Carlos Diaz, a CBP spokesman, provided us with a “border wall status” fact sheet dated May 23 that said: “Since January 2017, approximately 205 miles of new and updated border barriers have been funded through the traditional appropriations process and via Treasury Forfeiture Funding, of which approximately 42 miles have been completed to date.”", "CBP has identified $6.1 billion over the last three fiscal years to fund 336 miles of new and replacement barriers, according to the agency’s fact sheet.", "We don’t know what Trump plans to do at the border after fiscal year 2019, and CBP declined to say. “All that we can discuss at this point is what we’ve been funded by Congress,” Diaz said.", "But what we do know is that Trump has not proposed “to build a 2,000-mile wall,” as O’Rourke said.", "O’Rourke claimed that President Donald Trump had described “asylum-seekers as animals or an infestation,” but the president has used those words to describe MS-13 gang members.", "Trump has used the word “invasion” to describe members of the caravan and all immigrants who cross the border illegally.", "O’Rourke: This president, this administration, his policies here at home and abroad have been an absolute disaster. Describing those immigrants who come to this country as rapists and criminals, though they commit crimes at a far lower rate than those who are born in this country, describing asylum-seekers as animals or an infestation — an infestation is how you might describe a termite or a cockroach, something that you want to stamp out, something less than human — you don’t get kids in cages at the border until you have dehumanized them in the eyes of your fellow Americans.", "Trump has a history of using the word “animals” in reference to MS-13 members. At a July 25, 2017, rally in Ohio, Trump said MS-13 gang members were “animals” who “slice” and “dice” young girls because they want their victims “to go through excruciating pain.” Three days later in New York, Trump again said of the gang members, “These are animals.”", "In May 2018, there was some controversy when the president said at a White House roundtable discussion with California political and law enforcement leaders: “We have people coming into the country, or trying to come in — and we’re stopping a lot of them — but we’re taking people out of the country. You wouldn’t believe how bad these people are. These aren’t people. These are animals.”", "Some news coverage said Trump referred to some immigrants as “animals,” while other reports said he was talking about immigrant gang members, which had been mentioned by the Fresno County sheriff before Trump made his comments. Then-House Minority Leader Nancy Pelosi criticized Trump for saying “undocumented immigrants” were “animals.”", "But Trump, and White House Press Secretary Sarah Sanders, then clarified his remarks. Trump said, “But I’m referring, and you know I’m referring, to the MS-13 gangs that are coming in.”", "We wrote of the controversy then that we couldn’t say what Trump meant when he made his remarks, but the president had a history of using the term “animals” for gang members. Plus, at this point, Trump has clarified the remark.", "Similarly, Trump’s use of the words “infest” and “infestation” has been in comments mentioning MS-13. He said in a June 19, 2018, tweet that Democrats “want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13.” A few weeks later, he tweeted: “When we have an ‘infestation’ of MS-13 GANGS in certain parts of our country, who do we send to get them out? ICE!”", "As we have written before, the MS-13 gang formed in Los Angeles in the 1980s. The Justice Department said there were “more than 10,000 members” in 2017, but the FBI has been using that 10,000 estimate since at least 2006.", "O’Rourke said Trump attempted to “ban all Muslims” from entering the United States. As a presidential candidate, Trump proposed such a ban. As president, he didn’t go that far.", "O’Rourke: To try to ban all Muslims, all people of one religion from the shores of a country that is comprised of people from the world over, every tradition of faith, every walk of life.", "Trump did call for a “total and complete shutdown of Muslims entering the United States” during the 2016 presidential campaign. That was shortly after a Muslim couple killed 14 people in San Bernardino, California. The husband, Syed Farook, was born in America, but his wife, Tashfeen Malik, came to the U.S. from Pakistan in July 2014 on a K-1 fiancee visa.", "Trump issued a “Statement on Preventing Muslim Immigration,” which he read at a Dec. 7, 2015, rally. Trump called for a “complete shutdown … until our country’s representatives can figure out what the hell is going on. We have no choice.”", "However, Trump’s executive actions as president did not go that far.", "On June 26, 2018, the Supreme Court ruled 5-4 that the president had “lawfully exercised the broad discretion granted to him” under the Immigration and Nationality Act to restrict entry to some foreign nationals in order to protect the interests of the United States. That ruling concerned a presidential proclamation that Trump signed in September 2017 — the third version of the administration’s travel restrictions — which denied U.S. travel visas to certain nationals of Iran, Libya, Somalia, Syria, Yemen, North Korea and Venezuela.", "The first five countries are majority Muslim nations, but that’s not a ban on all Muslims.", "In fact, in January 2017, the Pew Research Center estimated that Trump’s original executive order — which also included travel restrictions for Iraqi and Sudanese nationals — would affect only about 12 percent of the world’s Muslim population.", "O’Rourke said he was told by “an expert” that African Americans make up “40 percent of the incarcerated population” in Iowa. We didn’t find support for a figure that high.", "O’Rourke: I was talking to somebody in Iowa, Tavis Hall, who is an expert on this. He said African Americans comprise 3 percent of Iowa’s population, 40 percent of the incarcerated population in this state.", "African Americans are just 3.8 percent of Iowa’s population, according to U.S. Census Bureau estimates as of July 2018. It’s also true that African Americans are overrepresented in Iowa’s prisons and jails, although they don’t make up two-fifths of the state’s incarcerated population, according to the estimates we reviewed.", "In 2014, the nonprofit Prison Policy Initiative, which produces research on mass incarceration, reported — based on data from the 2010 Census — that African Americans made up 3 percent of Iowa’s total population and 23 percent of its prison and jail population. A senior policy analyst for PPI told us the organization plans to update those figures in 2021, after the 2020 Census data becomes available.", "In addition, the Vera Institute of Justice, a nonprofit that works to “improve justice systems,” estimates that, in 2015, African Americans made up 25.2 percent of Iowa’s state prison population and 23 percent of the population in jails statewide.", "The Vera Institute says its “Incarceration Trends” data tool is “assembled using information collected by the U.S. Department of Justice Bureau of Justice Statistics (BJS), supplemented with data from state departments of correction when federal data is not available.” Its prison population estimate is very close to a more recent figure from a report from the Iowa Department of Human Rights, which said the total prison population in Iowa was “approximately 24.5% African-American” as of fiscal year 2018.", "We called Tavis Hall, executive director of Experience Waterloo, which promotes tourism in that Iowa city. He said he did speak with O’Rourke about African American incarceration.", "Hall initially told us he didn’t recall the source of the statistic he mentioned to O’Rourke, but later he emailed us a link to the 2017 annual report from the Black Hawk County Sheriff’s Office in Iowa. That report said that nearly 40 percent (2,003 of 5,720) of male inmates in Black Hawk County Jail that year were black.", "“I likely conflated that number with the overall incarceration rate within the state,” Hall explained.", "O’Rourke repeated a variation of a claim we have fact-checked before, saying that states that have adopted universal background checks for gun purchases “have seen a reduction in gun violence of up to 50 percent.” Recent academic research does not support that.", "O’Rourke: We know that in this country, those states that have adopted universal background checks and close every loophole — the Charleston loophole, the boyfriend loophole, the gun show loophole — and make sure that everyone who purchases a firearm goes through a background check, those states have seen a reduction in gun violence of up to 50 percent.", "O’Rourke is a proponent of universal background checks, which would cover private sales by unlicensed individuals, including some sales at gun shows and over the internet. But he has repeatedly cited this misleading success rate, despite recent academic research that suggests it is wildly inflated.", "When O’Rourke claimed in a May 7 campaign event that state laws mandating universal checks “have been shown to reduce gun violence by 50 percent,” his campaign pointed to research released by Everytown for Gun Safety in 2015 that found “nearly 50 percent fewer police murdered with guns, women shot to death by intimate partners in states with background checks.” This time, O’Rourke added an “up to” qualifier — that “states have seen a reduction in gun violence of up to 50 percent” — but the claim is still misleading.", "Boston University Community Health Sciences Professor Michael Siegel told us states that have lower firearm violence rates to begin with are the ones that tend to pass laws requiring universal background checks. A study he led looked at the change in gun violence rates after states passed (or got rid of) universal background checks and found lower rates of violence associated with states with universal checks, but not nearly 50 percent lower.", "That study, published in March in the Journal of General Internal Medicine, looked at homicide and suicide rates in all 50 states over a 26-year period and found that universal background checks are associated with about a 15 percent reduction in firearm homicide. The study stopped short of concluding that the decline was caused by those laws.", "“After reviewing the overall literature, I would estimate that the association is somewhere between a 10% and 15% reduction,” Siegel told us via email. “So the 50% claim sounds exaggerated. I’m not sure what data would support that.”", "Siegel noted that his research found an “association” between universal background checks and reduced homicide rates, “but did not definitively conclude causality.”", "A spokesman for Everytown for Gun Safety told us it has updated the data cited by O’Rourke about universal background checks as a result of new research.", "“The rigorous research that’s come out since that release has improved our understanding of this, and we replaced the statistics from that (2015) release in more recent materials, including the background checks page,” Adam Sege, a spokesman for Everytown for Gun Safety, told us. The current background checks page cites a study in 2015 that concluded Connecticut’s implementation of a handgun permit-to-purchase law “was associated with a 40% reduction in Connecticut’s firearm homicide rates during the first 10 years that the law was in place.” But that’s a little different from a universal background check law — the law required background checks for handgun permits; it’s just one state, and again, the researchers found association, not causality.", "In 2018, the RAND Corporation released several reports as part of its Gun Policy in America initiative, including one on the “Effects of Background Checks on Violent Crime.” The review identified eight studies since 2003 that examined the relationship between background checks and violent crime, and that met its research criteria. The report concluded: “Evidence that background checks may reduce violent crime and total homicides is limited, and studies provide moderate evidence that dealer background checks reduce firearm homicides. Evidence of the effect of private-seller background checks on firearm homicides is inconclusive.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]