["The posts, which have been shared more than 2,000 times across multiple accounts on Facebook and Twitter, supposedly show five Fulani herders arrested for armed robbery in Anambra. The catch is that the names given are typical of southeast Nigeria -- not Fulani names from the north of the country.", "The post comes against a backdrop of heightened tensions in Nigeria over clashes between herders and farmers and allegations that the Fulani are encroaching on territory in the south. It plays on widespread accusations against the Fulani blaming them for an increasing number of crimes across the country.", "The most popular post on the issue, archived here, was published by Zara Onyinye. Going by her previous posts, she’s a staunch supporter of President Muhammadu Buhari. Buhari is himself a Fulani and has been accused by opponents of backing the herdsmen.", "“They were alleged to have terrorised the state,” Onyinye wrote after naming the five men. “May God continue to expose these herdsmen and their sponsors. Ameen.”", "The reactions to the post showed that many people understood it was a joke. Of nearly 800 people who responded, 100 hit the “haha” emoticon and only 20 opted for “wow”.", "User Nneka Beatrice Jacob appreciated the satire by commenting simply “Lols”, but not everyone who understood it was happy. Okey Kissy Ayogu criticised the poster for “making a joke of the  Fulani herdsmen threat in Nigeria” and hoped she would “delete this senseless post”.", "Others missed the satire but were quickly corrected. Haleema Aleeyu Ummi called it “hypocrisy at its peak” before another user Muhammad Saleh explained the post was “mocking those who are accusing herdsmen for robbery in the South”. Haleema Aleeyu Ummi later wrote: “I get it now”.", "The same text and photo have been shared elsewhere on Facebook and Twitter -- we’ve archived some of the posts here, here, and here.", "Longstanding tensions have existed between Muslim Fulani herders from the north of Nigeria and mainly Christian farming communities in central and southern regions.", "Exacerbated by the impact of climate change and overpopulation, there was a resurgence in bloody clashes in the country’s Middle Belt during Buhari’s first term in office. The violence has stoked suspicions between communities and seen Fulanis increasingly blamed for crimes in southern regions. AFP has a special report on the land war here.", "Tensions have also been fuelled by Nigerians highlighting online the ethnic backgrounds of suspected criminals.", "For example, a tweet by Buhari supporter Jibril Gawat in April, sharing the names of Nigerians arrested in the UAE for robbery, stirred a backlash. The names were all from the southeast of the country and sparked a raft of responses pointing to crimes committed abroad by northerners.", "According to a statement by Haruna Muhammed, spokesman for the Anambra State Police Command, the men in the picture were indeed arrested for carjacking. The names given by the police were the same as in the satirical tweet.", "“Suspects conspired and snatched a Toyota Camry 2009/2010 model at gunpoint in Onitsha,” Muhammed said. He did not mention the ethnic origin of any of those detained. They have since been charged.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]