["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the days before U.S. President Donald Trump's visit to a Ford manufacturer in Michigan on May 21, 2020, the company informed the White House that face masks would be required for all visitors. This request proved somewhat controversial, however, as Trump had thus far refused to wear a mask in public during the COVID-19 coronavirus disease pandemic, despite recommendations from health officials.", "The majority of videos and photographs from the visit showed Trump touring the facility, delivering a speech, and speaking with Ford executives — all without a face covering. So when a photograph emerged supposedly showing Trump wearing a face mask during this visit, some viewers were surprised and skeptical of the sight:", "As it turns out, this is a genuine photograph of Trump wearing a face mask during part of his visit to a Ford manufacturing plant in Michigan.", "Executive Chairman Bill Ford confirmed that Trump \"wore a mask during a private viewing of three Ford GTs from over the years. The president later removed the mask for the remainder of the visit.\"", "Mark Truby, Ford chief communications officer, said, \"The subject of a face mask came up. Bill said it would be great if you could wear one. Trump then retrieved one from his personal staff with a White House seal on it, and then they proceeded to visit.\"", "Trump also confirmed that he work a mask during a portion of the visit. Trump told reporters that he wore a mask in the \"back area,\" but that he removed his mask because he \"didn't want to give the press the pleasure of seeing it.\" Trump then showed the press his mask and said that he took it off because he was giving a speech:", "Gregorian, Dareh.   \"Trump Wears Mask with Presidential Seal During Part of Ford Plant Tour.\"\r\n    NBC News.   21 May 2020.", "Howard, Phoebe.   \"Ford Wows President Trump with $750,000 Supercar: 'I Want To Buy One'.\"\r\n    The Detroit Free Press.   21 May 2020.", "Walters, Joanna.   \"Donald Trump Goes Without Mask at Michigan Ford Plant Despite Company Request.\"\r\n    The Guardian.   22 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]