["Indian National Congress member Devashish Jarariya, who was also a party candidate from Bhind constituency in the 2019 general elections, tweeted an image of Chinese President Xi Jinping and Prime Minister Narendra Modi. In the image, PM Modi can be seen bowing his head in front of Jinping with folded hands. Tweeting the image, Jarariya said, “Modiji turned this picture into a reality. #ModiSurrendersToChina #ModiSurrendersGalwanValley”. At the time of writing this article, the tweet garnered more than 250 retweets.", "इस तस्वीर को मोदी जी ने यथार्थ कर दिया है।#ModiSurrendersToChina #ModiSurrendersGalwanValley pic.twitter.com/ISDZW80SnF", "— Devashish Jarariya (@jarariya91) June 20, 2020", "The image is getting shared in the backdrop of clashes between India and China in the Galwan valley where at least 20 Indian soldiers were killed.", "A Twitter user @AudaciousQuest posted the image with a similar claim. The image is also being shared on Facebook.", "With a Google reverse image search, Alt News found an article published by Gulf News when India had revoked the special status of the state of Jammu and Kashmir in October 2019 under Article 370 and 35A of the Indian constitution. At the time, Pakistan’s Prime Minister Imran Khan was in the Chinese capital Beijing while Xi Jinping was on a visit to India. The image depicts a meeting between PM Modi and Xi Jinping in Tamil Nadu’s Mahabalipuram. Several images of the two leaders were published in the article. A photograph similar to the one floating on social media has been posted below. Apart from PM Modi’s posture and clothes, everything else in the picture is exactly the same as in the viral image.", "It is clear that the viral image has been edited.", "The Hindu had also published the original image of the meeting in one of its articles.", "The image of Narendra Modi in a bowing posture was lifted and superimposed in the photo from the Mahabalipuram visit. This image is from September 2014. In the original image, Prime Minister Narendra Modi was bowing to greet then Tumkur’s Mayor Geeta Rudresh. With a help of newspaper clipping published on September 25, 2014, Alt News had then corroborated that the image showed the Metropolitan Mayor Geeta Rudresh meeting Prime Minister Narendra Modi on his arrival in Karnataka’s Tumkur city for the inauguration of a food park.", "@nistula PM Modi greets Tumkur Mayor Ms. Geetha Rudresh Yesterday. pic.twitter.com/vXcozjNOUC", "— kush (@kushblr) September 25, 2014", "Therefore, an image of Prime Minister Narendra Modi and China’s President Xi Jinping was edited and shared on social media. In the edited image, PM Modi is shown bowing in front of Xi Jinping with folded hands. However, in reality, he is standing in front of the Chinese President.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]