["One of the posts is this February 3 entry that has nearly 4,000 reactions. Below is a screenshot of the post.", "In the photo, Subianto is seen holding a marker as he stands next to a whiteboard with the words “GERINDRA + PKI\" circled and \"MENANG” below them. \"Menang\" translates to \"win\".", "The post’s caption translates as: “Gerindra has been planning this for a long time. Now it’s a reality.”", "Subianto is the sole challenger against incumbent Joko Widodo in presidential elections to be held in April 2019.", "Through a Google reverse image search, AFP found the photo in the misleading Facebook posts was a doctored version of one that appeared in this article by Tempo, one of Indonesia’s most well-known news groups, in 2013 with a headline that translates as: “Prabowo claims he practices Western values”.", "In the original image, the whiteboard is marked with figures concerning tax revenue and gross domestic product. There is no reference to any political party or communism.", "Below are the screenshots of the doctored image and the genuine Tempo photo that clearly show Subianto holding the same marker with his hands in exactly the same position, and in the same setting, except for the different writing on the whiteboard.", "The Tempo article talks about Subianto’s opinion on western values, including “humanism, liberal democracy and the rule of law”.", "“I’m part of the Indonesian elite who practice Western values. I highly respect Western values as I was raised in a Western-minded environment,” Subianto was quoted as saying.", "Gerindra has made no announcement of any alliance with the PKI. Here is the party’s website, Twitter account and Facebook page, none of which show any declaration of an alliance with the communists.", "Any association with communism in Indonesia can be grounds for criminal charges under this law.", "The law is titled: “The Disbandment Of The Indonesian Communist Party, The Declaration Of It As A Prohibited Organisation In All Regions Of The Republic Of Indonesia And The Prohibition Of Any Activities To Disseminate And Develop The Teaching Of Communism/Marxism-Leninism.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]