["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fresh batch of labor statistics is sending a recycled claim from Gov. Chris Christie to the bottom end of the Truth-O-Meter.\n\nThe Republican governor last week repeated a claim about how there are fewer \"state government\" employees now than when former Gov. Christine Todd Whitman resigned in January 2001.\n\nBetter yet, the state accomplished that reduction \"without any layoffs,\" Christie said.\n\n\"New Jersey today has fewer employees in state government than it had when Christie Whitman left office in January of 2001, and I think that’s good,\" Christie said in a July 9 appearance at the Brookings Institution, a Washington, D.C.-based think tank. \"And we did it without any layoffs. We did it through attrition.\"\n\nPolitiFact New Jersey issued a True ruling in December on Christie’s claim about how state government has fewer employees than when Whitman resigned.\n\nBut when we looked at recent data from the U.S. Bureau of Labor Statistics, we found that the governor’s statement is no longer accurate. Christie’s claim about there being no layoffs is wrong too, because his representatives previously cited hundreds of layoffs during his tenure.\n\nFirst, let’s explain what’s changed since our True ruling.\n\nAt the time of that ruling, the latest numbers were preliminary estimates for November 2011, showing 137,800 \"state government\" workers. That figure represented 600 fewer employees than the 138,400 state workers in January 2001.\n\nBut the November figures have since been revised to show 144,300 workers in that month, exceeding the estimate from January 2001. Every month since November also has shown a greater number of employees than when Whitman resigned.\n\nWhen Christie repeated the claim last week, the latest figures were preliminary estimates for May 2012, when there were 146,100 state government employees. That represents a 7,700 increase, or nearly 5.6 percent, over Whitman’s final month.\n\nThose statistics are seasonally adjusted and include workers in state departments; the legislative and judicial branches; state colleges and universities; state hospitals and state authorities and commissions, such as NJ Transit.\n\nBrian Murray, a spokesman with the state Department of Labor and Workforce Development, acknowledged how \"the Bureau of Labor Statistics has since revised the data and shifted the estimated count of state employees higher.\"\n\nBut Murray also pointed to a reduction in employees since the Whitman era in the subcategory of \"other state government,\" which includes the executive, legislative and judicial branches as well as state boards and authorities.\n\n\"It could be argued that the Governor has more day-to-day control over the workforces in the items included in ‘other state government’ rather than Educational Services and hospitals,\" Murray said in an e-mail.\n\nHowever, in both claims, Christie has just referred to \"state government\" in general.\n\nAlso, when we referred to that overall category for our first fact-check, a Christie spokesman confirmed that was the source of the governor’s information. So, for this fact-check, we’re focusing on the same category.\n\nIt’s worth noting that since Christie took office in January 2010, the number of \"state government\" employees has dropped by 5,600, or nearly 3.7 percent.\n\nBut has the Christie administration reduced the state workforce \"without any layoffs\"?\n\nThat’s not what the governor’s representatives told us in December when we were working on our first fact-check.\n\nBetween the start of Christie’s tenure and November 2011, \"743 out of 4,738 full-time positions eliminated were through layoffs,\" the spokesmen said in an e-mail, referring to the executive, legislative and judicial branches.\n\nThose layoffs included 138 positions at the New Jersey Network, the state-owned TV network shut down at the end of June 2011.\n\nOur ruling\n\nAt the Brookings Institution, Christie claimed: \"New Jersey today has fewer employees in state government than it had when Christie Whitman left office in January of 2001, and I think that’s good. And we did it without any layoffs. We did it through attrition.\"\n\nBut the latest labor statistics show there were 7,700 more \"state government\" workers in May than when Whitman resigned. Also, the governor’s representatives have cited hundreds of layoffs during Christie’s tenure.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "Brookings Institution, Restoring Fiscal Integrity and Accountability: A Discussion with Governor Chris Christie (R-NJ), July 9, 2012\n\nPolitiFact New Jersey, Chris Christie claims New Jersey has fewer state employees than when former Gov. Christie Whitman left office in 2001, Dec. 29, 2011\n\nU.S. Bureau of Labor Statistics, State and Metro Area Employment, Hours, & Earnings, accessed July 9 and 11, 2012\n\nNew Jersey Department of Labor and Workforce Development, Current Employment Statistics, accessed July 9 and 11, 2012\n\nThe Star-Ledger, State hands out layoff notices to Department of Community Affairs division of Codes and Standards, March 25, 2011\n\nAssociated Press, N.J. sends layoff notices to 115 Atlantic City casino inspectors, Feb. 3, 2011\n\nThe Star-Ledger, NJN employees receive layoff notices as N.J. moves station workers off payroll, Nov. 16, 2010\n\nThe Star-Ledger, NJN signs off today, leaving 130 people out of work, July 1, 2011\n\nE-mail interviews with Michael Drewniak and Brian Murray, spokesmen for Gov. Chris Christie, July 11-12, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]