["A video of a man brutally assaulting a woman is doing the rounds on social media. In the video, the man can be seen kicking, slapping and stomping on the woman while a few others try to intervene. The accompanying text claims that the man is Tamil Nadu DMK leader Selvakumar assaulting an on-duty lady doctor.", "#HBDFatherOfCorruption Tamilnadu DMK party Leader Selva Kumar kicked Lady Doctor on duty.", "Any action against this ? .@mkstalin .@arivalayam pic.twitter.com/139pSuSxjb", "— Bharath Gopu (@bgopu1973) June 3, 2021", "The video is quite widespread on Facebook.", "The same video was also shared last year with an identical narrative.", "Many individuals on Facebook had shared the video, same as this year.", "We also received several requests on our official mobile application to fact-check the video.", "Alt News found that the incident dates back to September 2018 when former DMK corporator Selvakumar hit a woman at a beauty parlour in Tamil Nadu’s Perambalur. He was arrested by the police after a complaint was filed by the victim.", "#WATCH Former DMK Corporator Selvakumar hits a woman at a beauty salon in Tamil Nadu’s Perambalur. The incident took place on 25th May’ 18. He has been arrested by the police and has been suspended from primary membership of the party (Source: CCTV footage) pic.twitter.com/B623qaLc0k", "— ANI (@ANI) September 13, 2018", "According to a report by The News Minute, the incident took place at Mayuri beauty parlour in May 2018. Sathya, the owner of the beauty parlour who is assaulted and kicked in the video, had alleged financial dealings with DMK councillor Selvakuma. She registered a case months after the incident following which Selvakumar was arrested by the police. He was reportedly expelled from the party in September 2018 and later reinstated in December 2018.", "In conclusion, an old video of DMK leader Selvakumar assaulting a woman was revived on social media with the false claim that he attacked a lady doctor.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]