["About this rating", "In January 2018, a 19-year-old former St. Catherine University student named Tnuza Jamal Hassan was arrested on suspicion of setting multiple fires at her former school.", "These fires were not set in \"protest\" of President Donald Trump,  the incident occurred in January 2018 (not March 2019), and the photograph accompanying this story of a burning building was not related to the incident.", "On 15 March 2019, as much of the Internet reeled over the news that nearly 50 people had been killed during mass shootings at two mosques in New Zealand, numerous social media users encountered an article reporting that a Muslim student had set fire to a Christian school in an effort to \"protest\" U.S. President Donald Trump:", "Muslim Student Sets Fire To Christian School To ‘Protest’ Against Trump", "The protest against President Trump got out of hand in St. Louis when a Muslim college student from Minneapolis attempted to burn down a Christian school, lighting four fires and endangering the lives of 33 children.", "Tnuza Jamal Hassan, a college student from Minneapolis, has been charged with intentionally setting four fires at St. Catherine’s University in St. Paul to “protest” against President Trump. 19-year-old Tnuza Jamal Hassan confessed to police that she started the fires on Wednesday.", "Hassan told police her intent was to “hurt people” and to “burn the Christian university to the ground.”", "While this article was shared on various Facebook pages, Twitter accounts, and Reddit threads in the days before the New Zealand massacre, those killings drew additional attention and comments to these posts.", "The above-displayed article refers to a genuine incident from January 2018. However, this article, which was originally published by \"NewsPunch,\" an outlet notorious for misleading reporting, gets a number of facts wrong.", "For one, these fires were not set in \"protest\" of Trump. A contemporary report from the Star Tribune reported that 19-year-old Tnuza Jamal Hassan set several fires at her former school \"in retaliation for U.S. military intervention in Iraq and Afghanistan.\"", "The report continued: \"Tnuza J. Hassan, of Minneapolis, allegedly told police that “she wanted the school to burn to the ground and that her intent was to hurt people,” according to the complaint charging her with one count of felony first-degree arson filed in Ramsey County District Court. According to the charge, Hassan said similar attacks happened on “Muslim land” and no one cared if Muslims were hurt. She told police and fire investigators, “You guys are lucky that I don’t know how to build a bomb because I would have done that.”", "Neither the words \"protest\" nor \"Trump\" appeared in any of the contemporary articles from credible news outlets that we examined.", "NewsPunch also used a misleading (and completely unrelated) image of a fire to exaggerate the blaze's impact. The photograph featured above does not show St. Catherine’s University. This image actually shows an abandoned church that burned down in 2006 in Quebec. We have not been able to locate photographs from the actual fires set by Hassan, but CBS reported that the \"fires were small and quickly contained,\" that \"nobody was injured,\" and that the \"damage was limited to furnishings.\"", "In addition to NewsPunch's misleading reporting, many people on social media made incorrect assumptions about this story after encountering it in March 2019. For instance, several readers were upset that Hassan only faced arson charges, rather than terrorism charges. In the months since Hassan's arrest in January 2018, however, she was indicted on terrorism charges:", "A Minnesota woman whom prosecutors said set fires at a Minnesota university out of anger because of U.S. military actions overseas was charged with terrorism Wednesday after she allegedly tried to assist a terrorist organization last year.", "Tnuza Jamal Hassan, 19, was charged in federal court for attempting to provide material support to Al Qaeda, lying to the FBI and arson, Fox 9 reported. She was initially arrested Jan. 17 after she set eight fires in seven buildings on the St. Catherine University campus in St. Paul.", "Regan, Helen; Sindhu, Sandi.   \"49 Killed in Mass Shooting at Two Mosques in Christchurch, New Zealand\r\n    CNN.   15 March 2019.", "Xiong, Chao.   \"Charges: Former Student Set Fires on St. Catherine Campus in Retaliation Against U.S. Military Intervention.\"\r\n    Star Tribune.   19 January 2018.", "Gottfried, Mara.   \"Former St. Kate’s Student Arrested After Small Fires Set on Campus.\"\r\n    Pioneer Press.   17 January 2018.", "Darrah, Nicole.   \"Minnesota Woman, 19, Who Allegedly Told Students to 'Join the Jihad,' is Indicted.\"\r\n    Fox News.   7 February 2018.", "CBS.   \"Charges: Teen Who Set St. Kate’s Fires Sought To Hurt People.\"\r\n    19 January 2018.", "Dmitry, Baxter.   \"Muslim Student Sets Fire to Christian School to 'Protest' Against Trump.\"\r\n   NewsPunch.   21 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]