["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Political journalist Jon Ralston interviews congressional candidate Danny Tarkanian in February", "After a hard-fought primary battle in Nevada’s 3rd Congressional District, Republican candidate Danny Tarkanian is now taking flak from Democrats over his stance on abortion.", "At a recent roundtable with female congressional members, Democratic candidate Jacky Rosen attacked Tarkanian saying he \"wants to defund Planned Parenthood and would outlaw a woman's right to choose, even in cases of rape or incest.\"", "As Tarkanian and Rosen vie for one of the most competitive House seats in the nation, we wanted to dig deeper into this line of attack.", "Tark’s record", "Despite never holding office, Tarkanian has nonetheless amassed a lengthy record of public positions on abortion and Planned Parenthood funding that largely align with Rosen’s claims.", "He is squarely pro-life, saying in a 2012 debate that he believes \"life starts at conception, and if life starts at conception you have to do what you can to preserve life.\"", "Tarkanian has consistently said he’d support removing federal funding from Planned Parenthood and that he opposed abortion with the sole exception if the pregnancy threatens the life of the mother.", "Most recently, he answered a pre-2016 primary voter guide saying he would support defunding Planned Parenthood and support legislation \"to protect the right to life of every person from conception to natural death,\" with an exception if it’s necessary to save the life of the mother.", "In addition to the questionnaire, Tarkanian told a reporter in March 2016 that he would \"absolutely\" support defunding the reproductive health care provider.", "\"Why do we have to give $800 million to an entity that is providing such a divisive service as abortions and then coming out and seeing how they’re selling body parts and all those other things?\" he said.", "(PolitiFact rated a similar claim that Planned Parenthood sold aborted fetus body parts for profit as False, and the group has been cleared of any wrongdoing in many states, including Nevada.)", "Tarkanian has been been less direct on abortions for rape and incest victims.", "The closest he’s come to addressing the issue was during a June 2016 radio interview, where he reiterated his opposition to abortion with the only exception being if continuing the pregnancy would threaten the life of the mother.", "\"That’s the only time I think there should be the ability to terminate the life of an unborn,\" he said.", "During his 2012 campaign for a different congressional seat, Tarkanian was the target of an ad that strongly implied he supported tea party Republicans who wanted to \"criminalize a woman’s right to choose even in cases of rape or incest.\"", "Tarkanian’s campaign manager, James Fisfis, said the campaign didn’t disagree with the claims but emphasized the Republican isn’t pushing for any specific abortion-related legislation and would continue supporting full funding for women’s health programs through groups other than Planned Parenthood.", "Tarkanian hasn’t avoided using abortion as an issue in earlier campaigns — he ran radio ads attacking a Republican primary opponent in 2009 for allegedly flip-flopping on the issue.", "Our ruling", "Rosen said Tarkanian \"wants to defund Planned Parenthood and would outlaw a woman's right to choose, even in cases of rape or incest.\"", "Tarkanian is ardently pro-life and has consistently said on multiple occasions he’d support defunding Planned Parenthood and only supports allowing abortion access if continuing the pregnancy would threaten the mother’s life.", "This statement is accurate, so we rate it as True.", "Phone interview with Danny Tarkanian campaign manager James Fisfis, Aug. 3, 2016", "Email interview, Jacky Rosen campaign spokesman Stewart Boss, Aug. 3, 2016", "Jacky Rosen for Congress Press Release, \"PHOTOS: Jacky Rosen & Congresswomen Host Roundtable on Women’s Health, Equal Pay, Paid Leave,\" July 20, 2016", "YouTube, \"2016.06.13 Tarkanian on Experience Liberty Radio,\" June 13, 2016", "Nevada Concerned Citizens Questionnaire, 2016 Primary Election Guide, May 2016", "PolitiFact, \"Del. John O'Bannon says Planned Parenthood sold fetal tissue for profit,\" Feb. 8, 2016", "KLAS-TV 8 News Now, \"Web Extra: Danny Tarkanian,\" March 25, 2016", "Associated Press, \"Nevada AG closes inquiry into Planned Parenthood,\" Dec. 2, 2015", "Las Vegas Review-Journal, \"Congressional District 4 candidates match up in debate at Temple Sinai,\" Oct. 14, 2014", "Las Vegas Review-Journal, \"Tarkanian goes on the attack in ad,\" April 23, 2010", "Reno Gazette-Journal, \"Proposed Nevada abortion ban slow to gain support,\" Oct. 23, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]