["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In late June 2020, a meme shared on Facebook prompted Snopes readers to ask if \"members and supporters\" of the Black Lives Matter movement were tampering with white people's fast food orders:", "The meme was an example of \"copypasta,\" defined by Dictionary.com as \"a block of text which is repeatedly copied and pasted by individuals over various online forums and social media sites.\"", "The underlying assumptions the meme makes are problematic. For starters, the idea that there is a \"nationwide conspiracy\" to poison fast food orders would no doubt lead in the news, but as of this writing there were no news reports of any such widespread public health crisis. The claim in the meme is nothing more than a baseless rumor with no evidence offered. And Black Lives Matter is a national movement for social justice, not a membership-based organization, and activists who support it seek social equality and institutional reforms, not to cause physical harm to white people.", "This wasn't the first time a false rumor about poisoned food circulated in the wake of Black Lives Matter demonstrations in 2020. A New York police union claimed that officers had been poisoned at a Shake Shack, but a police investigation found no criminal activity.", "Because this meme is a copy-and-pasted rumor with no evidence to support it, we rate this claim \"False.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]