["About this rating", "In late February 2018, an article posted to \"alternative health\" blog HealthNutNews.com began circulating, leading readers to believe that the vice president of the pharmaceutical giant Pfizer had \"blown the whistle\" on Gardasil, a vaccine that protects against human papillomavirus, an umbrella term for several viruses spread by intimate contact which can lead to cervical cancer if left untreated. The headline on the story cautions that the vaccine is \"deadly.\"", "The article is a misleading and confusing hodgepodge of conflicting information, including quotes from medical professionals taken out of context and purposely mischaracterized. For example, the \"Pfizer vice president\" referenced in the headline is Dr. Peter Rost, who was not the vice president but a vice president of marketing for Pfizer, and who was fired in 2005 after a public skirmish with his employer in which he claimed to be a whistleblower over drug pricing.", "Of course, it's unclear how a an executive would \"blow the whistle\" on a product his company doesn't make anyway — Gardisil is manufactured by Merck, not Pfizer.", "The HealthNutNews.com story contradicts its own headline within the first two paragraphs:", "The former vice president of Pfizer, Dr. Peter Rost, can be seen in the video clip below, discussing what many of us have been saying for years: the Gardasil vaccine is dangerous and Big Pharma just wants to keep people unhealthy. The clip below, taken from the yet to be released “One More Girl” documentary – features Dr. Rost revealing how vaccines and Big Pharma drugs are designed to keep people in a state of dis-ease.", "NOTE: Dr. Rost doesn’t directly say “Gardasil is dangerous” but he’s discussing the vaccine in the documentary “Gardasil: One More Girl.” Again, the topic IS THE GARDASIL VACCINE. Although he might not use the words, that vaccine is the topic of the interview.", "In the roughly two-minute video embedded in the story, Rost never mentions Gardasil or any vaccine at all. Instead, he appears to be talking in general terms about his views on the pharmaceutical industry's \"buying influence\" over academic institutions and building too-cozy relationships with researchers who should be unbiased in testing drugs — hardly an earth-shattering revelation about a specific vaccine or treatment.", "The article also contains two quotes from two medical publishing professionals, neither of whom was talking about vaccines or their efficacy:", "“It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgment of trusted physicians or authoritative medical guidelines. I take no pleasure in this conclusion, which I reached slowly and reluctantly over my two decades as an editor of the New England Journal of Medicine.” – Dr. Marcia Angell, a physician and longtime editor-in-chief of the New England Medical Journal (NEMJ) “", "“The case against science is straightforward: much of the scientific literature, perhaps half, may simply be untrue. Afflicted by studies with small sample sizes, tiny effects, invalid exploratory analyses, and flagrant conflicts of interest, together with an obsession for pursuing fashionable trends of dubious importance, science has taken a turn towards darkness.” – Dr. Richard Horton, the current editor-in-chief of the Lancet – considered to be one of the most well respected peer-reviewed medical journals in the world.", "Both Angell and Horton edit two prominent medical journals, and both have written editorials that criticize scientific studies and concerns over conflicts of interest created by relationships between researchers and pharmaceutical companies. Neither mentioned vaccines, however. In an e-mail, Horton told us:", "Yes, this is a wonderful example of selective quotation. I believe that quote is taken from a report of a meeting I attended and wrote about. “The case against science” is one extreme view that is worrying scientists because of a concern about the reproducibility of some studies. We have to face up to criticisms of science today in order to defeat those criticisms.", "Angell's quote was taken from a 2015 op-ed in the New York Review of Books, in which she wrote:", "The problems I’ve discussed are not limited to psychiatry, although they reach their most florid form there. Similar conflicts of interest and biases exist in virtually every field of medicine, particularly those that rely heavily on drugs or devices. It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgment of trusted physicians or authoritative medical guidelines. I take no pleasure in this conclusion, which I reached slowly and reluctantly over my two decades as an editor of TheNew England Journal of Medicine.", "One result of the pervasive bias is that physicians learn to practice a very drug-intensive style of medicine. Even when changes in lifestyle would be more effective, doctors and their patients often believe that for every ailment and discontent there is a drug. Physicians are also led to believe that the newest, most expensive brand-name drugs are superior to older drugs or generics, even though there is seldom any evidence to that effect because sponsors do not usually compare their drugs with older drugs at equivalent doses. In addition, physicians, swayed by prestigious medical school faculty, learn to prescribe drugs for off-label uses without good evidence of effectiveness.", "This fear-mongering about alleged dangers of HPV vaccines is not based in any fact. According to the Centers for Disease Control and Prevention, the vaccines are safe for most of the public, though (like any drug) they may have side effects, or in rare cases, may result in an allergic reaction. It's not the first time a vaccine has been falsely accused of causing ailments, when they in fact guard the general public from outbreaks — a previous HealthNutNews.com story falsely reported that vaccines were causing 2018's deadly influenza season.", "HPV vaccines have been controversial in part because they guard young girls against a sexually-transmitted virus that can lead to cervical cancer; thus, critics often blur the line between religious and anti-science hysteria when discouraging their use. As Joseph Uscinski, associate professor of political science at the University of Miami, pointed out, paranoia about this particular vaccine is enabled by parents who are afraid that providing girls with the vaccine will somehow promote promiscuity:", "When they hear that the vaccine is actually bad for the kids, it sort of makes them feel it's okay not to give it to them.", "He pointed to 2011, when former Minnesota representative and far-right Christian activist Michele Bachmann attacked then-presidential candidate and Texas Governor Rick Perry for an HPV vaccine mandate, falsely saying it causes \"mental retardation.\" Uscinski said:", "There's always some group of people who have a skepticism of big institutions, sometimes big pharmaceutical companies or Western medicine as it is, and that sort of underlies all of this.", "Angell, Marcia. \"Drug Companies & Doctors: A Story of Corruption.\"\r\n  New York Review of Books. 15 January 2009.", "Horton, Richard. \"Offline: What Is Medicine’s 5 Sigma?\"\r\n  TheLancet.com 15 April 2015.", "Berenson, Alex. \"Pfizer Fires a Vice President Who Criticized the Company's Sales Practices.\"\r\n  The New York Times. 2 December 2005.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]