["About this rating", "In July 2018, U.S. President Donald Trump was the target of many critics who took umbrage with his appearing to take the side of Russian president Vladimir Putin over allegations of Russian meddling in the 2016 U.S. presidential election.", "As Trump stood next to the Russian president at a press conference following a Russia–United States summit meeting in Helsinki, Finland, Associated Press White House reporter Jonathan Lemire asked Trump whether he believed Putin's denials about Russian interference in the election, or the conclusions of U.S. intelligence agencies that such interference had indeed taken place. Trump replied that he didn't \"see any reason why it would be\" Russia who meddled in the 2016 election, saying that \"I have great confidence in my intelligence people,\" but adding that \"President Putin was extremely strong and powerful in his denial, today\":", "﻿", "President Trump later backtracked on his remark, asserting that he had intended to say \"I don't see any reason why it wouldn't be Russia\" who meddled in the election, and affirming that \"I accept our intelligence community's conclusion that Russia's meddling in the 2016 election took place\":", "﻿", "However, by that time President Trump's remarks in Helsinki had prompted a wave of criticisms, including from within the Republican party, with some observers even accusing President Trump of treason. Most prominently, John Brennan, the former director of the Central Intelligence Agency, maintained that Trump's words and actions were \"nothing short of treasonous\":", "Donald Trump’s press conference performance in Helsinki rises to & exceeds the threshold of “high crimes & misdemeanors.” It was nothing short of treasonous. Not only were Trump’s comments imbecilic, he is wholly in the pocket of Putin. Republican Patriots: Where are you???", "— John O. Brennan (@JohnBrennan) July 16, 2018", "Democratic Congressman and House Minority Whip Steny Hoyer of Maryland endorsed Brennan's description in comments he offered reporters, and the New York Daily News' front page carried the punning banner headline \"OPEN TREASON\":", ".@realdonaldtrump derides reports with which he disagrees as “fake news,” then buys the Russian narrative hook, line, sinker, pole and boat. https://t.co/TGHurpVDKy", "An early look at Tuesday's front... pic.twitter.com/BXsoZsIT4B", "— New York Daily News (@NYDailyNews) July 16, 2018", "Against that background, an old warning about a nation's being destroyed by \"treason from within,\" purporting to be from the Roman orator Marcus Tullius Cicero (better known as \"Cicero\"), found popularity on social media after a Facebook page called \"Impeach Trump, Impeach Pence, Keep Impeaching\" posted it in the form of a meme on 14 July 2018, two days before the Helsinki summit:", "Although these words are now widely attributed to Cicero, in fact they originated in the 20th century, with novelist Taylor Caldwell's 1965 book A Pillar of Iron. Even though that work often drew directly from the recorded speeches and letters of Cicero for its dialogue, it was nonetheless a work of fiction, and the warning from Cicero about \"treason from within” was an invention of Caldwell’s and not a reproduction of Cicero’s own words.", "Context", "In one section, Caldwell wrote about the Cataline Conspiracy, a major event in the history of the Roman Republic in which a Senator named Lucius Sergius Catilina (known as \"Catilina\") led a plot to set fire to the city of Rome and assassinate several high-ranking officials — including the republic's two consuls, Cicero and Gaius Antonius Hybrida (known as \"Hybrida\").", "The Roman republic was led by two executives, known as \"consuls\", who were elected to one-year, non-consecutive terms by the Centuriate Assembly (composed of Roman citizens). The assembly elected Cicero and Hybrida to serve as consuls in 63 B.C.E, much to the resentment of Catilina, who had unsuccessfully campaigned for the same office.", "Cicero found out about Catilina's conspiracy and, invoking emergency powers, had some of its leaders arrested and executed without trial. Catilina himself was killed in battle alongside his troops, while attempting a somewhat futile march on Rome.", "Five years later, a Roman politician named Publius Clodius Pulcher (\"Clodius\") proposed a set of laws, including one which would make it punishable by death to execute any Roman citizen without trial. As a result, Cicero faced the prospect of being exiled from Rome, or even executed, over his earlier order to put to death the leaders of the Catiline conspiracy. These events prompted the imagined scene in which Caldwell put the words in question into Cicero's mouth, as he defended his actions before the Senate:", "Catilina menaced Rome. That is now history. There was no time for the proper processes of law, as well, my lords, you know. Catilina should have taken any legal time to complete his plans, to fire Rome, to destroy her, to massacre tens of thousands, including many in this Senate, to have brought chaos and disaster to our country. The hour was desperate; moments were precious. There could be no delay. Rome must strike, or Catilina would.", "For this day's work, lords, you have encouraged treason and opened the prison doors to free the traitors. A nation can survive its fools, and even the ambitious. But it cannot survive treason from within. An enemy at the gates is less formidable, for he is known and he carries his banners openly against the city. But the traitor moves among those within the gates freely, his sly whispers rustling through all the alleys, heard in the very halls of government itself. For the traitor appears no traitor; he speaks in the accents familiar to his victims, and he wears their face and their garments, and he appeals to the baseness that lies deep in the hearts of all men. He rots the soul of a nation; he works secretly and unknown in the night to undermine the pillars of a city; he infects the body politic so that it can no longer resist. A murderer is less to be feared. The traitor is the carrier of the plague. You have unbarred the gates of Rome to him.", "Cicero went into exile, as the historians Plutarch and Cassius Dio recounted, but only for around a year before returning to Rome after the Senate voted in favor of recalling him. In 43 B.C.E., he was assassinated at the behest of Mark Anthony, a supporter of Julius Caesar's who served in the Second Triumvirate after Caesar's assassination.", "These facts provide one clue that the quotation in the meme is not authentic as offered: it is dated to 42 B.C.E., a year after Cicero died.", "Cicero did not write or utter the words attributed to the fictionalized version of him created by Caldwell, and we found no evidence of any similar phrases occurring in either the orator's own letters and speeches or the accounts of historians such as Plutarch and Cassius Dio who documented this period in Roman history.", "However, Cicero did vehemently attack Catilina (as he similarly attacked many other Roman politicians, throughout his career) in a series of speeches known as the Catiline Orations, delivered in the Roman Senate during the Catiline Conspiracy and after the capture of its ringleaders.", "The speech from Caldwell's novel at times resembles Cicero's actual attacks on Catilina in certain stylistic ways — for example Cicero's description of Catilina's secrecy and underhandedness, in the first oration:", "For what is there, O Catiline, that you can still expect, if night is not able to veil your nefarious meetings in darkness, and if private houses cannot conceal the voice of your conspiracy within their walls;—if everything is seen and displayed? Change your mind: trust me: forget the slaughter and conflagration you are meditating.", "Cicero likened Catilina and his co-conspirators to a disease upon the Roman republic, and also warned about the threat from within the city, just as he did in Caldwell's fictional speech, describing Catilina as \"an enemy in the city\" and declaring that \"The only plots against us are within our own walls — the danger is within — the enemy is within.\"", "Usage in American Political Debate", "Caldwell's \"treason\" speech, falsely attributed to Cicero, has occasionally featured in American political debate for decades,in various contexts, and with various politicians or ideologies positioned as the \"traitor\" in question.", "In fact, the misattribution began within months of the publication of A Pillar of Iron. In October 1965, the segregationist Chief Justice of the Florida Supreme Court, Millard Caldwell (no relation to the author), gave a speech to the Association of American Physicians and Surgeons using an extended metaphor to compare the decline of the Roman republic with the perceived decline of conservative mores and individual rights in the United States at that time.", "Among a series of correctly attributed quotations from Cicero, Caldwell included the \"treason\" speech from A Pillar of Iron, which had been a best-seller that year, adding: \"Does that sound like 1965 and the subversives in high places who have been exposed, and those who are not yet exposed?\"", "In May 1995, the Militia of Montana (a paramilitary anti-government group known for spreading conspiracy theories) was invited to give a statement to the U.S Senate Judiciary committee's subcommittee on terrorism, which was examining the subject of domestic terrorism just weeks after the Oklahoma City bombing.", "In their statement, the militia group included a section of Caldwell's \"treason from within\" speech, although not attributing to any source:", "May God be with all America as he watches over the shoulders of you who write her laws. A nation can survive its fools and even the ambitious. But it cannot survive treason from within. America has nothing to fear from patriots maintaining \"vigilance.\" She should, however, fear those that would \"outlaw\" vigilance.", "In recent years, internet users taking part in political debates have used the quotation to target \"progressives,\" in the context of the reauthorization of the Patriot Act in 2006, the administration of former U.S. president Barack Obama, in the context of the 2015 Iranian nuclear deal.", "Another statement about the necessity of balancing budgets, also part of the dialogue invented by Taylor Caldwell for A Pillar of Iron, has similarly been attributed as the genuine words of Cicero for the last several decades. (A more recent list wrongly ascribed to Cicero's offering of a description of \"the situation during his lifetime\" originated with a source other than Caldwell's book.)", "The application of the faux Cicero \"treason\" quotation to President Trump began before his Helsinki press conference with Putin, and this \"Two thousand year old warning\" meme appears to have first been posted in August 2017 by the anti-Trump Facebook page \"Politicked.\"", "Lillis, Mike.   \"Hoyer: Trump Committed 'Treason' in Helsinki.\"\r\n    The Hill.   17 July 2018.", "Caldwell, Taylor.   A Pillar of Iron.\r\n    Doubleday, 1965.   ISBN 0-385-05303-7/", "Wasson, Donald L.   \"Cicero & the Catiline Conspiracy.\"\r\n    Ancient History Encyclopedia.   3 February 2016.", "Wasson, Donald L.   \"Consul -- Definition.\"\r\n    Ancient History Encyclopedia.   23 June 2014.", "Plutarch.   \"Parallel Lives -- The Life of Cicero.\"\r\n    Loeb Classical Library, Harvard University Press/Lacus Curtius, University of Chicago.   c. 100 C.E. (Transl. by Bernadotte Perrin, 1919).", "Marcus Tullius Cicero.   \"The Catiline Orations.\"\r\n    The Orations of Marcus Tullius Cicero, Literally Translated by C.D. Yonge, Henry G. Bohn (Publisher).   63 B.C.E./Published 1856", "Caldwell, Millard F.   \"Cicero's Prognosis -- Speech at the 22nd Annual Meeting of the Association of American Physicians and Surgeons.\"\r\n    The Association of American Physicians and Surgeons.\r\n  October 1965", "Kovaleski, Serge F.   \"'One World' Conspiracies Prompt Montana Militia's Call to Arms.\"\r\n    The Washington Post.  29 April 1995.", "Militia of Montana.   \"Appearance Before the Senate Sub-Committee on Anti-Terrorism, May 25 1995.\"\r\n    U.S. Senate Judiciary Committee, Sub-Committee on Terrorism/Congressional Record.  25 May 1995.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]