["By Eugene Kiely", "Posted on October 18, 2016", "Mike Pence has repeatedly claimed that ABC News learned through a freedom of information request that the State Department under Hillary Clinton “directed contracts for the Haitian recovery effort … to friends of the Clintons.” But that’s not what ABC News reported.", "The emails that ABC News obtained showed that the State Department worked with the Clinton Foundation to identify and assist friends of former President Bill Clinton who were offering help or seeking assistance in the days immediately following the Jan. 12, 2010, earthquake. At the time, Bill Clinton was U.N. special envoy to Haiti and Hillary Clinton was secretary of state.", "The report by ABC News does show that there was close cooperation between the foundation and the State Department. However, the emails do not provide any evidence that the State Department helped the Clintons’ friends or foundation donors obtain recovery contracts.", "We first heard Pence, Donald Trump’s running mate, make his claim about disaster-related contracts in Haiti when he was interviewed by NBC News’ “Meet the Press” host Chuck Todd.", "Pence, Oct. 16: But, but look all this information is not just flowing out of the, flowing out of the Wikileaks —", "Todd: Do you–", "Pence: — it was ABC News, a freedom of information request —", "Todd: All right.", "Pence: — that was able to uncover the fact that while she was secretary of state, Hillary Clinton’s staff was actually directing contracts for the Haitian recovery effort to friends of the Clintons.", "A day later, Pence told supporters at a rally in Mason, Ohio, a similar story of the ABC News report.", "Pence, Oct. 17: But, you know, truth is a force of nature. Things are coming out each and every day. And not just through WikiLeaks, but you know give ABC News some credit. They actually found out just last week through a freedom of information request that while she was secretary of state, Hillary Clinton’s senior aides — ABC News found this and documented it, not to where you’d hear much about it in the news.", "They found out her senior aides actually directed contracts for the Haitian recovery effort after the terrible earthquake in Haiti to friends of the Clintons. Pay and play politics at its worst.", "Pence oversells the ABC News story.", "ABC News wrote a story on Oct. 11 called “‘FOBs’: How Hillary’s State Dept. Gave Special Attention to ‘Friends of Bill’ After Haiti Quake.” The story was based on “dozens of emails” obtained by the Republican National Committee through a Freedom of Information Act request. The network’s investigative unit highlighted several of the emails in its story that were sent from the Clinton Foundation to the State Department regarding Friends of Bill (FOB).", "In addition to being the U.N. special envoy to Haiti, Bill Clinton was also co-chairman with then-Haiti Prime Minister Jean-Max Bellerive of the Interim Haiti Recovery Commission, and joined with former President George H.W. Bush to form the Clinton Bush Haiti Fund within days of the earthquake.", "ABC News reported that FOBs and Clinton Foundation donors contacted the foundation to offer help or seek assistance in the immediate aftermath of the January 2010 earthquake. The Clinton Foundation forwarded some of those requests to the State Department. For example, the foundation forwarded an email to Caitlin Klevorick — a State Department employee who once worked for the Clinton Foundation — from a woman who was offering medical supplies, ABC News reported.", "Klevorick responds: “Is this a FOB! If not, she should go to cidi.org,” referring to a USAID website set up for people who want to make a donation to help with international disasters.", "ABC News, Oct. 11: Klevorick told ABC News she served as a point of contact for numerous organizations seeking to help. She said she made notations about Bill Clinton to help determine whether they had a history in Haiti or with disaster relief.", "“Everyone’s priority was to get the necessary resources to the right places as soon as possible to save lives,” Klevorick said.", "There is no disputing that the State Department did assist those connected to the Clinton Foundation “during the hours after the massive 2010 Haiti earthquake,” as ABC News reported.", "But the news story does not provide any evidence that State Department officials “directed contracts for the Haitian recovery effort … to friends of the Clintons,” as Pence claimed.", "And the State Department says it found “no evidence” that its staff helped foundation donors or Bill Clinton’s friends obtain contracts.", "At an Oct. 11 press briefing, State Department spokesman John Kirby said the State Department “looked into” allegations of preferential treatment to contractors “when ABC was working this story.” He said, “We found no evidence that preferential treatment was given to any particular entity or organization with respect to contracts.”", "In its report, ABC News mentioned two companies by name that had ties to the Clinton Foundation. Both had operations in Haiti, and they were in position to help with the rescue effort or in need of assistance themselves.", "Here are the two companies and a short recap of what help they were seeking or assistance they were offering, based on the ABC News report and our own reporting:", "Digicel, a Jamaica-based telecom firm.", "The CEO of Digicel is Denis O’Brien, whom ABC News identifies as “a longtime donor to the Clinton Foundation.” O’Brien gave between $10 million and $25 million to the foundation.", "Digicel was seeking help “to fly relief supplies into Port-au-Prince and get employees of his company out,” at the same time that the U.S. Army was seeking its help in restoring communications in Haiti, the news report said. O’Brien sought help from the Clinton Foundation because his company was having problems getting “landing slots” at an airport in Haiti, and the Clinton Foundation sought the State Department’s assistance in helping O’Brien, according to ABC News.", "O’Brien told ABC News: “I don’t see any problem contacting anybody in the United States if I’m bringing in emergency aid where people are dying on the street because of lack of medical attention. I make no apologies for that.”", "There is no question that O’Brien is deeply involved in the Clinton Foundation and Haiti recovery projects. We found that O’Brien became chairman of the foundation’s Haiti Action Network in 2009 a few months before the earthquake, and served in that capacity for at least four years. After the 2010 earthquake, O’Brien was involved in commercial development projects — including restoring the Iron Market and building a new Marriott, both in Port-au-Prince. The Clinton Foundation said that it “facilitated” the agreement between Marriott and Digicel for construction of the hotel, which opened in 2015.", "But the ABC News report contained no evidence that Digicel or O’Brien received any contracts for disaster recovery work in Haiti because of O’Brien’s ties to the Clinton Foundation.", "DRC Emergency Services, an Alabama-based disaster recovery company.", "ABC News also reported that Garry Mauro, “who served twice as the Texas state chairman for Bill Clinton’s presidential campaigns and has donated $25,000 to $50,000 to the Clinton Foundation,” wrote to Amitabh Desai of the Clinton Foundation on behalf of a client, DRC Emergency Services. Mauro wrote that DRC had “major assets in Haiti” and was ready to help in the recovery. Desai forwarded the email to Klevorick at the State Department, noting that Mauro is a friend of Bill Clinton’s, ABC News reported.", "ABC News writes that the “email chain does not indicate if Mauro’s recommendation led to a contract for DRC.” Mauro told ABC News that the company wanted to do business in Haiti, but he did not know if it received any disaster-related contracts. ABC News spoke to a company official who said that those familiar with the firm’s work in Haiti were no longer with the company.", "We spoke to Robert J. Isakson Sr., a co-founder of DRC Emergency Services and managing director of the company at the time of the firm’s work in Haiti. He told us that his former company (which he said he sold in 2013) had done work for years with the U.S. Army, dating to Desert Storm when President George H.W. Bush was in office. According to its website, DRC also built a 350-person compound in Port-au-Prince to support the U.S. Embassy in 2006, when President George W. Bush was president. DRC not only built the compound, but operated it as well.", "When the earthquake hit, Isakson said DRC Emergency Services had personnel in place to assist in the recovery and flew in more workers to help.", "An Alabama newspaper on Feb. 14, 2010 – just about a month after the earthquake – wrote that DRC was in Haiti “providing body recovery and demolition services, as well as sanitation and toilets for various aid organizations.” It also helped fly emergency personnel, such as doctors, to Haiti for free.", "Isakson told us that the company received about $10 million in disaster-related contracts in Haiti, but without any help from the State Department or the Interim Haiti Recovery Commission that Bill Clinton co-chaired. Instead, the company used its U.S. Army contacts to obtain quick approval for recovery work in Haiti, but that work lasted only a few months, Isakson said.", "“We had done a lot of work with the U.S. military,” Isakson recalled. “They have pre-event contracts. We hunted down their pre-event contractors and we showed them we were already prepared — we were ready — so they hired us.” (Pre-event contracts are established before a disaster strikes in order to expedite recovery efforts.)", "The U.S. Army hired DRC to do demolition work at the Hotel Montana, as well as toilet and sanitation work and construction of a temporary camp for military and civilian personnel, he said.", "“We picked up the toilet program, and camps for the military and private people there,” he said. “We may have done $10 million of work. It should have done half a billion.”", "Isakson said the company bid on other jobs, but was unsuccessful.", "“We never met with the State Department,” Isakson said. Asked about the Interim Haiti Recovery Commission, Isakson told us, “We got nothing from those guys.”", "We note that ABC News also mentioned in its story on FOBs that the State Department fielded a direct request for assistance from Rolando Gonzalez-Bunster, a board member of the Clinton Foundation and chairman and CEO of InterEnergy, which generates and distributes power in Latin America and the Caribbean.", "ABC News said Bunster sought the State Department’s help in obtaining “detailed satellite imagery of the Haitian power grid after the earthquake to help ‘do a reconnaissance of the status of the transmission and distribution lines and power plants.'”", "But, again, ABC News did not report that Bunster or his company received a contract. “Bunster told ABC News the grid work was a donation and later garnered his company an award for its efforts,” the story said.", "Contrary to Pence’s claim, ABC News did not report, and the emails obtained through the RNC’s FOIA request did not show, any evidence that Hillary Clinton’s aides at the State Department “directed contracts for the Haitian recovery effort … to friends of the Clintons.”", "https://www.sharethefacts.co/share/c5dc8e8e-5cd7-41ea-aa00-a422bc15914b", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]