["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post from the Jerusalem Prayer Team, an American Christian-Zionist organization  says a 1986 prophecy foretold of a plague like COVID-19 hitting New York City.", "The post says that David Wilkerson, the late founder of the Times Square Church, told Mike Evans, the leading pastor of the Jerusalem Prayer Team, the following:", "\"I see a plague coming on the world and the bars and church and government will shut down. The plague will hit New York City and shake it like it has never been shaken. The plague is going to force prayerless believers into radical prayer and into their Bibles and repentance will be the cry from the man of God in the pulpit. And out of it will come a third Great Awakening that will sweep America and the world.\"", "There is no evidence that Wilkerson, who died in 2011, actually made this prediction.", "PolitiFact reached out to the Times Square Church, the non-denominational church that Wilkerson established in 1987, and a spokesperson there said, \"The church is not aware of Pastor David ever writing that in any of his books or sermons.\"", "We did not receive a response to multiple inquiries to the Jerusalem Prayer Team. The Facebook post instructs readers to click on a link, where they can find video, transcript and a prophetic message from Evans as well as the \"entire prophecy from David Wilkerson.\" That page then instructs readers to enter their email address to receive a free speech by Evans where he shares Wilkerson’s prediction.", "The speech says Evans met Wilkerson for breakfast in 1986 at an Embassy Suites hotel near the Dallas-Fort Worth airport in Texas. There, according to Evans, Wilkerson predicted a plague so strong that it would shut down restaurants and bars in New York City.", "Evans writes that Wilkerson pointed him to the Bible’s Old Testament Book of Isaiah, where it says that \"every house will be shut up, and no one will be coming or going. The city of confusion is broken down, and every house is shut up that no man may come in.\"", "The book of Isaiah, which Judeo-Christian tradition holds was written by a prophet by the same name, does address a plague that forces people to stay inside and shuts down an economy. But it doesn’t explicitly point to the coronavirus hitting New York City. Chapter 24 is believed to describe the destruction of the Kingdom of Judah due to man’s inability to follow God’s covenant.", "Evans is promoting his new book, \"A Great Awakening is Coming!\" an ad for which appears to have aired on Fox News, and also focuses on this tale of Wilkerson’s prophecy. A video posted April 23 on a YouTube account called \"Mike Evans\" shows the ad airing during \"Fox and Friends.\"", "As a photograph of Wilkerson appears on screen, a narrator reads the same prophecy that is quoted in the Facebook post. \"Number one New York Times best-selling author Mike Evans has written an astonishing book on it called ‘A Great Awakening is Coming!’\" it continues. Then it directs viewers to get the book and the full prophecy by going to a website, where they can purchase the book in print, electronic form or in a set with DVDs selling for up to $56.90.", "Wilkerson’s claims have faced scrutiny before. In 2009, Snopes.com debunked the claim that he was sent a message from God warning of the terrorist attacks in New York City on Sept. 11, 2001.", "Wilkerson had claimed to have been awoken from a dream weeks before planes crashed into the Twin Towers and told by God to prepare sandwiches. He claimed that he and other members of the Times Square Church made over 2,000 peanut butter and jelly sandwiches. However, there was no evidence that the sandwiches were actually made prior to the attacks; they were actually made during the day on Sept. 11, after planes had already crashed into the Twin Towers.", "A Facebook post from the Jerusalem Prayer team says Wilkerson warned Evans of a plague striking New York City, shutting down bars and restaurants and forcing people to shelter in their homes.", "There is no evidence that Wilkerson said this, and his own church denies any instance of him saying this in a book or sermon. We rate the statement False.", "Facebook, Jerusalem Prayer Team, April 3, 2020", "Jerusalem Prayer Team, A Special Word from Mike Evans, accessed April 22, 2020", "Biblica, Intro to Isaiah, Accessed April 24, 2020", "Bible.org, Isaiah 24, Accessed April 24, 2020", "Snopes, David Wilkerson Predicts Imminent Catastrophe, March 2009", "Times Square Church, phone interview, April 22, 2020", "Twitter, Andrew Lawrence, April 23, 2020", "YouTube, A Great Awakening if Coming with Mike Evans, April 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]