["A new ad on the air in Nevada against the Republican tax law features a cheerful grandmother doling out brightly wrapped candy to her grandchildren. To the girl, she gives heaping handfuls. To the boy, a few pieces.", "When he complains how that’s unfair, the grandmother explains, \"Some people start off with more than others, and so, we’re going to be giving them even more.\"", "On the screen appear the words \"83 percent of Trump tax breaks go to the wealthiest 1 percent,\" with a reference to a Dec. 18, 2017, article on Vox.", "The ad from the group Tax March rehashes a Democratic talking point that we’ve addressed before. The number is roughly correct, but it leaves out a lot of important information.", "The tax cuts are a dividing line in the Nevada Senate race between the Republican incumbent Dean Heller, who voted for the law, and his Democratic challenger Rep. Jacky Rosen, who has said she would change it.", "A December 2017 analysis by the Tax Policy Center, a joint project of the Urban Institute and the Brookings Institution, is the underlying source for the 83 percent. The center modeled the impact of the tax law and looked at how different income groups fared in three years: 2018, 2025 and 2027.", "Only in one year, 2027, did 82.8 percent of the tax cuts go to the top 1 percent of tax filers. In 2018, the number was 20.5 percent, and in 2025, it was 25.3 percent.", "Both are a far cry from the big number in the ad.", "Why the large shift? In order to stay within the Senate rules that shaped the bill, most of the individual tax cuts end after 2025. That leaves the corporate tax cuts, which do more to help upper income earners. Also, the law changed the calculation for factoring in inflation and those adjustments become less favorable to taxpayers over time.", "As this chart shows, the lopsided benefits come in the final year.", "\"How much of the benefit of the tax bill goes to the top 1 percent income group greatly depends on what year you are looking at,\" Joseph Rosenberg, a senior research associate at the Tax Policy Center, told us in January.", "We asked Rosenberg if the center’s work allows any way to figure out the cumulative gains and losses over the 10 years of the tax law. He said there was not.", "\"We only published single year results, and only for three years,\" Rosenberg said.", "It is worth noting that not everyone inside each income group does equally well. For example, among the top 1 percent in the final year, about a quarter of the group sees a small tax increase of $1,250 on average.", "Finally, the statement talks about the \"wealthiest\" 1 percent. The study looked at annual income, which is how much money a person takes in. Wealth is the assets someone has accumulated over time.", "The Tax March ad says 83 percent of the Trump tax breaks go to the wealthiest 1 percent. The number is about right, but only for the last year of the tax law.", "In the two earlier years estimated by the Tax Policy Center, the share going to the highest income group was between 20 and 25 percent. The law does favor the well-to-do, but not by nearly as much as the ad says.", "We rate this claim Half True.", "Tax March, Grandma, June 21, 2018", "Tax Policy Center, Distributional analysis of the conference agreement for the Tax Cuts and Jobs Act, Dec. 18, 2017", "Vox, The Republican tax bill got worse: now the top 1% gets 83% of the gains, Dec. 18, 2017", "PolitiFact, DNC offers one-sided view on who gets tax bill's benefits, Jan. 16, 2018", "Factcheck.org, Democrats’ Misleading Tax Line, Jan. 26, 2018", "Email interview, Joseph Rosenberg, senior research associate, Tax Policy Center, July 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]