["About this rating", "Social media erupted with speculation as to the reason Biden walked away from the lectern at that moment, including that he forgot it was a news conference and thought he was at a town hall, that he mistakenly believed the event was over and was leaving, and that he was having a \"senile\" moment and simply \"wandering.\" Video evidence shows he took roughly four steps away from the lectern in the reporter's direction, as if trying to hear her better — though even that explanation, however likely, is mere speculation.", "On March 25, 2021, U.S. President Joe Biden held his first news conference since taking the presidential oath of office more than two months earlier.", "As viewers worldwide watched the event live, social media users remarked on an odd moment toward the end of the news conference when Biden left the lectern and continued talking even though he wasn't wearing a microphone. One Twitter user, for instance, circulated a video clip that they framed as evidence of Biden simply \"walking away\" as a reporter asked him a question, as if he were leaving.", "\"Why did Biden just get up and walk away in the middle of a question? Did he forget what he was doing? No worries, he circled right back,\" read the tweet.", "Others theorized that Biden forgot he was at a news conference and thought it was a town hall, or that he is \"senile\" and had simply wandered away from the podium for no reason at all.", "To investigate whether the online content authentically described a moment of the news conference in the White House's East Room, Snopes obtained an archived version of the above-displayed tweet after it was removed from the social media site.", "Snopes reviewed video footage of the event confirming that Biden indeed stepped briefly away from the lectern as reporter Janet Rodriguez of Univision asked questions. The moment happened about one hour into the news conference, according to C-SPAN's video recording of the event. Rodriguez first asked when the Biden administration would fulfill its promises of improving facilities for migrants at the U.S.-Mexico border, specifically unaccompanied children and toddlers.", "Then, she asked for more specifics on the administration's plan to address the root problems for why people in Central American nations seek refuge in the U.S. As she completed that question, Biden took about four steps in Rodriguez's direction while looking at her.", "\"Well, I can't guarantee that,\" he said, while out of reach of the lectern's microphone. (You can read the White House's transcript of Biden's answers to reporters' questions here.)", "He then walked back to the lectern, as shown around the 60-minute mark in this C-SPAN video:", "https://www.c-span.org/video/?510139-1/president-biden-holds-news-conference", "However, based on the video evidence, it is purely speculative to frame that moment as an example of Biden trying to leave the event prematurely and catching himself mid-faux pas, or forgetting the function of the event, or simply wandering away.", "Furthermore, when he moved, the president walked toward Rodriguez (in the opposite direction of the exit). A more plausible reason for his movement would be to hear the reporter more clearly (she was wearing a mask) as she asked her question.", "In the end, however, all these various explanations for why Biden walked away from the lectern are speculative.", "But considering the C-SPAN video footage of the press conference, which shows the president moving several steps toward Rodriguez as she asks a question, we rate the claim that he did so \"True.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]