["California State Assemblyman Travis Allen, R-Huntington Beach", "\"California Must Get Tough On Crime.\"", "That’s the message Travis Allen has proclaimed early in his campaign for governor, both on his website and in a video announcing his run.", "The Republican state assemblyman from Orange County announced his campaign for the high office on June 22, 2017.", "His website says \"California must re-establish our tough on crime policies that allow law enforcement to do their jobs and protect the victims of crimes, not the criminals.\"", "With Allen’s focus on crime, we decided to probe a related statement he made in the  video launching his campaign.", "\"California needs a new vision. California needs new leadership … I have seen crime increase in every major metropolitan area,\" Allen said, adding a moment later: \"Crime is on the rise in every major market.\"", "Allen makes his claim at about the 0:15 minute mark of the video above.", "Was Allen right? Has crime really increased in all California metros? And is it \"on the rise\" in every major market as he claimed?", "We set out on a fact check.", "Our research", "We asked Allen’s campaign spokeswoman for evidence to support his claim. She pointed us to several news articles that describe increases in crime from 2014 to 2015, both statewide and in large cities. They cite FBI data.", "Allen’s claim in the video doesn’t cite a specific timeframe for when he’s \"seen crime increase.\" He does, however, attribute the uptick to criminal justice reforms passed since 2011, giving the impression that this has been a recent increase.", "Crime data is widely available for cities, counties and states but less so for metropolitan areas. As a result, we focused on crime in large cities and counties.", "The nonpartisan Public Policy Institute of California has examined recent crime trends. It and other research groups have noted that 2014 was a historic low for crime in California.", "A PPIC analysis comparing the first half of 2014 to the same period in 2015 found widespread increases in crime rates in California cities with a population greater than 100,000. Of the 66 California cities that size, 49 saw an increase in violent crime and 48 experienced increases in property crime. Many saw double digit percent increases.", "\"A majority of cities saw increases in crime, but not every city,\" said Brandon Martin, who researches crime trends for PPIC, who co-authored the report.", "In a later report comparing the full year 2014 to 2015, the PPIC found 13 of the state’s 15 largest counties saw increases in both property and violent crime rates.", "Cherry-picked data?", "Taken alone, the crime increases in 2015 mostly support Allen’s claims.", "But researchers, including Martin, emphasized that California has seen dramatic long-term crime reductions since the 1990s.", "Allen’s statement omits this key context.", "SOURCE: Center on Juvenile and Criminal Justice, \"Urban Crime Trends Remain Stable Through California’s Policy Reform Era (2010-2016),\" February 2017.", "Mike Males is a senior researcher at the Center on Juvenile and Criminal Justice, a policy research group that makes recommendations on alternatives to incarceration.", "He said citing the increases in 2015 amounts to \"cherry picking.\"", "In a February 2017 report, Males examined more recent figures that show total crime -- or the raw number of property and violent crimes -- decreased in 41 of California’s largest 69 cities from the first half of 2016 compared to the first half of 2015. That contradicts the portion of Allen’s statement that says \"Crime is on the rise in every major market.\"", "Males described Allen’s overall statement as \"completely wrong,\" adding, \"certainly crime is not up in every major market.\"", "Overall, Males’ report found total urban crime fell 3 percent in the first half of 2016, driven largely by the decrease in property crimes.", "His report shows more mixed results, however, when separating the rate of violent and property crimes. A majority of the major cities saw increased violent crime rates during the more recent period, while a majority saw declines in property crime rates.", "Related fact check", "In March 2017, PolitiFact California rated Half True a related statement by State Sen. Jeff Stone. The Riverside County Republican claimed violent crime in California had been on the rise since 2011, when the state started passing major criminal justice reforms. He added that violent crime had spiked 12 percent statewide in 2015.", "We found the violent crime rate had ticked up about 3 percent between 2011 and 2015. But that increase wasn’t consistent year-to-year. It went up slightly in 2012, dropped the next two years and then went up again in 2015.", "Our ruling", "Republican candidate for California governor Travis Allen recently claimed he’s \"seen crime increase in every major metropolitan area\" and that \"Crime is on the rise in every major market.\"", "Allen’s claim is partially correct looking at 2015 alone. A majority of the state’s largest cities and counties saw crime ratchet up that year -- though not all of them.", "But Allen’s overall assertion ignores the fact that California’s crime rate was at a historic low the year prior, the result of a decades-long decline.", "Additionally, the second portion of his statement, that \"crime is on the rise in every major market\" is contradicted by a 2017 analysis that shows total urban crime fell 3 percent in the first half of 2016 compared with the first half of 2015.", "In the end, we found Allen’s claim contains an element of truth but ignores critical facts that would give a different impression.", "We rate his claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Visit our Tracking the Truth series here to see all of our 2018 governor's race fact-checks.", "Governor’s race", "Allen is the latest of several Republican candidates to announce a run for California governor. The others include John Cox, a venture capitalist from San Diego County and Rosie Grier, a Hall of Fame professional football player.", "Several prominent Democrats are also competing in 2018 to succeed Jerry Brown as governor. They include former Los Angeles Mayor Antonio Villaraigosa, California Treasurer John Chiang; Delaine Eastin, the state’s former superintendent for public instruction; and Gavin Newsom, the state’s current lieutenant governor.", "A poll released in June 2017 showed a tightening race. Newsom was in the lead among all candidates, with 22 percent support from likely voters. Villaraigosa had 17 percent support, up from his 11 percent three months earlier.", "Tracking the Truth: Hear a claim you want fact-checked? Email us at [email protected], tweet us @CAPolitiFact or contact us on Facebook.", "Travis Allen, website and video, June 22, 2017", "Interview, Stephanie Freedman, Travis Allen campaign spokeswoman, June 29, 2017", "Interview, Brandon Martin, research associate, Public Policy Institute of California, June 29, 2017", "Interview, Mike Males, senior researcher, Center on Juvenile and Criminal Justice, June 29, 2017", "Public Policy Institute of California, \"Crime Trends in California,\" August 2016.", "Public Policy Institute of California, \"Preliminary Data Show Higher Crime Rates in 2015,\" February 17, 2016.", "Center on Juvenile and Criminal Justice, \"Urban Crime Trends Remain Stable Through California’s Policy Reform Era (2010-2016),\" February 2017.", "PolitiFact California, Has violent crime been on the rise in Calif. since 2011? Did it spike 12 % in 2015?, March 6, 2015", "San Francisco Chronicle, guest column, \"An explosion of California property crimes — due to Prop. 47,\" March 18, 2016.", "Long Beach Press-Telegram, \"Long Beach 2015 crime stats releases: Double-digit spikes in violent and property crimes,\" January 22, 2016.", "The Los Angeles Times, \"Violent crime in L.A. jumps for third straight year as police deal with gang, homeless issues,\" December 30, 2016", "The Orange County Register, \"Number of California violent crimes increase 10 percent in 2015,\" July 2, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]