["Was South Africa's President Ramaphosa right that more than half of the women in the country had experienced intimate partner violence?", "The sources provided by the presidency for the claim that 51% of South African women experience abuse at the hands of their partners are limited to provinces or smaller regions.", "One of the researchers involved in the 2011 study from which the figure may have been drawn says it can’t be extrapolated to the whole country in 2020.", "The most recent data shows just over a quarter of South African women report domestic abuse, but experts also warn that collecting data on the topic is difficult.", "South Africa experienced a “dark and shameful week” in June 2020, according to president Cyril Ramaphosa.", "In a statement on 13 June, Ramaphosa said that “as much as 51% of South African women have experienced violence at the hands of someone with whom they are in a relationship”.", "His statement followed the murders of Tshegofatso Pule, Naledi Phangindawo, and Nompumelelo Tshaka, which put femicide – the killing of women – in the headlines again.", "The latest statistics show South Africa’s femicide rate is 4.8 times higher than the global average. On average, a woman is murdered every three hours in the country.", "But is the president correct about the percentage of South African women who experience violence at the hands of a partner? We investigated.", "The World Health Organization, or WHO, defines “intimate partner violence” as “behaviour by an intimate partner or ex-partner that causes physical, sexual or psychological harm”. It includes physical aggression, sexual coercion, psychological abuse and controlling behaviour.", "“If you witness domestic violence as a child in your home you are much more likely to go on to either be the victim of domestic violence in your own relationships later in life or to be a perpetrator of domestic violence,” Gould said.", "A 1999 study showed that between 19.1% and 28.4% of women in the Eastern Cape, Mpumalanga and Limpopo provinces reported ever being abused.", "A 2004 study of girls and women attending antenatal clinics in Soweto, a region of Johannesburg, found that 55.5% of participants reported having been physically and/or sexually assaulted by a male partner in their lives.", "A 2006 study of sexually active girls and women aged 15 to 26 in the Eastern Cape found that 26.6% of respondents reported experiencing more than one episode of physical or sexual intimate partner violence.", "The study sent to Africa Check that most closely matches the President’s claim is from 2011. It was conducted by women’s rights organisation Gender Links and the South African Medical Research Council.", "It found that 51.3% of women in Gauteng province reported experiencing either emotional, physical, sexual and/or economic violence in their lifetime.", "Dr Nwabisa Shai is a specialist researcher at the council’s gender and health research unit and worked on the study. She told Africa Check that the study’s findings could not be applied outside of Gauteng.", "“The danger with generalising to the rest of South Africa is that the rest of South Africa is not like Gauteng,” she said. “You might find there is a variation between what you might see in the Western Cape, for example.”", "The most recent data on the topic comes from the 2016 South African Demographic and Health Survey. It’s a nationally representative household survey, which provides data on a wide range of topics, such as population, health and nutrition.", "The survey looked at physical, sexual and emotional violence. It found that 26% of women who had ever had a partner had experienced one or more of these forms of violence. Physical violence was the most common form of violence experienced by women, at 21%. This was followed by emotional violence (17%) and sexual violence (6%).", "Rates varied between provinces. In KwaZulu-Natal, 19% of women respondents reported experiencing one or more form of violence. In the Eastern Cape, 38% of women reported experiencing violence.", "Experts said it was not easy to conduct research on intimate partner violence, as it could be a difficult issue to discuss with women.", "“You have to be very careful when you’re doing research on a subject like this because you don’t want to put the person who you’re interviewing at risk,” said Gould. “This isn’t the kind of research you can do every day or even every year.”", "There was also limited research on interpersonal violence that included economic abuse. Shai explained that this is when “men deprive women of access to income and use finances to control women”.", "President Cyril Ramaphosa claimed that “as much as 51% of South African women have experienced violence at the hands of someone with whom they are in a relationship”.", "The presidency provided Africa Check with a number of studies to support his claim, all of which were not nationally representative.", "The most recent, nationally representative data is from 2016. It shows that 26% of women reported physical, sexual or emotional abuse by their partners in their lifetime. We, therefore, rate the president’s claim incorrect.", "It’s important to note that intimate partner violence statistics can be difficult to compile. There is also limited data available on economic abuse. Accurate information on this topic is vital in order to understand this serious issue and devise solutions.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]