["The 36-second video shows three men attacking another man with sticks. It has been shared repeatedly on Facebook, for example here on March 24, 2019, where it has been viewed more than 5,000 times.", "The post’s caption says: “#Haryana, : #Gurgaon BJP workers beating muslim and asking go to Pakistan”. Gurgaon refers to a city in the north Indian state of Haryana.", "Below is a screenshot of one of the misleading Facebook posts:", "The clip has been shared elsewhere on Facebook with the same claim here and on YouTube here.", "The video actually shows an incident in Faridabad, another city about 30 kilometres (18 miles) from Gurgaon.", "A Google reverse image search using keyframes from the misleading video found that screenshots of the footage appeared in this March 14, 2019 report on Hindi-language news website Amarujala.", "The report quotes a senior police officer, Anil Kumar, who says the men seen in the video footage are members of what he calls a \"fracture gang\".", "“On February 17, 2019, they thrashed Sanju mercilessly with an iron rod in Faridabad, a town near Delhi and recorded his video and shared it. Since then police were on a lookout for the gang,” Kumar said in the Amarujala report, adding that three people were arrested March 12, 2019, in Faridabad.", "Below is a screenshot of the news report:", "The report’s headline says: “They used to take contracts to break limbs and would record it, they’re called the ‘fracture gang’ inspired by a movie.”", "The text above the first image says: “Police arrested three men, including the suspected kingpin of the so-called ‘fracture gang’ who, inspired by (Bollywood actor) Sanjay Dutt movie Vaastav (The Reality), carried out brutal attacks in Delhi and the surrounding area.", "\"In the film, gangsters sought revenge on their enemies by breaking their legs. They also filmed the attacks in order to instill fear in their enemies or prove they had carried out the assault.”", "The report says the video was filmed in Faridabad.", "Sections of the video were also broadcast in this report by local Hindi news channel Delhi Darpan TV, published to its YouTube account on March 14, 2019.", "A blurred version of the clip appears between 0:40 and 1:09 in the Delhi Darpan video embedded below:", "Here is a screenshot comparison showing the video in the misleading Facebook post (l) with the corresponding section in the Delhi Darpan TV YouTube video (r):", "The channel also interviewed police officer Anil Kumar about the video.", "In the report, he tells the news channel three assailants “Deepak, Ankit and Kulbhushan” were members of a “fracture gang” who attacked their victim and recorded a video, which was then circulated widely on social media as part of the extortion scheme.", "Official police complaints have been lodged against the three accused men and can be seen here on the police website: Deepak, Ankit and Kulbhushan.", "The complaints, filed on March 13, 2019, relate to an alleged attack in Faridabad on March 12.", "In the police complaints, the three men have been booked under the Indian arms act of 1959 for possession of illegal weapons and violence stemming from their use.", "On March 28, 2019, a reporter in AFP’s Delhi bureau telephoned the Bhupani Police Station in Faridabad where the complaint was filed.", "Senior police officer Abdul Sahid told AFP by phone: “The fracture gang members did not have any political connections.", "“The person caught on camera who was being beaten by fracture gang members was not a Muslim. He was a Hindu,” Sahid added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]