["In the wake of massive protests across various cities over the Citizenship Amendment Act and the NRC, a set of photographs has been posted on social media with the claim that it represents a massive crowd that gathered in West Bengal in support of the act.", "The text in Tamil, with which the photos have been posted states, “குடியுரிமை சட்டத்திற்கு ஆதரவாக திரண்ட மேற்கு வங்கத்தின் தேசபக்தர்கள்” (Patriots of West Bengal who rallied in support of Citizenship Act. Terrorists are on sight- Google translation). The tweet (now deleted) is by CTR Nirmal Kumar, who is the BJP state president for IT and social media, Tamil Nadu. Another tweet which has posted two photographs has been retweeted over 750 times so far.", "The photos have also been shared on Facebook.", "#CAB के समर्थन मे विशाल शोभायात्रा जो आपको मीडिया वाले नही दिखायेंगे!! 👇", "Posted by Santosh Hindlekar on Thursday, December 19, 2019", "The above post claims that these pictures represent gatherings in support of the Citizenship Amendment Act. There are four pictures in all.", "Alt News found that the photographs posted are old, and thus do not pertain to a gathering over the Citizenship Amendment Act. Let us take a look at each photo and its origin.", "Alt News reverse-searched the above photo and found it posted in an article published by The Indian Express in September 2016. The article is titled, ‘Kopardi rape case: Congress rivals in show of strength at Maratha protest rally in Ahmednagar‘. The photo pertains to a gathering of the Maratha community. The report states, “Lakhs of Marathas from hundreds of villages across the district converged at a rally here on Friday, in what is being seen as the biggest show of strength by the community that recently organised a string of protests across the state. They were demanding that the perpetrators of the rape and murder of a Maratha girl at Kopardi village in the district be hanged.” The photograph was clicked at Ahmednagar in Maharashtra.", "Upon reverse-searching the above image on Google, Alt News found this too pertains to the protest by the Maratha community in Maharashtra in 2016. The photo was published in an article by DNA dated October 16, 2016, which is about a march held in Thane by the Maratha community. It may be noted that DNA in its article has called this a ‘file photo’. Nonetheless, the presence of this image in October 2016 makes it evident that it has nothing to do with the current agitation.", "A reverse-search of the above photo revealed that it had been published in 2016. We found the same picture in an article by Live Mint. This photo too pertains to the Maratha agitation. The photo has been credited to Hindustan Times.", "Alt News found this photograph is also is related to the Maratha agitation of 2016. According to a report by India Today wherein this picture was published, it was clicked at Sangli in Maharashtra. The article is from October 2016.", "It may thus be noted that none of the photographs passed off as gatherings in favour of the Citizenship Amendment Act is recent. They pertain to the agitation by the Maratha community in Maharashtra in 2016.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]