["The 59-second video was published on Facebook here on December 2, 2020.", "The post’s Hindi caption translates to English as: “Twenty thousand Nihang Sikhs along with two thousand horses have started marching to Delhi from Punjab in solidarity of the protesting farmers today. #KisanAndolan #standwithfarmers #FarmersProtest”.", "The post circulated as thousands of farmers, mainly from the Sikh-dominated northern states of Punjab and Haryana, protested against agricultural reforms introduced by the Indian government, as AFP reported here.", "The video was also shared alongside identical claims on Facebook here, here, here and here and on Twitter here, here, here and here.", "The claim, however, is false.", "A reverse image search with video keyframes found that the video was posted on YouTube here on July 2, 2020. “Delhi Fateh Divas 2018 Budha Dal Nihang Singh,” reads the video description.", "Fateh Diwas — or “victory day” —  is celebrated every year by Sikh communities to commemorate the Sikh military victory in 1783 over the Red Fort, a historic fort in Delhi built during the Mughal empire.", "A further search found that the same video was also published on YouTube here on November 16, 2018.", "Other examples from past years of Sikhs from the warrior Nihang sect marking Fateh Diwas in the traditional blue and white garb can be seen on YouTube here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]