["About this rating", "On Oct. 31, 2019, the U.S. House of Representatives voted on a resolution to formalize an impeachment investigation into President Donald Trump. This resolution passed largely along party lines, with 231 Democrats and 1 independent voting in favor of the resolution, and 194 Republicans and 2 Democrats voting against.", "Shortly after this vote, some supporters of 2020 Democratic presidential candidate Tulsi Gabbard expressed disappointment that the congresswoman had voted in favor of the impeachment proceedings:", "For all you foolish Tulsi Gabbard fans ...", "She just voted for the illegal impeachment coup.", "She's just a better looking Nancy Pelosi.", "— Catturd (@catturd2) October 31, 2019", "Conservative personality Ann Coulter came to Gabbard's defense, however, telling Coulter's 2.2 million Twitter followers that Gabbard, who has courted the Republican vote with appearances on Fox News, didn't actually vote for the resolution because she is a senator and not a member of the House of Representatives:", "No she didn't. Tulsi is a SENATOR, meaning she's in the SENATE and doesn't vote on HOUSE resolutions. https://t.co/QnG2XyL1LB", "— Ann Coulter (@AnnCoulter) October 31, 2019", "Coulter was wrong.", "Gabbard is a member of the House, not the Senate, and she voted with the Democrats to formalize the procedures in the impeachment investigation into Trump.", "Gabbard, D-Hawaii, describes herself as \"Soldier. Veteran. Surfer. Congress. Candidate for President\" on her Twitter bio. Her official website can be found at gabbard.house.gov. She is listed in the House of Representatives' directory of members. In November 2012, when Gabbard was first elected to the House, the Washington Post wrote: \"Tulsi Gabbard, a Democrat from Hawaii, will become the first Hindu-American congresswoman, after defeating her Republican rival on Tuesday.\"", "As Gabbard is a member of the House, she had the opportunity to vote on the Oct. 31, 2019, resolution to formalize procedures for the impeachment investigation. And, like the majority of her Democrat colleagues, she voted in favor of the resolution. Gabbard's name is listed in the \"Yeas\" column for Resolution 660 on the House of Representatives' website.", "Walsh, Deirdre.   \"As Impeachment Inquiry Moves Into Open Phase, Here's What To Expect Next.\"\r\n    NPR.   31 October 2019.", "The Washington Post.   \"Buddhist, Hindu Make History in New Congress.\"\r\n    8 November 2012.", "Phillips, Morgan.   \"Tulsi Gabbard Echoes Republican Frustrations with Impeachment Inquiry: 'I Don't Know What's Going On In Those Closed Doors'.\"\r\n    Fox News.   25 October 2019.", "Fandos, Nicholase and Sheryl Stolberg.   \"A Divided House Endorses Impeachment Inquiry Into Trump.\"\r\n    The New York Times.   31 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]