["By Angelo Fichera", "Posted on March 13, 2018", "Q: Did President Trump sign an executive order giving Rep. Trey Gowdy the “highest level of security clearance”?", "A: No. That is a months-old fictitious claim that continues to circulate online.", "Some online stories would have readers believe that President Donald Trump gave Rep. Trey Gowdy — the Republican chairman of the House Oversight and Government Reform Committee — the “highest level of security clearance possible,” as one website put it.", "Those reports are false, as some Facebook users suspected and reported.", "A story published on mediaconservative.com with no byline alleged that the South Carolina congressman “has been given the highest level of security clearance possible, granted with an executive order from the President himself.”", "Trump has not signed such an executive order. It is not listed on the White House’s log of presidential actions. Nor does such an order appear on the Federal Register’s lists of executive orders in 2017 or 2018.", "Members of Congress do have access to intelligence “by virtue of their elected positions,” according to the CIA. The agency says that “classified intelligence reports are routinely provided only to the committees that have responsibilities in the national security area.”", "Gowdy is also a member of the House intelligence committee.", "While the mediaconservative.com story was posted Jan. 31 (and again March 9), the fictitious claim about Gowdy has circulated since at least late last year — when it appeared on thelastlineofdefense.online, which bills its work as “conservative satire” and states that “everything on this website is fiction.” The website is on our list of known purveyors of fake and satirical stories.", "The story didn’t stop at claiming that Trump gave Gowdy the “highest level of security clearance possible.” It also claimed without attribution that Gowdy’s next task “reportedly would be to investigate the extent to which Barack Obama went when he supplied the Muslim Brotherhood with weapons after they took control over Egypt by force.”", "A member of the Muslim Brotherhood — a political Islamist group that began in Egypt in 1928 — did become the president of Egypt in 2012, but not by force. Mohamed Morsi was the country’s first democratically elected president and held office until 2013, when he was ousted and jailed in a deadly coup by Egyptian armed forces.", "It was after the coup that the Obama administration ended military aid to the country — a moratorium that Obama later lifted in 2015.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“About.” thelastlineofdefense.online. Accessed 9 Mar 2018.", "“2017 Donald Trump Executive Orders.” Federal Register. Accessed 9 Mar 2018.", "“2018 Donald Trump Executive Orders.” Federal Register. Accessed 9 Mar 2018.", "Hale Spencer, Saranac. “No Shutdown Shakedown.” FactCheck.org. 23 Jan 2018.", "“How Intelligence-Sharing Works at Present.” Central Intelligence Agency. Accessed 9 Mar 2018.", "“HPSCI Majority Members.” U.S. House Permanent Select Committee on Intelligence. Accessed 9 Mar 2018.", "Kirkpatrick, David D. “Army Ousts Egypt’s President; Morsi Is Taken Into Military Custody.” New York Times. 3 Jul 2013.", "Liptak, Kevin. “Obama lifts freeze, ships arms to Egypt.” CNN. 31 Mar 2015.", "“President Trump Just Made Trey Gowdy The Most Powerful Man In Capitol Hill.” Mediaconservative.com. 31 Jan 2018.", "“Presidential Actions.” White House. Accessed 9 Mar 2018.", "“What is the Muslim Brotherhood?” Al Jazeera. 18 Jun 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]