["About this rating", "In January 2021, as the United States neared the one-year anniversary of its first confirmed case of COVID-19 and tallied an increasing number of new cases daily, a tweet circulated alleging this recommendation by New York state health officials to avoid spreading influenza during the 1918 pandemic: Kiss through handkerchiefs.", "The newspaper clip in the viral tweet was authentic.", "We used an online archive of historical newspapers and found the original article by the Democrat and Chronicle of New York's Rochester area, published on Aug. 17, 1918 — just months after the U.S. recorded its first patients diagnosed with the novel strain of the H1N1 virus that eventually killed about 675,000 Americans. (See our full investigation into how the 1918 pandemic got its \"Spanish flu\" nickname here.)", "The Democrat and Chronicle article read in full:", "Persons who want to avoid the Spanish influenza or the common garden variety of the same disease were warned by the New York City Department of Health to-day not to kiss, \"except through a handkerchief.\"", "While advising osculatory restraint [New York] Health Commissioner [Royal] Copeland announced that investigation has failed to show any signs of the Spanish affliction aboard the Norwegian steamship which arrived recently with many suspected cases. He declared it was \"simply influenza\" without the fever, headaches, delirium and nervous disorders associated with the Spanish variety.", "That article was published the same day The New York Sun printed the below-displayed story with the same recommendation — that the \"handkerchief kiss ... be brought into vogue at once.\"", "Led by Copeland, who later served as a U.S. Senator, the New York State Health Department also said \"don't spit in public places; don't use common drinking cups, glasses, spoons, forks and similar articles,\" and \"there is special danger in drinking from glasses that have not been washed,\" The Sun reported.", "News outlets nationwide reproduced the stories out of New York under their own headlines including, \"Flu May Get You, Should You Kiss\" (Salt Lake Telegram) and \"Want to Kiss and Escape Grip? Use Handkerchief!\" (Indianapolis Star), according to Thomas Ewing, a Virgina Tech professor who researches the history of epidemics.", "In a February 2020 report, he explained how the kissing message went viral (by standards of the early 20th century), while the news media generally ignored, or only summarized, other recommendations by public health authorities to curb the virus' spread. Ewing said:", "Warnings against kissing continued as the epidemic caused widespread illness and unprecedented numbers of deaths across the United States. Even as they adopted more drastic measures such as banning public meetings and closing schools, saloons, and stores, local health officials and medical experts echoed Copeland when they cautioned against kissing in Connecticut, Ohio, Salt Lake City, Chicago, and other states and cities. [...]", "Thinking carefully about risk mitigation measures recommended by authorities, without being distracted by “viral moments,” could result in a more responsible relationship between the American public, health agencies, and the media.", "Nonetheless, the underlying notion of the handkerchief recommendation — that fabric facial coverings prevent the spread of disease — was central to the COVID-19 pandemic more than a century later.", "In 2020, The Centers for Disease Control and Prevention (CDC) urged everyone to wear masks over their noses and mouths in public settings to avoid spreading or catching the SARS-CoV-2 virus that spreads via respiratory droplets when people cough, talk, sing, breathe — and kiss. And modern-day physicians and officials advised people against kissing (or engaging in sexual acts with) people outside of their own households, similarly to the 1918 pandemic.", "For example, at a March 2020 news conference, New York City Mayor Bill de Blasio suggested it \"wise\" for people to skip kissing at the end of dates considering the pandemic.", "Also, the Public Health Agency of Canada said in a September 2020 statement that people should forgo face-to-face contact with new people altogether unless they \"consider using a mask that covers the nose and mouth.\"", "As for the image in the above tweet depicting a man and a woman wearing fabric masks while kissing, the photograph was taken during a flu epidemic in Hollywood, California, in 1937 — not 1918 — according to Getty Images' database of photos.", "Nayeema Raza, an opinion producer for The New York Times, used the same photograph for a May 18, 2020, piece titled \"What Single People Are Starting To Realize.\"", "In sum, considering the articles in the Democrat and Chronicle and The Sun, it was accurate to claim the New York State Department of Health advised people to kiss through handkerchiefs during the 1918 flu pandemic.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]