["The 30-second video was published on Twitter here on November 5, 2020. It has since garnered more than 13,300 views.", "The traditional Chinese-language tweet translates to English as: “Evidence of organised fraud by staff members at the polling station”.", "The post circulated online two days after the US presidential election, following which President Donald Trump repeatedly made unsupported claims of widespread voter fraud, as AFP reported here.", "As of November 11, Trump is yet to formally concede to former vice president and Democratic challenger, President-elect Joe Biden, who was declared the winner by US media on November 7.", "The CCTV footage of a polling station was also shared alongside a similar claim on Twitter here.", "The claim, however, is misleading.", "A reverse image search on Yandex and a further keyword search found video was published by US newspaper The Washington Post on YouTube here on March 19, 2018, two years before the 2020 US election.", "The video is headlined: “Watch: CCTV footage shows alleged ballot-stuffing in Russia elections”.", "The video’s caption reads: “While Russian President Vladimir Putin was reelected in a landslide victory on March 18, videos emerged of alleged ballot-stuffing at polling stations across Russia.”", "The footage shared in the misleading tweet corresponds to the one-minute 25-second mark of The Washington Post’s video.", "Below are screenshot comparisons of the footage in the misleading tweets (L) and The Washington Post’s video (R):", "The same footage of voter fraud in Russia was also published in 2018 by AFP here, by Canadian television network Global News here and by British newspaper The Guardian here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]