["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "More than 898,000 people around the world have died from COVID-19, but a recent Facebook post suggests that no politicians are among them.", "\"Not one politician has died from the virus, lost their job, or had their business looted,\" the post says. \"Y’all know you’re being played right?", "This post is wrong and it was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Multiple politicians and government officials around the world have died of COVID-19.", "Former Republican presidential candidate Herman Cain is perhaps the most well-known U.S. politician to die of complications from COVID-19.", "According to Ballotpedia, at least one federal or state official was diagnosed with COVID-19 in more than half of the states. The site identified eight politicians who have died as a result of the disease, including Reggie Bagala, a Republican state representative in Louisiana, and Bob Glanzer, a Republican state representative in South Dakota. The family of Michigan state Rep. Isaac Robinson, a Democrat, said they suspect he also died of COVID-19.", "Abroad, Al Jazeera reports that Somalia’s former prime minister, the justice minister of Somalia’s autonomous Hirshabelle state, the secretary general of Guinea, a provincial minister for human settlement in Pakistan, a local legislator in Pakistan, a former Greek health minister, and Nigeria’s chief of staff, among others, have died from COVID-19.", "We rate this claim False.", "Facebook post, Sept. 4, 2002", "Johns Hopkins University of Medicine, COVID-19 dashboard, visited Sept. 9, 2020", "PolitiFact, Herman Cain died of COVID-19, not cancer, July 31, 2020", "Ballotpedia, Government official, politician, and candidate deaths, diagnoses, and quarantines due to the coronavirus (COVID-19) pandemic, updated Aug. 28, 2020", "The Times-Picayune, Louisiana lawmaker Reggie Bagala dies amid battle with coronavirus at age 54, April 9, 2020", "Associated Press, South Dakota lawmaker dies of coronavirus, April 4, 2020", "Al Jazeera, Coronavirus pandemic: Which politicians and celebs are affected? Sept. 9, 2020", "Local 4, Michigan state Rep. Isaac Robinson dies; family suspects COVID-19, March 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]