["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Finance Committee member Sen. Pat Toomey (R-PA) questions Federal Internal Revenue Service Commissioner Charles Rettig during a hearing in the Dirksen Senate Office Building on Capitol Hill April 10, 2019 in Washington, DC. (Chip Somodevilla/Getty", "Sen. Pat Toomey this week criticized President Joe Biden’s proposed $1.9 trillion coronavirus relief package, saying the direct payments Biden wants to send Americans are poorly targeted to those most in need.", "\"There will be several thousand dollars in payments going to families with six-figure incomes who’ve had no income interruption whatsoever,\" Toomey (R., Pa.) said Tuesday during a Senate confirmation hearing for Janet Yellen, Biden’s nominee for Treasury secretary.", "We wondered just how much such families will receive if Biden’s plan is signed into law.", "Toomey is right. Married couples making up to $150,000 annually would qualify for $2,800 in new payments, on top of the $1,200 they should have received this month from the relief package then-President Donald Trump signed into law late last year.", "Together, those payments would total $2,000 per person — the target Democrats in Congress set, Trump made a late and unsuccessful push for, and that Biden is now pursuing from the White House.", "Individuals making up to $75,000 would qualify for $1,400 in new aid on top of the $600 payments they just got. And adults with dependent children ages 16 and younger would qualify for an additional $600 per child.", "Analysts estimate this component of Biden’s plan could cost $465 billion.", "During the Senate Finance Committee hearing, which took place the day before Biden’s inauguration, Toomey argued against direct payments for upper middle class families who haven’t endured any loss of income during the pandemic.", "Yellen acknowledged the payments aren’t designed to target the people hurting the most, but rather intended to support families and stimulate the economy broadly.", "\"Some families presumably don’t greatly need the money, but there are many families who are under stress,\" Yellen told Toomey.", "The eligibility criteria for direct payments under Biden’s plan mirrors the one Congress agreed to a few weeks ago, which set the upper income limit for the smallest payments at $174,000 for a married couple.", "Toomey told Yellen it would be tough to find bipartisan support for Biden’s proposal, but several Senate Republicans have already endorsed the idea, including Marco Rubio of Florida, Josh Hawley of Missouri, and Lindsey Graham of South Carolina.", "Democrats were first to pitch the idea of $2,000 per person direct payments, but it was Trump who made a late push for them in December, threatening to withhold his support for the relief package unless the payments were included. He eventually relented and signed the package into law without the larger payments.", "Toomey said families with six-figure incomes who’ve had no income interruption will get several thousand dollars in payments under Biden’s coronavirus relief package. That’s right. Couples who make up to $150,000 annually will get $2,800, plus $600 for each child age 16 and under, on top of payments received from the last relief package. We rate the statement True.", "Biden Harris Transition, \"The Biden Emergency Action Plan to Save the Economy,\" accessed Jan. 20, 2021", "New York Magazine, \"What Is in Joe Biden’s $1.9 Trillion Stimulus Package Plan?\" Jan. 14, 2021", "CNET, \"Make sure your second stimulus check was for the right amount. How to check,\" Jan. 14, 2021", "CNN, \"Biden puts $2,000 stimulus payments back in play,\" Jan. 14, 2021", "Tax Foundation, \"Congress Passes $900 Billion Coronavirus Relief Package,\" Dec. 21, 2020", "PolitiFact, \"What’s in Joe Biden’s $1.9 trillion American Rescue Plan?,\" Jan. 15, 2021", "The Wall Street Journal, \"Yellen Makes Case for Sweeping Stimulus Package in Face of GOP Skepticism,\" Jan. 19, 2021", "CNET, \"Who's eligible for a stimulus check? Here are income limit, age qualifications, more,\" Jan. 15, 2021", "Newsweek, \"These Are The Senate Republicans Who Support $2,000 Stimulus Checks,\" Dec. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]