["About this rating", "On 1 November 2018, the Trump administration's senior adviser on drug pricing reform, Daniel Best, was found \"unresponsive\" near the garage door exit of a Washington, D.C., apartment building. He was pronounced dead at the scene by first responders.", "A statement released the same day by Health and Human Services Secretary (HHS) Alex Azar mourned Best as a \"friend and colleague\" but addressed neither the circumstances nor the cause of his death. No other details were released to the public.", "Two weeks later, on 15 November, the office of Washington, D.C.'s chief medical examiner announced that Best had died of \"multiple blunt force injuries.\" His death was ruled a suicide. No other information was provided.", "Internet conspiracy theorists questioned that ruling. Noting the pharmaceutical industry's objections to the very task Best was hired to accomplish (i.e., lowering prescription drug costs), not to mention President Trump's announcement days before Best's death of a plan to reduce Medicare drug prices and the fact that Best died of blunt force injuries, the theorists took to social media to float the idea that Best was the victim of foul play and not suicide:", "BREAKING: Death of Trump HHS official, Daniel Best, tasked with getting lower drug prices from pharmaceutical companies is ruled a suicide, even though he died from \"multiple blunt force injuries.\"", "Nothing to see here folks. pic.twitter.com/qiWNH0epeQ", "— Mike Tokes (@MikeTokes) November 17, 2018", "Another ‘suicide’ the Media is ignoring. RIP Daniel Best. #ma4t pic.twitter.com/Gt1wojG3eM", "— Mike Allen (@AMike4761) November 17, 2018", "Far-right conspiracist websites followed suit. An 18 November article on Neon Nettle suggested that the the public was being asked to believe that Best had beaten himself to death:", "The Chief Medical Examiner’s verdict raised questions among the health community, with many people refusing to believe Best killed himself by repeatedly hitting himself with a blunt object until he died.", "Erin Elizabeth of HNN [Health Nut News] described the ruling of Best's death as \"confusing,\" saying:", "“How does one kill themselves by hitting themselves with a blunt object? Repeatedly?”", "Another conspiracy-mongering website, Uncle Sam's Misguided Children, posed the same sarcastic question:", "So did he lie down under a garage door and let it hit him “multiple times” or did he beat himself to death with a baseball bat? How does that work? Add to the very few actual articles on his death -- this man was described as one of Trump’s “senior” HHS officials working with Alex Azar. Things that make you go hmmmm.", "There's a fallacious assumption underlying this notion, however: namely, that blunt force injuries can only be sustained in the course of a physical attack by an assailant (or oneself). But that isn't how forensic pathologists define \"blunt force injury.\" According to Prahlow and Byard's Atlas of Forensic Pathology, a blunt force injury is any \"resulting from impact with a blunt object, i.e., one that does not possess any sharp edges\":", "Examples of blunt objects include hammers, baseball bats, fists, the interior surfaces of vehicles, roads, trees, floors, walls, furniture, and even fluid objects such as bodies of water (if the speed of impact is sufficiently high).", "Medical University of South Carolina pathology professor Nicholas I. Batalis observes in \"Forensic Autopsy of Blunt Force Trauma\" (Medscape, 2016) that blunt force injuries can be caused in myriad ways that have nothing to with assault and battery (emphasis added):", "Deaths resulting from blunt force trauma are some of the most common cases encountered by the practicing forensic pathologist. Whereas other forms of traumatic death (e.g., gunshot wounds, sharp force injuries) occur under a relatively limited number of circumstances, deaths resulting from blunt force trauma occur in a variety of scenarios. For instance, almost all transportation fatalities -- including those involving motor vehicle collisions, pedestrians being struck by vehicles, airplane crashes, and boating incidents -- result from blunt force trauma. Other deaths resulting from blunt force trauma involve jumping or falling from heights, blast injuries, and being struck by a firm object, such as a fist, crowbar, bat, or ball. Bite wounds and chop injuries may be considered variants of blunt force trauma, sharp force trauma, or a class of injuries unto themselves.", "Blunt force trauma is routinely involved in cases classified as accidents, as well as in cases of suicide and homicide.", "Finally, we put the known facts of the case to Thomas Sporn, M.D., Chief of the Section of Pulmonary and Thoracic Pathology at Duke University Medical Center, and asked him if a ruling of suicide makes sense. He responded via e-mail to say:", "Jumping off a building and striking the (blunt) pavement would result in blunt force injuries, as would, say, darting into traffic, and of course most aviation and motor vehicle fatalities are from blunt force injuries. So it's definitely possible to sustain self-inflicted blunt force injuries, depending on the circumstances.", "To date, we aren't privy to a full account of how Daniel Best sustained his injuries, nor their precise nature, nor any other evidence (such as a suicide note, if one exists) that prompted medical examiners to conclude that he killed himself. But there is clearly nothing contradictory about his having suffered blunt force injuries during the commission of a suicide. Given the facts at hand, there is no reasonable basis for speculation to the contrary.", "Alonso-Zaldivar, Ricardo and Deb Riechmann.   \"Trump Announces Plan to Lower 'Unfair' Prescription Drug Prices.\"\r\n    Real Clear Politics.   26 October 2018.", "Batalis, Nicholas I.   \"Forensic Autopsy of Blunt Force Trauma.\"\r\n    Medscape.   2 March 2016.", "Eaton, Sabrina.   \"Death of HHS Official Daniel Best Is Ruled a Suicide.\"\r\n    The Plain Dealer.   15 November 2018.", "Eaton, Sabrina.   \"Ohio's Daniel Best, Who Led HHS Prescription Drug Initiative, Has Died.\"\r\n   The Plain Dealer.   2 November 2018.", "Prahlow, Joseph A. and Roger W. Byard.   Atlas of Forensic Pathology.\r\n    Berlin: Springer, 2012.   ISBN 9781617790584.", "Weixel, Nathaniel.   \"Azar Taps Former CVS Executive to Help Lower Drug Prices.\"\r\n    The Hill.   29 March 2018.", "Correction [21 November 2018]: A previous version of this article incorrectly attributed a slogan to Neon Nettle.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]