["The COVID-19 vaccines that use mRNA technology do not instruct the immune system to make the virus’ spike proteins forever. The mRNA instructions are given at the time of vaccination and are broken down by the body within days.", "The innovative technology in a pair of COVID-19 vaccines continues to face attacks from misinformation on social media.", "One recent Facebook post inaccurately suggests the messenger RNA vaccines trick the immune system into making virus proteins nonstop, sending it into \"perpetual overdrive.\"", "\"What happens when your body’s own cells are programmed to keep making the protein of an invader, nonstop, forever and ever, with no programmed end date?\" the post says. \"What happens when your immune system is in perpetual overdrive, tricked into believing there’s a pathogen that just never goes away?\"", "While the post doesn’t specify that it’s referring to Pfizer/BioNTech and Moderna’s mRNA vaccines, it details the technology in those vaccines that instructs cells to make the protein of an invader. Comments on the post also show it’s understood that the claim is about those vaccines.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is a flawed understanding of how mRNA vaccines work in the body.", "The mRNA shots do provide cells instructions to produce copies of the spike protein that surrounds the SARS-CoV-2 virus — so that it learns to recognize it and make antibodies against it — but it’s inaccurate to say that this happens \"over and over.\" It doesn’t.", "Messenger RNA is relatively short-lived and degrades quickly, researchers and health officials say. After the protein piece is made, the cell breaks down the instructions and gets rid of them.", "\"When you’re given the mRNA, it enters the cytoplasm of your cells and has the company of thousands of other copies of mRNA that are there to make proteins and enzymes to keep your cells alive and your body functioning,\" said Dr. Paul Offit, director of the Vaccine Education Center at Children’s Hospital of Philadelphia and member of the FDA’s vaccine advisory committee. \"This is just one more protein that degrades after a few days.\"", "A Facebook post claims the mRNA vaccines send the immune system into \"perpetual overdrive\" and tricks it into making an invader’s protein forever.", "The COVID-19 vaccines that use mRNA technology do not instruct the body to make the virus’ spike proteins forever. The instructions are given at the time of vaccination and are broken down within days.", "We rate this False.", "Facebook post, March 8, 2021", "PolitiFact, 8 facts and 4 unknowns about the coronavirus vaccines, Dec. 17, 2020", "U.S. Centers for Disease Control and Prevention, Understanding mRNA COVID-19 Vaccines, Updated March 4, 2021", "Pfizer, BEHIND THE SCIENCE: WHAT IS AN MRNA VACCINE?, Aug. 25, 2020", "Reuters, Fact Check-COVID-19 vaccines using mRNA do not send the immune system into ‘perpetual overdrive’ by instructing cells to create the spike protein over and over again, March 11, 2021", "Phone interview, Dr. Paul Offit director of the Vaccine Education Center at Children’s Hospital of Philadelphia, March 15, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]