["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidate Donald Trump speaks with 'Today' show co-anchor Matt Lauer at the NBC Commander-In-Chief Forum held at the Intrepid Sea, Air and Space museum aboard the decommissioned aircraft carrier Intrepid, New York. (AP)", "The long shadow of the Iraq War continues to color presidential politics.", "In a forum focused on national security, Democrat Hillary Clinton was questioned about her Senate vote in favor of action against Iraq. She in turn noted that Donald Trump initially supported the war.", "When it was Trump’s turn, the Republican nominee denied the charge.", "\"I was totally against the war in Iraq,\" Trump said during the NBC News event. \"You can look at Esquire magazine from '04. You can look at before that.\"", "Well, we have gone back further than the 2004 interview Trump mentioned, and the record tells a different story.", "Trump has a hard time getting past a September 2002 interview with shock jock Howard Stern. Stern asked Trump if he supported the looming invasion.", "Trump responded, \"Yeah, I guess so.\"", "Trump dialed that back a bit in another interview in January 2003, a few months before the invasion. Fox News’ Neil Cavuto asked Trump whether President George W. Bush should be more focused on Iraq or the economy.", "\"Well, he has either got to do something or not do something, perhaps, because perhaps shouldn't be doing it yet and perhaps we should be waiting for the United Nations, you know,\" Trump said. \"He's under a lot of pressure. I think he's doing a very good job. But, of course, if you look at the polls, a lot of people are getting a little tired. I think the Iraqi situation is a problem. And I think the economy is a much bigger problem as far as the president is concerned.\"", "So Trump put the economy ahead of confronting Iraq, but he didn’t speak against going to war. At most he suggested waiting for the United Nations to do something.", "A week after the United States invaded Iraq on March 19, 2003, Trump gave different takes. At an Academy Awards after-party, Trump said that \"the war’s a mess,\" according to the Washington Post. He told Fox News that because of the war, \"The market’s going to go up like a rocket.\"", "The earliest evidence of Trump’s outright opposition to the war came in that August 2004 article in Esquire:", "\"Look at the war in Iraq and the mess that we're in. I would never have handled it that way,\" Trump said.", "Trump has been challenged many times in this election to explain his early acceptance of the war. In a February 2016 interview on NBC’s Meet the Press, Trump said that he didn’t know what he meant during his 2002 conversation with Stern.", "\"That was a long time ago, and who knows what was in my head.\" Trump said.", "Our ruling", "Trump said he was \"totally against the war in Iraq.\" While he came to that position when the war became difficult, earlier on he was more accepting of military action. In 2002, asked if America should go to war, he said, \"I guess so.\" Less than three months before the invasion, Trump said the president should be more focused on the economy, but he didn’t speak against launching an attack.", "Trump didn’t speak often about the Iraq War before it happened, but what he said did not add up to the sort of opposition he describes today.", "We rate this claim False.", "https://www.sharethefacts.co/share/836f664c-ac07-4562-9333-ddef70b3bb65", "PolitiFact, Trump still wrong on his claim that opposed Iraq War ahead of the invasion, June 22, 2016", "RealClear Politics, Trump Responds To Howard Stern/Iraq Interview: \"Who Knows What Was In My Head?\", Feb. 21, 2016", "Washington Post, \"Donald Trump’s baseless claim that the Bush White House tried to ‘silence’ his Iraq War opposition in 2003,\" Oct. 21, 2015", "Huffington Post, \"Donald Trump's Anti-Iraq War Position Wasn't As Prophetic As He Thinks,\" Sept. 14, 2015", "Buzzfeed, \"Despite Claims, There’s No Record Of Donald Trump Being Against The Iraq War Before It Started,\" Sept. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]