["South African media widely reported a claim by World Vision that pandemic measures had led to a surge in teenage pregnancies. But the stat is based on localised, incompatible data.", "World Vision attributed their claim to Tanzanian data on pregnancies in women aged 15 to 19 from 2015/16, combined with figures on the increase in pregnancies in girls between 10 and 19 in Sierra Leone during the 2014 Ebola epidemic.", "World Vision did not explain how it used this data to come up with the figure of one million school girls becoming pregnant across the region.", "Experts did not think the data supported the claim made, and warned of the unreliability of using data gathered under varied and localised circumstances to speak to general conditions across sub-Saharan Africa.", "More than a year after the emergence of Covid-19, countries around the world are still struggling to curb its spread. In many places, travel has been restricted, curfews imposed and gatherings banned.", "World Vision International, a Christian relief organisation working in more than 90 countries, made a startling claim about the consequences of school closures in sub-Saharan Africa.", "In August 2020, the organisation published a report which estimated that “as many as one million girls across sub-Saharan Africa may be blocked from returning to school due to pregnancy during Covid-19 school closures”.", "This was widely reported in South Africa in November 2020. “Lockdown leads to surge in teen pregnancies,” read the headline of an article in online newspaper HeraldLive.", "The statistic was also reported on by a number of other media publications and mentioned in a television interview with news channel eNCA.", "Could the alarming figure be correct? We took a closer look.", "World Vision told Africa Check it used two statistics to calculate the figure.", "The first was on pregnancies in women aged 15 to 19 from the 2015/16 Tanzania Demographic and Health Survey. It showed that 10% of these were among young women with some level of secondary education or higher. This figure was used as a “regional proxy” to represent the situation across sub-Saharan Africa.", "The second statistic was from Sierra Leone. Tony Baker, senior advisor from the organisation’s external engagement team, told Africa Check that adolescent pregnancies increased by as much as 65% during the 2014 Ebola outbreak, when schools were closed for eight months. The World Health Organization and the United Nations define adolescents as those aged 10 to 19.", "The figure “is largely based on qualitative information from communities in Sierra Leone after the Ebola crisis and is an average of highly localised, widely varying information,” he said. (Note: Two reports were provided in support of the figure. They can be viewed here and here.)", "Baker said this increase could occur again due to Covid-19 school closures.", "World Vision did not respond to questions about how it used the two figures to calculate that one million school girls could have fallen pregnant during lockdown.", "Dr Sarah Neal, associate professor of global health at the University of Southampton in the UK, raised a number of concerns about the use of the figure from Tanzania. Neal’s research interests include maternal, neonatal, child and reproductive health in low and middle income countries.", "“The proportion of those pregnant with a high school education is based on a very small proportion of the population of sub-Saharan Africa, and may not be representative of the continent,” she told Africa Check.", "Dr Sibusiso Mkwananzi, demographer and senior researcher at the University of Johannesburg’s Centre for Social Development in Africa, echoed this concern. It isn’t common practice to use one country’s statistics to represent an entire region, she said, as countries across sub-Saharan Africa have different teenage pregnancy levels.", "Second, the young women aged 15 to 19 with a secondary education who got pregnant in Tanzania were not necessarily in school at the time of the pregnancy. “A proportion, and in many cases a significant proportion, will have already left for other reasons before they become pregnant,” Neal said.", "What about the statistic showing a 65% increase in adolescent pregnancies in Sierra Leone due to Ebola school closures?", "The overall percentage rise experienced referred to adolescent pregnancies, Neal said, and not specifically to young women in school. It could also be linked to increased poverty, gender-based violence, and reduced access to family planning, in addition to school disruption.", "“The 65% increase also includes young women aged 18 to 19 who may have actually completed their secondary education,” Neal said.", "Using qualitative data to estimate an increase in adolescent pregnancies was also not advisable, Mkwananzi told Africa Check.", "“When we project population numbers in demography, we assume high, medium and low projection variants and then show three possible future outcomes,” she said.", "Ideally, data on the increase in adolescent pregnancies during Covid-19 school closures should have been gathered from the same area and between two points in time.", "“Using Tanzanian data and Sierra Leone circumstances should have been conducted cautiously and with strict warnings to the reader that although those were the assumptions being applied, they might not hold for the coronavirus situation.”", "“There could be an increase in adolescent pregnancy as a result of Covid,” Neal told Africa Check, but she said such an increase would be a result of school closures as well as other underlying causes.", "Mkwananzi was not aware of studies looking at adolescent pregnancy during the Covid-19 pandemic and lockdowns.", "She said that lockdown measures had been shown to increase levels of gender-based violence, including sexual assault. This could lead to more pregnancies among adolescents, she said. It’s also possible that individuals had less access to sexual and reproductive health services during the pandemic.", "While these are reasonable assumptions, studies have yet to prove their validity, she said.", "An August 2020 report by World Vision International claimed there could be an increase in teen pregnancies across sub-Saharan Africa due to Covid-19 lockdown measures. It said that, as a result, one million pregnant girls in the region faced difficulties returning to school.", "World Vision told Africa Check the figure was based on the 2015/16 Tanzania Demographic and Health Survey and qualitative data from communities in Sierra Leone during the 2014 Ebola outbreak.", "Experts raised two major concerns with the calculation. First, levels of teenage pregnancy differ across sub-Saharan Africa and one country’s statistics may not be representative of the entire region. Second, the data used to calculate an increase in teenage pregnancy should have been gathered from the same area and should have been quantitative in nature.", "While experts agreed an increase in teenage pregnancy due to Covid-19 lockdowns was possible, studies had yet to examine this. Without any further evidence to support the one million figure, we rate this claim unproven.", "Photo: MICHELE CATTANI / AFP", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]