["By Eugene Kiely", "Posted on October 24, 2017", "President Donald Trump boasted that unemployment claims fell to their lowest level since 1973. He’s right, but it’s part of a post-recession trend that began long before he took office.", "In fact, Trump’s predecessor could have made the same claim — as illustrated by an April 14, 2016, headline on Fortune magazine’s website when Barack Obama was president: “Unemployment Claims Fall to Lowest Since 1973.”", "Trump made his remarks while hosting a group of minority business owners in the Oval Office.", "Trump, Oct. 24: A recent Department of Labor report showed the fewest jobless claims since 1973. Think of that — 1973. We just had a report — we have the fewest jobless claims. I don’t think the press — I tell that because the only way I’ll get the word out there is if I say it because they’ll never say it. (Laughter.)", "The president is referring to an Oct. 19 press release by the Department of Labor on weekly unemployment insurance claims. The department reported the advance, or preliminary, figure for seasonally adjusted initial unemployment insurance claims was 222,000 in the week ending Oct. 14 – “the lowest level for initial claims since March 31, 1973.”", "The latest figure is a continuation of a post-recession trend. New jobless claims stood at 591,000 on Jan. 17, 2009, shortly before Obama took office, and peaked at 665,000 on March 28, 2009. The number of new claims has been falling ever since, dropping to 241,000 on Jan. 14, 2017, the last report before Obama left office.", "The jobless claims declined by 59 percent under Obama and 7.9 percent, so far, under Trump. The chart below shows the decline in new claims each week since December 2007, when the Great Recession started, based on Department of Labor data.", "Trump also falsely accused the news media of ignoring the latest economic milestone. Actually, numerous media outlets reported the latest jobless claims numbers. In fact, the CNN headline echoed Trump nearly verbatim, “Jobless claims the lowest since 1973.”", "USA Today (“U.S. unemployment claims fall to 222,000, lowest in 44 years”), the Washington Post (“Unemployment claims drop to lowest level in more than 44 years”), and the New York Times (“US Unemployment Claims Fall to 222,000, Lowest in 44 Years”) also took note of the latest figures.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]