["About this rating", "An April 2018 article based on a controversy involving Cambridge Analytica's collection of Facebook user data asserted that social media users could receive $17,500 each in compensation over the \"data breach\" (which Facebook asserted was not a data breach but rather an unauthorized acquisition of user data by a third party).", "That original article was soon available only via archived and aggregated versions. It wasn't clear why the original article (published to a little-known web site) had been removed, but even that original walked its headline claim back a few lines into its text:", "All Facebook Users Could Cash in as much $17,500 Each After Data Breach", "If your data was harvested through Facebook you could get £12,500 compensation, according to an expert. The social network has come under fire after it was revealed Cambridge Analytica kept users’ data.", "This could cost Facebook £625 billion, which is double the £317b it is worth, law professor Maureen Mapp argued.", "‘There are about 50 million users whose data was harvested,’ she told the Sun.", "‘Assuming each one of them brought a claim for compensation for distress caused by the data breach ... each individual may be awarded £12,500 as damages ... But a more likely outcome is that users would receive a maximum of £500 each, according to data protection lawyer David Barda, who works for Slater and Gordon.", "He added: ‘The amount of compensation will depend on the level of distress suffered, but Facebook could be facing claims of up to £500 per Facebook user if those users were able to demonstrate their distress.’", "The article appeared to have been sourced from an 2018 article published by the UK tabloid The Sun. But that highly speculative Sun article pertained solely to users in the UK who might be entitled to damages under a law (Data Protection Act 1998) specific to the UK and not applicable in the United States or elsewhere:", "In order to get the cash users would have to prove they had suffered distress as a result of the data breach and it would fall under the Data Protection Act. Facebook founder Mark Zuckerberg has apologised for the way user data was handled. Cambridge Analytica is currently being investigated UK Information Commissioner’s Office.", "In short, the notion that Facebook users could collect money from the social network over the Cambridge Analytica controversy was a highly speculative one that was specific to UK users only and posited £12,500 (US $17,500) as a theoretical maximum rather than a likely payment.", "Nsubuga, Jimmy.   \"UK Facebook Users 'Could Get £12,500 Each After Data Breach.\"\r\n    Metro.co.uk.   28 March 2018.", "FB News Post.   \"All Facebook Users Could Cash In As Much $17,500 Each After Data Breach.\"\r\n    5 April 2017.", "Wikipedia.   \"Data Protection Act 1998.\"\r\n    Accessed 6 April 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]