["About this rating", "The California Public Utilities Commission floated a plan to institute a surcharge on texting charges.", "The proposal would not have charged users per text message, nor would it have gone towards funding free phones for \"illegals.\"", "California officials proposed in November 2018 a new surcharge on cell phone users' monthly bills, a move that was misrepresented by some social media users as a \"text tax\" and targeted for expression of anti-immigrant sentiment.", "The California Public Utilities Commission's (CPUC) proposal would have instituted a surcharge on text messaging services to be included in cell phone users' monthly service bills. The commission's plan called for the revenues so raised to be used to fund public-purpose programs that provide phone service for lower-income residents as well as for deaf and disabled residents.", "However, the proposal did not call for a \"5-cent tax\" per text message. Rather, the tax would have been based on a percentage of a cell phone users' monthly bills, costing around $1.40 per $20 of texting charges. The surcharge would have been similar to  existing taxes, as KGO-TV reported:", "For example, you pay about 3.75 percent for Universal Lifeline Telephone Service, which funds discounts for low-income customers.", "You pay .40 percent for the Deaf and Disabled Telecommunications Program, which funds free specialized equipment to customers who need them.", "The CPUC says it needs the \"text tax\" because revenue that funds those programs is down, since people are making fewer calls and texting more.", "Regardless, some social media users accused the CPUC of seeking to financially benefit people they felt were undesirable, such as \"drug addicts\" and \"illegals\":", "The commission had originally planned to vote on the issue on 10 January 2019, but the Federal Communications Commission (FCC) stepped in on 12 December 2018 and ruled that both Short Message Service (SMS) and Multimedia Messaging Service (MMS) should be regulated as \"information services\" akin to email and not as  telecommunication services.", "The FCC's 3-1 decision meant that text messages would fall under the purview of the federal Telecommunications Act, which limits state jurisdiction over them. Five days later, the CPUC announced that the proposal for the surcharge had been withdrawn from their docket.", "Sze, Kristen.   \"If Passed, This Is How California's 'Text Tax' Would Affect Your Cellphone Bill.\"\r\n    KGO-TV.   12 December 2018.", "Woolfolk, John.   \"FCC Decision Deals Blow to California Text-Tax Plan.\"\r\n    [San Jose] Mercury News.   12 December 2018.", "Timm, Jane C. and Dennis Romero.   \"O rly? California Considers Plan to Tax Text Messages.\"\r\n    NBC News.   13 December 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]