["About this rating", "Days after he took office, U.S. President Joe Biden signed an executive order reversing former President Donald Trump's ban on transgender people serving in the military.", "About a month and a half later, various right-leaning websites published headlines that circulated widely on social media claiming that transgender surgery was now free for the military. That prompted Snopes readers to ask us whether that was true.", "\"Transgender surgery is now free for military, thanks to Biden executive order,\" a headline on a March 10, 2021, opinion article in the Washington Examiner read. \"Biden executive order provides free transgender surgery to military members,\" the Blaze reported.", "The main focus of Biden's Jan. 25 \"Executive Order on Enabling All Qualified Americans to Serve Their Country in Uniform\" was to overturn Trump's policy restricting the conditions under which transgender people are allowed to serve in the military (which itself overturned more lenient policies established during the Obama administration). Biden's order calls for \"establishing a process by which transgender service members may transition gender while serving,\" but it doesn't specifically mention, much less call for, free funding for transition-related surgeries.", "In a statement supporting Biden's executive order, U.S. Secretary of Defense Lloyd Austin indicated that the military would facilitate transgender troops' access to medical care but didn't specifically address funding for transition-related surgery:", "The Department will immediately take appropriate policy action to ensure individuals who identify as transgender are eligible to enter and serve in their self-identified gender. These changes will ensure no one will be separated or discharged, or denied reenlistment, solely on the basis of gender identity. Prospective recruits may serve in their self-identified gender when they have met the appropriate standards for accession into the military services. This revised policy will also ensure all medically-necessary transition related care authorized by law is available to all Service members and will re-examine all cases of transgender Service members that may be in some form of adverse administrative proceedings.", "As of this writing, Tricare, the civilian health care provider for the military \"generally doesn’t cover surgery for gender dysphoria.\" Gender dysphoria is a medical condition in which for \"some transgender people, the difference between the gender they are thought to be at birth and the gender they know themselves to be can lead to serious emotional distress that affects their health and everyday lives if not addressed.\"", "According to Tricare, \"active duty service members may request a waiver if their provider deems surgery medically necessary.\" We asked Tricare whether Biden's executive order would change the current policy in any way, to which a spokesperson told us, \"Maybe.\"", "The U.S. military's providing of health care for transgender service members, including transition-related surgeries, precedes Biden's presidency. In November 2017, the Pentagon announced it had approved gender-reassignment surgery for an active duty member of the military. The case made headlines, LGBTQ-focused news site Pink News observed, because it was so rare.", "A 2019 analysis by USA Today on the cost associated with health care for transgender troops found it to be relatively negligible in comparison to the overall budget and size of the Armed Forces. Between July 2016 and the 2019 USA Today report, there had been 161 transition-related surgeries. The overall size of the military at that time numbered 2.1 million troops.", "In sum, Biden's executive order of Jan. 25, 2021, overturned a Trump policy severely restricting the options of transgender people serving in the military, which itself overturned policies established under the Obama administration. However, we have found no evidence to confirm or deny the claim that Biden's policy changes will \"provide free transgender surgery to military members.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]