["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A judge in Ukraine has ordered that a criminal case file be opened regarding Biden’s efforts as vice president to get Ukraine’s top prosecutor removed from office.", "The bar is low in Ukraine for opening a criminal case file; in this case, it was requested by a member of parliament.", "The opening of the file does not mean that a criminal investigation has been launched on merit, or that Biden is a suspect.", "\"If there were a serious criminal investigation against Joe Biden, I think we’d know about it.\"", "That’s what Lincoln Mitchell, a war and peace studies scholar at Columbia University, told PolitiFact about a social media claim being shared about the presumptive Democratic presidential nominee barely three months before Election Day.", "The July 22 Instagram post is an image of a tweet posted two days earlier. The tweet reads:", "\"BREAKING: Democratic Presidential nominee @JoeBiden is formally being listed as a criminal suspect by high level Ukraine government officials, in a major case involving his son -- Hunter.\"", "The Instagram post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "\"That is fake. Joe Biden is not listed as a suspect in any criminal case in Ukraine,\" Daria Kaleniuk, executive director and co-founder of the Anti-Corruption Action Centre, a leading anti-corruption voice in Ukraine, told PolitiFact.", "Moreover, a court in Ukraine has no right to issue a notice of suspicion in a criminal investigation; that is done only by prosecutors, she told us.", "As we’ve reported:", "Hunter Biden, the former vice president’s son, held a paid directorship with a natural gas company called Burisma Holdings, beginning in 2014. It drew attention because Burisma was owned by Mykola Zlochevsky, a minister under Russia-friendly President Viktor Yanukovych.", "When Yanukovych went into exile after a popular revolution, Zlochevsky faced a variety of corruption-related investigations involving his business. In 2015, Ukraine’s newly appointed prosecutor general, Viktor Shokin inherited some of the investigations. He was ousted in 2016 by the legislature.", "In 2018, Joe Biden said that while he was vice president, he had threatened to withhold aid from Ukraine unless Shokin was sacked. Biden said Shokin was failing to aggressively pursue allegations of corruption in Ukraine.", "The claim in the Instagram post cites a two-minute video from One America News Network, a conservative cable news service, that was viewed more than 1.2 million times.", "The video states that a Ukrainian court ordered Biden to be formally listed in a criminal case and that the order cannot be appealed. The crime, according to the video, is the alleged firing of Shokin \"in exchange for dropping an investigation\" into Hunter Biden and Burisma.", "The report cites no sources.", "Andriy Derkach is a Ukrainian lawmaker and former member of Ukraine’s pro-Russia political party who has been called the \"Ukrainian Putin.\" He has alleged that audio recordings he released of conversations between Joe Biden and former Ukrainian President Petro Poroshenko showed corruption by Biden and treason by Poroshenko in their discussions about ousting Shokin, the prosecutor.", "News reports in May said Ukrainian prosecutors had launched a treason investigation of Poroshenko.", "President Volodymyr Zelensky said prosecutors had \"registered criminal proceedings\" at the request of Derkach, and \"they will investigate.\"", "Experts say the order involving Biden is much less than it appears.", "Kaleniuk told us that Derkach’s complaint was registered only because it had been rejected by prosecutors.", "\"It doesn’t mean that Joe or Hunter Biden are suspects. It means that, according to Ukrainian criminal procedure code, all formal criminal complaints have to be registered by law enforcement agencies, and if they don’t do so, the claimant can force prosecutors to start formal investigation through court,\" she said.", "Ukraine expert Adrian Karatnycky, a senior fellow at the Atlantic Council, which promotes engagement in international affairs, told PolitiFact that in Ukraine, \"criminal case files are opened pending investigations at the request of parliamentarians, on the basis media allegations, requests from civic groups and citizens. This is not the same as an actual criminal investigation. Such cases are registered and do not rise to the level of criminal investigations until the allegations are first vetted.", "\"Once a criminal investigation is launched on merit, the subject is informed in writing and asked to provide testimony, appear for interrogation, etc. And only after this is a criminal indictment potentially issued,\" said Karatnycky, who is also managing partner at New York-based Myrmidon Group, which does consulting on Ukraine.", "In a news story, the Kyiv Post reported that Judge Serhiy Vovk issued the order for the investigation on April 21, but it only became public on May 21. Vovk has a \"toxic reputation\" and has faced accusations of issuing illegal and politically motivated rulings, the story said.", "A claim that Joe Biden is formally listed as a criminal suspect in a case in Ukraine involving his son Hunter misconstrues the facts.", "A judge in Ukraine has ordered that a criminal case file be opened regarding Biden’s efforts as vice president to get Ukraine’s top prosecutor removed from office. But the opening of the file does not mean that a criminal investigation has been launched on merit and does not mean Biden has been listed formally as a criminal suspect.", "We rate the statement False.", "Instagram, post (archived here), July 22, 2020", "Twitter, tweet (archived here), July 20, 2020", "PolitiFact, \"Trump’s Ukraine call, a whistleblower and the Bidens: What we know, what we don’t,\" Sept. 23, 2019", "Interview, Lincoln Mitchell, adjunct associate research scholar in the Arnold A. Saltzman Institute of War and Peace Studies at Columbia University, July 27, 2020", "Email, Daria Kaleniuk, executive director and co-founder of the Anti-Corruption Action Centre in Ukraine, July 27, 2020", "Email, Peter Zalmayev, Eurasia Democracy Initiative director, July 27, 2020", "KHPG.org, \"Criminal probe against Poroshenko regarding Biden tape discredits Zelensky and Ukraine,\" May 21, 2020", "Tass, \"Ukrainian prosecutors launch high treason case against ex-president Poroshenko,\" May 19, 2020", "Daily Beast, \"The New Top Prosecutor in Ukraine Has Joe Biden in Her Sights,\" June 1, 2020", "The Telegraph, \"Ukraine's president welcomes criminal probe against former opponent,\" May 20, 2020", "The Atlantic, \"Is OAN the Leading Edge of Russian Misinformation?\", June 11, 2020", "Washington Post, \"Ukraine’s Zelensky pulled back into U.S. political fray after leaked Biden audio,\" May 20, 2020", "Kyiv Post, \"Controversial Ukrainian judge orders case against Biden,\" May 22, 2020", "Email, Adrian Karatnycky, senior fellow at the Atlantic Council and managing partner at New York-based Myrmidon Group, which does consulting on Ukraine, July 28, 2020", "Email, Joe Biden campaign spokesman Andrew Bates, July 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]