["About this rating", "A video purportedly showing black stones raining from the sky in Sinop, Turkey has been circulating on social media since May 2016:", "This video is frequently circulated along with a picture of black stones and the claim that this unusual storm was a sign of end times:", "Both the video and photograph are real, but the video shows an ordinary hailstorm, and the photograph of black stones was taken from an unrelated event.", "The hailstorm video was taken by Hava Durumu and was shared by the Facebook page \"Severe Weather Europe\" on 19 May 2016, who described it as capturing the \"Pretty intense vide of the severe hailstorm in Sinop, Turkey earlier this week.\"", "Meteo News also shared this footage with a similar caption labeling the weather event a \"hailstorm.\"", "Although the hailstones seen in the video may appear black (most likely because they are splashing into muddy water), other video footage originating with this storm in Sinop, Turkey, showed the hailstones landing on a street and provided an unobstructed view of their 9ordinary) color:", "Furthermore, Severe Weather EU posted several photographs showing the objects that fell from the sky during this hailstorm, which clearly show hailstones and not black stones:", "The photograph of \"black stones\" is unrelated to the May 2016 hailstorm in Turkey and has been circulating online since at least November 2015, when it was shared in a news article about villagers in Turkey who were selling meteorite fragments:", "When a 230kg meteoroid exploded and fell on small mountain village in eastern Turkey in the autumn, few could have imagined the wealth it would generate for its 3,200 residents.", "Long caught up in the crossfire between Kurdish PKK militants and the Turkish army, Sarıçiçek villagers assumed the explosion they heard around midnight on September 2nd and the illuminated sky was as a result of the recently resumed conflict. When small pieces of debris started to rain down on them, they thought it was just shrapnel from another rocket attack.", "On closer inspection, shopkeeper Mehmet Nezir Ergün realised the black rocks that had littered his garden were in fact pieces of meteorite. He informed officials at nearby Bingöl University, who sent over a team of scientists. Confirming Ergün’s discovery, the university’s Prof. İskender Demirkol then notified NASA, the Turkish Scientific and Technological Research Agency, and his academic colleagues in Istanbul University.", "As details of the discovery seeped out, dealers from around the world descended on Sarıçiçek, prompting a modern day gold rush. Every man, woman and child in the village was out in search of this outer space treasure to sell to collectors, some finding pieces as large as 4-5 kilos.", "Their commercial savviness has captured global media attention. Over the past few weeks, they have reported on how Sarıçiçek turned rich overnight, with villagers making an estimated £1 million from meteorite sales, allowing many to splash out on new homes and cars in time for the New Year.", "Seibert, Thomas.   \"'A Meteorite Saved My Town.'\"\r\n    The Daily Beast.   11 December 2015.", "BBC News.   \"Turkey: Villagers Cash in on Meteorites.\"\r\n    17 November 2015.", "CNN Turk.   \"Bir taş sattım bir araba aldım.\"\r\n    13 November 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]