["About this rating", "Several local Goodwill stores did engage in fundraising or offer supplies and services of various kinds to victims of the wildfires.", "Since Goodwill is a network of independent local organizations, these efforts could not be guaranteed at every local Goodwill thrift store, and they were not part of a uniform policy.", "In November 2018, Northern California's Camp Fire caused more than 40 deaths and destroyed thousands of homes in the foothills of the Sierra Nevada mountains, especially the town of Paradise, which was almost completely destroyed in the inferno.", "In response, charities, churches, businesses and members of the public in the surrounding areas offered what help they could to those who were forced to leave their homes behind.", "Against this background, a viral Facebook post claimed that Goodwill, the non-profit organization that operates thrift stores throughout the United States, was offering free blankets, toiletries and other necessities to anyone in the state of California who could present identification and proof that their homes had been caught up in the Camp Fire:", "On 10 November, Lori McNeill wrote:", "Hey everyone, I was at Goodwill tonight and I talked to the manager. She said that if any of the victims from the Paradise fire go into any Goodwill in the state and show ID and proof that they fled from their home (like vehicle registration) the manager at ANY Goodwill will give you blankets, clothes, toiletries and anything you need. Even things for your pets. Please re-post this as much as possible so that people get the help they need. And remember to pray like crazy for these people.", "Internet users, no doubt motivated by a sincere wish to provide helpful advice to those affected by the devastating fire, shared this post widely on Facebook, Twitter and Instagram.", "However, the reality was more complicated. A spokesperson for the non-profit Goodwill Industries International explained in a statement to us that the Goodwill thrift stores familiar to many Americans are not akin to branches of a chain store, governed and overseen by a centralized hierarchy which decides on uniform policies. Rather, they are independent members of a nationwide network of organizations.", "Goodwills function autonomously, meaning that each local Goodwill operates independently with its own board of directors who appoints a president and CEO and operates the stores and donation centers in those areas. Goodwill organizations use the revenue from the sale of goods to create job training and education opportunities and support services, such as child care, financial education, youth mentoring and tax preparation for anyone facing challenges to finding employment.", "Several Goodwill organizations within the Council of California Goodwill, an association of 14 autonomous Goodwill organizations, are joining together to provide support and resources to those impacted to residents from the evacuated communities—many of whom have lost everything.", "So while some local Goodwill organizations in California and Oregon had decided to provide assistance of various kinds to victims of the wildfires, these were autonomous decisions, and not a universal policy handed down to all Goodwill locations in those states. As such, it's quite possible that someone forced to flee the fires would find help, potentially including free blankets, supplies or clothes, at their nearest Goodwill location. However, contrary to the viral meme's claim, this was not guaranteed for every store, or part of a uniform policy.", "The spokesperson provided some details of the initiatives being undertaken by some regional Goodwill members. (This list is not exhaustive, and will be updated when we receive further information from Goodwill Industries):", "Goodwill Industries told us that anyone affected by the wildfires could call 1-800-GOODWILL in order to find out what assistance might be available at their nearest Goodwill outlet.", "Many other local charities and churches were providing assistance of various kinds to those caught up in the fires. The details can be found in this article published by the Redding-based news channel KRCR.", "Chavez, Nicole; Hanna, Jason.  \"103 Missing -- Most of Them Senior Citizens -- in California's Camp Fire, Sheriff's Office Says.\"\r\n  CNN.  14 November 2018.", "St. John, Paige; Phillips, Anna M.; Tchekmedyian, Alene.  \"'Mass Devastation' as Fire Destroys at Least 1,000 Structures in Northern California Town of Paradise.\"\r\n  The Los Angeles Times.  8 November 2018.", "Pike, Haleigh.  \"Camp Fire Evacuees: Where to Find Basic Needs, Food, Clothing and Supplies.\"\r\n  KRCR.  11 November 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]