["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The first and only U.S. Senate debate between Sen. John McCain and his Democratic challenger, U.S. Rep. Ann Kirkpatrick of Flagstaff, featured plenty of partisan finger-pointing.", "McCain accused Kirkpatrick of standing with Hillary Clinton while Kirkpatrick lobbied the same attacks, wondering why it took the senior senator so long to renounce Donald Trump.", "\"You know, there was a day John McCain was a maverick and would stand up to his party,\" Kirkpatrick said during the Oct. 10 debate. \"Now, he has taken more money from Wall Street than any other sitting senator.\"", "This claim against the 2008 Republican presidential nominee jumped out at us.", "We have heard similar Wall Street-related attacks this presidential cycle.", "Just last month, Trump claimed Clinton has received \"$100 million from Wall Street and hedge funds.\" We rated it False, because the number is closer to $64 million.", "And in March, Clinton said President Barack Obama took more money from Wall Street during his 2008 campaign \"than anybody ever had.\" We rated it Mostly True -- Mitt Romney eventually broke the record in 2012.", "We wondered, has McCain been in the pockets of Wall Street?", "The contributions", "Kirkpatrick campaign spokesman D.B. Mitchell pointed us to their analysis of campaign contributions from the nonpartisan Center for Responsive Politics.", "As we’ve noted previously, the center considers the \"securities and investment\" category as the most Wall Street-centric.", "Kirkpatrick’s camp also included contributions from the \"commercial banks\" and \"miscellaneous finance\" categories. We should also note that these contributions do not come from the firms themselves, but individuals.", "Here is how the numbers stack up:", "SECURITIES & INVESTMENT", "MISC FINANCE", "COMMERCIAL BANKS", "TOTAL", "JOHN MCCAIN", "$12,665,118", "$6,495,872", "$2,844,073", "$22,005,063", "CHARLES SCHUMER", "$12,616,062", "$1,832,371", "$1,609,677", "$16,058,110", "MITCH MCCONNELL", "$4,119,160", "$1,204,439", "$1,269,839", "$6,593,438", "McCain, who was elected to the Senate in 1987, does appear to have taken the most contributions -- more than $22 million -- from Wall Street.", "But, there are some caveats.", "Presidential fundraising", "McCain campaign spokeswoman Lorna Romero said the numbers are skewed because they include contributions made during the senator’s 2008 presidential run.", "She noted that he is the only current member of Congress to win his party’s nomination.", "\"That’s a different level of campaigning and fundraising,\" Romero said.", "That’s fair because, overall, Obama and Clinton have taken the most money from Wall Street, former senators with presidential runs in their own right.", "According to Viveca Novak, a spokeswoman with the Center for Responsive Politics, McCain received more than $19 million from Wall Street during his presidential run.", "\"For his presidential campaign, he received $10,804,533 from Securities & Investment, $5,902,217 from Misc Finance and $2,372,700 from Commercial Banks,\" she said.", "Michael Traugott, a research professor at the University of Michigan, said Kirkpatrick’s claim is misleading.", "\"Taking into account contributions across a career would be a misleading comparison with other U.S. senators who have not served for the same length of time or been a presidential candidate,\" Traugott said. \"I think those qualifiers should be taken into account.\"", "Our ruling", "Kirkpatrick said, \"(McCain) has taken more money from Wall Street than any other sitting senator.", "The numbers are on the mark, but need clarification. McCain ran for president in 2008, which does involve a higher level of fundraising.", "Excluding his presidential run, the senior senator has taken significantly less money from Wall Street.", "On balance, we rate her claim Half True.", "https://www.sharethefacts.co/share/ee15a938-4d9b-4ebc-b7b9-b765887d7b60", "U.S. Rep. Ann Kirkpatrick, \"2016 U.S. Senate debate: McCain and Kirkpatrick,\" Oct. 10, 2016", "ABC15, \"Sen. John McCain and Rep. Ann Kirkpatrick trade jabs in first and only U.S. Senate debate,\" Oct. 10, 2016", "ABC15, \"Sen. John McCain drops support for Donald Trump,\" Oct. 8, 2016", "PolitiFact Wisconsin, \"How much money have Wall Street and hedge funds given to Donald Trump’s campaign?\" Oct. 6, 2016", "PolitiFact, \"Hillary Clinton: Barack Obama set new Wall Street fundraising record when he first ran for president,\" March 7, 2016", "Center for Responsive Politics, \"Top Industries Senator John McCain,\" accessed Oct. 14, 2016", "Center for Responsive Politics, \"Securities & Investment, All Senators,\" accessed Oct. 14, 2016", "Interview with Kirkpatrick campaign spokesman D.B. Mitchell, Oct. 11, 2016", "Interview with McCain campaign spokeswoman Lorna Romero, Oct. 11-12, 2016", "Interview with political analyst Richard Skinner, Oct. 12, 2016", "Interview with University of Michigan research professor Michael Traugott, Oct. 15, 2016", "Interview with Center for Responsive Politics spokeswoman Viveca Novak, Oct. 18, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]