["About this rating", "On 20 February 2019, an article reporting that President Donald Trump had invoked the 25th Amendment to remove Nancy Pelosi as House Speaker for mental health reasons was published by the website BustaTroll.org, an extension of the \"America's Last Line of Defense\" network of junk news websites:", "BREAKING: Trump Invokes 25th Amendment to Expel Nancy Pelosi for Mental Health Reasons", "President Trump and his attorney, Rudy Giuliani, have decided the time has come to bust open the Bill of Rights and use everything in their power to defend themselves against the Democrats and the fake news press.", "That includes invoking the 25th Amendment, written to give those in power the right to police their own. According to Article 5 of the sacred document, written by Ben Franklin in 1788:", "“Sub-section 34: No member of Leadership, be it the President, Vice President, Speaker of the House or Senate Pro Tempore, is exempt from mental health evaluation and concern. In particular we pay attention to dementia and the over-use of the poppy, absinthe or cannabis.", "Upon unanimous vote of the Cabinet, that leader shall be replaced by the next in the line of succession.”", "This was not a genuine news report but rather a piece of fiction of published by a well-known purveyor of junk news.  The 25th Amendment governs issues regarding the removal and replacement of the President and Vice President of the United States, not the Speaker of the House of other members of Congress.", "\"America's Last Line of Defense\" is a network of political trolling sites that mock President Trump and his base of supporters under the guise of proffering \"satire.\" This article, for example, was tagged \"Pelosi satire so rubes have a woman to hate\" category.", "Eagleton, Flagg.   \"BREAKING: Trump Invokes 25th Amendment to Expel Nancy Pelosi for Mental Health Reasons.\"\r\n    Bustatroll.org.   20 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]