["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Here's our cropped version of a Facebook meme featuring U.S. Rep. Sheila Jackson Lee, D-Houston. We found no sign of her saying this (Facebook post, shared Feb. 7, 2015).", "Democratic Rep. Sheila Jackson Lee can be a firecracker of a public speaker.", "But we were skeptical of a Facebook meme, shared online Feb. 7, 2015 and brought to our attention by a reader. The meme showed Jackson Lee, a Houstonian initially elected to the House in 1994, saying: \"Hey, all you wrinkly, white-aged has-beens: It’s time for you to die and let the next generation have your spot on the planet.\"", "A web search led us to similar though less racially charged language posted by Stand Up for the Truth, a Wisconsin-based weekday religious public affairs program, in a November 2012 web post critical of the United Nations. The post opened: \"Hey all you wrinkly, middle-aged has-beens: Are you ready to move over and let the next generation have your spot on the planet? After all, you’ve lived a good life. And your aging body is going to cost taxpayers a lot more than the salt you think you are worth. In other words, your return-on-investment isn’t looking so good to the United Nations.\"", "By email, the program’s co-host, Amy Spreeman, said she recalled \"coming up with the term, ‘wrinkly has-been’ for that article. I'm a descriptive writer who also happens to be seeing a few wrinkles in my own mirror,\" Spreeman wrote.", "Our Google and Nexis news database searches for signs of Jackson Lee saying such words came up empty. We also asked the Alabama-based Southern Poverty Law Center, which tracks the activities of hate groups, if it had noticed such words from the Texan. Spokesman Mark Potok said not, otherwise pointing out a center white paper on the United Nations issue raised by Stand Up for Truth.", "We also queried Michael McQuerry, a spokesman for Jackson Lee, who said by email: \"She has NEVER said this... This is someone who has taken her picture and placed these words on this. No truth to this at all.\" Asked if Jackson Lee had ever called for an individual or individuals to die, McQuerry replied: \"NO.\"", "Our ruling", "The Facebook meme says Jackson Lee called on \"all you wrinkly white-aged has-beens\" to die.", "Not so, nor has she said anything close. Pants on Fire!", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Web post, \" Time to die: U.N. ads promote killing off the elderly,\" Stand Up for the Truth, November 2012 (accessed Feb. 24, 2015)", "Email, Amy Spreeman, co-host, Stand Up for the Truth, Feb. 24, 2015", "Email, Mark Potok, senior fellow, editor, Intelligence Report, Southern Poverty Law Center, Feb. 24, 2015", "Emails, Michael J. McQuerry, communications director, U.S. Rep. Sheila Jackson Lee, Feb. 24, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]