["About this rating", "South Carolina's Trey Gowdy rose to national prominence chairing a Congressional committee that led an infamously long and fruitless investigation into allegations of wrongdoing by then-Secretary of State Hillary Clinton over the 2012 attack on U.S. government facilities in Benghazi, Libya, that left four Americans dead.", "After leaving the U.S. Congress, Gowdy -- once a vocal proponent of congressional oversight of the executive branch -- was slated to join a team of outside lawyers representing President Trump as he faces an impeachment inquiry, according to a statement sent to news outlets by Trump's personal lawyer Jay Sekulow.", "The statement, published by The New York Times on Oct. 9, 2019, reads: \"I have known Trey for years and worked with him when he served in Congress. His legal skills and his advocacy will serve the president well. Trey’s command of the law is well known and his service on Capitol Hill will be a great asset as a member of our team.\"", "We sent a request for comment about Gowdy's hiring to Sekulow's advocacy law firm, American Center for Law and Justice but had received no response at the time of publication.", "Sekulow's statement came shortly after Fox News reported that Gowdy had been terminated from his position as a contributor with the network. Gowdy held his position at Fox News up until the news broke that he would join Trump's outside legal team.", "Just one day after the news broke, President Trump told reporters that because of \"lobbying rules,\" Gowdy would be unable to start representing him until sometime in January 2020:", "Trump, at White House departure, says Trey Gowdy is a great guy. He says Gowdy says he can’t start as one of his outside lawyers til January because of lobbying rules.", "— Jennifer Jacobs (@JenniferJJacobs) October 10, 2019", "When January 2020 rolled around, however, Gowdy announced that he would not be joining Trump's legal team after all. McClatchy reported on Jan. 2 that Gowdy's announcement ended months of Washington \"speculation and intrigue\":", "Amid confusion late last year regarding his status on President Donald Trump’s legal team, former Republican Rep. Trey Gowdy said Thursday he has no plans to formally assist the White House in its effort to defend the president in the Senate’s upcoming impeachment trial.", "“The president has good lawyers and more importantly good facts,” Gowdy said in an email to McClatchy. “He does not need another lawyer added to his team. He needs the trial to begin and end.”", "Gowdy, a former federal prosecutor, was first elected to the House of Representatives in 2010 but did not seek reelection in 2018. The Republican House majority flipped in the 2018 midterm election, and in October 2019 the Democratic majority began spearheading an impeachment inquiry into whistleblower accusations that President Trump attempted to coerce Ukraine into digging up damaging information on a political rival by threatening to withhold crucial U.S. military aid to that country.", "Gregorian, Dareh.   \"Former Rep. Trey Gowdy Joins Trump Legal Team.\"\r\n    NBC News.   9 October 2019.", "Stimson, Brie.   \"Trey Gowdy Joining Trump's Legal Team.\"\r\n    Fox News.   9 October 2019.", "Herszenhorn, David M.   \"House Benghazi Report Finds No New Evidence of Wrongdoing by Hillary Clinton.\"\r\n    The New York Times.   28 June 2016.", "McCarthy, Tom.   \"QAnon: Latest Trump-Linked Conspiracy Theory Gains Steam at President's Rallies.\"\r\n    The Guardian.   3 August 2018.", "DeBonis, Mike and Rachael Bade.   \"GOP Players in Benghazi Probe Drop Strong Defense of Congressional Oversight.\"\r\n    The Washington Post.   10 October 2019.", "Dumain, Emma.   \"Trey Gowdy Won’t Join Trump’s Legal Team. 'He Doesn’t Need Another Lawyer.'\"\r\n   McClatchy Washington Bureau.   2 January 2020.", "UPDATE [Jan. 7, 2020]: Added report of Gowdy's January 2020 announcement that he would not be joining Trump's legal team after all. Status revised to \"False.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]