["About this rating", "On 20 May 2017, a USPOLN.com item suggested that Sam Clovis (a former professor of economics, talk radio show host, and Tea Party activist who is now President Trump's purported pick for a U.S. Department of Agriculture appointment) said scientists are \"dumb\" and that dinosaurs are a hoax:", "The research section of the USDA studies everything from nutrition to climate change, and according to the 2008 Farm Bill the “chief scientist” is supposed to be the leader “among distinguished scientists with specialized or significant experience in agricultural research, education and economics.” President Donald Trump’s pick, Sam Clovis, doesn’t seem to have any of those credentials. He has never taken science as part of his graduate course and questions the legitimacy of climate change. Although he has a doctorate in public administration and taught business and public policy at Morningside College for ten years, he barely published any academic work. Clovis had made a reputation for himself as a conservative talk radio show in Iowa and an avid Trump supporter.", "When asked to comment on his credentials in a recent interview with KYXL Radio, Clovis, who is currently working as the senior White House advisor within the USDA, argued that he was “proud” he didn’t have any scientific credentials or education, because “scientists are nothing more than a bunch of mislead individuals anyway ... When I get back home from work – believe me – I thank God every single day that he had the mercy not to make me a scientist as well ... That’s why I’m happy I’m not one of them. At the end of the day, scientists are nothing more than a bunch of dumb, regular people with limited vision who think dinosaurs actually existed and the earth is somehow getting warmer. They don’t even consider the fact that there’s more to us, to our species than just the physical and the tangible. It’s as funny as it is pitiful,” he said. When asked why he continues to work as president Trump’s pick for top scientist if that’s how he feels about it, he replied, “Well, just because you’re a member of the Trump administration doesn’t mean you don’t have to pay the bills. That used to work for members of the Obama administration, if I remember correctly. Not now,” Clovis concluded.", "A source linked at the bottom of the page was Politicops, well known as a purveyor of hoaxes and embellishments based on current events using a model that mixes real stories with fiction. Although Politicops and its sister sites Newslo, Religionlo, and Politicalo have their own disclaimers, USPOLN.com's is nearly identical:", "Welcome to USPOLN Portal. We are hybrid News/Satire platform to provide the latest and breaking news for for Political, Government, Cultural, and Religion news..", "DISCLAIMER: USPOLN may include information from sources that may or may not be reliable and facts that don’t necessarily exist. These Articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney.", "Although news outlets reported on 12 May 2017 that Sam Clovis was believed to be President Trump's top pick for the USDA slot, the portions of the USPOLN.com article quoting him on matters of science, paleontology, and climatology are completely fabricated.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]