["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Several speakers touched on Hillary Clinton's email scandal at the second night of the 2016 Republican National Convention in Cleveland.", "New Jersey Gov. Chris Christie was one. He used it to argue that \"Hillary Clinton cared more about protecting her own secrets than she cared about protecting America’s secrets. And then, she lied about it over and over and over again.\"", "\"She said there was no marked classified information on her server. The FBI director said, that's untrue,\" Christie said. \"She said that she did not email any classified information. The FBI director, says that's untrue. She said all-work related emails were sent back to the State Department. The FBI director said, that's not true.\"", "For this fact-check, we'll look at Christie's claim about what happened with Clinton’s work-related emails.", "Clinton, the presumptive Democratic nominee, decided to use a private, unsecured email server at her New York home for government business. When news of the system came to light — indirectly, as part of the investigation into the attack on the American consulate in Benghazi, Libya — Clinton's lawyers went through the 60,000 or so emails she had collected to cull out personal communication.", "She claimed the remaining government-related emails were turned over to the State Department.", "The Clinton campaign fact sheet on the controversy says she provided copies of 30,490 emails covering over 55,000 pages.", "\"In providing these emails to the department,\" the fact sheet says, \"Clinton included all she had that were even potentially work-related — including emails about using a fax machine or asking for iced tea during a meeting — erring on the side of over-inclusion, as confirmed by the department and National Archives’ determination that over 1,250 emails were 'personal' records (which they have indicated will be returned to her).\"", "That's in line with her statement on the April 3, 2016, edition of Meet the Press where she said, \"I think that anybody who's actually looked at this has concluded that I have now put out all of my emails.\" (At the time, before the FBI released the results of its investigation, we gave her a Half True because more than 31,000 had been deleted by her lawyers without any government review.)", "And in a Sept. 4, 2015, interview on MSNBC with Andrea Mitchell, Clinton claimed that her lawyers \"went through every single email.\"", "Then the FBI released the results of its probe.", "Director James Comey reported finding \"several thousand work-related emails that were not in the group of 30,000 that were returned by Secretary Clinton to State in 2014.\"", "Some were uncovered because they had been archived in government email accounts belonging to workers who had sent or received them. Some were discovered among the millions of fragments of emails stored in the unused space of the servers used by the Clinton system. Two emails were classified as \"confidential;\" one was classified as \"secret.\" None were top secret.", "But Comey also said it wasn't surprising that those work-related emails weren't turned over.", "\"We found no evidence that any of the additional work-related e-mails were intentionally deleted in an effort to conceal them,\" he said during his news conference. \"Our assessment is that, like many email users, Secretary Clinton periodically deleted emails or emails were purged from the system when devices were changed.\"", "The FBI director also said some of the work-related emails not turned over to the State Department may have been deleted because her lawyers had not, in fact, gone through every one.", "Instead, they \"relied on header information and used search terms to try to find all work-related emails,\" he said. \"It is highly likely their search terms missed some work-related emails, and that we later found them, for example, in the mailboxes of other officials or in the (unused) slack space of a server.\"", "If Clinton had been using a government account like she should have, the work-related correspondence would have been archived, the FBI director said. But her system didn't do that.", "When we asked the Clinton campaign about Christie's work-related email claim, spokesman Josh Schwerin noted Comey testified before Congress that three of the classified emails were not properly marked as classified, and there was no evidence that any work-related emails were intentionally deleted.", "Our ruling", "Christie told the convention that Clinton \"said all work-related emails were sent back to the State Department. The FBI director said, that's not true.\"", "The FBI did indeed discover that work-related emails had been deleted by Clinton's lawyers despite her insistence, still posted on her website, that she included all emails \"that were even potentially work-related.\"", "We rate Christie's statements as True.", "Hillary Clinton website, \"Updated: The Facts About Hillary Clinton's Emails,\" undated, accessed July 19, 2016", "YouTube, \"Hillary Clinton interview: One-On-One | Andrea Mitchell | MSNBC,\" Sept. 4, 2016", "PolitiFact, \"Hillary Clinton spins on 'Meet the Press,' says she put out all her emails,\" April 3, 2016, \"PolitiFact Sheet: Hillary Clinton's email controversy,\" July 19, 2016", "FBI, \"Statement by FBI Director James B. Comey on the Investigation of Secretary Hillary Clinton's Use of a Personal E-Mail System,\" July 5, 2016", "Congressional Quarterly, \"FBI Director Comey Holds News Conference Regarding Investigation of Former Secretary of State Hillary Clinton's Email Server,\" July 5, 2016, and \"House Oversight and Government Reform Committee Holds Hearing on FBI Recommendations on Former Secretary of State Hillary Clinton's Email Server, Panel 1,\" July 7, 2016", "Emails, Josh Schwerin, spokeswoman, Hillary Clinton campaign, July 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]