["Multiple Facebook pages, for example here on January 28, 2021, posted an image purportedly showing the headlines about about GameStop.", "The posts surfaced after a trading frenzy that saw shares in the video game store soar after amateur investors joined forces on social media to make massive share purchases in the struggling firm that wealthy hedge funds had bet against.", "The image shows the logo of US-based news channel CNN and a headline saying: “White Supremacist Internet Gamers buy Gamestop stocks to purposefully bankrupt Jewish Hedge Fund on International Holocaust Remembrance Day.”", "The byline lists Moshie R. Horowitz as the author.", "A keyword search did not turn up any results for the altered headline or the supposed author on CNN.", "This image can also be found shared here, here and here.", "The GameStop frenzy prompted Robinhood -- a free app which aims to \"democratize finance for all\" -- to restrict trading in GameStop, before reversing the decision following outrage from investors and lawmakers.", "Some social media users used anti-Semitic slurs to criticise Robinhood's move, blaming Jews for \"manipulating markets\", Newsweek reported.", "Contacted by AFP, Matt Dornic,  head of strategic communications for CNN Worldwide, said the channel never published the headline circulating on social media and does not employ a journalist by the name of Moshie R. Horowitz.", "“CNN did not publish that piece nor do we employ a writer by that name. It’s clear that the image’s creator is trying to pass off anti-Semitism as some sort of satire,” he said in an email. “It’s hateful and disgusting”.", "A similar claim about an alleged VICE News headline was also shared in multiple Facebook posts, including here, here and here.", "“WallStreetBets and Gamestop: Reddits Lingering White Supremacy Problem (sic),” reads the headline.", "The subheading reads: “The stock market has been reeling for the last week with institutional investors being targetted in a campaign that one hedge fund manager says brings him right back to the 1930’s (sic).”", "The headline and subheading contain several grammatical errors and spelling mistakes.", "The byline lists Seth Goldberg as the author of the piece.", "The name does not turn up any results on VICE news website. A keyword search of the headline also does not show any content.", "VICE Media articles on the GameStop stock rush fall under its tech desk, ‘Motherboard’. The digitally altered headline does not contain the Motherboard logo as it typically does with VICE’s reporting as seen here and here.", "A VICE spokesperson told AFP that the media outlet never published such an article and does not employ a journalist called Seth Goldberg.", "“This is a fake article. Seth Greenberg is not a contributor to VICE. Our editors on our Tech/News desks have never worked with him and he is not turning up any search results. It seems like a fake person,” the spokesperson said via email.", "The WallStreetBets forum, the subreddit page responsible for the sharp rise in GameStop stocks, was previously criticized for harbouring moderators who posted alt-right content.", "The founder of the now-famous forum, Jaime Rogozinski, told the Wall Street Journal he removed a chatroom on Discord messaging platform associated with WallStreetBets due to the extremist content shared on the forum.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]