["About this rating", "On 2 December 2015, 14 civilians and two suspected shooters died during a mass shooting in San Bernardino.  Shortly thereafter, conspiracy buffs took note of the chronology of a tweet sent by Newt Gingrich weeks earlier:", "Maybe scale of the Paris attack following Russian airline bombing and California terrorist attack will convince our leaders this is real war", "— Newt Gingrich (@newtgingrich) November 13, 2015", "On 13 November 2015, approximately 130 people were killed in Paris during a series of coordinated attacks. The incidents reignited fears of Islamic State operatives in the United States, which escalated following the shooting in San Bernardino. However, the national conversation was already underway following the Paris attacks, with much worry over whether similar events were likely to occur in the United States.", "Gingrich's tweet didn't garner all that much attention until some point after the San Bernardino shooting. Social media users questioned why Gingrich referenced a \"California terrorist attack\" several weeks prior to the 2 December 2015 shooting, maintaining the tweet was proof positive that agents for the government had advance knowledge of the attack.", "The human drive to seek patterns is well-documented [PDF], and those who already suspected the government was involved in such events were more likely to take the tweet-based rumors at face value. After 2 December 2015, \"California terrorist attack\" was certain to conjure up the thought of San Bernardino in the minds of most Americans due to its widespread media coverage and large scope.", "The size and optics of the incident in San Bernardino left an undeniable impression on Americans, many of whom interpreted the attack as a harbinger of threats to come. But before that, another incident in California was investigated, and widely reported, as possible terrorism prior to the San Bernardino shooting.", "One such instance of coverage was published by CNN on 16 October 2015. An article, titled \"Sniper attack on California power grid may have been 'an insider,' DHS says,\" reported new developments with respect to a 2013 incident:", "A top DHS official revealed on Wednesday that an infamous 2013 sniper attack on a California energy grid substation may have been committed by someone on the inside.", "The attack, which nearly took out power to parts of Silicon Valley, has been called \"the most significant incident of domestic terrorism involving the grid that has ever occurred\" by the nation's top electrical utility regulator.", "The yet-unsolved case has been shrouded in mystery. No suspects have been named, and as of last year, no motive identified.", "\"While we have not yet identified the shooter, there's some indication it was an insider,\" said Caitlin Durkovich, assistant secretary for infrastructure protection at the Department of Homeland Security.", "The assault lasted only 19 minutes, but it caused $15 million in damage.", "By contrast, the San Bernardino attack was current news in December 2015.  The California power grid attack involved updates to a story from 2013. But reports of new information appeared in October and November 2015, albeit on a much smaller scale than the wall-to-wall coverage of San Bernardino.", "What the claim boils down to is plausibility.   Gingrich carelessly revealing a massive government plot via too-early tweeting is far less likely than his referencing of an update from the Department of Homeland Security on a largely ignored California power grid attack.", "We attempted to contact a representative for Newt Gingrich to confirm that the attack he referenced was the one involving the California power grid. However, phone numbers associated with his offices and campaign were not operational.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]