["A WhatsApp text has gone viral along with seven images of disfigured leather products like wallets, bags shoes and belts. The viral text claims that the pictures are from Shoppers Stop. The text warns readers that leather products developed mould because the mall airconditioning was shut during the lockdown and advises against visiting malls for at least four months after the lockdown is lifted. “Imagine when malls open the fungus in the ducts will fly free in closed atmosphere of malls….. entering our respiratory system….. leading to major infection,” it says.", "Alt News has received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "On performing a reverse image search on one of the seven images, Alt News found a YouTube video and an article published by China Global Television Network (CTNG).", "The video by CTNG included all seven images in the viral text. As per the article published on May 12, the images are from Malaysia’s Metrojaya Center. The mall has been shut since March 18 due to lockdown restrictions to stop the spread of COVID-19. As per the report, leather goods at the mall were covered in mould due to humidity and lack of air conditioning.", "The incident was also covered by Daily Mail which further informed that cinema hall seats and carpeting were also covered in mould after two months of shutting down.", "Coronavirus: Mould found growing on leather products in Malaysia as businesses reopen https://t.co/Omb8UZRH68", "— The Straits Times (@STcom) May 12, 2020", "The images indeed show leather products spoilt because of mould formation during the lockdown. However, they are it not from Shoppers Stop in India but Malaysia’s Metrojaya Center.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]