["The one-minute 26-second video was published in this Facebook post on July 24, 2019. It has been shared more than 2,000 times.", "Below is a screenshot of the misleading post:", "The Hindi-language caption translates to English as: “When Hima Das won the gold”. The text superimposed on the video states: “When the family of Hima Das cried.”", "Hima Das is an Indian sprinter. She won a gold medal at the women's 400 metres race on July 20, 2019 held in Nove Mesto in the Czech Republic.", "The same footage was also shared with a similar claim here on YouTube, where it has been viewed more than 13,000 times, and here on Twitter. The audio in the background is a song from the Hindi movie Kesari.", "The video has circulated in news reports since August 2018 about the family of another Indian athlete, Swapna Barman, celebrating her winning a gold medal at the 2018 Asian Games in Indonesia.", "Here is a video published on the verified Youtube channel of India’s Hindustan Times newspaper on August 30, 2018.", "The video's title states: ‘Watch: Swapna Barman’s family in tears while watching her win gold for India’.", "Below is a comparison of a screenshot from the Hindustan Times YouTube video (L) and the video from the misleading Facebook post (R):", "A keyword search on Google found this video published on August 29, 2018, on YouTube. The title states: ‘Mother of Jalpaiguri's Swapna Barman breaks down in happiness after her daughter won gold in Women's.’", "Jalpaiguri is a district in east Indian state of Bengal.", "Thirty seconds into the YouTube video, television commentary can be heard saying: ‘Barman takes the gold.’", "Indian news agency Asian News International (ANI) in this tweet published on August 29, 2018 shared the pictures of Swapna Barman’s family.", "The caption reads: ‘Family members of Swapna Barman celebrate at their residence in Jalpaiguri after she won gold medal in Women's Heptathlon at #AsianGames. Her mother says,\"We're very happy. Me & Swapna's dad toiled hard to help her in her journey. Today all our dreams came true.\" #WestBengal’", "Below is a screenshot of Barman’s mother from the video in the misleading Facebook post (L) and the ANI Twitter photo (R).", "Here is an AFP report on Swapna Barman’s victory in the heptathlon at the 2018 Asian Games.", "Her victory was also reported on Indian news websites, for example here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]