["About this rating", "In July 2020, U.S. President Donald Trump announced that he would commute the sentence of Roger Stone, a political ally who was convicted of seven felony charges, including witness tampering, lying to congress, and obstruction, in relation to special counsel Robert Mueller's investigation.", "Shortly after the news broke, a photograph started to circulate online that supposedly showed Stone and members of the Proud Boys flashing a white power gesture at a bar:", "This is a genuine photograph of Stone and members of the Proud Boys. Some may argue that this group is merely flashing an \"OK\" symbol, but this argument doesn't really hold up, especially when you consider that the Southern Poverty Law Center has designated the Proud Boys as a hate group that espouses white supremacist ideals, and that white supremacists have adopted the \"OK\" hand gesture as a symbol of hate.", "This photograph was taken around the time of the Dorchester Conference, Oregon's oldest Republican political conference, in March 2018. The Willamette Week reported that Stone, who was scheduled to speak at the event, hired members of the Proud Boys to be his private security.", "The Willamette Week wrote:", "Roger Stone—the former political adviser to Richard Nixon and President Donald Trump—appeared without incident at the state's oldest Republican conference last weekend.", "But an organizer of the Dorchester Conference in Salem says Stone was so worried for his safety that he enlisted a right-wing group as private security.", "Patrick Sheehan, a Dorchester board member who booked Stone, says Stone reached out to the Proud Boys—a group notorious for its participation in Portland street brawls—after reading about violent political clashes in Oregon.", "\"He was worried about getting killed,\" Sheehan says. \"He gets death threats constantly.\"", "Photos of Stone drinking with a handful of Proud Boys circulated across social media over the weekend, outraging Democrats.", "The photograph of \"Stone drinking with a handful of Proud Boys\" mentioned in the Willamette Week article was originally posted by InfoWars host Alex Jones on Twitter on March 3, 2020. The image was captioned: \"InfoWars Roger Stone joined the @proudboysUSA in Salem Oregon tonight. I joined them in spirit!\"", "This is a genuine image of Stone with members of the Proud Boys in March 2018. Although the meaning behind the \"OK\" hand gesture is a bit murky — it was, and is still, widely used as a harmless symbol for approval or consent — this symbol has been adopted by white supremacists as a symbol of hate.", "Here's the Anti-Defamation League's explanation of the \"OK\" hand gesture as a symbol of hate:", "In 2017, the “okay” hand gesture acquired a new and different significance thanks to a hoax by members of the website 4chan to falsely promote the gesture as a hate symbol, claiming that the gesture represented the letters “wp,” for “white power.” The “okay” gesture hoax was merely the latest in a series of similar 4chan hoaxes using various innocuous symbols; in each case, the hoaxers hoped that the media and liberals would overreact by condemning a common image as white supremacist.", "In the case of the “okay” gesture, the hoax was so successful the symbol became a popular trolling tactic on the part of right-leaning individuals, who would often post photos to social media of themselves posing while making the “okay” gesture.", "Ironically, some white supremacists themselves soon also participated in such trolling tactics, lending an actual credence to those who labeled the trolling gesture as racist in nature. By 2019, at least some white supremacists seem to have abandoned the ironic or satiric intent behind the original trolling campaign and used the symbol as a sincere expression of white supremacy, such as when Australian white supremacist Brenton Tarrant flashed the symbol during a March 2019 courtroom appearance soon after his arrest for allegedly murdering 50 people in a shooting spree at mosques in Christchurch, New Zealand.", "And here's how Southern Poverty Law Center described the Proud Boys:", "Established in the midst of the 2016 presidential election by VICE Media co-founder Gavin McInnes, the Proud Boys are self-described “western chauvinists” who adamantly deny any connection to the racist “alt-right,” insisting they are simply a fraternal group spreading an “anti-political correctness” and “anti-white guilt” agenda.", "Their disavowals of bigotry are belied by their actions: rank-and-file Proud Boys and leaders regularly spout white nationalist memes and maintain affiliations with known extremists. They are known for anti-Muslim and misogynistic rhetoric. Proud Boys have appeared alongside other hate groups at extremist gatherings like the \"Unite the Right\" rally in Charlottesville. Indeed, former Proud Boys member Jason Kessler helped to organize the event, which brought together Klansmen, antisemites, Southern racists, and militias. Kessler was only “expelled” from the group after the violence and near-universal condemnation of the Charlottesville rally-goers.", "Other hardcore members of the so-called \"alt-right\" have argued that the “western chauvinist” label is just a “PR cuck term” McInnes crafted to gain mainstream acceptance. “Let’s not bullshit,” Brian Brathovd, aka Caeralus Rex, told his co-hosts on the antisemitic The Daily Shoah — one of the most popular alt-right podcasts. If the Proud Boys “were pressed on the issue, I guarantee you that like 90% of them would tell you something along the lines of ‘Hitler was right. Gas the Jews.’”", "SPLC.   \"Proud Boys.\"\r\n    Retrieved 13 July 2020.", "ADL.   \"Okay Hand Gesture: Racist Hand Signs.\"\r\n    Retrieved 13 July 2020.", "Prokupecs, Shimon; Murray, Sara; Collins, Kaitlan; Polantz, Katelyn.   \"Trump Commutes Roger Stone's Sentence.\"\r\n    CNN.   11 July 2020.", "Weill, Kelly.   \"How the Proud Boys Became Roger Stone’s Personal Army.\"\r\n    Daily Beast.   29 January 2019.", "herron, Elise.   \"Right-Wing Provocateur Roger Stone Asked Proud Boys For Protection at Dorchester Conference Last Weekend.\"\r\n    Willamette Week.   7 March 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]