["A video of Congress leader Rahul Gandhi having samosas on-flight is being shared on social media. Madhu Kishwar posted the video with the message, “Fun Watch–Wayanad MP’s aerial survey of flood affected areas in Kerala.” It is being snarkily suggested that Gandhi was having a merry time while surveying the situation of flood affecteds areas in Kerala. The tweet has now been deleted.", "A few more individuals on Facebook and Twitter shared the video with the identical narrative.", "Look at Wayanad MP on aerial survey of flood affected areas , ராகூல் வயநாட்டில் வெள்ளம் பாதித்த பகுதிகளை பார்வையிடும் காட்சி", "இதற்க்கு தானே ஓட்டு போட்டிங்க pic.twitter.com/fD5YkPAqf1", "— பாலு சோழன் BJP (@Balasub20820601) August 16, 2019", "A keyword search on Google led Alt News to the same video published by several prominent media outlets on YouTube in April 2019. “WATCH: Rahul Gandhi Enjoys Samosas While Campaigning In UP”, reads the title of the video posted by ABP News. You can watch the extended version of this video here.", "Rahul Gandhi had recently visited his constituency Wayanad which is one of the worst-affected areas hit by heavy rainfall across the state of Kerala.", "I left Wayanad with nothing but pride for the people I represent.", "The display of bravery and dignity in the face of immense tragedy is truly humbling.", "It is such an honour and pleasure to be your MP.", "Thank you Kerala. pic.twitter.com/PVwmUAFboZ", "— Rahul Gandhi (@RahulGandhi) August 13, 2019", "The video circulating on social media is unrelated to the ongoing floods. Alt News recently debunked another misinformation targeting Rahul Gandhi. It was claimed via a photoshopped tweet that the Congress MP paid last respects to Sushma Swaraj’s entire family after her demise.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]