["Imagine never having to make the monotonous drive on Interstate 70 again to get from St. Louis to Kansas City, or vice versa. Imagine taking less than 30 minutes out of your day to make the trip. If Hyperloop One builds a routein Missouri, that’d be a reality.", "Hyperloop is a transportation system that functions like a high-tech train, moving people in tubes from city to city at speeds similar to air travel.", "Patrick McKenna, director of the Missouri Department of Transportation, said Missouri is an appealing candidate for a Hyperloop route.", "\"Officials at Hyperloop One have referred to the route as one of the best they’ve ever seen,\" he told the Kansas City Business Journal on Oct. 19.", "But did Hyperloop One officials say the St. Louis-Kansas City route is one of the best they’ve seen?", "What is Hyperloop?", "Elon Musk, CEO of Tesla and SpaceX, published a white paper for Hyperloop in 2013, which was presented to former President Barack Obama later that year. According to its website, Hyperloop Technologies Inc. was established in Los Angeles in 2014.", "Earlier this year, the company successfully tested its propulsion system with the car in the tube, and the company projects three Hyperloop systems will be completed by 2021.", "Essentially, Hyperloop utilizes magnetic accelerators in a low-pressure tube system in order to propel rotors in individual capsules. The vehicles hover slightly off the track in the tube through magnetic levitation. This special environment allows a blazing top speed of 670 mph.", "Missouri efforts", "In May 2016, Hyperloop One opened its Global Challenge, urging cities and regions around the world to submit their pitches for a Hyperloop network. More than 2,600 proposals were sent to Hyperloop. Missouri submitted its application that fall, and was named as one of the 35 semifinalists in February 2017.", "We reached out to Hyperloop One officials, who didn’t respond, and to the Missouri Department of Transportation. Special assignment coordinator Robert Brendel directed us to links about the challenge.", "On Sept. 14, 2017, Hyperloop announced its winners via a press release. Even though it didn’t win, the Missouri route was designated as one of 11 finalists invited to continue developing the proposal.", "In response to being named a finalist, state officials established the Missouri Hyperloop Coalition in October to continue the conversation. The coalition includes MoDOT, the University of Missouri System, St. Louis Regional Chamber and the KC Tech Council.", "Dan Katz, Hyperloop’s director of global public policy, told the St. Louis Post-Dispatch that the creation of the coalition helped the Missouri route’s future chances.", "\"They were on the edge in that competition,\" Katz told the newspaper. Now, he said, \"they are as competitive\" as any on the initial list.", "The company had previously weighed in as part of Missouri’s aggressive pitch for attracting Amazon to either St. Louis or Kansas City for its second headquarters. Hyperloop One CEO Rob Lloyd is featured in a short video about the potential for the transportation system in the state, which is available on the state’s Amazon HQ pitch website.", "The video is sponsored by the state’s Department of Economic Development, but the praise comes from Lloyd himself.", "Our ruling", "McKenna said Hyperloop officials called the proposed route between Kansas City and St. Louis \"one of the best they’ve ever seen.\"", "The Hyperloop One CEO said the coalition proposed a great route. Its director of global public policy said the St. Louis-Kansas City route is \"as competitive\" as any on the initial list.", "But there’s no public record that any Hyperloop official ever called the route the best they’ve ever seen. Hyperloop selected 10 winners of its global challenge. Missouri was not on that list.", "We rate this claim Half True.", "Hyperloop White Paper", "Hyperloop FAQ", "MoDOT Financial snapshot", "Forbes leaks Hyperloop financial documents", "Video of Rob Lloyd praising Missouri as a candidate", "Musk’s analogy for Hyperloop", "Email interview with Robert Brendel, MoDOT Special Assignments Coordinator", "Estimate for colorado route, CDOT exec says state won’t pay", "Creation of Missouri Hyperloop Coalition, Dan Katz praise for route", "Hyperloop global challenge results", "Hyperloop global challenge press release", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]