["About this rating", "Donald Trump and his wife Melania, now the President and First Lady of the United States, have long been known for (among other things) their openly lavish lifestyle. The pop culture icons turned political figures have been the subjects of numerous photoshoots, often showcasing their wealth.", "One such shoot produced a photograph that showed a very pregnant Melania Trump, posing in a golden bikini and gold body paint on the entranceway to a jet with her husband, Donald Trump, sitting nearby on the tarmac in a Mercedes-Benz:", "This image, which is real, was taken by celebrity portrait photographer Annie Leibovitz, and was featured in an April 2006 issue of the magazine Vogue.", "Melania Trump posted an image of the spread as it appeared in the New York Post:", "The Donald's very pregnant wife is trumping the slew of expecting stars who've been photographed before her, by wearing nothing but a teeny bikini and sky-high heels in a sexy new shoot.", "Fabulous mom-to-be Melania Trump, 34, is wearing gold body paint for this Annie Leibovitz portrait, which will apear in the April issue of Vogue. Her normally centerstage husband sits of to the side in the $600,000 Mercedes SLR McLaren he gave her last year.", "\"I think it's very sexy for a woman to be pregnant,\" Melania tells Vogue. \"I think it's beautiful, carrying a baby inside.\"", "Donald is thrilled with the photo, which was taken near his Mar-a-Lago restort in Palm, Beach, FLa. Donald is pleased that a wind machine was used so that everyone could see he doesn't wear a hairpiece,\" Vogue reports.", "Melanis , who is due this month, says her child will be raised in a manner that is \"strict, but not too strict. And I think grounded, very grounded.\"", "Yeah, right. -  Leela de Krester.", "This photograph was also included in an exhibition of Annie Leibovitz's work that appeared at the Brooklyn Museum in 2006. The New York Times described the photograph in the following way:", "The show, of course, has numerous portraits that jump off the wall with characteristic Leibovitzian flair — a heady mix of intimacy and posturing, elaborated, like paintings of saints, by recognizable attributes. Here’s Demi Moore in her controversial Vanity Fair cover, naked, extremely pregnant and protected by an imposing diamond ring. There’s Donald Trump, seen as the proud possessor of a fancy car, a private jet and a beautiful young wife also heavy with child. Wearing little more than a golden bikini, Melania Trump stands on a stairway leading to the underbelly of the jet, which dominates the image like a giant male-female fertility symbol.", "Photographs from the First Lady's previous career as a model were circulated widely by Trump's political allies and foes during the 2016 presidential election, evoking both accolades and derision.", "Smith, Roberta.   \"Photographer to the Stars, With an Earthbound Side.\"\r\n    The New York Times.   20 October 2006.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]