["With more than 65,000 shares in just two days, this article from ScienceInfo is popular all over the world. According to the hoax, Mars will appear as big as the Moon on July 27, 2018, and this is \"a cosmic event that only happens every 35,000 years.\"", "A cosmic event that only happens every 35,000 years: July 27, 2018, the planet Mars will be as big as the Moon, around midnight - Mars will be the most brilliant star in the sky. https://t.co/guRF23p9X6", "A cosmic event that only happens every 35,000 years: July 27, 2018, the planet Mars will be as big as the Moon: https://t.co/XFy0Wo6BUL", "The technical terms and so-called facts presented in the ScienceInfo article should be enough to make readers skeptical. For instance, the article speaks of an \"apochromatic altazimutal velocity for which the cyclo-parabolic projection (adjusted Lambert benchmark) is affected by a singular analemmic anomaly modifying the apside line,\" a fundamentaly nonsense sentence. The article adds that Mars will be \"at a distance of only 32 million light-years\" from Earth, yet the normal distance separating the two planets is 12.5 light minutes.", "The reason for this false information is that Scienceinfo is a self-described parody site. Its about page states, \"All information presented herein is, unfortunately for some and fortunately for others, totally fabricated. In short, everything here is false.\"", "That disclaimer did not stop the rumor from spreading like wildfire as truth. The so-called information was quickly taken up by numerous sites, blogs and other publications on the internet.", "\"Oh, is it August already? That means it's time for the nonsense that is the 'Mars will be as big as the Moon' claims once again\" astronomer and Slate journalist Phil Plait wrote in 2013 on his blog Bad Astronomy.", "Just like the Martian orbit, this story has a cyclical nature. Almost every summer since 2003, the internet is invaded by the rumor that Mars will approach  Earth to the point of being as visible to the naked eye as the Moon. The details change each time; sometimes hoaxes say the phenomenon only happens once every 200 years, sometimes every 60,000 years. In 2018, it is rumored that this phenomenon only happens every 35,000 years.", "Given the popularity of this story, NASA published articles in 2005 and 2009 to warn readers not to believe the information, which was shared by email chains at the time. Despite the efforts of the space agency and fact-checking groups like Snopes, which has debunked this story several times since 2003, it has not weakened.", "Part of the reason why this story enjoys such popularity might be that it is based on a real astronomical phenomenon.", "Mars and  Earth revolve around the Sun at different rates, which means that the distance between them varies constantly. Mars, farther from the Sun, takes about two Earth years to complete a full revolution. Every 26 months, Mars and the Sun are aligned with Earth, allowing the Red Planet to be both close to our planet and visible in the night sky, according to NASA.", "According to the US space agency, Mars will reach the point of its current orbit closest to Earth between July 27-31, 2018. In 2003, the birth year of this hoax, Mars was closer to Earth than it had been for 60,000 years.", "Even if it will be possible to see Mars with the naked eye at the end of July, NASA insists that the Red Planet will not be the same size as the Moon. In locations with the clearest view, its size in the sky will only be slightly larger than usual.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]