["Chief financial officer Jeff Atwater speaks at a pre-legislative news conference on Jan. 28, 2015, in Tallahassee. (AP photo)", "Florida Chief Financial Officer Jeff Atwater capitalized on news about the floundering Greek economy to point out a new report that said the Florida economy was doing just fine.", "In an \"open letter to the people of Florida,\" Atwater said the Sunshine State had been ranked fifth in fiscal solvency by George Mason University’s Mercatus Center. He then contrasted Florida’s success with the beleaguered European nation.", "\"A country in economic peril, Greece’s priorities have historically been very different from Florida’s,\" Atwater wrote on July 13, 2015. \"For example, Greeks depend much more on their government for employment and services. Although we have twice the population of Greece, the State of Florida employs three times fewer government employees.\"", "PunditFact previously confirmed that Greece’s economic output is comparable to Miami, but could that 3-to-1 comparison of public-sector workers be accurate? Yes, if you’re looking at Florida’s direct employees, but experts we talked to said Atwater’s comparison is deeply flawed.", "Greek tragedy", "First of all, let’s stipulate that Greece’s population is about 11 million, while the Census Bureau says Florida is now closing in on 20 million, so he’s close on that point.", "Comparing employment is a bit trickier, since Greece’s public-sector employment has been in flux. To adhere to what its European lenders are demanding, Greece has spent several years trying to cut down its reliance on public-sector jobs.", "Atwater’s office told us they used 2013 data from Greece’s Ministry of Administrative Reform and E-Governance for Greek government workers (653,746) and the U.S. Bureau of Labor Statistics’ Current Employment Statistics program for Florida state employees (207,008).", "Several sources agreed 2015 estimates put the current number of Greek public-sector employees at around 600,000. Florida’s employee numbers have stayed relatively stable in that time frame, with about 208,000 this year, so it looks like the 3-to-1 ratio Atwater cited could stand.", "But our experts said the CFO is really comparing oranges to olives here.", "Rollins College business professor James Johnson pointed out that those 600,000 Greek jobs include all government workers -- those paid by the central government and those paid by regional and municipal governments.", "A better way to measure the state’s government employment would be to add Florida’s 133,000 or so federal workers to Atwater’s 207,000 total, Rollins said. And even more important are the more than 730,000 workers toiling away at the local level. Also, Washington sends money to Florida that directly and indirectly affects workers at the state and local levels.", "Add that all up, and there are almost 1.1 million government employees on all levels across Florida at any given time. That is quite a bit more than the 600,000 or so Greek government workers.", "Experts also note that Greek economic woes aren’t entirely about how many people are currently employed by the government.", "\"Greece’s problem was not so much the size of its public sector, but generous retirement benefits, including pensions,\" Johnson said. Greece doesn’t even top Europe in terms of highest percentage of the workforce employed by the public sector. In 2011, before Greece started cutting workers, it ranked behind Italy, Germany and France.", "In any event, fairly comparing a single U.S. state with a sovereign nation is largely impossible, considering the different sets of responsibilities each bears, our experts said.", "Atwater’s office reiterated that it was making a point that the Greek central government is wasteful and poorly run when compared to Florida, but experts told us that it’s difficult at best to draw such parallels.", "\"It’s sort of a totally different system. It is fair to say the state of Florida is more efficient than the country of Greece, but you could say that about any other state,\" Jupiter-based financial analyst Tom Essaye said. \"It would be much more fair to compare Florida to other states than Greece.\"", "Our ruling", "Atwater said, \"the State of Florida employs three times fewer government employees\" than Greece.", "Florida does directly employ about one-third as many state government workers as Greece does. But a more reasonable comparison should also include government workers at the federal and local levels -- which means Florida’s overall total of government workers would outnumber Greece’s public-sector employees.", "The statement is partially accurate but leaves out important details or takes things out of context. We rate Atwater’s statement Half True.", "Jeff Atwater, \"An open letter to the people of Florida,\" July 13, 2015", "Business Insider, \"Guess Which Country Has The Highest Percentage Of Workers Employed By The Government,\" Nov. 28, 2011", "New York Times, \"Greece to Eliminate 15,000 Government Jobs,\" Feb. 6, 2012", "Greek Reporter, \"The Number of Public Workers in Greece Declines, says Census,\" April 10, 2012", "Reuters, \"Greece to revive public servants dismissal plan - sources,\" Aug. 9, 2012", "New York Times, \"The Cost of Protecting Greece’s Public Sector,\" Oct. 10, 2012", "Christian Science Monitor, \"Greece starts firing civil servants for first time in a century,\" April 26, 2013", "European Commission, \"The Second Economic Adjustment Programme for Greece Fourth Review,\" April 2014", "International Monetary Fund, \"IMF Country Report No. 14/151,\" June 2014", "Greek Reporter, \"Greek Public Sector Employees Reduced by 267,095,\" July 21, 2014", "Orlando Sentinel, \"Syriza: Big, fat economic challenges: Front & Center,\" Feb. 3, 2015", "CNBC, \"Saving Greece is not the ECB’s job: Weidmann,\" March 12, 2015", "Wall Street Journal, \"Greece Rehires Laid Off Cleaners as Syriza Reverses Austerity,\" May 11, 2015", "PolitiFact, \"Jeb Bush says he cut 13,000 state workforce jobs as governor,\" June 9, 2015", "ABC News, \"Some of the Reasons Greece Got Into Its Economic Crisis,\" June 30, 2015", "CNBC, \"Expert predictions on what lies ahead for Greece,\" July 6, 2015", "PunditFact, \"Yep, Greece and Miami metro have about the same GDP,\" July 6, 2015", "Florida Department of Economic Opportunity, Current Employment Statistics, accessed July 16, 2015", "U.S. Census Bureau, Florida Quickfacts, accessed July 16, 2015", "Florida Department of Management Services, \"2013-14 State Personnel System Annual Workplace Report,\" accessed July 16, 2015", "Organization for Economic Cooperation and Development, Government at a Glance 2011: Greece, accessed July 16, 2015", "U.S. Bureau of Labor Statistics, Florida employment: Government, accessed July 16, 2015", "World Bank, World Development Indicators: Greece, accessed July 16, 2015", "George Mason University Mercatus Center, \"How Does Florida Compare to Other States?,\" accessed July 16, 2015", "Interview with Ashley Carr, Atwater spokeswoman, July 16-17, 2015", "Interview with Tom Essaye, financial analyst and Sevens Report creator, July 16, 2015", "Interview with Ilene Grabel, Co-director of the MA program in Global Finance, Trade & Economic Integration at the University of Denver, July 17, 2015", "Interview with James Johnson, Rollins College international business professor and Global Consulting Projects director, July 16-17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]