["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Omar Mateen, the shooter in the mass slaying at an Orlando nightclub, was on the FBI's terrorist watch list but later was removed.", "On Facebook and Twitter, U.S. Rep. Gwen Moore describes herself as a mother and grandmother who \"loves poetry, reading, knitting and crocheting.\"", "With poetry, she not only reads, she writes.", "The Milwaukee Democrat has penned odes that tweak job creators and Republican Wisconsin Gov. Scott Walker. (There are videos of her reciting both.)", "Most recently, Moore turned her rhyming to guns.", "On June 23, 2016, about a week after the Orlando mass shooting, she tweeted out her poem, \"No More Moments of Silence.\" One line reads:", "How ironic that if you're a terrorist you can't fly / But quite moronic that an assault weapon you can buy.", "Leaving aside the adjectives, let’s check the veracity of the verse.", "Two lists", "Moore’s claim alludes to two U.S. government lists whose origins stem from 9/11.", "1. Terrorist watchlist: The Terrorist Screening Database, commonly called the \"terrorist watchlist,\" contains people \"known or reasonably suspected to be or have been engaged in terrorism or terrorist activities.\"", "It helps agencies \"identify known or suspected terrorists trying to obtain visas, enter the country, board aircraft, or engage in other activity.\"", "As of mid-June 2016, there were about 1 million people on the terrorist watchlist, though fewer than 5,000 were Americans, according to a federal agencies memo to Congress.", "2. No Fly List: This is a subset of the terrorist watchlist. People on the no fly list are \"prohibited from boarding a commercial aircraft that will fly into, out of, over, or within United States airspace.\"", "A person can be added to that list if there is \"credible information that demonstrates the individual poses a threat of committing a violent act of terrorism with respect to civil aviation, the homeland, United States interests located abroad, or is operationally capable of doing so.\"", "There are about 81,000 people on the no fly list, including fewer than 1,000 Americans.", "A key difference between the two lists, of course, is there is no constitutional right to fly but there is one to own a gun.", "Moore’s claim", "The first part of Moore’s claim, that terrorists can’t fly, is pretty straightforward.", "You don’t have to be a known terrorist to be prohibited from flying. As we noted, people who the government believes pose a threat of committing terrorism in connection with air travel, and are on the no fly list, also are prohibited.", "The second part of her claim -- that terrorists can buy assault weapons -- goes a bit too far, in that not all of the people on the terrorist watchlist are terrorists. Many are only suspected to be involved in terrorist activities and, like the Orlando shooter was, are removed from the list.  Moreover, terrorists who have been convicted of a felony, or are under indictment, can’t legally buy a gun.", "But Moore’s point, contrasting the no fly list with the terrorist watchlist, is on target in that people on the watchlist can buy guns.", "Under federal law, there is no basis to automatically prohibit a person from possessing firearms simply because they appear on the terrorist watchlist. There must be some other disqualifying factor, such as a felony conviction, illegal immigration status, or being under indictment.", "In fact, from 2004 through 2015, according to the U.S. Government Accountability Office, individuals on the terrorist watchlist were involved in firearm or explosives background checks 2,477 times, of which 91 percent were allowed to proceed.", "Our rating", "Moore said: \"If you're a terrorist you can't fly,\" but \"an assault weapon you can buy.\"", "Terrorists, as well as people deemed potential terrorists who are on the federal government’s no-fly list are prohibited from flying. Terrorists who have a felony conviction can’t legally buy guns, but people on the government’s terrorist watchlist can, assuming they aren’t disqualified for some other reason.", "We rate Moore’s statement Mostly True.", "https://www.sharethefacts.co/share/7cd9be64-3f40-453e-9c76-a1b2648fccf7", "Twitter, Gwen Moore tweet, June 23, 2016", "Email, Gwen Moore communications director Eric Harris, June 27, 2016", "PolitiFact California, \"Gun claim by California congressman doesn’t fly,\" June 22, 2016", "PolitiFact Florida, \"Terrorist watch list no obstacle to buying guns, U.S. Rep. Patrick Murphy says,\" Dec. 29, 2015", "PolitiFact Wisconsin, \"Question after Orlando: Are assault rifles banned? No, only fully automatic are basically prohibited,\" June 13, 2016", "Washington Post, \"Every two days a suspected terrorist buys a gun in the U.S.,\"  June 17, 2016", "FactCheck.org, \"Suspected terrorists and guns,\" June 20, 2016", "National Counterterrorism Center and FBI, memo to Congress, June 17, 2016", "Washington Post Fact Checker, \"Does a known or suspected terrorist ‘face a long waiting period’ before buying a gun? (Two Pinocchios),\" June 21, 2016", "Email, Duke University public policy professor Philip Cook, June 29, 2016", "Interview, George Mason University constitutional law professor Joyce Lee Malcolm, June 28, 2016", "Voicemail, Fordham University law professor Nicholas Johnson, June 28, 2016", "Interview, UCLA law professor Eugene Volokh, June 29, 2016", "U.S. Government Accountability Office, memo to Congress, March 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]