["About this rating", "A House bill would impose stricter work conditions for food stamp recipients, potentially including veterans, which would make benefits harder to access and possibly deny some would-be recipients access to those benefits.", "The bill does not specifically target veterans and would not \"take away\" food stamps from anywhere close to 1.5 million of them.", "The exact number of food stamp recipients, and the exact number of veterans among that group, who would lose access to food assistance as a consequence of the provisions of the 2018 House farm bill if those provisions were to end up being passed into law is unknown.", "On 25 June 2018, the liberal \"Represent.Us\" Facebook page posted a widely-shared meme claiming that the U.S. Congress had voted in favor of legislation that would \"take away\" food stamps from 1.5 million military veterans:", "In comments associated with the post, Represent.Us cited as documentation for that claim a 21 June article by the San Francisco Chronicle as well as a tweet posted by the liberal veterans' group Vote Vets:", "Today the House GOP voted to rip food away from the 1.5 million veteran and 23,000 active duty households who rely on SNAP benefits. We won’t forgot this November.", "— VoteVets (@votevets) June 21, 2018", "The claim contained in the Represent.Us meme is a significant misrepresentation of the contents of a piece of legislation currently before the U.S. House of Representatives, a bill which would make it harder for all food stamp recipients (not just military veterans) to access food assistance, and likely cause some recipients to lose some (but not all) of their access to such benefits.", "Agriculture and Nutrition Act of 2018", "Federal government policy on food, agriculture, and farming is heavily determined by a major piece of legislation commonly known as the \"farm bill,\" which is revised, updated, and renewed every few years. The last time this took place was in 2014, and the U.S. Congress negotiated a new farm bill in 2018.", "On 21 June, a few days before the Represent.Us meme was posted, the House of Representatives passed a version of the Agriculture and Nutrition Act of 2018, which imposed stricter conditions on those seeking to access food assistance benefits (commonly known as \"food stamps\") as part of the Supplemental Nutrition Assistance Program (SNAP).", "A different version of the bill was subsequently passed by the U.S. Senate on 28 June, and as of mid-July the two versions of the bill were being reconciled in conference committee. This situation means that the parts of the House bill relating to food stamps might not end up becoming law, depending upon what is ultimately included in the compromise version of the bill. However, our analysis will focus on the House bill as passed on 21 June, since that is the specific subject of the meme in question.", "Under existing legislation, individuals seeking food assistance must typically fulfill certain \"work requirements\" in order to be eligible for such benefits. These requirements include registering for work, not quitting a job, accepting offered employment, and taking part in state-administered work or training programs.", "The bill passed by the House in June 2018 would enhance those conditions by specifying that would-be recipients must spend a minimum of 20 hours per week on work, employment and training, or a work program beginning in 2021. From 2026 onwards, the requirement would be raised from 20 to 25 hours per week.", "The bill would also impose these stricter requirements on a broader cohort of people. Currently, the work requirements relate to adults aged between 18 and 50, with exemptions for pregnant women, parents of children, people with disabilities, and certain others. Under the 2018 bill, the requirements would be imposed on adults aged between 18 and 60, and parental exemptions would be restricted to those with children under age six.", "Existing policy also allows for a three-month exemption from work requirements for individuals receiving food assistance for the first time. The 2018 bill reduces the duration of that exemption to one month.", "The Center on Budget and Policy Priorities (CBPP), a progressive think tank, has estimated that these and other changes to SNAP policy as contained in the House bill would cause more than two million people to either lose their food assistance or have those benefits reduced, out of an estimated total of 36.6 million recipients in the year 2021:", "The House would use these benefit cuts, in part, to pay for a few modest benefit enhancements. But the net effect of all these provisions on SNAP benefits would still be a significant cut overall, and a substantial number of people would lose their SNAP benefits altogether.", "In particular, the plan includes sweeping, aggressive new work requirements that would likely prove unworkable and do substantially more harm than good, fueling increases in hunger and poverty. These provisions would force states to develop large new bureaucracies, but research suggests that these requirements would do little to increase employment.", "Veterans", "It is important to note that the 2018 House bill, in the section relating to SNAP work requirements, does not mention military veterans, and the reforms in question do not specifically target veterans. However, CBPP has argued that some veterans will be particularly vulnerable to the proposed changes to the SNAP program.", "Using Census Bureau data, the CBPP has estimated that between 2014 and 2016, an annual average of 1.5 million self-identifying military veterans availed themselves of federal food assistance. This is the source of the figure presented in the Represent.Us meme.", "Because veterans can sometimes struggle to find suitable employment after leaving the military, and some of them might have experienced illnesses or disabilities that fall below the Department of Veterans Affairs 100 percent disability threshold, they could be disproportionately affected by stricter work requirements or the bureaucratic burden of establishing exemptions from those requirements, the CBPP has argued.", "The 2018 proposal does retain the existing \"good cause\" exemptions to work requirements (which allow for flexibility in cases of illness, injury, household emergencies, lack of access to transportation, and unreasonable working conditions), and the bill does provide additional funding for state-by-state education and training programs. Despite all this, it is reasonable to assume that some SNAP recipients, including military veterans, may lose their access to food assistance altogether or see their benefits reduced.", "However, the measures included in the 2018 farm bill would not cause all would-be SNAP recipients to lose their benefits. The CBPP's estimate of two million people facing lost or reduced benefits due to the proposed changes represents 5.5 percent of the 36.6 million people whom the group estimates will be receiving SNAP benefits in 2021, when the proposed changes would kick in.", "Since the 1.5 million figure is the CBPP's estimate for the total number of veterans who were receiving food stamps in recent years, and not an estimate of how many veterans might face reduced or lost food assistance benefits should the farm bill be adopted as written, the Represent.Us meme is therefore wrong to claim that the House of Representatives has \"voted to take away food stamps from 1.5 million veterans.\"", "Duggan, Tara.   \"House GOP Proposes Major Cuts to Food Stamps with Passage of 2018 Farm Bill.\"\r\n    The San Francisco Chronicle.   21 June 2018.", "House Committee on Agriculture.   \"Press Release -- House Passes 2018 Farm Bill: Critical Legislation to Aid Farmers and Ranchers, Offer Opportunities to SNAP Recipients.\"\r\n    21 June 2018.", "U.S. Congress.   \"Food and Nutrition Act of 2008 [As Amended Through P.L. 113-79.]\"\r\n    7 February 2014.", "Conaway, Rep. K. Michael.   \"H.R. 2 -- Agriculture and Nutrition Act of 2018.\"\r\n    U.S. House of Representatives.   21 June 2018.", "Bolen, Ed et al.   \"House Farm Bill Would Increase Food Insecurity and Hardship.\"\r\n    Center on Budget and Policy Priorities.   26 June 2018.", "Cai, Lexin.   \"SNAP Helps Almost 1.5 Million Low-Income Veterans, Including Thousands in Every State.\"\r\n    Center on Budget and Policy Priorities.   9 November 2017", "National Veterans Foundation.   \"Young Veterans Struggle to Keep Up in the Employment Marketplace.\"\r\n    15 January 2016.", "Center on Budget and Policy Priorities.   \"House Farm Bill's SNAP Cuts, Work Requirements Would Hurt Veterans.\"\r\n    Center on Budget and Policy Priorities   6 July 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]