["On March 19, the official Twitter handle of Madhya Pradesh Congress tweeted a video of a woman beating a man with slippers and a corresponding news report. The tweet has been retweeted more than 800 times so far. The message attached to the video described the man, who is beaten up by a woman for harassing her, as Ashwini Arora, a BJP leader.", "छेड़खानी करते बीजेपी नेता की पिटाई :", "उत्तराखंड के बीजेपी नेता अश्विनी अरोड़ा की पिटाई का ये वीडियो देखिये, चप्पलों से पिटते बीजेपी नेता अश्विनी अरोड़ा एक आईएएस अफ़सर की पत्नी को छेड़ रहे थे।", "अब चाल, चरित्र और चेहरा तीनों ही छिपाने लायक़ हो चुका है..? pic.twitter.com/uHtsaplIwT", "— MP Congress (@INCMP) March 19, 2019", "“उत्तराखंड से BJP का एक #चौकीदार विधायक लड़कियों से छेड़खानी करता हुआ रंगे हाथ पकड़ा गया। चप्पल से हुई उसकी पिटाई (A BJP MLA from Uttrakhand was caught red-handed harassing a woman. He was beaten up with chappals -translated)”.", "One Amit Mishra, who is an AAP supporter, tweeted the same video with the above message, which has been retweeted close to 600 times at the time of filing this article. It was retweeted by Ankit Lal, the social media in-charge of the Aam Aadmi Party and by a verified social media handle, @aartic02. The message also intends to take a jibe at the BJP’s “Main Bhi Chowkidar” campaign. While MP Congress’ account identified the man as a BJP leader, Amit Mishra claims that he is a BJP MLA.", "Many other individuals have quote-tweeted Mishra’s tweet with a similar narrative. A Facebook page, Save Maharastra From BJP, has also shared the video with an identical message.", "Alt News found that the video shared on social media is not only old but the information propagated along with the video is incorrect and incomplete. In Oct 2018, a video of a woman beating up a man with slippers went viral on social media. Later, it was reported that the video is of a BJP worker who was beaten up by the wife of an IPS officer for allegedly harassing her. ABP News also reported on this issue, a video of which was uploaded on their YouTube channel on October 7, 2018. Now, a video which has been created by merging the ABP News video with the viral clip is circulating on social media, but without adding adequate information, in order to mislead social media users.", "The man beaten up by the woman is not a BJP MLA but a BJP worker named Ashwini Arora from Rudrapur, Uttarakhand. The woman in the video beating Arora with slippers is the wife of a police officer and not the wife of an IAS officer as claimed. Speaking to Hindustan Times in October 2018, Devendra Shahi, president of Metropolise resident welfare society said, “A BJP worker of Sitarganj lives with his family in our society. He was sending obscene messages on her mobile. She rang us and told about her plight on Saturday. On learning this, we went to the BJP worker’s flat, but instead of realising his fault, he started misbehaving with us”.", "Earlier, the same video had gone viral in October, where the woman was seen accusing the BJP worker of harassing her and beating him for the same.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]