["About this rating", "A photograph purportedly showing Germany's Black Forest is frequently circulated on social media along with the claim that the wooded area \"caused\" 15,000 missing persons cases last year:", "There are a number problems with this meme.", "For one, a forest can't \"cause\" a person to go missing. This phrasing likely derives from the Black Forest's reputation as a haunted area (in large part due to its association with the Brothers Grimm fairy tales).", "The earliest posting of the meme we found was from August 2014, on CreepyPasta, a Facebook page that specializes in spooky (albeit fictional) short stories. The page describes itself as \"a series of fictional and non-fictional stories that are posted on the Internet and are designed to unnerve and shock the reader.\"", "Furthermore, the image displayed with the claim doesn't actually show the storied forest. The Black Forest, or Schwarzwald, is in southwestern Germany. But this photograph shows Hameln, Germany, which is in the center of the country.", "The Black Forest is outlined in green on the map (left) and the city of Hameln is marked in red (right).", "Jonathan Manshack took the photograph, which National Geographic chose as the Photo of the Day on 11 June 2011:", "This photo was taken during autumn in Hameln, Germany, which is the birthplace of the infamous Rattenfänger—or Pied Piper, as we Americans know it. This shot is actually on top of the last few hills that soon sink into the state of Niedersachsen (Lower Saxony). This area is essentially lowland plains—hence the name Lower Saxony!", "There's also no basis for the claim that 15,000 people went missing in 2013 -- or any other year -- in the Black Forest.Germany's Initiative on Missing Children did not mention the forest as an area of particular concern, nor the The European Child Rescue Alert and Police Network on Missing Children.", "15,000 is such an astronomically high number that the meme is clearly inaccurate.  To give you an idea, The Bundeskriminalamt, Germany's Federal Criminal Police Office, in its report on missing persons, said that a total of 6,400 people were missing in Germany in 2007 -- and that number included cases that were as many as 30 years old.", "If the meme were true, that would mean that almost three times as many people had gone missing in one small area of the country in 2013, an event that would warrant both major media coverage and a large-scale criminal investigation. We found evidence of neither.", "Olsen, Debbie.   \"Exploring Germany's mystical Black Forest.\"\r\n    Calgary Herald.   18 October 2013.", "BBC.   \"World's Most Haunted Forests.\"\r\n    22 January 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]