["As the trailer for the second season of Hindi crime series ‘Mirzapur’ released on Tuesday, a section of Twitter users have been trending #BoycottMirzapur2. The show’s lead actor Ali Fazal is one of the reasons for the ongoing discontent.", "Several people have shared a purported tweet of Fazal celebrating the Delhi riots. The tweet reads, “PROTESTS : SURU MAJBOORI MEIN KIYE THHEY, AB MAJA AA RAHA HAI!!” which translates to, “Protests: Started due to helplessness but now it’s exciting.” The tweet carries a photograph of Intelligence Bureau staffer Ankit Sharma’s body being pulled out of a drain. Sharma was killed during the communal violence and his body was recovered from a drain on February 26.", "Twitter user @srikanthbjp_ shared the purported tweet drawing close to 500 retweets.", "Boycott Hinduphobic #AliFazal‘s Mirzapur 2#BoycottMirzapur2", "Pls pass on it …. H!t them where it hurts pic.twitter.com/HjH0e6UJe3", "— Srikanth (@srikanthbjp_) October 6, 2020", "It has in fact been shared by numerous Twitter users.", "Before watching #mirzapurseason2 Do not forget this tweet of @alifazal9 If you watch his series, you are supporting his anti India stance. pic.twitter.com/WUxhVMSTVm", "— Arif Aajakia (@arifaajakia) October 7, 2020", "Pro-BJP website OpIndia published an article on Fazal which carried many other such tweets.", "Fazal had supported the violent anti-CAA protests that had eventually culminated into the horrific anti-Hindu riots in northeast Delhihttps://t.co/uhio3ew4Zp", "— OpIndia.com (@OpIndia_com) October 7, 2020", "Fazal had indeed made a tweet which he later took down, however:", "1) His tweet was related to CAA protests, not the Delhi riots.", "2) He did not share the photograph of Ankit Sharma.", "The tweet in question was posted on December 19, 2019, two months prior to the Delhi riots. An archived link to the tweet can be accessed here.", "Fazal had also given his reasons to delete the tweet. He felt that it might be used to mislead “vulnerable” individuals on social media.", "Nai actually, like many other things, the bigots mislead. They wont mislead me but the janta sometimes is vulnerable . Aur masala daalne mein toh maahir hain sab. Wont let ppl fall for that. Not on my timeline. Toh tum jheete? Correct? Ok", "— Ali Fazal M / میر علی فضل / अली (@alifazal9) December 20, 2019", "As evident, Fazal did not celebrate IB staffer Ankit Sharma’s death but his tweet was meant for the protests against CAA.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]