["About this rating", "On 23 May 2018, the Daily World Update web site published an article reporting that a \"black woman [who] won a Democrat [gubernatorial] primary\" in Georgia had illegally paid for \"tens of thousands\" of votes:", "Democrats are jumping for joy after a black woman won a Democrat primary for the right to run for Governor. Michelle Agabobo Willford surprised everyone with a victory over incumbent Darren Laderhorn, who says he’ll back her “for the good of Georgia.”", "Willford says that makes her a real candidate for a “Real Georgia.” Economists estimate her plan will thrust the state into a budget crisis and cause an influx of poor and unemployable people from neighboring states.", "Not of that will be a concern now, since it was discovered that she paid people by the tens of thousands to go out and vote with her promises of free welfare. The State Attorney General is looking into what kind of charges he can file and how it will affect the general election.", "None of this is true. In fact, it was Stacey Abrams (not \"Michelle Agabobo Willford\") who just won a Democratic primary in Georgia (without any accusations of voter fraud), putting her in a position to possibly become the first black woman governor in the United States:", "Georgia Democrats selected the first black woman to be a major party nominee for governor in the United States, choosing Stacey Abrams, a liberal former State House leader, who will test just how much the state’s traditionally conservative politics are shifting.", "By handily defeating Stacey Evans, also a former state legislator, Ms. Abrams also became Georgia’s first black nominee for governor, a prize that has eluded earlier generations of African-American candidates in the state. The general election is sure to draw intense national attention as Georgia voters determine whether a black woman can win in the Deep South, a region that has not had an African-American governor since Reconstruction.", "This report was a fabricated story that originated solely with Daily World Update, a site that is part of a fake news network which engages in low-rent political trolling under the guise of offering \"satire.\"", "The site's disclaimer notes that \"Everything on this website is fiction.\"", "Eagleton, Flagg.   \"Black Woman Who Won Georgia Primary Arrested For Election Fraud.\"\r\n    Daily World Update.   6 May 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]