["The purported news article was published here on June 15, 2020.", "The Hindi-language headline translates to English as: \"BJP activist Siddhu caught wearing a burqa and waving Pakistani flag\".", "\"BJP\" refers to India's ruling Bharatiya Janata Party.", "The report translates to English in part as: \"There is deep conspiracy going on these days. Every incident is being associated with Muslims to hold them guilty. There is a deliberate attempt to link any incident with Muslims even if they do not have to do anything with that. Several tactics are being used for this purpose. A similar incident has come to light from Karnataka, where a woman in a burqa was caught waving Pakistani flag. However, a man was found under that burqa upon investigation and that man is a BJP worker\".", "The purported article was published on Facebook here on June 16, 2020. The post has been shared more than 400 times.", "The post’s Hindi caption translates to English as: “A BJP activist Siddhu caught wearing a burqa and waving Pakistani flag.”", "The purported news link and the photo of the detained man were also shared alongside similar claims on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claims, however, are misleading.", "Anupam Agrawal, the superintendent of police in the city of Vijayapura, confirmed that the man featured in the article was arrested for wearing a burqa and harassing women, but said that claims made in the purported news article are “false” and “rumours”.", "“There is no truth behind the claim that he is a BJP worker and he tried to wave Pakistani flag,” he told AFP over the phone on June 29, 2020.", "Agrawal added the man was “granted a bail on the same day, but an investigation is still going on into the matter.”", "The arrest was also reported on in Indian media; for example here on June 16, 2020 by The Hindu, an English-language daily newspaper. The report features the same photo of the suspect as the misleading article shared online.", "“A video of a man wearing a burqa who is being thrashed by locals is getting viral on social media. The video claimed that the person is Siddu Paragond, native of Sindgi town of the district. Sources told The Hindu that the incident took place in Sindgi on June 11 outside a bank,” reads the report in parts.", "The report makes no mention of the suspect waving a Pakistni flag or his political affiliations.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]