["The claim was published here on Facebook on August 26, 2020. It has been shared more than 200 times.", "The lengthy post states, in part: “NOW IT'S OFFICIAL! THE PCR TEST IS FAKE!…The Swiss Federal Office of Public Health (FOPH) has published a leaflet on COVID-19 testing.", "“The following sentence can be found in this leaflet under PCR tests: ‘However, the detection of the nucleic acid does not give any conclusion about the presence of an infectious pathogen’... A positive test means that the nucleic acid has been detected, i.e. a fragment that can possibly be assigned to the virus. But that doesn't mean you're infected. Or sick… SOURCE: BAG / Swissmedic / Read on page 2 under the section ‘PCR / NAT’”.", "The posts were published alongside screenshots of a German-language document bearing the Swissmedic logo, dated May 20, 2020.", "Polymerase chain reaction test, also known as PCR test, is a diagnostic test used by many health authorities worldwide to detect coronavirus infections. They detect disease by looking for traces of the virus from samples collected from the suspected patient.", "A similar claim has also been shared here, here, here and here.", "The claim, however, is false.", "In response to the misleading posts, Lukas Jaggi, a spokesperson for Swissmedic, told AFP via email on September 7, 2020: “The quoted sentence, taken out of context, was/is misused, especially in social media… The associated and correspondingly important postscript was/is simply ignored.”", "AFP located the full Swissmedic report here on its website, dated August 31, 2020. It states: “PCR tests are used to demonstrate the presence of nucleic acid in connection with the new coronavirus and hence an infection with the virus.”", "“This very sensitive method allows the specific detection of the nucleic acid of a pathogen in patient samples, which proves an infection with the pathogen,\" the report adds.", "Joshua Miguel Danac, a research associate at the University of the Philippines’ National Institute of Molecular Biology and Biotechnology, also denied the claims, calling PCR tests “the gold standard for diagnosis”.", "In an email on September 4, 2020, he said: \"While PCR detects viral RNA, sometimes the detected viral RNA actually corresponds to non-infectious remnants of the virus… Since PCR is highly specific and sensitive, a PCR positive result still means that you are or were [previously] infected with the coronavirus ... PCR is by no means a ‘fake’ test. It remains the gold standard for diagnosis of infections.”", "Similarly, the US Centers for Disease Control and Prevention also states here on its website that PCR tests remain “gold standard” for “clinical detection” of coronavirus’ genetic material and promotes its use.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]