["About this rating", "On Aug. 8, 2019, the official Twitter account for the first lady of the United States, Melania Trump, tweeted a series of photos from the president’s visit to University Medical Center of El Paso in the wake of a mass shooting that killed at least 22 and wounded scores more. One of those photos, described by some hospital staff members as showing “an absence of empathy,” controversially shows President Donald Trump with a wide grin giving the thumbs-up sign next to the first lady, who is holding a baby.", "Josh Marshall, the editor of the left-leaning Talking Points Memo, inferred based on publicly available information that this child was the orphan of two parents who died shielding their baby from the gunman during a visit to Walmart:", "Later, a “senior White House official” confirmed to CNN that the photo showed the first lady holding “the son of Jordan Anchondo and Andre Anchondo, a young couple who were killed in last Saturday's shooting at a Walmart.”", "The man pictured to the left of the president is the baby's uncle, who told the El Paso Times that his brother was \"a big Trump supporter,\" and that the uncle wanted Trump \"to know our family stands with the president.” For that reason, the baby, who had been discharged earlier according to hospital officials, was returned for the president's visit and captured in the photo.", "Flynn, Meagan and Rebecca Tan.   “A Mother Died Shielding Her Infant in El Paso. the Father Died Shielding Them Both, Family Says.”\r\n    The Washington Post.   5 August 2019.", "Bennet, Kate.   “Photo Shows Melania Trump Holding Infant Orphaned by El Paso Killer.”\r\n    CNN.   9 August 2019.", "Montes, Aaron.   “El Paso Family Grieves for Parents who Died Protecting Newborn Son in Walmart Attack.”\r\n    El Paso Times.   6 August 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]