["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The danger posed by people coming across the United States-Mexican border is a common theme among people concerned about immigrants trying to enter the U.S. illegally. A Nov. 2, 2018, Facebook post from the account of Todd Sowers has a picture of a man with a hat and sunglasses that is captioned:", "\"Border Patrol agent, 36, killed by 'rock throwers' in ambush attack near US-Mexico border in Texas that also injured his partner.... So! Next time Trump says our Troops will protect themselves from rock throwers and they fuss & whine.... Show them this! Authorities were searching Texas' Big Bend area for suspects and witnesses Monday after US Customs and Border Protection agent Rogelio Martinez was allegedly beaten to death with a rock while on patrol.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In fact, Martinez's death occurred nearly a year ago, on Nov. 18, 2017, and a subsequent investigation found there was no evidence that he was murdered. Sowers is citing outdated information.", "At the time, people jumped to the conclusion that Martinez and his partner had been attacked.", "The U.S. Border Patrol reported that Martinez had died and his partner hospitalized with serious injuries \"in the line of duty.\" It said Martinez's unidentified partner \"reported that they were both injured and in need of assistance\" and that officials were \"searching the area for potential suspects or witnesses.\" The border patrol never specifically said the two were attacked.", "But others, including Texas Sen. Ted Cruz, did. And the next Monday morning Texas Gov. Greg Abbott released a tweet announcing a reward of up to $20,000 \"for information leading to arrest of those responsible for death of Border Patrol agent.\" Two weeks after the death, with the FBI still investigating, Fox news reported that \"officials with the National Border Patrol Council assert they were unequivocally the result of an attack by assailants using rocks, a common weapon.\"", "On Feb. 7, 2018, the FBI released a statement saying that although it was receptive to any new information about the case, \"To date none of the more than 650 interviews completed, locations searched, or evidence collected and analyzed have produced evidence that would support the existence of a scuffle, altercation, or attack on November 18, 2017.\"", "The partner, Stephen Garland, had no recollection of what happened.", "Martinez's partner had contacted a Border Patrol dispatcher by phone, the FBI reported. \"Although disoriented and unsure of his location, the second Border Patrol Agent advised that both he and Agent Martinez were hurt. The second Border Patrol Agent also made a statement to the effect of, 'We ran into a culvert,' 'I ran into a culvert,' or 'I think I ran into a culvert.' The dispatcher also wrote into a Border Patrol log, '[He] thinks they (both agents) ran into a culvert.'\"", "The results of the FBI investigation were widely publicized.", "Nonetheless, Martinez and his picture are still being used as evidence of the murderous intent of people who cross the border.", "We rate the claim False.", "Facebook post, Todd Sowers, Nov. 2, 2018, accessed Nov. 4, 2018", "\"Border Patrol Agent from Big Bend Sector Killed in Line of Duty,\" U.S. Customs and Border Protection, Nov. 19, 2017, accessed Nov. 4, 2018", "\"Sen. Cruz Issues Statement on Attack on Two Big Bend Sector Border Patrol Agents,\" Nov. 19, 2017, accessed Nov. 4, 2018", "Tweet, Gov. Greg Abbott, @GovAbbott, Nov. 20, 2017", "\"On-Duty 'Attack' Leaves One U.S. Border Agent Dead, Another Injured,\" The Huffington Post, Nov. 20, 2017, accessed Nov. 4, 2018", "\"Dramatic spike in violent attacks against US border agents provokes outrage,\" Fox News, Dec. 5, 2017, accessed Nov. 4, 2018", "\"FBI El Paso Findings of the Investigation Into the Death of Border Patrol Agent,\" Federal Bureau of Investigation, Feb. 7, 2018, accessed Nov. 4, 2018", "\"F.B.I. Finds No Evidence of Attack in Death of Border Agent,\" The New York Times, Feb. 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]