["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "As the painstaking process of counting millions of ballots amid the COVID-19 pandemic in the U.S. dragged on after Election Day 2020, U.S. President Donald Trump and his supporters ramped up a disinformation campaign to undermine faith in the democratic process as Trump's paths to victory began closing.", "Trump and his surrogates had spent the weeks leading up to the election making false assertions that mail-in ballots, which played a key role amid the COVID-19 pandemic, were vulnerable to widespread fraud. And as Trump's Democratic opponent, Joe Biden, pulled ahead in some electoral college and vote tallies, Trump and his supporters falsely claimed that the election was being stolen.", "As that drama played out, readers asked Snopes to look into social media posts and media stories reporting that multiple counties in the U.S. had more registered voters than voting-eligible residents. One such story was published by the Washington Times and headlined, \"Judicial Watch finds 1.8 million 'ghost voters' in 29 states, warns of 'dirty elections.'\"", "Judicial Watch, a right wing legal activist organization, claimed to have discovered in an October 2020 study that \"353 U.S. counties had 1.8 million more registered voters than eligible voting-age citizens.\"", "The study consisted of a spreadsheet comparing what it described as the most recent voter registration data for counties posted by state election officials, and the U.S. Census Bureau's most recently available data from the American Community Survey (ACS), from 2014 to 2018, specifically \"citizen voting age population,\" or CVAP. It also included a column for counties' active voters and inactive voters, and a column for the percentage of total registered voters over CVAP.", "Experts we consulted cautioned that the figures recorded by Judicial Watch, which they claimed showed that counties have \"ghost voters,\" or more registered voters than the population of voting-eligible residents, was misleading. That underlying assumption, they said, was the result of making a \"problematic\" comparison between two different types of datasets.", "\"The American Community Survey is sample-based. It is not a census,\" statistician Philip Stark, associated dean of mathematical and physical sciences at the University of California at Berkeley, told us in an email. \"Its population estimates between decennial censuses are approximate; the approximation will be worse at the level of counties than at the level of states. Using the ACS to determine the number of eligible voters is problematic.\"", "We will explain why.", "The intent of the ACS is to give public officials snapshots of communities in order to assess funding and services needed in those communities. Because the data is collected over a five-year period of time, comparing it to current voter registration amounts to an apples-to-oranges comparison, said D. Sunshine Hillygus, professor of political science at Duke University.", "Examples of why ACS data may not be an accurate reflection of the true voting-eligible population at a given point in time are that ACS data wouldn't reflect population changes that have happened since the survey was taken — changes like people moving in or out of a community, or people who were minors when the survey was taken but have since come of age to vote.", "The data also may not reflect that some people are of voting age but ineligible for other reasons, like having a criminal record, Hillygus said.", "\"The point is that the American Community Survey is useful as a snapshot of the population, but it’s not going to give you a precise population count on Election Day,\" Hillygus said.", "Hillygus pointed to a Pew survey that indicated that millions of Americans have relocated since the start of the COVID-19 pandemic.", "Stark also pointed out that, \"The study appears to use a 5-year average population (ending in 2018) but a current snapshot of voter registrations.\" The problem there is that if the population of a given area is growing, the result will be that both the five-year population average and the population in the area in 2018 will be lower numbers than the area's current population.", "In other words, if you check voter registration figures in fall 2020, a larger overall population in a given area could mean there was a larger number of registered voters there than when the ACS was taken.", "Another issue with the comparison is that voter registration figures kept by state election officials are not always reflective of the exact number of registered voters in a given area, because the figures don't automatically update when a person has moved, Stark told us. Additionally, federal law and various sets of state laws govern when and under what circumstances a jurisdiction may list voters as inactive.", "Generally speaking, Stark told us, if a voter hasn't voted in at least two previous general elections, jurisdictions may categorize them as \"inactive voters.\" Stark added:", "If you haven't voted, you haven't voted fraudulently. In some states, the consequence of being an inactive voter is just that you don't automatically get a vote-by-mail ballot. In others, you are removed from the voter rolls--again, the consequence is that you can't vote (without updating your status), not that there are tons of ineligible voters who can nonetheless cast ballots.", "The key column in the Judicial Watch study that gives the percentage difference of registered voters over CVAP (the citizen voting age population from the ACS) is misleading because it includes inactive voters, Stark said.", "The bottom line is that experts we consulted stated that the comparison between CVAP figures and voter registration figures do not prove the existence of \"ghost voters\" in counties. Rather, the two datasets make for problematic comparisons because of the differences in the time frame they were taken, the differing purposes of each set of data, and the method by which they are collected.", "We reached out to Judicial Watch with questions about the study raised by experts and will update if we hear back.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]