["Captioned “spot the difference”, an image of Nazi leader Adolf Hitler posing with a child, is placed contiguous with an image of Prime Minister Modi, also with a child, and posted on social media. It was shared by IPS officer Sanjiv Bhatt on both Twitter and Facebook, drawing a combined share count of over 1,400.", "Spot the difference. pic.twitter.com/yI1fyIOdos", "— Sanjiv Bhatt (IPS) (@sanjivbhatt) July 25, 2018", "Although the image is not widely circulated on social media, it has been shared by a few users.", "Ad filmmaker Ram Subramanian also Tweeted the image but without Modi’s photograph. However, he later called it “incredible photoshop” work after the same was pointed out to him.", "Incredible photoshop work… love it. Killer propaganda piece.", "— Ram Subramanian (@VORdotcom) July 25, 2018", "A reverse image search on Google reveals that Hitler’s image used in the post is photoshopped. In the original image, he is not holding the child’s ears but resting his hands on her shoulders. An article in The Sun has published the original image which was apparently clicked to portray the Nazi leader as “personal friend and guardian of the German youth”.", "Moreover, if one looks closely, PM Modi’s left hand has been photoshopped as Hitler’s right and his right hand as Hitler’s left.", "Falling for morphed images on social media is a common affair. Earlier, an image of Rahul Gandhi was photoshopped with a portrait of Aurangzeb in the background. Another image was morphed to portray PM Modi surrounded by world leaders. It is advisable that images and videos circulating on social media are examined before sharing.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]