["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In late November 2020, shortly after President-elect Joe Biden was projected as the winner of the 2020 presidential election, a picture started circulating on social media that supposedly showed the word \"loser\" projected onto the lawn of U.S. President Donald Trump's golf course in Scotland:", "This is a genuine photograph of the lawn at Trump Turnberry in Ayrshire, Scotland.", "This visual display was created by the British activist group \"Led By Donkeys.\" The group posted a video of the visual protest to Twitter on Nov. 25 in response to a tweet from Trump falsely claiming that the election was rigged:", "This is at least the second time that Led By Donkeys has criticized Trump by projecting a display on the lawn of Trump Turnberry. In September, the group projected the number of people who have died from COVID-19 in the United States under Trump's watch.", "The Scotsman wrote:", "A political campaign group has staged a protest outside Donald Trump’s flagship overseas resort, projecting images of the spiralling US Covid-19 death stats onto the US president’s property.", "The protest, carried out and filmed by the Led By Donkeys group, saw a video projection of the rapidly rising death rate imposed on the grounds outside the South Ayrshire hotel.", "The multimedia protest also projected the constantly increasing number of times that Mr Trump has visited one of his golf resorts during the pandemic.", "Here's a video of that display:", "https://www.youtube.com/watch?v=q9_6-b_-4ys&feature=emb_logo", "As of this writing in December 2020, the death toll in the United States from COVID-19 has climbed to more than 270,000.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]