["The video was published by Right To Life UK here on Facebook on October 14, where it has been viewed more than 120,000 times.", "Similar claims were also posted in this article uploaded by the UK-based pro-life organisation Right To Life. The article has been interacted with more than 400,000 times on Facebook according to CrowdTangle data.", "The claims have also been shared in similar US-based Facebook posts here and here; and by a conservative news show in the United States.", "Most of the claims, however, are misleading.", "The Abortion Legislation Act (2020), which came into effect March 2020, decriminalised abortion in New Zealand.", "It amended the Contraception Sterilisation and Abortion Act (CSA) and sets out most of the regulatory circumstances in which abortions can be authorised and carried out.", "Before the legislation was introduced, access to abortions was regulated by the New Zealand Crimes Act (1961).", "Under that law, abortions after 20-weeks gestation were only permitted if it was “necessary to save the life of the woman or girl or to prevent serious permanent injury to her physical or mental health”.", "At the ten-second mark of misleading video, it claims: “The New Regime will allow: abortion on demand, up to birth, for any reason”.", "The claim is false.", "Abortions are permitted after 20-weeks, but only in specific circumstances, taking into account factors including the woman's physical and mental health. Two qualified health practitioners have to agree the procedure is necessary.", "University of Otago bioethicist and legal scholar Dr Jeanne Snelling told AFP \"to say that ‘abortion is available on demand, for any reason, up to birth’ is based on an assumption that a clinician would be prepared to perform an abortion without any consideration of the clinical circumstances, including the woman’s physical and mental health, the gestational stage of the pregnancy, the opinion(s) of his/her peers and ethical and professional standards\".", "At the video’s 14-second mark, it claims: “The new regime will allow: disability-selective abortion up to birth”.", "This is misleading.", "Before the Abortion Legislation Act 2020 came into effect the Crimes Act 1961 only explicitly allowed for abortions on disability grounds before 20 weeks.", "“The way that [Right to Life UK] are framing it is that the restriction has been removed -- the reality is that it was never really there in the first place” - Dr Helen Paterson, University of Otago", "However, University of Otago Gynaecologist and Senior Lecturer, Dr Helen Paterson, told AFP by phone women were able to access abortions after 20-weeks if the baby was going to be severely disabled before the new Abortion Legislation.", "“There wasn’t previously a gestational limit around maternal mental health and many abortions were done for congenital abnormalities (disabilities) post 20 weeks under the circumstances that they would cause serious problems for the mental health of the mother.", "“The way that [Right to Life UK] are framing it is that the restriction has been removed -- the reality is that it was never really there in the first place” she added.", "The New Zealand Law Commission found in their 2018 report on abortion that “virtually all abortions performed after 20 weeks relate to wanted pregnancies and occur because a serious fetal abnormality is detected or there is a serious risk to the woman’s life or physical health”.", "\"Fetal abnormality is not in itself a ground for abortion after 20 weeks, so it is likely that the legal ground relied on in those cases would be to prevent serious permanent injury to the woman’s mental health,\" the report added.", "At the video’s 22-second mark, it claims: “NO legal requirement: that babies born alive after an abortion are given medical support”.", "This is false.", "“Once alive and living outside the mother's womb, the neonate is a legal person and has the same rights as any other person, and there is a requirement to provide health care in the same way as for any other neonate.\" - New Zealand Ministry of Health", "The New Zealand Ministry of Health told AFP in an August 8 email:  “Once alive and living outside the mother's womb, the neonate is a legal person and has the same rights as any other person, and there is a requirement to provide health care in the same way as for any other neonate.”", "Holly Hedley, health law expert at Buddle and Findlay lawyers, also said the claim at this point in the video was incorrect. “Every health practitioner in New Zealand is obligated to follow New Zealand's general law, and that includes a general duty to care as is clinically appropriate for any baby born alive, pursuant to the Code of Health and disability consumers' rights and also to other criminal and common law principles,” she said.", "At the video’s 22-second mark, it claims: “NO legal requirement: to give pain relief for babies aborted after 20 weeks”.", "The claim omits important context.", "University of Otago senior lecturer in Women and Children’s health, Dr Janet Downs, told AFP in a November 3 email \"there is no scientific evidence that the fetus is capable of feeling pain before around 24 weeks\".", "When a fetus is aborted after 22 weeks, Royal Australian and New Zealand College of Obstetricians and Gynaecologist guidelines require measures to be taken to make sure it is dead before being delivered, negating the need for pain killers, abortion provider Dr Simon Snook told AFP in an email.", "This is also outlined in the Interim Standards for Abortion Services, which dictates New Zealand’s standards for abortion providers.", "“Should a woman not consent to feticide, the New Zealand Maternal Fetal Medicine Network, considers the abortion should not go ahead, because induction of labour where there is the possibility of neonatal survival is not an abortion,” the standards state.", "Methods of abortion", "At the video’s 17-second mark, it claims: “The new regime will allow: controversial abortion methods”.", "The Right To Life group’s accompanying article links to another website which purports to describe ‘partial-birth’ abortion. A screenshot can be seen below:", "The claim is misleading.", "According to Dr Janet Downs, the outlined “partial birth” procedure does not happen in New Zealand. “The so-called 'partial birth' process described in the 2nd & 3rd bullet points... is not performed in NZ (or, to my knowledge, elsewhere),” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]