["About this rating", "For many years, residents of Verviers in southeast Belgium heard what they believed to be an urban legend: that the heart of the city's beloved 19-century mayor, Pierre David, was entombed in a fountain bearing his name.", "Every once in awhile, a myth turns out to be true. This is one of those instances.", "A box containing David's heart and an inscription that reads, \"The heart of Pierre David was solemnly placed in the monument on 25 June 1883\" was found during renovation of the David Fountain, according to Euronews.", "David was serving as mayor of Verviers when Belgium became an independent nation, but died in office in 1839 from an accidental fall. According to Reuters, \"Authorities built a fountain in his honour and, with his family’s permission, placed his heart under a stone in the monument in 1883.\"", "According to the Verviers city government's Facebook page, the discovery was made by workers restoring the David Fountain in late August 2020.", "As of early September 2020, the box containing the heart was displayed at the Verviers Museum of Fine Arts and Ceramics pending completion of the fountain's renovation, at which time it was slated to be returned to its original resting place. We reached out to the museum asking about the display, but received no response at the time of publication.", "Nathalie Weerts, the museum’s deputy curator, told Reuters the situation was \"unique,\" stating, \"I do not know of any other example of a mayor whose heart has been preserved in a monument ... in the middle of his town.\"", "Biesemans, Bart and Clement Rossignol. \"Belgian City Finds Its Former Mayor's Heart in a Fountain.\"\r\n  Reuters. 10 September 2020.", "Euronews and AFP. \"Verviers' First Mayor Captured the Town's Heart. So His Was Entombed in a Fountain.\"\r\n  2 September 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]