["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Republican Sen. Ted Cruz said, \"U.S. policy has changed, now we make deals with terrorists.\"", "On Saturday, May 31, 2014, President Barack Obama announced from the Rose Garden that Sgt. Bowe Bergdahl — America’s only prisoner of war — was freed by his Taliban captors after five years in custody. But Bergdahl’s release came at a cost: In return, the United States agreed to turn over five Taliban officials being held at the Guantanamo Bay, Cuba,  prison to the country of Qatar.", "By Sunday, debate over the decision spilled into the political talk shows. White House national security adviser Susan Rice, speaking on ABC’s This Week, said Obama was justified because the U.S. was at war with Bergdahl’s captors even if it wasn’t in the traditional sense.", "But Sen. Ted Cruz, R-Texas, took exception to that characterization.", "\"Ambassador Rice basically said to you, ‘Yes, U.S. policy has changed. Now we make deals with terrorists,’ \" Cruz said.", "Later, Cruz added: \"The reason why the U.S. has had the policy for decades of not negotiating with terrorists is because once you start doing it, every other terrorist has an incentive to capture more soldiers.\"", "The merits of the swap will continue to undergo scrutiny, but we wanted to look at Cruz’s assertion that Obama deviated from long-standing policy. Presidents throughout history have reiterated that the \"United States does not negotiate with terrorists\" (we found several instances of Obama's State Department saying as much), but do they always hold true to that mantra?", "Back to the Founding Fathers", "First, whether the war in Afghanistan is a war in the traditional sense or something much different has clouded legal and military debate since it began. Similarly, whether the Taliban, who have controlled parts of Afghanistan, is a traditional enemy or a terrorist group akin to al-Qaida, remains a contentious debate. (Defense Secretary Chuck Hagel claimed on NBC’s Meet the Press Sunday that the United States wasn’t negotiating with terrorists when it secured Bergdahl’s release.)", "The United States has a long history of negotiating prisoner trades in times of war. But does it have a history of negotiating with terrorists, as some might classify the Taliban?", "According to experts we spoke with, it does. (For his part, Cruz didn’t respond to a request for comment by our deadline. We'll add their response to this item if we hear from them.)", "\"There’s little that’s actually new here,\" said Mitchell Reiss, who worked in the State Department under President George W. Bush and served as national security adviser to Republican presidential candidate Mitt Romney. \"It may be new to certain individuals. Whether it’s new or not is not as important as whether it’s sound policy and promotes national security. That’s the ground where there’s a more legitimate debate.\"", "In his book, Negotiating with Evil, Reiss wrote that America actually has a detailed history of negotiating with terrorists and rogue regimes that support terrorist activity. How long? Even the Founding Fathers struck agreements with terrorists of the time: pirates.", "George Washington, John Adams and Thomas Jefferson \"accommodated what today would be viewed as terrorists,\" Reiss wrote. \"They each authorized payment to the Barbary pirates, and the U.S. Senate even ratified a treaty that enshrined the annual provision of naval supplies as ‘protection.’ \"", "A century later, President Teddy Roosevelt granted demands from the descendants of those pirates to secure the release of captured American resident Ion Perdicaris.", "Recent history", "To his credit, Cruz said the policy of not engaging terrorists was decades old, not centuries. But there are more recent examples where, as Reiss wrote, \"American presidents have negotiated with terrorists and rogue regimes to secure the release of hostages, to arrange temporary cease fires and to explore whether a more permanent truce might be possible.\"", "Here’s a few, according to Reiss’ book:", "After the North Koreans captured the U.S.S. Pueblo in 1968, President Lyndon Johnson apologized for spying as part of negotiations to secure the release of 83 American prisoners.", "In 1970, President Richard Nixon pressured Israel, Switzerland, West Germany and Britain to release Palestinian prisoners after two airlines were hijacked by the Popular Front for the Liberation of Palestine.", "During the Iran hostage crisis of 1979 to 1981, President Jimmy Carter agreed to unfreeze $8 billion in frozen Iranian assets after more than a year of negotiations with the Iranian revolutionaries.", "In perhaps the most famous swap, after seven Americans were captured in Beirut, Lebanon, President Ronald Reagan agreed to send missiles to Iran in what became known as the Iran-Contra scandal.", "President Bill Clinton’s administration sat down with Hamas in attempts to negotiate peace with Israel. His administration also worked directly with the Taliban nearly two decades ago on several occasions to see if the group would hand over Osama bin Laden and other al-Qaida leaders.", "Reiss also noted that President George W. Bush engaged in negotiations with Iran and North Korea even after decreeing them part of the \"Axis of Evil.\"", "James Jeffrey, a former ambassador to Iraq under Obama and deputy national security adviser for George W. Bush, agreed that \"there have been many cases of negotiations with terrorists or rogue regimes for the return of Americans.\"", "But he added: \"releasing terrorists in exchange for captives, however, is rare.\"", "One recent example came in 2010, when the United States released Shia cleric Qais al-Khazali to the militia group Asaib al-Haq in exchange for Peter Moore, a private British contractor, and the bodies of Moore’s security officers. Asaib al-Haq is a militia group allegedly funded by Iran and headed by al-Khazali and staged and executed several attacks in Iraq that resulted in the deaths of U.S. soldiers.", "Our ruling", "Cruz said Obama changed \"decades\" of policy of not negotiating with terrorists when he brokered the deal that brought Bergdahl home. Even though presidents and officials often say \"we do not negotiate with terrorists,\" it has not proven to be a hard-and-fast rule. Obama’s actions so far do not signal a change in policy, but rather the latest in a long line of exceptions presidents have made throughout recent history.", "We rate Cruz’s statement Mostly False.", "Transcript of ABC’s This Week, June 1, 2014", "Secretary of Defense Chuck Hagel interview on Meet the Press, June 1, 2014", "U.S. Department of State, Daily Press Briefing, April 9, 2009", "U.S. Department of State, Daily Press Briefing, January 18, 2013", "Phone interview with Mitchell Reiss, president of Washington College, June 1, 2014", "Email interview with James Jeffrey, visiting fellow at the Washington Institute for Near East Policy, June 1, 2014", "Email interview with Richard Betts, Director of the Saltzman Institute of War and Peace Studies, and Director of the International Security Policy program in the School of International and Public Affairs at Columbia University, June 1, 2014", "Foreign Policy Blog: The Cable, \"Top Romney advisor supports negotiating with terrorists,\" Oct. 8, 2012", "Mitchell Reiss, Negotiating with Evil, published September 7, 2010", "The Guardian, \"Cleric freed in move expected to prompt handover of kidnapped Briton's body,\" Jan. 3, 2010", "Reuters via the National Post, \"Iraq Shi’ite militia says U.S. has ‘failed,’ pledges to lay down arms in wake of Sunni bombings,\" January 5, 2012", "The Daily Beast, \"Here are the Taliban Terrorists Obama Released to Free POW Bowe Bergdahl,\" May 31, 2014", "ABC, \"Obama Takes Issue With Bush Foreign Policy Speech,\" May 15, 2008", "History channel, This Day in History: U.S.S. Pueblo Captured, accessed June 1, 2014", "PBS, \"Hijacked!\" accessed June 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]