["By Saranac Hale Spencer", "Posted on October 12, 2018", "Q: Did Nancy Pelosi describe how the Democrats use a tactic called the “wrap-up smear” to attack political opponents?", "A: No. Pelosi was describing a tactic that she anticipated Republicans would use against her in 2018. Her remarks were taken out of context in a viral video.", "A clip of House Minority Leader Nancy Pelosi explaining a political tactic called a “wrap-up smear” has been widely circulated recently. The problem is, it has been taken out of context.", "The nearly 40-second clip was taken from the end of a press briefing Pelosi gave in June 2017, although it was taken from a section that lasts about eight minutes. Pelosi had responded to a question about what strategies she planned to use to counter negative ads aimed at her during the 2018 election cycle. In her answer to a follow-up question, she explained one of the tactics she expected to encounter from Republicans — the “wrap-up smear.”", "The California Democrat said Republicans will attack her in TV ads as a way to distract voters from the issues.", "Pelosi, June 22, 2017: Republicans are afraid of that contrast in a race because they are going to go there to be involved in trickle‑down economics, shutting down hospitals, and the rest of it.  So they don’t want them to see that contrast.  So they focus on something else.", "And it’s a diversionary tactic. It’s a self-fulfilling prophecy. You demonize and then you — we call it the wrap-up smear. If you want to talk politics. We call it the wrap-up smear. You smear somebody with falsehoods and all the rest and then you merchandise it. And then you write it [Pelosi gestures at reporters] and they’ll say, “see it’s reported in the press that this, this, this, and this,” so they have that validation that the press reported the smear. And then it’s called the wrap-up smear — now I’m going to merchandise the press’s report on the smear that we made.", "It’s that last part that was taken out of context. The clip leaves out what Pelosi said about how Republicans would rather “focus on something else” other than the issues.", "On Oct. 6, a link to the short clip was posted on 8chan, an internet message board popular with conspiracy theorists. It was posted by someone using the name “Q,” a reference to people who subscribe to conspiracy theories based on the idea that an anonymous government official uses the pseudonym “Q” to disclose insider information about “deep state” plots to foil the Trump administration. Underneath the link, the post said, “‘Wrap-Up Smear’ deployed v. Justice K? The More You Know… .”", "Then partisan YouTube channels began posting the clip, and suggested that it was related to the recent battle over the confirmation of Supreme Court Justice Brett Kavanaugh.", "By Oct. 8, the clip had made its way to Lou Dobbs’ show on Fox Business. Dobbs played the clip, introducing it this way: “A resurfaced video of Nancy Pelosi from more than a year ago has inadvertently exposed, in the minds of many, the radical Dems’ plan and strategy to try to destroy Justice Kavanaugh.”", "The next day, Turning Point USA, the young conservative group, had turned the clip into a meme that says across the top: “PELOSI EXPLAINS THE LEFT’S ANTI-KAVANAUGH STRATEGY.” It has been shared more than 52,000 times on Facebook.", "Other Facebook users have also spread the clip with misleading information attached. One user’s post has been shared more than 12,000 times with this description: “Pelosi is so demented… She just incriminated her Democrat party tactics, explaining how they falsely accuse their political opponents with slanderous allegations & globalist media reports it as fact to establish credibility. Show this to every Liberal Democrat who still thinks Justice Brett Kavanaugh is guilty.”", "But Pelosi was talking about tactics that she claimed Republicans, not Democrats, use against their opponents.", "You can see her remarks in context here:", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Pelosi, Nancy. House Minority Leader Weekly Briefing. C-SPAN. 22 Jun 2017.", "Q. “Wrap-Up Smear” deployed v. Justice K?” 8chan. 6 Oct 2018.", "Bank, Justin, et al. “What Is QAnon: Explaining the Internet Conspiracy Theory That Showed Up at a Trump Rally.” The New York Times. 1 Aug 2018.", "Farley, Robert. “Graham Goes Too Far in Kavanaugh’s Defense.” FactCheck.org. 25 Sep 2018.", "Dobbs, Lou. “Lou Dobbs Tonight – Monday, October 8.” Fox Business. 8 Oct 2018. (Starts at 39:30)", "Turning Point USA. “WOW… Nancy Pelosi ACTUALLY Outlines The “Wrap-Up Smear” The Left Used To Try & Destroy Supreme Court Justice Brett Kavanaugh…” Facebook. 9 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]