["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Connie Mack, running in the Republican primary for U.S. Senate, held an event at a Miami gas station to urge the public to sign his petition calling for the Keystone XL Pipeline.\n\n\"I have always said that I would be for drilling,\" Mack said on April 5, 2012, according to the Miami Herald’s Naked Politics blog. \"But I think that’s an issue the state should have a say in – in determining how far it’s going to be off the coast of Florida. We ought to allow the state to have a say in that decision.\"\n\nThe report pointed out several past quotes from Mack bashing proposals for drilling close to Florida.\n\nWe decided to put the issue to our Truth-O-Meter: Was Mack mischaracterizing his own past statements when he said he \"always\" was for drilling?", "When he wasn't for drilling", "As we investigated, we found that when then-state Rep. Mack ran for Congress in 2004, he pledged to maintain the ban on drilling off Florida’s coast. And if there was a high point to him sticking to that pledge, it was 2005.\n\nThat year, Mack issued multiple statements criticizing a proposal to allow drilling closer to Florida, saying that it would hurt Florida’s \"pristine\" or \"fragile\" coastline and describing it as \"risky\" and \"reckless.\"\n\nIn a statement on Sept. 28, 2005, Mack called himself a \"longtime opponent of drilling off Florida’s coast.\"", "Yes, Congress needed to take action to lower gas prices, he said. \"But allowing drilling off Florida’s pristine coastline won’t reduce America’s pain at the pump. Instead of taking steps that will expose Florida’s fragile environment and our economy to severe and irreparable harm, we would be better served by expanding America’s refining capabilities, investing in new energy technologies, furthering commercial and consumer adoption of more energy efficient products, and increasing conservation.\"\n\nWe found similar statements from Mack in 2005 on Sept. 29, Oct. 3, Oct. 24, Oct. 26, Nov. 3 and Nov. 10.", "Cracks in the opposition", "Mack continued his opposition in 2006, saying in May, \"I applaud my colleagues for saying (no to) reckless plans that could have allowed drilling as close as three miles off Florida’s shores.\"\n\nBut 2006 was the year that the Florida delegation started to split on drilling. Before then, the delegation had nearly unanimous bipartisan opposition to drilling, said Mark Ferrulo, executive director of Progress Florida, who has tracked drilling legislation since the 1990s. (The exception: U.S. Rep. John Mica, R-Winter Park. \"His brother is a lobbyist for the oil industry, and (he) doesn’t have a coastline that was threatened,\" Ferrulo said.)\n\nIn June 2006, a vote was held on the the Deep Oceans Energy Resources Act, to create a smaller, 50-mile buffer on Florida’s coast. Fourteen of Florida’s 25-member House delegation voted in favor of the smaller zone, but Mack voted against it. He said in a press release that he voted against it because an amendment wasn’t included in the bill that would have given Florida control over drilling decisions.\n\nIn December, the House overwhelmingly voted for a bill that was considered a compromise: It opened up 8.3 million acres in the Gulf of Mexico to drilling while protecting Florida’s 125-mile buffer.\n\nMack explained his support: \"I’m pleased the House has adopted important legislation that will codify new and stronger protections against offshore drilling for Florida’s Gulf Coast. Without enacting these protections, Florida faced a precarious future on the question of drilling off our fragile shore.\n\n\"While I would have preferred a solution that empowered states like Florida to determine their own destiny on this important issue, today’s legislation provides a sound solution that will protect our precious environment and our economy.\"\n\nA switch in position\n\nFlash forward to the summer of 2008. Consumers were angry about $4-a-gallon gas, and the phrase \"drill, baby, drill\" was a Republican mantra. Presidential candidate John McCain called for lifting the federal moratorium along the Outer Continental Shelf and giving states incentives to lift the ban. Some Republicans, including then-Gov. Charlie Crist, who was a contender to be McCain’s vice president, and U.S. Sen. Mel Martinez, R-Fla., ditched their previous opposition. And so did Mack.\n\nMack told Fox News on June 16 that the United States needed to expand domestic production, including drilling off the coast of Florida. \n\nHe explained his change of mind in a June 17 press release: \"For years I have said states should have the right to decide whether or not they want to allow drilling off their shores. But circumstances have changed, I have changed, and I believe the people of Florida have changed. We’re facing a serious energy emergency, and we need to take real steps to bolster our energy independence and security. The people of Florida deserve the right to decide whether to drill off our coast.\"", "The political winds had shifted. \"Prior to now, this was not an issue that elected officials really wanted to engage in,\" said Justin Sayfie, a former spokesman for former Gov. Jeb Bush, at the time. \"I just think it speaks volumes about the pain at the pump that motorists are feeling.\"", "Then came the Deepwater Horizon explosion and spill in 2010. Mack took a cautious approach, saying before a decision is made on banning offshore drilling, the country must understand what went wrong. But generally, he still supported offshore drilling, saying in a speech at the Conservative Political Action Conference that domestic drilling needed to continue \"across the United States and in our waters.\"\n\nMack campaign spokesman David James sent us a statement acknowledging that Mack’s views have \"evolved\" on drilling.\n\n\"Connie has been a steadfast proponent of a strong national security and has always supported increasing our domestic energy supply by drilling in ANWR (the Arctic National Wildlife Refuge), and he has been a champion of building the Keystone XL Pipeline,\" James said. \"At the same time there's no dispute that Connie has always wanted to make certain that we protect Florida's shores. That hasn't changed. But four years ago, in the summer of 2008, Connie announced that his position with respect to drilling off Florida's coast evolved as our national energy security needs changed too. That's been well documented. And those needs have only grown all the more important.\"\n\nWe are focusing our evaluation of Mack on drilling near Florida -- not Alaska -- since he is a congressman running for Senate in Florida. But we will briefly note his position on ANWR.", "For the years that drilling in ANWR appears on the scorecards of the League of Conservation Voters, it shows that Mack consistently voted as the League calls it \"anti-environment\" -- including in 2005 and 2006 and 2011. Mack was absent for that vote in 2008, but in an article that year he denounced a plan to impose restrictions on drilling in ANWR.\n\nIn 2012, Florida’s congressional delegation remains split on more drilling off the coast of Florida.\n\n\"We have never gotten back to a unified front of opposition against expanding drilling,\" Ferrulo said.\n\nOur ruling\n\nMack said, \"I have always said that I would be for drilling. But I think that’s an issue the state should have a say in – in determining how far it’s going to be off the coast of Florida. We ought to allow the state to have a say in that decision.\"\n\nBut Mack didn’t always say he was in favor of drilling. In 2005, he repeatedly said he was against allowing drilling closer to Florida’s shores. He has since changed his stance, as did many other Republicans in 2008 amid high gas prices and a presidential campaign. \"Always\" means at all times -- not sometimes, or the past few years, or in Alaska.", "At one time, Mack very much opposed drilling off Florida's coast. His comment that he's \"always\" been for drilling misrepresents his actual record on a very high-profile issue in the state of Florida.  We rate his statement Pants on Fire!", "U.S. Rep. Connie Mack press release, \"Mack blasts offshore drilling plan,\" Sept. 28, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack: Peterson amendment devastating for Florida,\" Sept. 29, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack: Victory for Florida on offshore drilling,\" Oct. 3, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack rebukes new offshore drilling plan introduced while Hurricane Wilma was battering Florida’s Gulf Coast,\" Oct. 24, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack: Disappointed by House Resources Committee Approval of plan to allow oil drilling off Florida’s coast,\" Oct. 26, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack: Offshore drilling plan ‘guarantee’ of 125 mile buffer a myth,\" Nov. 3, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack: pleased offshore drilling ban tabled,\" Nov. 10, 2005\n\nU.S. Rep. Connie Mack press release, \"Mack applauds house decision to uphold OCS drilling moratorium,\" May 18, 2006\n\nU.S. Rep. Connie Mack press release, \"Mack statement on passage of Deep Oceans Energy Resources Act,\" June 29, 2006\n\nU.S. Rep. Connie Mack press release, \"Mack applauds passage of 125 mile offshore drilling protection buffer for Florida’s Gulf Coast,\" Dec. 28, 2006\n\nU.S. Library of Congress, Deep Oceans Energy Resources Act, Vote June 29, 2006\n\nSt. Petersburg Times, \"Florida's 2 senators say they are on 'same page' when it comes to serving state,’’ Accessed in Nexis, Nov. 18, 2004\n\nOrlando Sentinel, \"Gov. Bush backs deal that allows more Gulf drilling,\" Oct. 25, 2005\n\nOrlando Sentinel, \"Drilling backers applaud vote,\" Oct. 27, 2005\n\nMiami Herald, \"House votes for drilling near coast,\" Accessed in Nexis,\nJune 30, 2006\n\nOrlando Sentinel, \"Is Crist’s move just kissing up to McCain?\" June 19, 2008\n\nPalm Beach Post, \"Crist says he could accept drilling for oil in Gulf,\" June 18, 2008\n\nSun-Sentinel Broward Politics blog, \"Rising price of gas may make Crist’s position on offshore drilling more acceptable to voters,\" June 18, 2008\n\nFox News, \"Will Saudi Production Increase Change Gas Prices?\" Accessed in Nexis, June 16, 2008\n\nTampa Bay Times, \"Florida Republicans back McCain’s drilling plan,\" June 18, 2008\n\nMiami Herald, \"Drilling a wedge in McCain support,\"Accessed in Nexis, June 19, 2008\n\nTampa Bay Times, \"Crist’s risky switch: vp-itis or vox populi?\" Accessed in Nexis, June 20, 2008\n\nThe News-Press (Fort Myers), \"GOP critical of House’s drilling bill,\"Sept. 17, 2008\n\nPolitiFact, \"Introducing the Flip-O-Meter,\" Aug. 5, 2008\n\nPolitiFact, \"McCain’s cheerleading for drilling is new,\" Aug. 4, 2008\n\nPolitiFact, \"While others waffled, Rick Scott stuck to his oil drilling script,\" Dec. 3, 2010\n\nPolitiFact, \"Once wobbly, Obama not inconsistent in latest oil drilling proposal,\" May 31, 2010\n\nCNN, \"Rep. Connie Mack blasts Venezuela’s ‘thugocrat,’\" Feb. 12, 2011\n\nMiami Herald’s Naked Politics blog, \"Bill Nelson’s camp calls out Connie Mack for drilling flip-flop,\" April 6, 2012\n\nLeague of Conservation Voters Scorecards in 2005 and 2006 and 2008 and 2011\n\nInterview, David James, spokesman for U.S. Rep. Connie Mack’s campaign, April 10, 2012\n\nInterview, Mark Ferrulo, executive director of Progress Florida, April 13, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]