["About this rating", "Example: [Collected via e-mail, December 2011]", "The soldiers who wake up in Walter Reed Medical Center are in Maryland — not communist China. But under the Navy's new rules, they may not know the difference! Navy officials have announced that \"no religious items (including Bibles, reading material, and/or artifacts) are allowed to be given away or used during a visit.\" The new orders are buried in a four-page document about patient care, which an Army officer forwarded to us in disbelief. Effective immediately, families, friends, and even pastors will have to check their beliefs at the door to visit one of the largest military hospitals in the United States.", "Summary: A guideline memo issued by the Walter Reed National Military Medical Center in September 2011 stated that \"religious items\" (including Bibles) could not be used or given away during visits with patients at that facility. The rule was not enforced, however, and was rescinded four months later, hence the condition described in the above-quoted example no longer exists and is therefore outdated.", "Origins: On 14 September 2011, Col. C.W. Callahan, Chief of Staff of the Walter Reed National Military Medical Center, issued a memorandum headed \"WOUNDED, ILL AND INJURED PARTNERS IN CARE GUIDELINES\" with the expressed purpose of providing revised guidelines for the hospital's patient visitation policies. Most of the memo dealt with routine matters such as setting visiting hours and maximum group sizes, but one item near the end of the memo caused a good deal of public outcry when it was made public:", "No religious items (i.e. Bibles, reading material, and/or artifacts) are allowed to be given away or used during a visit.", "The intent of that stipulation was claimed to be the protection of patients from unwanted proselytizing, but the memo was worded so broadly that it read as an absolute ban on visitors' using Bibles or other religious materials during visits to Walter Reed Medical Center, even those brought by family members to receptive patients.", "After the issue became public, Walter Reed officials quickly issued statements proclaiming the policy as worded in the memo was incorrect, had not been enforced, and had since been rescinded. As the Navy Times reported of the controversy in December 2011:", "A section of the guidelines designed to protect patients from proselytizers was rescinded after Rep. Steve King of Iowa discussed it on the House floor, asserting it violated the First Amendment protecting free exercise of religion.The intent was to respect patients’ religious practices and preserve their privacy, explained hospital spokeswoman Sandy Dean. She said patients often are visited by volunteers from benevolent organizations as well as strangers, ranging from celebrities, politicians and well-meaning VIPs, and the guidelines were developed to respect patients’ own beliefs.", "\"If the family, if friends, wanted to bring things in, it was fine,\" Dean said. \"The way the policy was written was incorrect. We are rewriting the policy,\" she said.", "Dean said the guidelines are necessary because the hospital needs to protect its patients, who declare their religious preferences when they arrive.", "\"We want to make sure that visitors are respecting our patients’ religious practices and culture,\" she said.", "Hospital leaders are revising the policy carefully but she could not say when it would be complete.", "\"We are having a lot of eyes on it to ensure it's articulated correctly,\" she said.", "Another memorandum dated 24 January 2012 canceled the earlier controversial instructions, and an information paper from May 2012 explained the situation the previous policy had attempted to address:", "The policy in question was established after receiving complaints from Warriors and their families at both Walter Reed Army Medical Center and National Naval Medical Center who were approached by unsolicited faith-based groups visiting the inpatient wards. Patients and families reported that these groups were proselytizing and making disparaging remarks about Warrior’s service, sometimes using threatening and condemning language. According to the patients, some visits were persistent and repeated.The WRNMMC policy was not intended to nor did it ever have the effect of limiting religious expression of patients. The policy as written was incorrect and should have been more thoroughly reviewed before its release. It has been rescinded. Family members have been and will always be allowed to bring religious materials and texts. Subsequently, the new “Patient Visitation Policy” WRNATMILMEDCEN INSTRUCTION 5720.4D was reissued on 24 January 2012 with all incorrect verbiage and implications removed.", "WRNMMC prides itself on embodying the principles of the “Patient and Family Care” philosophy, to include the spiritual and holistic health of our Wounded, Ill, Injured Warriors, and their families. The WRNMMC care paradigm finds the holistic and family elements of care to be important to the overall rehabilitation path of our patients. The Integrated Healthcare Delivery System, of which WRNMMC is an integral part, is bolstered by the combined holistic and spiritual capabilities of the integrated healthcare teams of the United States Army, Navy, Air Force, and Public Health medical establishments who remain dedicated to enhancing the holistic, mental, physical, and spiritual health needs of our Wounded, Ill, and Injured Warriors, their families and our beneficiaries.", "Gulino, Lou.   \"Military Backs Off from Bible Ban at Walter Reed.\"\r\nSyracuse.com.   6 December 2011.", "Kime, Patricia.   \"Walter Reed Rewriting Policy on Religious Items.\"\r\nNavy Times.   7 December 2011.", "Starnes, Todd.   \"U.S. Military to Rescind Policy Banning Bibles at Hospital.\"\r\nFOXNews.com.   2 December 2011.", "WMGT-TV [Macon, GA].   \"Military Hospital Rescinds Ban on Bibles.\"\r\n    9 December 2011.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]