["The letter Hawley refers to explicitly states it is a letter of concern over failures Mizzou made in complying with State Department guidelines.", "The letter didn’t refer to security risks posed by the Confucius Institute.", "U.S. Sen. Josh Hawley, R-Mo., applauded the University of Missouri following its announcement that the university’s Confucius Institute will shut down in August.", "\"Pleased Mizzou is shutting down the#China Communist Party funded ‘Confucius Institute.’ As the State Department warned Mizzou in July 2019, and as I have repeatedly stated, this program presented security risks for students & university as a whole,\" Hawley tweeted Jan. 15.", "Hawley has criticized the Confucius Institute and raised questions about the program in the past, including when he sent a letter to MU Chancellor Alexander Cartwright on July 24 urging him to \"reconsider the costs and risks that come with allowing a Confucius Institute to remain on (Mizzou’s) campus, and with entering any other agreements with the Chinese government.\"", "That wasn’t the first time a politician urged a university to shut down its Confucius Institute program citing threats to security; Texas A&M closed its program after two U.S. representatives wrote a letter recommending the action to four Texas universities.", "We decided to look into whether the State Department really warned Mizzou in July about security risks arising from a Confucius Institute program. We found a letter, but struggled to find a warning.", "The controversy", "Mizzou’s Confucius Institute is one of about 500 established worldwide by Hanban, a subsidiary of the Chinese Ministry of Education. Hanban’s website describes Confucius Institutes as nonprofit, public institutions that \"aim to promote Chinese language and culture in foreign countries.\"", "Hawley criticized Hanban in his letter to Cartwright, saying that it is governed by leaders of 12 Chinese ministries, including those that handle media and propaganda. He also said universities that partner with Hanban sign contracts that prohibit \"tarnishing the reputation\" of Hanban, and they send teachers and textbooks designed to promote a positive image of China.", "In the United States and across the globe, universities have been shutting down their programs amid concerns and investigations. BBC News reported in September 2019 that a \"flurry\" of universities worldwide had closed their programs in the preceding weeks.", "Mizzou announced on Jan. 14 that its contract with the Confucius Institute will be terminated, effective in August, according to a news release from the university. The main reason: a change in State Department guidelines that now requires a certified Mandarin teacher to accompany classrooms with Confucius Institute staff members.", "The Confucius Institute instructors were classified as interns on exchange visas, not teachers. The university said it would cost too much to make the changes in categories.", "The release says the State Department notified Mizzou in a July letter. Hawley’s press secretary confirmed with us this is the same letter he was referring to in his tweet.", "So, did the State Department warn Mizzou that the Confucius Institute presented security risks?", "MU spokesperson Christian Basi provided us the July 15 letter from the Department of State’s Bureau of Educational and Cultural Affairs. It was signed by Henry C. Scott, director of the Office of Private Sector Exchange Program Administration. There’s no direct warning given by the State Department here. The letter was meant to notify Mizzou of violations in its Confucius Institute program that were found by the department and address how to fix them.", "The letter states the exchange program administration attempts to help sponsors of a Confucius Institute program correct errors when the office notices them. It addressed specific areas of concern.", "The first area of concern was Confucius Institute student interns teaching in K-12 classrooms without a supervisor who speaks Mandarin. The language barrier \"creates a vulnerability, as efficacy of the co-teacher’s supervision is severely limited,\" the letter states.", "If that is a warning about security, it’s pretty opaque.", "The other areas of concern listed were failures to comply with required form signatures and worker’s compensation policies, improperly listing Confucius Institute student interns’ primary site of activity and misusing a \"Research Scholar\" role defined by the department.", "There is no specific mention of potential risks to students or Mizzou in the letter.", "Our ruling", "Hawley said the State Department warned Mizzou that the Confucius Institute \"presented security risks for students & university as a whole.\"", "In a July letter to the university, the State Department listed violations of its guidelines and offered instructions on how to fix those violations. The letter never warns the university about risks created by the Confucius Institute; there’s little language that points to any warning. The closest it comes is in pointing out the risks of not adhering to the department guidelines on having a Mandaring speaker in the classroom, which \"creates a vulnerability.\"", "We rate this claim Mostly False.", "BBC News, \"Confucius Institutes: The growth of China's controversial cultural branch,\" Sept. 7, 2019", "Columbia Missourian, \"Hawley calls for MU to cut ties with the Confucius Institute,\" July 24, 2019", "Hanban, About Confucius Institutes, accessed Feb. 18, 2020", "Inside Higher Ed, \"Closing a Confucius Institute, at Congressman’s Request,\" April 9, 2018", "Inside Higher Ed, \"Closing Confucius Institutes,\" Jan. 9, 2019", "Mizzou News, \"MU to terminate Confucius Institute partnership due to changes in federal guidance,\" Jan. 14, 2020", "MU Confucius Institute, About, accessed Feb. 18, 2020", "MU International Center, David Currey, accessed Feb. 18, 2020", "MU International Center, Mary Stegmaier, accessed Feb. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]