["The Coronavirus Aid, Relief and Economic Security, or CARES, Act became law March 27. The stimulus package provided temporary economic relief, including the expansion of unemployment eligibility and a nationwide weekly unemployment bonus, to support the worsening economy.", "A page on Facebook critiqued the expansion of unemployment benefits. A post said: “Unemployment now pays $24/hour even if your wages were lower. Why don’t ‘essential’ people forced to still work get $24 too?”", "The post generated 46,000 shares and more than 1,000 comments.", "Criticism of the CARES Act extends beyond social media. Some economists find fault  with the relief package, too.", "Karl W. Smith, a former assistant professor of economics at the University of North Carolina and vice president for federal policy at the Tax Foundation, in an opinion column for Bloomberg said the new unemployment benefits are too generous, put more pressure on the remaining essential workers and may cause resentment from lesser-paid essential workers.", "Josh Bivens, the Economic Policy Institute's director of research, and Heidi Shierholz, a former U.S. Department of Labor chief economist, in a blog post for the EPI argued that the act contains “some good provisions” but provides relief for industries that are too nonspecific and time-bound.", "FINAL FINAL CARES ACT", "The CARES Act includes a $600-a-week bonus until July 31 for those registered as unemployed. The $600 is issued in addition to the standard unemployment benefit, which varies by state and by individuals’ record of previous earnings.", "The Facebook claim that the unemployed will now receive $24 an hour is likely about this sizable bonus because the bill does not implement an hourly rate of compensation for the unemployed.", "In addition to the bonus, the bill temporarily expanded eligibility for unemployment. The self-employed, gig economy workers, part-time workers and contract workers now qualify for unemployment. Pandemic Unemployment Assistance will provide 39 weeks of benefits for those who file for unemployment between Jan. 27 and Dec. 31.", "The $600 bonus was a compromise between Democrats and Republicans, according to Politico. Because the weekly $600 equals $15 an hour for 40 hours, some people will be paid more during unemployment than when they were working.", "According to a report by the Leadership Conference Fund and the Georgetown Center on Poverty and Inequality, 42.4% of people working in the United States in 2015 earned less than $15 an hour.", "Treasury Secretary Steve Mnuchin said in March on Fox News that the $600 bonus was chosen because states' computer systems are more than 30 years old. Reprogramming the computers to achieve what he described as a more nuanced distribution of money would have taken too long.", "“In certain states, that might be a little bit too much money. In other states, it’s less money. It’s not a perfect system, but the president’s objective was to make sure we get money in people's hands,” Mnuchin said.", "The Facebook claim fails to mention that unemployment benefits vary from state to state. Unemployment benefits are administered at the state level with federal oversight.", "Sen. Lindsey Graham, R-S.C., also mentioned the supposed $24-an-hour unemployment payment, arguing the aid will force employers to compete with the higher pay.", "The Congressional Research Service in October 2019 recorded the maximum weekly unemployment compensation in South Carolina at $326. When added to the $600, compensation is equivalent to $23.15 an hour, close to what Graham said.", "But other states’ maximum unemployment compensation is lower. In Arizona, the maximum weekly unemployment compensation is $240, which would equal $21 an hour.", "Massachusetts has the highest maximum weekly unemployment compensation at $1,192 (the state provides extra funding for people with dependents) and Puerto Rico holds the lowest at $190.", "According to data obtained by PolitiFact, at the national level, unemployment covers about half of a person’s wages at up to $450 a week, which comes out to about $225 a week.", "“So, a person who normally earns $450 would receive $225 in regular unemployment benefits, plus the $600 bonus, or $825 a week  – more than their regular pay. That’s about $21 per hour,” PolitiFact reported.", "The average weekly total unemployment benefit as of January was $385 a week, according to different data acquired by PolitiFact from the Washington, D.C.-based Brookings Institution. That totals $24 an hour.", "But unemployment varies based on individual income and is calculated based on a person’s earnings from the previous 12 months.", "“The methods states use to determine monetary eligibility, however, vary greatly. Most state benefit formulas replace approximately half of a claimant’s average weekly wage up to a weekly maximum,” the Congressional Research Service’s report explains.", "The Facebook post claiming the unemployed will receive $24 an hour is an oversimplification that does not consider states’ varying unemployment distribution calculations that are in part determined by income level.", "Although it is possible that some people may receive the equivalent of $24 an hour from unemployment benefits, not everyone will. Many variables determine the unemployment benefits a person receives.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here."]