["By Saranac Hale Spencer", "Posted on April 3, 2019", "A Facebook post falsely describes a video of an interdenominational rally against Islamophobia as a “Muslim rally … demanding their Sharia Rights.”", "The mass shooting that killed 50 people in two New Zealand mosques on March 15 prompted vigils around the world.", "In the aftermath of the shooting, several religious and cultural organizations in New York hosted a demonstration on March 24 against Islamophobia and hate. But a video showing some of the participants has been shared 11,000 times (and viewed 383,000 times) on Facebook with the inaccurate claim that the video shows a “Muslim Rally in New York City demanding their Sharia Rights!”", "The video with the incorrect description was posted by someone named Ameet Singh, who describes himself as a “proud infidel” and posts conservative content on his Facebook page. His video has provoked more than 200 angry comments, including this one: “Start throwing rocks at their heads THEY DEMAND IT.” Other commenters made suggestions like this: “Deport all who demand Sharia Law.”", "Referencing Sharia law, as Singh’s video does, is a common tactic in viral deceptions. We’ve addressed a lot of false claims about Sharia law over the years. Generally, Sharia law regulates the behavior of Muslims, laying out rules for the treatment of other people and duties to Allah.", "The rally, though, wasn’t about advocating for Sharia law. It was aimed at ending racism and violence, and planned by Muslim, Jewish and Christian groups, according to amNY.com, a website owned by Newsday.", "Some of the speakers delivering a message of tolerance can be seen in a video posted by one of the rally’s organizers, Majlis Ash-Shura, which represents 90 mosques in New York. In the last 30 seconds of that video, some of the same demonstrators featured in the inaccurately labeled video are shown as they walk up Broadway from Times Square to Columbus Circle in New York City. The mislabeled video shows about 23 seconds of video taken at the corner of 50th Street and Broadway.", "Here are some examples that show the same people in each of the two videos:", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Chavez, Nicole and Madeline Holcombe. “Death toll rises to 50 in New Zealand mosque shootings.” CNN. 17 Mar 2019.", "“New York Muslims and Allies to Rally Against Islamophobia and Hate Violence.” Press release. UnitedAgainstIslamophobia.org. 22 Mar 2019.", "Singh, Ameet. “Muslim Rally in New York City demanding their Sharia Rights!” Facebook. 25 Mar 2019.", "Saliba, Issam. “What is Sharia Law?” Library of Congress. Jun 2011.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]