["By Eugene Kiely", "Posted on May 17, 2018", "Rep. Adam Schiff mistakenly claimed that the Secret Service has paid the Trump Organization “over $150,000 … for the privilege of renting Donald Trump golf carts to protect Donald Trump on his rounds.” In fact, the federal agency rents golf carts from other companies.", "Schiff, a California Democrat and frequent critic of the president’s business relationships, made his remarks on CNN’s “New Day.”", "After criticizing the Trump Organization’s involvement in an Indonesian theme park resort that is being built by a Chinese government-owned company, Schiff turned to the Trump Organization’s domestic businesses and questioned whether it is ethical for the president’s company to make money off the federal government.", "Schiff, May 15: The federal government has spent over $150,000, just the Secret Service alone, for the privilege of renting Donald Trump golf carts to protect Donald Trump on his rounds. That’s obscene. And that should never be permitted.", "Schiff’s office told us that the $150,000 figure comes from a November 2017 USA Today story that cited the research of American Bridge 21st Century PAC, a Democratic opposition research group.", "But the USA Today story did not say that the Secret Service is “renting Donald Trump golf carts.” It cited one company, Golf Car & Utility Vehicle Distributors in Florida. It made no reference to any Trump-owned companies receiving payment.", "American Bridge provided us with a copy of the same spreadsheet that it gave to USA Today, and there were two companies that rented golf carts to the Secret Service. In addition to Golf Car & Utility Vehicle Distributors, Associates Golf Car Service of Poughkeepsie, New York, also rented carts to the agency.", "The two companies, as reported by USA Today at the time, signed a total of 12 contracts with the Secret Service, from Feb. 2, 2017 to Nov. 24, 2017, that were worth a combined $144,975, according to the American Bridge research, which was based on the Federal Procurement Data System website.", "Our research found 14 contracts to those two companies totaling $212,975, including an $8,000 contract that Golf Car & Utility Vehicle Distributors signed Dec. 15, 2016, when Trump was the president-elect, and a $60,000 contract that Associates Golf Car Service signed on May 4. (See our search results here and here.)", "But there is no evidence that the Secret Service rented golf carts from Trump companies, American Bridge spokesman Harrell Kirsten told us. “We haven’t found the contracts going to any Trump companies,” Kirsten said.", "Patrick Boland, a spokesman for Schiff, told us the congressman’s office did not have American Bridge’s data and misread the USA Today story.", "“Though we have not been provided the underlying data you are referencing, Congressman Schiff based his remarks on the public reporting in USA Today and we misread its import,” he said in an email to FactCheck.org.", "On May 17, Schiff introduced legislation that would require the executive branch to disclose any spending at Trump-owned properties. “Such a report will make transparent which expenses at Trump properties directly benefit the Trump family and which others may not, something that you correctly point out is far from transparent in the absence of such reporting,” Boland said.", "We asked Kirsten how American Bridge knows all of the Secret Service golf cart contracts have gone to protecting Trump. He said the group’s research was “based on the timing and location” of the contracts, which he said “are centered at Trump’s golf clubs.”", "For example, Trump traveled to his golf course in Bedminster, New Jersey on Aug. 4 for a “working vacation,” and Associates Golf Car Service, which provides golf cart rentals in New Jersey, signed a $13,600 contract with the Secret Service on Aug. 3. The Trump Organization also operates three of golf courses in Florida, where Golf Car & Utility Vehicle Distributors is located.", "Of course, President Barack Obama was also a frequent golfer. Obama tallied 333 rounds of golf in eight years, according to Mark Knoller, a CBS News reporter known for keeping tabs on presidential vacations and recreational habits. As of May 13, Trump spent all or part of 114 days at golf clubs since taking office last year, Knoller says.", "We asked the Secret Service how much it has spent on renting golf carts to protect Obama and Trump when they were visiting golf clubs or playing golf, and for the names of the companies that received the payments. We will update this story if we receive that information.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]