["The 30-second video was published on Facebook here on April 12, 2020. It has been viewed more than 10,000 times and shared at least 742 times.", "The post’s Urdu-language caption translates to English as: “Three patients ran away from quarantine in Chiniot. Then what happened is in front of you”", "Chiniot is a city in Pakistan’s Punjab province where the government set up quarantine facilities for COVID-19 patients at a university campus.", "Below is a screenshot of the misleading post:", "The same video was shared alongside a similar claim here, here and here on Facebook and here on Twitter.", "The claim is misleading; Chiniot police told AFP the footage shows a training drill.", "“This is a video of a mock exercise which was held on March 31, 2020 at the quarantine centre established at Fast University, Faisalabad Road,” Mohsin Hasan, the sub-inspector of Chiniot Police told AFP by WhatsApp message.", "Pakistani newspaper The Express Tribune published the video on its Facebook page here on April 11, 2020 in a post that described the footage as a “mock exercise”.", "“Police forces run a mock exercise at a university in Chiniot which is being turned into a quarantine centre. The mock exercise was conducted in case a patient quarantined in the centre tries to escape,” the post’s caption reads.", "The Express Tribune stated on Facebook that “reports of many patients escaping from the centres have emerged” and that “the police force took it upon themselves to best prepare themselves if such a situation arises.”", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and The Express Tribune video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]