["By Angelo Fichera", "Posted on January 9, 2020", "An out-of-context clip from a 2008 interview with then-presidential candidate Hillary Clinton is circulating on Facebook. It shows her saying the U.S. “will attack Iran” if she becomes president. But she was responding to a question about a hypothetical nuclear attack by Iran on Israel.", "As a presidential candidate in 2008, then-Sen. Hillary Clinton took a hardline approach against Iran and its nuclear weapons ambitions during an interview with journalist Chris Cuomo, who at the time was with ABC News.", "But amid the current conflict between the U.S. and Iran, a clip from that 12-year-old video is circulating on Facebook without context for Clinton’s words.", "The clip, posted by multiple accounts and spliced in different ways, begins with Clinton asserting, “If I’m the president, we will attack Iran.”", "In reality, Clinton was responding to a question about how she would respond to an Iranian nuclear attack on Israel, a U.S. ally, as other videos and a report from ABC News at the time show.", "ABC News, April 22, 2008: In an interview with ABC’s Chris Cuomo, Clinton expressed her toughest stance yet on Iran’s nuclear ambitions and the potential threat the country poses to American allies.", "“If Iran were to launch a nuclear attack on Israel what would our response be?” Clinton said. “I want the Iranians to know that if I’m the president, we will attack Iran. That’s what we will do. There is no safe haven.”", "“Whatever stage of development they might be in their nuclear weapons program in the next 10 years during which they may foolishly consider launching an attack on Israel, we would be able to totally obliterate them,” Clinton said.", "The clip circulating now omits the part where Clinton says, “If Iran were to launch a nuclear attack on Israel what would our response be?”", "In one altered version, Clinton’s out-of-context line — “If I’m the president, we will attack Iran” — is repeated at the end of the video, and illustrated with footage of a nuclear explosion.", "Clinton no doubt viewed the prospect of U.S. military force as a useful deterrent for Iran, but the selective clip leaves the impression that she had plans to attack Iran irrespective of the country’s actions.", "Clinton’s approach in 2008 presented a contrast with her then-rival for the Democratic nomination, Barack Obama, who likened her statements to “language reflective of George Bush.” But after Obama became president, Clinton served as his secretary of state and later (after leaving the administration) endorsed the Iran nuclear deal. That deal, intended to curb Iran’s nuclear capabilities, was reached in 2015 by the U.S. and several other countries.", "Still, Clinton remained distrustful and critical of Iran as she mounted another presidential run — saying in a 2015 speech that she would “distrust and verify” that Iran was living up to its obligations under the nuclear agreement. She continued to cite military action as an option, if necessary: “As president, I will take whatever actions are necessary to protect the United States and our allies. I will not hesitate to take military action if Iran attempts to obtain a nuclear weapon.”", "President Donald Trump withdrew the U.S. from the Iran nuclear deal in 2018.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Crowley, Michael. “Hillary endorses nuclear deal.” Politico. 14 Jul 2015.", "“Hillary Clinton addresses the Iran nuclear deal.” Brookings Institution. YouTube. 9 Sep 2015.", "“Remarks by President Trump on the Joint Comprehensive Plan of Action.” White House. 8 May 2018.", "Tapper, Jake, et. al. “Clinton, Obama Push for Votes in Pa. Primary.” ABC News. 22 Apr 2008.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]