["Rhode Island’s 7-percent sales tax is the second-highest rate in the nation. Whether it should stay that way, be reduced or even abolished, is being examined by the Special Joint Legislative Commission to Study the Sales Tax Repeal Act of 2013.", "During the commission’s most recent hearing, on Nov.19, it heard testimony from Joseph D. Henchman, vice president of the Washington D.C.-based Tax Foundation.", "Among other things, he said part of the reason Rhode Island’s sales tax rate is so high is because it taxes so little.", "\"Only 25 percent of what people buy is subject to Rhode Island’s sales tax,\" Henchman said. \"Only Illinois, Massachusetts, and New Jersey have narrower sales taxes. You are exempting 75 percent of the economy from the sales tax already and imposing a higher rate on the rest that you do tax.\"", "Is Rhode Island’s sales tax really as narrow as Henchman says?", "Like most state sales taxes, Rhode Island’s is limited to the sale of so-called tangible goods, not services, such as lawn-mowing or legal fees. It is further diminished by about 83 categories of exempted items such as food, most clothing, medicines, and, more recently, art works and wine.", "Henchman told us he got Rhode Island’s 25 percent figure from analysis done by John L. Mikesell, chancellor’s professor of public and environmental affairs at the Indiana University. Mikesell is considered one of the nation’s experts on state taxation policies.", "Henchman said the figure came from a statistic Mikesell calls \"breadth of base,\" which estimates how much of a state’s commerce is subject to its sales tax.", "Mikesell starts by taking a state’s total sales tax revenue and determining how much in retail sales was needed to produce that amount, a figure he calls the \"implied retail sales tax base.\"", "He then expresses that base as a percentage of the state’s total personal income, the amount of money residents in the state have to spend.", "In 2011, Rhode Island’s 7-percent sales tax raised $824 million, which, by Mikesell’s calculation, required $11 billion in taxable sales.", "Its total personal income that year was about $44 billion, according to the state Department of Labor and Training.", "The $11-billion figure is 25 percent of $44 billion, and that’s the 25-percent figure that Henchman cited.", "But there’s a problem. Mikesell is measuring the percent of a state’s total personal income that is captured by its sales tax.", "Henchman was talking about the percent of a state’s total personal spending that is taxed, a very different amount.", "To get that figure, you’d have to know the total amount of retail sales in the state. Coming up with that number is next to impossible because the state doesn’t track sales it doesn’t tax, said Paul Dion, chief of revenue analysis for the Rhode Island Department of Revenue.", "\"I can’t even tell you what our retail tax base is,\" Dion said. \"We’d have to extrapolate that.\"", "In 2012, the Connecticut Office of Legislative Research was looking at that state’s sales tax rate and it used Mikesell’s percentage also, but it made the point that Mikesell’s comparison was to income, not sales.", "\"In other words, 26.19 percent of Connecticut personal income is spent on goods and services subject to the sales tax,\" the report said.", "When we got back to Henchman, he said Mikesell’s personal income figure provides a uniform number that allows state-by-state comparisons. Dion agreed, and said when he heard Henchman’s statement, that’s how he understood it.", "Our ruling", "Joseph Henchman of the Tax Foundation said: \"Only 25 percent of what people buy is subject to Rhode Island’s sales tax.\"", "But the figure he cited actually referred to personal income, not what people buy.", "In fact, no one knows what percentage of everything that Rhode Islanders buy is subject to the sales tax because no one calculates total spending.", "Dion might have understood what Henchman meant, but we have to go by what he said. We rule his statement False.", "Correction: In the initial version of this item, Joseph Henchman was incorrectly identified as John Henchman in the Source List.", "Testimony of Joseph Henchman before the  Special Joint Legislative Commission to Study the Sales Tax Repeal Act of 2013. Accessed Nov. 26, 2013", "Department of Revenue, Office of Revenue Analysis,  \"2012 Tax Expenditures Report\", pages 59-61. Accessed Nov. 26, 2013", "John L. Mikesell, Chancellor’s professor, professor of public and environmental affairs, resume, University of Indiana. Accessed Nov. 26, 2013.", "State Tax Notes, \"State and Retail Taxes in 2011,\" John L. Mikesell, Dec. 24, 2012. (subscription required). Accessed Nov. 26, 2013.", "Rhode Island Senate, Senate Fiscal Office Report, 2011, page 17. Accessed Nov. 26, 2013.", "Rhode Island Department of Labor and Training, labor market information, income. Accessed Nov. 26, 2013", "Rhode Island Department of Labor and Training, labor market information, population. Accessed Nov. 26, 2013", "Connecticut General Assembly, Office of Legislative Research, Sales Tax Report, Aug. 3, 2012. Accessed Nov. 26, 2013.", "Interview: Joseph Henchman, vice president for state projects, the Tax Foundation, Nov. 21 and Nov. 26, 2013.", "Interview: Paul Dion,  chief of revenue analysis, Rhode Island Department of Revenue, Nov. 21 and Nov. 26, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]