["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presidents depicted in stone at Mount Rushmore are, from left, George Washington, Thomas Jefferson, Theodore Roosevelt and Abraham Lincoln.", "On his personal Twitter account, Gov. Scott Walker has been posting a number of tweets lately that espouse conservative principles.", "Some of the most recent ones were \"Stop the spending\" messages, with pictures of President Barack Obama, as well as Ronald Reagan quotes and a pro-gun rights sentiment.", "(There was also a tweet with a math error -- which was quickly criticized and corrected -- saying \"It's hard to believe that it has been 505 years since the first settlers arrived at Jamestown.\" The tweet referred to 1607, so it should have been 408 years.)", "A tweet Walker posted May 14, 2015 caught our attention.", "A graphic image attached to the tweet said: \"That government is best which governs least. -- Thomas Jefferson.\"", "And the text of the tweet itself read: \"Thomas Jefferson said it best. Retweet if you agree that we need a smaller, more conservative government.\"", "That might sound like Jefferson. But it’s not.", "In September 2014, PolitiFact Georgia checked a similar claim by U.S. Rep. Jody Hice, R-Georgia, who at the time was running for the seat he now holds. Hice attributed this quote to Jefferson in a tweet: \"That government is best which governs the least, because its people discipline themselves.\"", "Our colleagues rated Hice’s claim False.", "\"That sounds like something that he might have said or written, but in fact, he did not,\" Anna Berkes, the research librarian at the Thomas Jefferson Foundation, said at the time.", "Meanwhile, the quote Walker used is so often misattributed to Jefferson that it appears on the \"Spurious quotations\" page of the Thomas Jefferson Foundation’s website.", "That page says of the quote:", "\"Although the ideas expressed in this quotation may be in line with Jefferson's opinions to some extent, the exact phrasing is almost certainly not Jefferson's.  However, this quotation has been associated with the ideological descendants of Jefferson's Democratic-Republican party for a very long time, and this is likely why it ultimately came to be attributed to him.\"", "Berkes told PolitiFact Georgia that the quote used by Walker has also been attributed to Henry David Thoreau. But she said research indicates Thoreau was likely quoting the United States Magazine and Democratic Review, where the sentiment first appeared in 1837.", "Berkes told us that she has done some further research and it's still clear the quote isn't Jefferson's.", "We also found that \"Respectfully Quoted: A Dictionary of Quotations\" also attributes the quote to the United States Magazine and Democratic Review.", "Our rating", "Walker said it was Thomas Jefferson who said \"that government is best which governs least.\"", "While it may match closely with Jefferson’s views, the Thomas Jefferson Foundation lists the quote as one of the many that are mistakenly attributed to Jefferson.", "We rate Walker’s statement False.", "Twitter, Gov. Scott Walker tweet, May 14, 2015", "PolitiFact Georgia, \"So says Thomas Jefferson? You might reconsider,\" Sept. 13, 2014", "Thomas Jefferson Foundation, \"That government is best which governs least,\" Aug. 28, 2014", "Respectfully Quoted: A Dictionary of Quotations, \"That government is best which governs least\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]