["Hamid Mir, a prominent Pakistani journalist and anchor, has shared a video of a group of men sitting in front of vehicles of security forces. The commentary in the video claims that Indian security forces are using locals to shield themselves from stone pelters. Mir has shared the video with the text, “This is a latest video(16th August) of Jammu & Kashmir,suburbs of Srinagar where Indian Army used 4 detained Kashmiri boys as human shield to “defeat” some stone pelters some boys in jeans raising anti India slogans and brave soldiers abusing them saying “throw stones now”“, thus claiming that the video represents a present incident from Kashmir after the dilution of Article 370.", "This is a latest video(16th August) of Jammu & Kashmir,suburbs of Srinagar where Indian Army used 4 detained Kashmiri boys as human shield to “defeat” some stone pelters some boys in jeans raising anti India slogans and brave soldiers abusing them saying “throw stones now” pic.twitter.com/MeetCzzXmO", "— Hamid Mir (@HamidMirPAK) August 17, 2019", "This video is also being share extensively on different forms of social media.", "Many people responded to Mir’s tweet claimed that it is an old incident. Alt News searched for news reports of all reported ‘human shield’ incidents in the past, and came across articles in Scroll and Times of India which refer to the same video shared by Mir. Both the articles were published in June 2018 and claim that the said incident happened on June 18, 2018 and the video was reportedly shot at Samboora village in South Kashmir’s Pulwama district.", "According to the report by Scroll, Sanjay Sharma, a commandant of the Central Reserve Police Force, stated that none of their personnel were seen in the video. The Army also did not respond to Scroll’s queries, stating that they’re ascertaining facts. However, Scroll spoke with some of the men who were used as human shields and they stated that the security forces took four men from their homes and used them as human shields.", "Thus, an alleged incident from 2018 of security forces using human shields was projected as a recent incident. Mir has shared misleading videos several times in the past and refrained from deleting them even after being pointed out (1, 2).", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]