["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Wikimedia commons)", "After 17 people were killed in a Florida high school shooting on Valentine’s Day, MSNBC political analyst Joy Reid blamed lawmakers’ inaction on gun control and the gun lobby for allowing a proliferation of guns in Florida.", "\"One-third of Floridians own guns,\" Reid tweeted Feb. 14. \"One-third.\"", "Reid continued: \"Florida is where ‘stand your ground’ laws were born. Florida politicians tried to ban doctors from asking abuse victims if there's a gun in the home. Florida is awash in assault weapons. Want to know why? Ask Marion Hammer and the NRA.\"", "The first \"stand your ground\" law was passed in Florida in 2005, but we wondered about Florida’s gun ownership rate that Reid cited.", "We found that Reid’s claim about gun ownership is accurate, based on a study that used 2013 survey. But that study is chock-full of caveats.", "According to a brief report by Injury Prevention, an international peer-reviewed journal, the gun ownership rate in Florida in 2013 was 32.5 percent, the same as the one-third figure Reid cited.", "The study, led by former Columbia University public health researcher Bindu Kalesan, extrapolated its numbers from a nationally representative survey of 4,000 people in 2013, that were 18 years or older.", "Kalesan, now a professor at Boston University School of Medicine & Boston School of Public Health, told PolitiFact Florida that Reid’s claim is accurate based on the study.", "The study also found that roughly one-third of the nation owns guns, about 29.1 percent. By state, gun ownership varied considerably, from 5.2 percent in Delaware to 61.7 percent in Alaska.", "Florida is not an outlier when it comes to gun ownership, based on this study. For example, it showed Texas ownership at 35.9 percent.", "We ran the survey by a few experts to get their take on its findings. The biggest complaint was that the survey wasn’t large enough to establish state-based numbers with certainty.", "\"The survey is not representative of state ownership,\" said Matt Miller, a professor of health sciences and epidemiology at Northeastern University. \"The researchers applied the data to the states even though the source of the data cautioned people not to do that.\"", "Miller and David Hemenway, a professor of health policy at Harvard’s T.H. Chan School of Public Health, said the best measurement for gun ownership in Florida comes from the early 2000s. The Centers for Disease Control’s Behavioral Risk Factor Surveillance System asked health-related questions to hundreds of thousands of people each year.", "There were gun questions on the 2001, 2002, and 2004 national questionnaire. Hemenway said in 2001, 24.5 percent of Floridians said they had a gun in the home.", "It’s worth noting we also found research on the national level from a June 2017 Pew Research Center survey, which found three in 10 U.S. adults said they own a gun, and an additional 36 percent say that \"while they don’t own one now, they might be open to owning a gun in the future.\"", "Just like the Injury Prevention study, the sample size for the study was around 4,000 respondents, but it was not extrapolated to a state level.", "Reid said, \"One-third of Floridians own guns.\"", "Reid’s claim is accurate based on a 2015 survey that showed that 32.5 percent of Floridians owned guns 2013. However, experts said that the national survey data was not meant to represent the state level.", "Having said that, experts agreed there hasn’t been any good research on state ownership levels since the early 2000s when it was around 25 percent in Florida. Reid’s number seems to be in the ballpark, but it’s important for people to know there is some uncertainty. We rate her statement Mostly True.", "Email interview with Bindu Kalesan, assistant professor at Boston University, Feb. 15, 2018", "Email exchange, David Hemenway, PhD Professor of Health Policy, Feb. 15", "Interview, James Alan Fox, Lipman Family Professor of Criminology, Law, and Public Policy at Northeastern University, Feb. 15, 2018", "Interview, John R. Lott Jr., president, Crime Prevention Research Center, Feb. 16, 2017", "Interview, Matt Miller, a professor of Health Sciences and Epidemiology at Northeastern University, Feb 15, 2018", "Injury Prevention, Gun ownership and social gun culture, published June 29, 2015", "Pew Research Center, America’s Complex Relationship With Guns, June 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]