["The post was published here on Facebook on February 22, 2020.", "It reads: “Black garlic prevents cancer by 6 times”.", "Black garlic is the process of fermenting garlic in the temperature of 60-90 degree celsius for at least one month until the garlic turns dark, according to this report published by Thailand’s Mahidol University.", "A similar claim was also shared here in 2012 and here in 2016. More recently it was shared here and here in 2020 on Facebook.", "The claim, however, is false.", "Dr. Suebpong Tanasanvimon, an oncology specialist at Chulalongkorn University told AFP there are “no studies which state that eating [black garlic] can prevent” cancer.", "During a phone conversation on July 30, he said: \"I've never heard of this. There are no clear studies which state that eating a specific thing can prevent you from cancer.", "“The reason for most types of cancer is still unknown. However, there are some types of cancer in which we know what causes and how we can prevent them, such as lung cancer which is caused by smoking, or liver cancer which is caused by heavy drinking. However, there are no studies which indicate that certain kinds of food have definite anti-cancer properties.”", "Thailand’s state-run National Cancer Institute also called the claims “fake news” in this report published on its website on May 21, 2020.", "Part of the Thai-langugage report translates to English as: “Studies have shown that black garlic contains antioxidants in the group of flavonoid and polyphenols which may help prevent cancer cells. However, most of the research involved is only laboratory or experimental animals.”", "It also warned against excessive consumption of black garlic, saying: “[People] should consume black garlic products which are up to standard in order to protect from other contaminants. Over consumption may lead to side effects to your health, especially cancer patients who are undergoing treatment should be supervised by a doctor.\"", "Similarly, the US-based American Institute for Cancer Research states here that while certain compounds in garlic are known to “offer anti-cancer activity”, it lacks human study.", "It reads in part: “More research is needed to understand how garlic’s role in cancer risk might vary based on the amount, absorption, preparation methods and individual differences. AICR’s Third Expert Report and Continuous Update Project (CUP) found evidence too limited to draw any conclusions about garlic and cancer risk.”", "The claim was also debunked by Thailand’s Anti-Fake News Centre, a government-run platform within the Ministry of Digital Economy and Society, here in May 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]