["Pressed on his refusal to follow decades of precedent and release his tax returns, Donald Trump at the first presidential debate repeated his assertion that the 92-page financial disclosure form he filed to the Federal Election Commission provides a better picture of his finances than the tax returns would.", "\"You will learn more about Donald Trump by going down to the Federal Elections\" to see the financial disclosure form than by looking at his returns, Trump said. (Trump has cited an ongoing audit by the Internal Revenue Service as a reason he isn’t releasing the returns. Hillary Clinton has released her tax returns from 2000 to 2015.)", "Trump has a point that his financial disclosure form is extensive. Its 92 pages are crammed with small print detailing assets, income sources and positions held. (We were able to track his investments in the stock market, for instance.) By comparison, Mitt Romney -- the 2012 Republican nominee who was a businessman with a complex set of holdings -- filed a 47-page disclosure form, not counting amendments and updates.", "We have previously looked at the difference between the financial disclosure form, which is required of presidential candidates under federal law, and tax returns, which have been released since 1980 by tradition rather than legal requirement.", "We found little evidence to support Trump’s argument that the financial disclosure allows observers to \"learn more\" than they would from a tax form.", "\"It is true that Trump's businesses have received a lot of attention, but without the release of Trump's tax returns, we don't know a lot about his personal financial situation,\" Lawrence White, an economist at New York University’s Stern School of Business, told us earlier this month.", "The two most obvious pieces of the puzzle missing without Trump’s tax returns are the effective rate of tax he pays on his income, and details about his charitable giving.", "Depending on what figures appear on his tax forms, Trump could face political criticism. Paying a low tax rate could be politically embarrassing. And Trump has faced questions about his past charitable giving. (For details, see the ongoing coverage by reporter David Farenthold of the Washington Post.)", "Tax returns also can give a clearer picture of the candidate’s liquid assets. \"Trump can inflate his image of being rich on the financial disclosure forms, but you can get a better sense of how much he’s actually making from his tax returns,\" said former Romney aide Ryan Williams, who did not support Trump during the GOP primary and now says he’s officially undecided on the presidential race.", "Other nuggets can be gleaned from tax forms as well, such as what specific mix of taxes the candidate paid.", "\"Romney’s tax return showed us a ton of valuable information about Romney, including the fact that most of his substantial income was ‘carried interest,’ \" which is a type of tax-favored income available primarily to fund managers, said Allan Sloan, a business columnist for the Washington Post. Because of this, \"we saw that the majority of his income was taxed at low rates.\"", "Trump wouldn’t necessarily qualify for the carried-interest tax, but as a someone in the real-estate business, he would have access to specialized tax breaks of his own, Sloan said.", "There is a \"provision in tax law that allows people who spend at least half their working time as real-estate or development professionals to get depreciation deductions not available to other investors,\" he said. \"That’s a huge loophole, and it’s gotten nothing like the attention that carried interest has gotten.\"", "The fact that Trump has not run for office before or served in government makes the scrutiny of his business dealings especially important for those who care about transparency. Yet the fact that he runs a privately held company makes it hard for outsiders to get a handle on his personal finances as long as no public tax filing is available, experts said.", "\"Because Trump’s business dealings are varied and extensive, there is a lot to look at, but the quality of information is often poor, so reporters spend a lot of time looking at information insufficient to draw accurate conclusions,\" said Dennis Caplan, an associate professor of accounting at the University at Albany.", "Our ruling", "Trump said, \"You will learn more about Donald Trump by going down to the Federal Elections\" to see the financial disclosure form than by looking at his returns.", "An observer would find valuable information about Trump’s personal financial holdings from his extensive (and legally required) financial-disclosure form. However, experts consider that a red herring.", "Unlike all presidential nominees since 1980, Trump has not released his tax returns, which experts say would offer valuable details on his effective tax rate, the types of taxes he paid, and how much he gave to charity, as well as a more detailed picture of his income-producing assets.", "Trump’s statement was, and is, inaccurate. We rate it False.", "https://www.sharethefacts.co/share/314c9496-1c70-41c2-ac55-0b36b9e7cc4d", "PolitiFact, \"Donald Trump says his financial disclosures more than make up for lack of releasing tax returns,\" Sept. 7, 2016", "PolitiFact, \"Donald Trump says he doesn't invest in the stock market. Here's his portfolio,\" Sept. 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]