["Since its global emergence over a year ago, the PCR test – a molecular test that diagnoses infection by detecting genetic material – has been used to distinguish the COVID-19 positives from the negatives. But according to one Facebook post, the PCR test may not be enough.", "\"Anyone catch the WHO website? Yesterday, on the day of inauguration, the recommendations for PCR testing changed,\" writes Facebook user Maria Dawn Tyler on Jan. 21.", "\"Now, a positive PCR test is NOT enough to confirm a positive case. You need a second test AND a clinical correlation, which means be symptomatic, and have a doctor tell you that you have covid based on your symptoms, for it to count as a positive case.\"", "Tyler goes on to claim this means asymptomatic individuals – those not showing or experiencing coronavirus symptoms – will not be considered positive cases nor will people who only underwent one test.", "\"So hundreds of thousands of cases that have been documented now suddenly were not, in fact, positives and now will not count. It is amazing how low the numbers are going to be now,\" she concludes.", "That a single positive COVID-19 PCR test will no longer count toward new cases has been echoed elsewhere on social media. Some of the posts also cite a now-deleted Jan. 21 tweet by Newsmax contributor and urologist Dr. David Samadi discussing the World Health Organization's information notice.", "\"The World Health Organization has now released guidance to laboratories around the world to reduce the cycle count in PCR tests to get a more accurate representation of COVID cases,\" writes Samadi, claiming that the current PCR cycle being used \"was much too high and resulting in any particle being declared a positive case.\"", "USA TODAY reached out to the Facebook users for further comment.", "Fact check:Not likely that COVID-19 vaccine was cause of Hank Aaron's death", "PCR, or polymerase chain reaction, was conceived by biochemist Kary Mullis, an employee of the now defunct Cetus Corp., in April 1983 as an answer to a problem facing scientists: How can DNA, particularly specific genes or sections, be copied quickly and in vast amounts?", "To do that, Mullis exploited the remarkable, and natural, function of enzymes called DNA polymerases, discovered by biochemist Arthur Kornberg and colleagues at Stanford University in the mid-1950s. DNA polymerases were like miniature Xerox copy machines, able to assemble DNA when given a template strand and nucleotides, the essential building blocks of DNA.", "During PCR, the DNA polymerase copies the unfurled helical structure, its two strands separated from each other by heat, with the help of molecules called DNA primers, short genetic sequences that bind to sites of interest providing a replication starting point for the enzyme.", "Unwinding and separating the DNA, binding of DNA primers and copying by DNA polymerase – also called denaturation, annealing and extension – occurs in a single cycle repeated on average 40 times, generating a tremendous 100 billion copies of the sought after DNA segment.", "However, because COVID-19's genome is made of RNA, there is one prerequisite step: rewriting its genetic material into DNA using another enzyme called reverse transcriptase, commonly used to convert RNA-based viruses, like hepatitis C or influenza A, since its discovery in the 1970s.", "Fact check:Posts use 2012 photo of Magic Johnson to falsely claim he donated blood", "While its specificity and sensitivity make PCR a useful, and widely used, diagnostic tool, incorrect use can lead to misdiagnosis – the chief reason behind WHO's information notice.", "\"Since the beginning of 2020, WHO has received 10 reports of problems related to PCR tests for the detection of SARS-CoV-2, including some products listed for emergency use by WHO. The reports were for misdiagnosis, both false positive and negative results,\" said the organization in an email to Reuters.", "WHO's investigation into these reports revealed the tests were not being used appropriately in compliance with the manufacturer's instructions. Laboratories especially ran into problems \"when they did not apply the recommended positivity threshold,\" or the number of PCR cycles needed to amplify the DNA enough to see a positive signal.", "\"This can result in either false negative results (if the threshold applied is lower) or false positives (if threshold is higher),\" WHO explained in a statement to FactCheck.org.", "In a January blog post discussing WHO's information notice, Dr. Ian M. Mackay, a virologist and adjunct associate professor at the University of Queensland in Australia, explained the notice was \"written because some of you, perhaps some doing high-throughput testing of human specimens for the first time ever – need to take some time to learn about what it is you're trying to achieve here.\"", "\"If a lab uses a commercial RT-PCR kit, then they must follow the manufacturer's instructions,\" Mackay emphasized to Reuters, \"Otherwise, the results produced may not be the best, most accurate results that the kit can deliver.\"", "It is worth noting, PCR tests are overall highly accurate and the chance of false positives \"should be close to zero,\" wrote Dr. Robert Shmerling in an August article explaining different types of COVID-19 testing for Harvard Health.", "\"Most false-positive results are thought to be due to lab contamination or other problems with how the lab has performed the test, not limitations of the test itself,\" said Schmerling.", "False negatives typically happen when a person is tested very early and the coronavirus has not replicated enough to be detectable, The Washington Post reported.", "Fact check:Masks encouraged on federal lands if distancing isn't possible", "Samadi's claim that WHO's information notice included changes to the number of PCR cycles – because \"the current cycles was much too high\" and resulting in false positives – is not mentioned anywhere in the notice.", "\"I have no idea how that was misinterpreted into becoming about changing the number of cycles used,\" said Mackay in the same blog post regarding Samadi's tweet.", "Even if the number of cycles were to decrease by 10, \"the majority of positives would still be uncontroversially (sic) positive,\" he writes, looking at COVID-19 testing data in the United Kingdom.", "The number of cycles run may be important for another reason: to determine how infectious someone with coronavirus is.", "In September, Science reported some early studies found patients in the early days of infection had cycle threshold, or CT, values \"below 30, and often below 20, indicating a high level of virus.\" How this works is because of the inverse relationship between CT and viral load: The more viral genetic material a person has to start with, the fewer cycles of PCR needed for a positive result.", "Looking at CT values in conjunction with PCR results could help epidemiologists track outbreaks, said Dr. Michael Mina, an epidemiologist at Harvard University's T.H. Chan School of Public Health, in an interview with Science. It could also help health care professionals identify patients at risk for severe disease and death, as one Brazilian study and another out of Weill Cornell Medicine found.", "But including CT values is not entirely clear cut. Dr. Matthew Binnicker, a professor of laboratory medicine and pathology at the Mayo Clinic, told FactCheck.org that taking high PCR cycle values, or low-positive PCR results, as indicating someone is no longer infectious may miss someone who has \"only recently became infected and has yet to hit peak infectiousness.\"", "He also clarified \"the quality and type of sample can also affect how many cycles are needed to detect the virus, so it's not always the case that a high-cycle result means a person is harboring remnants or only small amounts of the virus,\" FactCheck.org reported.", "Fact check:Amish communities have been affected by COVID-19 pandemic", "The Facebook post's claim that asymptomatic individuals will no longer count toward positive cases is not mentioned anywhere in WHO's information notice.", "Tracking down asymptomatic cases, responsible for 59% of COVID-19 spread according to one recent study, has proven difficult since many infections go undetected. Some research has also suggested testing asymptomatic individuals with the standard nasopharyngeal or throat swabs may produce false-negative results, leading instead to an undercount of COVID-19 cases in the U.S.", "Fact check:WHO recommends mask-wearing to prevent COVID-19 spread", "That a single positive COVID-19 test will no longer count as a positive case is also not suggested anywhere in WHO's information notice.", "Neither the Centers for Disease Control and Prevention nor WHO has released any new case definitions since Jan. 21. The CDC's COVID-19 case definitions – either suspected, probable or confirmed – dating back to April and August both cite \"confirmatory laboratory evidence\" as the only proof needed to classify a case \"confirmed.\"", "Fact check:No evidence for false claims on vaccine 'warning label'", "The claim correlating WHO's new guidance with President Joe Biden's inauguration on Jan. 20 also appears unfounded as it is a second iteration of information first appearing on Dec. 7, 2020.", "The claim that WHO changed its COVID-19 testing guidelines is FALSE. WHO's information notice, first appearing on Dec. 7, 2020, urged laboratories new to COVID-19 PCR testing to follow manufacturer instructions to reduce inaccuracy issues. Claims that WHO would be reducing the number of cycles, or the number of times PCR is run in order to amplify DNA contained within a sample, are mentioned nowhere in WHO's information notice and are unfounded. Similarly, so are claims alleging a single positive COVID-19 test will, by itself, no longer count as a positive case. There is no evidence to suggest asymptomatic individuals will no longer count toward positive COVID-19 cases. Correlating the new recommendation with President Joe Biden's inauguration also appears unfounded.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]