["The Miss Freedom statute sits atop the Gold Dome of the Georgia State Capitol. Photo by Jason Getz / AJC", "The 2015 General Assembly session was expected to conclude by midnight April 2, and lawmakers were racing against the clock.", "Veteran state Sen. Vincent Fort, a Democrat from Atlanta, was in the well of the chamber, lamenting that lawmakers were being asked on the fly to increase the size of the Georgia Court of Appeals by three judges -- or 25 percent. The one-year cost to taxpayers, with support staff, would be $1.5 million.", "\"I have grave concerns for how we’re doing this business of such great consequences at this late hour. It smacks of packing the court, and it’s not something we should be doing at 11:05 (p.m.) on sine die,\" he said.", "Fort was then asked a question that summed up the key point of supporters.", "\"Is it not true that Georgia’s Court of Appeals is the busiest intermediate court of appeals in the country and has been for a decade or more?\" Sen. Charlie Bethel, R-Dalton, asked in traditional legislative parlance.", "The plan to expand the Court of Appeals passed the state Senate late on the 40th and last day of the legislative session, 37-18, as an amendment to a House bill raising judges’ salaries.", "PolitiFact Georgia decided to fact-check Bethel’s statement for two reasons: Legislators didn’t publicly vet the case for increasing the court from 12 to 15 judges; and the added costs fall to taxpayers.", "The Georgia Court of Appeals was created in 1906 and has jurisdiction over many types of appeals. Exceptions include murder, divorce, alimony, constitutional questions and election contests, all of which are heard by the state’s highest court, the Georgia Supreme Court.", "By its own calculations, the Court of Appeals’ caseload increased yearly for 20 years and peaked in 1995. New appeals have been relatively steady in recent years -- 3,260 in 2009, 3,212 in 2010, 3,312 in 2011, 3,464 in 2012, and 3,432 in 2013,  the last year for which data is available.", "So how is it that Georgia is thought to have the nation’s busiest intermediate court of appeals?", "Arguably the best case for the claim is an apparently unique provision in the Georgia Constitution. It mandates that the state’s two appellate courts -- the Georgia Supreme Court and the Georgia Court of Appeals -- rule on any appeal within two court terms, or in about eight months. Failure to meet that deadline means the prior court ruling in the case stands.", "Stephen E. Castlen, the clerk of the court of the Court of Appeals, said cases move through the court \"in rocket fashion as far as compared to courts of appeals around the country.\"", "\"It’s intense,\" Castlen said. \"It’s a commonly held belief that we’re the busiest. You hear it talked about at conferences. Every book I’ve read or article will have a line in there somewhere that we’re one of the busiest courts in the country. I can’t imagine it’s not true.\"", "William Raftery, an analyst with the National Center for State Courts in Williamsburg, Va., said he has reviewed the constitutions of all states and, \"to my knowledge,\" concluded that only Georgia places a two-term deadline on its appeals courts.", "But the center steers clear of labels such as \"busiest\" court because apples-to-apples comparisons aren’t realistic given that not all state intermediate courts of appeals handle the same types of appeals, have the same volume of cases, have the same number of judges or handle cases in the same way. And even though Georgia is the only state with a constitutional requirement that cases be completed in two terms, other states, such as Maryland, have set case turnaround goals to ensure that appeals move quickly, the center’s data experts said.", "\"The national center would not say X is busier than Y for those reasons,\" Raftery said.", "Last year and this year, resolutions were introduced in the state Senate to have a study committee look at the Court of Appeals’ caseload and the possibility of creating three new judgeships. But that proposal became moot when, late last month, Gov. Nathan Deal sent word to House and Senate budget negotiators that there was an extra $45.8 million to spend and 15 items he’d like the money to target. One of those items would allow him to appoint three additional judges to the 12-member Court of Appeals.", "Judges on the court make about $166,000 a year.", "Claims about the court’s caseload have persisted since the 1990s.", "Bethel, an attorney and chairman of the Senate Committee on Insurance and Labor, told PolitiFact he’s been hearing about the Court of Appeals’ caseload and record as the nation’s busiest court since he was in law school in the late 1990s.", "He emailed us links to newspaper articles, a law review article and an online history of the court, all of which included claims along those lines. For instance, Court of Appeals Judge Herbert E. Phipps was quoted in The Albany Herald in May 2013 saying the court was the nation’s busiest based on caseload per capita.", "The court’s website doesn’t go quite that far. It says that during the 1990s, the Georgia Court of Appeals was, \"on the basis of the number of cases decided by each judge, one of the busiest appellate courts in the country.\"", "An analysis, conducted by the state’s Administrative Office of the Courts in 1995, found that the court was the nation’s busiest in 1993 -- based on signed opinions per judge. The Georgia court, which had nine members then, averaged 278 signed opinions per judge that year, and California was second with 137 signed opinions per judge.", "We found other similar claims even on Wikipedia, but none that said the court is currently the  nation’s busiest and has been for a decade or more.", "Bethel told us he was surprised that there was any question about the court being the busiest.", "\"The judges say it. They don’t say they think it,\" he said. \"They say it definitely.\"", "Our ruling.", "The Georgia Constitution is apparently unique in that it requires the state’s two appellate courts to handle appeals within two terms, or in about eight months.", "That undoubtedly requires the justices of the Supreme Court and judges of the Court of Appeals to work swiftly. And it does a lot to boost the credibility of the often-repeated statement that the court is among the nation’s busiest.", "But experts say there is no absolute measure out there to compare the court’s workload to that of other courts. That’s a lot of missing context.", "For that reason, we rate the statement Half True", "Review of the final Senate hours on tape.", "Emails and phones interviews with state Sen. Charlie Bethel, R-Dalton. Georgia Court of Appeals history.", "Phone interview and emails with Shauna M. Strickland, senior court research analyst, research division, National Center for State Courts, Williamsburg, Va.", "Phone interview and emails with William Raftery, knowledge and information services analyst with the National Center for State Courts", "\"Open Chambers: Demystifying the Inner Workings and Culture of the Georgia Court of Appeals,\" by Stephen Louis A. Dillard, Sept. 14, 2004 furnished by Sen. Bethel", "\"Georgia Supreme Court justices call for judicial overhaul: judicial system needs overhaul, official says,\" by staff writer Steve Crawford, The Augusta Chronicle, Jan. 19, 2012", "\"Phipps named chief appeals judge,\" staff reports, The Albany Herald, may 21, 2013", "Emails and phone calls with Steve Castlen, clerk of the Georgia Court of Appeals", "Emails and phone interviews with Ashley G. Stollar, communications/outreach specialist, Judicial Council/Administrative Office of the Courts", "Review 1995 study by Administrative Office of the Court of 1993 court data.", "Review of data provided by Sen. Bethel", "\"Senate backs more money for top judges,\" by James Salzer, The Atlanta Journal-Constitution, March 31, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]