["About this rating", "On Feb. 5, 2021, the Business Standard News (TheBizNews.org) published an article positing that MyPillow CEO and right-wing conspiracy theorist Mike Lindell had blamed antifa — short for \"antifascist\" — women for the Jan. 6 attack on the U.S. Capitol by supporters of former President Donald Trump:", "\"Lindell: Capitol Rioters Were Drugged by Antifa Sluts\"", "MyPillow CEO Mike Lindell is fast becoming known as the nation’s kookiest conspiracy theorist. His latest theory takes the cake. In a post on social media dumpster fire Parler, Lindell produced a new spin on the real reason behind the Capitol attack.", "“The rioters were hypnotized by antifa temptresses who hid psychoactive drugs in their vaginas,” said Lindell. “If you look at the video, many of the rioters had crazed looks in their eyes.”", "This item was not a factual recounting of real-life events. The article originated from a website that describes its output as being humorous or satirical in nature, as follows:", "\"The Business Standard News is a satirical site designed to parody the 24-hour news cycle.\"", "Many supporters of Trump, and adherents to baseless conspiracy theories that President Joe Biden's 2020 election victory was either illegitimate or the result of widespread fraud, have sought to distance themselves from the chaos and violence that took place at the Capitol on Jan. 6, 2021, by claiming the events of that day were orchestrated by left-wing agents provocateurs, in particular, antifa.", "Snopes has debunked several strands of that theory. However, the \"antifa temptresses\" quotation, attributed to Lindell, was fabricated.", "Although the Business Standard News carries a \"satire\" disclaimer on its website, it does not appear on every article. As a result, screenshots of the fake Lindell article spread widely on social media, without a warning that its contents were made up and intended to be humorous. To illustrate the popularity of the article, the following is a selection of screenshots (all without any \"satire\" disclaimer) posted and shared on Facebook in February 2021:", "For background, here is why we sometimes write about satire/humor.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]