["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a hokey Web ad from House Republican leader John Boehner last week, the GOP \"releases the dogs on the money trail\" to find jobs created by the Obama-backed economic stimulus package.", "The stimulus was supposed to be all about jobs, according to the folksy narration by Rep. Lynn Westmoreland, R-Ga., \"but after five months and billions in debt on our kids and grandkids, where are the jobs?\"", "Here's what the job-sniffing GOP bloodhound Ellie Mae finds:", "\"In Wisconsin, the stimulus paid for a bridge to a bar called Rusty's Backwater Saloon,\" Westmoreland says. \"They've got great burgers, but no new jobs.\"", "The 85-foot bridge in question spans Rocky Run, a creek off the Wisconsin River in Stevens Point, Wis. The project to replace the bridge got $840,000 in stimulus money.", "State bridge inspection reports show the bridge carries an average of 260 vehicles a day. According to Dale Peterson, Portage County assistant highway commissioner, most of the traffic using the bridge is people going to and from the Wisconsin River Golf Course (a public course). It's also used by crews for Consolidated Paper driving to the company's waste treatment plant. And there's a small development going in, about 20 homes, whose residents will use the bridge. That's why the 20-year projections show the average daily usage doubling to nearly 600 cars per day.", "So what about Rusty's Backwater Saloon?", "A few of its customers  may  use the bridge. But not many, according to Peterson and someone we spoke with at the saloon. The main route to Rusty's is via a more direct highway access nearby.", "Peterson suspects the Republicans used Rusty's as the example because \"I imagine it made good print.\"", "The ad makes it seem like this is a bridge only to Rusty's. It's not. In fact, Rusty's business would do just fine without it because there are other routes to get to the bar.", "But we don't want to ignore the ad's bigger point, which is that stimulus money is being spent on a little-used bridge.", "The  Milwaukee Journal Sentinel  did an investigative report of stimulus-funded bridge projects in Wisconsin and found that the vast majority of the bridges awarded money in the first wave of stimulus funding are small, rural bridges that carry less than 1,000 vehicles a day. The Stevens Point bridge is one of 37 little-used bridges that got nearly $16 million in stimulus funding, while many higher-priority, well-traveled bridges were ineligible for the first round of stimulus funding.", "That's because so-called \"shovel-ready\" projects moved to the front of the line for the first round of stimulus money, state highway officials said. The idea of the stimulus was to get people working on projects that could be started fairly quickly. What does shovel-ready mean? It means the projects have environmental assessment and Army Corps of Engineers permits in hand and engineering and design work is finished.", "In the case of our little Stevens Point bridge, it has been in the works since 2006. It was designed and ready to go when the stimulus passed in February. In fact, it was originally slated to be replaced in 2009 but got pushed back to 2010 due to lack of available federal funding.", "\"This wasn't some project we cooked up when the stimulus was passed,\" Peterson said. \"All it needed was funding.\"", "Construction is set to begin in August and is expected to take about three months. Peterson estimates a crew of about a dozen will be used to build the bridge. And the concrete and steel will be purchased locally. So presumably that will create some economic ripple as well.", "Built in 1937, the bridge is in need of replacement, Peterson said. If it isn't, he said, ultimately they'd have to shut the bridge down, and \"that would affect quite a few people. And more people would be out of work.\"", "\"It does serve a purpose,\" Peterson said. \"I'm happy this is being replaced.\"", "The GOP ad ends with Boehner kneeling behind a hound dog on a manicured lawn.", "\"I'm John Boehner,\" he says. \"This is Ellie Mae. She hasn't found any stimulus jobs yet. And neither have the American people. It's time to stop runaway spending in Washington and help small businesses get the economy running once again.\"", "Boehner didn't just pluck the Rusty's crack from thin air. On his Web site, he cites a June 16, 2009, story from the  Wall Street Journal  that mentions the bridge. It comes in a story about a report from Sen. Tom Coburn, R-Okla., called \"100 Stimulus Projects: A Second Opinion.\"", "Coburn's report says, \"One small bridge is receiving $840,000, though it only carries 260 vehicles a day on average. It primarily provides access to a golf course and Rusty’s Backwater Saloon, which boasts pontoon rentals and a Steak-A-Rooni for just $5.25.\"", "We realize this Web ad from Boehner was a tongue-in-cheek attack. And let's face it, \"Rusty's Backwater Saloon\" creates a nice visual. But when you single out a project — as Boehner did with the \"Bridge to Rusty's\" — we think he ought to have his facts straight. And the fact is, this Wisconsin bridge is not a bridge solely to Rusty's, as the ad implies. In fact, it's not even the main access point for Rusty's.", "And as for the project not creating jobs, we think Ellie Mae's sniffer is a bit off there too. The main point of the stimulus wasn't so much to create burger-flipping jobs on the other end of bridge construction projects, but to to create jobs for people doing the bridge work itself, thereby creating an economic ripple effect. And according to a Wisconsin highway official, at least a dozen construction workers will be used to replace the bridge. But because  some  people may use the bridge to get to Rusty's, and because there's a legitimate argument to be made that many small, rural and barely used bridges got stimulus money while other bigger (arguably more important) projects were ineligible, we'll give Boehner a Barely True.", "Web site of House Republican Leader John Boehner, Press release:  \"Boehner, Westmoreland Unveil 'Bloodhounds' Video Asking: Where Are the Jobs?\"  July 2, 2009", "YouTube,  \"Bloodhounds\"  web ad, July 1, 2009", "Wall Street Journal,  \"GOP Faults Some Stimulus Projects\"  by Jonathan Weisman and Christopher Conkey,  June 16, 2009", "Los Angeles Times,  \"Stimulus program fraught with waste, report says\"  by Peter Nicholas, June 15, 2009", "White House Web site,  \"Recovert Report: 100 Days 100 Projects\"", "U.S. Rep. Tom Coburn Web site,  \"100 Stimulus Projects: A Second Opinion,\"  June 2009", "U.S. Department of Transportation, Federal Highway Administration Web site,  \"Deficient Bridges by State and Highway System\"", "Milwaukee Journal Sentinel,  \"State approves 49 road, bridge projects funded by stimulus,\"  by Patrick Marley, March 17, 2009", "Milwaukee Journal Sentinel,  \"Rural bridges targeted, Little-used structures to be replaced, fixed\"  by Ben Poston and Tom Held, March 29, 2009", "Interview with Dale Peterson, Portage County assistant highway commissioner, July 6, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]