["By Vanessa Schipani", "Posted on December 7, 2017", "The head of the House science committee falsely claimed the National Science Foundation funds “more than twice as many graduate students in the social and behavioral sciences as in computer science, mathematics or material science.”", "In fact, 21.5 percent of the 22,821 graduate students funded by the NSF in 2015 were in math, computer science and material engineering, according to the latest data. That’s more than three times the number of psychology and social science students.", "Rep. Lamar Smith, chairman of the House Committee on Science, Space and Technology, made his claim in a Nov. 30 op-ed, “Science That Leads,” published in the newspaper Roll Call. In his op-ed, Smith argues that, in order for U.S. scientists to “surpass their counterparts in China and other competing countries,” the NSF “needs to get its priorities straight” when it comes to what kind of research it funds.", "Smith claimed the NSF is funding too much “low priority” research in the social and behavioral sciences, including sociology and psychology, and not enough research in “fields most likely to yield scientific breakthroughs, technological innovation and economic growth,” such as computer science. To change this, he urged Congress to shift 10 percent to 20 percent of federal funding for social-behavioral research to “nonsocial research.”", "Smith has a right to view some scientific fields as more important than others, but he’s wrong about NSF funding for graduate students.", "When we emailed Smith’s office for support, spokesperson Thea McDonald told us that the chairman’s claim is supported by a “list of current and active Graduate Research Fellowships” that NSF provided to the committee in October. McDonald urged us to reach out to NSF for specific numbers, so we did.", "NSF spokesperson Aya Collins told us by email that Smith’s “statement is inaccurate as it only focuses on a single program at NSF: the Graduate Research Fellowship Program.” This “is only one of the means through which NSF funds graduate and undergraduate education,” Collins added.", "Let’s take a look at the numbers on NSF’s Graduate Research Fellowship Program first. The program gives students $34,000 for living expenses and $12,000 for tuition, and provides them with other opportunities.", "Collins told us this program currently funds a total of 8,204 graduate fellows, with the life sciences and engineering making up the lion’s share at 2,310 and 1,972 students, respectively. The life sciences include fields such as genetics or neuroscience.", "When it comes to the fields Smith mentioned, this program currently funds 728 graduate students in the social sciences, 562 in psychology, 403 in computer science, 294 in the mathematical sciences and 187 in materials research.", "If psychology and the social sciences are grouped together, then the NSF does indeed fund more than twice as many students in the social and behavioral sciences compared with computer, materials or mathematical sciences — in this particular program.", "But if we take a look at the NSF’s funding for graduate students across the agency, a different picture unfolds.", "Graduate students can get funding through multiple programs at NSF. For example, Collins highlighted the agency’s CyberCorps program, which provides scholarships to undergraduate and graduate students studying cybersecurity, an area of computer science.", "The most recent agencywide numbers on graduate students comes from 2015 (see chart on the left). In that year, the NSF funded a total of 22,821 graduate students.", "Of the fields that Smith highlighted in his op-ed, computer science had the most students – 3,227, or about 14.1 percent of the total students. Math and statistics students made up about 3.7 percent.", "The agencywide data doesn’t specifically delineate “material science” from other disciplines. But there is data on “metallurgical and materials engineering.” The NSF funded 875 graduate students in this field in 2015, or about 3.8 percent of the total.", "Psychology and social science students made up less than these fields in 2015 at about 2.4 percent and 3.5 percent, respectively.", "Out of all fields, the NSF funded the most graduate students in the physical sciences, including physics and chemistry, at almost 18 percent of the total in 2015. Computer science came in second place.", "The NSF’s funding for all research, not just for graduate students, tells a similar story.", "Congress allocated about $6 billion to the NSF for “research and related activities” for fiscal year 2017, which ran from Oct. 1, 2016, to Sept. 30, 2017.", "Of that total amount, Collins told us the social, behavioral and economic sciences made up nearly $270 million. That’s compared with just over $935 million for computer and information science and engineering, and around $1.4 billion for the mathematical and physical sciences, she said.", "It’s worth mentioning, however, that Smith did correctly note in his op-ed that, according to TOP500, “China now has the world’s fastest supercomputer and has just passed the U.S. for the first time to lead the world in the number and total performance of supercomputers.”", "TOP500 is a project of the ISC Group based in Germany that ranks supercomputers across the world by their ability to solve linear equations, a simple example of which is 2x=1. The list is compiled by four computer science experts at the ISC Group, the U.S. Department of Energy’s Lawrence Berkeley National Laboratory in California and the University of Tennessee.", "In a November article, TOP500 notes that China overtook the U.S. in the total number of supercomputers “by a margin of 202 to 143.” That’s the most “supercomputers China has ever claimed on the TOP500 ranking, with the US presence shrinking to its lowest level since the list’s inception 25 years ago,” adds TOP500.", "So Smith’s argument that the U.S. is falling behind in computer science, at least in supercomputing, is backed by some evidence. But in supporting his argument, Smith falsely claimed that the NSF funds “more than twice as many graduate students in the social and behavioral sciences as in computer science, mathematics or material science.”", "Editor’s note: In the chart above, we grouped NSF’s data for “Biological sciences” and “Neuroscience and neurobiology” under “Life Sciences.” The number for “Other Sciences” comes from combining NSF’s data for “Agricultural sciences,” “Communication,” “Family and consumer sciences and human sciences,” “Multidisciplinary and interdisciplinary studies” and “Health.” The number for “Other Engineering” comes from adding “Aerospace engineering,” “Agricultural engineering,” “Architecture,” “Engineering science, mechanics, and physics,” “Industrial and manufacturing engineering,” “Mining engineering,” “Nuclear engineering,” “Petroleum engineering” and “Engineering nec.”", "SciCheck is made possible by a grant from the Stanton Foundation.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]