["The claim was made published on Facebook here on April 3, 2020. The post was shared in a group with more than 71,000 followers and has been shared more than 9,300 times.", "Below is a screenshot of the misleading post:", "The Sinhala-language text overlaid on the image translates to English as: “At a time when an islandwide curfew has been imposed to contain the spread of coronavirus, a Beruwala mosque convenes people. Yells at officers who went to disperse the crowd. Dear President, please order these persons who don't heed orders, to be shot on sight, as they are risking the lives of all the citizens of this country.”", "Beruwala is a coastal town in southern Sri Lanka where five villages were recently placed on lockdown after a person tested positive for COVID-19 in the area.", "A similar claim was also shared on Facebook  here , here and here and on various Sri Lankan news websites, for example here and here.", "But the claim is misleading.", "Janaka Vithanage, the officer-in-charge at Beruwala Police Station, told AFP the villagers were summoned to the mosque by medical professionals to receive COVID-19 tests.", "“This incident occurred on April 2, 2020 at the Kuttimala mosque when a team comprising of a doctor from the Kalutara hospital and several Public Health Inspectors visited the area and convened several individuals to conduct sample tests to identify if there were more COVID-19 infections in the area,\" he said by phone on April 6, 2020.", "Vithanage added that minor scuffles arose after a few residents expressed concern that the testing site would increase the risk of COVID-19 infection in the area.", "“This was due to a misunderstanding,\" he said. \"The villagers had feared the disease would spread as they thought the individuals who were being tested were actually infected with the virus. They had locked the medical team in the mosque as a result. We were informed of the incident and I immediately deployed a team to settle the situation. Tests were successfully concluded after it was explained that the tests were performed to ensure their safety by preventing community transmissions.\"", "Dr. Waruna Senevirathne, the Medical Officer of Health for Beruwala, also said that the event on April 2 was a medical gathering.", "“The medical team had performed about six tests when a group of agitated villagers expressed their objection to the mosque being used for the purpose as they were worried the disease would spread in their village,\" he said.", "The tests at the mosque in Beruwala was also covered by local media. In this news clip, published by the Sri Lankan TV channel Derana on April 3, 2020, villagers can be seen objecting to the mosque being used as a COVID-19 test site.", "At the video’s 20-minute two-second mark, a voice can be heard suggesting an alternative location: “Go there and do it, don’t do it here. Those people can also be checked there. There is a ground there, go check there...”", "Additionally, at the 26-minute 36-second mark, the video shows the public health inspector for the Mahagoda area of Beruwala, Madura Shalika, giving a rundown of the April 2 event.", "His comments translate to English in part as: “Yesterday a team of medical officers visited from the Nagoda General hospital. There is a group of individuals who evaded testing the day before. Therefore, we needed to get samples from them. At that point there was a fear in the minds of the people but we explained and settled doubts. Otherwise, there was no other issue; the Muslim community has been very supportive of the work we do.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]