["The video has been posted repeatedly on Facebook, for example here on April 17, 2019, where it has been viewed more than 27,000 times.", "The caption in the post states: “Rakesh Pareekh CongRSS candidate from Ajmer was giving speech when his pants fell down. These are the people who are trying to rule India.”", "Rakesh Pareek is a lawmaker from the opposition Indian National Congress party in the western Indian state of Rajasthan.", "Below is a screenshot of the misleading post:", "A Google reverse image search using keyframes from the video in the misleading post led to this clip, which was posted on YouTube on November 2, 2018.", "The video has the caption: “Uttarakhand local body polls: Politician’s trouser fell down while giving a speech.”", "Here is a composite image comparing the moment when the trousers of the man on stage fall down in the misleading Facebook post (L) with the original 2018 YouTube post (R):", "A similar video of the incident shown in the misleading Facebook footage can also be seen in this report by a local news website, published on November 3, 2018.", "The report is headlined \"Uttarakhand local body polls: 'Politicians trousers gets dropped while giving a speech, watch the video'\".", "The report identifies the man whose trousers fall down on stage as Mohammad Umar Siddique, a politician who was then contesting elections in northern Uttarakhand state for the Jaspur Municipality Board.", "Umar Siddique was contesting in 2018 local elections in Jaspur municipality on the Uttarakhand Kranti Dal party ticket, according to this report on the official India elections website.", "Below is his photograph on the main page of the Jaspur Municipality Board website, on the right.", "News website India Today spoke to Umar Siddique about the video for this fact check report.", "\"Unfortunately, my pants did drop off while I was campaigning for polls last month,” Siddique told India Today.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]