["A collage of seven photos featuring Bavarian Minister-President Markus Söder receiving vaccinations has been shared hundreds of times on Facebook, purporting to show the evidence of “fake jabs” as countries including Germany and Australia roll out their Covid-19 vaccination campaigns. The claim is misleading: the photos actually show Söder receiving different vaccinations at separate events between 2009 and 2020.", "This Facebook post was published on February 23, 2021. It has been shared more than 200 times.", "The post features a composite image featuring seven different photographs of Bavarian Minister-President Markus Söder being vaccinated.", "Text across the top of the image says: “This guy has had 7 ‘jabs’”.", "The post's caption reads: \"An epidemic of misinformation!\"", "“Yet still alive and 2 elderly in Qld hospitalized after 4 overdose,” one Facebook user commented. “So is it to be assumed that those who received a quadruple dose in QLD should be alright with no side affects, no side affects, no side affects, no side affects”, another wrote.", "The image began circulating online as multiple countries worldwide, including Australia and Germany, roll out mass Covid-19 vaccinations programs.", "Facebook users who shared the misleading compilation image posted captions indicating they believed it proved that vaccinations were being staged.", "“Same guy. 7 different fake jabs. Wtfu,” one user wrote here.", "“Same guy, seven jabs...hmmmm........” another user wrote here.", "The claim, however, is misleading. The images actually show Bavarian Minister-President Markus Söder receiving seven different vaccinations at separate events between 2009 and 2020.", "Reverse image searches on Google found five out of the seven pictures show Söder receiving a flu vaccination; one picture is from a vaccination against swine flu, and another one is from a vaccination against ticks.", "AFP has numbered each image in the post to their corresponding source.", "Image No.1 can be seen in a tweet published by Söder on May 28, 2020, showing a vaccination from ticks.", "Zecken-Schutzimpfung mit Gesundheitsministerin @MelanieHuml: Impfen schützt. Bayern ist Zeckengebiet - eine Impfung kann schlimmste Krankheiten verhindern. Deshalb bitte regelmäßig auffrischen. Wir wollen keine Impfpflicht, aber niemand braucht Angst vorm #Impfen zu haben. pic.twitter.com/Uev9FIVuzV", "He wrote in the tweet: \"Tick vaccination with Bavaria's Health Minister Melanie Huml. Vaccination protects. Bavaria is a tick area - a vaccination can prevent the worst diseases. Therefore, please get a booster regularly. We don't want compulsory vaccination, but nobody needs to be afraid of vaccination.\"", "Huml was Bavarian State Minister for Health and Care until January 2021, and is also the doctor shown vaccinating Söder in several images.", "Image No.4 was published in an article by Bavarian newspaper Merkur on September 22, 2009, showing Söder’s vaccination against swine flu.", "Flu vaccines", "Five of the images show Söder receiving an annual flu vaccine in 2010, 2016, 2018, 2019 and 2020.", "Image No.2 is from Söder’s Facebook page, and was published on December 16, 2019.", "The post reads: \"Vaccination against flu: Flu is often underestimated and can have serious consequences. Vaccination, on the other hand, offers good basic protection every year. Therefore my recommendation: get vaccinated now!\"", "World Health Organization (WHO) says influenza viruses are continuously changing, which means that vaccine strains need to change annually to better match influenza strains currently circulating globally. WHO recommends annual vaccinations to avoid getting the flu, ideally before the influenza season.", "Image No.3 was taken by German news agency Deutsche Presse-Agentur on October 6, 2020, as per an entry on stock image site Alamy.", "Image No.5 was posted on Söder’s Facebook page on November 21, 2018, while image No.6 was published in 2010 and image No.7 in 2016.", "In Germany, at least 3.8 million people have received at least one dose of the vaccine as of February 26, 2021, according to government data here.", "In Australia, where its Covid-19 vaccination program began on February 22, 2021, 33,702 people have received a vaccination as of February 28, 2021, as per the country’s Department of Health.", "The misleading claim has been previously debunked by AFP in German here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]