["As reported by AFP, at least five people have been killed in South Africa this week in violence linked to tensions over immigration from other African countries. There have been a string of reprisal attacks against South African-owned businesses in Nigeria in response. The Shoprite supermarket chain and telecoms giant MTN have both said their branches have suffered looting and vandalism in Nigerian cities.", "In Nigeria, one social media user tweeted two photos claiming to show a reprisal attack at the MTN office in Apapa, Lagos. One of the pictures shows black smoke billowing from the door of an MTN branch as people look on, while the other shows a fire hose snaking into the building.", "The post, archived here, has been retweeted nearly 200 times. It was captioned: “Angry Nigerians burn down MTN office in Apapa, Lagos.... happening right now!!!”.", "The same pictures were shared by Linda Ikeji, who runs one of Nigeria’s most popular blogs. We’ve archived the story, which was titled “Nigerians set MTN office on fire in Lagos (photos)”, here.", "However, a spokesman for MTN Nigeria told AFP that its Apapa office had not been torched.", "“There is no fire in our Apapa office and there is no reprisal attack,” said Funso Aina.", "We carried out reverse image searches in order to try to determine where and when the pictures were taken, but this yielded no results.", "However, comments underneath the tweet suggested that the photos were old. One commenter said they were from 2012, another that they were taken in 2015. But Google image searches for the pictures, narrowed down to those years, produced no useful leads.", "Scrolling down the comments, another Twitter user said the photos were taken in Ilorin in north-central Nigeria. A Google text search for “Ilorin MTN office burn” finally led us to a post on the Nairaland Forum message board on March 15, 2015. According to the post, the writer saw a crowd gathering at the MTN branch after it caught fire.", "As reported by local media, an MTN office was torched in Ibadan, southwest Nigeria on Tuesday night, but these pictures do not show that incident.", "Various misleading images have begun circulating in the wake of the South African violence, fuelling tensions. Before sharing a post online, ask yourself:", "1. Is it accurate? Search credible media for more information on what you plan to share.", "2. Is it recent? Old pictures and videos can cause new problems. Check the comments underneath to see if anyone has identified the image as an old one. Right-clicking on the photo and running a reverse image search can also help you to see if it appeared online years earlier.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]