["The coronavirus is now a pandemic, so far infecting nearly 120,000 people worldwide and killing more than 4,000. The Centers for Disease Control and Prevention have recommended that travelers avoid visiting Italy, among several other countries, unless it's absolutely necessary.", "Italy, meanwhile, is taking its own precautions as COVID-19 spreads widely there.", "A recent blog post claims those precautions include putting the entire country \"into quarantine.\"", "\"Italian prime minister has announced that the entire country goes into quarantine, as part of emergency measures aimed at halting the spread of the coronavirus,\" the undated post says. \"The government’s extraordinary measures, announced at Palazzo Chigi late on 9 March, comes amid a worsening of the coronavirus outbreak. The new stringent measures, covering the entire country, and would take effect tomorrow morning.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But this post is essentially true: On March 9, Italian Prime Minister declared all of Italy a \"red zone,\" which means people should stay home except for work and emergencies, according to NPR. The emergency quarantine measure had already been in place in northern Italy, where most of the COVID-19 cases are.", "Italians must now also seek permission for essential travel, according to the BBC — and permission will only be granted for people with valid work or family reasons that can’t be postponed. People are forbidden from gathering in public and all sporting events are suspended. Schools and universities are closed until April 3.", "There are other rules that indicate the nation is allowing some movement, however restricted, including a 6 p.m. curfew on bars and restaurants, a ban on jail visits, and an embargo on unnecessary shopping. Shopping centers, except for pharmacies and food markets, must close on weekends, according to ABC News. People are being asked to stand at least a meter apart from one another in supermarket lines.", "But as the New York Times reports, the exact restrictions of the quarantine aren’t clear to some Italians.", "\"We are hearing too many things and people don’t really get what’s going on,\" the newspaper quoted one woman as saying. She said she thought it was fine to take a walk around Milan, where she lives, but said the government’s explanations \"aren’t clear at all.\"", "It’s worth noting that the word \"quarantine\" also has several definitions. According to Merriam Webster, it can mean \"a state of forced isolation.\" Clearly not everyone in the country is being forced into isolation. But it can also mean \"a restraint upon the activities or communication of persons or transport of goods designed to prevent the spread of disease or pests,\" a definition that fits what we are seeing in Italy. The country’s lockdown also seems well within the definition of quarantine used by the U.S. Department of Health and Human Services: \"to separate and restrict the movement of well persons who may have been exposed to a communicable disease to see if they become ill.\"", "We rate this post True.", "Blog post, visited March 10, 2020", "NPR, Coronavirus: COVID-19 is now officially a pandemic, WHO says, March 11, 2020", "Centers for Disease Control and Prevention, Coronavirus disease 2019 information for travel, visited March 11, 2020", "Centers for Disease Control and Prevention, COVID-19 in Italy, visited March 11, 2020", "NPR, Italy expands quarantine measures nationwide to stem spread of coronavirus, March 9, 2020", "BBC, Coronavirus: Italy extends emergency measures nationwide, March 10, 2020", "ABC News, American living in northern Italy describes life under quarantine: ‘It’s a huge sacrifice but everyone is doing it,’ March 10, 2020", "The New York Times, Italy announces restrictions over entire country in attempt to halt coronavirus, March 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]