["The misleading claim was shared in this Facebook post published on February 21, 2021. The post was shared more than 3000 times before it was deleted.", "The Sinhala-language text superimposed on the image translates to English as: “This will be very important to those expecting to get a tattoo.", "\"Not sure if you guys are aware of this, but did you know you can’t donate blood if you are tattooed? Also, even if you manage to donate blood, your blood will be discarded at the point where it is being screened.", "\"A lot of young boys and girls are into tattooing these days, that is why this was mentioned. If you are planning to get a tattoo, don't donate blood.”", "The same graphic has been shared in Facebook posts here, here and here alongside an identical claim.", "The claim, however, is misleading. Sri Lanka’s National Blood Transfusion Service says people with tattoos are only temporarily discouraged from blood donation for one year as a precautionary measure against blood borne infections.", "The Director of Sri Lanka’s National Blood Transfusion Service (NBTS), Dr. Lakshman Edirisinghe told AFP by phone on March 1, 2021 the claim in the Facebook posts is misleading.", "“We do advise persons who have been tattooed to wait a minimum of one year before donating blood, as a precautionary measure against blood borne infections such as Hepatitis B or C, Malaria, Syphilis and HIV. But that is not a blanket ban against persons with tattoos against donating blood,” he said.", "Dr. Edirisinghe went on to say that all blood samples donated are placed through a screening process, during which any samples with contaminants such as blood borne infections would be detected.", "“There is a lengthy counselling process before an individual is permitted to donate blood. At that point, if a donor is inked we enquire into the history of tattoos prior to permitting them to donate blood. The one year wait time is strictly a precautionary measure and should not be regarded as a move to discourage them from donating blood,” he said.", "As of March 2, 2021, the NBTS’ website has not excluded people with tattoos in its Donor Selection Criteria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]