["House Speaker Paul Ryan, shown here visiting a New Berlin, Wis., factory, says 70 percent of Americans believe the country is on the wrong track. (Milwaukee Journal Sentinel photo)", "In national politics, it seems as if everything is up for grabs these days.", "There’s the presidential election, with an open seat at stake. Control of Congress is in the balance. And there is a critical vacancy on the U.S. Supreme Court.", "Appearing Feb. 22, 2016 on Megyn Kelly’s Fox News show, U.S. House Speaker Paul Ryan (R-Janesville), said the problem is head-butting between the Republican-controlled Congress and Democratic President Barack Obama.", "\"We have this liberal president and conservative congress\" Ryan said, punching his fists together. \"It’s not working.\"", "\"So you don’t think anything can get done unless it’s one party rule?\" Kelly asked.", "\"Look at the path we are on,\" Ryan replied. \"70 percent of Americans believe that we are on the wrong path.\"", "To be sure, in a politically divided country, Republicans may think we are on the wrong path because of what Democrats are doing, and vice versa.", "But that still seems like a high percentage of Americans thinking the country is headed in the wrong direction.", "Is Ryan right?", "Digging in", "When we asked for backup, Ryan’s team pointed to the most recent Associated Press poll before Ryan’s appearance the show, conducted between Feb. 11 and Feb. 15.", "The AP-GfK poll is conducted online using a nationally representative sample of American adults recruited to take surveys. While the poll was conducted online, participants were found through address-based sampling to include people who do not have internet access.", "The question about the country’s direction is asked first on the AP poll. This means previous questions don’t influence the response.", "Of the Americans polled in February, 68 percent said things in this country are generally heading in the wrong direction. That’s just under Ryan’s 70 percent figure.", "The number was actually down from 74 percent in the previous poll, taken in December 2015.", "And for some time people have thought the country is headed in the wrong direction. For the last two years, 60 percent or more of those polled by AP-GfK have said the country is heading in the wrong direction. Here’s a look at those numbers.", "Date of poll", "Wrong direction percentage", "Feb. 11-15, 2016", "68", "Dec. 3-7, 2015", "74", "Oct. 15-19, 2015", "63", "July 9-13, 2015", "64", "April 23-27, 2015", "62", "Jan. 29 - Feb. 2, 2015", "60", "Dec. 4-8, 2014", "66", "July 24-28, 2014", "72", "May 16-19, 2014", "62", "Interestingly, the bleak outlook from respondents for the country doesn’t seem to affect the outlook for their own families. In the same poll, 76 percent of respondents said things for their family were generally headed in the right direction.", "But Ryan’s staff cited a single poll.", "The right direction-wrong direction is a common one in polling, so for comparison we took a look at Huffington Post Pollster. The feature compiles the reliable polls and tracks that data.", "Pollster’s Feb. 17, 2016 analysis found 64 percent of Americans think the country is on the wrong track. The data shows that percentage has been hovering around 64 percent since October of 2015 and hasn’t risen above 65 percent since 2012.", "By this measure, the only time 70 percent of Americans said the country was on the wrong track was in October 2011.", "Our rating", "Ryan said \"70 percent of Americans believe that we are on the wrong path.\"", "His team backed up this statement with reliable poll results from the Associated Press. But many other polls reported a lower number, closer to 60 percent. What’s more, the percent of Americans who think the country is on the wrong track has hovered above 60 percent for the last three years.", "This statement is accurate but needs additional information or context. That’s our definition of Mostly True.", "Phone interview with Mollyann Brodie, president, American Association of Public Opinion Research, March 1, 2016.", "Email exchange with Ian Martorana, press secretary, Rep. Paul Ryan.", "Paul Ryan interview with Megyn Kelly, Fox News, Feb. 22, 2016.", "The AP-GfK poll, February 2016.", "HuffPost Pollster, US right direction wrong track, February 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]