["About this rating", "On 22 July 2017, the Facebook page \"Prepare to Take America Back\" shared a meme that informed its fans that CNN and other major news media outlets \"buried\" the story of Justine Ruszczyk (who went by her fiance's surname Damond), a white Australian woman who was shot and killed on 15 July 2017 by a Somali-American Minneapolis police officer:", "Damond, 40, died after calling 911 at about 11:30 P.M. to report what she believed to be a sexual assault happening in an alley near her home. Minneapolis police officers Matthew Harrity and Mohamed Noor responded to the call. According to a preliminary investigation by the Minnesota Bureau of Criminal Apprehension, Harrity reported being startled by a loud noise as Damond approached the squad car. Noor opened fire through Harrity's open window, striking her in the abdomen and killing her. A search warrant obtained by Minnesota Public Radio revealed that a female had \"slapped\" the back of the squad car before Damond was killed, but it is unclear if she was the one who touched the vehicle.", "CNN and other American news outlets have been under fire from President Donald Trump and his supporters, many of whom have appropriated the term \"fake news\" to essentially mean organizations and stories that report narratives that they dislike.", "However it is easy to disprove the claim that the news media has buried the Damond story in an effort to suppress the fact that the police officer who shot her was an immigrant from Somalia. For example, a very simple Internet search reveals that CNN has in fact been following the story very closely. They have also pointed out that Noor is the Minneapolis Police Department's first officer of Somali descent, reporting on 18 July 2017:", "Mohamed Noor, the on-duty Minneapolis police officer who fatally shot an Australian-born woman on Saturday night, had been with the force for two years and was his precinct's first Somali-American officer.", "The case has received widespread attention from media all over the world, not just CNN. It has been covered meticulously by local media, but has also been followed closely by national and international media, including the Star Tribune, the Washington Post, CBS, NBC, Fox News, the Daily Beast, USA Today, Australian media, and more.", "Minnesota is notable for its sizable Somali minority community — a community that was singled out by Donald Trump on the campaign trail in November 2016, saying members of the community were \"joining ISIS.\"", "Feshir, Riham.   \"Warrant: Woman Slapped Squad Car Before Cop Fatally Shot Ruszczyk.\r\n     Minnesota Public Radio.   24 July 2017.", "Grinberg, Emanuella.   \"Cop Who Shot Minneapolis Woman Was Precinct's First Somali Officer.\"\r\n     CNN.   19 July 2017.", "BBC.   \"Justine Damond: Australia waits for answers in 'American nightmare.'\"\r\n     21 July 2017.", "McKirdy, Euan, and Ellis, Ralph.   \"Woman Killed by Minneapolis Police a Month Before Wedding.\"\r\n    CNN.   18 July 2017.", "Hassan, Carma, et al.   \"Family of Woman Killed by Minneapolis Police 'Desperate' for Information.\"\r\n     CNN.   18 July 2017.", "Yan, Holly, et al. \"New Details Emerge in Officer-Involved Shooting in Minnesota.\"\r\n  CNN. 19 July 2017.", "Parks, Brad, et al. \"Minneapolis Releases 911 Transcripts of Woman Killed by Police.\"\r\n  CNN. 19 July 2017.", "LeBlanc, Paul. \"In Minneapolis, an Embrace Forged From Tragedy.\"\r\n  CNN. 21 July 2017.", "Kohn, Sally.   \"Facts You Don't Like Are Not Fake News.\"\r\n     USA Today.   7 June 2017.", "Johnson, Jenna, and Sullivan, Sean.   \"Why Trump Warned About ‘Somali refugees’ — and Why It Could Backfire.\"\r\n    Washington Post.   7 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]