["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Feb. 22, 2018, Corey Stewart gestures during a news conference at the Capitol in Richmond, Va. (AP/Steve Helber)", "A history with the fringe right has cast an early shadow over Republican Corey Stewart in his bid to unseat U.S. Sen. Tim Kaine of Virginia, despite efforts to deny past associations.", "In a fiery interview with CNN’s Chris Cuomo on June 13, 2018, Stewart repeatedly denied that he had previously supported or accepted support from white supremacists and anti-Semites, calling Cuomo’s assertion a lie and an example of playing \"the race card.\"", "Corey Stewart, the projected GOP nominee for US Senate in Virginia, repeatedly accused Democrats of using “the race card” to distract from President Trump’s success https://t.co/EP8a3kaRcN pic.twitter.com/TJqOSX87Tx", "Stewart also hurled insults at both Kaine and Cuomo, telling the CNN host he should be fired for dishonesty and that Cuomo’s own late father was anti-Semitic.", "The exchange turned contentious when Cuomo asked about Stewart’s history with Paul Nehlen, a far-right conservative now making his second run for Congress in Wisconsin. \"You have a well pronounced past of saying that you agree with and that you like people who push ugly, bigoted, intolerant and racist notions,\" Cuomo said, pointing to a fact sheet on Stewart’s relationship with Nehlen.", "\"Hey, that’s a level of lie that’s just not true, Chris,\" Stewart responded. \"Even for CNN, to go that far, that is not the case at all. I have always condemned … any of these white supremacists or bigots or anything like that. We want nothing to do with that.\"", "Stewart said he distanced himself from Nehlen after the far-right commentator began tweeting expressions of hatred toward Jews and Muslims, adding that \"everybody supported Paul Nehlen\" and that \"back in the day he was not like that, at least as far as I knew.\"", "Cuomo said Nehlen had already sent anti-Semitic and anti-Muslim tweets in 2016, before Stewart first praised him. He also asked about Richard Hines, a prominent member of the neo-Confederate movement who endorsed Stewart during his campaign for governor in 2017.", "We decided to take a look at Stewart’s history with white supremacy and anti-Semitism and see how the claim that he has \"always condemned\" both checks out.", "On Jan. 20, 2017, the night of President Donald Trump’s inauguration, Stewart met with Nehlen at the Virginia Women for Trump ball. Stewart, who was running for governor at the time, called Nehlen \"one of my personal heroes\" and said he was \"inspired\" by him. Later that night, Stewart tweeted a photo with Nehlen, writing that he was \"so honored\" to receive his endorsement. Stewart has since deleted the post.", "Soon after, in February 2017, Nehlen wrote on Twitter that Islam was not a religion of peace and posted a photo of a plane striking the World Trade Center with the caption, \"9/11 would’ve been a Wonderful #DayWithoutImmigrants.\" In the following months, Nehlen also tweeted that \"Islam is not your friend,\" implied that Muslim no-go zones in Western countries should be bombed and retweeted posts saying Bill and Hillary Clinton were murdering associates.", "At the same time, he was tweeting out support for Stewart’s gubernatorial bid against Ed Gillespie, who eventually won the party’s nomination.", "Nehlen’s tweets escalated the next year. In January, he wrote on Twitter that most of his critics were Jewish, and in February, his account was banned after he targeted Meghan Markle, now the Duchess of Sussex, with a racist tweet. (We accessed Nehlen’s tweets using a CNN archive).", "After Nick Freitas, Stewart’s primary opponent, helped resurface the video of Stewart and Nehlen on social media in June, Stewart disavowed the self-proclaimed \"pro-white\" candidate, telling the Washington Post he had praised Nehlen \"before he went nuts and started spewing a bunch of stupid stuff\" and tweeting, \"Paul Nehlen has lost his marbles and needs serious help.\"", "But the condemnation was a long time coming, and Stewart was wrong to tell Cuomo he had separated himself from Nehlen as soon as he started \"coming out with all those terrible things, those anti-Semitic things, those bigoted things.\"", "According to a June 2017 campaign finance filing with the Virginia Department of Elections, Stewart paid \"Paul Nehlen Group\" $759 as a \"fundraising commission\" in May 2017 — months after Nehlen had started posting problematic content to Twitter. Stewart spokesman Noel Fritsch told CNN the campaign had used the money to borrow Nehlen’s email list.", "And as Cuomo pointed out, Nehlen had retweeted anti-Muslim posts and tweets demanding that Twitter lift its ban on anti-Semite Ricky Vaughn’s account in 2016, before Stewart praised him at the inauguration-day ball. That same year, Nehlen also said he would be open to deporting all Muslims and monitoring all mosques, per The New York Times.", "Stewart received an endorsement for governor from Jason Kessler, organizer of the violent white supremacist rally in Charlottesville, Va., in June 2017 after joining him at a February 2017 event sponsored by Unity and Security for America, Kessler’s organization. Kessler did not rise to prominence until the events at Charlottesville, but Stewart did cozy up to him in the months leading up to the rally.", "If you live in Virginia you have to Vote for Corey Stewart today. Then bring out all your friends to vote for him too. #VAPrimary pic.twitter.com/05RVDGKWhI", "As with Nehlen, Stewart has distanced himself from Kessler. \"Nobody knew who Kessler was back then,\" Stewart said, likely in reference to their February 2017 meeting, during a June 12, 2018, interview quoted in The New York Times. \"Certainly I didn’t. I didn’t know he stood for all those horrible things. I want nothing to do with those things.\"", "Richard Hines, a prominent member of the neo-Confederate movement who once called Nikki Haley, U.S. ambassador to the United Nations, South Carolina’s \"Sikh-Hindu governor\" and said a Richmond statue to black tennis star Arthur Ashe Jr. was offensive to his heritage, also endorsed Stewart’s gubernatorial campaign in a video posted to his Facebook page.", "In the video, Stewart addressed the crowd from in front of a wall-sized Confederate flag.", "We searched Google and Nexis and could not find any mention of Stewart disavowing Hines.", "Stewart told Cuomo that he has \"always condemned … any of these white supremacists or bigots or anything like that.\"", "Over the last several years, Stewart developed public relationships with Nehlen, Kessler and Hines.", "Although Stewart has distanced himself from Nehlen and Kessler during his campaign for the Senate, he has not always condemned their beliefs. It was only in the face of mounting public pressure that he spoke out against them, and even then it took him some time.", "We rate Stewart’s statement Mostly False.", "Clarification: This fact-check has been updated to more precisely refer to a previous Nehlen tweet. Our ruling remains the same.", "Correction: A previous version of this fact-check incorrectly said Stewart's donation to the Paul Nehlen Group occurred after Nehlen had been removed from Twitter. The donation occurred in May 2017, and Nehlen was removed in February 2018. Our ruling remains the same.", "CNN on YouTube, \"Chris Cuomo confronts divisive GOP Senate nominee,\" June 13, 2018", "Media Watch on YouTube, \"VA Senate Candidate Corey Stewart Calls Anti-Semite Paul Nehlen 'Hero',\" June 4, 2018", "Virginia Department of Elections, Campaign Finance Reports, Stewart for Governor, June 5, 2017.", "The New York Times, \"Fact Check: Corey Stewart, Republicans and the Fringe Right,\" June 14, 2018", "CNN, \"Virginia US Senate candidate previously paid anti-Semitic, anti-Muslim figure for fundraising list,\" June 7, 2018", "The Washington Post, \"Virginia’s Corey Stewart disavows ties to ‘pro-white’ candidate he once befriended,\" June 7, 2018", "Richmond Times-Dispatch, \"In Charlottesville, GOP candidate for governor Corey Stewart allies with alt-right-inspired blogger who wants to protect 'glorious Western civilization,'\" February 16, 2017", "The New York Times, \"Paul Ryan’s Rival, a Long Shot, Tries to Gain an Edge from Donald Trump’s Praise,\" August 4, 2016.", "NPR, \"Twitter Bans GOP Contender For Racist Tweet Targeting Meghan Markle,\" February 13, 2018", "CNN, \"Candidate for Virginia governor was endorsed by prominent neo-Confederate at 'Old South Ball,'\" April 17, 2017", "Email correspondence with Noel Fritsch, spokesman for the Corey Stewart for U.S. Senate campaign, June 14, 2018", "Email correspondence with Natalie Pahz, senior publicist for Cuomo Prime Time with Chris Cuomo, June 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]