["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Dick Black has been trying to link opponent Jill McCabe to the fetal tissue controversy (file photo by the Associated Press/The Free-Lance Star).", "Undercover videos in which Planned Parenthood officials discuss harvesting fetal tissue appall state Sen. Dick Black, R-Loudoun.", "A staunch opponent of abortion, Black is seeking to link the controversy to his Democratic opponent this fall, Jill McCabe, a pediatric emergency room physician.", "McCabe \"supports selling late term abortions for bigger body parts,\" Black tweeted on July 28. He renewed the charge on Aug. 4, tweeting that McCabe \"supports late term abortions. Larger baby parts are more profitable.\"", "So we decided to examine Black’s charge.", "Let’s start with some background. The controversy over fetal parts erupted last month when the Center for Medical Progress, a conservative group that opposes abortion, released a nine-minute video secretly taped during a 2014 lunch with Deborah Nucatola, Planned Parenthood’s senior director of medical services. The center says the tape shows Nucatola talking about performing partial-birth abortions to keep body parts intact in order to \"sell\" them.", "The video put Planned Parenthood on the defensive and ignited Republican calls to end federal funding for the group and for investigations into its practices.", "Planned Parenthood provides a wide array of health services to women -- 97 percent of which are not related to abortions. The organization has denounced the secret taping as a misleading campaign by anti-abortion activists. Officials of the group say fetal tissues are integral to medical research and that the organization does not profit from their sale.", "Allegations by Black and others that profits were made raise legal questions. Federal law bars clinics from selling fetal tissue for gain. It’s legal, however, for clinics to donate the tissue for scientific research and receive reimbursement for their \"reasonable\" costs in providing the tissue.", "Cecile Richards, CEO of Planned Parenthood, has said the organization’s clinics don’t sell fetal tissue for profit but do provide it for research and are reimbursed for their collection costs. In the video, Nucatola discusses fees of $30 to $100 per specimen provided.", "Arthur Caplan, director of the Division of Medical Ethics at New York University’s Langone Medical Center, told PolitiFact National that the fees Nucatola discusses don’t appear geared to making a profit.", "Many of the sales are made to brokers -- middlemen who process the tissue and then sell it to researchers at significant markups. A vial of highly concentrated fetal liver cells, for example, can sell for about $24,000. The brokers say their prices reflect their high costs of buying medical equipment and employing skilled technicians.", "Now, let’s get back to Black’s claim that McCabe supports selling fetal tissue for profit.", "Chris Lore, Black’s legislative assistant, told us the senator’s statement isn’t based on any statement from McCabe explicitly supporting the practice. Instead, Lore said, it’s implicit by the support she’s received from Planned Parenthood.The group has endorsed McCabe and has given her a 100 percent rating. Lore also noted McCabe has been endorsed by NARAL Pro-Choice Virginia.", "In addition to those endorsements, Lore noted that amid the controversy, McCabe was quoted in a newspaper saying she still supports Planned Parenthood.", "\"You take those two facts into consideration and it seems her position is pretty clear,\" Lore said.", "Lore forwarded a copy of a Loudoun Times-Mirror story in which McCabe was asked about whether she still welcomed Planned Parenthood’s support in the wake of the controversy.", "\"I'm a doctor, and I take care of patients, including women,\" McCabe was quoted as saying. \"Women need health care choices and Planned Parenthood provides that. That's kind of the end of it for me.\"", "We contacted Lore a second time for more information. After we spoke with him, Black posted this message on Twitter: \"PolitiFact is desperate to give cover to @DrJillMcCabe to give cover for supporting late term abortions. #MediaLies #PPSellsBabyParts.\"", "We also reached out to McCabe to see what her position was on late term abortions and selling tissue for a profit. We heard back from Kyle Sutton, her campaign manager.", "\"Jill McCabe does not support late term abortions, but as a doctor she does understand that there are unfortunately circumstances where a pregnancy proceeding to full-term is not in the best health interest of either a mother, or child,\" Sutton wrote in an email.", "What about selling fetal tissue for profit?", "\"Jill does not support selling fetal tissue for profit, the same way she does not support any illegal activities, because they're illegal,\" Sutton wrote.", "We also asked McCabe if she supports Planned Parenthood providing tissue for research at cost, without a profit.", "\"As a doctor, Jill McCabe understands life-saving medical research,\" her campaign manager wrote in an email.", "In an Aug. 1 story in the Washington Post story said McCabe said she had seen the Planned Parenthood videos and found them \"concerning.\" But the newspaper also quoted her saying that \"Planned Parenthood is an important organization that provides vital services.\"", "Our ruling", "Sen. Dick Black says McCabe, \"supports late term abortions. Larger baby parts are more profitable.\"", "McCabe indicates she supports late term abortions in instances when it is \"in the best health interest\" of the mother or child. She says she opposes the sale of fetal tissue for profit.", "Black links McCabe’s qualified support for late term abortions to what he says is an effort to profit from the sale of \"large baby parts.\"  In effect, he’s accusing his opponent of supporting an illegal practice because U.S. law bans the sale of fetal tissue for profit.", "It’s incumbent of Black to prove his inflammatory claim and he offers nothing but speculation.", "We rate his statement Pants on Fire.", "Sen. Dick Black tweets, July 28-Aug 4, 2015.", "Interviews with Chris Lore, legislative assistant to Sen. Dick Black, July 30 and Aug. 6, 2015.", "Email from Chris Lore, Aug. July 30, 2015.", "Emails from Kyle Sutton, campaign manager for Jill McCabe, Aug. 4-6, 2015.", "PolitiFact, \"The planned parenthood video in context,\" July 17, 2015.", "Loudoun Times-Mirror, \"Flare-up over Planned Parenthood hits Senate rate in Loudoun,\" July 23, 2015.", "Planned Parenthood Action of Virginia, \"Planned Parenthood endorses Dr. Jill McCabe,\" July 13, 2015.", "Snopes.com, \"Fetal tissue sales,\" July 14, 2015.", "PolitiFact, \"PolitiFact sheet: 8 things to know about Planned Parenthood controversy,\" Aug. 5, 2015.", "Factcheck.org, \"Unspinning the Planned Parenthood video,\" July 21, 2015.", "University of Virginia Institutional Board for Health Sciences Research, \"Vulnerable subjects -- Pregnant women,\" accessed on Aug. 6, 2015.", "The Washington Post, \"Virginia Republicans revive talk of abortion in the wake of video stings,\" Aug. 1, 2015.", "United State Code, \"Prohibitions regarding human fetal tissue,\" accessed Aug. 7, 2015.", "The Bull Elephant, \"What is Democrat candidate Jill McCabe hiding?\" July 29, 2015.", "Vox, \"The Planned Parenthood controversy over aborted fetus body parts, explained,\" Aug. 4, 2015.", "The New York Times, \"Fetal tissue for research is traded in a gray zone,\" July 27, 2015.", "Planned Parenthood, \"Cecile Richards official video response,\" July 16, 2015.", "Planned Parenthood, \"Statement from Planned Parenthood on new undercover video,\" July 17, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]