["About this rating", "A decline in mail deliveries — a leading source of revenue for the agency — due to business shutdowns during the COVID-19 coronavirus disease pandemic is hurting USPS. The leader of the Postal Service said it could \"run out of cash\" by the end of September 2020.", "It is unclear how, or to what extent, those drops in revenue are adding to an already-troubled financial situation for the Postal Service, due in large part to a congressional mandate on how it funds employees' benefits, not COVID-19. Additionally, it's unknown how the lack of cash could affect USPS service or its mail carriers, and whether USPS leaders are seriously making plans to shut down the agency in its entirety.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, during an unprecedented interruption to the U.S. economy due to social-distancing restrictions to curb the spread of the COVID-19 coronavirus disease, the United States Postal Service (USPS) remained in operation. Canvassing city streets and rural roads with packages of prescriptions, food, and bills, the mail carriers provided a lifeline for many Americans who feared leaving their homes during the pandemic.", "Under the U.S. Constitution, the federally run Postal Service must serve all Americans equally regardless of where they live. But with a novel virus plaguing the country — spreading from person to person — that commitment to service came at a cost: 1,800 USPS employees had either tested positive for or were suspected to have caught COVID-19 as of April 25, according to the National Association of Letter Carriers. And more than 40 such workers had died.", "The virus' toll on employees' health was not the only pandemic-fueled problem for leaders of the Postal Service; a decline in mail deliveries — a leading source of revenue for the agency — due to business shutdowns raised worries that the national mail carrier would not economically recover from a coronavirus recession. From high-profile Democrats in Washington, D.C., to less-known musicians who said they rely on USPS to help them run independent labels, supporters across the country took to Twitter, Facebook, and Reddit to call attention to what they feared were limited days left for USPS.", "Many of the social media posts included calls to action. Supporters rushed to buy stamps, hoping any type of profit boost would stave off a collapse, or urged people to contact U.S. lawmakers and tell them to help the Postal Service with federal funds. As of April 28, almost 390,000 people had signed an online petition on Change.org to express their support for USPS, while more than 440,000 people had endorsed an open letter using an automated texting service (texted \"USPS\" to 50409) that promised to contact congressional representatives on behalf of petitioners. The letter states:", "In the age of COVID-19, having a healthy and strong postal service is more important than ever. More and more Americans are relying on the USPS to deliver medicines, food, and essentials now that social distancing is a matter of life and death.", "Seeing those pleas online, numerous people contacted Snopes to investigate the validity of the claim that the national mail carrier was, indeed, on the brink of closure due to the pandemic.", "The claim is multi-faceted, asserting that USPS could shutter soon, and that the coronavirus pandemic would be the reason why. To get to the root of each assertion, we began by analyzing the history of funding for USPS — which is an independent executive agency and has not received taxpayer funding in decades — and changes in how Americans rely on it.", "As online communication advanced between 2010 and 2020, USPS' volume of first-class and marketing mail decreased — a problem for the agency's bottom line because stamps and other postal products to send that type of mail make lucrative profit margins. Meanwhile, private competitors such as Amazon and FedEx grew in popularity and reach, raising USPS' package volume because the agency contracts with them (often for what's called the \"last mile\" of deliveries in rural or remote areas). Such shipments for the USPS increased from 3.1 billion in 2010 to 6.2 billion in 2018, federal data show.", "But market trends aside, the agency for years has run in the red, with a total of $143 billion in unfunded liabilities and debt as of fall 2018 (an amount that is double its annual revenue), according to the U.S Government Accountability Office. The debt, in large part, is a result of a congressional mandate on how the agency must fund retiree pensions and health benefits for employees. In 2006, under the George W. Bush' presidential administration and a Republican-led Congress, the federal government enacted the Postal Accountability and Enhancement Act, which forced USPS to add up what it expected to spend on the benefits over the next 50 years and then prepay that amount between 2007 and 2016. The math rounded out to an expense of about $5.6 billion annually. But in 2012, the agency began defaulting on the payments.", "That history aside, the pandemic is only hurting the agency's already-troubled financial situation. Addressing a group of congressional lawmakers in earlyApril 9, Postmaster General Megan Brennan said mail volume had dropped 30 percent in the early days of the crisis, and that she expected that decline to reach 50 percent by the end of June. For this fiscal year, which runs from October 2019 to September 2020, she said the Postal Service was preparing for a $13 billion revenue shortfall due \"directly to COVID-19\" in 2020 and an additional $54.3 billion in losses over 10 years.", "Considering those projections, she said the agency could \"run out of cash this fiscal year\" (or the end of September) without federal intervention. \"The sudden drop in mail volumes, our most profitable revenue stream, is steep and may never fully recover,\" she later told The New York Times.", "Further details on the potential downturn were unknown; it was not explained where, or to what extent, regions may first notice interrupted USPS service due to the profit loss, nor if the agency would maintain its existing payroll of some 640,000 employees or close all together.", "Using the COVID-19 outbreak in their rationale, some lawmakers — primarily U.S. House Democrats — attempted to rally support for and extend more federal money to help USPS in spring 2020. Among leaders of the public outcry was Rep. Gerald Connolly, D-Va., who is a member of the House government operations committee that oversees the Postal Service. He told the Washington Post:", "\"I’m so frustrated at how difficult it has been for a long time to galvanize attention and action around an essential service,' he said. 'And maybe the pandemic forces us all to refocus on this service and how essential it is and how we need to fix it while we can before it gets into critical condition.\"", "The requests came to a head in March 2020 during negotiations over a $2.2 trillion COVID-19 economic relief package, called the Coronavirus Aid, Relief, and Economic Security (CARES) Act. Initially, lawmakers agreed to set aside $13 billion in federal dollars for USPS that the agency would not have to repay. But purportedly at the urging of Treasury Secretary Steven Mnuchin and aids to U.S. President Donald Trump, congressional leaders removed that provision from the CARES Act — while leaving its funding boosts to help small businesses, passenger airlines and air cargo carriers, and most U.S. taxpayers via one-time stimulus checks, among other provisions that aimed to jump-start the economy.", "According to a senior Trump administration official and a congressional official, Trump would have vetoed the entire bill if it had contained any such funding to help the postal agency, The Washington Post reported. \"We told them very clearly that the president was not going to sign the bill if [money for the Postal Service] was in it,\" the Trump administration official said.", "In last-round debates over what to include in the CARES Act, however, a bipartisan pair of senators (Gary Peters, D-Mich., and Ron Johnson, R-Wis.) proposed what some federal leaders considered a compromise between Trump and USPS advocates: a $10 billion loan to help the agency cover operating expenses through the spring of 2020. Trump signed the CARES Act into law on March 27, including the provision that read:", "But, as of mid-April, the Postal Service did not have access to the funds. Despite Trump's approval of the legislation, the USPS-specific provision required additional signatures from both him and Mnuchin before the agency could request the loan money. While signing off on other aspects of the federal stimulus bill on April 24, Trump said he will not sign the loan unless the service fulfills his long-standing request to raise prices on shipping and postal materials to cover its debt — a call to action based on a false assertion that the service loses money by delivering for Amazon. (Government analysts have said that type of price change could lead to private delivery competitors swooping in on USPS' business and, perhaps, offering cheaper prices for easy city routes and less options for rural Americans, and it would only raise a marginal amount of new revenue compared to USPS' total debt.) At the signing, Trump said:", "The Postal Service is a joke because they’re handing out packages for Amazon and other Internet companies. And every time they bring a package, they lose money on it ... The post office should raise the price of a package by approximately four times. ... If they don’t raise the price, I’m not signing anything.", "Hours later, he followed up with a tweet:", "But for House Democrats, including Speaker Nancy Pelosi, D-Calif., the $10 billion loan is just the tip of the iceberg to get the Postal Service on solid financial footing and maintain existing functions beyond September 2020. \"They don’t need more debt capacity, they need debt forgiveness,\" said Rep. Carolyn Maloney, a Democrat from New York who chairs the House committee that oversees the U.S. Postal Service, to a news outlet for federal workers.", "In a future stimulus package to mitigate the effects of the COVID-19 outbreak, several lawmakers in April proposed an $89 billion bailout for USPS — including $25 billion to offset lost revenue from declining shipments during the pandemic, $25 billion to modernize the agency's aging infrastructure, a $25 billion loan and a new system for paying $14 billion in debt. The Trump-appointed Postal Service Board of Governors, which includes three Republicans and two Democrats, unanimously approved of the request.", "'The Postal Service is holding on for dear life,' Maloney said in a statement. ''Unless Congress and the White House provide meaningful relief in the next stimulus bill, the Postal Service could cease to exist.'", "But as of mid-April, the U.S. Treasury secretary suggested that if lawmakers fulfilled any such funding requests in the next COVID-19 stimulus package, the language to help the USPS \"would amount to a poison pill,\" the Post reported. A congressional staffer told the newspaper the Republican-led Senate would not vote to extend more federal dollars to an agency \"unlikely to make good on its borrowing\".", "For decades, conservative Republicans have pushed for USPS to privatize its delivery services, a move they argue would appropriately remove government from a service that should be left to the private commercial market. Meanwhile, opponents fear dismantling universal mail service would disproportionately affect millions of Americans who live in rural areas, where private companies such as FedEx and UPS either charge higher rates or do no shipments at all.", "Since the early days of his presidential election, Trump has taken aim at the Postal Service, once calling the agency Amazon's \"delivery boy\" in a tweet. Some lawmakers, postal union representatives, and other supporters worry those types of remarks are a political performance behind the longstanding effort to push the mail carrier toward privatization — which the federal government could do by leveraging federal-loan dollars or forcing USPS to file bankruptcy.", "'Right now, I see a big danger for our country in the form of the administration’s interest in privatizing the post office,' House Speaker Nancy Pelosi, D-Calif., told reporters after Trump called USPS 'a joke' on April 24. 'This is just about somebody on the outside making money off the post office instead of recognizing the important role [it] plays.'", "Among those services, USPS and its database of every American's postal information plays a critical role in local, state, and federal elections. About one-third of states allow voters to cast ballots by mail in elections if they have certain disabilities or travel plans for Election Day, while a handful of states allow all residents to mail in their ballots. But in 2020, under rules to limit in-person contact, lawmakers are exploring proposals that would establish vote-by-mail systems in all states for the year's presidential election.", "Trump has long opposed vote-by-mail initiatives, falsely claiming that they lead to an increase in voter fraud. He has stated: If the U.S. transitioned to all-mail voting, \"you'd never have a Republican elected in this country again,\" yet election experts have said there is no evidence to support that argument.", "In sum, given the Postal Service's massive debt before the global COVID-19 outbreak, as well as the opportunities by federal leaders to provide economic relief for USPS, and USPS leaders' lack of clarity on what would happen if the agency did \"run out of cash\" this year, we rate this claim \"Mixture.\"", "Anderson, Sarah, et. al.   “How Congress Manufactured a Postal Crisis — And How to Fix it”.\r\n   Institute for Policy Studies.   15 July 2019.", "Associated Press.   “Advocates start work to save post office”.\r\n   18 February 2017.", "Benen, Steve.   “On USPS, Trump peddles false claim, impertinent threat”.\r\n   MSNBC.   27 April 2020.", "Bogage, Jacob.   “White House rejects bailout for U.S. Postal Service battered by coronavirus”.\r\n   Washington Post.   11 April 2020.", "Colvin, Jill.   “Trump convenes task force to study US Postal Service”.\r\n   Associated Press.   13 April 2018.", "Congress.gov.   “H.R. 6407 - Postal Accountability and Enhancement Act”.\r\n   109th Congress.   Accessed 27 April 2020.", "Congress.gov.   “H.R. 2382 - USPS Fairness Act”.\r\n   116th Congress.   Accessed 27 April 2020.", "Epstein, Reid J. and Saul, Stephanie.   “Does Vote-by-Mail Favor Democrats? No. It’s a False Argument by Trump”.\r\n   New York Times.   10 April 2020.", "Fandos, Nicholas and Tankersley, Jim.   “Coronavirus Is Threatening One of Government’s Steadiest Services: The Mail”.\r\n   The New York Times.   9 April 2020.", "Fredericks, Bob.   “Trump calls US Postal Service ‘a joke,’ says it needs to raise rates”.\r\n   New York Post.   24 April 2020.", "Goodkind, Nicole.   “Joe Biden may be the USPS’s only hope—if it can survive until November”.\r\n   Fortune.   27 April 2020.", "Goodkind, Nicole.   “USPS warns it might have to shutter by June as $2 trillion coronavirus stimulus package provides no funding”.\r\n   Fortune.   30 March 2020.", "Heckman, Jory.   “USPS reports postal employees’ deaths from coronavirus, ‘not immune’ to financial downturn”.\r\n   Federal news Network.   1 April 2020.", "Institute for Policy Studies.   “Who Would Pay the Biggest Price for Postal Privatization?”\r\n   December 2018.", "Jameel, Maryam.   “Letter Carriers Say the Postal Service Pressured Them to Deliver Mail Despite Coronavirus Symptoms — and Often Without Hand Sanitizer”.\r\n   ProPublica.   18 March 2020.", "LaRocco, Lori Ann.   “The Truth About The Post Office’s Financial Mess”.\r\n   CNBC.   24 October 2011.", "Lewis, Sophie.   “US Postal Service could shut down by June, lawmakers warn”.\r\n   CBS News.   3 April 2020.", "Maloney, Carolyn.   “House Democrats Act Rapidly to Save Postal Service from Bankruptcy As a Result of Coronavirus Crisis”.\r\n   Committee on Oversight and Reform.   23 March 2020.", "Mosley, Tonya and Raphelson, Samantha.   “U.S. Postal Service Stands To Suffer Huge Losses From Coronavirus Pandemic”.\r\n   WBUR.   21 April 2020.", "New York Times Editorial Board.   “What’s an Essential Service in a Pandemic? The Post Office”.\r\n   New York Times.   14 April 2020.", "Norden, Lawrence, et. al.   “Estimated Costs of Covid-19 Election Resiliency Measures”.\r\n   Brennan Center.   18 April 2020.", "Panetta, Grace.   “Trump reportedly rejected approving a bailout package that would rescue the US Postal Service, and it could be a disaster for states trying to expand voting by mail”.\r\n   Business Insider.   12 April 2020.", "Pecorin, Allison.   “Partisan battle erupts over US Postal Service as some look to mail-in ballots amid pandemic”.\r\n   ABC News.   28 April 2020.", "Premack, Rachel.   “Lawmakers are sounding the alarm on the coronavirus shuttering the USPS by June — and it could mean chaos for your Amazon deliveries”.\r\n   Business Insider.   25 March 2020.", "Rein, Lisa and Bogage, Jacob.   “Trump says he will block coronavirus aid for U.S. Postal Service if it doesn’t hike prices immediately”.\r\n   Washington Post.   24 April 2020.", "Rolando, Fredric.   “Statement by NALC President Fredric Rolando: The Postal Service is vital in this crisis”.\r\n   National Association of Letter Carriers, AFL-CIO.   27 March 2020.", "USPS.   “Service Alerts”.\r\n   24 April 2020.", "United States Postal Service, Office of Inspector General.   “Update for Measuring Pension and Retiree Health Benefits Liabilities”.\r\n   2 May 2017.", "Task Force on the United States Postal System.   “United States Postal Service: A sustainable Path Forward”.\r\n   4 December 2018.", "Wise, Lindsay and Andrews, Natalie.   “Democrats Push for Voting by Mail Amid Coronavirus Pandemic”.\r\n   Wall Street Journal.   1 April 2020.", "Winegrove, Josh and Fabian, Jordan.    “Trump Says ‘Joke’ Postal Service Should Boost Rates for Amazon”.\r\n   Bloomberg.   24 April 2020.", "Committee on Oversight and Reform.   “Postmaster General Warns Committee of Dire Consequences Without Congressional Action”.\r\n   Committee on Oversight and Reform.   9 April 2020.", "Congress.gov.   “H.R.748 – CARES Act.”\r\n    Accessed 28 April 2020.", "This report was updated on Aug. 19, 2020, to say the 2006 Postal Accountability and Enhancement Act forced the USPS to add up what it expected to spend on the benefits over the next 50 years, not 75 years.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]