["“THE STRIPES ON THIS MAN'S UNIFORM ARE WORN BY ONLY ‘ONE MAN’ IN THE ENTIRE USAF, THE ‘CHIEF MASTER SERGEANT OF THE UNITED STATES AIR FORCE',” says the January 2020 Facebook post, which has been shared here, here and here.", "“THIS MAN PUT HIS NAME AND PICTURE TO WHAT HE HAD TO SAY,” it says.", "But he didn’t.", "The text used in the post was actually written by a long-serving US Air Force member, George Roof, who retired in 1994 with the rank of Chief Master Sergeant. But Roof did not attribute it to the Chief Master Sergeant of the Air Force, a distinct position created 53 years ago to give a voice on the headquarters staff to members of the enlisted ranks.", "A reverse image search shows that the picture attached to the post is of Wright, who is a black man.", "A nearly identically-worded post from 2017 included a picture of a white man, whom a reverse image search identified as Wright’s predecessor James Cody. He retired in 2017, but the post with his picture has been shared 1,600 times and was still circulating here as recently as May 2020.", "An Air Force spokesperson told AFP by email that the person behind the Facebook post “is using photos of the current Chief Master Sergeant of the Air Force, Chief Master Sergeant Kaleth O Wright and now Former CMSAF, James Cody, for his posts.”", "The post voices the writer’s opinions about past presidents and other politicians since his enlistment in the 1960s and service in Vietnam. It includes the debunked claim that Obama was not born in the United States, and concludes with an endorsement of Trump.", "“Donald Trump may NOT be the best person for the job, but he's such a welcome respite from the candy-assed wimps who've been running the swamp that it's refreshing to see,” it says.", "“If he only does half of what he's promised, we'll still be legions ahead of where Obama has dragged us.”", "Roof, a Delaware resident and retired taxidermist, told AFP by phone that he wrote the original post. The 74-year-old said he initially published it on a taxidermy internet forum without a picture late in 2016 before moving it to Facebook.", "Shortly afterward, Roof said, a person whom he did not know edited the post and somehow “tied in” to a website picturing the Air Force’s top enlisted member.", "“That’s not my picture,” he said.", "“I don't know how he did it but each time there's a new Chief Master Sergeant of the Air Force, that picture's gonna show up because he added it to it,\" Roof said, pointing out that he issued a “disclaimer post” later, which has been shared 1,500 times, including here.", "“I never once tried to say I was a chief master sergeant of the air force. I was just a chief master sergeant,” Roof emphasized.", "“My integrity ended up getting questioned in the long run.”", "Roof said he served as an engine mechanic in Vietnam, and in other capacities including as a cartoonist, before finishing his 29 years of service at Dover Air Force Base in Delaware.", "​The Air Force confirmed that Roof, whose decorations include the Meritorious Service Medal, left the service in 1994 as a chief master sergeant at Dover, where he held the title of propulsion branch manager.", "Although Wright did not author the Facebook post that falsely bears his photo, he has written publicly on a different topic -- the death of George Floyd and other African Americans at the hands of police, alongside the problem of “racial injustice and diversity” in Air Force ranks.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]