["About this rating", "On 6 March 2016, the web site Higher Perspectives attributed the following quote to actor Keanu Reeves:", "I cannot be part of a world where men dress their wives as prostitutes by showing everything that should be cherished. Where there is no concept of honour and dignity, and one can only rely on those when they say \"I promise\" . Where women do not want children, and men don't want a family. Where the suckers believe themselves to be successful behind the wheel of their fathers` cars, and a father who has a little bit of power is trying to prove to you that you're a nobody. Where people falsely declare that they believe in God with a shot of alcohol in their hand, and the lack of any understanding of their religion. Where the concept of jealousy is considered shameful, and modesty is a disadvantage. Where people forgot about love, but simply looking for the best partner. Where people repair every rustle of their car, not sparing any money nor time, and themselves , they look so poor that only an expensive car can hide it. Where the boys waste their parents money in nightclubs, aping under the primitive sounds, and girls fall in love with them for this. Where men and women are no longer ago identifiable and where all this together is called freedom of choice, but for those who choose a different path-get branded as retarded despots. I choose my path, but it's a pity that I did not find similar understanding in the people among whom I wished to find it most of all ...", "The item was suspiciously sourced not to an interview, but to a fan page on Facebook for Reeves. Celebrity fan pages notoriously spread misattributed quotes for famous people in order to accrue social media engagement. The attribution wasn't unique to that page, however, as a captioned video published to YouTube in September 2015 made the same claim:", "However, an unaltered version of the video depicted Reeves discussing an art exhibit:", "Before the quote was attributed to Reeves, it appeared elsewhere on the internet and was attributed to its original poster at that time, not Reeves. From there, the item became popular on Arabic-language and Islam-related pages and groups:", "\"I cannot be part of a world where men dress their wives as prostitutes by showing everything that should be cherished....", "Posted by The scientific miracles of Islam on Tuesday, March 1, 2016", "We were ultimately unable to turn up any interviews, footage, or other media in which Reeves uttered the quote — or anything resembling it. The comments largely circulated on Arabic-language web sites until they were, for whatever reason, attributed to Reeves. However, there's no evidence the words are his, nor do they resemble anything he's said in the past.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]