["About this rating", "A photograph purportedly showing the remains of a man who perished during the volcanic eruption that destroyed the Roman city of Pompeii in 79 A.D. was posted in July 2017 along with the caption \"masturbating man\":", "Although this is a real -- though slightly doctored -- image showing a plaster cast of a man who perished in Pompeii, the juvenile caption caused many to second-guess the image's authenticity.", "The original photograph, which was in color, was posted on the Instagram page of the Archaeological Heritage of Naples and Pompeii on 9 June 2017:", "Calco in gesso di una vittima dell'eruzione.\nPh Direttore Generale Prof. Massimo Osanna\n#Pompei #Pompeii #PompeiiTempusVita", "Plaster cast of a victim of the eruption.\nPh General Manager Prof. Massimo Osanna\n#Pompei #Pompeii #PompeiiTempusVita", "The caption did not mention that this man was masturbating in his last moments. In fact, this pose hints at something far more terrifying.", "When Mount Vesuvius erupted, it sent a surge of super-heated volcanic material through the city of Pompeii. About 2000 people were killed and the city was buried in a thick carpet of volcanic ash. The heat was so intense that many of the victims suffered sudden muscle contractions and were left frozen in a boxer-like, crouching pose:", "The famous lifelike poses of many victims at Pompeii -- seated with face in hands, crawling, kneeling on a mother's lap -- are helping to lead scientists toward a new interpretation of how these ancient Romans died in the A.D. 79 eruptions of Italy's Mount Vesuvius.", "Until now it's been widely assumed that most of the victims were asphyxiated by volcanic ash and gas. But a recent study says most died instantly of extreme heat, with many casualties shocked into a sort of instant rigor mortis ...", "And then there are those death postures. About three-quarters of the known Pompeii victims are \"frozen in suspended actions\" and show evidence of sudden muscle contractions, such as curled toes, the study says.", "\"Heretofore archaeologists misinterpreted them as people struggling to breathe and believed they died suffocated by ashes,\" Mastrolorenzo said. \"Now we know that couldn't be.\"", "Because of the extreme heat, \"when the pyroclastic surge hit Pompeii, there was no time to suffocate,\" he said. \"The contorted postures are not the effects of a long agony, but of the cadaveric spasm, a consequence of heat shock on corpses.\"", "The pose is not entirely unique among Pompeii victims. This image, taken in 2013 by Flickr user Paul Kelley, shows another victim in a similar position:", "Radford, Tim.   \"Science Uncovers Secrets of Past Disasters.\"\r\n    The Guardian.   12 April 2001.", "Valsecchi, Maria.   \"Pompeiians Flash-Heated to Death — 'No Time to Suffocate.'\"\r\n    National Geographic.   5 November 2010.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]