["By Eugene Kiely", "Posted on August 23, 2016", "Hillary Clinton’s campaign manager, Robby Mook, made the baseless insinuation that Donald Trump compromised national security by inviting a man with Russian ties to his intelligence briefing.", "Appearing on ABC News’ “This Week,” Mook said Trump was accompanied to his first intelligence briefing on Aug. 17 by “someone who’s on the payroll of the Russia Times, which is a basically a propaganda arm of the Kremlin.” Mook claimed this “gentleman” — whom he did not name — “was sitting two seats away from Vladimir Putin” at RT’s 10th anniversary gala in December, and he demanded that Trump disclose “whether his advisers are having meetings with the Kremlin.”", "Who is this mysterious, unnamed gentleman? The Clinton campaign told us Mook was referring to retired Lt. Gen. Michael Flynn, who until two years ago was director of the Defense Intelligence Agency under President Barack Obama.", "Flynn is not “on the payroll of the Russia Times.” He was merely one of many speakers at RT’s anniversary conference on Dec. 10, 2015, in Moscow. RT is a Russian government-funded TV station once known as Russia Today.", "Mook made his misleading assertion about Flynn shortly after he claimed that “real questions being raised about whether Donald Trump himself is just a puppet for the Kremlin.” Host George Stephanopoulos questioned Mook about that claim — which has been part of the Clinton campaign’s attacks on Trump ever since it was reported that Russia was likely behind the successful attacks on computer servers at the Democratic National Committee and the release of DNC emails.", "Stephanopoulos: You’re saying he’s a puppet for the Kremlin?", "Mook: Well, real questions are being raised about that. We — again, there’s a web of financial ties to the Russians that he refuses to disclose. We’ve seen over the last few week, him parroted Vladimir Putin in his own remarks. We saw the Republican Party platform changed. She saw Donald Trump talk about leaving NATO and leaving our Eastern European allies vulnerable to a Russian attack. The gentleman he brought with him to his security briefing just last week is someone who’s on the payroll of the Russia Times, which is a basically a propaganda arm of the Kremlin. He was sitting two seats away from Vladimir Putin at their 10th anniversary gala.", "There are a lot of questions here. And we need Donald Trump to disclose all of his financial ties and whether his advisers are having meetings with the Kremlin.", "Trump has praised Putin and has called for improved relations with Russia, but he has denied that he has had any financial ties with Russia beyond holding the Miss Universe Pageant in Moscow in 2013. Also, Trump’s personal financial disclosure report required of all presidential candidates does not show any investments in Russia.", "However, Paul Manafort, who until last week was Trump’s campaign chairman, did have business dealings with Russian-aligned leaders in Ukraine, as uncovered by the New York Times. With Manafort gone, Mook redirected the campaign’s guilt-by-association attack on Trump by questioning Flynn’s associations with the Kremlin.", "Trump was joined at his first intelligence briefing on Aug. 17 at FBI headquarters in New York City by Flynn and New Jersey Gov. Chris Christie. As Huffington Post wrote, Flynn “was paid by a Russian state-funded television network to speak at its 10th-anniversary gala,” and Putin attended that conference. Reuters reported that Flynn “was pictured sitting at the head table with Putin” at the conference.", "In an Aug. 15 article, Flynn told the Washington Post that his speaking engagement was arranged by his speaker’s bureau and that he was paid for it. He said he was introduced to Putin, but did not speak to him.", "Flynn was one of many speakers at the conference. Others included former London Mayor Ken Livingstone, Green Party presidential nominee Jill Stein and liberal U.S. media commentator Thom Hartmann.", "Flynn sat for a one-on-one Q&A with RT correspondent Sophie Shevardnadze on the Islamic State terrorist group and the crisis in the Middle East. His conference topic coincided with the announcement that he is writing a book with Michael Ledeen on the Middle East called “The Field of Fight: How We Can Win the Global War Against Radical Islam and Its Allies.”", "The Clinton campaign provided no evidence that Flynn is “on the payroll” of RT or that he is “having meetings with the Kremlin,” as Mook alleged. It forwarded us a Politico story from May that said Flynn “makes semi-regular appearances on RT as an analyst.” Politico wrote that Flynn is “presumably” paid for those TV appearances, but the retired lieutenant general told the Post that he is not paid by RT or any other TV stations, because “I want to be able to speak freely about what I believe.”", "Steve Sestanovich, a senior fellow for Russian and Eurasian studies at the Council on Foreign Relations, told us that Flynn’s appearance at the conference certainly raises a question about Flynn’s “judgment and good sense,” but it probably doesn’t make him a security risk.", "Flynn served for more than three decades in the military, including in Afghanistan and Iraq. He became the director of the Defense Intelligence Agency under Obama in July 2012. He was asked to resign after two years and quickly became one of the Obama administration’s most vocal critics on foreign policy. “I was asked to step down,” Flynn admitted in an interview with Foreign Policy. “It wasn’t necessarily the timing that I wanted, but I understand.”", "Trump reportedly considered Flynn during his search for a vice presidential candidate, but ultimately picked Indiana Gov. Mike Pence.", "The Clinton campaign certainly has legitimate questions it can raise about Trump’s foreign policy positions, such as his comments that he would “certainly look at” pulling the United States out of NATO, because it is “obsolete” and “is costing us a fortune.” But Mook goes too far in falsely claiming that Flynn is “on the payroll” of the government-funded Russia TV station and insinuating without evidence that the retired United States Army lieutenant general is a security risk.", "https://www.sharethefacts.co/share/bc5ba499-7ee5-4a42-b789-4c4fa7ea8912", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]