["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Harry Potter author J.K. Rowling took to Twitter to accuse President Donald Trump of ignoring a disabled child at a press conference, but she was basing her outrage on a highly edited video that left out Trump’s greeting.", "Trump invited the family of 3-year-old Monty Weer to the White House on July 24, 2017, while the president gave a speech on health care reform.", "Monty Weer has spina bifida, a birth defect in which the spinal cord is not completely formed. He is confined to a wheelchair and requires medical treatment, but Trump said the Weer family’s options were limited because there is only one choice of health insurance provider where they live in South Carolina. Trump said there weren’t more options because of the Affordable Care Act. (The family also has acknowledged parts of the law have helped them, too.)", "A video circulated on the Internet after Trump’s speech, showing Trump not shaking Monty Weer’s hand as Trump walked by. The original has since been deleted, but you can watch a similar video here:", "Rowling saw the video and retweeted it, then tweeted several more times about her anger over the apparent snub.", "\"Trump imitated a disabled reporter. Now he pretends not to see a child in a wheelchair, as though frightened he might catch his condition,\" she tweeted on July 28, 2017. (There’s an archived version here.)", "Trump imitated a disabled reporter. Now he pretends not to see a child in a wheelchair, as though frightened he might catch his condition.", "\"My mother used a wheelchair. I witnessed people uncomfortable around her disability, but if they had a shred of decency they got over it,\" she continued. \"So, yes, that clip of Trump looking deliberately over a disabled child's head, ignoring his outstretched hand, has touched me on the raw.\"", "So, yes, that clip of Trump looking deliberately over a disabled child's head, ignoring his outstretched hand, has touched me on the raw. /2", "\"That man occupies the most powerful office in the free world and his daily outrages against civilised norms are having a corrosive effect,\" she added. \"How stunning, and how horrible, that Trump cannot bring himself to shake the hand of a small boy who only wanted to touch the President.\"", "Except that the unedited White House video showed that Trump did greet the boy, bending down to speak to him as he walked up to the podium (starting at about 2:18 in the video below):", "Twitter users attacked Rowling for her ire, demanding she delete the tweets and apologize to Trump, whom she regularly attacks on the social media site. As of this writing, Rowling had done neither. We tried to contact her through her publicist’s email but did not get a response. (Editor's note: After publication, Rowling deleted the tweets and apologized to the boy and his family. See the After the Fact below for more.)", "British journalist Piers Morgan was one of the more outspoken critics, posting numerous times that Rowling had lied about Trump. (He also attacked Chelsea Clinton, who had been fooled by the same edited video but later acknowledged her mistake.)", "Morgan posted an image being spread on the Internet of a Facebook status attributed to Monty Weer’s mother, Marjorie Weer, addressing Rowling and saying \"Trump didn’t snub my son & Monty wasn’t even trying to shake his hand.\"", "The image said \"hand shaking is not his thing\" because he’s so young and that \"he was showing off his newly acquired secret service patch.\" We traced the image to a July 30 Reddit post, but couldn’t independently verify that Marjorie Weer had actually written it on Facebook.", "Rowling said Trump was seen \"looking deliberately over a disabled child's head, ignoring his outstretched hand.\"", "Her tweets were based on an edited video of a White House press conference that had circulated online. The full video of the event showed Trump did greet a 3-year-old boy with spina bifida. In her rush to defend a disabled child, Rowling reacted to only a snippet of video, without taking the entire event into consideration. She also did not respond to calls for her to recant her criticism.", "We rate Rowling’s claim Pants on Fire.", "Twitter, J.K. Rowling tweets, July 28, 2017", "YouTube, \"President Trump Gives a Statement on Healthcare,\" July 24, 2017", "Fox News, \"ObamaCare victim who met with Trump shares her story,\" July 25, 2017", "YouTube, \"Trump Ignores Disabled Boy who holds out had to Shake,\" July 28, 2017", "Twitter, Piers Morgan tweets, July 28, 2017", "Reddit, r/The_Donald/ post, July 30, 2017", "Charleston Post and Courier, \"For one South Carolina family, the health care debate is messy, confusing and not so cut-and-dry,\" July 30, 2017", "RawStory.com, \"Harry Potter author criticized for not removing tweets on Trump,\" July 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]