["About this rating", "At the beginning of May 2020, widely circulated social media posts asserted that the U.S. Centers for Disease Control and Prevention (CDC) had substantially revised their figures for the number of deaths in the U.S. caused by the COVID-19 coronavirus disease, from 60,000 down to about 37,000:", "These posts fed into conspiracy theories holding that the COVID-19 pandemic was not nearly as serious as suggested by the government and the news media, and that the \"true\" mortality figures were being deceptively inflated to achieve some ulterior purpose.", "However, this claim was not true, and it was the result of comparing two separate data sources that report different measurements.", "The link included in the above tweet points to the CDC's Provisional Death Counts for Coronavirus Disease (COVID-19) page, which provides provisional death totals by week and state according to the following criteria:", "The provisional data presented on this page include the weekly provisional count of deaths in the United States due to COVID-19, deaths from all causes and percent of expected deaths (i.e., number of deaths received over number of deaths expected based on data from previous years), pneumonia deaths (excluding pneumonia deaths involving influenza), pneumonia deaths involving COVID-19, influenza deaths, and deaths involving pneumonia, influenza, or COVID-19; (a) by week ending date and (b) by specific jurisdictions.", "As of May 1, 2020, that page reported the total number of COVID-19 deaths in the U.S. as being 37,308:", "However, that page also notes that the provisional data it displays are continually revised, may be incomplete, likely will not include more recent deaths, and may differ from other published sources because data currently are lagged by an average of 1–2 weeks:", "The provisional counts for coronavirus disease (COVID-19) deaths are based on a current flow of mortality data in the National Vital Statistics System. National provisional counts include deaths occurring within the 50 states and the District of Columbia that have been received and coded as of the date specified. It is important to note that it can take several weeks for death records to be submitted to National Center for Health Statistics (NCHS), processed, coded, and tabulated. Therefore, the data shown on this page may be incomplete, and will likely not include all deaths that occurred during a given time period, especially for the more recent time periods. Death counts for earlier weeks are continually revised and may increase or decrease as new and updated death certificate data are received from the states by NCHS. COVID-19 death counts shown here may differ from other published sources, as data currently are lagged by an average of 1–2 weeks.", "Provisional death counts may not match counts from other sources, such as media reports or numbers from county health departments. Our counts often track 1–2 weeks behind other data for a number of reasons: Death certificates take time to be completed. There are many steps involved in completing and submitting a death certificate. Waiting for test results can create additional delays. States report at different rates. Currently, 63% of all U.S. deaths are reported within 10 days of the date of death, but there is significant variation among jurisdictions. It takes extra time to code COVID-19 deaths. While 80% of deaths are electronically processed and coded by NCHS within minutes, most deaths from COVID-19 must be coded manually, which takes an average of 7 days. Other reporting systems use different definitions or methods for counting deaths.", "That 37,308 was not a drastic downward revision of any previously reported death total.  Rather, it only might have seemed such because it was mistakenly compared to the number of deaths reported on the CDC's COVID-19 Cases in the U.S. page, which as of May 3, 2020, displayed a total of 65,735 deaths:", "Why such a large discrepancy?  Because as latter page's \"About the Data\" section explains, its data are updated daily based on \"Case notifications received by CDC from U.S. public health jurisdictions and the National Notifiable Diseases Surveillance System (NNDSS)\" and includes \"both confirmed and probable deaths.\"  This more up-to-date page will obviously report higher death figures that one whose data lag by 1-2 weeks.", "Indeed, two weeks earlier, the \"Cases in the U.S.\" page had displayed a total of 35,443 deaths, a number much closer to the 37,308 figure reported by the \"Provisional Death Counts\" with its 1-2 week data lag.", "In short, this claim is like comparing stock prices from a two-week-old newspaper with those offered today by a cable news station, and then attributing any differences to a conspiracy rather than the mere passage of time as reflected in more current reporting.", "Centers for Disease Control and Prevention.   \"Provisional Death Counts for Coronavirus Disease (COVID-19).\"\r\n    Accessed 3 May 2020.", "Centers for Disease Control and Prevention.   \"Cases in the U.S.\"\r\n    Accessed 3 May 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]