["About this rating", "On 31 March 2018, Snowriders Australia, a web site dedicated to ski and snowboarding enthusiasts, posted a story reporting the Environmental Protection Agency will ban manufactured snow after scientists discovered it \"contains high concentrations\" of di-hydrogen monoxide (DHMO):", "Widespread but little known, DHMO is lethal when inhaled, corrodes metal and may form blistering vapours when heated.", "“These findings are extremely alarming”, said University spokesman, Dr Alan Rainmaker. “The use of DHMO – which consists of two hydrogen atoms and one oxygen atom – is unfortunately commonplace in the snow-sports industry, with some resorts using concentrations as high as 100%”.", "“It’s no wonder people’s edges rust during the off season”, he added.", "The story is an apparent April Fool's prank playing on a long-running hoax. But some readers expressed concern about encountering \"lethal\" DHMO while enjoying winter sports. However, dihydrogen monoxide is H2O — in other words, water.", "The hoax has been fooling people for years. In 2004, city officials in Aliso Viejo, an affluent city in Orange County, California nearly banned foam cups after falling for it and learning DHMO was used in the manufacturing process from a prank web site, DHMO.org (a careful inspection reveals a small disclaimer, \"Content veracity not implied\" at the bottom of the site).", "But the hoax has been floating around since before the Internet even existed as we know it. It made an appearance as far back as 1983, in the now-closed Michigan weekly paper The Durrant Express as an April Fool's Day joke. The article warned that inhaling the chemical could be deadly, which is of course true as inhaling water can cause death by drowning.", "Associated Press. \"Local Officials Nearly Fall for H2O Hoax.\"\r\n  15 March 2004.", "Glassman, James K. \"Dihydrogen Monoxide: Unrecognized Killer.\"\r\n  The Washington Post. 21 October 1997.", "Ferro, Shaunacy. \"The 14-Year-Old Who Convinced People to Ban Dihydrogen Monoxide.\"\r\n  MentalFloss.com. 17 June 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]