["About this rating", "Does the Massachusetts Institute of Technology, an American bastion of serious scientific research with dozens of Nobel laureates among its alumni, really offer its over-achieving students something called a \"Pirate Certificate\"?", "That's the claim that the History Hustle Facebook page makes in a widely-shared January 2018 meme that reads:", "Want to be a pirate? Massachusetts Institute of Technology awards official \"Pirate Certificates\" to students who complete courses in archery, pistol shooting, sailing and fencing.", "It's true. Since the Fall semester of 2011, the university's Physical Education department has been handing out physical \"pirate certificates\" to any student -- undergraduate or graduate -- who has successfully completed courses in archery, fencing, pistol/rifle shooting and sailing.", "The department appears to hold frequent \"Pirate Induction\" days; and its Facebook page shows a fairly steady stream of extremely happy-looking MIT students showing off their new pirate certificates, invariably dressed in pirate garb, some of which appears to be provided by the school for the occasion.", "The certificate itself is made of \"faux parchment,\" according to the Slice of MIT alumni blog, and has this tongue-in-cheek wording:", "This document certifies that the below-mentioned salty dog has fulfilled the Physical Education General Institute Requirement by completing Archery, Fencing, Pistol and Sailing [and] therefore is no longer a lily-livered landlubber. And so, MIT Physical Education Confers upon [STUDENT'S NAME] The Pirate Certificate, with all its privileges and obligations. Given at the swashbucklin' Massachusetts Institute of Technology.\nAhoy, Avast and finally, Arrrrrr!", "(Courtesy of Jacob Hurwitz.)", "Jacob Hurwitz -- a 2014 MIT graduate and proud owner of the document shown above -- told us that the pirate certificate was a \"legend\" that had \"been around\" forever, with some students reputedly printing off t-shirts claiming to be pirates, after completing the four key physical education courses.", "\"As best as I can tell,\" Hurwitz told us by email, \"the pirate's license was probably a joke invented by students\" before being made official by university authorities.", "A survey sent out to students in late 2010 shows that the pirate certificate had been requested by a \"student focus group,\" and that the names \"pirate award\" and \"pirate degree\" were also considered.", "Despite not fulfilling the criteria by completing the four physical education prerequisites, Matt Damon became the most famous recipient of the MIT pirate certificate to date, when he attended the university's graduation ceremony in 2016 and delivered the commencement address:", "Duvergne Smith, Nancy.  \"Arrrrr! MIT Pirates Certified.\"\r\n    Slice of MIT.   8 March 2012.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]