["The earliest picture was posted by a Facebook user by the name Zevi Gins on June 10, 2018, and has been shared by over 47,000 people. The picture was captioned “NIGERIAN MAN AZUBUIKE BURIES HIS LOVELY FATHER WITH A BRAND NEW BMW WORTH N32MILLION NAIRA, IN HIS FATHER'S VILLAGE WHERE HE WAS LIVING IN IHIALA LGA, MBOSI, ANAMBRA STATE”. Many of the 4,800 comments suggested that readers believed the post to be true. We've archived the post here.", "The same post was reported by Naij.com, a Nigerian-based online newspaper now called Legit. Legit reported that “Nigerians do some bizarre things and the rest of the world has learnt to just go with the flow, but this height of bizzare is way more than strange”. The report, archived here, has been seen by more than 481,000 people, according to its Legit traffic monitor.", "The same picture has been shared alongside a similar narrative by Oddity Central in the United States; The Sun, Daily Mail, and The Metro in the United Kingdom; The Times of South Africa, The Tribune of Pakistan, India Today, as well as major news outlets in Nigeria and Kenya. The Sun, the Daily Mail and Legit have issued corrections since we published this fact-check.", "This picture has also been shared elsewhere on Facebook and Twitter -- we’ve archived some of the posts here, here, here, and here.", "We ran a Google reverse image search to find the original source of the image, but found none earlier than June 10, 2018, when it was posted on Facebook by Zevi Gins.", "Scrolling through the 4,800 comments under the first post, we found comments from actors claiming that the picture was taken on a movie set and did not show an actual burial.", "Nollywood actor Ifedi Michael said in a comment last year that the movie was still being shot in Asaba, a city in southern Nigeria. He mentioned two of the actors who appear in this particular scene, tagging one of them, Richeal Ogbonnaya.", "She replied to Michael's comment that she was “tired of explaining” that the scene is not real.", "We have contacted Michael and Ogbonnaya for more information, but have yet to receive a response.", "However, we traced the digital footprints of both actors, and found promotional posters for the movie in question, which is named “Social Club”. In the posters, you can see the same man in green and red holding wads of cash, the silver BMW, and the undertakers dressed in black with distinctive gold-rimmed caps.", "We also searched YouTube for the movie, and found the exact scene where this picture was taken. Watch the video here:", "The movie preaches against ritual sacrifices that are performed in Nigeria by people seeking to join the ranks of the country’s wealthy elite.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]