["“Wow! Teachers are the number one occupation of the Antifa terrorist organization according to the FBI,” claims a July 11, 2020 Facebook post shared more than 9,100 times from an account in Winnipeg, Canada. The claim was also circulated by political pages on Facebook in Manitoba and Saskatchewan.", "According to a search using social media monitor CrowdTangle, the claim was originally made in a much longer Facebook post on June 24, 2020. It became a standalone claim in public Facebook posts in the United States on July 6 while also circulating on Instagram.", "When contacted by AFP about the claim that the Antifa movement attracts teachers, the US’s top law enforcement agency said: “The FBI has not made any such statements about the occupations of people who are attracted to particular ideologies.\"", "Antifa, short for anti-fascist, is a structureless movement which says it is dedicated to fighting fascism online and in public.", "The movement has come under scrutiny -- particularly from President Donald Trump -- during recent protests against police violence and racism across the US after the death in police custody of George Floyd, an unarmed black man from Minneapolis.", "On May 31, Trump tweeted that he intended to designate Antifa as a terrorist organization. However, the US has no statute that permits such a designation for a domestic group on the grounds of violent conduct or intent, unlike foreign terrorist organizations, such as Al Qaeda or Islamic State, which have been listed under section 219 of the Immigration and Nationality Act.", "A statement from the FBI further explained that domestic terrorism investigations focus on criminal activity by individuals, regardless of their affiliation.  “The FBI does not and will not police ideology,” it said.", "A search for Antifa on the Federal Bureau of Investigation website finds only one result, a press conference by FBI director Christopher Wray on June 4, 2020 in which he referred to the movement as “anarchists” during a discussion of unrest following Floyd’s death.", "Richard Smith, a spokesman for the National Education Association, the largest membership organization in the US dedicated to public education, told AFP by email that his group does not have any “information that would support the allegation and are deeply skeptical of it.”", "AFP Fact Check has examined other false claims about Antifa, including unproven plots to attack Gettysburg National Cemetery or suburban neighborhoods, and false ties between the Minnesota attorney general and the movement.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]