["By FactCheck.org", "Posted on February 24, 2020", "A viral meme falsely claims Sen. Bernie Sanders “supported” Iran during the 1979 hostage crisis and “accused” the hostages of “being CIA spies.” Sanders was affiliated with a political party that criticized U.S. policy on Iran, but there’s no evidence he expressed those beliefs.", "A meme circulating on social media, getting thousands of shares, falsely states that Sen. Bernie Sanders of Vermont was a Socialist Workers Party “leader” who opposed American policies during the 1979 Iran hostage crisis.", "The meme contains photos of Sanders, President Jimmy Carter, and Ayatollah Ruhollah Khomeini, the religious and political leader of Iran from 1979 to 1989. The accompanying text says: “In 1979 Iran took 70 Americans hostage for 444 days. Most America united, but one politician stood alone. Socialist Workers Party leader Bernie Sanders supported Ayatollah Khomeini against the US, condemned President Carter for imperialism, and accused the hostages of being CIA spies.”", "The meme goes on to say, “Is this what Democrat voters stand for? Bernie Sanders for President? Maybe in Iran. Not in the US.”", "We could find no record of Sanders, currently the frontrunner in the Democratic presidential primary contest, taking such a stance regarding the hostage crisis.", "It has been widely reported over the years, including by the New York Times in 1990 and the Washington Post in 2015, that Sanders served as an elector for Socialist Workers Party presidential nominee Andrew Pulley in 1980, and has described himself as a “democratic socialist.” But Sanders was not a member – let alone a leader – of the Socialist Workers Party, according to 1981 news accounts cited by the myth-busting website Snopes for a story earlier this month.", "While he supported SWP candidates in the early 1980s, Sanders noted that he had some differences with the party.", "“Although I am not in agreement with the SWP on all issues, I strongly support that party’s attempt to become a nucleus for a national labor party which will fight for the interests of low income and working people,” Sanders was quoted as saying in a Rutland Daily Herald story in July 1980.", "During the hostage crisis, the SWP did criticize the Carter administration, writing in its newspaper that the government’s actions were “defying the wishes of the vast majority of the American people” and “desperately trying to exploit the hostages to win popular support for U.S. military action.”", "We could find no evidence, however, that Sanders agreed with that position. Nor is there evidence that Sanders supported the Ayatollah, accused President Carter of imperialism, or called the hostages CIA spies.", "The claims in the meme may have been prompted by an opinion column in the Daily Beast, which carried the headline “When Iran Took Americans Hostage, Bernie Backed Iran’s Defenders.” The column noted that Sanders spoke in support of Pulley at an event in 1980 at which Pulley criticized Carter’s handling of the hostage crisis and said many of the hostages were spies. But the column provided no evidence that Sanders ever expressed or held those views.", "Asked for comment on the meme, a spokesperson for Sanders’ 2020 campaign referred us to its statement for the Snopes story: “Senator Sanders did not think the hostages were spies nor did he support their captivity. Any suggestion otherwise is nonsense.”", "Misinformation about Iran and the United States arose in recent months following an escalation of tensions between the two countries. On Jan. 3, American troops used a drone to kill top Iranian intelligence commander Gen. Qassem Soleimani. Four days later, Iran fired missiles at Americans troops on U.S. bases in Iraq.", "Earlier this month, Sanders joined 54 other senators in approving a war powers resolution that would restrict the president’s ability to engage in hostilities with Iran without congressional approval.", "By Corey M. Berman", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "BBC. History – Historic Figures: Ayatollah Khomeini (1900-1989). Accessed 20 Feb 2020.", "Brook, Tom Vanden and John Fritze, “Pentagon: Iran launched ‘more than a dozen’ missiles at bases in Iraq housing US troops,” USA Today. 7 Jan 2020.", "Abbey, Alan. “Burlington Immigration Office May Get Role in Socialist Probe,” The Burlington Free Press. 21 May 1981.", "Kingsley, Robert. “Socialists Launch Campaign to Get Candidates on Ballot.” Rutland Daily Herald, 11 July 1980.", "MacGuill, Dan, “Did Bernie Sanders Express Support for Iran During ’79 Hostage Crisis?” Snopes. 5 Feb 2020.", "The Militant. “Protests say: ‘No war against Iran!’” 30 Nov 1979.", "New York Times, “Socialist Vows to Be Capitol Outsider.” 12 Nov 1990.", "Our Campaigns – Party Details. “Socialist Workers.” Accessed 20 Feb 2020.", "Phillips, Amber, “Bernie Sanders: A somewhat reluctant socialist.” Washington Post. 19 Oct 2015.", "“Pulley to Explain Socialist Suit Against FBI, CIA,” The Burlington Free Press. 20 May 1981.", "Radosh, Ronald, “When Iran Took Americans Hostage, Bernie Backed Iran’s Defenders.” Daily Beast, 17 Jan 2020.", "Roll Call Vote 116th Congress – 2nd Session. S.J. Res. 68. Senate.gov. Accessed 20 Feb 2020.", "Simonson, Joseph. “Bernie Sanders campaigned for Marxist party in Reagan era.” Washington Examiner, 30 May 2019.", "Villa, Lissandra. “Bernie Sanders Wins Again in Nevada. Can He Be Stopped?” Time. 23 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]