["About this rating", "The New York Times published an article in 2000 of the subject of how it was hard to find a good unclaimed screen name on internet services such as AOL. This problem remains a persistent issue on social media platforms such as Twitter, especially for celebrities who have a penchant for changing their names.", "In August 2018, a screenshot supposedly showing the futile attempts of a musician variously known as \"Diddy,\" \"P. Diddy,\" \"Puff Daddy,\" and \"Sean Combs\" to secure the Twitter handle @SeanCombs from a comb-seller called Sean's Combs was widely shared on social media:", "This is the greatest thing I've ever seen. pic.twitter.com/RKbzMZHdjs", "— Barry McCockiner (@Sp0rtsTalkJo3) August 23, 2018", "A number of websites have penned articles about this humorous exchange in which they presented this screenshot as if it showed Diddy's genuine attempt to secure the \"Sean's Combs\" Twitter handle. But the online conversation seemingly documented here never took place.", "This is a fictional exchange that was created for a 2014 article for the \"Funny or Die\" humor website. At that time, the musician had just announced that he was changing his name back to \"Puff Daddy.\"   Here's how Pat O'Brien and Zack Poitras, the authors of the article, introduced their fake Twitter screenshots:", "Sean “P. Diddy” Combs recently announced that he wants to be called “Puff Daddy” again. Combs officially changed to P. Diddy back in 2001 (and later, just “Diddy”), but now claims that he has always been Puff Daddy, tweeting: “For the record, I did not change my name. I always have been and always will be PUFF DADDY!” The only problem is, his official Twitter handle is “@iamdiddy,” and all the good Puff Daddy handles are taken.", "Although the image showing Diddy's attempt to secure the \"Sean's Combs\" handle might been seemed somewhat plausible on its own, the \"Funny or Die\" article included five additional images supposedly chronicling the musician's failed attempts to secure other Twitter handles such as @PuffDaddy and @PuffDaddy2. At the end of this fictional fiasco, Diddy was finally able to obtain the handle @pumfdoddy:", "IF the joke wasn't obviously on its own, the original article employed the tags \"jokes\" and \"parody\":", "Cohen, Joyce.   \"Good Screen Names Are Hard to Find and Getting Harder.\" \r\n    The New York Times.   2000.", "Setaro, Shawn.   \"The Definitive History of Puff Daddy's Name Changes.\"\r\n    Complex.   6 November 2017.", "O'Brien, Pat.   \"P. Diddy's Failed Attempts at Getting a 'Puff Daddy' Twitter Handle.\"\r\n    Funny or Die.   27 March 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]