["About this rating", "Biden didn't mention Dr. Seuss by name in his 2021 proclamation recognizing Read Across America Day, whereas some of his predecessors had.", "Efforts to move away from tying the author to the special day preceded Biden's time in office. Additionally, claims that a public school district in Virginia banned or \"canceled\" Dr. Seuss books were false.", "March 2 is the birthday of children's author Theodor Seuss Geisel, widely known as Dr. Seuss. In celebration of the \"Green Eggs and Ham\" author and his contributions to children's literacy, the date has long been tied to \"Read Across America Day,\" a National Education Association (NEA) day dedicated to encouraging children to read.", "That started to change in recent years when the NEA began pushing for the day to focus more on diverse children's book authors, and also with discussion of racist depictions of characters in some of Dr. Seuss' works.", "In 2021, on what would be the author's 117th birthday, those circumstances — along with false claims that a school district in Virginia banned Dr. Seuss books and a brewing conservative backlash over \"cancel culture\" — came together in a digital Big Bang of internet outrage, with some claiming Dr. Seuss had been \"canceled\" by the woke left.", "Here's what we know:", "On March 2, 2021, when U.S. President Joe Biden made his proclamation recognizing Read Across America Day 2021, many conservative news outlets reported he did so without mentioning Dr. Seuss by name. \"Biden removes mention of Dr. Seuss from Read Across America Day,\" a New York Post headline read. Other right-leaning news outlets echoed that narrative.", "Biden's two predecessors, former presidents Barack Obama and Donald Trump, both issued proclamations recognizing the national reading day while also commemorating Dr. Seuss by name, while Bill Clinton honored Dr. Seuss in recorded remarks made for broadcast.", "But movement away from linking Dr. Seuss' work to Read Across America Day began before January 2021, when Biden took office.", "As USA Today reported, since the national reading day's inception in 1998 until 2018, the NEA had partnered with Dr. Seuss Enterprises, the organization tasked with preserving the author's legacy. But in 2017, the NEA announced it would begin moving in a different direction in favor of promoting diverse children's books.", "The announcement coincided with discussions over racist imagery and language found in Seuss' body of work. A 2019 study by the Conscious Kid's Library and University of California San Diego said that the vast majority of human characters in Dr. Seuss' books are white, and non-white characters were portrayed in an offensive manner.", "Dr. Seuss Enterprises announced on March 2, 2021, that it would take the step of no longer publishing six of the author's books because they contain racist imagery.", "\"Ceasing sales of these books is only part of our commitment and our broader plan to ensure Dr. Seuss Enterprises’s catalog represents and supports all communities and families,\" the announcement stated.", "Adding to the kerfuffle, the public school district in Loudoun County, Virginia, was forced to release a statement to counter false rumors that Dr. Seuss' books had been banned by the district. Although the district will no longer make Dr. Seuss books the focus of its Read Across America Day activities, the authors works \"have not been banned and are available to students in our libraries and classrooms,\" the districted stated.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]