["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks at a news conference in the James Brady Press Briefing Room at the White House on Aug. 31, 2020, in Washington. (AP/Harnik)", "Nightly protests have happened in Portland since May. Some fires have ensued. In many cases, the fires have been set in trash cans and dumpsters and on streets.", "Authorities and local journalists disputed Trump’s claim that all of Portland is “ablaze.” The protests have been confined to a few small sections of the city.", "A Portland fire department spokesperson said none of the protest fires have required more than one fire engine to put out.", "The whole city of Portland, Ore., is not on fire, despite President Donald Trump’s claim that \"the entire city is ablaze all the time.\"", "The remark came during a White House press conference, when Trump criticized Portland’s mayor for his handling of ongoing protests in the city. Later that night, Trump told Fox News, \"Portland's been burning for many years, for decades it's been burning.\"", "Local authorities and journalists disputed both claims.", "\"We are not on fire. We have not been on fire,\" said Lt. Rich Chatman, a spokesperson for Portland Fire & Rescue, adding that there has been \"a steady and remarkable decline in the number of fires for the last few years and certainly decades.\"", "Portland, Oregon’s largest city, drew national attention when federal agents swooped in against the wishes of local leaders to protect federal property that they said was at risk because of the protests, which have occurred every night since May.", "Some have included incidents of vandalism and violence, leading businesses near the affected areas to close or board up their windows. But the problems have been mainly confined to small parts of the city, including the area near the federal Hatfield Courthouse.", "\"There’s a lot of damage around the federal courthouse,\" Chatman said. \"But the fact of the matter is this is a very small area of even downtown. We are not under siege.\"", "\"For the average resident of Portland, they probably never lay eyes on some of these fires,\" Chatman added. \"This is a very concentrated area.\"", "The Portland Police Bureau provided PolitiFact with a map and timeline of the protests from May 29 to Aug. 31. It details where each has taken place, whether a riot was declared, whether arrests were made, and whether the protesters used projectiles, fireworks, vandalism or fires.", "By our count, there were 54 fires set across 95 nights of demonstrations, which have largely taken place at one of 10 discrete locations, according to the map and timeline.", "A Department of Homeland Security officer emerges from the Mark O. Hatfield United States Courthouse after demonstrators lit a fire on Aug. 2, 2020, in Portland, Ore. (AP)", "Chatman said that in five or six incidents, fires were set to buildings that had people in them.", "But in many cases, the fires have been set in trash cans, dumpsters or on the street. \"None of these fires have grown to a size that requires more than one of our fire engines,\" Chatman said.", "The individual fires don’t amount to a city on fire. \"Portland is not ablaze,\" said Charles Boyle, a spokesperson for Oregon Gov. Kate Brown, who pointed to a television news station webpage that shows live camera footage of different areas in the state, including parts of Portland.", "Trump has warned that Portland’s protests are an example of the type of unrest that he claims would go unchecked under former Vice President Joe Biden, his challenger in 2020 — even as the protests continue on his watch. The city, Trump has said, is \"under siege.\"", "But the president’s description of a city gripped by violence and engulfed in flames has been challenged by journalists working in the area. In July, for example, the editorial board for the Oregonian wrote an opinion piece titled, \"Not under siege, but a city in need.\"", "Two people sit in Pioneer Courthouse Square in Portland, Ore., on Aug. 27, 2020. (AP)", "The Oregonian’s news department reported on the disconnect between how Portland is known to its residents and how it has been portrayed by Trump and conservative media. Buzzfeed News and CNN have described the same discrepancy.", "RELATED: No, these aren’t photos of Portland, Ore., after the protests", "We asked journalists from the Oregonian and other local news outlets about Trump’s claim. They described an on-the-ground reality in which most protesters have been peaceful, while a subset of people have clashed with police, graffitied buildings and ignited fires. The fires that have ensued have been quickly extinguished and confined to a few small parts of the city.", "\"Portland is not ablaze, though we do love the Trail Blazers,\" said Anna Griffin, the news director at Oregon Public Broadcasting, in a reference to the city’s NBA team. Street-level activism has been a feature of Portland’s culture for years, Griffin said.", "\"We’re a small city reckoning with centuries of racism — both within our law enforcement and laws themselves — and that reckoning isn’t tidy,\" added Alex Zielinski, the news editor at the Portland Mercury, an alternative newspaper. \"But no, we’re not on fire.\"", "Trump said of Portland: \"The entire city is ablaze all the time.\"", "While months of protests in Portland have seen many fires set to streets, trash cans, and buildings, those incidents have been confined to a few small sections of the city and relatively easy for the city’s fire department to extinguish. Most of the city has been unaffected.", "The whole city is not in flames. We rate Trump’s claim False.", "The White House, \"Remarks by President Trump in Press Briefing | August 31, 2020,\" Aug. 31, 2020", "Fox News on YouTube, \"President Trump goes one-on-one with Laura Ingraham | Part 1,\" Aug. 31, 2020", "CNN, \"Fact check: 'WE ARE NOT ABLAZE,' Portland fire department says after Trump falsely claims 'entire city' is on fire,\" Sept. 1, 2020", "KATU2, \"Cameras,\" accessed Sept. 1, 2020", "CNN, \"Fact check: Trump makes more false claims about Biden and protests,\" Aug. 31, 2020", "ABC News, \"Portland isn't under siege, but part of the city feels foreign: Reporter's Notebook,\" July 23, 2020", "Buzzfeed News, \"Donald Trump's Portland Rhetoric Doesn't Match Reality,\" July 21, 2020", "The Oregonian, \"Editorial: Not under siege, but a city in need,\" July 19, 2020", "The Oregonian, \"Feds, right-wing media paint Portland as ‘city under siege.’ A tour of town shows otherwise,\" July 18, 2020", "PolitiFact, \"No, these aren’t photos of Portland, Ore., after the protests,\" July 30, 2020", "PolitiFact, \"The federal government crackdown in Portland: What you need to know,\" July 22, 2020", "Phone interview with Lt. Rich Chatman, public information officer at Portland Fire & Rescue, Sept. 1, 2020", "Email interview with Derek Carmon, public information officer for the Portland Police Bureau, Sept. 1, 2020", "Email interview with Charles Boyle, deputy communications officer for Oregon Gov. Kate Brown, Sept. 1, 2020", "Email interview with Alex Zielinski, news editor at the Portland Mercury, Sept. 1, 2020", "Email interview with Anna Griffin, news director for Oregon Public Broadcasting, Sept. 1, 2020", "Email interview with Laura Gunderson, director of public interest and accountability at the Oregonian/Oregon Live, and Therese Bottomly, executive editor at the Oregonian/Oregon Live, Sept. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]