["About this rating", "In two high-profile cases, \"theft of services\" charges were dropped against diners who refused to pay mandatory gratuity fees; no specific federal law prohibits restaurants from charging the fees; laws vary from state to state; the IRS considers such a charge as paid to the restaurant, not the server.", "No specific law we could find mandates that diners must pay the additional fee.", "To tip or not to tip can be a source of contentious debate, but at some point nearly every diner has been presented with an unexpected (and perhaps unwarranted) \"mandatory gratuity\" or service charge.", "In the United States, people in service industries (such as waitstaff) often rely heavily on tips. Although \"mandatory gratuity\" or \"service charge\" fields once were rare and reserved only for very large parties, the party size required to incur them has apparently grown smaller.", "The public still widely perceives tipping as a reward for good service rather than an obligation; claims exist that the word \"tips\" is an acronym for \"to insure prompt service,\" which is a backronym, unsubstantiated by the word's etymology:", "Tip is an old word, and it has nothing to do with either acronyms or the act of attempting to influence quality of service. Although the word has many meanings, both as a verb and as a noun, the use of the term as it applies to monetary rewards to servants dates to the 1700s. It first appeared in this context as a verb (\"Then I, Sir, tips me the Verger with half a Crown\" from the 1706 George Farquhar play The Beaux Stratagem) and was first recorded as a noun in 1755. However, the use of tip to describe the act of giving something to another (where that list of possible 'somethings' could include small sums of money, intelligence on horse races, or the latest silly joke) goes back to 1610. Tip slipped into the language as underworld slang, with the verb 'to tip' (meaning 'to give to or share with') being used by shady characters as part of the then-current argot of petty criminals.", "Whether a gratuity is legally enforceable is not part of any law we could find, but disputes over tipping can and do make their way to courtrooms, such as one instance in 2004 where a New York judge deemed such a charge unenforceable:", "As it turns out, a tip is just a tip, even if you put \"mandatory\" in front of it.", "Charges were dropped yesterday against a Long Island man who was arrested last week for failing to leave a required 18 percent gratuity at Soprano's Italian and American Grill in Lake George, N.Y. The Warren County district attorney, Kathleen B. Hogan, said that she had determined that the man, Humberto A. Taveras, could not be forced to pay a gratuity ... Ms. Hogan said, \"A tip or gratuity is discretionary, and that's what the courts have found.\"", "But the dispute over a tip of a few dollars still cost Mr. Taveras, 41, of Roslyn Heights, several hundred dollars in legal fees ... On Sept. 5, Mr. Taveras and his party, which included his wife, Marie, another couple, and the five children of both couples, were charged $77.43 for their meal, and an additional $13.73 for a tip.", "Joe and Tina Soprano, the restaurant's owners, said the party of nine had not paid any part of the 18 percent gratuity required of all groups of six or more. Mr. Taveras said he had left a 10 percent tip.", "The Sopranos summoned the police, and soon Mr. Taveras was arrested and charged with theft of services.", "Mr. Taveras said he had seen no notice of the tipping policy on the menu, although Mr. Soprano said it was included on all menus. But Mr. Taveras said that the group had decided the food was not particularly good, and so did not pay the 18 percent ... [Taveras] was taken away in a police car, fingerprinted, subjected to national publicity. He said he eventually paid his lawyer a few hundred dollars to pursue the matter.", "In 2009, diners were arrested on a similar charge after refusing to pay a $16 service charge in Pennsylvania. An aggrieved diner said that after she was subjected to excessive waits and had to fetch her own silverware and drink refills, she was not inclined to tip her server:", "After the $73 bill came, the group paid for food, drinks, and tax but refused to pay the tip. After explaining the bad service to the bartender in charge, [the diner] claimed he took their money and called police. The couple was handcuffed and placed in the back of a police car ... The owner admitted that the group waited unusually long for their food, but said the pub was extremely busy that night. He said managers offered to comp the food, a claim the couple denies ever happened.", "Police charged [the couple] with theft since the gratuity was part of the actual bill. However, it is doubtful that the charges will hold up in front of a judge.", "Several days later, a judge sided with the diners and dropped the charges:", "Bethlehem Township police dropped theft charges against two college students who refused to leave a tip at a Lehigh Valley restaurant for what they said was lousy service.", "John Wagner, 24 and Leslie Pope, 22, were hauled off to jail and charged with theft last month after they refused to pay a $16.35 mandatory service fee charged by the Lehigh Pub on East Fourth Street. ... Northampton County District Attorney John Morganelli said Pope and her friend were right and recommended to Bethlehem police that the charges against the couple be dropped, according to the Allentown Morning Call.", "In some cases, judges have not sided with diners seeking an end to a mandatory gratuity, which became an issue when diner Ted Diamond sued Darden restaurant group in 2013:", "With respect to the automatic gratuity, Mr. Diamond alleged that the charge violated New York City Administrative Code §20-700, which prohibits businesses from engaging in unfair trade practices, and New York City Rule §5-59, which prohibits restaurants from \"adding a surcharge to listed prices.\" Mr. Diamond claimed that the automatic gratuity was such a surcharge and therefore was impermissible under New York City law. He also alleged that by violating §20-700 and §5-59, Darden violated New York General Business Law (GBL) §349, which prohibits businesses from engaging in deceptive acts or practices.", "The court easily dismissed the automatic gratuity claim for four reasons. First, it noted that there was no private right of action for violations of §20-700 or §5-59 (that is, an individual could not bring a lawsuit for their violation although the government can still do so), a fact conceded by Mr. Diamond. Second, Mr. Diamond could not circumvent the lack of a private right of action by asserting a claim under GBL §349. Third, Mr. Diamond did not allege that Darden had engaged in a \"materially misleading act or practice,\" a prerequisite for prevailing on a GBL §349 claim, as it was clear from the face of the complaint that Darden had specifically informed Mr. Diamond (and presumably other customers) about the automatic gratuity. Fourth, the court found that Mr. Diamond had not alleged an injury that was separate and distinct from the purported deceptive act. In order to assert a claim under GBL §349, the deceptive act must cause the injury but it cannot be the injury. Therefore, in most cases under GBL §349, the deceptive act is the false or misleading label and the injury is the purchase price. Mr. Diamond claimed that the false act was requiring patrons to pay the automatic gratuity and the injury was the amount of the gratuity. Thus, Mr. Diamond had alleged that the deceptive act and injury were one and the same and this was insufficient under GBL §349.", "A 2014 ruling favored Darden restaurants in the suit:", "Darden Restaurants Inc, the parent of Olive Garden and Red Lobster, won the dismissal of a New York lawsuit accusing it of illegally adding an automatic 18 percent tip to diners' bills and failing to list beverage prices on its menus.", "In a decision made public [in July 2014], U.S. District Judge Katherine Polk Failla in Manhattan rejected claims by plaintiff Ted Dimond, who sought to represent diners in a class-action, that Darden's practices violated state consumer protection laws.", "Dimond claimed it was deceptive for Darden to refer to the mandatory tip it imposed in some restaurants as a \"gratuity,\" which he called a \"voluntary act.\" ... the judge said Darden \"conspicuously\" showed the tip on its menus before diners placed their orders, and that diners were free to leave if they disapproved.", "While New York City has its own laws on menu surcharges, private diners cannot use them as a basis to sue, Failla said.", "Further muddying the waters is that as of 1 January 2014, the Internal Revenue Service decided that any form of \"mandatory gratuity\" is paid not to the server but to the restaurant (as a measure to ensure taxes are paid on tips):", "The change actually came in June 2012, when the IRS issued Revenue Ruling 2012-18, which said that the mandatory extra fee restaurants often add to large parties is not a “tip” at all. A tip, it ruled, must be voluntary in every sense of the word. Customers must feel free to leave any amount they choose — or nothing at all. Instead, such mandatory add-ons are a “service charge,” a fee that must be paid if a customer wants to leave the restaurant without handcuffs.", "This is much more than just simple semantics. You see, if an employee relies on tips for part of his or her income, an employer only has to pay a minimum wage of $2.13, according to the Department of Labor. Only if the employee doesn’t make enough in tips to meet the prevailing minimum wage (now $7.25 at the federal level) does the employer have to make up the difference ... the IRS knows this has led to lots of number-fudging. For example, all employees who make more than $20 in tips must report them to the employer each month so that taxes can be withheld. But if the employee is less than honest and the employer looks the other way or under reports tip income, both parties can come out ahead while the federal government is left holding the bag.", "That creates a legal gray area, in which an objecting diner could potentially be arrested for theft of services for declining to pay the fee (although the 2004 and 2009 cases came before the IRS rule change), and it is common for the issue to be parsed as one of taxation rather than obligation. (Although the IRS classifies a \"service charge\" as taxable income, it did not extend its reach into the enforcement of such charges.)", "The legality of enforcing mandatory surcharges, service fees, and tips appears to fluctuate from state to state, or even situation to situation. In many cases, the practice was upheld by the lack of laws forbidding it:", "In New Jersey and New York State, generally no law exists that specifically forbids a restaurant from applying a surcharge to a customer’s final bill ... they must be appropriately labelled as not being part of the gratuity. Further, the surcharge must be communicated to the diner in some fashion before they order. New York law provides: “The statements shall use ordinary language readily understood and shall appear in a font size similar to surrounding text, but no smaller than a 12-point font.” In fact, there is a rebuttable, legal presumption that any charge which is not for food and drink is a tip. Further, any restaurant wishing to ensure that a Surcharge will not be legally confused with a Service Charge is to call the Surcharge an “administration charge.”", "However, New York City Rule §5-59 prohibits restaurants from “adding a surcharge to listed prices.” A restaurant found to be engaged in this activity may be fined $500 per plate. While this ordinance has not been generally enforced, complaints from diners can prompt such a response. Recently, this law has come under increasing scrutiny both from restauranteurs who want it repealed and diners who want the law applied to Service Charges as well ... Restaurant Service Charges generally follow the same practical (and legal) realities as Surcharges. However, under New York law (but not New Jersey), a Service Charge (or any other charge which the diner reasonably believes to be gratuity) must be paid to the servers in the same fashion as a traditional tip. Failure to comply may result in hefty fines..", "Over the years, the subject of mandatory tips or service fees has been debated, legislated, argued in court, written about extensively, and addressed by the IRS. Most information on the topic was semantic, as nearly all case law we could find rested on whether a gratuity is a tip (voluntary) or a service fee (potentially enforceable by law). In many cases, restaurants impose such fees in the absence of laws prohibiting them. The firmest legal information on mandatory service fees comes from the IRS, but that entity provides no guidance on whether the fee is legally enforceable.", "Berardelli, Gene.   \"Tips, Gratuities And Mandatory Service Charges: Rules For New York Businesses And Employees.\"\r\n    The New York Law Blog.   19 October 2016.", "Chang, David.   \"Couple Busted For Refusing To Pay Tip.\"\r\n    WCAU.   18 November 2009.", "Gottlieb, Jane.   \"A Mandatory Gratuity Is Just A Tip, And Thus Not Mandatory, A Prosecutor Says.\"\r\n    The New York Times.   15 September 2004.", "Grindlinger, Glenn S.   \"Federal Court Dismisses Lawsuit Against New York City Restaurant That Imposed Auto-Gratuities ... But Don't Start Putting Them Back Just Yet.\"\r\n    Fox Rothschild LLP.   16 July 2014.", "Johnson, Danielle.   \"Theft Charges Dropped Against No-Tip Couple.\"\r\n    WCAU.   23 November 2009.", "Schlueter, Roger.   \"Answer Man: Is It Legal For Restaurants To Include Mandatory Tip?\"\r\n    Belleville News-Democrat.   11 March 2015.", "Stempel, Jonathan.   \"Darden Wins Dismissal Of New York Lawsuit Over Automatic Tips.\"\r\n    Reuters.   10 July 2014.", "Young, Gary and Marilou Halvorsen.   \"Restaurant Trends In The New Jersey And New York Markets: The New Realities Of The Decreasing Tip Credit.\"\r\n    N.J. Restaurant & Hospitality Association.   19 January 2016.", "IRS.   \"Topic 761 - Tips – Withholding And Reporting.\"\r\n    Accessed 27 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]