["About this rating", "On 16 July 2018, the FBI announced that they had charged Russian national Mariia Butina with conspiring against the United States as an unregistered secret agent. Shortly after that news broke, an image purportedly showing the accused Russian spy entering the Oval Office while President Trump was greeting visitors began spreading on social media:", "This image is a genuine photograph taken by the Russian Foreign Ministry (while the White House press was barred from the meeting) in March 2017 during a visit to the White House by top Russian officials, such as Sergey V. Lavrov (seen shaking President Trump's hand) and Sergey Kislyak. The woman circled in red in this photograph, however, is not Mariia Butina.", "Mariia Butina was not mentioned in any contemporaneous news reports of the meeting. Although Butina bears passing resemblance to the woman in the photograph (see comparison below), a National Security Council (NSC) source told Buzzfeed that the pictured woman was actually an NSC staffer:", "Zeke Miller, a White House reporter with the Associated Press, also confirmed that the pictured woman was not Butina:", "Re TASS photo of Trump/Lavrov meeting - woman in the doorway of the Oval is an NSC staffer, NOT Butina.", "— Zeke Miller (@ZekeJMiller) July 17, 2018", "The NSC staffer has not been identified by name but is possibly Cari Lutkins:", "Mariia Butina has been photographed in the company of various American politicians and NRA officials, but there's no evidence that she was present at this Oval Office meeting in March 2017. The claim that she was appears to be based on little more than her bearing a slight resemblance to a red-haired U.S. government employee.", "NBC News.   \"White House Takes Flak for Letting Russian State Media Into Oval Office.\"\r\n    12 March 2017.", "Davis, Julie.   \"Trump Bars U.S. Press, But Not Russia’s, At Meeting with Russian Officials.\"\r\n    The New York Times.   10 March 2017.", "Hennigan, W.J.   \"The Strange Case of the NRA-Linked Russian Charged With Being a Kremlin Agent.\"\r\n    Time.   16 July 2018.", "MacNeal, Caitlin.   \"Woman Charged for Acting as Russian Agent Mingled with NRA Execs, GOP Pols.\"\r\n    Talking Points Memo.   16 July 2018.", "The Week.   \"That's Not Alleged Russian Spy Mariia Butina in an Oval Office Meeting with Trump.\"\r\n    17 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]