["“Israel has gifted this to India to clean Ganga. What a beautiful gesture ! Thanks to Modi Government’s Friendship Efforts. This is now used at Godavari.”", "The above message has been posted on social media and messaging platforms along with a video which shows trash being taken out of a river by a machine.", "Israel has gifted this to India to clean Ganga. What a beautiful gesture ! Thanks to Modi Government’s Friendship Efforts. This is now used at Godavari", "Posted by Veena Dhamija on Monday, July 8, 2019", "The above post by a Facebook user is of July 8. In the video, different kinds of machines can be seen collecting garbage from the river. The same has also been shared on WhatsApp with the identical narrative, that these machines have been gifted to India by Israel and are currently being used to clean the Godavari river.", "Alt News found that this video and the accompanying claim have been shared on Twitter since 2018.", "Israel has gifted this to India to clean Ganga. What a beautiful gesture ! Thanks to Government’s Friendship Efforts pic.twitter.com/PUjh6VxxSv", "— Tyagraj shekhawat (@TyagrajShekhawt) July 12, 2018", "There are three machines seen in the viral video. Alt News found that only one out of the three machines pertains to India. Reverse-searching one of the frames of the video, we found that two other river-cleaning machines pertain to Baltimore in Maryland, USA and not India. The third machine, though it pertains to India, was not ‘gifted’ by Israel as claimed.", "Posted below is a YouTube video of the first machine which can be seen in the viral video. It had been deployed at Baltimore harbour in 2013.", "The second machine shown in the video does indeed pertain to India. This is evident from the poster seen on the top of the machine which reads, ‘Clean Godavari Campaign’.", "Alt News found that this machine had been deployed in the Godavari river at Nashik, Maharashtra in 2015 after the Kumbh mela. The same video is available on the website of Cleantec Infra, a private firm. The video was also posted by the company on its YouTube channel.", "It may be noted that this machine deployed by Cleantec Infra has been imported from the USA, built by a firm named Aquarius Systems. Both, the floating trash skimmers and aquatic weed harvesters deployed by Cleantec Infra have been sourced from Aquarius Systems. This is clearly mentioned on the website of Cleantec Infra . The same information is also available on the website of Aquarius Systems. Thus the claim that this machine was ‘gifted’ by Israel to India, is patently false.", "The third machine with wheels, seen in the viral video, was deployed in 2014, again in Baltimore, USA. It has a solar powered water-wheel and can clean up to 50,000 pounds of trash every day, according to reports.", "Insofar as the claim about Israel helping India in cleaning up the Ganga and Godavari rivers is concerned, it had been reported in 2015 that Israel had offered help to India to cleanse its rivers. This was followed up later through another expression of interest by Israel for rejuvenating the Ganga river under the Namami Gange project. It may be noted that in 2018, Israel had gifted India a mobile desalination vehicle during PM Narendra Modi’s visit to Israel in January 2018. However, this machine is for the purpose of securing drinking water through desalination, and not for the purpose of cleaning rivers.", "In conclusion, two of the three machines shown in the viral video are from Baltimore, USA whereas the third machine, although pertaining to India, is not a ‘gift’ from Israel. Moreover, there are no reports stating that Israel has provided sophisticated river-cleaning machines to India.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]