["About this rating", "Wombat burrows are extremely large, and it's possible that some animals have found refuge in them during the wildfires in Australia.", "Wombats are not actively rescuing animals from the flames and bringing them back to their burrows for safety.", "As wildfires raged across Australia at the start of 2020, an interesting claim about wombats, a short-legged marsupial, started to circulate on social media. According to this rumor, wombats were braving the fires to find lost animals and then leading them back to their burrows for safety:", "Reports from Australia that countless small animals have escaped death because wombats, unusually, opted to share their massive, complex burrows. Even reports that they have been observed exhibiting \"sheperding behavior.\"", "While this social media post claims that it is based on \"reports from Australia,\" we have seen no documentation of these supposed hero wombats. In fact, a number of Australian experts have said that they were skeptical of the claims.", "Jackie French, author and director of The Wombat Foundation, told IFLScience:", "\"Wombats are extremely short-sighted. They focus mostly on food and dirt. It would be hard for them to see well enough to shepherd, nor have I seen one do so.\"", "Scott Carver, a senior lecturer in wildlife ecology at the University of Tasmania, told the Associated Press no evidence exists that wombats were \"sharing or encouraging other animals\" to take refuge in their burrows.", "While wombats may not actively be seeking out animals in need, it is quite possible that distressed creatures have found their way into wombat burrows on their own. Wombats are efficient diggers and can create burrows stretching up to 650 feet. Associate Professor Steve Johnston from the University of Queensland also noted that wombats may abandon these underground tunnels in order to dig a new one. This leaves some opportunities for other animals to seek shelter.", "Johnston told the Brisbane Times:", "\"A lot of those wombat burrows could be empty, so animals could easily make their way into those burrows to escape the fire ...  Wombats will often make a burrow system and then move on, so those empty burrows become open [to other animals].\"", "Wombats are typically very territorial and will even charge and chase out animals that invade their space. However, students at the University of Melbourne set up cameras near one wombat burrow in 2019 and found other animals, including koalas and bunnies, venturing inside these underground tunnels.", "Kath Handasyde, an expert in native mammal ecology and physiology, said that the wombat was likely sleeping or in another chamber when these other animals explored the burrow. Here's a video where she explains the situation.", "In short, wombats are not actively shepherding animals into their burrows for safety. However, it is certainly possible that animals fleeing the fires have taken refuge in the wombats' underground tunnels. In fact, the Center for Biological Diversity shared a video taken during the Australian fires in 2020 showing how one animal, the common brown butterfly, was using wombat holes to survive the flames:", "Greenpeace Australia, the social media account that posted the viral message recounted in this story's introduction, later updated its Instagram post to remove the \"shepherding\" part of the claim:", "Dupuy, Beatrice.   \"Wombats Not Herding Animals Into Their Burrows During Australia Fires.\"\r\n    Associated Press.   14 January 2020.", "Bradford, Alina.   \"Facts About Wombats.\"\r\n    Live Science.   30 October 2015.", "Layt, Stuart.   \"Experts Question Reports of Wombats' Heroic Bushfire Efforts.\"     Brisbane Times.   13 January 2020.", "Nimmo, Dale.   \"Viral Stories of Wombats Sheltering Other Wildlife From the Bushfires Aren't Entirely True.\"\r\n    ABC News Australia.   15 January 2020.", "Hooper, Claudia.   \"A Wombat, a Koala and a Rabbit in a Burrow.\"\r\n    University of Melbourne.   15 April 2019.", "IFL Science.   \"Viral Posts Claim Wombats Share Their Burrows During Australian Fires.\"     Retrieved 16 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]