["About this rating", "Trump issued an executive order in July 2020 that was intended to lower the price of insulin for some Americans.", "Rather than targeting all diabetic patients nationwide, the directive was written to help low-income diabetes patients of certain community clinics, who are uninsured or underinsured, to buy insulin at reduced prices. Also, no verifiable evidence suggests that the lower costs would amount to \"pennies a day\" for anyone.", "Exactly how much money some diabetes patients could save on insulin daily as a result of the directive is unknown because the order did not outline specifics, including when or how it would be implemented.", "Sitting in front of a mock pharmacy and flanked by people in white lab coats, U.S. President Donald Trump signed a series of executive orders on July 24, 2020, that he framed as end-all solutions for Americans who struggle to pay high premium prices for prescription drugs. Of one of the directives, specifically, Trump told a crowd of supporters and reporters at the ceremony:", "Under this order, the price of insulin for affected patients will come down to just pennies a day — pennies a day from numbers that you weren’t even able to think about. It’s a massive cost savings.", "News outlets such as The New York Times and Washington Post described the signing event like it was largely symbolic, since the executive orders are unlikely to take effect this year, if at all (we explain more below).", "Meanwhile, at least two conservative media sources, Ben Shapiro's Daily Wire and CNSNews — which claims to balance \"liberal bias\" in mainstream news with its coverage — reported on the president's pledge to slash prescription prices at face value, and highlighted the above-mentioned quote by Trump regarding insulin.", "CNSNews published the story, \"Trump Says Executive Order Will Drop the Price of Insulin Down to Pennies a Day,\" which mainly quoted the president verbatim, and numerous Snopes readers reached out to us to investigate the claim's accuracy. Namely, diabetic patients wondered whether they would indeed pay less for insulin syringes or insulin cartridges for their pens or pumps because of the president.", "According to a Congressional analysis in September 2019, insulin averaged $34.75 per dose in the U.S. — a total that's almost 2.5 times higher than the average price in other countries.", "First, we'll lay out what was unequivocally true: Trump issued Executive Order on Access to Affordable Life-saving Medications during the July 24, 2020, signing event, and that directive authorized the Department of Health and Human Services (HHS) to make certain changes regarding the cost of EpiPens for Americans with severe allergies and the cost of insulin for those who suffer from diabetes, specifically. It stated:", "The price of insulin in the United States has risen dramatically over the past decade. ... While Americans with diabetes and severe allergic reactions may have access to affordable insulin and injectable epinephrine through commercial insurance or Federal programs such as Medicare and Medicaid, many Americans still struggle to purchase these products.", "Here's some more context: Medicare, the federal program that covers the majority of Americans over age 65 and those with disabilities, offers plans that help diabetic patients cover the cost of some insulin products. Meanwhile, policies for Medicaid, the government-run health insurance system for low-income people, vary state by state — variances that include whether or not the program covers the cost of diabetic enrollees' insulin, or to what extent.", "Trump's directive pertained to \"federally qualified health centers\" (FQHC), which are about 1,400 community health care clinics nationwide that treat low-income patients on sliding fee scales and purchase discounted drugs from pharmaceutical companies under an existing federal program, known as 340B. The July 2020 executive order was worded like this:", "In other words, the president's order requires participants of the 340B Program to offer insulin at greatly reduced prices to patients with no or little insurance coverage, without providing specifics on how or when the change would take effect. Advisory Board, a news site for health care providers, said in a statement: \"Only patients with low incomes; those with high cost-sharing requirements for insulin or epinephrine; those with high, unmet deductibles; and/or those without health insurance would be eligible for the discount.\" A news release from the HHS said:", "This will increase access to life-saving insulin and epinephrine for the patients who face especially high costs among the 28 million patients who visit FQHCs every year, over six million of whom are uninsured.", "For perspective, about 34.2 million Americans had diabetes as of 2018, which represented about 10.5 percent of the population, according to the American Diabetes Association. So, hypothetically, if the same proportion of people had diabetes within the FQHC population of 28 million patients (a total reported by the HHS), then Trump's executive order could help about 2.9 million people, depending on whether their insurance already covers the treatment.", "So to recap, in regard to the claim in question, it was true to state Trump signed an executive order in July 2020 that aimed to make it easier for low-income diabetic patients to pay for insulin.", "But nowhere in the federal document did the presidential administration explain its plan for implementing the change, nor the level to which insulin prices would drop. There was no proof that the order would allow any American to someday pay \"pennies a day\" on the protein hormone.", "We should note here: In addition to that previously explained executive order, a separate directive signed by Trump on July 24, 2020, touched on a yet-to-be-finalized initiative by the White House to relax international drug importation rules and added insulin to a list of prescription medications that can be imported from Canada. The president characterized that directive, too, as a positive step for people who want lower insulin costs.", "And that brings us to our final point: Much of what Trump celebrated in the July 2020 executive orders had been proposed by his administration prior to the signing ceremony but stalled amid opposition from pharmaceutical companies and political barriers. \"[None] of these ideas put forth are new, or in fact any more implementable than before, especially without congressional action,” an investor told FeircePharma, a trade publication for the pharmaceutical industry.", "For instance, in May 2020, Trump unveiled a plan to cap the cost of insulin for Medicare recipients at $35 per month beginning in 2021 (even that initiative would cost patients more than \"pennies a day\"). But as of this writing, it was unclear exactly how that directive would roll out, and when or if qualifying seniors with diabetes would notice a price difference. The Washington Post reported on July 24, 2020:", "The moves [by Trump] are largely symbolic because the orders are unlikely to take effect anytime soon, if they do so at all, because the power to implement drug pricing policy through executive order is limited. Voters will not see an impact before the November elections, and the drug industry is sure to challenge them in court.", "A couple days after the July signing ceremony, for example, Politico reported that representatives of major drug lobbies refused to meet with the president to discuss one of the four executive orders: a non-specific and controversial proposal to link Medicare payments for certain medicines to lower costs that people pay in other countries. After that refusal on industry leaders' part, investors told MarketWatch that the executive orders were \"largely campaign fodder\" and \"come without the necessary force to meaningfully change prices in the U.S.\"", "In sum, while it was truthful to claim Trump issued an executive order in July 2020 that was intended to lower the price of insulin for some Americans, it was misleading to claim that all diabetic patients would save money as a result of the directive — the directive only targeted  low-income patients who are uninsured or underinsured and seek help from certain federal community health providers. Additionally, it was unclear as of this report when, if at all, that group would actually reap the benefit of the cost savings, and the estimated amount of such was unknown. It would be wrong to state based on available evidence that the executive order alone would drive down prices to \"pennies a day.\" For those reasons, we rate this claim a \"Mixture\" of truth and falsehoods.", "White House.   \"Executive Order On Access To Affordable Life-saving Medications\".\r\n   24 July 2020.", "White House.   \"Executive Order On Lowering Prices For Patients by Eliminating Kickbacks To Middlemen\".\r\n   24 July 2020.", "White House.   \"Executive Order On Increasing Drug Importation To Lower Prices For American Patients\".\r\n   24 July 2020.", "White House.   \"Remarks By President Trump At Signing Of Executive Orders On Lowering Drug Prices\".\r\n   24 July 2020.", "Sanger-Katz, Margot.   \"As He Woos Drugmakers On Virus, Trump Demands Drug Price Controls\".\r\n   New York Times.   24 July 2020.", "Arter, Melanie.   \"Trump Says Executive Order Will Drop the Price of Insulin Down to Pennies a Day\".\r\n   CNSNews.   24 July 2020.", "National Conference of State Legislatures.   \"Diabetes Health Coverage: State Laws And Programs\".\r\n   10 January 2016.", "HHS.gov.   \"Trump Administration Announces Historic Action To Lower Drug Prices For Americans\".\r\n   24 July 2020.", "American Diabetes Association.   \"Statistics About Diabetes\".\r\n   Accessed 30 July 2020.", "White House.   \"Executive Order On Increasing Drug Importation To Lower Prices For American Patients\".\r\n   24 July 2020.", "Luhby, Tami.   \"Trump Administration Proposes Allowing Imports Of Certain Drugs From Canada\".\r\n   CNN.   18 December 2019.", "O'Donnell, Carl.   \"Explainer: Trump's Plan To Cut Drug Prices\".\r\n   Reuters.   27 July 2020.", "Abutaleb, Yasmeen and Josh Dawsey.   \"Trump Signs Executive Orders Aimed At Lowering Drug Prices In Largely Symbolic Move\".\r\n   Washington Post.   24 July 2020.", "Cohen, Joshua.   \"Trump's Executive Orders On Drug Pricing Contain Caveats And Limitations\".\r\n   Forbes.   25 July 2020.", "Ways And Means Committee Staff.   \"A Painful Pill To Swallow: U.S. Vs. International Prescription Drug Prices\".\r\n   September 2019.", "Reklaitis, Victor.   \"Trump's Meeting With Pharma Execs Called Off, As Analysts Say His Moves On Drug Prices Lack Bite\".", "Prestigiacomo, Amanda.   \"Trump Issues Executive Orders To Slash Insulin, EpiPen Prices; End 'Global Freeloading'.\r\n   The Daily Wire.   27 July 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]