["About this rating", "In early March 2021, readers inquired about a news story that concerned Seresto flea collars. USA Today and Midwest Center for Investigative Reporting co-published the article. Its headline read: \"Popular flea collar linked to almost 1,700 pet deaths. The EPA has issued no warning.\"", "One reader asked: \"I'm interested in knowing if Seresto flea collars are really linked to pet deaths and the EPA isn't issuing warnings.\"", "Another reader emailed with an inquiry about whether the products were \"causing death\" in pets.", "The product description for Seresto flea collars claims it offers \"continuous 8-month flea and tick protection.\" A variety of collars are available for both dogs and cats.", "According to the investigation:", "\"Since Seresto flea and tick collars were introduced in 2012, the EPA has received incident reports of at least 1,698 related pet deaths. Overall, through June 2020, the agency has received more than 75,000 incident reports related to the collars, including nearly 1,000 involving human harm.\"", "The reporting cited documents from the Environmental Protection Agency (EPA); the records were \"obtained through a public records request from the Center for Biological Diversity, a nonprofit organization that watchdogs the EPA as part of its work to protect endangered species.\"", "We reached out to the EPA for further information. Initially, we received the following statement from an agency spokesperson:", "Under the Biden-Harris Administration EPA has returned to its core mission, which includes protecting our pets' health. We take every incident reported seriously and review these data to see whether action is necessary. EPA encourages pet owners to read the entire label before using the pesticide product and follow all directions carefully, including monitoring your pet after application to see if side effects occur. If side effects develop, the label tells the consumer to consult the pet’s veterinarian immediately.", "In order to dig deeper, we inquired about the EPA documentation that appeared in the investigation. In response, the agency described the way that incidents are recorded.", "They told us that all incidents are documented in a special system. However, there is no requirement under FIFRA (Federal Insecticide, Fungicide, and Rodenticide Act) to look into such incidents. They said that some may be compelling cases that establish links between a product and an incident, while others might be the opposite. Further, the EPA mentioned that incidents may sometimes come down to the pet owner improperly using the products in question:", "EPA logs incidents into its Incident Data System (IDS) by EPA registration number, so all of the incidents in our IDS under EPA are for the Seresto collar. Registrants are not required under FIFRA 6(a)(2) to investigate incidents or to gather additional information. While some incidents are well investigated and reported in such a way as to establish a strong link between the adverse effect and the exposure, many others do not include enough facts to clearly demonstrate causation. Many of the reports are anecdotal, with no indication of whether the user followed label use instructions or used a product appropriate for the pet type and size. Generally, however, there is no process for verifying the information in reports.", "The EPA spokesperson also provided further detailed guidance on how it would determine whether a pet collar was safe. In layman's terms, this portion of the statement said that the EPA has a comprehensive process to determine a product's safety for the environment. Also, some pets might be \"more sensitive than others and may experience adverse symptoms after treatment\":", "Under FIFRA, EPA must make a determination that the product will not cause \"unreasonable adverse effects on the environment,\" defined in FIFRA 2(bb) as (in part) \"any unreasonable risk to man or the environment, taking into account the economic, social, and environmental costs and benefits of the use of any pesticide.\" To reach a registration decision and inform the label language, the data that EPA requires includes data on pesticide residues, toxicology, companion animal safety, and efficacy. EPA then independently reviews those data to inform the registration decision. EPA uses this information to determine if and how a product may be used. Evaluations for pet products like shampoos, collars and spot-ons rely upon data on companion animal safety, efficacy and safety for humans who may be exposed as a result of product use.", "The product label is the law, and applicators must follow label directions. Some pets, however, like some humans, are more sensitive than others and may experience adverse symptoms after treatment. Manufacturers are required under law to report adverse incident information to EPA. Individuals may report incidents potentially associated with use of an EPA-registered product by contacting the product manufacturer, their state lead pesticide agency, the National Pesticide Information Center, or by contacting EPA directly through its Incident Data System.", "The EPA advised us about two pesticides present in Seresto flea collars: imidacloprid and flumethrin. The EPA published documentation about the safety of both pesticides in early 2020:", "The active ingredients in Seresto are flumethrin and imidacloprid. As part of EPA’s regular 15-year review of pesticide active ingredients, EPA completed an interim registration review decision for flumethrin in March 2020 and published a proposed interim registration review decision for imidacloprid in January 2020. During registration review, the Agency looks at each active ingredient to ensure that it continues to meet the legal standard for registration under the Federal Insecticide, Fungicide and Rodenticide Act (FIFRA) and other applicable statutes. Pet incidents are discussed in the Imidacloprid Proposed Interim Registration Review Decision and the Flumethrin Interim Registration Review Decision.", "We read through the January 2020 documentation for imidacloprid. The EPA's proposed interim registration review decision came to the following conclusion on risk assessment: \"The updated residential handler and post-application exposure risk estimates for the registered pet collar use of imidacloprid are not of concern (i.e., MOEs ≥ 100) for all scenarios.\" (\"MOEs\" refers to the margin of exposure, an approach that calculates health risk.)", "We also reviewed the March 2020 report for flumethrin. The EPA's interim registration review decision said the following of its risk assessment: \"The agency has determined that there are no risks of concern associated with the registered use of flumethrin. As a result, the agency is not requiring any mitigation.\"", "Bayer was once the company that made Seresto flea collars. We contacted the company with questions but did not hear back. Instead, Elanco, a pharmaceutical company that purchased the Bayer Animal Health division in 2020, provided a response. In 2021, the Bayer name still appeared on Seresto products, but that was set to change to Elanco following a transition period.", "An Elanco spokesperson claimed that the USA Today/Midwest Center for Investigative Reporting article was \"very misleading\" and that there was \"no established link between death and exposure\":", "The article is very misleading, and misses several key pieces of information, leaving a skewed impression for readers. We're seeing veterinarians around the country question this misleading story and concerned it may jeopardize pet care and wellbeing.", "...", "First, There is no established link between death and exposure to the active ingredients contained in Seresto.", "It is critically important to understand that a report is not an indication of cause.", "The numbers referenced in the original article represent the number of reports received, and do not reflect causality. So, if a dog were to be wearing a collar and experience any sort of adverse event, the collar would be mentioned in the report. Drawing a causal link from individual incident reports is misleading. Since its initial approval in 2012, more than 25 million Seresto collars have protected dogs and cats in the U.S. from fleas and ticks.", "And, reporting rates have actually been decreasing over the life of the product.", "The Elanco spokesperson elaborated, saying they \"continuously monitor the safety\" of its products \"on an on-going basis.\" They also told us that \"more than 80 regulatory authorities around the world, including the US EPA, rigorously reviewed the safety data collected over the course of Seresto’s development prior to registration and/or approval, as appropriate.\"", "Regarding the more than 75,000 total incidents with Seresto flea collars, they said that a \"significant majority\" were \"application site issues – reddening of the skin or hair loss below the collar.\"", "The investigation also cited \"nearly 1,000\" incidents that were purportedly about humans being harmed by the pet collars. An EPA document from early 2020 spelled out some specifics. \"Dermal symptoms were reported most often for the major severity incidents.\" The report mentioned \"rash, redness, skin lesions, hives, and pruritus.\" (Pruritus is itchy skin.)", "Neurological symptoms were also noted in the document, including \"headaches, numbness, tingling, and one person reported seizures.\"", "In our correspondence with the EPA, we asked how the agency would advise concerned pet owners trying to decide if it's safe to use Seresto flea and tick collar products. The EPA said that pet owners should consult with their veterinarian:", "EPA encourages pet owners to discuss with their veterinarian whether flea and tick control is needed for their pets, which type of control product they should use if one is needed, to read the entire label before using the recommended pesticide product, and to follow all directions carefully, including monitoring the pet after application to see if side effects occur. If side effects develop, the label tells the consumer to consult the pet’s veterinarian immediately.", "We reached out to Johnathan Hettinger with the Midwest Center for Investigative Reporting, who authored the investigation, in order to share the statements from the EPA and Elanco. Hettinger told us that he stands by his investigation:", "We stand by the story as reported. We felt this story is important given the sheer number of complaints about the collars from consumers officially made to the EPA. We clearly were cautious in the story to avoid any misunderstanding of these issues and gave the company ample space to answer our questions and respond to these reported problems.", "Since the publication of our story, the company, Elanco, has not reached out to us to dispute the reporting or call for any corrections. The EPA has issued two subsequent statements, neither of which expressed that we made any mistakes in our reporting.", "We continue to review more information and will report on the concerns and the EPA, FDA, FTC and other agency activities and discussions in addition to the profession and industry activities and discussions.", "After this fact check was published, an Elanco spokesperson provided a response to Hettinger's reaction. They mentioned that \"detailed information\" provided to Hettinger prior to the investigation being published was \"ignored.\"", "In sum, an investigation about Seresto flea collars was co-published by USA Today and Midwest Center for Investigative Reporting. EPA data consisting of 1,698 reported incidents of pets dying after they had come into contact with a Seresto flea collar figured prominently in that investigation. We reviewed the EPA data ourselves and spoke to the agency. In general, the information submitted to and compiled by the EPA is insufficient to draw a clear causal link between use of the product and the reported deaths. We have thus rated this claim as \"Unproven.\"", "After this fact check was published, on March 18, 2021, CBS News reported that \"some members of Congress\" requested a temporary recall of Seresto flea collars:", "U.S. Rep. Raja Krishnamoorthi, D-Illinois, also tweeted: \"A pesticide on the Seresto pet collar aimed to kill fleas may also be harming the pets themselves and their humans. I’m getting to the bottom of it and requesting they be recalled through my investigation.\"", "An Elanco spokesperson told CBS News that they would not be issuing a recall. \"That would be up to regulators,\" they said.", "March 10, 2021: This story was updated to add that Elanco purchased the Bayer Animal Health division in 2020. An unsolicited response was also added from Elanco, in response to Hettinger's message.", "March 19, 2021: This story was update to note that some members of Congress had requested a recall of the products.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]