["“Uganda’s dictator Yoweri Museveni’s 33 year dictatorship is coming to an end, thanks to PeoplePower, a movement led by Robert Kyagulanyi (BobiWine) (sic),” reads the breaking news banner purportedly broadcast on CNN.", "The image, shared in this Facebook post, includes a headshot of the network’s news anchor Anderson Cooper and an inset of Wine.", "The opening line of the post reads: “Ugandans wake up if foreigners can notice this what about you the citizens of this country.”", "The same image was shared here on Facebook.", "Uganda’s President Yoweri Museveni is expected to seek a sixth term in office next year after receiving the endorsement of his National Resistance Movement (NRM) party in June. The former rebel leader is facing a challenge from pop star Bobi Wine and his People Power movement.", "A reverse image search on Google found that the image of Anderson set against the blue backdrop is available on meme generator site Imgflip.", "The site features samples of other memes generated with the same template.", "In the Museveni posts, the headline font and spacing differ from CNN’s official style. The text also contains grammatical errors such as the conjoining of the names “Bobi Wine” and “People Power”.", "A search on CNN for the keywords “Yoweri Museveni” and “dictator” led to this report of Wine referring to Museveni as a dictator and asserting that the Ugandan leader must be ousted by the People Power movement.", "But while there have been other news reports labelling Museveni a dictator, the CNN visual was a hoax.", "AFP previously debunked another manipulated headline using Cooper’s on-air image.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]