["About this rating", "The blogger behind sensational stories about a purported \"Ground Zero Mosque\" project that went viral in 2010 is trying to bring the story back for another round of controversy. And her actions have in turn prompted social media posts expressing outrage that a Muslim house of worship could be built on the site of the 9/11 terrorist attacks in Lower Manhattan.", "A summary of the issue is this: No mosque is being built at Ground Zero. The Ground Zero narrative, criticized by some observers as a manufactured controversy, was initially pushed by Pamela Geller back in 2010. That controversy centered on a proposed Muslim community center to be constructed at 51 Park Place in Lower Manhattan, about three blocks from where the World Trade Center's Twin Towers stood before they were struck by two jetliners and collapsed during the Sept. 11, 2001, terror attacks, killing thousands of people.", "Geller runs an eponymous blog where she almost exclusively writes about what she perceives as the misdeeds of Muslims. She also co-heads the organization Stop Islamization of America, which has, as the Anti-Defamation League reports, \"introduced a growing number of Americans to its conspiratorial anti-Muslim agenda.\"", "On Dec. 16, 2019, Geller published a blog post to the American Thinker website in which she reported that \"The news [of the mosque] was buried under two dense paragraphs and five large photos in an article in New York YIMBY about a different project: 'Construction has also yet to begin on 51 Park Place, which is slated to become a 71-foot-tall, 16,000-square-foot Islamic cultural center.' The infamous Ground Zero Mosque project, a long buried effort to build a triumphal mosque at the site of the worst jihad terror attack in American history, is back.\"", "Geller was referring to a Dec. 1, 2019, article in the New York real estate development publication New York YIMBY (\"Yes in My Backyard\") about the city's skyline. While the information about the development at 51 Park Place was somewhat buried in the article, that was likely because it's not new. Since at least 2014 news outlets have been reporting that the development plans for 43-to-51 Park Place, a high-rise condominium complex, will incorporate a Muslim cultural center and prayer space.", "To be clear, no mosque is being built at 51 Park Place, and the terms \"mosque\" and \"prayer space\" are not interchangeable, said Omar Suleiman, professor of Islamic Studies at Southern Methodist University and founder of the Yaqeen Institute for Islamic Research in Texas.", "Such prayer spaces are known as \"musalla,\" a word that literally translates to \"prayer space\" in Arabic. They are routinely found in predominantly Muslim countries in public places such as airports, shopping malls, and hospitals, according to Suleiman. One such prayer space inhabited the 17th floor of the World Trade Center's South Tower, which was hit by the second jetliner on 9/11.", "We sent Geller questions about her story asking her why she called the development the \"Ground Zero Mosque\" despite its distance from the World Trade Center site. Geller asserted that even though the development is several blocks away from where the Twin Towers stood, the project is under construction on the site of a building that was demolished due to damage from the 9/11 attacks:", "\"Ground Zero was an area, a zone. The building that was torn down to build this was severely damaged in the 9/11 attacks. Landing gear from one of the planes that brought down the Towers crashed through the building’s roof. Human remains were found near the building,\" Geller wrote. She said she doesn't think a Muslim house of worship or cultural center should be built \"in an area that was damaged in the 9/11 attacks.\"", "A Burlington Coat Factory outlet once stood at 45-47 Park Place, and as The New York Times reported, the roof of that building was indeed struck by the landing gear of one of the two jetliners that was crashed into the World Trade Center. Wreckage from that plane was found at the site in 2013.", "But Suleiman noted that Muslims were among the casualties on 9/11, and the premise of the \"Ground Zero Mosque\" story is problematic: It presumes Muslims don't have the right to worship on a site where other Muslims were killed and where their prayer space was destroyed in a terror attack.", "\"Even if [the new development were] a mosque, it’s just pure bigotry to suggest that Muslims are the only ones who can’t have a place of prayer there, when Muslims had a prayer space within the World Trade Center, and Muslims had a significant casualty count as well [on 9/11],\" Suleiman said. \"It’s not just Muslims we mourn, it’s the fact [that] this hit all Americans equally. It’s a tragedy for all Americans, including Muslims.\"", "Suleiman declared that these types of stories are particularly hurtful to him because among the Muslim victims who died on 9/11 was Tariq Amanullah, someone whom Suleiman knew personally.", "\"To squarely put Muslims in the 'villain' category is to intentionally omit history and context, and rob us of our share of being on the side of those who were victimized in the attack,\" Suleiman said.", "We also asked Geller why she chose to report that the \"Ground Zero Mosque\" is \"back,\" even though the information she repeated about it is not new. She responded that she characterized the issue as such \"Because there has been little to no mention of it in years, until the mention I wrote about in my article.\"", "That wasn't the case, however. News outlets have been reporting for years about the progress of work at the site. The developer and founder of SoHo properties, Sharif El-Gamal, drastically scaled back his original vision of a 13-story Islamic community center and mosque called Park51, electing instead to build a luxury condominium tower now known as 45 Park Place. In 2014, The New York Times reported of those plans that:", "The new design replaces [developer Sharif] El-Gamal’s vision of a vast space for public gatherings with more standard New York City fare: a very expensive glass and steel tower for the very rich. The site, which extends from 43 to 51 Park Place, will open in 2019 with 50 apartments at 45 Park Place and a much smaller, three-story Islamic museum and public plaza, designed by Jean Nouvel, but no mosque, at 49-51 Park Place.", "The Times reported again in May 2017 that 45 Park Place was scheduled to \"open in 2019 with 50 apartments at 45 Park Place and a much smaller, three-story Islamic museum and public plaza, designed by Jean Nouvel, but no mosque, at 49-51 Park Place,\" where listings for $1 million-plus condos are now available.", "New York Curbed, a real estate and urban design website, has regularly reported on the site's progress, as have a number of other websites.", "Suleiman told us that \"Ground Zero Mosque\" sensationalism is probably resurfacing because it's election season once again, referring to the upcoming 2020 U.S. presidential election.", "\"This is typical election-season Islamophobic hysteria,\" Suleiman maintained “It spikes not just in the U.S., but everywhere. This is what happened in 2010 — the 'Ground Zero Mosque' story was everywhere, and as soon as the election was over, it completely disappeared.\"", "Suleiman said the latest recurrence is part of a pattern he calls the Islamophobia industry, a network of personalities and websites that \"takes one lie and spins that out to create 100 articles and links, so even if you clarify the one lie, 100 articles pollute Google searches.\" The goal, he averred, is to create a miasma of suspicion about the Muslim community, which isolates it and makes it more vulnerable to attacks.", "\"The machinery they have to churn out these lies is so overwhelming that we just duck and hope people are smart enough to see through it,\" he said.", "Young, Michael.   \"YIMBY’s Annual Construction Countdown Begins with 45 Park Place in Tribeca.\"\r\n    New York YIMBY.   1 December 2019.", "Moore, Rowan.   \"Why Park51 Is Much More Than the 'Mosque at Ground Zero.'\"\r\n    The Guardian.   6 November 2010.", "Otterhman, Sharon.   \"Developer Scales Back Plans for Muslim Center Near Ground Zero.\"\r\n    The New York Times.   29 April 2014.", "Kaysen, Ronda.   \"Condo Tower to Rise Where Muslim Community Center Was Proposed.\"\r\n    The New York Times.   12 March 2017.", "Wiegand, Steve.   \"Tea Party, 'Birthers' Movements Somewhat Aligned, According to Field Poll.\"\r\n    Sacramento Bee.   26 January 2010.", "Harris, Paul and Ewen MacAskill.   \"US Midterm Election Results Herald New Political Era as Republicans Take House.\"\r\n    The Guardian.   3 November 2010.", "Anti-Defamation League.   \"Sacha Baron Cohen's Keynote Address at ADL's 2019 Never Is Now Summit on Anti-Semitism and Hate.\"\r\n    21 November 2019.", "Anti-Defamation League.   \"Stop Islamization of America (SIOA).\"\r\n    19 September 2012.", "Freedman, Samuel G.   \"Muslims and Islam Were Part of Twin Towers’ Life.\"\r\n    The New York Times.   10 September 2010.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]