["Union Minister and BJP MP Giriraj Singh tweeted on December 24 – “Top 10 List of Most Corrupt Political Party in the World 2018 and Rahul Gandhi led congress making it all the way to 2nd spot …congratulations to the most corrupt political party.” In a little over two hours, Singh’s tweet attracted over 1,000 likes and 474 retweets.", "The BJP MP termed the Congress a “shame for India”, basing his claims on an article by ‘bbcnewshub.com’, titled – “Top 10 List of Most Corrupt Political Party in the World 2018”. The article placed the Congress at the second position.", "The list shared by Singh was created by a fake news website posing as the British Broadcasting Corporation (BBC). The distinction between ‘bbcnewshub.com’ and the official bbc.com website is clear.", "Furthermore, the poorly worded article is replete with grammatical errors. “…political parties do hire member or contenders, these parties are also to run and organize elections to decide the government of any country in the world,” reads its first paragraph.", "The ludicrous ‘About us’ section of BBC News Hub also gives away its falseness. It states, “bbcnewshub.com is best place to provide complete, brief, correct, healthy and strong content for the respectable visitors which are related to all over the world. It provides the national and international current and all type of information.”", "Alt News had earlier debunked the same list of ‘most corrupt political parties in the world’. Chairman of Manipal Global Education Mohandas Pai had fallen for this article that has been doing rounds on social media since July this year.", "BBC News Hub had produced one more list that placed Prime Minister Narendra Modi at the 7th place among the most corrupt politicians worldwide. Another fake news website ‘foxnewspoint.com’, imitating American news organisation Fox News, called PM Modi’s family the second most corrupt political family in the world.", "Despite debunking BBC News Hub in the past, Giriraj Singh shared its list to target Congress. The Union Minister had earlier claimed that a tweet by Rahul Gandhi was retweeted by Pakistan’s official defence account. This too turned out to be false as the handle belonged to an online forum that discussed the country’s defence issues.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]