["About this rating", "Inbreeding resulted in a white tiger with unusual facial features.", "The tiger's appearance was not the result of Down syndrome.", "Photographs purportedly showing a \"tiger with Down syndrome\" have been circulating online for several years. Although these images are real, the animal's appearance is not the result of Down syndrome, but rather of inbreeding.", "The photographs show Kenny the White Tiger, a big cat that was rescued from a breeding facility by Turpentine Creek Wildlife Refuge in 1999. While Kenny's face had unusual features that could bear a superficial resemblance to those of a human with Down syndrome, this was not an official explanation of his appearance:", "The diagnosis of Down’s Syndrome is questionable. Down’s Syndrome results from a third copy of chromosome 21. Although a mouse model for Down’s Syndrome exists, tigers have 19 chromosomes to humans’ 23. While Kenny’s face does bear a superficial resemblance to that seen in people with Down’s Syndrome, it’s far from clear that this was the result of a third copy of any chromosome, let alone one that could be matched to our 21st.", "What is clear is that Kenny was a victim of the greed of the breeding industry. White tigers are very rare. With so few of them, the genetic pool is limited, and inbreeding is an inevitable consequence. Kenny’s parents were brother and sister. Most of his siblings were stillborn, or died very young, according to Patricia Quinn, a spokesperson for Turpentine Creek Wildlife Reserve, where Kenny lived from the age of two.", "The Association of Zoos and Aquariums banned the inbreeding of white tigers in 2011, explaining that the practice was \"clearly linked to various abnormal, debilitating, and, at times, lethal, external and internal condition.\" According to BigCatRescue.org, these animals are nearly always born with crossed eyes, and many also have spinal deformities, cleft palates, club feet, and defective organs.", "Kenny the white tiger also suffered from many health problems and had to have a large tumor removed in 2007. Although the surgery was successful, Kenny died in 2008:", "Kenny was ten years old when he passed away — about half the lifespan of a typical tiger.", "Luntz, Stephen.    \"Kenny the White Tiger Reveals the Price of Inbreeding.\"\r\n    IFL Science.    15 August 2014.", "American Zoos & Aquariums.    \"Welfare and Conservation Implications of Intentional Breeding for the Expression of Rare Recessive Alleles.\"\r\n    June 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]