["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. House Minority Leader Rep. Nancy Pelosi hands a gavel to incoming Speaker Paul Ryan on Oct. 29, 2015, shortly before he was sworn in. (Getty Images)", "Even if by one measure he is the most conservative Speaker in decades, the idea of Paul Ryan leading the U.S. House of Representatives is an abomination to some on the right.", "That was evident on Oct. 14, 2015, more than two weeks before the Wisconsin Republican’s colleagues elected him speaker. A conservative political action committee issued a news release announcing its \"Fire Paul Ryan\" campaign.", "The release from the Constitutional Rights PAC made a number of attacks on Ryan, including one about lesbian, gay, bisexual and transgender (LGBT) people.", "\"Paul Ryan would be the most liberal, pro-union, Republican speaker in history,\" said the release, quoting North Carolina Republican Kay Daly, who is running against a GOP incumbent for Congress.", "\"He is one of only six House Republicans who voted for Teddy Kennedy’s bill to force Christian employers to hire LGBT employees. Even John Boehner never did that!\"", "As we’ll see, there are problems with each part of the claim.", "Ryan’s vote", "The Constitutional Rights PAC, based outside of Washington, D.C., says it \"exists to advocate constitutional governance and remind elected servants of the oaths they swore to uphold.\" The PAC takes credit for forcing Boehner, Ryan’s predecessor, to resign, and it ran a \"Fire Kevin McCarthy\" campaign before the California Republican unexpectedly dropped his bid to be speaker.", "The PAC’s attack on Ryan is in reference to the Employment Non-Discrimination Act, known as ENDA, which aims to prohibit employment discrimination on the basis of sexual orientation. It has been introduced a number of times, beginning in 1994, but has never become law.", "The late U.S. Sen. Edward Kennedy, D-Mass., was the main sponsor of the 1996 version of ENDA. The measure died after failing in the Senate on a 50-49 vote.", "So, there was no House vote on the Kennedy bill. Moreover, Ryan wasn’t elected to the House until 1998, two years later.", "A 2007 version of ENDA did pass the House, 235-184. There was never a vote in the Senate. According to a New Yorker article on the history of ENDA legislation, the measure died because it did not include protection for transgendered persons.", "Ryan voted yes on that measure. \"They didn’t roll out of bed one morning and choose to be gay. That’s who they are,\" he once said, acknowledging he \"took a lot of grief\" for the ENDA vote from fellow Republicans.", "The Constitutional Rights PAC, in its original news release, said Ryan was one of only six GOP House members who voted yes. That’s wrong.", "The release was later revised to say 10. But even that count is misleading, in that it only refers only to Republican House members who voted yes on the 2007 bill and are still in the House.", "As we noted, Ryan was among a total of 35 GOP House members who voted yes. Ten are still in the House, plus two others who voted yes are now in the Senate.", "The bill", "The thrust of the PAC’s claim is that the bill Ryan backed would have forced Christian employers to hire people who are lesbian, gay, bisexual or transgender.", "That part of the claim is in error in that the bill did not include transgender people.", "And the \"force\" part of the claim, particularly as it applies to \"Christian employers,\" goes too far.", "The bill would have prohibited employers of 15 or more persons from discriminating in employment -- including hiring, firing and compensation -- on the basis of actual or perceived sexual orientation.", "At the same time, it would have prohibited the adoption of quotas or granting preferential treatment to an individual based on their sexual orientation.", "What’s more, the bill had a religious exemption. For example, it did not apply to a \"religious corporation, association, educational institution, or society which has as its primary purpose religious ritual or worship or the teaching or spreading of religious doctrine or belief.\"", "The bill would not have applied, for example, to a religious school in the hiring of teachers who taught religious tenets, though it would have applied in the hiring of more general positions, such as janitor.", "There would not have been a general exemption, however, for employers who are Christian. For example, under the bill, a Christian owner of a dry cleaning business would have been in violation of the law to not hire a qualified job applicant simply because the person was gay.", "Madison attorney Tamara Packard, who has taught sexual orientation and the law as an adjunct professor at the University of Wisconsin Law School, pointed out to us that there was no affirmative action element or quota in the legislation.", "(She also noted that, despite that federal ENDA legislation has never become law, discrimination in employment against people based on sexual orientation is illegal under Wisconsin law. The state law also includes a religious employer exemption.)", "So, it’s a stretch to say the ENDA bill Ryan voted for would \"force\" Christian employers -- or any employers, for that matter -- to hire lesbian, gay or bisexual people.", "Walter Olson, a senior fellow in constitutional studies at the libertarian Cato Institute, told us that some employers who would not have otherwise hired a gay person would have been forced to do so, if the person was qualified, or risk violating the law.", "But what the bill explicitly would have done is prohibit most employers from discriminating against gay, lesbian and bisexual people based on their sexual orientation -- which isn’t the same as requiring they be hired.", "Our rating", "The Constitutional Rights PAC said Ryan \"is one of only six House Republicans who voted for Teddy Kennedy's bill to force Christian employers to hire LGBT employees.\"", "Ryan was among 35 House Republicans, including 10 still in the House (not six), who voted for a so-called ENDA bill that would have prohibited employment discrimination based on sexual orientation.", "The ENDA bill Ryan voted for, in 2007, was not Kennedy’s bill from 1996.", "The 2007 bill would have protected lesbian, gay and bisexual people, but not transgender people.", "The bill, which exempted religious organizations in the hiring of certain employees, would not have forced employers to hire lesbian, gay and bisexual people but rather would have prohibited discriminating against them based on sexual orientation.", "We rate the statement False.", "More on Paul Ryan", "Blogger Erick Erickson: \"Paul Ryan is one of less than a dozen Republican congressmen to have voted for every bailout to come before Congress.\" Mostly False.", "Ryan: \"Every president since Franklin Delano Roosevelt has had\" fast-track trade authority. Half True.", "Ryan: All 28 members of NATO have \"pledged to spend at least 2 percent of their economy on defense. But only three countries do -- Britain, Greece and us.\" Mostly True.", "Constitutional Rights PAC, Fire Paul Ryan news release, Oct. 14, 2015", "Interview and email interview, Constitutional Rights PAC spokesman Joshua Delano, Oct. 28, 2015", "New York Times, \"‘Fire Paul Ryan’? Rebel PACs hit Republicans, and it pays,\" Oct. 23, 2015", "U.S. House of Representatives, report on Employment Non-Discrimination Act of 2007", "GovTrack.us, House vote on Employment Non-Discrimination Act of 2007", "GovTrack.us, text of Employment Non-Discrimination Act of 2007", "New Yorker, \"Kennedy’s ENDA: A 17-year gay rights fight,\" Nov. 5, 2013", "Interview, University of Wisconsin Law School adjunct professor Tamara Packard, Oct. 27, 2015", "Interview, Cato Institute’s Center for Constitutional Studies senior fellow Walter Olson, Oct. 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]