["About this rating", "On 30 September 2016, Dr. Sandeep Sherlekar was found dead in his office at the American Spine Center in Frederick, Maryland.  According to local police, evidence gathered at the scene indicated  Dr. Sherlekar had taken his own life with an intentional overdose:", "Frederick police said their review of evidence from Dr. Sandeep Sherlekar’s office in the American Spine Center indicated the 51-year-old took his own life, said Sgt. Andrew Alcorn, a Frederick police Criminal Investigations Division supervisor.", "“We are ready to officially call it a suicide and we’re confident that the medical examiner’s office will determine the manner of death was a suicide,” Alcorn said. “There was video inside the business that we reviewed that [shows] the doctor was alone at the time of his death and leading up to it, and he also left several notes.”", "Detectives believe Sherlekar died of an intentional overdose, based on evidence gathered and the lack of any sign of significant trauma to his body, Alcorn said.", "“We don’t know what’s involved in terms of the chemicals used, but it appears to be an overdose,” Alcorn said. “When the [medical examiner] gives us the toxicology reports back, we should know more.”", "Although law enforcement authorities haven't openly stated a motive for the doctor's suicide, it was quite possibly linked to the fact that he and four other medical professionals had recently been indicted by a federal grand jury on charges of agreeing to refer urine specimens to a testing lab for evaluation in return for $1.37 million in kickbacks, conspiring to defraud the IRS, health care fraud, and making false statements on patient medical records.", "Dr. Sherlekar’s death would likely have received little notice outside of Frederick had the conspiracy-mongering whatdoesitmean.com web site not used it as fodder for yet another \"Sorcha Faal\" report that weaves actual events into fabricated narratives of ominous political happenings:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style, but usually includes a sensational headline barely related to reality (e.g. \"American Rebel Forces Attack Gas Pipelines, Explode Trains As US Civil War Nears\") and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service in the same article) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "In this case, WhatDoesItMean spun the doctor's death into a fantasy story playing on rumors about Hillary Clinton's supposedly concealed serious health issues, holding that Sherlekar had been part of a \"specialized medical team\" who secretly removed a blood clot from Hillary Clinton's brain on 30 June 2016 — and then was killed (as part of the \"Clinton body bags\" scheme) to keep him from revealing what he knew about the presidential candidate's medical condition:", "A shocking new report circulating in the Kremlin today prepared by the Foreign Intelligence Service (SVR) says that the infamously named “Clinton Body Count” has now increased after a Maryland (US) based doctor was discovered dead under mysterious circumstances — and who had, this past June, been part of a specialized medical team that removed a blood clot from the brain of Hillary Clinton.", "According to this report, Hillary Clinton has long been known to have grave health issues since she collapsed in December, 2012, and that led to her first operation to remove a blood clot from her brain — and that her husband, former President Bill Clinton, recently stated took her 6 months to recover from.", "This past summer, however, this report continues, on 30 June, SVR analysts state that Hillary Clinton collapsed on her private plane while in route to her Washington D.C. home and was unconscious when it landed at Joint Base Andrews — which is the home base of the 89th Airlift Wing that manages the flights of all top American officials, including the President.", "Performing the emergency brain surgery on Hillary Clinton at the MedStar Montgomery Medical Center on 30 June, this report continues, was the Islamic neurosurgeon Amjad Anaizi who is her private brain doctor whom she frequently visits at the MedStar Georgetown University Hospital near her home in Washington D.C. — and who, also, is the cousin of Hillary Clinton’s top aid Huma Abedin who is linked to the Muslim Brotherhood terror organization.", "Attending Doctor Anaizi in his operating on Hillary Clinton’s brain to remove the blood clot that had rendered her unconscious, this report says, was Doctor Sandeep Sherlekar who was the on call anesthesiologist at MedStar Montgomery Medical Center — but who, exactly 3 months later, on 30 September, was discovered dead.", "Doctor Sandeep Sherlekar’s death fits exactly the profile of all of the other deaths associated with the Clinton Crime Family — with the victim fist “knowing to much”, then having “their personal and professional reputations destroyed”, with the final act being “their mysterious death” as a message for others to not dare cross these most dangerous of criminals.", "All of this was just another yarn that was, as usual, aggregated as a factual news report by a number of bottom-feeding web sites.  Hillary Clinton underwent no emergency brain surgery on 30 June 2016: She attended a fundraising luncheon in San Francisco the day before, then returned to Washington, D.C. for a  2 July interview with the FBI regarding allegations that classified information was improperly stored or transmitted on a personal e-mail server she used while serving as Secretary of State.", "It's highly unlikely a 68-year-old patient who had just been through major brain surgery would have been up to sitting through a grueling 3.5-hour questioning just two days later, or that the FBI would have conducted such an interview under those circumstances.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]