["[Warning: Distressing visuals]", "A video where a tribal woman from Madhya Pradesh was brutally beaten with sticks by her family members is viral on social media with false claims. The incident had occurred on June 25, 2019 in Dhar district where the 21-year-old was reportedly thrashed for eloping with a Dalit man and refusing to marry a man from her community.", "Among the first claims used to circulate the video was one which blamed ‘saffron terrorism’ for the attack. In the video, a man can be seen wearing a saffron-coloured scarf with religious inscription. The message used to share the video said – “#भगवा_आतंकवाद भाजपा की शान #बेटी_बचाओ_बेटी_पढ़ाओ किस तरह 8-10 लड़के मिलकर एक लड़की को मार रहे हैं ₹50 का भगवा गमछा जिसमे राम लिखा हो गले में डालकर आपको कुछ भी करने की आजादी है यही है @narendramodi का#न्यू_डिजिटल_इंडिया (Saffron terrorism BJP’s pride. Teach the girl child, save the girl child. 8-10 men are thrashing a girl. In Narendra Modi’s new India, you are allowed to do anything if you sport a Rs 50 saffron scarf.)”", "The video was shared two years later with a similar message in Gujarati blaming the RSS – “ભારત ના જવાન મર્દ .RSS ના ભડવીરો,,,એક લાચાર દલીત છોકરી ને ખેતર. માં કુદરતી હાજત કરવા બદલ કૂરરતાપૂણઁ લાકડીઓ વડે ફટકાર તા ,,,,,,આ પોસ્ટ ને બેટી બચાવો ના નારા લગાવનારા ઓ સુધી પહોચાડે.”", "Another user claimed that she was beaten by RSS workers for urinating on a farm owned by a Brahmin.", "The second assertion takes a far more hateful narrative. Giving the incident a communal colour, social media users claimed that a Hindu woman was thrashed by Muslims. “#Share किस तरह 8-10 लड़के मिलकर एक लड़की को मार रहे हैं मुल्लो सुधर जाओ 1 हिन्दू लड़की से बदला लेना वो भी इस तरह से थू हे तेरे धर्म पे भारत में ऐसी घटना हर रोज कहीं न कहीं हो रही है ऐसे लोग इंसान नहीं शैतान है इन्हें गोली मार देनी चाहिए (#Share 8-10 men are beating a girl. Improve yourselves, Mullas. Taking revenge on one Hindu girl and that too in such a manner is shameful. Such incidents are occurring in India every day in the name of your religion. These people are not humans but devils. They should be shot dead.)”", "The video gained substantial momentum on social media, with many believing it to be from Uttar Pradesh. The incident, however, took place in Madhya Pradesh and had nothing to do with either ‘saffron terrorists’ or members of the Muslim community.", "UP police clarified that the attack happened in MP’s Dhar district and that the police have begun legal proceedings against the perpetrators.", "In a conversation with Alt News, Dhar SP Aaditya Pratap Singh rubbished social media claims. “The woman had eloped with a man from a different community. When she returned, her family wanted her to get married to a man from her community. When she refused, she was beaten by her relatives. Four have been arrested and three others have fled to Gujarat. They will soon be taken into custody,” he said.", "The incident was widely reported in mainstream media.", "It is commonplace on social media for the truth to be twisted and presented in a provocative manner. Any claim that rouses passion should be cross-checked with credible media reports.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]