["Facebook users expressed their shock on a post from the Philippines displaying the photos, including one showing the bears strung up on a boat, that was shared more than 50,000 times since it was first published in August.", "Similar viral posts in Spanish provoked the same types of reactions from users.", "“Where is your heart,” the post asked in Tagalog, without offering further information besides sad face and broken heart emojis.", "Some commenters wondered where the pictures were taken and questioned their veracity, while others lamented the apparently badly injured state of the animals.", "But the photos are not real. They’re from the marine conservation activist group Sea Shepherd Global, which released a campaign in 2011 asking the public to imagine a panda in the place of a tuna when looking at fishing pictures called “When you see a tuna, think panda.”", "A representative for the organization told AFP on Facebook that the renewed viral response was “exactly” the kind of reaction the group was going for when they first published the photos.", "“It shows the hypocrisy that we were trying to put on display, that people will care for pandas, but not for fish, when they are also endangered.”", "The Sea Shepherd Global campaign was specifically focused on the bluefin tuna, for which there is high demand because of the fish’s popular use in sushi and sashimi.", "An AFP report from 2010 says the fish, which lives in temperate waters from the equator to northern Norway, and from the Gulf of Mexico to the Black Sea, are expensive (fetching up to $160,000 at auction), becoming increasingly rare and can be difficult to catch.", "The quota for the number of tuna allowed to be fished each year became a topic of hot debate in 2009, when the International Commission for the Conservation of Atlantic Tunas (ICCAT), charged with the regulation and conservation of the species, ignored scientific guidelines and established annual fishing quotas above expert recommendations.", "\"ICCAT has continually disregarded countless opportunities to do the right thing and secure the Atlantic bluefin tuna and guarantee the recovery of this species,\" Susan Lieberman, director of international policy at the Washington-based Pew Environment Group, told reporters, including AFP, in 2009.", "The Atlantic bluefin tuna is included on the International Union for the Conservation of Nature’s (IUCN) list of endangered species.", "In 2017, AFP reported that Paulus Tak, a senior officer for the Pew Charitable Trust, which was an official observer of ICCAT talks, said that year’s expansion of bluefin tuna country quotas by up to 50 percent to 36,000 tonnes in 2020 was an “enormous step backwards” for conservation.", "The IUCN lists the giant panda as “vulnerable,” one rank more stable than the tuna’s “endangered” classification.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]