["About this rating", "In September 2020, an old meme supposedly containing a quote from U.S. President Donald Trump, in which he declares that Mexicans love him and call him a \"peachy cool arrow,\" started to recirculate on social media:", "But Trump did not boast about being called \"peachy cool arrow\" by his Mexican supporters.", "This is a joke built from a simple play on words. While \"peachy cool arrow\" may seem like a harmless phrase in English, it sounds like \"pinché culero,\" which is a Mexican phrase for \"ignorant asshole.\"", "This translation error is mentioned in some versions of this meme. In September 2020, for example, the Facebook page Occupy Democrats shared this meme along with a definition of the Mexican phrase:", "It certainly would have been a bit ironic if Trump actually did brag about being a \"peachy cool arrow.\" While Trump has said that \"Hispanics love me,\" we've found no record of him making this \"peachy\" statement.", "The linguistic humor in the above-displayed meme seems to play off of a \"false friend\" or a \"cross-language homophone,\" where a word in one language sounds like a word in another language, despite having a different meanings. For example, the word \"fart\" in English means \"speed\" in Sweden.", "In August 2019, we examined another rumor concerning the \"false friend\" relationship between Trump's campaign slogan \"MAGA,\" which stands for \"Make America Great Again,\" and the Nigerian Pidgin term \"maga,\" which means \"easily fooled idiot.\"", "Saul, Heather.   \"Donald Trump Declares 'the Hispanics Love Me – They Were Chanting for Me' After Being Met by Protesters at US-Mexico Border.\"\r\n    Independent.   27 July 2015.", "Parti, Tarini.   \"Biden Leads Trump Among Latino Voters, Poll Shows.\"\r\n    Wall Street Journal.   20 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]