["Indu Makkal Katchi, a Tamil Nadu-based right-wing political party, tweeted a picture (disturbing imagery, viewer discretion is advised) of a brutally injured man lying dead. As per their claim, a member of the Rashtriya Swayamsevak Sangh (RSS) was killed by “extremists” in Kumbakonam municipality in Thanjavur district of Tamil Nadu. This tweet has been retweeted over 3,000 times (archived link).", "Similarly, several Twitter and Facebook users shared the image along with same text, “Swayam Sevak’s father murdered by extremist In Kumbakonam”. Some users have added a communal angle to the claim (archived link). Twitter user @AnitaShivyogi tagged Prime Minister Narendra Modi and Home Minister Amit Shah and wrote, “This is unacceptable! Naxals and Jihadis are carrying out these murders of @RSSorg members and Hindu Sadhus. Are police and judiciary incapable of dealing with this one-sided violence? We haven’t forgotten the Palghar lynchings yet” (archived link).", "[Also read: Palghar lynching incident falsely communalised on social media]", "Another user @singhakh who identifies as a swayamsevak also claimed that the RSS worker was killed at the entrance of the Kumbakonam Perumal temple because he opposed the temple’s takeover and illegal sand mining.", "Bharatiya Hindu Parivar Tamil Nadu went a step further and claimed that the man in the viral image was assassinated by the terrorists during a pro-CAA protest at Nachiyar Temple in Kumbakonam. As per this post, the man in the viral image is 65-year old Gopalakrishnan (archived link).", "Alt News performed a keyword search on Twitter and found a Tamil news report by One India which said that RSS member Gopalan (65) was murdered over a property dispute. The accused is BJP member Saravanan. The same was reported by Tamil Nadu-based newspaper Dinamalar.", "65 வயது ஆர்எஸ்எஸ் பிரமுகரை.. கத்தியால் சரமாரியாக குத்தி கொன்ற.. பாஜக நிர்வாகி.. ஷாக்கில் கும்பகோணம்! https://t.co/hKjSgPmxvG #bjp #murder #kumbakonam #oldman", "— Oneindia Tamil (@thatsTamil) July 1, 2020", "We spoke with Kumbakonam Town DSP. He said, “The murder happened due to property dispute. There is no communal angle. Both accused and the victim hail from the Hindu community. The accused was arrested on July 1.” The accused has been booked under multiple sections of the Indian Penal Code (IPC), including 302 (Punishment for murder). The DSP also informed, “Sarvanan worked as a tailor and was affiliated with the BJP.”", "Alt News was able to access a copy of the FIR which states that Gopalan was stabbed by Saravanan on June 30 at 9.20 pm because of a property dispute.", "Therefore, the murder of an RSS worker over a properly dispute was communalised on social media. The accused is a BJP member from the same community yet the incident has sparked an anti-Muslim wave. Furthermore, opponents of the Citizenship Act are also being falsely blamed for the murder.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]