["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Gwen Moore took to the House floor on Nov. 29, 2017, to criticize the House tax bill that Republicans hope will become law before the end of the year. The Milwaukee Democrat started with a sarcastic reference to a book authored by Donald Trump before he became president, saying:", "Mr. Speaker, I proudly present the \"art of the deal.\" The tax deal before us would provide permanent tax cuts for individuals who are multi-millionaires and billionaires. With this deal, all middle-class families will eventually face a tax increase, since tax relief for them expires.", "We’ve rated as Half True a claim by the biggest backer of the House tax bill, House Speaker Paul Ryan, R-Wis. We found that savings for some middle-class Wisconsin households would reach $2,000 in 2018 but would get smaller each year after that.", "So, what about Moore’s claim about the tax bill’s impact nationally?", "Would multimillionaires and billionaires get permanent tax cuts, while all middle-class families would initially see a tax cut, but later get a tax increase?", "The bill", "To support Moore’s claim, her office pointed us to a Washington Post Wonkblog analysis that summarized the House bill this way:", "Big businesses get a large, permanent tax cut, while American families receive only temporary tax relief that expires\" in 2023. The tax increase would mostly hit moderate and middle-income families because a credit designed to help them expires after five years.", "A $300-per-parent family credit that would be created with the House bill does expire in 2023. But the credit would be available to all families, not just the middle class, though arguably it means more to middle-class families than to higher-income ones.", "Let’s dig a little deeper.", "Here’s what we know from a PolitiFact National article and our own reporting.", "The rich:", "The House bill makes changes that benefit higher-income earners more than the middle class, even if there aren’t specifically provisions for millionaires or billionaires. Those include permanent reductions to the corporate income tax rate, a lower pass-through business income tax rate and repeal of the estate tax, which is only paid by the ultra wealthy.", "The net tax cuts going to the richest 1 percent increases from about 34 percent in 2019 to 47 percent in 2027 under the House bill, according to the Institute on Taxation and Economic Policy. That’s partly because the tax cuts titled to the wealthiest are permanent.", "The middle class:", "The Tax Foundation found that, comparing the House bill to current law, the average taxpayer in the middle class would see an increase in their after-tax income -- that is, a tax cut -- in each year from 2018 through 2027.", "But just because the average taxpayer would get a cut doesn’t mean that all taxpayers would. The Urban Institute-Brookings Institution Tax Policy Center says that by 2027, roughly 25 to 30 percent of middle-class households would face a tax increase relative to current law. That’s because a family tax credit created by the bill would expire after 2022 and the because law uses a slower-growing measure of inflation for things such as the standard deduction, which has the effect of raising taxes over time.", "Two notes:", "While the Tax Foundation and the Tax Policy Center are respected for their research, there isn’t a universal definition of \"middle class.\"", "It’s not clear which provisions in the tax bill approved by the House will be in the final version of the legislation to be considered by both the House and the Senate.", "Our rating", "Moore says the House tax plan \"would provide permanent tax cuts for individuals who are multi-millionaires and billionaires,\" but \"all middle-class families will eventually face a tax increase, since tax relief for them expires.\"", "The richest do benefit from tax cuts that are permanent, but most in the middle class also would see lower taxes each year from 2018 through 2027. It’s estimated that only 25 to 30 percent of middle-class households, not all of them, would see a tax increase by 2027.", "We rate Moore’s statement Half True.", "YouTube, U.S. Rep. Gwen Moore statement on House floor, Nov. 29, 2017", "Email, Rep. Gwen Moore spokesman Eric Harris, Dec. 6, 2017", "Washington Post, \"In political gamble, GOP gives permanent tax cuts to corporations, but not people,\" Nov. 15, 2017", "Washington Post Wonkblog, \"The House just passed its big tax bill. Here’s what is in it,\" Nov. 16, 2017", "Tax Policy Center, \"Brief Distributional Analysis of the Tax Cuts and Jobs Act as Passed by the House Ways and Means Committee,\" Nov. 13, 2017", "Email, Tax Policy Center senior research associate Joseph Rosenberg, Dec. 12, 2017", "PolitiFact National, \"Steve Mnuchin uses partial data to say GOP tax bill favors middle-income households,\" Nov. 20, 2017", "Email, Tax Foundation analyst Amir El-Sibaie, Dec. 11, 2017", "Institute on Taxation and Economic Policy, \"National and 50-State Impacts of House and Senate Tax Bills in 2019 and 2027,\" Dec. 6, 2017", "Email, Institute on Taxation and Economic Policy deputy director Meg Wiehe, Dec. 8, 2017", "Email, Committee for a Responsible Federal Budget spokesman Patrick Newton, Dec. 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]