["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An artist creates an image of George Floyd on May 28, 2020, in Minneapolis. (AP)", "George Floyd died in Minneapolis police custody on May 25 after a white police officer kneeled on his neck.", "Video evidence of the encounter and investigations from local and federal prosecutors do not suggest Floyd’s death was staged.", "Conspiracy theories that allege a tragedy was staged or fabricated often circulate online following major news events.", "As protests in Minneapolis turned violent, some Facebook users falsely said the event that sparked them was staged by police.", "A May 28 post claims the death of George Floyd was a \"staged event.\" Floyd, a 46-year-old black man, died in police custody May 25 after being handcuffed and pinned down by a white officer.", "\"I think there is at the very least the ‘possibility,’ that this was a filmed public execution of a black man by a white cop, with the purpose of creating racial tensions and driving a wedge in the growing group of anti deep state sentiment from comon (sic) people, that have already been psychologically traumatized by Covid 19 fears,\" reads the post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has been shared thousands of times and copy-pasted by other users.", "(Screenshot from Facebook)", "There is no evidence to back it up. We reached out to the original poster for a comment, but we haven’t heard back.", "After a video of Floyd’s death started to circulate on social media, protesters took to the streets in Minneapolis. Four police officers involved in the incident were fired. The officer who knelt on Floyd’s neck was taken into custody and charged with third-degree murder and manslaughter on May 29.", "The video shows police who were dispatched to a Minneapolis store May 25 after receiving a 911 call alleging that Floyd had paid with a counterfeit bill. Two officers detain Floyd near a police car; one of them has his knee on Floyd’s neck.", "\"Please, I can't breathe,\" Floyd says in the video, before going silent after several minutes of pleading with police.", "Another angle of the encounter shows three officers watching as the arresting officer, Derek Chauvin, presses his knee into Floyd’s neck. Law enforcement experts have broadly condemned the technique.", "The FBI and Justice Department are investigating Floyd’s death as a possible violation of federal civil rights laws. Hennepin County and federal prosecutors are also looking into the possibility of bringing additional charges against the officers involved in the incident. We reached out to the Minneapolis Police Department for a comment, but we haven’t heard back.", "None of the investigations have disputed that the video shows Floyd’s death — and that Chauvin kneeled on Floyd’s neck, killing him.", "The nearly 1,000-word Facebook post weaves together a series of speculations and unrelated facts, the motives of the officers and the timing of the incident to spin an unproven conspiracy theory. None of it confirms that the incident was staged.", "Conspiracy theories that allege a tragedy was either staged or fabricated commonly circulate online following major news events. False claims that Floyd’s death was staged first started bubbling up in Facebook groups for supporters of President Donald Trump on May 27. From there, they spread to other conspiratorial groups, according to CrowdTangle, an audience analytics tool.", "The Facebook post is inaccurate and makes a ridiculous claim. We rate it Pants on Fire.", "Associated Press, \"'That’s just not taught': Police, experts condemn knee restraint on George Floyd,\" May 28, 2020", "CNN, \"Minneapolis police release 911 call that led to encounter with George Floyd,\" May 29, 2020", "CNN, \"4 Minneapolis cops fired after video shows one kneeling on neck of black man who later died,\" May 26, 2020", "CrowdTangle, accessed May 29, 2020", "Facebook post, May 27 2020", "Facebook post, May 27, 2020", "Facebook post, May 28, 2020", "Facebook post, May 29, 2020", "Facebook post, May 29, 2020", "PolitiFact, \"Why do some people think mass shootings are staged every time?\" Aug. 8, 2019", "USA Today, \"Federal authorities pledge 'robust' investigation into George Floyd's death; Minnesota National Guard activated: What we know,\" May 28, 2020", "USA Today, \"George Floyd.\" May 28, 2020", "The Washington Post, \"Derek Chauvin, the officer involved in George Floyd’s death, is taken into custody,\" May 29, 2020", "YouTube video from CBS Evening News, May 27, 2020", "YouTube video from WCCO, May 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]