["A 25-second video of a mob beating a policeman has recently gone viral. The visuals show a woman hitting the cop with slippers. It is being claimed that ‘peacefuls’ (perojative term used for Muslims) began attacking the policeman after he issued a challan. UP BJP State Working Committee member Ashish Singh Mahi tweeted the clip, writing, “Peacekeepers are beating up the Bareilly Police for issuing challans. What kind of people neither respect the law nor the justice system?” He tagged the UP Police and BJP Uttar Pradesh spokesperson Shalabh Mani Tripathi. This video had been viewed more than 53,000 times at the time of writing. (Archive link)", "बरेली पुलिस द्वारा चालान काटने पर शांतिदूतों ने उनकी पिटाई की है , ये किस प्रकार के लोग हैं जो ना कानून का सम्मान करते हैं ना न्याय व्यवस्था का.@Uppolice @shalabhmani और @myogiadityanath जी बुलडोजर से नीचे कुछ भी स्वीकार नहीं।😡 pic.twitter.com/cKlqHQSqp9", "— Ashish Singh Mahi🇮🇳 (@ashishmahi4bjp) January 21, 2021", "Twitter user @gagangoyal1968 also claimed that the incident took place in Bareilly. His tweet received more than 54,000 views and was also quote-tweeted by Madhu Kishwar. A vocal supporter of the BJP, Kishwar has often been found sharing misinformation that has been documented here. (Archive link)", "कोई हैरानी नहीं कि देश भर में पुलिस अफसर मुस्लिम इलाकों में जाने में डरते है! हजारों मिनी पाकिस्तान बनने दिए हमारे हुक्मरानों ने। भारत के टुकड़े करने कि तैयारी पूरी है और हमारी सरकार में हिम्मत नहीं जों खुल के यह खतरा स्वीकार भी कर सकें https://t.co/45gzfbXJlY", "— Madhu Purnima Kishwar (@madhukishwar) January 21, 2021", "Facebook user ‘Chaukidar EK Real Hindustani’ also posted the video and accompanying claim. (Archive link)", "Bareilly police द्वारा चालान काटने पर शांतिदूतों की ऐसी हरकत सामने आयी हैं😡 शायद ये भूल गए की महाराज जी की प्रदेश में कानून का सम्मान नहीं करोगे तो ऐसी अराजक हरकत का अंजाम क्या होगा, ऐसे लोगो पर शख्त से शख्त कारवाई होनी चाहिए इनका इलाज जरुरी हो गया है।", "Posted by Chaukidar EK Real Hindustani on Thursday, January 21, 2021", "This clip is being circulated widely on Facebook and Twitter.", "Alt News performed a keyword search and this led us to an Aaj Tak video story from August 29, 2018. In an incident from Ghaziabad, a woman and some bystanders assaulted a policeman. They punched, kicked, and hit the cop with a pair of slippers. The report also carries a statement by then SSP Vaibhav Krishna.", "Ghaziabad Police had posted Vaibhav Krishna’s video statement on its official Twitter handle on August 27, 2018. The officer says that a man had gotten into an argument with a bank employee in the Loni Police Station area of Ghaziabad. According to the SSP, when the police arrived “some locals, including the woman seen in the clip, began getting physical with the PRV (police response vehicle) personnel. A complaint has been registered in this case. Two people have also been arrested. The others seen in these visuals will be arrested soon.”", "#Ghaziabadpolice ~ सोशल मीडिया पर वायरल थाना लोनी बॉर्डर क्षेत्र की वीडियो जिसमे ‘पुलिसकर्मी के साथ महिला/युवक द्वारा बदतमीजी/मारपीट’ की जा रही है। उक्त सम्बन्ध में जानकारी देते हुए @SspGhaziabad की वीडियो बाईट। @dgpup @Uppolice @adgzonemeerut @igrangemeerut @upcoprahul pic.twitter.com/TTZ0xuOXxm", "— GHAZIABAD POLICE (@ghaziabadpolice) August 27, 2018", "Jagran reported on August 27, 2018, that a video of a man and his companions beating a policeman with slippers outside the State Bank of India in Balram Nagar Colony on Monday went viral, causing havoc in the department. Reportedly, a fight broke out between a young man, named Imran, and the bank’s employees, over the creation of an Aadhaar card. The article also states that amid the ruckus, the constables posted in PCR 2172 slapped Imran, causing him to faint and fall to the ground. Seeing his condition angered his family members. The woman beating Constable Anoop Kumar with slippers is Imran’s sister. Imran was later admitted to the hospital, meanwhile, the bank employee filed a complaint against him and his family.", "A 2018 fact-check report by Navbharat Times pertaining to the incident included a press release that lists the names of the accused – 1. Imran, son of Mr. Israel 2. Rashid, son of Akhtar 3. Mohammed Israel, son of Mr. Abdul Shakur 4. Faim, son of Mr. Mohammed Naeem. The four had been arrested while the search for the remaining accused was still on.", "Apart from this, the Bareilly Police replied to a tweet containing the viral video and wrote, “As far as this video is concerned, it is two years old and from Ghaziabad. The Ghaziabad Police has already investigated and taken action in this incident.”", "Therefore, the viral clip of a group of people assaulting a constable is not from Bareilly, but Ghaziabad’s Loni Police Station area. A row ensued when a man had an argument with a bank employee over an Aadhar card. Locals got into a physical altercation with the police as well when they arrived.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]