["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ben Carson invoked one of America’s most notorious foes in his closing statement at the Feb. 13 Republican presidential debate in South Carolina.", "\"I, like you, am a member of ‘we, the people,’ \" Carson said, addressing the audience. \"And we know that our country is heading off the cliff. Joseph Stalin said, ‘If you want to bring America down, you have to undermine three things: our spiritual life, our patriotism and our morality.’ We, the people, can stop that decline.\"", "The problem is that in all likelihood, this is not a real quote from the former Soviet leader. Stalin led the communist nation from the 1920s until his death in 1953, and it is believed that millions died during his regime.", "Searches for the quote do not turn up in any history books, scholarly works or primary sources. Mostly it’s just social media sharables with the quote text next to a picture of Stalin.", "Our friends over at Snopes looked into a similar quote and concluded that it’s \"highly unlikely that Stalin ever spoke these words.\" It seems dubious that Stalin would say something like this, as the quote, in a sense, compliments America for its strengths, Snopes noted.", "We searched through an online Stalin Archive and an online library compiled by the University of Pennsylvania. Our searches came up empty.", "It’s unclear where this quote originated. The earliest use of the quote Snopes found was in a 1983 letter to the editor in a Kansas newspaper.", "It’s possible that Stalin said this quote in a speech or in a letter that was never translated into English or never put on the Internet. But the burden is on Carson to back up his words with evidence.", "If new evidence pops up to the contrary, we’ll revisit this article.", "We reached out to Carson’s campaign but haven’t heard back.", "Our ruling", "Carson quoted Stalin as saying, \"If you want to bring America down, you have to undermine three things: our spiritual life, our patriotism and our morality.\"", "All signs point to this being a fake quote that has made its way around the Internet.", "We rate Carson’s claim Pants on Fire.", "Snopes, \"Joseph Stalin described America as a healthy body with three fold resistance,\" November 2011", "Marxists.org, Stalin Internet Archive, accessed Feb. 13, 2016", "University of Pennsylvania, Stalin online books library, accessed Feb. 13, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]