["By Katherine Hartzell", "Posted on May 27, 2020", "A meme circulating on Facebook — and retweeted by President Donald Trump — falsely claims former President Barack Obama is the “first ex-president to speak against [his] successor.” Actually, many U.S. leaders criticized those who followed them into the White House.", "Since leaving office in January 2017, Former President Barack Obama has largely avoided commenting on the actions of President Donald Trump. But on May 8, during a phone call with 3,000 former members of his administration, Obama said — without referring to Trump by name — that the White House response to the global pandemic has been “an absolute chaotic disaster.”", "Obama, May 8: It would have been bad even with the best of governments. It has been an absolute chaotic disaster when that mindset — of “what’s in it for me” and “to heck with everybody else” — when that mindset is operationalized in our government.", "Two days later, Trump retweeted a meme of Obama’s photo with the words, “FIRST EX-PRESIDENT TO SPEAK AGAINST SUCCESSOR.” This and similar memes began to spread across Facebook and Twitter, all claiming that presidents never speak ill of their successors.", "But that’s not true.", "“President Obama is surely not the first president to criticize his successor,” presidential historian Doris Kearns Goodwin said in an email to FactCheck.org.", "“By no means is this behavior something that is ‘unprecedented’ or has ‘never happened’ before,” Lara Brown, an associate professor and the director of the Graduate School of Political Management at the George Washington University, also told us in an email.", "In fact, former presidents have been downright insulting at times. “President Theodore Roosevelt called his successor President William Howard Taft a fathead, a puzzle-wit with the brain of a guinea pig,” Goodwin said.", "“President Herbert Hoover claimed the despotism of President Franklin Roosevelt was poisoning America. Hoover worked for the last 20 years of his life on a massive indictment of FDR’s handling of World War II. He was so obsessive about this that his heirs decided not to have it published and put it into storage,” said Goodwin, who won the 1995 Pulitzer Prize in history for her book, “No Ordinary Time: Franklin and Eleanor Roosevelt: The Home Front in World War II.”", "In more recent times, Jimmy Carter “criticized President Bill Clinton’s morals after the Monica Lewinsky scandal and criticized President Ronald Reagan for a perceived failure to accept his responsibilities as president,” Goodwin said.", "Carter also called George W. Bush’s administration the “worst in history” in terms of “adverse impact on the nation around the world.”", "So, no, Obama was not the first president to criticize his successor.", "However, Goodwin said that “in recent decades there has been an unwritten code that presidents, who are members of this very exclusive club, should respect their colleagues.” She said that the “club” is thought to have been established by Hoover and Harry Truman at Dwight Eisenhower’s funeral in 1969.", "“President John F. Kennedy had said that no one knows how tough the job is until he’s been in it a few months,” Goodwin also noted.", "In fact, many presidents seek counsel and offer to help one another, and Goodwin said there are many examples of collaboration, even across party lines.", "Upon receiving an invitation to the White House from Truman, Hoover “took the first train to Washington, D.C. and was able to give Truman valuable advice on how to deal with the famine in Europe for he had been involved with relief after World War I,” Goodwin said.", "Kennedy sought advice from Eisenhower at Camp David after the failed Bay of Pigs mission, and “President Lyndon Johnson traveled to President Harry Truman’s hometown to sign the Medicare bill to honor Truman for having called for it,” she said.", "George H. W. Bush, George W. Bush and Clinton “were able to transcend their differences in politics to become close friends, even though Clinton defeated the elder Bush,” Goodwin also said. “Bush 43 put his father and Clinton together to help with relief effort for Hurricane Katrina, and has even declared Clinton his ‘brother with a different mother.'”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Brown, Lara. Associate professor and director of the Graduate School of Political Management, George Washington University. Email to FactCheck.org. 20 May 2020.", "“Carter pipes up, calls Bush’s way ‘worst in history.'” Arkansas Democrat Gazette. 19 May 2007.", "Fancher, Julie. “George W. Bush, ‘brother with another mother’ Bill Clinton share Oval Office wisdom at Dallas forum.” Dallas Morning News. 13 Jul 2017.", "Freking, Kevin. “Obama Lashes out at Trump in call with supporters.” Associated Press. 9 May 2020.", "Goodwin, Doris Kearns. Presidential historian and author. Email to FactCheck.org. 20 May 2020.", "Middlecamp, David. “Crossing Party Lines: When JFK Sought Advice From Ike.” San Luis Obispo Tribune. 4 Aug 2017.", "Nguyen, Tina. “No-Drama Obama Steps Out of Retirement to Subtweet Trump.” Vanity Fair. 29 Jul 2019.", "“Once upon a time in America.” Hoover Heads – The blog of the Herbert Hoover Library and Museum. 7 November 2016.", "Rushay Jr., Samuel W. “The Ike & Harry Thaw.” National Archives. Accessed 22 May 2020.", "Trump, Donald (@realDonaldTrump). “He got caught, OBAMAGATE!” Twitter. 10 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]