["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• The National Guard told PolitiFact that the request to move the troops is believed to have come from a Capitol Police officer acting on his own authority, not from Joe Biden or Kamala Harris.", "• Axios and Fox have reported that the Biden administration has awarded a contract to use hotel rooms to house and process migrant families. But the contract was for $86 million, not $89 million. Previous administrations, including Donald Trump’s, have used hotels to process migrant families. ​", "Shortly after National Guard members were summoned to Washington to secure President Joe Biden’s inauguration, viral images emerged showing some troops sleeping in parking garages near the U.S. Capitol.", "As the photos circulated on social media, they sparked wide outrage from lawmakers and the general public. Since the Jan. 21 incident, social media users have spread unsubstantiated rumors alleging that specific politicians were responsible for pushing the National Guard troops out of the Capitol.", "A March 21 Facebook post takes that false claim and adds a new twist: \"Joe Biden and Kamala Harris forced our troops to sleep on the floor of a garage, yet has authorized $89 million for hotel rooms for illegal immigrants, who broke the law to get into this country,\" it says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The troops were stationed in the Capitol amid fears that new violence would occur after the attack on the building on Jan. 6, 2021. However, there is no evidence that Biden, Vice President Harris or members of the Biden administration ordered the National Guard down to the garages.", "The exact reasons for the National Guard’s relocation are murky. Separate organizations have reported conflicting statements about who requested the move.", "But National Guard spokesperson Wayne Hall told PolitiFact that the order to relocate did not come from the new president or vice president. Asked Monday about the incident, Hall said the Guard now believes it came as a request from a Capitol Police officer, who was not acting at the behest of anybody in authority.", "Politico and other outlets, including the Associated Press and the Washington Post, also reported Jan. 21 that the National Guard said the instruction to relocate came from a Capitol Police officer.", "But in a statement released the morning of Jan. 22, Acting Capitol Police Chief Yogananda Pittman denied responsibility for the order, saying that with the exception of specific times on Inauguration Day, Capitol Police \"did not instruct the National Guard to vacate the Capitol Building facilities.\"", "\"The Department is also working with the Guard to reduce the need for sleeping accommodations by establishing shorter shifts,\" Pittman said, \"and will ensure they have access to the comfortable accommodations they absolutely deserve when the need arises.\"", "According to the New York Times, Biden called Gen. Daniel R. Hokanson, the chief of the National Guard Bureau, on Jan. 21 to express his dismay about the incident and ask what he could do to help.", "The second part of the claim, that the White House has authorized $89 million for hotel rooms for people who enter the country illegally is missing context.", "Axios has reported that the Biden administration awarded an $86 million contract to use hotel rooms to provide shelter and processing services to around 1,200 migrant family members, citing unnamed officials from the Department of Homeland Security. The president of Endeavors, the Texas nonprofit that got the contract, confirmed the news to Fox.", "However, the use of hotels near the border to house migrants is not a new development. Previous administrations, including the Trump administration, have used hotel rooms to house children and families who enter the country illegally.", "A Facebook post says, \"Joe Biden and Kamala Harris forced our troops to sleep on the floor of a garage, yet has authorized $89 million for hotel rooms for illegal immigrants, who broke the law to get into this country.\"", "There is no evidence that Biden and Harris ordered the National Guard to relocate from the Capitol to parking garages. The Guard told PolitiFact that the request to move the troops is believed to have come from a Capitol Police officer.", "Axios and Fox have reported that the Biden administration awarded a contract to use hotel rooms to provide shelter and processing services for migrant families. The contract was for a little less, $86 million, and the Biden administration is not the first administration to use hotels near the border to house children and families who enter the country illegally.", "This claim contains an element of truth but ignores critical facts that would give a different impression.", "Mostly False.", "Facebook post, Mar. 21, 2021", "AP, Guard in DC forced to sleep in garages, sparking outcry, Jan. 22, 2021", "Axios, Scoop: ICE securing hotel rooms to hold growing number of migrant families, Mar. 20, 2021", "Fox Business, Biden administration awards ICE $86M contract to secure hotel rooms for illegal families, Mar. 21, 2021", "New York Times, Biden joins public outcry after Guard soldiers seen resting in a parking garage, Jan. 22, 2021", "New York Times, A private security company is detaining migrant children at hotels, Oct. 21, 2020", "Washington Post, ‘This is absurd’: Hundreds of National Guard members banished to Senate parking garage, soldiers say, Jan. 22, 2021", "U.S. Capitol Police, Statement of Acting Chief Pittman regarding National Guard Accommodations, Jan. 22, 2021", "The National Guard, National Guard Support to the District of Columbia, Jan. 21, 2021", "New York Times, National Guard troops who protected the Capitol for Biden’s Inauguration were told to sleep in a parking garage., Jan. 21, 2021", "PolitiFact, No evidence lawmakers forced National Guard into parking garage, Jan. 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]