["About this rating", "On 19 December 2016, the ThinkProgress web site published an item reporting that due to ambiguous \"political pressure,\" Kuwait had \"allegedly\" moved an annual \"National Day\" celebration from a Four Seasons hotel to a Trump hotel:", "The Embassy of Kuwait allegedly cancelled a contract with a Washington, D.C. hotel days after the presidential election, citing political pressure to hold its National Day celebration at the Trump International Hotel instead.", "A source tells ThinkProgress that the Kuwaiti embassy, which has regularly held the event at the Four Seasons in Georgetown, abruptly canceled its reservation after members of the Trump Organization pressured the ambassador to hold the event at the hotel owned by the president-elect.", "In the early fall, the Kuwaiti Embassy signed a contract with the Four Seasons. But after the election, members of the Trump Organization contacted the Ambassador of Kuwait, Salem Al-Sabah, and encouraged him to move his event to Trump’s D.C. hotel, the source said.", "In a phone conversation on Tuesday, Ambassador Al-Sabah confirmed that the National Day event will be held at the Trump International Hotel. Al-Sabah also acknowledged that, prior to the election, the event was scheduled at the Four Seasons, an arrangement he described as a “save the date,” rather than a contract.", "Al-Sabah denied that he received pressure to move the event or discussed the event with the Trump Organization. He said he moved the event because the Trump Hotel is a new venue and “why not?”", "He initially denied that he or anyone else at the embassy had spoken to anyone in the Trump Organization. But, asked if he could say definitively there had been no contact, Al-Sabah acknowledged that he had “lots of friends” and that he “may have” spoken to a Trump associate after the election. He denied that the event was discussed or that he received any pressure to move it.", "The ThinkProgress article mentioned their having viewed \"documentary evidence\" confirming the account but didn't describe what sort of \"political pressure\" Kuwaiti diplomats might have endured, or how President-Elect Trump's interests purportedly influenced the event's move.", "Al-Sabah affirmed it was possible he spoke to an associate of Trump after the election but maintained that the conversations in question were not about Kuwait's \"National Day\" venue selection.", "In a tweet, the author of the piece maintained that the scenario he described was an \"impeachable offense\":", "Pressure on Kuwait to move event to Trump hotel a ‘paradigm impeachable offense’ https://t.co/OvK4CBDURr pic.twitter.com/NBjcijb4Ua", "— Judd Legum (@JuddLegum) December 20, 2016", "Al-Sabah reiterated his response about the issue to the Washington Post, where he more assertively denied any political pressure influenced Kuwait's decision:", "Kuwaiti Ambassador Salem al-Sabah said he felt no pressure to hold his event at the hotel and had not been contacted by the Trump Organization, contradicting aspects of a report Monday from the liberal website ThinkProgress. In previous years, Sabah and his wife, Rima, a power couple on the Washington dinner-party circuit, have held the embassy’s National Day celebration at the Four Seasons Hotel in Georgetown.", "“I do not know President-elect Trump. Or his people. No one has contacted me about moving the event,” Sabah said. “It was solely done with the intention of providing our guests with a new venue. We have been holding the event at the Four Seasons for years. There is a new hotel in town, and we thought we would give it a try.”", "Besides, this would not be the first move from the Four Seasons. Last year, Sabah said the event was held at the Newseum.", "The ThinkProgress report said Kuwait “cancelled” a contract at the Four Seasons for the event “under political pressure.” Sabah called the characterization “totally wrong and totally false.” He said he had asked the Four Seasons to reserve that time but hadn’t broken any contract and decided on the Trump hotel after hearing positive reviews from others who held events there, just as he had done with the Newseum last year.", "“I heard some positive feedback from those who attended events there. Nobody contacted me. Nobody pressured me at all,” he said.", "Legum, Judd.   \"Under Political Pressure, Kuwait Cancels Major Event at Four Seasons, Switches to Trump’s D.C. Hotel.\"\r\n    ThinkProgress.   19 December 2016.", "O'Connell, Jonathan.   \"Kuwaiti Embassy Is Latest to Book Trump D.C. Hotel, But Ambassador Says He Felt ‘No Pressure.'\"\r\n    Washington Post.   20 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]