["On December 10, Reliance chairman Mukesh Ambani’s son Akash Ambani and daughter-in-law Shloka Ambani were blessed with a baby boy. In the backdrop of this, a three-minute video has been shared on Facebook and Twitter with the claim that it shows their baby shower. Along with the Ambanis, we can also see Maharashtra Chief Minister Uddhav Thackeray, Amitabh Bachchan, Aamir Khan and several other Bollywood stars. The social media claim suggests that COVID-19 protocols — social distancing and masks — were not followed.", "(The video has been shared with the following Hindi text: *मुकेश अंबानी के पोते के जन्म की पार्टी ।।* *मुम्बई में कोरोना खत्म हो गया है।* *मुख्यमंत्री उद्धव ठाकरे खुद भी है, न मास्क, न सोशल डिस्टनसिंग, क्यों सब कानून आम जनता के लिये हैं । बड़े लोगों को कोरोना नहीं होता । अमिताभ बच्चन दूसरों को दिन में 100 बार फोन करो तो फोन पे 101 बार पका रहा है खुद बिना मास्क और बिना सोशल डिस्टनसिंग के कोरोना से जंग लड़ रहा है । सेलिब्रिटी ने कोरोना वेक्सिनेशन लगवा ली है क्या ?? ईनी लोगो को, कोरोनावायरस के साथ कनेक्ट कर रहे हैं)", "Alt News has received several requests on WhatsApp (+917600011160) and our official Android application to authenticate this claim.", "Alt News performed a keyword search and found that the video is from 2019 Ganesh Chaturthi party by Ambanis. YouTube channel BollywoodTelevision uploaded the video on September 3, 2019. The viral video is clipped from the 28:07 mark which shows Mukesh Ambani hugging Aamir Khan. Uddhav Thackeray is also seen with him. Lokmat Hindi published a video about this event. It was also reported by The Economic Times.", "The following screenshots compare the scenes in the viral with the video uploaded by BollywoodTelevision.", "This slideshow requires JavaScript.", "As per Times of India, in 2019 Ganesh Chaturthi was observed from September 2 to 12. However, the first case of COVID-19 in India was reported in January 2020 and COVID-19 related protocols were not practised in India until the first phase of lockdown was announced on May 24.", "Ministry of Home Affairs guidelines for the 21-day lockdown, list of essential services that will remain open. #CoronavirusLockdown pic.twitter.com/hwRgWEM88z", "— ANI (@ANI) March 24, 2020", "Thus, a video of 2019 Ganesh Chaturthi celebration by the Ambanis was shared with the false claim that the video is recent.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]