["United States Senator for California Kamala Harris speaks at the \"Families Belong Together: Freedom for Immigrants\" March on Saturday, June 30, 2018, in Los Angeles. (Photo by Willy Sanjuan/Invision/AP)", "Sen. Kamala Harris, D-Calif., has recently made it a point to support affordable housing, both in her social media posts and in the legislation she brings before Congress.", "On July 19, Harris introduced the Rent Relief Act to Congress, which would provide assistance in the form of a refundable tax credit to those who make under $100,000 a year and spend more than 30 percent of their income on housing.", "To rally support for the bill, she tweeted, \"In 99 percent of counties in America, someone making the minimum wage working full time can’t afford a 1-bedroom apartment.\" She later posted a video that expressed a similar sentiment and repeated the statistic.", "In 99% of counties in America, someone making the minimum wage working full time can’t afford a 1-bedroom apartment. That is outrageous. I've just introduced the Rent Relief Act, so that Americans who spend over 30% of their income on rent can get a portion of that money back.", "We decided to look into Harris’s statement.", "Aside from a few minor caveats, the statement is largely accurate.", "Out of reach?", "We began by reaching out to Harris’s press secretary, who directed us to a 2017 study published by the National Low Income Housing Coalition titled \"Out of Reach.\" The study is updated yearly, and the 2018 edition is out.", "Harris’s press secretary pointed out a line from the latest study that reads, \"In only 22 counties out of more than 3,000 counties nationwide can a full-time minimum wage worker afford a one-bedroom rental home at fair market rent.\" That statistic and the coalition’s report overall have been cited by various news outlets.", "Do the math, and you’ll see that 22 divided by 3,000 comes out to a figure slightly smaller than 1 percent. That small percentage refers to the counties where a one-bedroom home is affordable for minimum-wage workers.", "But there are two concepts in the sentence from the study that require further clarification: affordability and \"fair market rent.\"", "The national coalition defines \"affordability\" as \"consistent with the federal standard that no more than 30 percent of a household’s gross income should be spent on rent and utilities.\" That’s the same guideline used by the Department of Housing and Urban Development, and we found it’s a standard threshold within the field.", "The definition of \"fair market rent\" is slightly different. It also has its origins from HUD. The National Low Income Housing Coalition defines it as \"typically the 40th percentile of gross rents for standard rental units.\"", "So that means that within any given metropolitan area, 40 percent of all rental properties are priced equal to or below the fair market rent threshold. That means not all units within the 99 percent of counties referred to in Harris’s tweet are unaffordable for full-time minimum-wage workers, but it does mean that a majority — 60 percent — are.", "Of the remaining 40 percent of one-bedroom housing, some units may be affordable for those workers, but that doesn’t mean they’ll be quality apartments — they might be in a high-crime area or low-performing school district, for example. (We previously cleared up the definition of \"fair market rent\" in a fact-check of a Facebook graphic.)", "As Vincent Reina, a professor at the University of Pennsylvania School of Design, put it, \"It does not mean there are 0 affordable units (in the 99% of counties that Harris is referring to), it means that there are none affordable at or above the 40th percentile of the rent distribution. There are likely some units that are affordable, just not even close to enough.\"", "The experts we reached out to pointed out that the conclusions reached by the National Low Income Housing Coalition are supported by other research, including a recent study published by the Joint Center of Housing Studies of Harvard University.", "\"Not all the studies would support the exact claim that 99 percent of counties in the U.S. are unaffordable, but there’s a lot of evidence that the poorest families (say the bottom 20-25 percent) are financially stretched to afford unsubsidized housing,\" said Jenny Schuetz, a David M. Rubenstein Fellow in the Metropolitan Policy Program at the Brookings Institution.", "Our ruling", "Harris recently tweeted, \"In 99 percent of counties in America, someone making the minimum wage working full time can’t afford a 1-bedroom apartment.\"", "She was referring to a recent study by the National Low Income Housing Coalition, which shows that \"in only 22 counties out of more than 3,000 counties nationwide can a full-time minimum wage worker afford a one-bedroom rental home at fair market rent.\"", "Harris didn’t refer to the concept of \"fair market rent,\" which is defined as the \"40th percentile of gross rents for standard rental units.\" The underlying study she referenced doesn’t say that a minimum wage worker can’t afford any housing in almost all of the United States, but that a minimum wage worker can’t afford the average-priced housing unit.", "With that said, Harris’s claim is still a largely accurate characterization of the magnitude of the rent affordability problems that many people face.", "We rate this claim Mostly True.", "Sources:", "Tweet from Kamala Harris, July 19, 2018", "Tweet from Kamala Harris, July 23, 2018", "Email exchange, Tyrone Gayle, press secretary for Kamala Harris, July 24, 2018", "Email interview, Robert Silverman, Professor of Urban and Regional Planning, University at Buffalo, July 24, 2018", "Email interview, Jenny Schuetz, David M. Rubenstein Fellow, Metropolitan Policy Program, Brookings Institution, July 24, 2018", "Email interview, Vincent Reina, Assistant Professor of City and Regional Planning, PennDesign, July 24, 2018", "Email interview, Sarah Mickelson, Senior Director of Public Policy, National Low Income Housing Coalition, July 25, 2018", "Email interview, Susan J. Popkin, Urban Institute Fellow, July 25, 2018", "Kamala Harris, Rent Relief Act of 2018", "Curbed, \"Can a federal tax credit help rent-burdened Americans?,\" July 20, 2018", "PolitiFact, \"Minimum wage means most 2-bedroom apartments are out of reach,\" September 28, 2014", "CNN.com, \"There’s not a single US state where a minimum wage worker can afford a 2-bedroom rental, a report says,\" June 15, 2018", "National Low Income Housing Coalition, \"Out of Reach: The High Cost of Housing,\" 2018", "National Low Income Housing Coalition, \"Out of Reach: The High Cost of Housing,\" 2017", "Fast Company, \"This map shows how much you need to earn to rent an apartment in the U.S.,\" June 12, 2017", "Joint Center for Housing Studies of Harvard University, The State of the Nation’s Housing 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]