["An audio clip is being shared on Twitter in the name of United Kingdom-based steel magnate Lakshmi Mittal. India-born Mittal is chairman of ArcelorMittal, world’s largest integrated steel and mining company. The speaker in the audio file can be heard airing his views on topics like PM Modi, secularism, Hindu identity of India, and Ram Janambhumi. The clip is being circulated with the claim that the words are spoken by Lakshmi Mittal.", "— 𝙰𝖓𝖆𝖓𝚍i ❤️ॐ #ImwithAdani (@Anandi_sanatani) January 25, 2023", "Alt News received multiple requests on its WhatsApp helpline number for fact-checking the audio clip.", "This slideshow requires JavaScript.", "Here are a few statements from the audio clip:", "“It was Nehru’s fault to have declared India as a secular country. Today 99% of the politicians are bending backwards to appease the minorities.”", "“Who the f*** cares if we are a secular state or not.”", "“He is the one PM we have had who thinks of India first and we are accusing him because he is a Hindu.”", "“Ram Janambhumi has been hanging fire for 350 years. Can you imagine the same thing happening in Rome?”", "“Hindus are one community that has been subjugated, humiliated, massacred.”", "“India was left behind because British ruled us at a time when industrial revolution was happening the world over.”", "“When they have found a messiah in Modi, why is everyone up in arms?”", "The full audio clip can be heard here:", "There are a number of clues in the clip that give away the fact that Lakshmi Mittal, Chairman of the ArcelorMittal group, is not making these statements.", "To begin with, the voice and the accent in the audio do not match with the available samples of Lakshmi Mittal’s voice.", "There are other clues that point out that the speaker is not Lakshmi Mittal.", "The person in the audio narrates:", "“My grandfather was one of the second largest steel manufacturers in the country after Tatas. And we were so heavily restricted by the British government, not to allow, not to manufacture more. We were not even allowed to manufacture screws and nails which used to be imported from Sheffield and Manchester and Bristol.” He further says, “I have friends in UK and Germany. I worked for 3 1/2 years in Munich.”", "The family’s steel business was established by Lakshmi Mittal’s father, Mohanlal Mittal post-independence and there are no records of his grandfather running India’s second-largest steel company during British rule. According to the listing of the Mittal family in Forbes richest families list, Mittal’s father Mohan Lal started the family’s steelmaking business in the 1950s. Facing constraints at home, he sent Lakshmi to Indonesia in 1976 where he set up a plant.", "Moreover, an official handle of ArcelorMittal has itself has clarified that the speaker in the audio file is not Lakshmi Mittal.", "An audio file is circulating online claiming to be remarks on Indian politics and religion by our Chairman and CEO. We do not know who the speaker is, but it is not Mr Lakshmi Mittal.", "— ArcelorMittal (@ArcelorMittal) September 19, 2019", "It is clear that the audio clip is being circulated with a false narrative in an attempt to give it credibility by portraying it as views of one of the most successful businessmen in the world.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]