["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.\n\nOn Sept. 15, 2020, Democratic presidential candidate Joe Biden participated in a roundtable with a group of veterans in Tampa, Florida. The conversation hit on many of the difficulties that were currently facing the United States, such as the COVID-19 pandemic, which had already left more than 200,000 people in the U.S. dead. Near the end of the event, Biden said that despite the hardships facing the country, he was optimistic about America's future.", "Here's a transcript of a portion of Biden's remarks (emphasis added):", "I am, ironically, more optimistic about the prospects of dealing with the problems we talked about today, as well as so many other problems we have right now, than I have ever been in my whole career. And you say, 'Why in the hell would you say that, Biden? You just talked about all these difficulties.' Well, I'll tell you why. Because the American public, the blinders have been taken off. They've all of a sudden seen a hell of a lot clearer. They are saying: 'Jeez, the reason I was able to stay sequestered in my home is because some Black woman was able to stack the grocery shelf, or I got a young Hispanic out there, or these dreamers out there, 60,000 of them, acting as first responders and nurses and docs.' Or, all of a sudden people are realizing, my lord these people have done so much -- not just black, white but across the board -- have done so much for me. We can do this. We can get things done. And I think they're ready and the irony of all ironies is that I think it's the vehicle by which we're going to be able to create really good paying jobs. We're going to be able to provide for significant health care. The idea that in the middle of a pandemic -- the worst thing since the great flu back at the turn of the century, where so many people died worldwide -- is that people, you know, people are figuring out that we are all in this together. We can get through this if we just level with one another. Just tell the truth. Let people know.", "A few weeks after this event, a 10-second clip of Biden's remarks started to go viral as it was shared by social media users claiming that Biden had made a racist remark.", "For example, a member of the group Students for Trump wrote: \"Joe Biden literally said the reason he was able to stay quarantined ... Was because 'some black woman was able to stock the grocery shelf.' And people still think Trump is the racist one.\"", "This is a genuine video of a remark Biden made during a round table in Tampa, Florida, in September 2020. However, this video — and the many social media posts spreading this video — failed to put Biden's remarks in their proper context. The full quote shows that Biden was making a point about different groups pulling together in the fight against the coronavirus.", "Here's a longer video from C-SPAN showing Biden's remarks before and after the quote:", "https://www.c-span.org/video/?c4912795/user-clip-biden-round-table", "Roche, Darragh.   \"Fact-check: Did Joe Biden Say 'Some Black Woman' Stocking Shelves Was Why He Could Stay In Amid COVID?.\"\r\n    Newsweek.   6 October 2020.", "Wulfsohn, Joseph.   \"Biden Suggests People Were Able to Quarantine Because 'Some Black Woman Was Able to Stack the Grocery Shelf' in Viral Clip.\"\r\n    Fox News.   5 October 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]