["About this rating", "President Donald Trump's feud with Democratic U.S. Senator Elizabeth Warren of Massachusetts resumed in October 2018 after Trump falsely denied offering a challenge to Warren's claim that she had Native American ancestry.", "On 14 October 2018, the Massachusetts lawmaker released to the Boston Globe a report of a DNA test showing that, contrary to remarks by the president and other conservatives, Warren did indeed have \"an unadmixed Native American ancestor.\"", "According to Stanford University Carlos D. Bustamante, who conducted the test, Warren's ancestor was part of her family tree \"in the range of 6-10 generations ago.\" Warren has claimed that her great-great-great-grandmother, O.C. Sarah Smith, also had Native American heritage.", "On 5 July 2018, Trump -- who has slurred Warren for years by calling her \"Pocahontas\" -- said that if he were to debate her, he would bring a \"little kit\" for her to provide proof of her heritage:", "We will take that little [DNA] kit, but we have to do it gently. Because we're in the #MeToo generation so we have to be very gentle. And we will very gently take that kit and we will slowly toss it, hoping it doesn't injure her arm even though it only weighs probably two ounces. And we will say:  I will give you a million dollars, paid for by Trump, to your favorite charity, if you take the test and it shows you’re an Indian.", "But when asked about the pledge in light of Warren's revelation, the president first dismissed it, then denied ever having made his $1 million offer. \"Who cares?\" he said. \"I didn't say that. You'd better read it again\":", "Pres. Trump on Sen. Elizabeth Warren releasing results of DNA test: \"Who cares?\" The results show \"strong evidence\" Warren had a Native American ancestor dating back several generations, The Boston Globe reported today. https://t.co/OUOL0SMa9j pic.twitter.com/3D64gkNDHO", "— ABC News (@ABC) October 15, 2018", "Warren responded via Twitter, calling on Trump to make his donation to the National Indigenous Women’s Resource Center:", "By the way, @realDonaldTrump: Remember saying on 7/5 that you’d give $1M to a charity of my choice if my DNA showed Native American ancestry? I remember – and here's the verdict. Please send the check to the National Indigenous Women’s Resource Center: https://t.co/I6YQ9hf7Tv pic.twitter.com/J4gBamaeeo", "— Elizabeth Warren (@elizabethforma) October 15, 2018", "In a follow-up tweet, Warren explained:", "NIWRC is a nonprofit working to protect Native women from violence. More than half of all Native women have experienced sexual violence, and the majority of violent crimes against Native Americans are perpetrated by non-Natives.", "Send them your $1M check, @realDonaldTrump.", "I took this test and released the results for anyone who cares to see because I've got nothing to hide. What are YOU hiding, @realDonaldTrump? Release your tax returns – or the Democratic-led House will do it for you soon enough. Tick-tock, Mr President.", "Trump asserted, in reaction to the story, that his offer was a future conditional one that only applied if Warren won the Democratic nomination, he debated her, and he could \"test her personally\":", "We all know why @realDonaldTrump makes creepy physical threats about me, right? He’s scared. He’s trying to do what he always does to women who scare him: call us names, attack us personally, shrink us down to feel better about himself. It may soothe his ego – but it won’t work. pic.twitter.com/2rfPSlvlQA", "— Elizabeth Warren (@elizabethforma) October 15, 2018", "Linskey, Annie.   \"Warren Releases Results of DNA Test.\"\r\n    Boston Globe.   15 October 2018.", "Fox News.   \"Trump Blasts 'Pocahontas' Elizabeth Warren at Rally.\" \r\n    5 July 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]