["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A warning spreading on social media urges Black men and boys to not travel alone Nov. 6-8 because, according to some posts, the NAACP got a tip about white nationalist groups conducting initiation killings over the weekend.", "But the NAACP has denied this.", "\"The NAACP has received credible information that some of the white nationalist groups, neo nazi’s and white supremacist groups have initiations happening this weekend,\" one Facebook post said. \"As part of the initiation it is said that they will be looking to snatch black men and boys and hang them, shoot them, tortue them and kill them. So please spread the word. Do not let your sons go out alone. Pay attention to your surroundings. If you made friends with someone recently, do not be gullible and naive they may have another motive… Be cautious. STAY PRAYED UP!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On Nov. 5 the National NAACP posted on its website that it had not made such a statement, and that a similar warning over the Fourth of July weekend was also wrong.", "Trovon Williams, the group’s vice president of marketing and communications, posted a video on Twitter that day saying that \"while the NAACP takes all matters of racial discrimination and racial hatred and domestic terrorism very, very seriously, we thought it was important enough to let you all know at this moment that those claims are false. NAACP has not come into contact with any such information.\"", "The Georgia chapter of the NAACP has also said that the information circulating on social media \"is false and not credible.\"", "\"We are calling on all Georgians to remain calm as election results surface throughout the week,\" the group’s president, Rev. James Woodall, said in a statement. \"We are getting numerous reports of misinformation that is being used to invoke fear in our communities as a distraction to our huge success in Black voter participation.\"", "We rate this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 6, 2020", "NAACP, Statement on recent posts claiming to be from NAACP, Nov. 5, 2020", "Trovon Williams tweet, Nov. 5, 2020", "Georgia NAACP, Georgia NAACP alerted of false messages circulating about white militia targeting Black males, Nov. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]