["About this rating", "A CVS employee in West Lafayette, Indiana, mistakenly refused to accept a customer's Puerto Rican driver's license as a valid form of identification.", "The customer claims that CVS demanded to see a visa and confronted him on his immigration status. CVS said that it was not able to substantiate this accusation in its investigation and that it might have been the result of a misunderstanding stemming from the employee's initial mistake.", "Drug store chain CVS apologized after employees in West Lafayette, Indiana, mistakenly refused to accept a college student's Puerto Rican driver's license when he tried to purchase cold medicine in late October 2019, prompting snowballing internet outrage that became national news. The incident resulted from pervasive ignorance of the fact that Puerto Rico is a U.S. territory and its residents are Americans.", "In an impassioned Facebook post that went viral, the student's mother lashed out, writing, \"For those of you who don’t know, we are a United States Territory,\" Arlene Payano Burgos wrote in frustration on Oct. 25, 2019. \"Everyone born in Puerto Rico is born a United States Citizen. Puerto Rican men and women have served in every major war that the United States has fought in, including the American Revolution. Puerto Rican soldiers have served and died fighting for 'The great American Nation.'\"", "That post went viral and has been seen and shared thousands of times, prompting CVS to both apologize and state that employees will be reminded that identifications issued in U.S. territories like Puerto Rico are valid.", "The incident started when Purdue University junior Jose Guzman Payano, an engineering major, fell ill and went to CVS in search of the cold medication Mucinex on Oct. 25, 2019. Because some cold medicines like Mucinex contain dextromethorphan, which can be abused, CVS requires that anyone seeking to purchase the product must provide identification. When Guzman Payano did so, the CVS employee mistakenly refused his driver's license because it was issued in Puerto Rico. When he asked to speak to a store manager, he got the same response.", "CVS took responsibility for the employees' error, apologized, stated the incident was isolated, and noted that all employees will be reminded that valid forms of ID include licenses issued in U.S. territories like Puerto Rico.", "After investigating the incident, CVS stated it found no evidence that its employees interrogated Guzman Payano about his immigration status but rather that, that aspect of the accusation was the result of a misunderstanding.", "The chain of events was as follows:", "In an emotional Facebook post on Oct. 25, 2019, Burgos wrote that her son called her after attempting to buy cold medicine at CVS, telling her his Puerto Rico-issued identification was refused. Burgos wrote, \"When [the cashier] saw the license she then asked him for his visa, and started confronting him about his immigration status.\"", "Burgos continued, \"I guess I should be thankful that he wasn’t thrown in the back of an ICE van and interrogated, or worse. I can’t help to be ANGRY, OUTRAGED, and DISGUSTED. The current issues we are experiencing in the United States related to immigration, ICE raids, and rampant racism are directly fueled disgracefully by President Trump. What happened to my son today is not unlike what many other families have had to face since Trump was sworn into office and it’s completely unacceptable. Enough is enough. The men that signed the Declaration of Independence stated that all men are created equal. Our founding fathers must be rolling over in their graves.\"", "After going viral the story was picked up by the local news media and before long it became national news. Dystopian headlines reported a chilling event in which a routine trip to the drugstore turned into a \"show-me-your-papers\" nightmare, playing on underlying societal anxiety and anger over President Donald Trump's hostile stance on immigration.", "The story sparked such headlines as, \"CVS rejects Purdue student's Puerto Rican ID, asks for immigration papers to buy cold medicine.\" Another read, \"Student: CVS workers rejected Puerto Rico ID, asked for visa.\"", "Speaking to the Lafayette Journal & Courier, Guzman Payano said he ended up with a case of bronchitis and was only able to get medicine for it when a friend drove him to another drugstore.", "Guzman Payano, who has been in West Lafayette since the start of the fall 2017 semester, said he was a weekly customer at the CVS store at 720 Northwestern Ave., on the ground floor for the Fuse building. It was close to campus, he said, and he’d be able to pick up a few other things while he was there.", "He said he rang up the items in a self-scan checkout and waited for a store clerk when the machine’s screen noted that an ID check was required for the cold medicine. When he showed his ID – one that met the Real ID criteria – a clerk told him it wasn’t enough.", "“She said I needed a visa,” Guzman Payano said. “I tried to explain that Puerto Rico was part of the United States. I didn’t need a visa or anything. She just said the same thing three times.”", "He said he had his U.S. passport, so he showed that, with no luck. He said the store employee told him he still needed to see some sort of immigration status before he could buy the cold medicine.", "“That’s when I realized what was happening,” he said. “It wasn’t worth talking anymore.”", "When questioned about this aspect of the story, CVS sent Snopes a follow-up statement acknowledging that U.S. passports are also valid forms of identification. But employees typically don't handle customers' passports and will instead ask the customer to locate the page with the needed information, the store said, which may have been interpreted by Guzman Payano as the employee demanding his immigration information.", "\"CVS accepts US passports as valid identification,\" the CVS statement said. \"Our employees will typically ask a customer using a US passport to open it to the page showing date of birth so that employees are not opening it themselves and viewing other personal information. We regret the reason for this request may have been misunderstood by our customer in West Lafayette.\"", "Burgos seemed to put a close to the affair with a Nov. 3 Facebook post thanking people for their support but also admonishing others not to take their anger out on CVS employees:", "My family and I are so grateful for the outpouring of support and love we have received following my post regarding the incident that happened with my son at CVS. I can’t thank everyone enough for that but we would like to ask that we all remember to treat each other with respect. Furthermore I ask that no one harass or threaten any CVS staff in relation to this incident. Let’s all be the better person in this situation. Thank you all again for the support and love for my family.", "Puerto Ricans have been U.S. citizens since 1917, but a 2017 poll found that almost half of Americans were unaware of that fact.", "Bangert, Dave. \"Purdue Student: CVS Rejects Puerto Rican ID, Asks for Immigration Papers to Buy Cold Medicine.\"\r\n  Lafayette Courier & Journal. 3 November 2019.", "Dropp, Kyle and Brendan Nyhan. \"Nearly Half of Americans Don’t Know Puerto Ricans Are Fellow Citizens.\"\r\n  The New York Times. 26 September 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]