["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rowan County Clerk Kim Davis returned to work Sept. 14, 2015, surrounded by sheriff's deputies and her son, Nathan Davis, after a judge ordered her to jail for refusing to issue marriage licenses to same-sex couples. (AP)", "Kentucky clerk Kim Davis is back on the job. The Rowan County official drew an ardent following when she refused to issue marriage licenses to same-sex couples. She also spent a few days in jail for failing to follow a U.S. Supreme Court ruling legalizing such unions.", "This prompted a group on Facebook called Conservative News Today to post an interesting comparison.", "\"Lesbian judge Tonya Parker refused to perform heterosexual marriages for three years. Never reprimanded.", "\"Christian clerk Kim Davis obeys Kentucky law and U.S. constitution. Gets thrown in jail.\"", "Here’s the image shared by at least 59,000 people:", "Set aside the accuracy of the statement that Davis obeyed the law. (The U.S. Supreme Court does have the final word on constitutional issues.) At the heart of this post is the claim that the case of a Texas judge who refused to perform heterosexual weddings exposes a double standard in the case against Kentucky clerk Kim Davis.", "That comparison falls wide of the facts.", "Judge Tonya Parker", "Parker was elected to the 116th Judicial District Court of Texas in 2010. She was the first openly homosexual person elected to a judgeship in Dallas County, and in 2012, she said in a speech that she was refusing to perform marriage ceremonies until same-sex couples gained the same rights as their opposite-sex counterparts.", "\"I don't perform marriage ceremonies because we are in a state that does not have marriage equality and until it does, I'm not going to partially apply the law to one group of people that doesn't apply to another group of people,\" Parker told a meeting of the Stonewall Democrats of Dallas.", "Parker later explained in an email to news organizations that \"I do not, and would never, impede any person's right to get married.\"", "She simply declined to conduct marriage ceremonies herself. Given that at that time, the only legal marriages in Texas were between opposite-sex couples, de facto, Parker was refusing to marry heterosexuals. We should note that she didn’t single out such couples. They were the only ones she had the opportunity not to officiate over.", "According to news reports, Parker faced no official sanctions as a result of her policy.", "Does that put her in the same boat as Davis? No.", "Judges and clerks play different roles", "The side-by-side comparison treats judges and clerks as if they play the same role in the marriage process. That's not true.", "While it is the responsibility of clerks to issue marriage licenses, judges do not share that obligation.", "Generally speaking, judges don’t marry people, said Alexandra Albright, who teaches Texas civil procedure at the University of Texas at Austin Law School.", "\"They can perform marriages in Texas, but it’s not their job,\" Albright said. \"Most judges I know marry people they know. It’s a thing they do for friends.\"", "Albright said a judge like Parker is expected to spend her time presiding over lawsuits brought before her. When it comes to marriage ceremonies, the Texas code authorizes a range of people to officiate. The list includes clergy, a designated officer of any religious organization, a variety of judges, justices of the peace, and retired judges and justices of the peace.", "In contrast, a clerk like Davis holds a unique gatekeeper position in the marriage process.", "\"You can’t get married without a marriage license,\" Albright said. \"There all kinds of people who can perform wedding ceremonies.\"", "Our ruling", "A conservative group on Facebook said the case of a Texas judge who refused to perform heterosexual weddings exposes a double standard in the case against Kentucky clerk Kim Davis. The comparison fails because a judge in Texas and a clerk in Kentucky play different official roles in the marriage process. Texas law authorizes many people, including judges, to perform marriages. Doing so is optional.", "In Kentucky, couples must have a marriage license issued by a clerk to get married. Davis’ refusal shut the door on marriage for same-sex couples, at least in her county.", "We rate this claim False.", "Conservative News Today, Facebook post, Sept. 7, 2015", "ABC News, Gay Texas Judge Refuses to Perform Marriage Ceremonies, Feb. 24, 2012", "Dallas County, 116th Judicial District Court - Judge Biography", "State of Texas, Family code: Sec. 2.202", "Dallas Voice, Gay Dallas judge won’t conduct marriages because they ‘can’t be performed for me’, Feb. 22, 2012", "New York Times, Kim Davis Takes Break From Work, but Commotion Goes On, Sept. 9, 2015", "Interview, Alexandra Albright, senior lecturer, School of Law, University of Texas at Austin, Sept. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]