["By Angelo Fichera", "Posted on January 14, 2021", "A falsehood on social media claims President Donald Trump has “invoked” the Insurrection Act, seized control of the country through the military and will “remain president indefinitely.” A Defense Department spokesman told us he was not “aware of any actions” regarding the Insurrection Act.", "In the days before President Donald Trump was impeached for a second time — this time charged with “incitement of insurrection” following the Jan. 6 riot at the Capitol — social media users spread a false claim that the president had invoked a rarely used law in a bid to take control of the country through the military.", "Some of the posts went on to say he would therefore remain in office “indefinitely” until “all domestic enemies are arrested.”", "But it is not true that Trump is using the military to try to stay in power through his authority under the Insurrection Act, as the various posts have claimed. The law gives the president the authority to deploy the military to settle widespread unrest if a state requests it, or if U.S. laws are being obstructed by the unrest.", "A Department of Defense spokesman told us by phone that he was not “aware of any actions on behalf of the DOD to take actions … in response to the Insurrection Act.” He further referred us to the White House, which didn’t respond to our inquiry.", "Trump has, in fact, acknowledged that President-elect Joe Biden’s Jan. 20 inauguration will occur.", "The false claim was peddled widely across social media platforms in recent days, in the aftermath of the riot at the Capitol and as thousands of National Guard members were dispatched to provide security in Washington, D.C., ahead of the inauguration.", "One post on the social media platform Parler came from an account called “@TeamTrumpNews” and was made to look like a message from Trump himself; the name on the account was “Donald J. Trump” and the profile picture showed the president, which could give users the false impression that it was Trump’s account. It declared he had invoked the Insurrection Act and would stay in office “until all domestic enemies are arrested.”", "“M I L I T A R Y in control now,” a Jan. 11 Facebook post, showing a screenshot of the Parler post, reads. “Nothing can stop what is coming. The storm is here.”", "But there is no substantiation for the idea that the Parler account was an official Trump account. Reuters has noted that the official Trump campaign’s Parler account used the handle “@TeamTrump” — not “@TeamTrumpNews.”", "In a Jan. 10 YouTube video viewed more than 800,000 times, former Navy SEAL Michael Jaco — whose previous claims include the bogus allegation that the video of George Floyd’s death was a “green screened staged video production” — spread the same misinformation about the Insurrection Act. The video begins with Jaco marketing an online show he runs that, for $24.99 per month, promises to help viewers “fully optimize your health while intuitively mastering your reality.”", "“The Insurrection Act has been signed by President Trump — it’s been confirmed by many different people,” Jaco claims in the video. “A lot of people reporting on this. So multiple different sources that I watch and listen to, and basically I’ve been hearing a lot of stuff from my contacts and so forth.”", "We reached out to Jaco for information about his unnamed sources and didn’t hear back.", "He went on to claim in the video that “probably Pence is gone, he basically showed his hand. We’ll probably have Mike Flynn come in and he will be the vice president, that’s just my guess… I know you guys want to see JFK Jr. come back in, he’s going to come back in eventually.”", "Days after the video was uploaded, Pence remains vice president — and Flynn, Trump’s former national security adviser, has not replaced him. (The claim about John F. Kennedy Jr. refers to the bogus conspiracy theory that he didn’t actually die in a plane crash in 1999.)", "Such prognostications that turn out to be bunk are standard fare for theories related to QAnon; there have been repeated, false promises of mass arrests of Trump’s political opponents.", "The Insurrection Act dates back to 1807 and “has been invoked on dozens of occasions through U.S. history, although its use since the end of the 1960s civil rights disturbances has become exceedingly rare,” according to the Congressional Research Service. “Its last invocation appears to have occurred in 1992, when the acquittal of police officers on charges of beating motorist Rodney King sparked rioting in Los Angeles.”", "Trump threatened to invoke the law in 2020 amid protests against racial injustice across the country.", "Asked about the current claims, Claire Finkelstein, a University of Pennsylvania professor of law and philosophy and director of the Center for Ethics and the Rule of Law, told us in an email that “the president has surely not invoked the Insurrection Act” and that there would be some type of discernible military action if he had.", "Finkelstein explained that the statutes in question give “the president power to give various orders in case of ‘insurrection.’ He can use federal troops to enforce the laws (such as federalize the national guard), force people to disperse, or simply send money to the various states to help them with law enforcement.”", "“One way to think of it is that the Insurrection Act provides a justification for a president to engage the military to restore law and order, which normally would not be permissible,” Finkelstein said. “Given the circumstances in the country at present, I do believe that if the president were to ‘invoke’ the Insurrection Act, he would say so explicitly. Since he has now been impeached for insurrection, any use of the military will be carefully watched and needs to be justified. That’s where we would expect to hear about the Act.”", "Finkelstein co-authored a December post for Just Security, a website focused on national security law and policy that is based at New York University School of Law, that said any use of the military to try to subvert the election results would violate other federal laws. Members of the military would also violate laws if they assisted with overthrowing a lawful election.", "The authors noted that the act “has never been invoked to overturn an election or to intervene in peaceful political events of any kind. Indeed, it has never been used in any context other than suppressing civil unrest.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“10 U.S. Code Chapter 13 – INSURRECTION.” Legal Information Institute, Cornell University. Accessed 13 Jan 2021.", "“Defense Primer: Legal Authorities for the Use of Military Forces.” Congressional Research Service. Updated 4 Jan 2021.", "“Fact check: Donald Trump has not invoked the Insurrection Act to hold on to power.” Reuters. 11 Jan 2021.", "Elsea, Jennifer K., et. al. “The Use of Federal Troops for Disaster Assistance: Legal Issues.” Congressional Research Service. Updated 14 Aug 2006.", "Finkelstein, Claire. Professor of law and philosophy, and director of the Center for Ethics and the Rule of Law, University of Pennsylvania. Email to FactCheck.org. 13 Jan 2021.", "Finkelstein, Claire and Richard Painter. “Invoking Martial Law to Reverse the 2020 Election Could be Criminal Sedition.” Just Security. 22 Dec 2020.", "Hauser, Christine. “What Is the Insurrection Act of 1807, the Law Behind Trump’s Threat to States?” New York Times. 2 Jun 2020.", "Sherwood, Christopher. Spokesman, Department of Defense. Phone interview with FactCheck.org. 13 Jan 2021.", "“Statement by the President.” White House. 1 Jun 2020.", "Weill, Kelly. “What Time Is the Global Pedophile Roundup Again? QAnon Keeps Missing Deadlines.” Daily Beast. 23 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]