["About this rating", "Precautions re Mammograms and Dental XRays / A Useful Warning", "On Wednesday, Dr. Oz had a show on the fastest growing cancer in women, thyroid cancer. It was a very interesting program and he mentioned that the increase could possibly be related to the use of dental x-rays and mammograms. He demonstrated that on the apron the dentist puts on you for your dental x-rays there is a little flap that can be lifted up and wrapped around your neck. Many dentists don't bother to use it. Also, there is something called a \"thyroid guard\" for use during mammograms. By coincidence, I had my yearly mammogram yesterday. I felt a little silly, but I asked about the guard and sure enough, the technician had one in a drawer. I asked why it wasn't routinely used. Answer: \"I don't know. You have to ask for it.\" Well, if I hadn't seen the show, how would I have known to ask?", "Someone was nice enough to forward this to me. I hope you pass this on to your friends and family.", "Dr. Mehmet Oz, an American cardiothoracic surgeon who hosts a popular daily syndicated television program focusing on medical issues and personal health (The Dr. Oz Show), devoted a September 2010 episode of his show to thyroid cancer, described as \"the fastest growing cancer in women.\" In December 2010, a segment of the Dr. Oz Show tackled the topic of exposure to radiation from various sources and recommended that patients request the use of a thyroid guard during dental x-ray procedures to minimize the possibilities of thyroid cancer:", "Dr Oz did a segment called \"Oz Alert: Dangerous Radiation: Are You At Risk?\" where he discussed a topic that all of us are wondering about — how much is too much radiation whether it comes from Airport Scanners, Dental X-Rays or CT Scans.  Doctor Oz asked the question about whether or not Dental X-Rays are too much radiation.", "Dr Oz has previously spoken about the risks of Dental X-Rays with respect to getting Thyroid Cancer.  Dr Oz was joined by Ada Cooper who said that in dentistry you cannot see everything by visual inspection alone.  The only way to treat and detect an abscess, tumor or some cavities are by taking x-rays.  The ADA recommends Dental X-Rays only when necessary for treatment, but that varies from patient to patient.  Every patient should feel comfortable talking to their dentist about it.", "Dr Oz said that he would recommend pushing for a Digital X-Ray over a regular film X-Ray because it tends to expose you to less radiation.  Ada Cooper did not deny this fact when Dr Oz said it, but she did say that some film X-Rays have lower radiation levels than other Film X-Rays because they are faster, such as X-Rays that use E Speed or F Speed film.", "Dr Oz said that you should never go into a dentist's office for an x-ray without having a Thyroid Guard along with the regular Lead Apron.  If your dentist does not have it or does not know where the Thyroid Guard is, then that is a warning sign, because all Radiation Gowns come with Thyroid Guards.", "However, as others (such as Dr. Wendy Harpham) have cautioned, the use of a thyroid guard may not necessarily be appropriate in all x-ray situations — it depends on the nature and type of procedure being performed:", "Some readers are wondering if they should request a thyroid guard whenever undergoing diagnostic x-ray studies. Others worry that their asking for a thyroid guard might annoy the radiology tech or the radiologist (and they sure don't want to annoy the person caring for them). The key issue here is risk versus benefit.", "The risk to your thyroid of not using a thyroid guard depends on what kind of diagnostic x-ray test is being done. High-dose studies (such as real-time continuous pictures taken during coronary angiography or esophageal swallow studies) expose the thyroid to far more radiation than a simple two-view chest x-ray or mammogram. Direct hits of radiation to the thyroid carry greater risk than indirect, so-called \"scatter\" hits.", "But using a guard carries important risks, too. Depending on the study being done as well as your particular anatomy, a thyroid guard might interfere with the value of the diagnostic study. For example, if the thyroid guard blocks the upper edges of your lung tissue on the x-ray picture, your doctors won't be able to see a small abnormality (such as a tumor) hiding up there. Similarly, if the thyroid guard blocks the tail end of breast tissue near the axilla (arm pit) or deep breast tissue abutting the chest wall, your mammogram could not show a small cancer (or make it easy to miss).", "Whenever my physician advises a diagnostic x-ray, we talk briefly about why he recommends this test over tests that don't expose me to more radiation.", "The American College of Radiology and Society of Breast Imaging issued a statement in April 2011 disclaiming the notion that a mammogram exposes a patient to an amount of radiation which would significantly increase the likelihood of her developing thyroid cancer (and thus the use of a thyroid guard during such a procedure is not called for):", "Some Americans have expressed concern, due to an erroneous media report, that the small amount of radiation a patient receives from a mammogram may significantly increase the likelihood of developing thyroid cancer. This concern simply is not supported in scientific literature.", "The radiation dose to the thyroid from a mammogram is extremely low. The thyroid is not exposed to the direct X-ray beam used to image the breast and receives only a tiny amount of scattered X-rays (less than 0.005 milligray). This is equivalent to only 30 minutes of natural background radiation received by all Americans from natural sources.", "For annual screening mammography from ages 40-80, the cancer risk from this tiny amount of\nradiation scattered to the thyroid is incredibly small (less than 1 in 17.1 million women\n screened). This minute risk should be balanced with the fact that thyroid shield usage could\ninterfere with optimal positioning and could result in artifacts — shadows that might appear on the mammography image. Both of these factors could reduce the quality of the image and interfere with diagnosis. Therefore, use of a thyroid shield during mammography is not recommended.", "Patients are urged not to put off or forego necessary breast imaging care based on this erroneous media report.", "In general, the soundest advice for those concerned about exposure during x-ray procedures is to discuss their concerns with their health care providers prior to such procedures and determine what level of protection the situation merits.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]