["Vice President Mike Pence speaks Nov. 20, 2019, at Fincantieri Marinette Marine in Marinette. (Ebony Cox/USA TODAY NETWORK-Wisconsin)", "Visiting Wisconsin to tout economic progress and push for an updated North American trade deal, Vice President Mike Pence made the case that Wisconsin is better off than it was before President Donald Trump.", "During the campaign, Trump said he would be \"the greatest jobs president God ever created.\"", "So, it was little surprise Pence built his claim around job numbers.", "\"Since President (Donald Trump’s) election, 36,000 jobs have been created in WI,\" Pence tweeted while on his way to visit shipbuilder Fincantieri Marinette Marine in northeastern Wisconsin.", "We’ve tackled several claims on manufacturing jobs in Wisconsin: We rated the Democratic National Committee Mostly False for claiming a decline in manufacturing jobs last year meant Trump broke a campaign pledge to bring such jobs back. And we explained how it is largely accurate to say Wisconsin manufacturing jobs are both up under Trump or to say they’re down in the last year.", "But Pence’s claim is broader, so we’ll give this another go.", "Pence’s claim largely matches up with the latest jobs data, and actually understates the change a bit.", "The number of jobs in Wisconsin rose from 2.94 million in January 2017 — when Trump was sworn in — to 2.98 million in October 2019, according to the U.S. Bureau of Labor Statistics. That’s a difference of 40,900.", "Those tallies show non-farm, seasonally adjusted jobs from the agency’s Current Employment Statistics — an estimate based on a monthly survey of a sampling of companies. But the gap is about the same using other breakdowns of the data.", "For example, Wisconsin’s job count has risen by 44,400 since January 2017 if you look at BLS data for all private-sector jobs (eliminating government positions from the equation).", "But this uptick isn’t exactly a new phenomenon. The number of Wisconsin jobs has risen every year since 2010, when the trend headed up nationally in the wake of the Great Recession.", "And recent data tells a different story. The monthly jobs data shows a loss of 9,300 jobs from January 2019 to October 2019.", "Which brings us to the implication in Pence’s claim — that Trump deserves credit for the uptick since 2017.", "Experts say you can’t give a president full credit or full blame for job gains (or losses) on their watch.", "\"The President can claim some credit for creating an economic environment nationally in which jobs are being created,\" Abdur Chowdhury, professor emeritus of economics at Marquette University, said in an email. \"However … there are many local factors which affect job creation at the state level including, but not limited to, state employment policy,  business environment, national economic trends, tax policy, etc.\"", "Dennis Winters, chief economist for the Wisconsin Department of Workforce Development, cautioned against giving Trump too much credit in our earlier examination of state manufacturing jobs. He noted Trump took office during an \"expanding business cycle\" that would inherently lead to more jobs.", "Pence said 36,000 jobs have been created in Wisconsin since Trump took office.", "It’s an oversimplification to imply, as Pence does, that Trump deserves the credit for that bump. Jobs have actually trended in the other direction so far this year -- and changes in either direction are the product of many factors, not just who occupies the Oval Office.", "But Pence’s number lines ups with — and actually understates — the gains since January 2017, according to the latest data.", "For a statement that is accurate but needs clarification or additional information, our rating is Mostly True.", "Mike Pence, tweet, Nov. 20, 2019", "U.S. Bureau of Labor Statistics, Current Employment Survey, January 2017-October 2019", "Email exchange with Abdur Chowdhury, professor emeritus of economics, Marquette University, Nov. 20, 2019", "PolitiFact, \"Did Obama's final years beat Trump on jobs, stock values?\" March 13, 2019", "PolitiFact Wisconsin, \"Dissecting the spin on manufacturing numbers,\" Nov. 13, 2019", "PolitiFact Wisconsin, \"DNC off on Trump, Wisconsin manufacturing jobs,\" Oct. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]