["The photo was published here on Facebook on November 23, 2019. It has been shared more than 870 times.", "The image shows several people wielding batons surrounding a person seated against a wall in a defensive position.", "The post's caption and the text superimposed on the image read: “This is the witnessed of Rohingya genocide was in Arakan states Myanmar”.", "Below is a screenshot of the misleading post:", "A 2017 military crackdown against the Rohingya minority in Myanmar led to widespread violence and the displacement of hundreds of thousands of people. The crisis prompted dozens of countries to formally accuse Myanmar of violating the 1948 Genocide Convention, AFP reported here on November 21.", "The photo was also shared here on Turkish news site World Bulletin, here on a Thai-language blog and here on a Malay-language blog alongside a similar claim. It was also described as showing Burmese soldiers attacking a Rohingya Muslim here by Pars Today, an Iranian news agency.", "The claim is false; the photo was taken in March 2015 during a protest against an education reform bill near Yangon, Myanmar’s capital.", "A reverse image search on Google found the same photo published in this March 25, 2015 BBC report titled “Myanmar students and activists charged over protest clashes”.", "The photo appears at the 30-second mark of the video embedded in the BBC report. The reporter narrating the video can be heard saying at this point: “A photographer caught this moment as four officers cornered a defenceless man.”", "The photo was taken more than two years before the violent crackdown against the Rohingya, which began in August 2017, according to the United Nations.", "Below is a screenshot of the BBC report:", "The report also states: “Sixty-five people have appeared in court in Myanmar to be charged over a student protest that ended in violence. The group, a mix of students and activists, were arrested while taking part in a protest two weeks ago against a new education bill.”", "The report adds that clashes between police and protesters broke out in Letpadan, a town roughly 300 km southeast of Rakhine, the state where the Rohingya conflict is centered. AFP also reported on the student protest here.", "Below is a screenshot showing the distance between Letpadan and Rakhine state on Free Map Tools:", "The misleading Facebook post also claims Arakan is a state in Myanmar. Arakan is, in fact, a coastal region in the southern part of the country, according to Encyclopedia Britannica.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]