["About this rating", "The number of arrests relating to \"international terrorism\" and the number of terror-related homicides and attempted murder offenses increased in the year ending June 2017; crime as a whole increased by 13 percent.", "The crime figures relate to England and Wales, not the United Kingdom; even the maximum possible increase in terrorist-related offenses could only have made a very small contribution to the overall increase in crime.", "The exact number of Islamist terror-related offenses recorded by police in the year ending June 2017.", "President Donald Trump made an eye-catching claim early on the morning of 20 October 2017, linking or attributing a 13 percent annual increase in crime in the \"U.K.\" with the \"spread of radical Islamic terror.\"", "Just out report: \"United Kingdom crime rises 13% annually amid spread of Radical Islamic terror.\" Not good, we must keep America safe!", "— Donald J. Trump (@realDonaldTrump) October 20, 2017", "The statistical report Trump is alluding to actually relates specifically to England and Wales and not the U.K., which also includes Scotland and Northern Ireland.", "In any case - Trump's linking of Islamist terrorism to a 13 percent rise in recorded crime \"in the U.K.\" (or in England and Wales, for that matter) is grossly misleading.", "The source of his claim appears to have been a segment aired on the conservative One America News Network (OANN) just a few minutes before he sent his tweet. As reported by Media Matters, the OANN segment carried a graphic that read: \"Migrant Crisis - Report: U.K. Crime Rises 13% Annually Amid Spread of Radical Islamic Terror.\"", "The segment can be viewed here. OANN states that the rise in crime was driven by increases in violent and sexual offenses and harassment. Without citing any evidence, the report claims \"Officials speculate the surge in crime may have resulted from the mass migration and spread of violent ideologies including Sharia law and radical Islam.\"", "In reality, no U.K. official has said this, and migration from outside the European Union actually slowed in the year ending March 2017, as compared to the year before that.", "The Overall Rise in Police-Recorded Crime", "On 19 October 2017, the U.K.'s Office of National Statistics published its June 2017 Crime Survey of England and Wales (CSEW).", "As part of the presentation of the CSEW, the Office of National Statistics (ONS) included statistics on offenses recorded by police in the 12 months ending in June 2017.", "The data show that between July 2016 and June 2017, police recorded a total of 5,156,928 offenses in England and Wales, an increase of 583,782 offenses (12.77 percent) from the number recorded between July 2015 and June 2016, which was 4,573,146. (Table A4.)", "The ONS offers this context for that rise:", "The 13% increase in police recorded crime from the previous year reflects a range of factors including continuing improvements to crime recording and genuine increases in some crime categories, especially in those that are well-recorded.", "To be included in the crime statistics, an offense does not need to culminate in a criminal conviction, or even an arrest. It need only be reported to police, or recorded by police.", "Known Islamist Terror Offenses vs Other Offenses", "The police-recorded crime statistics include 35 homicides and 294 attempted murder offenses relating to three Islamist terrorist attacks during the past 12 months: the March 2017 Westminster attack, the May 2017 Manchester Arena bombing, and the June 2017 London Bridge attack.", "A separate October 2017 briefing paper for the House of Commons states that there were 379 arrests relating to terrorism in the year ending June 2017, an increase of 153 on the previous 12 months. Around 75 percent of these arrests related to \"international terrorism\" (Islamist terrorism, largely speaking.) So let's add an estimated 115 additional reported crimes to those homicides and attempted murder offenses.", "That's a total of 444 additional arrests and known offenses relating to Islamist terrorism, which represents just 0.08 percent of the annual increase in police-reported crime in England and Wales in the 12 months between July 2016 and June 2017.", "Other categories of crime were responsible for much larger portions of that 13 percent overall rise in crime. For example, an increase in stalking and harassment represented the equivalent of 11.12 percent of the overall increase, a rise in thefts represented the equivalent of 31.8 percent of the overall increase, and a significant rise in rape offenses represented the equivalent of 1.42 percent of the overall increase - a proportion 19 times larger than that of Islamist terror-related arrests, homicides and attempted murder offenses.", "If we isolate \"racially or religiously aggravated\" offenses (that is, hate crimes) we see that there were 52,925 such offenses in the year leading up to June 2017, an increase of 10,577 (25 percent) from the figure for the previous year. This represents 1.8 percent of the overall rise in crime, and is 24 times greater than the increase in \"international terrorism\" arrests and known criminal offenses relating to the three terrorist attacks in London and Manchester.", "There were 36,607 more shoplifting offenses recorded between July 2016 and June 2017, than in the year before that - meaning shoplifting contributed 82 times more greatly to the overall increase in crime than arrests, homicides and attempted murder offenses relating to \"radical Islamist terror\" did.", "Unknown Islamist Terror Offenses", "However, we have to look beyond the 329 known homicides and attempted murder offenses, and the estimated 115 additional terror-related arrests. Remember, these crime statistics also include reported and recorded offenses that don't culminate in arrests.", "The Crime Statistics division of the U.K. Office of National Statistics told us that other terrorism-related offenses could be included elsewhere in the recorded crime statistics, namely in a sub-category called \"Other offenses against the state and public order.\"", "This sub-category contains specific offenses such as \"Engaging in conduct, or assisting another, in preparation of committing an act of terrorism,\" \"failure to disclose information about acts of terrorism,\" and \"distribute/circulate a terrorist publication,\" along with many other non-terrorism-related offenses.", "Unfortunately, there is no breakdown available of the number of each offense within this sub-category, so we don't know exactly how many terrorist-related offenses there were in the last 12 months, nor how many there were in the 12 months before that.", "(Nor is there a breakdown of which kind of terrorism these offenses relate to - international terrorism, Northern Ireland, and so on.)", "However, we do know that there were 50,976 recorded offenses in the sub-category of \"Other offenses against the state and public order\" and that this represents an increase of 10,110 (or 25 percent) over the previous year.", "So from a statistical and logical point of view, the absolute maximum possible increase in Islamist terror-related offenses in the past year is 10,439 (the 329 known homicides and attempted murder offenses from the London and Manchester attacks, added to the 10,110 increase under \"other offenses against the state and public order.\")", "This figure represents 1.79 percent of the overall increase of 583,782 in total crimes recorded, but even at that, it is almost certainly a significant over-estimation (because not all crimes under \"other offenses against the state and public order\" would have been terrorism-related, and not all of those would have been related to Islamist terror.)", "Compare this to the fact that theft offenses, for example, increased by 185,865 - representing 31.8 percent of the overall increase in crime, or that there was an increase of 88,822 in \"violence without injury\" offenses (kidnapping, child abduction, assault without injury), representing 15.2 percent of the overall increase.", "Stalking and harassment (up 64,924 from the previous year) represented 11.1 percent of the overall rise in crime, and the additional 40,273 domestic burglary offenses in the year ending in June 2017 represented 6.9 percent of the overall increase.", "There are many other offenses and sub-categories of offense whose contribution to the overall 13 percent increase in crime was greater than the maximum possible contribution made by Islamist terror-related offenses. They can all be found in Table 4 of an official Office of National Statistics spreadsheet, which you can download here.", "This should clearly demonstrate that Donald Trump's highlighting of \"radical Islamic terror\" as being linked to a 13 percent increase in crime is grossly misleading.", "From a factual and statistical point of view, he would have accurately reflected the actual data if his tweet had read:", "Just out report: \"England and Wales crime rises 13% annually amid spread of theft, violence without injury, stalking and harassment and domestic burglary.\"", "The Crime Survey of England and Wales, which is separate to the police statistics we've been analyzing (and to which Trump was alluding), found a nine percent overall drop in crime in the year leading up to June 2017.", "The CSEW is a survey given to residents in England and Wales which asks them about their experience of crime and policing in the preceding 12 months.", "The statistics gathered from this survey are therefore not limited to crimes that are actually reported to police in England and Wales. It is conducted and published on a quarterly basis (four times a year.)", "Flatley, John.  \"Statistical bulletin - Crime in England and Wales: Year Ending June 2017.\"\r\n  Office of National Statistics (U.K.)  19 October 2017.", "Office of National Statistics (U.K.)  \"Crime in England and Wales: Appendix Tables. Year Ending June 2017. Table A4.\"\r\n  Office of National Statistics (U.K.)  19 October 2017.", "Allen, Grahame; Dempsey, Noel.  \"Terrorism in Great Britain: the Statistics.\"\r\n  House of Commons Library.  6 October 2017.", "National Counter Terrorism Police Operations Centre (U.K.) \"Table A.13 Categorisation of Persons Arrested, Charged and Convicted After a Charge for Terrorism-Related Offences\" in \"Operation of Police Powers Under the Terrorism Act 2000 and Subsequent Legislation.\"\r\n  U.K. Home Office.  June 2017", "Media Matters for America.  \"Trump Tweet About UK Crime and Muslims Mirrors Segment from Conspiracy-Mongering Network OANN.\"\r\n  Media Matters for America.  20 October 2017.", "White, Nicola.  \"Migration Statistics Quarterly Report August 2017. Table 2: Latest Changes in Net Migration by Citizenship.\"\r\n  Office of National Statistics (U.K.)  24 August 2017.", "Update [21 October 2017]: Added apparent source of Donald Trump's claim.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]