["About this rating", "A post repeatedly shared on social media features a photograph of a woman completely buried in the ground up to her neck, being fed water from a spoon by an onlooker.  The claim offered in conjunction with this image is that it depicts a woman \"about to be stoned to death\" in Iran, who is being \"allowed ...a spoonful of water before her agonizing death:\"", "A******s of Thornton Reuters here is a lady who is 'allowed' 3 sips of water before being stoned to death. How safe is she, according to you ? pic.twitter.com/Kaiuu8xM4c", "— Gita S. Kapoor (@GitaSKapoor) June 28, 2018", "Although Iran has been criticized for allowing the use of stoning as a form of capital punishment (either officially or extrajudicially), the photograph shown above has nothing to do with a stoning, Islam, Sharia law, Iran, or any form of execution or punishment.", "The buried person pictured here is a 66-year-old Colombian woman named Maria Gabriela Ruiz, one of three people who voluntarily remained buried up to their necks in the ground for days on end in July 2003, as a protest over the government's failure to relocate 150 displaced persons to a safer part of the city of Cali.", "Multiple news coverage photographs documented the protest, with the picture shown above being captioned as follows:", "Colombian Maria Gabriela Ruiz, 66, is aided by a woman while she lies buried in the ground up to her neck along with Olmedo Gomez, 42, and Nicolas Salazar, 32, during a protest in a popular sector of Cali, July 4, 2003. Three people, two men and a woman, buried themselves three days ago in protest against the government because 150 displaced persons have not been relocated to a safe sector of Cali.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]