["The photo was published on Facebook here on July 19, 2020. The post has been shared more than 20,000 times.", "The post’s Urdu caption translates as: “Malala Yousafzai having a good time with the son of Israeli Defence Minister. Who will lead the Pakistani nation in future.”", "Yousafzai first came to prominence at age 11 for blogging about her life under the Pakistani Taliban. In 2012, at the age of 15, she survived a gunshot to the head by a Taliban gunman.", "Yousafzai quickly became a global advocate for female education and in 2014 became the youngest ever Nobel Peace Prize laureate.", "The same photo of Yousafzai was also shared alongside a similar claim on Facebook here and here, and on Twitter here, here, here, here, here and here.", "The claim is false.", "A reverse image search on Google found the photo shows Yousafzai with Faisal Iqbal, a famed Pakistani cricket player.", "Iqbal published the photo on his verified Facebook page here on December 19, 2019. The post’s caption reads in part: ”Good to catch up a surprise Visit of Malala Fund at the US OPEN Cricket. A keen Cricket Follower, Enjoyed Discussing Cricket With her!”", "Iqbal then reposted the photo on his official Twitter account here on July 12, 2020, in a tweet wishing Yousafzai a happy birthday.", "On July 22, 2020, Iqbal published a video on Twitter here addressing the false claims that the photo shows Yousafzai with an Israeli man.", "“You can keep all your likes, dislikes, jealousy, hatred aside but nobody has to call anyone Jew, non-Muslim or non-Pakistan,” Iqbal says in the video.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]