["The photo was published here on Facebook on June 23, 2020. It has been shared more than 900 times.", "The post’s Indonesian-language caption translates to English as: \"Quite surprised that Singapore could be flooded like this,,, Bedok\".", "The photo was shared here and here on Facebook and here on Twitter alongside a similar claim.", "It was also shared among Indonesian Facebook users here and here.", "The claim is false.", "A reverse Google image search found an identical photo published in multiple China-based blogs, including this May 22 post on Weibo.", "The simplified Chinese-language Weibo post translates to English as: “[#ClassSuspendedAllDayinGuangzhousHuangpudistrict#] This photo shows a rainstorm that luckily didn't affect us here. Still, we must take safety precautions. I hope the children were able to find a safe shelter on their way to school. This #GuangzhouRainstorm# is really super aggressive. Please stay safe!”", "Huangpu is a district in Guangzhou, a city in the southern Chinese province of Guangdong.", "Below is a screenshot comparison of the photo in the misleading tweet (L) and the Weibo post (R):", "The photo was also published here on Weibo and here on Sina Blog alongside descriptions that it was taken in Guangzhou on May 22.", "AFP located the street in Guangzhou here on Baidu Maps.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]