["About this rating", "A handful of immigrants at a Texas shelter said they were informed by government workers they would have to personally pay hundreds of dollars for DNA tests to prove their relationship with children taken under the Trump administration's \"zero tolerance\" policy.", "The federal government has since promised to pay for any genetic testing necessary to reunify families.", "It's unknown whether any immigrants separated from their children actually paid out-of-pocket for DNA tests to prove familial ties, or whether the federal government has paid for such testing.", "In mid-July 2018, outraged social media users shared a meme reporting that the administration of U.S. President Donald Trump was forcing migrants to pay $800 in out-of-pocket costs to prove familial ties in order to regain custody of children taken from them under the government's \"zero tolerance\" immigration policy:", "The text of the meme was based on a 10 July 2018 story originally reported by the Daily Beast, whose journalists spoke with Ruben Garcia, director of the El Paso immigrant shelter Annunciation House, and an immigration attorney, Iliana Holguin. In telephone interviews with Snopes.com, both of those individuals confirmed their accounting of the details in the Daily Beast's report: four adults (three mothers and one older sister) asserted that government social workers had told them they'd have to fork over $700 to $800 for DNA tests proving their relationship to separated children before they could get their kids back.", "Shortly after the story broke, however, both Garcia and Holguin reported to us that the government had abruptly changed course, with the former telling us:", "If you ask me the question, 'Do you know for a fact that any of those parent had to pay the money [for a DNA test]?' I do not.", "We had about five people who at that point said they were told they would probably have to pay for [the DNA tests]. Since that story came out, the whole scenery has changed because [the government] has now moved aggressively to reunite and release all of these kids.", "Holguin told us no formal request was ever made for the women to pay for the tests. She described the entirety of \"zero tolerance\" and its aftermath as \"very chaotic\" and said that conflicting information had been the norm throughout. \"With the DNA test, I think someone at one point said it, someone repeated it — things were changing so quickly that it was just impossible to know at any given at any moment. The left hand didn’t know what the right hand was doing.\"", "We reached out to the Department of Health and Human Services (HHS), the federal agency tasked with coordinating the care of unaccompanied immigrant children. An agency representative told us HHS, not immigrant families, pays for DNA testing.", "The federal government is rushing to meet a deadline set by a federal judge after the American Civil Liberties Union (ACLU) successfully sued for an injunction on family separations under \"zero tolerance,\" a policy initiated by the Trump administration in April 2018. Judge Dana Sabraw of the Southern District of California gave federal agencies until 10 July 2018 to reunify children under five years of age with their respective adults, and until 26 July 2018 to reunify kids five through 17 years old.", "According to a status report submitted to the court by HHS on 13 July 2018, not all families with children in the older age cohort will be subjected to DNA tests, as HHS has truncated its process for confirming family relationships to meet the looming deadline for reunification. In a statement, HHS spokesperson Evelyn Stauffer said:", "The department has been operating in good faith and earnestly trying to comply with court orders, including the rapidly approaching deadline for reunification. Our interpretation of the court's order is that HHS must make a determination of parentage, fitness, and safety before reunifying families, but that HHS need not undertake the fuller process of vetting for children's safety that HHS would ordinarily conduct in its operations.", "In the interests of transparency and cooperation, the department felt it necessary in our filings on Friday to share with the court our view that meeting the deadline would mean truncating the process we might have otherwise followed.", "Within the time the court allows, we will strive to implement the most comprehensive procedures possible to ensure child welfare. We look forward to continuing our close work with the court to accomplish the goals we share of safe, expeditious reunification.", "Under \"zero tolerance,\" all immigrants caught crossing the southern border between ports of entry were charged with crimes — mostly misdemeanors. Adults accompanied by children were separated from them and, initially, the U.S. government appeared to have no plan to reunify families.", "With court orders and pressure mounted by public outrage over the policy, the Trump administration has more or less reversed course. Garcia told us the federal government would begin reuniting the remainder of separated families at centralized locations in Arizona and Texas in the coming week in order to meet the court's 26 July 2018 deadline. Judge Sabraw also temporarily halted deportations of those families to give them time to decide whether to leave children behind in the United States in hopes they will win their asylum cases, or to be deported together.", "Glawe, Justin, and Adam Rawnsley.   \"Government Told Immigrant Parents to Pay for DNA Tests to Get Kids Back, Advocate Says.\"\r\n    The Daily Beast.   10 July 2018.", "Hals, Tom.   \"All Migrant Kids Under Five to Be Back With Parents by Thursday: U.S. Official.\"\r\n    Reuters.   11 July 2018.", "Associated Press.   \"Texas Shelter: US Flying Kids for Reunifications.\"\r\n    16 July 2018.", "Morrisey, Kate.   \"Judge Temporarily Halts Deportations of Reunified Families.\"\r\n    San Diego Union-Tribune.   16 July 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]