["About this rating", "In January 2021, the website Real Raw News published an article claiming that not only did U.S. President-elect Joe Biden have a compound in Ukraine, but that it had been raided by the elite military unit Delta Force.", "This is not a genuine news story. Biden does not have a compound in Ukraine, and this fictional place was not raided by Delta Force.", "The January 2021 story about Delta Force raiding Biden's Ukraine compound is a rehash of 2017 piece of disinformation that claimed Delta Force had raided former President Barack Obama's (supposed) compound in Thailand. Real Raw News simply swapped out some details — it involved Biden, not Obama, it took place on New Year's Day, not Christmas, and it was in Ukraine, not Thailand — as if they were playing a conspiratorial game of Mad Libs.", "Here's the opening paragraph from that 2017 junk news story (top) and the opening paragraph from 2021's fake news article (bottom):", "During the pre-dawn hours on Christmas Day, Delta Force operators launched a precision strike against an Obama-controlled stronghold in Thailand, says an active Secret Service agent who claims President Trump green lit the operation following a series of telephone calls to United States military commanders and to Thailand Prime Minister Nik Bukharin.", "During the predawn hours on New Year’s Day, Delta Force operators infiltrated a Biden-controlled stronghold in southeast Ukraine near the port city of Mariupol, according to an anonymous White House Source who said President Trump greenlit the operation following a series of telephone calls to US military commanders and to Ukrainian President Volodymyr Zelensky.", "Both of these pieces of disinformation also used the same set of green \"night vision\" images. And no, those images did not come from any Delta Force raids of any compounds owned by any United States presidents. These are actually promotional images from Columbia Pictures of the movie \"Zero Dark Thirty\" about the raid on Osama Bin Laden's compound.", "The 2017 fake news article and the 2021 rehash also both ended with images that supposedly showed these secret compounds. In both cases, an image of an entirely unrelated building was used. In 2017, the photo showed Villa Rak Tawan, a property in Thailand that is rented for weddings and other events. In 2021, this picture was swapped with an image of the IQ Business Center in Ukraine.", "The story about a raid on Obama's nonexistent compound in Thailand was fake in 2017. When this story was reworded in 2021 to feature Biden's nonexistent compound in Ukraine, it was still false.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]