["The post was published here on Facebook on November 30, 2020. It has been shared 3,300 times.", "The Burmese-language title of the misleading post translates to English as: “Chance to get MMK 1500,000 (US$ 1137) for every household in Myanmar”.", "Part of the Burmese post translates to English as: “Dear folks, during this difficult time, Pyay Ti Oo Foundation will donate a total of MMK 500,000,000 (US$ 380,000) via this Facebook group.", "“Please follow the rules and regulations of the group and then withdraw MMK 500,000 (US$ 380) for a family.”", "Pyay Tii Oo is an award-winning film actor in Myanmar.", "Facebook posts published here and here shared a similar claim.", "The claim, however, is false.", "In response to the misleading posts, U Nyi Nyi, a spokesperson of the foundation, told AFP by phone on December 1, 2020 that the claim is “not true”.", "“The claim is absolutely not true. Pyay Ti Oo Education Foundation is an organization that helps students’ education. We are not involved in any other fields.”", "The Pyay Ti Oo Education Foundation also released a statement here on September 21, 2020 on its Facebook page, saying it focuses on supporting education.", "Part of the Burmese announcement translates to English as: “Pyay Ti Oo Education Foundation is a registered organization to help students who cannot afford for their education.", "“Pyay Ti Oo Education Foundation is helping and supporting outstanding students who passed the matriculation examination and cannot afford to pursue their higher education. Also, we donate as much as we can where help is actually needed.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]