["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Secretary of State John Kerry took exception to President Donald Trump’s criticism of the NATO allies at the recent meeting in Brussels. Trump came into the meeting saying the European members needed to spend more. At a news conference after the meeting, Trump said their defense spending had been falling.", "\"It was going down, the amount of money being spent by countries was going down and down very substantially, and now it's going up very substantially,\" Trump said.", "Kerry said the trend was just the opposite.", "\"President (Barack) Obama raised the issue in a constructive and collegial way that succeeded in securing a pledge from NATO members to increase their defense spending,\" Kerry said in a statement July 11.", "That meeting took place in 2014 in Wales. At the end, NATO members said they would spend more on defense and \"aim to move towards the 2 percent guideline within a decade.\"", "\"Each year, (NATO) nations have been increasing their contributions,\" Kerry said.", "The European nations had reasons beyond Obama to up their defense game. Open fighting in eastern Ukraine between government forces and Russian-backed separatists had Europe on high alert.", "Whatever motivated the Europeans, the numbers say Kerry is right, at least for the time frame he mentioned.", "Since 2014, the European members collectively increased defense spending by 8 percent, or $20 billion in real terms. (Canada’s spending also rose by $7 billion.) This chart draws from official NATO statistics, with all amounts in constant 2010 U.S. dollars.", "Now, it is true that before 2014, Europe had been spending less, but that isn’t what Trump said. Trump said spending was going down when it was rising.", "In relative terms, the European share of all NATO member defense spending has been rising since before 2014. In 2012, its share stood at 27 percent. That fraction increased every year, reaching 30 percent in 2017.", "Defense analysts at the conservative Heritage Foundation see the data the same way. Luke Coffey and Daniel Kochis said while non-U.S. spending needs to go higher (as did Kerry), they also said it has been headed in the right direction.", "\"In 2017, NATO members (not including the U.S.) collectively increased spending by 4.8 percent, or $23 billion, since 2015,\" Coffey and Kochis wrote June 26.", "NATO broke from its usual practice and issued a projection of 2018 defense spending at the end of the recent gathering. That report shows Europe’s collective spending rising by about $35 billion in current dollars, while U.S. spending would go up by about $20 billion.", "Kerry said that NATO members have been increasing their contributions. Total defense spending by the European members rose 8 percent or $20 billion dollars from 2014 to 2017.", "We rate this claim True.", "John Kerry, tweet, July 11, 2018", "NATO, Defence Expenditure of NATO Countries (2010-2017) , March 15, 2018", "Heritage Foundation, Brussels NATO Summit 2018: The Alliance Must Increase Defense Spending, June 26, 2018", "NATO, 2017 Annual Report, March 15, 2018", "NATO,  Defence Expenditure of NATO Countries (2011-2018), July 10, 2018", "USA Today, Trump, NATO chief meet amid tensions over Russia, defense spending, April 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]