["“Magical performance to the tune of a bhajan sung by two tiny tots–pupils of the one and only”, is the message posted along with a video by Madhu Kishwar. The video clip is 2:20 minutes long. A Hindu devotional song with chant of Lord Ram plays in the background, with breathtaking choreography and synchronization of hands by young artists who stand behind each other in a perfect column.", "Magical performance to the tune of a bhajan sung by two tiny tots–pupils of the one and only @kuldeepmpai pic.twitter.com/veDCNJD90P", "— MadhuPurnima Kishwar (@madhukishwar) September 17, 2019", "Another social media influencer who posted the same video is Tarek Fatah, with the words, “The Magic that is Hindustan”. Fatah’s tweet credits Madhu Kishwar for the video. His tweet has been retweeted nearly 7,000 times and the video has been viewed over 1.73 times so far.", "The Magic that is Hindustan pic.twitter.com/ANpDj189vJ", "— Tarek Fatah (@TarekFatah) September 17, 2019", "Several Twitter users, following Ms Kishwar’s tweet, commented that the video does not pertain to India. Others suggested that the audio has been manipulated.", "On the basis of these clues, with the use of specific keywords, Alt News found that this particular dance form is called ‘Dance of a thousand hands’, and it originates from China. The dance form has been created by Zhang Jigang, an internationally acclaimed choreographer and an officer in the Chinese national army (PLA). Interestingly, the dance is performed by hearing-impaired artists.", "We found the exact video as the one shared now, posted by the Chinese news agency Xinhua in November 2018 on Twitter. The dance had been performed at the headquarters of the United Nations in New York. As can be seen in the video, there is no chant of Lord Ram in the background. The video clip shared on social media has, therefore, been edited.", "Artists of China Disabled People’s Performing Art Troupe presented thousand-hand Bodhisattva dance on Monday at the United Nations headquarters in New York pic.twitter.com/jzlwg45JNq", "— China Xinhua News (@XHNews) November 5, 2018", "Alt News also located several videos of this dance on YouTube. One such video is posted below.", "The dance form is also known as ‘Thousand hand Guan Yin’. Guan Yin is the Chinese name of the bodhisattva known as Avalokiteshvara. The concept of bodhisattva in Buddhism refers to a person who is on the path to the attainment of the state of Buddha (enlightenment). It was popularised under Mahayana Buddhism which gained prominence from the 2nd century BCE.", "It may be noted that the video in question, posted by Madhu Kishwar and Tarek Fatah as a performance from India, is actually not so. It is a Chinese dance form. Moreover, the video clip has been edited, with a Hindu devotional chant added to it.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]