["About this rating", "Fast food rumors are fairly popular in the online news world. Over the years, we've covered a number of claims about restaurants such as McDonald's, Wendy's, and Taco Bell. So when an online advertisement claimed that scientists agreed on the worst fast food chain, we decided to take a closer look.", "The ad in question read: \"[Gallery] Avoid This Fast Food Chain at All Costs - Scientists Agree It's the Worst.\"", "Readers who clicked the ad were led to a lengthy slideshow article on Definition.org. The story spanned 25 pages. Its headline read: \"Worst Fast Food Restaurants, Ranked.\" The article appeared to be anything but based on science:", "Love them or hate them, fast food restaurants are as American as apple pie. Whether you crave a late-night burrito from Taco Bell or an afternoon, lunch-break Big Mac from McDonald's, America's love for cheap, fast, and fatty foods is second-to-none. Yes, some of these restaurants offer health-focused meals, sides, and combos are the majority of these food and drink establishments are just terrible. I mean, what do you expect? Gourmet, life and soul-enriching food that will make you live longer? Definitely not! That's not the purpose of these wonderfully unique fast-food establishments. From a quick road-trip bite to a \"once-a-week\" dinner for the family, these restaurants catch you on the fulfillment of good flavors and cheap prices. But, there's more to these worst fast food restaurants.", "Somehow, some of these \"scummy\" worst fast food places manage to make a mockery of their identities. Some of these worst fast food places have managed to disgust every customer that has been able to get a glimpse of their mistakes and general \"nastiness.\" For your sake, as well as ours, we've listed our worst fast food restaurants to avoid… if you want to live.", "Scientists did not agree on the worst fast food chain. Nowhere in the story were scientists even mentioned. There also appeared to be no data-driven method that was employed to create the list. The line about scientists might remind some readers of the old \"doctors hate him\" trope that was also used in lots of ads.", "The clickbait article appeared to be nothing more than 25 uneventful pages of the \"worst\" fast food chains. They included mention of Dairy Queen, Subway, Taco Bell, and 22 other restaurants. On each page was a review from a single customer who had a bad experience at one location for each restaurant.", "The story's headline claimed that the list was \"ranked.\" On the first page was Arby's, while the last page featured McDonald's. However, it was unclear if the list of the \"worst\" fast food chains was supposed to be ascending or descending. It was not numbered.", "In sum, there was no evidence that scientists agreed on the worst fast food chain. The misleading ad led to 25 pages of negative restaurant reviews. Scientists weren't even mentioned. We rate this claim \"False.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]