["Coils of brass inside the Master Lock Co. in Milwaukee, Wis., in a 2012 file photo. (AP/Jeffrey Phelps)", "There’s no question that manufacturing employment in the United States has fallen in recent decades. But did a Republican congressman from West Virginia get it right when he cited a statistic on that point in a recent Wall Street Journal op-ed?", "U.S. Rep. Alex Mooney wrote March 25 that \"from 2000-10, U.S. manufacturing employment shrank by a third after holding steady for 30 years.\"", "Mooney was broadly accurate when looking at raw employment totals. But the point does not hold up when you factor in population growth — a more telling statistic. (Mooney’s staff did not respond to inquiries for this article.)", "First, let’s look at the raw numbers.", "The number of U.S. manufacturing employees bounced around in a fairly narrow range between 1970 and 2000, before plunging between 2000 and 2010. (Left out by Mooney: National manufacturing employment has risen modestly but consistently since 2010.)", "So that’s in line with what Mooney wrote.", "But if you adjust for the surge in U.S. population between 1970 and today, the pattern looks different.", "Rather than \"holding steady for 30 years,\" the percentage of Americans working in manufacturing actually fell consistently between 1970 and 2000. The rate of decline accelerated a bit between 2000 and 2010, but not by much. And the percentage of Americans working in manufacturing has stabilized, and actually increased slightly, since 2010.", "Gary Burtless, a Brookings Institution economist, agreed that the pattern depends heavily on which measure you use.", "\"Measured as a percentage of total employment, manufacturing employment has been falling pretty steadily since World War II,\" he said. \"The growth in manufacturing labor productivity, the growth of imported manufactured products as a share of the manufactured goods we consume, and the shift in consumers’ taste away from manufactured goods toward services -- especially health care services -- has meant that we do not need as many U.S. manufacturing employees to produce all the manufactured goods we consume in a given year.\"", "We were curious how the pattern looked for West Virginia.", "It turns out that manufacturing jobs in West Virginia did remain pretty constant prior to 2000 before falling off a cliff.", "Manufacturing jobs as a percentage of West Virginia’s population held steady between 1990 and 2000, then dropped significantly between 2000 and 2010. As with the other measures, manufacturing employment as a percentage of the state’s population has remained strikingly stable since 2010.", "Mooney wrote that \"from 2000-10, U.S. manufacturing employment shrank by a third after holding steady for 30 years.\"", "Mooney’s statistic is accurate in raw numbers. The one caveat is if you measure manufacturing employment as a percentage of the population — which accounts for significant population growth over that period — you can see a steady decline going back decades. Manufacturing’s footprint in the labor market shrank consistently, and by more than half, during the period he cited.", "We rate the statement Mostly True.", "Alex Mooney, \"Steel and Aluminum? Let’s Talk About Gold: How fiat money hurts my West Virginia constituents,\" March 25, 2018", "Bureau of Labor Statistics, U.S. manufacturing employment, accessed April 3, 2018", "Federal Reserve Bank of St. Louis, U.S. population, accessed April 3, 2018", "Federal Reserve Bank of St. Louis, West Virginia manufacturing employment, accessed April 3, 2018", "Federal Reserve Bank of St. Louis, West Virginia population, accessed April 3, 2018", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, April 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]