["The image was posted by a New Zealand-based Facebook user here on June 30, 2020. The post has been shared more than 200 times.", "The text superimposed above the image reads: “This was the results of the Vaccine trials on Africans. And no one has even answered for this. Keep your vaccines”.", "The Facebook post's caption states: “Fuck bill gates and your vaccines.\"", "AFP reported here that false claims targeting Gates, an advocate for vaccines, have gained traction since the beginning of the novel coronavirus pandemic.", "The image has also been shared on Facebook here, here, here, here and here alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found an image showing similarly-dressed children in this photo collection titled “WAR ON POLIO”.", "The collection was published by French photographer Jean-Marc Giboux, who said he took the photo in the misleading posts in Freetown, the capital of Sierra Leone in 1998.", "“I was documenting the polio vaccinations for WHO and these kids [featured in the photo] are polio victims, showing the effects of no vaccination against polio,” Giboux told AFP in a July 7 email. “Since there was no place to get reconstructive surgery in Sierra Leone because of the civil war, they grew up with the consequence of polio, without any vaccination.”", "The World Health Organization (WHO) also said in a July 7 email that Giboux was on contract for the global health agency when he took the photo. Some of Giboux’s work covering polio for the WHO is available online here.", "Poliomyelitis, commonly known as polio, is an infectious viral disease that can attack the nervous system and cause paralysis. The disease “largely affects children under 5 years of age,” according to the WHO.", "Vaccines have been critical in stopping polio in many parts of the world, but children are still vulnerable to the disease in Sierra Leone.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]