["About this rating", "In early January 2017, a July 2016 article published by TMZHipHop (formerly CelebtriCity) appeared on social media once again, reporting a man locked his daughter in a cage because she used Snapchat's \"dog filter\" excessively:", "According to reports, Monica Cruz, 17 of Washington Heights, was found in locked in a cage in her bedroom. Cruz was initially discovered by grandmother Odalys Cruz this evening after the teen had not responded to calls from her grandmother for several days. The grandmother had visited the home while both parents were at work to check in on her grand daughter ... Reports indicates that the teen was locked in the cage for 3 days and was fed Purina Dog Chow and water from a bowl. Monica had not bathed for the duration of lock up and had taken bowel movements inside the cage which was lined with newspaper.", "Detective Santiago spoke with Cruz’s parents to investigate the incident.", "“Mr. Cruz explained to me that he found several photos on his daughter’s Facebook page that made her look like a dog. He asked some friends at his job about what it was and they told him that it was an app that gave the photos the effect. Mr. Cruz was not happy that his daughter would choose to look like a dog on the internet which prompted him to take extreme measures in an attempt to discipline his daughter,” said Detective Santiago.", "Like its sister sites (TMZWorldStar/TMZUncut/TMZBreaking), TMZHipHop is a fake news source posing as an offshoot of the popular gossip site TMZ. None of the above domains bears a disclaimer that warns readers that the sites' (often salacious or outlandish) content is purely fabricated.", "Previous falsehoods advanced by TMZHipHop and related pages included claims a cop shot a black toddler after mistaking his pacifier for a gun, a penile implant alerted women to cheating romantic partners, a college student fell into a coma after undertaking a social media semen-drinking challenge, KKK members committed suicide en masse after the introduction of the Harriet Tubman $20 bill, a non-existent study determined 80 percent of black men in Atlanta were gay, and police located a Satanic dungeon under a Chuck E. Cheese (a story that coincidentally resembled the late-2016 Pizzagate conspiracy theory).", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]