["The claim was published on Facebook here on July 7, 2020.", "The post, which features three photos of plants, is captioned: “TO THOSE WHO ARE SICK AND NEED THIS MEDICINAL PLANT.. SERPENTINA OR SNAKE GRASS… IT’S ON HAND.. IT’S CHEAP”.", "One of the photos is overlaid with text that reads, in part: \"This is snake grass which doctors don't tell you about because they would lose their jobs if this is discovered.. in 24 hours all cancer cells will die in your body.. / Stage 1 = 10 leaves / Stage 2 = 15 leaves / Stage 3 = 20 leaves / Stage 4 = 25 leaves every day. / Boil this in water for 10 minutes or use a blender and mix with lemon juice. please share guys! so others would also know..\"", "\"Snake grass\" is a medicinal plant endemic in several Asian countries. According to this 2016 study, it has traditionally been used to treat “skin rashes, insects and snake bites, lesions caused by herpes simplex virus, diabetes, and gout”.", "A similar claim has also been shared here, here, here, here and here on Facebook.", "The claim is misleading; health experts have said there is no evidence that snake grass can kill cancer cells.", "“There are no scientific studies pointing to efficacy of snake grass for cancer treatment,” Dr. Rachel Rosario, executive director of the Philippine Cancer Society, told AFP via phone on July 13, 2020.", "Dr. Necy Juat, a fellow at the Philippine Society of Medical Oncology, also denied the claims, but added: “As an oncologist, do I stop the patient from taking any herbal medicine? No... If they want,\n\twe do complementary medicine alongside herbal.\"", "This May 2019 study by researchers from the National University of Singapore found snake grass “was not very effective in inhibiting growth of cancer cells”.", "It reads, in part: ““What we did not expect is that the leaf extract of the Sabah Snake Grass was not very effective in inhibiting growth of cancer cells. In our earlier study, this plant was frequently reported to be used by cancer patients in [Southeast Asian countries]. One possibility could be that it may be helping cancer patients in other ways, rather than killing the cancer cells directly.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]