["About this rating", "In 2012, a New York Times Magazine article sparked privacy concerns by describing big box retailer Target's attempts to use data to find out whether their customers were pregnant. An IKEA ad campaign in January 2018 takes away the need to gather complex data to determine whether customers are pregnant by simply asking women to dab their own urine on the advertisement itself. If the woman is pregnant, the paper shows a coupon for a crib.", "Swedish ad agency Akestam Holst created the ad, which appears in what IKEA called \"a limited edition\" of the women's magazine Amelia and reads, in part, \"Peeing on this ad may change your life\":", "IKEA - Pee Ad from Ourwork on Vimeo.", "Why do retailers care when women get pregnant? According to journalist Charles Duhigg, the birth of a child is the most optimal time to recruit customers:", "There are, however, some brief periods in a person’s life when old routines fall apart and buying habits are suddenly in flux. One of those moments — the moment, really — is right around the birth of a child, when parents are exhausted and overwhelmed and their shopping patterns and brand loyalties are up for grabs.", "Akestam Holst told Adweek:", "The pregnancy test strip was used as a starting point, which relies on antibodies that bind to the pregnancy hormone hCG, resulting in a color change. For scaling up of this technique and adopting it to the physical format of a printed ad, Mercene Labs has used their experience in development of surface active materials for microfluidics and medical diagnostics. Careful selection of materials, together with a controlled capillary flow have been crucial for the success of this project. Technical advancements made during the work with this campaign have the potential to improve medical diagnostics.", "We contacted Akestam Holst seeking further comment. A spokesperson for IKEA's U.S. division confirmed the veracity of the advert, and told us that there are not plans for the advertisement to run in any other markets.", "Nudd, Tim. \"Ikea Wants You to Pee on This Ad. If You're Pregnant, It Will Give You a Discount on a Crib.\"\r\nAdWeek. 9 January 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]