["About this rating", "Despite being used both recreationally and medicinally for millennia, the mechanisms by which cannabis affects the human body have only recently come to light. The most significant development in this body of work is the discovery of what scientists term the “endocannabinoid system,\" a collection of chemical pathways found in mammals whose existence wasn’t demonstrated until the 1990s.", "The endocannabinoid system is made up of specific receptors that are primarily affected by chemicals already in your body — endocannabinoids. As it turns out, many of the chemicals in cannabis, termed “phytocannabinoids”, are nearly identical to the endocannabinoids already present and can therefore also affect these receptors as well if they make their way into your bloodstream.", "The most famous of these chemicals is tetrahydrocannabinol (commonly known as THC), which produces the psychoactive “high” people seek when they use the drug recreationally. Later research has yielded the discovery of a plethora of other phytocannabinoids that do not produce a psychoactive effect, but do demonstrate therapeutic potential.", "The most notable of these “other” chemicals is cannabidiol (referred to as CBD), which studies suggest has strong pain-relieving and anti-inflammatory properties, and has been shown essentially to halt seizures caused by the neurologic condition Dravet’s Syndrome.", "A 2008 paper published in Proceedings of the National Academy of Sciences suggested that CBD acted on a previously undescribed endocannabinoid receptor, GPR55, and that this receptor likely plays a role in the regulation of bone mass by inhibiting the growth of cells — osteoclasts — that promote the resorption of bone minerals:", "Our observations also suggest that CBD can inhibit bone resorption in vivo via modulation of GPR55 signaling.", "They go on to suggest, however, that because THC has the opposite effect on this receptor, that this interaction may negate the positive effects on bone density caused by CBD:", "Our observations suggest that blocking GPR55 also may have direct beneficial effects on bone turnover in arthritic or metabolic bone diseases. Finally, although CBD is a major constituent of cannabis, it remains to be determined whether cannabis smoking may increase bone density, because [THC], another constituent, also is thought to be a GPR55 ligand and may oppose the effects of CBD.", "In this context, two studies took a closer look at the possible mechanisms by which CBD, specifically, might help bones heal from a fracture. A 2014 study published in Biochemical Pharmacology that utilized isolated cells suggested that CBD may activate a receptor in the endocannabinoid system (CB2) that enhances the migration of mesenchymal stem cells (which play a role in creating calcified bones) to the site of the fracture.", "A 2015 study published in the Journal of Bone and Mineral Research reaffirmed the possibility that CBD can help with healing fractures:", "Here we report that the major non-psychoactive cannabis constituent, cannabidiol (CBD), enhances the biomechanical properties of healing rat mid-femoral fractures. The maximal load and work-to-failure, but not the stiffness, of femurs from rats given a mixture of CBD and Δ9-tetrahydrocannabinol (THC) for 8 weeks were markedly increased by CBD.", "They found that, indeed, CBD increased the strength of the healed broken femurs of laboratory rats. The authors noted that CBD, with all other constituents removed, was more effective. They suggest a different mechanism for this effect: CBD increases the expression of a gene that codes for a series of reactions that results in the production of collagen, which is then transformed into harder bone material, a process termed collagen cross-linking.", "Each of these three mechanisms that link CBD to bone physiology has support in the scientific community, as attested to by their inclusion in a September 2016 review of phytocannabinoid pharmacology in the journal Physiological Reviews.", "It is important to note, however, that CBD specifically, and not the cannabis plant as a whole, is implicated in the therapeutic effects on bones. As such, consuming just any cannabis would not necessarily be effective. Any treatment would require an effort to isolate or increase the concentration of CBD and remove or reduce THC.", "It is also important to note that this is an ongoing area of investigation hampered by legal restrictions on research, that few large-scale studies have been performed, and that these studies are dominantly on laboratory animals or isolated cells, not on humans.", "Nutt, David.   \"Illegal Drugs Laws: Clearing a 50-Year-Old Obstacle to Research.\"\r\n    Plos Biology.   27 January 2015.", "Ligresti, Alessia, et al.   \"From Phytocannabinoids to Cannabinoid Receptors and Endocannabinoids: Pleiotropic Physiological and Pathological Roles Through Complex Pharmacology.\"\r\n    Physiological Reviews.   14 September 2016.", "Knott, L. and Bailey, A.J.,.   \"Collagen cross-links in mineralizing tissues: a review of their chemistry, function, and clinical relevance.\"\r\n    Bone.   March 1998.", "Kogan, Natalya M., et al.   \"Cannabidiol, a Major Non-Psychotropic Cannabis Constituent Enhances Fracture Healing and Stimulates Lysyl Hydroxylase Activity in Osteoblasts.\"\r\n    Journal of Bone and Mineral Research.   10 May 2015.", "Schmuhl, E., et al.   \"Increase of Mesenchymal Stem Cell Migration by Cannabidiol Via Activation of p42/44 MAPK.\"\r\n    Biochemical Pharmacology.   1 February 2014.", "Blair, HC.   \"How the Osteoclast Degrades Bone.\"\r\n    Bioessays.   October 1998.", "Wgyte, Lauren, S., at el.   \"The putative cannabinoid receptor GPR55 affects osteoclast function in vitro and bone mass in vivo.\"\r\n    Proceedings of the National Academy of Sciences.   22 September 2009.", "Cilio, Maria Roberta, et al.   \"The Case for Assessing Cannabidiol in Epilepsy.\"\r\n    Epilepsia.   22 May 2014.", "Pertwee, R.G.   \"The Diverse CB1 and CB2 Receptor Pharmacology of Three Plant Cannabinoids: Δ9-Tetrahydrocannabinol, Cannabidiol and Δ9-Tetrahydrocannabivarin.\"\r\n    British Journal of Pharmacology.   January 2008.", "Wilson, J.V., and Reynolds, E. H.   \"Texts and documents. Translation and analysis of a cuneiform text forming part of a Babylonian treatise on epilepsy.\"\r\n    Medical History.   April 1990.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]