["About this rating", "On 21 January 2019, Slate published a article headlined “The Trump Administration Quietly Changed the Definition of Domestic Violence and We Have No Idea What For.” That story highlighted significant changes to the definition of domestic violence appearing on website of the Department of Justice’s (DOJ) Office of Violence Against Women office. An archived version of that website from April 2018 previously defined domestic violence as:", "A pattern of abusive behavior in any relationship that is used by one partner to gain or maintain power and control over another intimate partner. Domestic violence can be physical, sexual, emotional, economic, or psychological actions or threats of actions that influence another person. This includes any behaviors that intimidate, manipulate, humiliate, isolate, frighten, terrorize, coerce, threaten, blame, hurt, injure, or wound someone.", "By contrast, the current version of that same website encompasses only acts of physical violence under the definition of domestic violence:", "The term “domestic violence” includes felony or misdemeanor crimes of violence committed by a current or former spouse or intimate partner of the victim, by a person with whom the victim shares a child in common, by a person who is cohabitating with or has cohabitated with the victim as a spouse or intimate partner, by a person similarly situated to a spouse of the victim under the domestic or family violence laws of the jurisdiction receiving grant monies, or by any other person against an adult or youth victim who is protected from that person’s acts under the domestic or family violence laws of the jurisdiction.", "We reached out to the Office of Violence Against Women (OVW) for an explanation on what motivated the change in the definition and whether that change was spurred by an actual change in law or policy. We received a response from Allison Randall, Chief of Staff for the OVW, that did not adequately answer either question. Her response is reproduced in full below:", "The Department is strongly committed to enforcing the Violence Against Women Act (VAWA) and combating domestic violence, dating violence, sexual assault, stalking, and sex trafficking, and to do so in a manner that is consistent with the law enacted by Congress. Domestic violence is clearly defined in VAWA, and OVW has always used the statutory definition in carrying out its mission. By following the statute, the Department ensures the funds made available by Congress are employed in the most effective manner possible to reduce violence and to assist crime victims.", "In fiscal year 2018, OVW awarded a record $467 million under VAWA. President Trump’s request for fiscal year 2019 OVW funding was the largest ever requested. OVW discretionary grantees serve an average of 125,000 victims every six months and formula subgrantees serve over 400,000 victims each year. VAWA funding supports victim advocates who answer over a million hotline calls and provides over 2 million housing and shelter bed-nights for victims and their children annually. Every year, VAWA-funded professionals assist victims in securing more than 200,000 protection orders.", "The narrower definition employed in the current version of the OVW website stems from the definition provided in the Violence Against Women Act (VAWA) as it relates to disbursing funds for VAWA grant programs. While it is true this narrow definition has not changed as it relates to the VAWA, it is unclear why the DOJ found it necessary to remove information about non-physical intimate partner violence. Writing in Slate, Natalie Nanasi, a Professor of Law and the Director of the Judge Elmo B. Hunter Legal Center for Victims of Crimes Against Women at Southern Methodist University, argued that:", "A domestic violence relationship rarely begins with physical violence, much less violence that rises to the level of a crime. If you were punched on a first date, odds are there wouldn’t be a second. Intimate partner abuse is insidious: Emotional and psychological abuse escalates to physical violence as an abuser’s need and/or ability to exert power and control increases. In the United States today, more than half of female homicide victims are killed by an intimate partner. If we do not acknowledge the “small” things -- yelling or screaming, name-calling, and controlling or monitoring communication and social media -- victims may not realize they are in danger until it is too late.", "In our response to the statement from OVW, we suggested that they had not provided any explanation for the change to their website and requested further clarification; if we receive such clarification, we will update our story.", "The Violence Against Women Act, which was extended by President Obama in 2013, expired at midnight on 22 December 2018 as a result of the 2018-19 federal government shutdown over funding for President Trump’s proposed border wall.", "Nanasi, Natalie.   \"The Trump Administration Quietly Changed the Definition of Domestic Violence and We Have No Idea What For.”\r\n    Slate.   21 January 2019.", "Department of Justice.   \"Domestic Violence.”\r\n    Archived 9 April 2018.", "Department of Justice.   \"Domestic Violence.”\r\n    Archived 24 January 2019.", "Sacco, Lisa N.   \"The Violence Against Women Act: Overview, Legislation, and Federal Funding.”\r\n    Congressional Research Service.   26 May 2015.", "Viebeck, Elise.   \"Violence Against Women Act Expires with Government Shutdown.”\r\n    The Washington Post.   22 December 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]