["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "More than a decade of war in Iraq and Afghanistan may have wound down, but policymakers warn the fight has just begun for some veterans.", "They say these warriors’ newest foe is a homegrown threat: bureaucracy at the U.S. Department of Veterans Affairs.", "A backlog of disability claims has forced a growing number of veterans suffering from head trauma, post-traumatic stress disorder and other ailments to wait for months and sometimes more than a year for word of whether the federal government will help them.", "Republican U.S. Rep. Tom Graves of Ranger called the backlog \"immoral\" in a recent op-ed, and he used a stream of factoids to demonstrate how bad the problem has gotten.", "These figures piqued our interest:", "\"Despite having their budget increased by over 40 percent since 2009 … pending claims for benefits with the VA have increased from 391,000 to 890,000 under the Obama Administration,\" he said on ZPolitics, a website launched by talk radio host and former congressional candidate Martha Zoller.", "If Graves is correct, the number of pending claims has grown by more than 125 percent. Is this true? And was the agency’s budget hike really this steep, despite the budget-cutting debates of recent years?", "We contacted Graves spokesman John Donnelly for more information.", "The congressman’s criticism is part of a growing chorus of complaints that the VA takes too long to tell veterans whether they’ll receive disability assistance.", "News stories have chronicled cases where veterans died as they waited for an answer.", "Lawmakers are clamoring for action, and VA Secretary Eric Shinseki has vowed to eliminate the backlog by 2015.", "Donnelly responded to PolitiFact Georgia’s request for more information with the VA’s own figures.", "First, let’s look at the VA’s budget. A 10-year overview published on its website showed that in fiscal year 2009, it totaled $97.7 billion. Now it’s $140.3 billion.", "That’s a 43.6 jump, or as Graves said, an increase of \"over 40 percent.\"", "Now, let’s consider disability claims. Although the controversy centers on backlogged claims -- defined as those pending more than 125 days -- Graves’ statement concerns \"pending\" claims, those awaiting a disability rating decision by the VA.", "Graves wants veterans to have to wait no more than 30 days for a decision.", "For this portion of our fact check, Donnelly referred us to the VA’s weekly disability claims reports. On Jan. 21, 2009, one day after Obama was sworn into office, the department released a report that said the number of pending cases totaled 391,127.", "The April 8, 2013, report was the most recent one available when Graves submitted his op-ed to ZPolitics, Donnelly said. We found it reported 889,981 pending claims.", "Sure enough, Graves used accurate figures. But did he put them in the correct context?", "Although Graves did not accuse Obama of causing the growth in pending claims, he did mention that the increase took place under the president’s watch. This suggests that the current administration bears at least some responsibility for the problem. We looked to see whether it does.", "We found that the backlog has been a long time coming. The benefits system had been outdated for years before Obama took office.", "When Shinseki, an Obama appointee, took over the department in 2009, it used paper files, not electronic ones. It did not have enough staff to handle the onslaught of veterans returning from a decade of war in Iraq and Afghanistan.", "\"I don't think we really anticipated the nature of injuries, the multiple deployments. Men and women are surviving injuries that would have been sure death 20 or 25 years ago,\" said Dave Autry, a spokesman with DAV, an organization that advocates for disabled American veterans.", "The VA hired more staff and in fiscal 2011 completed 1 million claims, a 6 percent increase from 2009, according to the Government Accountability Office. But the number of claims received grew 29 percent, the GAO reported.", "Veterans advocates told us that even though the VA increased staff, training fell short and claims administrators made bad decisions. Veterans appealed, and the backlog grew even larger. A computerized system intended to streamline the process is still being implemented.", "What’s worse is that to prove they are disabled, veterans have to pull together documents from the Social Security Administration, the Department of Defense and other federal bureaucracies that do not share information, said Paul Rieckhoff, who heads Iraq and Afghanistan Veterans of America, which has been pushing for improvement.", "\"What you see is really a bureaucratic failure that stretches across the government,\" Rieckhoff said. \"We don't think it's been a partisan issue.\"", "In sum, Graves’ numbers are correct. The VA’s budget has increased by more than 40 percent, and the number of pending claims has skyrocketed from some 391,000 to 890,000 under the Obama administration.", "Graves also was accurate in noting that the increase took place under the president’s watch. While the VA’s benefits system has been troubled since well before Obama took office, efforts during his administration have not prepared the department for its current challenges.", "We rate Graves’ statement True.", "ZPolitics, \"VA Backlog: Time To Set Standards Worthy Of Our Veterans,\" April 23, 2013, http://zpolitics.com/rep-tom-graves/", "U.S. Department of Veterans Affairs, \"VA 2013 Budget Fast Facts,\" accessed April 23, 2013, www.va.gov/budget/docs/summary/Fy2013_Fast_Facts_VAs_Budget_Highlights.pdf", "U.S. Department of Veterans Affairs, Veterans Benefits Administration Performance and Transparency Web page, accessed April 23 and April 29, 2013, www.vba.va.gov/reports/", "U.S. Government Accountability Office, \"Veterans’ Disability Benefits/ Timely Processing Remains a Daunting Challenge,\" December 2012, www.gao.gov/assets/660/651066.pdf", "San Francisco Chronicle, \"Veterans die awaiting pension benefits,\" Dec. 26, 2012, www.sfgate.com/nation/article/Veterans-die-awaiting-pension-benefits-4133602.php", "Email interview, John Donnelly, spokesman, U.S. Rep. Tom Graves, April 23, 2013", "Telephone interview, Paul Rieckhoff, founder and CEO, Iraq and Afghanistan Veterans of America, April 24, 2013", "Telephone Interview, David Autry, deputy national director for communications, DAV, April 23, 2013", "Email exchange, Randal Noller, spokesman, U.S. Department of Veterans Affairs, April 24, 25 and 26, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]