["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Tony Evers has said he wants to reduce the state’s prison population by half, but gradually and in part through initiatives that prevent people from going to prison in the first place.", "There is also a stark difference between reduce and release — the latter of which Evers has not pledged to do.", "Assembly Speaker Robin Vos’ backup essentially repeats things we have considered in past ratings of similar claims.", "Wisconsin Republicans sometimes zero in on Gov. Tony Evers’ pledge to reduce the state’s prison population by half as a sign Evers isn’t tough on crime.", "The latest to do so is Assembly Speaker Robin Vos, R-Burlington.", "In a Feb. 13, 2020 newsletter to constituents, Vos touted the Assembly’s passage of a series of Republican-backed bills that proponents say would keep the state safer. Vos took aim at the governor in the email, saying Evers \"wants to release half of the prison population.\"", "Evers has said for years he wants to address overcrowding in Wisconsin’s prison system. But he and his administration have also expressed the need to do it carefully and gradually.", "How does Vos’ claim rate?", "During the 2018 campaign, Evers told the Milwaukee Journal Sentinel he would consider releasing some inmates early, overhauling truth-in-sentencing and treating 17-year-olds as juveniles instead of adults, among other policies. He also said, during a Democratic debate, that cutting the prison population in half is \"a goal that’s worth accomplishing.\"", "Former Gov. Scott Walker cited that exchange when we fact-checked a claim from Walker that Evers \"wants to cut Wisconsin's prison population in half, a dangerous plan that today would mean releasing thousands of violent criminals back into our communities.\"", "We rated Walker’s claim Half True.", "Evers stated that a 50% reduction is a goal, but didn’t put a timeframe on achieving it, while Walker’s claim made it sound as if the reduction would happen overnight. Experts noted that it’s possible to reduce the prison population over a longer period of time without releasing violent offenders before their sentence is up.", "When asked for backup for Vos’ new claim, his office cited our previous fact check — specifically the Evers comment from the debate. Vos communications director Kit Beyer also pointed to other media reports in which Evers or administration officials discussed the goal.", "But those articles don’t entirely bolster Vos’ position. They instead echo what we already considered in rating Walker’s claim.", "For instance, according to a June 30, 2019 article from Wisconsin Watch cited by Vos, the governor \"expressed optimism about his ability...to reduce by 50 percent the state’s prison population.\" That article also included an interview with Corrections Secretary Kevin Carr in which Carr said they need to cut the population in a \"thoughtful, deliberate way.\"", "\"The governor didn't appoint me to this position and say, ‘Here's the keys to all the jails. Let 50 percent of the people out tomorrow,’\" Carr told Wisconsin Watch.", "Beyer also cited Evers’ support of legislation aimed at reforming the state’s prison system.", "The three bills, introduced largely by Democrats, would allow inmates to potentially be eligible for parole if they complete an educational, vocational or treatment program; specifies situations in which a person’s parole or extended supervision can be revoked; and allows certain inmates to be released early from extended supervision.", "Evers told the Wisconsin State Journal in a Jan. 9. 2020 article that the package \"would only move the needle slightly\" when it comes to decreasing the number of inmates. In any case, the bills didn’t make it to the Assembly floor before lawmakers adjourned for the year.", "Does Evers want to reduce or release?", "There’s a distinct difference between the definition of \"release\" and \"reduce.\"", "Release, as defined by Merriam Webster, means \"to set free from restraint, confinement, or servitude.\" Reduce is defined as \"to diminish in size, amount, extent, or number.\"", "\"It’s unfortunate that Wisconsin Republicans continue to use falsehoods and fearmongering to push our state in the wrong direction on reforming our criminal justice system,\" Evers spokeswoman Britt Cudaback said in a statement to PolitiFact Wisconsin.", "Kenneth Streit, a clinical professor emeritus at the University of Wisconsin Law School, said he hasn’t seen a specific inmate-reduction plan from Evers, which makes it easy for Vos to put words in the governor’s mouth.", "No matter what, Streit said, there is no quick way to achieve such a goal.", "\"There are strategies,\" he said. \"They’d take 10 years or more. You can’t promise that you’re going to turn around on a dime.\"", "Vos claimed in a newsletter that \"Evers wants to release half of the prison population.\"", "The governor has, more than once, expressed the goal of reducing the state prison population by 50% as part of broader criminal justice reform. He also supported recent legislation that would have made changes to parole and extended supervision rules, in some cases allowing certain inmates to be released early.", "But that’s a far cry from releasing half the prison population overnight, which is what Vos’ claim suggests. And Evers and his supporters have been clear from the start that this is a goal to be achieved over time, through steps that prevent fewer people from entering prison in the first place.", "Our definition for Half True is a statement that \"is partially accurate but leaves out important details or takes things out of context.\"", "That’s how we rate Vos’ claim.", "Robin Vos E-update, Feb. 13, 2020.", "Email from Kit Beyer, communicators director for the Office of Speaker Robin Vos, Feb. 18, 2020.", "Assembly Republicans pass bills that would put more people behind bars, increase costs, Milwaukee Journal Sentinel, Feb, 11, 2020.", "Democrats running for governor call for slashing prison population, Milwaukee Journal Sentinel, July 5, 2018.", "Tony Evers supports cutting prison population 50%, but releasing thousands of violent criminals? Politifact Wisconsin, Sept. 21, 2018.", "Hard road ahead for Gov. Tony Evers’ promise to slash Wisconsin prison population, Wisconsin Watch, June 30, 2019.", "Tony Evers, Democratic lawmakers unveil bill package as 'first step' toward criminal justice reform, Wisconsin State Journal, Jan. 9, 2020.", "2019 Assembly Bill 830, first accessed Feb. 18, 2020.", "2019 Assembly Bill 831, first accessed Feb. 18, 2020.", "2019 Assembly Bill 832, first accessed Feb. 18, 2020.", "Interview with Kenneth Streit, professor at the University of Wisconsin-Madison Law School, Feb. 21, 2020.", "Merriam Webster, first accessed Feb. 24, 2020.", "Email with Britt Cudaback, deputy communications director for the Office of Gov. Tony Evers, Feb. 24, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]