["This Georgia Aquarium senior biologist is just bathed in blue light from the exhibit. She is not a jellyfish hybrid who glows on her own. Photo by Charlotte B. Teagle / AJC", "Let’s be honest. The headline looked like it belonged in Florida.", "\"Georgia lawmaker pushes bill banning creation of ‘glow in the dark’ human-jellyfish hybrids,\" it screamed over a photo of a contorted face adorned in fluorescent paint.", "Sure, back in 2010, the state Senate was roundly mocked for voting to oppose forcing microchips into people. (That measure died, maybe from embarrassment).", "So certainly Peach State lawmakers learned their lesson about drafting bills based on internet rumor and speculation. So PolitiFact Georgia set out to right this gross error, easy peasy.", "Except …", "Well, first the good news. The headline makes a giant leap based on a strict reading of House Bill 287.", "The bill makes no mention of jellyfish. The \"Ethical Treatment of Human Embryos Act\" would, however, ban human embryos with non-human cells injected into them as well as ... wait for it … any \"human-animal hybrid.\"", "The specifics about the gelatinous sea creatures come from the website of the bill’s lead sponsor, state Rep. Tom Kirby, R-Loganville.", "The bill is one of his priorities, which his office webpage describes this way: \"The mixing of Human Embryos with Jellyfish cells to create a glow in the dark human, we say not in Georgia. \"", "What in the name of SpongeBob Squarepants is happening here?", "Kirby points to news articles, touting scientists’ latest successes in introducing jellyfish genes into various mammals who grow up to glow under a black light.", "Of particular concern to Kirby is a 2008 New York Times article that details researchers who successfully put the jellyfish’s fluorescent protein gene into a single-celled human embryo.", "That test-tube embryo was described as nonviable, which scientists said would never have resulted in a baby. Kirby – who once used his agricultural economics degree to implant cattle embryos to breed stronger cows – isn’t so sure.", "His proposal would be proactive, to draw an ethical line in the sand for such research in Georgia.", "\"I’m not trying to hurt good, valid research that helps people, but I don’t think we should create life like this, just for research,\" Kirby said. \"I don’t think Georgians want what they did, creating a human-jellyfish hybrid, here.\"", "So maybe the bill is not explicit in its language. But the driving force is a concern about mixing humans with what makes jellyfish illuminate.", "There is no evidence of any abuse of this technology. Federal guidelines, not to mention the reputation of research facilities, would quash even the idea for the most part.", "Of course, injecting a fluorescent gene to make a designer glowing baby could be done in theory. And to an ethicist, that is enough to warrant at least discussion, no matter how silly.", "\"Could someone who is crazy enough, with enough money, say ‘I want a glow-in-the-dark baby?’ Sure,\" said Kevin FitzGerald, a professor of oncology at Georgetown University and chair of the Catholic Healthcare Ethics. \"You or I would consider that crazy. But there are some who would claim it as a right to free expression. That’s why there is value in discussing how protective the state needs to be.\"", "Those debates about human-critter hybrids are all fun and games, until a centaur loses an eye. Or until scientists and researchers push back on the speculation.", "Experts helped kill a previous version of Kirby’s bill, House Bill 481 in the 2013-2014 legislative session, with testimony that it would harm their ability to save lives.", "Those objections remain, especially given what is a fundamental misunderstanding about the role of jellyfish in medical and scientific research.", "Three scientists won the Nobel Prize in chemistry in 2008 for their work in finding jellies’ green fluorescent protein (GFP) gene, and developing it for research.", "It’s now commonly used to track genetic changes as cells divide, giving researchers insight into ways to treat genetic diseases.", "Explained that way, injecting some jellyfish into cells doesn’t seem so wacky. But fears about the \"what if\" abuses have created a proposal that could stymie other legitimate research, said Dr. Mark A. Kay, a professor of pediatrics and genetics at Stanford University.", "For example, the bill would allow a human embryo to be created only through fertilization from a sperm and egg. Scientists, though, are able to and often create them for research purposes (not viability) by using a cellular nucleus –where the genes live.", "Kirby’s bill would put an end to that, and halt approaches being tested to develop human organs for transplants and other efforts.", "\"This is an example where you’re trying to make a law to stop something quite ridiculous and end up limiting the legitimate efforts to understand genetic developments that can save people,\" Kay said.", "If that’s not enough for Georgia to be embarrassed, there’s more.", "The proposed bill does not stop animal genes from being introduced to human embryos.", "Kay describes genes as the equivalent of a sentence buried in an encyclopedia. Cells, which Kirby’s bill bans, are the equivalent of the house where those volumes sit on the shelf.", "\"It does not explicitly state you can’t transfer a gene into a human chromosome, so it doesn’t even stop the ridiculous idea it claims is the threat,\" Kay said.", "Why? Because the GFP, which can be created synthetically or extracted from a jellyfish, is a gene that would still be permitted.", "And wouldn’t that set the stage for Perimeter road rage incidents where people look like the Hulk, not just act like him?", "If it seems we’re getting silly, it’s only because we are.", "The headline about glow-in-the-dark Georgians overstates the bill itself. But it captures the intent of the proposal -- to ban human embryos with non-human cells injected into them as well as any \"human-animal hybrid.\"", "And, weirdly, it captures some of actual discussion happening under the Gold Dome.", "We rate the headline Half True.", "Raw Story, \"Georgia lawmaker pushes bill banning creation of ‘glow in the dark’ human-jellyfish hybrids,\" Feb. 11, 2015", "The Atlanta Journal-Constitution, \"Georgia Senate opposes forcing microchips into people,\" Feb. 4, 2010", "Georgia General Assembly legislation, 2015-2016 session, House Bill 287", "The Atlanta Journal-Constitution, Georgia Legislative Navigator, House Bill 287", "State Representative Tom Kirby official web page, Issues 2015", "WSB-TV.com, \"Lawmaker proposes bill to ban mixing human, animal embryos,\" Feb. 11, 2015", "New York Times, \"Engineering By scientists on embryo stirs criticism,\" May 13, 2008", "NPR.org, \"What’s up with that, doc,?\" Aug. 15, 2013", "National Geographic, \"Glowing Animals: Beasts Shining for Science,\" May 14, 2009", "Christian Science Monitor, \"Bunnies glow green in the dark,\" Aug. 13, 2013", "New Scientist, \"GM monkey passes jellyfish gene to offspring,\" May 28. 2009", "Washington Post, \"Georgia lawmaker wages battle against human-jellyfish hybrids,\" Feb. 17, 2015", "New York Times, \"Scientists place jellyfish genes into monkeys,\" Dec. 23, 1999", "Georgia General Assembly legislation, 2013-2014 session, House Bill 481", "The Royal Society of Chemistry, \"Green fluorescent protein takes Nobel Prize,\" Oct. 8, 2008", "Interview with state Rep. Tom Kirby, R-Loganville, Feb. 18, 2015", "Phone interview with Kevin FitzGerald, a professor of oncology, the Dr. David P. Lauler Chair for Catholic Healthcare Ethics and member of the Center for Clinical Bioethics, Georgetown University, Feb, 18, 2015", "Phone interview with Dr. Mark A. Kay, professor of pediatrics and genetics, Stanford University, Feb. 18, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]