["A person called Dheeraj Sharma posted a viral video on Facebook of Dr Parameshwar Arora MD (Ayurveda), a senior consultant at Sir Gangaram hospital, New Delhi addressing passersby on the street. Arora can be seen claiming in the video that he has five tips to prevent coronavirus. He even offers personal treatment to anyone who, despite following his tips with conviction, gets the viral infection.", "On Dheeraj Sharma’s account, the video had 12 million views and over 3 lakh shares at the time of writing this article.", "Baat Manoge to corona nhi hoga | DR Parmeshwar Arora ,Ganga Raam Hospital", "क्या बीतेगी अगर आपके ghar में corona हो gaya तो dhyaan से सुनिए Dr. Saab की बात अगर मानें तो corona नहीं होगा ￼| DR Parmeshwar Arora ,Ganga Raam Hospital", "Posted by Dheeraj Sharma on Wednesday, 3 June 2020", "ABP News also shared this video clip on their YouTube channel along with their interview with Arora. The channel has promoted and given Arora a platform during several broadcasts.", "In the viral video, Arora appeals to the people of Hindu faith to include home ‘remedies’ like clove, black pepper, caraway (ajwain) and hot water in daily religious activities to fight against coronavirus infection.", "However, Arora isn’t the only individual promoting such ‘home remedies’ to prevent or cure Covid-19.", "#चाय और बड़ों की #राय समय-समय पर लेते रहना चाहिए !! ☕️☕️ कोरोना वायरस के संक्रमण से बचाव के लिए शरीर का इम्यून सिस्टम मजबूत होना जरूरी है।तुलसी,लौंग,काली मिर्च,इलायची,अदरक,और सौंफ वाली चाय से आपका इम्यून सिस्टम भी मजबूत होगा। #जयश्रीराम pic.twitter.com/BU0B8wUvIr", "— Sangeeta Bhandari (@sbhandari16) June 25, 2020", "Since the virus outbreak, the government has been advising people to drink kadha. This was also amplified by the media. Clove and black pepper are some of the ingredients used to make this Ayurvedic recipe.", "कोरोना के खिलाफ़ जंग में योग के बाद आयुर्वेदिक काढ़ा भी उतर गया है, अब सैशे में भी मिलेगा काढ़ा पाउडर। ज़्यादा जानकारी के लिए देखिए @mewatisanjoo की रिपोर्ट अन्य #ReporterDiary के लिए क्लिक करें: https://t.co/mf6keLW7vJ#IndiaFightsCorona #COVID19 #Ayurveda pic.twitter.com/8hu5uo1nql", "— AajTak (@aajtak) June 5, 2020", "Consumption of or gargling with warm salted water is also widespread claim.", "Posted by Jay Monroe on Friday, 13 March 2020", "This article contains scientific research to prove the efficacy behind these claims as a coronavirus treatment. In the absence of evidence against the COVID-19, we reviewed the research for these remedies against the symptoms of COVID-19 or against the treatment for any other viral infectious diseases of the upper respiratory system.", "CLAIM:", "Alt News Science dissected this video and other social media claims to list three distinct advises on prevention/ cure of coronavirus. The Hindi audio in Arora’s video has been translated.", "1. Claims against the coronavirus infection by treating the upper respiratory tract with home remedies", "“On day 1 of infection, the virus is weakly attached in our oral cavity (mouth and throat). By slow consumption of hot water, the virus will travel through and reach the stomach where it will be destroyed by the stomach’s acidic environment.”", "“The consumption of clove, black pepper, or caraway with a pinch of salt thrice a day will protect against the virus while the infection is still in the oral cavity.”", "“Gargling with a pinch of turmeric and equal amounts of rock salt with hot water before bedtime will destroy the virus if it is in the upper respiratory tract or the throat.”", "“Steaming from the water with turmeric and rock salt will clear the virus from the nasal activity (inside the nose).”", "2. Claims regarding immunity and coronavirus infection", "“Consumption of dry grapes with milk or water will boost one’s immunity.”", "“Consumption of cashew and almonds during summer can cause indigestion.”", "“Consume large amounts of paitha (winter melon or wax gourd) for immunity.”", "3. Claims of using a herbal mix when the infection becomes systemic (reaches the blood)", "“Consuming a mixture of garlic, black pepper, big cardamom, clove, cinnamon, holy basil (tulsi), liquorice, long pepper in any combination with water will help, if the infection has reached the circulatory system (via blood).”", "VERDICT:", "False", "FACT-CHECK:", "1. Claims against the coronavirus infection by treating the upper respiratory tract with home remedies.", "Let us first briefly discuss the way the virus establishes infection in our body.", "The novel coronavirus (SARS-COV2) is transmitted predominantly by respiratory droplets, contact, and potentially by the faecal-oral route. After the virus enters the nasal cavity and pharynx (upper respiratory tract), it attaches to the outermost layer of the cells lining the respiratory tract called the ‘epithelial cells’ (see figure).", "The SARS-COV2 attaches to these cells via a protein called ‘Spike protein’ that attaches to a receptor molecule called ACE2 located on the epithelial cell surface. Once the virus enters these cells, it multiplies by invading further down the respiratory tract, lungs, digestive tract lining, blood, and from there on to the other vital organs of the body.", "Thus, throughout this process, the virus is multiplying inside a number of cells in many important organs of the body and the blood. Therefore, by drinking hot water, washing it down, gargling or steaming with any other substances will not destroy the virus since it is not limited to the respiratory tract.", "Also, if Arora meant the tips are only applicable to day 1, many symptoms are not visible on day 1. There is a strong possibility that infected people will not know whether they have been infected.", "Thus, since the virus infects many organs of the body, and unlike the loosely attached inert dust particles in the respiratory tract, it cannot be ‘washed down’ or ‘cleaned’ with liquids in the upper respiratory tract.", "Also, the virus is present in the epithelial lining of the stomach, which has a high acidic content. Exposing the virus to the acid in the stomach would have no effect on the virus or against the infection. Therefore, drinking, gargling or steaming hot water, even if the water is mixed with herbs such as turmeric or salt, will not destroy the virus.", "Such home remedies may provide temporary symptomatic relief from a sore throat, but it doesn’t affect the virus or treat the infection. It is a complementary measure for common cold, akin to cold water sponges for fevers.", "Alt News Science had debunked the claim of gargling with hot water while countering another viral claim here.", "2. Claims regarding immunity and coronavirus infection", "Dry grapes or raisins", "Raisins have been quoted due to their plant-based flavonoid called ‘Quercetin’ (a plant pigment) found in grapes that have been implicated as an immune-modulatory compound (Yao et al 2016). However, a randomised clinical trial in 1002 participants that consumed 500-1000 mg/day pure quercetin did not have any influence on the infection of the respiratory tract as compared to a placebo drug (Heinz et al. 2010).", "Furthermore, the amount of quercetin in red grapes is found to be 3.54 mg/100 gm (www.quercetin.com). Even if we assume that consumption of quercetin is effective, one would have to consume 1.4-2.8 kgs of grapes daily to reach the 500-1000 per day requirement of the aforementioned study. This may be nearly impossible for most people.", "Paitha (winter melon, wax gourd or Benincasa hispida)", "There is no literature that suggests that consumption of melon gourd or raisins will help with coronavirus or any other upper respiratory tract infections.", "3. Claims of using a herbal mix when the infection becomes systemic (reaches the blood)", "Arora claimed that a mixture of garlic, black pepper, big cardamom, clove, cinnamon, holy basil, liquorice and long pepper with water will help fight COVID-19 if the infection has become systemic. We will discuss each of the herbs below and evaluate their efficacy against coronavirus of any other upper respiratory tract infections.", "Pepper", "The claim of using pepper against COVID-19 has been previously debunked WHO (see infographic).", "Garlic", "Despite garlic having some antibacterial effects, there is no evidence that it will prevent COVID-19 (see infographic).", "Cardamom", "Several in-vitro (lab) studies and studies in mice demonstrate the antibiotic and antifungal activity of the cardamom extracts (Ashokkumar, K. et al 2020). However, there are no clinical studies done for cardamom extracts against any infection.", "Clove", "There are no clinical studies done for clove extracts against any infection.", "A similar claim regarding the ability of clove to cure COVID-19 has been debunked by Poynter, a fact-checking platform.", "Cinnamon", "Despite some studies suggesting antibacterial activity of cinnamon against bacteria like Streptococcus mutans and Lactobacillus plantarum and inhibition of fungal infections such as candidiasis, the evidence needed more validation since it is based on flakey preliminary data (Ulbricht, C. et al 2011). However, there are no clinical studies for cinnamon extracts against viral infections.", "Liquorice", "The active compound of liquorice is Glycyrrhizin which has shown antiviral activity against different viruses including herpes simplex, Varicella zoster, Japanese encephalitis, influenza, and vesicular stomatitis virus (L. Wang, Yang, et al., 2015). In a 2003 in-vitro study (in a culture of cells), glycyrrhizin was shown to inhibit the previous SARS-COV1 virus (Cinatl J et al 2003). However, until there is a peer-reviewed randomized clinical trial in humans evaluating liquorice for the novel coronavirus (SARS-COV2), its efficacy cannot be considered.", "Holy basil", "There have been 2 clinical studies of holy basil against viral infections and both have very poor methodological quality. The first study by Rajalakshmi et al (1986) did not have a control group, The second study by Das et al (1983) has a similar drawback of a very small sample size of 14 cases of viral encephalitis.", "Large sample sizes ensure that the chance variations are minimized or cancelled out. With low sample sizes, random events (e.g. recovery by chance) in a small number of subjects greatly impact the results. When a drug is administered to a group of patients and some of them recover, it cannot be known whether they improved due to placebo effect or due to their innate immunity or as a natural course of the disease. To minimise the impact of all such factors, studies are controlled, i.e, there is a control group of patients with similar characteristics and who have the same disease but who do not get the drug being tested. Hence, the results of uncontrolled studies with small sample size are considered unreliable.", "Thus, there is no evidence that consumption of pepper, garlic, clove, cinnamon, cardamom, liquorice, holy basil will cure the novel coronavirus. Further, consumption of these herbs in excess may develop unwanted side effects due to the toxicity of its active ingredients in high doses.", "CONCLUSION:", "While Indian hospitals struggle to handle the increasing number of novel coronavirus cases, it is a greatly appealing idea for the masses that they can prevent the infection or treat it on their own with home remedies. However, except the general commentary on masks and social distancing, none of the remedies claimed by Arora has any merit. Furthermore, he does not give any consideration to the amount of consumption, which may add to negative side effects due to toxicity of some herbs, and in fact, encourages people to use these spices as much as possible. This is a dangerous myth that ayurvedic remedies do not have side effects.", "The AYUSH ministry has already been promoting various herbs that have not been scientifically tested. In addition, viral videos, WhatsApp messages containing quick-fix home remedies overwhelm people who may be willing to try these untested cures to prevent and treat the disease on their own.", "REFERENCES:", "Li, Y., Yao, J., Han, C., Yang, J., Chaudhry, M. T., Wang, S., … & Yin, Y. (2016). Quercetin, inflammation and immunity. Nutrients, 8(3), 167.", "Heinz, S. A., Henson, D. A., Austin, M. D., Jin, F., & Nieman, D. C. (2010). Quercetin supplementation and upper respiratory tract infection: A randomized community clinical trial. Pharmacological research, 62(3), 237-242.", "Suneetha, W. J., & Krishnakantha, T. P. (2005). Cardamom extract as inhibitor of human platelet aggregation. Phytotherapy Research: An International Journal Devoted to Pharmacological and Toxicological Evaluation of Natural Product Derivatives, 19(5), 437-440.", "Haji Monfared Nejad, M., Ostovar, M., Raee, M. J., Hashempur, M. H., Mayer, J. G., & Heydari, M. (2019). Cinnamon: a systematic review of adverse events. Clinical Nutrition, 38(2), 594-602.", "Nazari, S., Rameshrad, M., & Hosseinzadeh, H. (2017). Toxicological effects of Glycyrrhiza glabra (licorice): a review. Phytotherapy research, 31(11), 1635-1650.", "Ashokkumar, K., Murugan, M., Dhanya, M. K., & Warkentin, T. D. (2020). Botany, traditional uses, phytochemistry and biological activities of cardamom [Elettaria cardamomum (L.) Maton]–A critical review. Journal of ethnopharmacology, 246, 112244.", "Ulbricht, C., Seamon, E., Windsor, R. C., Armbruester, N., Bryan, J. K., Costa, D., … & Grimes Serrano, J. M. (2011). An evidence-based systematic review of cinnamon (Cinnamomum spp.) by the Natural Standard Research Collaboration. Journal of dietary supplements, 8(4), 378-454.", "Cinatl, J., Morgenstern, B., Bauer, G., Chandra, P., Rabenau, H., & Doerr, H. W. (2003). Glycyrrhizin, an active component of liquorice roots, and replication of SARS-associated coronavirus. The Lancet, 361(9374), 2045-2046.", "Wang, L., Yang, R., Yuan, B., Liu, Y., & Liu, C. (2015). The antiviral and antimicrobial activities of licorice, a widely-used Chinese herb. Acta Pharmaceutica Sinica B, 5(4), 310-315.", "Jamshidi, N., & Cohen, M. M. (2017). The clinical efficacy and safety of Tulsi in humans: a systematic review of the literature. Evidence-Based Complementary and Alternative Medicine, 2017.", "LiverTox: Clinical and Research Information on Drug-Induced Liver Injury [Internet]. Bethesda (MD): National Institute of Diabetes and Digestive and Kidney Diseases; 2012-. Eugenol (Clove Oil) [Updated 2019 Oct 28]. Available from: https://www.ncbi.nlm.nih.gov/books/NBK551727/", "Rajalakshmi, S., Sivanandam, G., & Veluchamy, G. (1986). Role of Tulsi (Ocimum sanctum Linn.) in the management of Manjal Kamalai (viral hepatitis). Journal of Research in Ayurveda and Siddha, 9(3-4), 118-123.", "Das, S., Chandra, A., Agarwal, S., & Singh, N. (1983). Ocimum sanctum (tulsi) in the treatment of viral encephalitis (A preliminary clinical trial). Antiseptic, 80, 323-327.", "Donate Now", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]