["By Saranac Hale Spencer", "Posted on January 19, 2018", "Q: Did Denzel Washington call Barack Obama the “criminal-in-chief”?", "A: No. The actor has been a steady supporter of Obama and of other Democrats.", "Is the article “Denzel Washington: Criminal-In-Chief Obama” accurate?", "Denzel Washington has been a staunch supporter of the Democratic Party. He also has been the target of fake news stories.", "The most recent such story, with a patchwork of made-up quotes attributed to the actor, claims that he said former President Barack Obama was the “criminal-in-chief.”", "He did not.", "The story was first posted on YourNewsWire.com, which has posted fabricated stories about celebrities allegedly espousing conservative views before. Last fall, it published a false story claiming that Morgan Freeman had called for Hillary Clinton to be jailed.", "The made-up story claims that Washington made disparaging remarks about Obama during the New York premiere for the movie “Roman J. Israel, Esq.,” in which Washington plays a crusading civil-rights lawyer. But there is no record of him saying anything critical of the former president.", "He also has spoken highly of Obama, telling a reporter in 2016, “I think that he served with dignity, strength, patience. And I think he did a great job.”", "And he was one of the first people to show up for his front-row seat at Obama’s inauguration in 2009.", "Washington had contributed $28,500 to help get Obama elected.", "Then he contributed $27,000 to help get Hillary Clinton elected in 2016.", "Readers wrote in to ask us if the story was made-up, and Facebook users rightly flagged the story as being potentially false. It is.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Evans, Patrick. “Denzel Washington hit by Facebook fake news story on Trump.” BBC. 15 Nov 2016.", "Dmitry, Baxter. “Denzel Washington: ‘Criminal-In-Chief’ Obama ‘Tore Heart Out Of America.'” YourNewsWire.com. 1 Dec 2017.", "Hale Spencer, Saranac. “Freeman Didn’t Say ‘Lock Her Up.’” FactCheck.org. 11 Jan 2018.", "“Denzel Washington breaks down why he thinks the black family unit is so crucial.” The Grio YouTube channel. 21 Nov 2017.", "Shaw, A.R. “Denzel Washington talks the legacy of President Barack Obama.” YouTube. 8 Dec 2016.", "Itemized receipts — Obama Victory Fund. Federal Election Commission. 29 Sep 2008.", "Itemized receipts — Hillary Victory Fund. Federal Election Commission. 21 Aug 2016.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]