["About this rating", "In 2019, explorers made five submersible dives to the Titanic wreck with the DSV Limiting Factor. It concluded that the ship was rapidly deteriorating.", "It was misleading for a December 2020 online advertisement to make it appear as if the expedition had just happened. One Titanic historian referred to the expedition as \"shocking.\" However, an oceanographer who had also explored Titanic in 2010 said he didn't see what was so \"shocking\" about it.", "In December 2020, the website HistoricalPost.com advertised a new dramatic story about the Titanic: \"Divers Exploring The Titanic Wreckage Made A Spine-Chilling New Discovery.\"", "The advertisement led to an 80-page story with the headline: \"Divers Explored The Titanic For The First Time In 14 Years – And They Made A Haunting Discovery.\" The story also described the \"new discovery\" as being \"deeply shocking.\"", "However, the big reveal was the fact that the ship was quickly deteriorating, perhaps not surprising given it had been under water for more than a century.", "But what the intrepid voyagers ultimately found at the location of the wreck was deeply shocking.", "You see, the detritus of the Titanic is disappearing quickly. And Patrick Lahey – expedition member and president of Limiting Factor owner Triton Submarines – explained as much in a press release from Triton. Lahey revealed, “The most fascinating aspect [of the expedition] was seeing how the Titanic is being consumed by the ocean and returning to its elemental form while providing refuge for a remarkably diverse number of animals.”", "And much has vanished, too. For example, one artifact known as the “captain’s bathtub” – which has become famous thanks to various photographs – is no longer to be seen at the site. But what is left of the ship – as well as the thriving undersea wildlife that lives on the wreck – has been stunningly captured in the 4K footage that the divers were able to shoot.", "[Titanic history expert Parks] Stephenson emphasized the state of the vessel, too, when in August 2019 he told the BBC in August 2019, “[The] Titanic is returning to nature.” Powerful ocean currents, the corrosive action of salt water and bacteria that eat metal are all contributing to the disappearance of the the ship’s wreck.", "It was true that a 2019 expedition found that the wreckage of the Titanic was rapidly deteriorating. Explorers took the DSV Limiting Factor submersible down to the ship five times. It was the first dive down to the Titanic with people aboard in nearly 15 years.", "On Aug. 21, 2019, BBC.com reported that the expedition found that \"the wreck is deteriorating rapidly.\"", "Despite the near-freezing conditions, pitch black waters and immense pressure, life is thriving there.", "This though, said expedition scientist Clare Fitzsimmons, from Newcastle University, was a factor in the Titanic's decay.", "\"There are microbes on the shipwreck that are eating away the iron of the wreck itself, creating 'rusticle' structures, which is a much weaker form of the metal,\" she said.", "These rusticles - stalactites of rust hanging off the wreck - are so fragile that they can crumble into a cloud of dust if disturbed.", "Titanic historian Parks Stephenson referred to the 2019 expedition as being \"shocking.\" However, we were unable to find any mention of anything that was \"deeply shocking,\" as mentioned in the 80-page story from HistoricalPost.com.", "An opposing perspective came from oceanographer David Gallo, who also had some expertise in diving to the Titanic. He told USA Today that he didn't find the purported discovery to be \"shocking\":", "While photos of the ship may look ghostly, oceanographer David Gallo said the deterioration doesn't look much different than when he co-lead [sic] a remotely operated expedition to the Titanic in 2010. Gallo stressed that it's too soon to tell how long the ship will take to decay and more research needs to be done.", "\"I don’t see what was seen as being 'shocking,'\" Gallo said. \"It's been over 100 years and the ship shows wear, but it certainly looks like it’s going to last another 100 years,\"", "A documentary from the 2019 expedition titled \"Back to the Titanic\" was released on Disney+ and National Geographic.", "We recently covered other claims about the Titanic. One said that the \"hidden truth\" of the ship's sinking had been \"covered up for decades.\" Another story advertised that an \"old camera\" had been found in the \"deep ocean\" with \"horrifying Titanic photos\" still loaded into the device.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]