["About this rating", "The National Rifle Association (NRA) suffered some major blowback in February 2018 after yet another mass shooting took the lives of 17 people at a high school in Parkland, Florida. As survivors called on members of Congress to stop accepting money from the NRA, and companies ended commercial partnerships with the group, an image of a Tweet posted by spokeswoman Dana Loesch in 2010 that seemingly expressed an anti-Semitic sentiment resurfaced:", "This tweet is real: Loesch deleted it shortly after it went viral in February 2018, but the original was preserved by sources such as the Internet Archive.", "The controversial tweet was widely reproduced in February 2018, usually without any context explaining what it referenced or offering any insight into as to whether it may or may not have been anti-Semitic in intent. It was originally posted in October 2010, shortly after journalist Rick Sanchez had been fired by CNN for making anti-Semitic remarks during an interview on a SiriusXM radio program. During that interview, Sanchez referred to former Daily Show host Jon Stewart as a bigot, mocked the minority status of Jewish people, and implied that CNN and other television networks were controlled by Jews:", "Sanchez, during the course of a 20 minute interview on comedian (and regular CNN contributor) Pete Dominick's SiriusXM radio show, spoke about the discrimination he has felt as a Cuban-American over the course of his career, and decried what he called \"elite, Northeast establishment liberals\" like Stewart and Stephen Colbert.", "\"I think Jon Stewart's a bigot,\" Sanchez said. \"I think he looks at the world through his mom, who was a school teacher, and his dad, who was a physicist or something like that. Great, I'm so happy that he grew up in a suburban middle class New Jersey home with everything you could ever imagine.\"", "When asked by radio host Pete Dominick (who used to work as a warm-up comic for the Daily Show) against whom he thought Stewart was bigoted, Sanchez said, \"everybody else who's not like him. Look at his show, I mean, what does he surround himself with?\"", "Dominick pointed out that as a Jew, Stewart was also a minority — to which Sanchez responded, snickering, \"Please, what are you kidding? ... Yeah, a very powerless people.\"", "\"I'm telling you that everybody who runs CNN is a lot like Stewart, and a lot of people who run all the other networks are a lot like Stewart,\" Sanchez said. \"To imply that somehow they, the people in this country who are Jewish, are an oppressed minority? Yeah.\"", "When Loesch's tweet resurfaced in February 2018, she defended it by saying that it had been intended to point out the \"poetic justice\" of Sanchez's firing, not as an expression of anti-Semitism on her part:", "Helpful flashback context for your attempt to deflect from my credible points made today. Thanx for giving me another opportunity to remind people of the disgraceful bigots in our media. Feel free to RT @brofax unless you endorse this antisemitic trash. https://t.co/Nm03Efhln7 pic.twitter.com/JTzYXUy6IZ", "— Dana Loesch (@DLoesch) February 22, 2018", "In another tweet, Loesch asserted that she found (and still finds) Sanchez's comments abhorrent:", "Thank you. I found Sanchez’s remarks at the time (and still do) abhorrent.", "— Dana Loesch (@DLoesch) February 22, 2018", "Others, however, expressed skepticism about the phrasing of Loesch's original tweet. The Jewish news outlet Haaretz, for example, reported that:", "\"Her context is to minimize firing of a bigot to a revenge act ... and to post an antisemitic libel about Jews having power,\" one twitter user replied to the original tweet. While another user wrote in response, \"Why do you care if someone is Jewish or not?\" and another asked in all seriousness, \"Wait, this is a satire profile, right?\"", "Loesch has received similar criticism before when she appeared in ads targeting the New York Times and \"elites.\" At one point in the ad, which showed people fighting police, breaking storefront glass and burning the American flag, Loesch threatened, \"Consider this the shot across your proverbial bow ... In short? We're coming for you.\"", "Bomey, Nathan.   \"NRA Fallout: See the List of Companies That Cut Discounts for NRA Members After Parkland, Florida School Shooting.\"\r\n    USA Today.   26 February 2018.", "Madison, Lucy.   \"Rick Sanchez Out at CNN After Saying Jon Stewart a Bigot, Suggesting Network Is Run by Jews.\"\r\n    CBS News.   1 October 2010.", "Ali, Safia Samee.   \"Rubio Grilled by Parkland Shooting Students, Parents.\"\r\n    NBC News.   22 February 2018.", "Haaretz. \"NRA Spokeswoman Accused of anti-Semitism for 'Fired by a Jew' Tweet From 2010.\"\r\n          27 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]