["About this rating", "The fate of Supreme Court nominee Brett Kavanaugh hung in the balance in early October 2018 as the Senate Judiciary Committee awaited the results of an FBI investigation into allegations that he had committed a sexual assault some 30 years before -- allegations that Kavanaugh angrily denied in his Senate testimony.", "The Senate was already sharply divided along party lines on the urgency of pushing ahead with the confirmation, with Democrats demanding a full and unimpeded investigation into the charges and Republicans accusing the Democrats resorting to delaying tactics and attempting to destroy Kavanaugh's reputation.", "Public opinion was divided as well, with 45 percent of Americans saying they believed Kavanaugh's accuser (Professor Christine Blasey Ford) and 33 percent saying they believed Kavanaugh in an opinion poll taken four days after their testimonies.", "This clash of opinions played out on social media as uncivil debates raged in which each faction claimed the moral high ground and accused the other of lies and hypocrisy.", "A meme shared on 1 October took aim at Kavanaugh by calling out a GoFundMe account supposedly established in his and his family's name:", "The implication, of course, is that as a presumably wealthy and privileged member of the Washington elite, Judge Kavanaugh doesn't need a fundraising account. Other social media users made the same point:", "Yes, a gofundme page has raised over $100,000 for ‘poor’ Brett Kavanaugh.", "That’s right, some people think he needs money even though he has a job, government body guards, and will either soon be a Supreme Court justice, or he will get a six figures book deal. pic.twitter.com/WWRwV4Coco", "— Alex Morash (@AlexMorash) September 29, 2018", "Why are people giving money to SUPER WEALTHY #Kavanaugh & #DrChristineBlaseyFord ??? Both are RICH, should be GIVING MONEY, NOT GETTING!!! RT @thehill: GoFundMe campaign for Kavanaugh raises over $500,000 https://t.co/yfEYSQ1KhW pic.twitter.com/ogImymWxg0", "— Trixy Wh (@trixywh) October 4, 2018", "Whether or not it addressed an actual financial need on his part (press reports suggest that Kavanaugh, though by no means poor, is less well off as several current members of the Supreme Court), a number of Kavanaugh supporters did launch GoFundMe accounts in his name in late September and early October. The most successful of these had raised more than $600,000 by 5 October. It was opened by John Hawkins of North Carolina, who runs a partisan news and opinion website called Right Wing News.", "In an introductory note on the GoFundMe page, Hawkins explained the thinking behind it as follows:", "Like many decent people from both parties, I have been disgusted by the unsubstantiated 36 year old smears aimed at Brett Kavanaugh. We live in a country where innocent until proven guilty is supposed to mean something; yet Brett Kavanaugh's reputation is being dragged through the mud while his family is facing non-stop death threats.", "This is a horrible way to treat a good man who has dedicated his life to public service. So many unethical people are giving unprovable 36 year old accusations the same weight as 6 FBI background checks, hundreds of hours of hearings and testimony under oath. It is disgraceful.", "What I'd like to do is raise money for Brett Kavanaugh's family to use for security or however they see fit. All of the money collected will go to Brett Kavanaugh's family or alternately, if they refuse to accept it, to a charity of their choice. I have already reached out to a contact who should be able to put me in touch with Brett Kavanaugh's family. If he can't do it, I have plenty of other contacts who should be able to make it happen. I will update this page after I have talked with his family.", "I hope you will show your support for a good man who has been treated very, very badly.", "Hawkins posted updates chronicling his efforts to get in touch with the Kavanaugh family to discuss disbursing the funds. After many unsuccessful attempts he finally spoke to one of the judge's staffers, who told him that although the family is aware of the GoFundMe account and \"extremely appreciative\" of the donations, it would be a while before they could address the question of whether or not Kavanaugh, as a political appointee, can accept the money.", "On 30 October, Hawkins posted an update which included an \"official statement\" from Kavanaugh's representatives saying he would not accept the funds:", "\"Justice Kavanaugh did not authorize the use of his name to raise funds in connection with the GoFundMe campaign. He was not able to do so for judicial ethics reasons. Judicial ethics rules caution judges against permitting the use of the prestige of judicial office for fund-raising purposes. Justice Kavanaugh will not accept any proceeds from the campaign, nor will he direct that any proceeds from the campaign be provided to any third party. Although he appreciates the sentiment, Justice Kavanaugh requests that you discontinue the use of his name for any fund-raising purpose.\"", "GoFundMe accounts were also started for Kavanaugh's accuser, Christine Blasey Ford. The most successful of those had accumulated more than $540,000 in donations as of 5 October. A note from Ford posted on the GoFundMe page expressed her appreciation to all those contributing:", "I feel like all of you who have made a contribution are on this journey with me, which is very heartening. And some journey it has been and continues to be. We have already had to move four times, our movements are limited even with security, and the threats are ongoing. Thanks to you, I am able to feel safe, my family can be together, and my children can continue to go to school.", "On 21 November, Ford announced the closure of the GoFundMe account, pledging to donate any unused funds to trauma survivors:", "The funds you have sent through GoFundMe have been a godsend. Your donations have allowed us to take reasonable steps to protect ourselves against frightening threats, including physical protection and security for me and my family, and to enhance the security for our home. We used your generous contributions to pay for a security service, which began on September 19 and has recently begun to taper off; a home security system; housing and security costs incurred in Washington DC, and local housing for part of the time we have been displaced. Part of the time we have been able to stay with our security team in a residence generously loaned to us.", "With immense gratitude, I am closing this account to further contributions. All funds unused after completion of security expenditures will be donated to organizations that support trauma survivors. I am currently researching organizations where the funds can best be used. We will use this space to let you know when that process is complete.", "Adams, Becket.   \"Kavanaugh Declines $600,000 Raised in His Defense.\"\r\n   Washington Examiner.   31 October 2018.", "Albrecht, Leslie.   \"Brett Kavanaugh's GoFundMe Page Raises $603,770, Surpassing $540,000 Raised for Christine Blasey Ford.\"\r\n    Market Watch.   5 October 2018.", "Bekiempis, Victoria.   \"Christine Blasey Ford to Give Donations to Charity for Trauma Survivors.\"\r\n   The Guardian.   27 November 2018.", "Goldstein, Steve.   \"Brett Kavanaugh May Become the 'Poorest' Supreme Court Justice.\"\r\n    Market Watch.   14 July 2018.", "[29 November 2018]: Added information about the closure and disposition of the largest GoFundMe accounts in Kavanaugh and Ford's names.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]