["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump holds a campaign rally on Oct. 4, 2018, in Rochester, Minn. (AP/Jim Mone)", "Democrats across the country have been saying on the campaign trail that the Republicans’ longstanding push to overturn the Affordable Care Act threatens insurance protections for Americans with pre-existing conditions.", "The law was passed in 2010 by a Democratic-controlled Congress and signed by President Barack Obama; no Republican voted for it. Republicans used popular dissatisfaction with the law to make significant congressional gains in the 2010 and 2014 midterm elections, but the pattern has shifted in 2018, after unsuccessful Republican efforts to repeal the law.", "The Wesleyan Media Project recently found that health care was the most common subject of Democratic congressional campaign ads, the New York Times reported.", "But in a rally in Rochester, Minn., on Oct. 4, President Donald Trump sought to flip this narrative on its head. He argued that it’s actually the Republicans who are the champions of pre-existing condition protections, and Democrats who are trying to kill them.", "\"We will always protect Americans with pre-existing conditions,\" Trump said around the 34:00 mark. \"We’re going to take care of them. Some of the Democrats have been talking about ending pre-existing conditions. And some people have -- you know what I say? We'll get a little more money from China. It'll be just fine. It'll be just fine. We'll be just fine.\"", "We have previously written that a pending lawsuit against the Affordable Care Act by Republican attorneys general would, if successful, end protections for pre-existing conditions. (Such protections could be reinstated by new legislation if the courts do strike down the law, but health policy experts say the mechanics of achieving this result in a way different from the Affordable Care Act would be tricky; the decades-long fight to protect patients with pre-existing conditions does not provide much optimism for a quick legislative fix.)", "For its part, the Trump administration has decided not defend the law against the attorney generals’ suit, effectively siding with those who want to overturn the law.", "The second part of Trump’s assertion, however, was new to us. Is he right that \"some of the Democrats have been talking about ending pre-existing conditions\"?", "We found zero evidence of this.", "For starters, Trump’s assertion is illogical given the Democrats’ role in passing the law and Democratic efforts to hammer Republican candidates over pre-existing condition protections on the campaign trail. Here are examples from Sens. Joe Manchin, D-W.Va., Heidi Heitkamp, D-N.D., Claire McCaskill, D-Mo., and Joe Donnelly, D-Ind., and Ohio Democratic candidate for governor Richard Cordray.", "Drew Hammill, a spokesman for House Minority Leader Nancy Pelosi, D-Calif., said there is no such chatter among Democratic officeholders or candidates.", "We also asked independent health-policy experts whether they had heard any Democratic messages — or even whispers — about getting rid of pre-existing condition protections. They said they had not.", "\"I find President Trump’s comments surprising,\" said Christine Eibner, a health policy specialist at the Rand Corp.", "\"I can’t think of any,\" said Gail Wilensky, who headed Medicare and Medicaid under President George H.W. Bush.", "\"No — how bad can this (rhetoric) get?\" asked John Holahan, a health policy specialist at the Urban Institute.", "\"Unbelievable,\" said Linda Blumberg, who also studies health policy at the Urban Institute. \"No.\"", "The White House did not reply to an inquiry seeking examples. Neither did the office of the Senate majority leader or the House speaker.", "Trump said, \"Some of the Democrats have been talking about ending (coverage for) pre-existing conditions.\"", "We can’t find any examples of what Trump claimed Democrats were saying. A Democratic proposal to end pre-existing conditions would run 100 percent counter to Democrats’ own history with the Affordable Care Act and would undercut one of the Democrats’ most powerful messages on the campaign trail this year.", "We rate the statement Pants on Fire.", "UPDATE: Shortly after publication, we lengthened the excerpt of Trump's remarks, so readers could read his complete thought.", "Donald Trump, remarks at a rally in Rochester, Minn., Oct. 4, 2018", "PolitiFact, \"Did Patrick Morrisey join a lawsuit to allow insurers to deny coverage for pre-existing conditions?\" June 26, 2018", "Washington Post, \"Trump administration won’t defend ACA in case brought by GOP states,\" June 7, 2018", "New York Times, \"No. 1 Aim of Democratic Campaign Ads: Protect Pre-existing Conditions,\" Sept. 17, 2018", "Email interview with Drew Hammill, spokesman for Nancy Pelosi, Oct. 5, 2018", "Email interview with Linda Blumberg, health policy fellow with the Urban Institute, Oct. 5, 2018", "Email interview with Christine Eibner, senior economist at the Rand Corp., Oct. 5, 2018", "Email interview with Gail Wilensky, head of Medicare and Medicaid under President George H.W. Bush, Oct. 5, 2018", "Email interview with John Holahan, fellow in the health policy center at the Urban Institute, Oct. 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]