["About this rating", "U.S. Sen. Elizabeth Warren articulated her argument in a way that could reasonably have led an observer to believe she meant to trivialize Tibbetts' homicide (the suspect is an undocumented immigrant) by contrasting it with \"real problems,\" and that immigrant family separation was one such problem.", "In raising the example of the Trump administration's immigrant family separation policy, Warren was actually acknowledging the danger posed by some undocumented immigrants and arguing that U.S. immigration enforcement policy should focus on those violent criminal immigrants (the \"real threat\") rather than immigrant families detained at the border.", "In October 2019, we received multiple inquiries about the accuracy of claims that Democratic presidential candidate Sen. Elizabeth Warren of Massachusetts had made remarks that callously downplayed the killing of a young woman in Iowa, and suggested that focus should instead be placed on allowing \"illegal immigrants\" to \"see their kids.\"", "On Oct. 8, the right-leaning, pro-Trump Twitter account @realjack wrote:", "\"So Elizabeth Warren was asked about Mollie Tibbetts being murdered by an illegal ... Her reply was: 'I know this is hard for her family, but they have to remember that we need to focus on real problems like illegal immigrants not being able to see their kids.' Let that sink in.\"", "So Elizabeth Warren was asked about Mollie Tibbetts being murdered by an illegal...", "Her reply was:", "“I know this is hard for her family, but they have to remember that we need to focus on real problems like illegal immigrants not being able to see their kids”", "Let that sink in.", "— Jack Murphy (@RealJack) October 8, 2019", "Although @realjack presented those words as a direct quotation, they were actually a distorted summary of what Warren said, and one that had the effect of making her remarks appear more callous than they actually were, as well as misleading readers into thinking that Warren had suggested the slaying of Tibbetts was not a \"real problem.\" In fact, the logic of her argument indicates quite the opposite.", "Warren gave the interview in question to CNN on Aug. 22, 2018. At that time, the body of missing 20-year-old college student Mollie Tibbetts had just been found in Poweshiek County, Iowa, and police had arrested Cristhian Rivera, an undocumented immigrant and Mexican farmworker, on suspicion of murder. He has pleaded not guilty and faces trial in February 2020.", "Rivera's immigration status was quickly seized upon by U.S. President Donald Trump and supporters of his immigration policies to the extent that members of Tibbetts' family themselves intervened, criticizing efforts to politicize her death, challenging the relevance of Rivera's immigration status, and defending the Latino community in Poweshiek County.", "During the course of the CNN interview, host John Berman asked Warren for her response to calls for stricter immigration laws after Tibbetts' killing. In the interest of providing context and transparency, the following is a transcript of the entire exchange, which can be watched in the video below:", "Berman: I want to get one last question in here, because it is a story, a very important story in the news, it has to do with Mollie Tibbetts, the young woman in Iowa who was murdered, her body believed to be found yesterday. A person has been charged with it, this person is an undocumented immigrant. Mike Pence and the president have suggested the immigration laws need to be stronger so that people like this man, who was accused of this murder, were not in the country. Your reaction?", "Warren: I'm so sorry for the family here, and I know this is hard, not only for her family but for the people in her community, the people throughout Iowa. But one of the things we have to remember is we need an immigration system that is effective, that focuses on where real problems are. Last month, I went down to the border and I saw where children had been taken away from their mothers. I met with those mothers -- who had been lied to, who didn't know where their children were, hadn't had a chance to talk to their children -- and there was no plan for how they would be reunified with their children. I think we need immigration laws that focus on people who pose a real threat, and I don't think mamas and babies are the place that we should be spending our resources. Separating a mama from a baby does not make this country safer.", "﻿", "The first thing to note is that, contrary to @realjack's claim, Warren clearly did not say, as a complete and uninterrupted sentence: \"I know this is hard for her family, but they have to remember that we need to focus on real problems like illegal immigrants not being able to see their kids.”", "Placing that sentence in quotation marks gave readers the false impression it was a direct quotation. However, clearly the quotation contains words and phrases identical or similar to those Warren did utter, such as \"I know this is hard for her family,\" \"they have to remember\" and \"focus on real problems.\"", "One might argue, then, that @realjack's tweet constituted a summary of Warren's remarks, rather than a direct recitation. However, as a summary it gave readers a misleading and false impression of the full meaning and sense of what Warren actually said.", "It is possible to misunderstand Warren's comments in good faith. The way she worded and structured her response appears to have given rise to the impression that she was downplaying the tragedy of Tibbetts' death, before quickly turning, by contrast, to the \"real problem\" of immigrant children being separated from their parents at the southern border, the latter the result of the Trump administration's border detention policy.", "If one strips down her introductory remarks to its essential components, it reads something like this: \"I'm so sorry for the family, but we have to remember that we need an effective immigration system that focuses on real problems.\" Based on such a summary of her introductory remarks, it is understandable how even someone who is positively or neutrally predisposed toward Warren might view her comments as being callous, or an effort to present Tibbetts' killing as trivial by comparison with \"real problems.\"", "Since Warren then went on to describe an encounter with immigrant children separated from their parents at the border, it's understandable that some might have understood her purpose as providing an example of a \"real problem\" that should supplant the death of Tibbetts in the minds of viewers.", "However, gaining a full and proper understanding of Warren's meaning requires reading on beyond that point. After describing the ordeal suffered by separated immigrant families, she told CNN: \"I think we need immigration laws that focus on people who pose a real threat, and I don't think mamas and babies are the place that we should be spending our resources.\"", "The \"real threat,\" here, was clearly undocumented immigrants who commit violent crimes and pose a danger to public safety, such as Rivera is alleged by prosecutors to be, in the case of Tibbetts. Warren was distinguishing violent immigrant criminals from immigrant mothers and infants detained separately after attempting to cross the southern border into the United States.", "So, rather than downplaying the seriousness or tragedy of Tibbetts' killing, allegedly at the hands of an undocumented immigrant, a fair reading of Warren's full response shows that she was, in fact, readily acknowledging the seriousness of violent crime committed by some undocumented immigrants, but arguing that U.S. immigration enforcement policy should focus on those violent criminals, rather than families detained at the border.", "Associated Press.   \"Farmhand Pleads Not Guilty in Stabbing Death of Iowa Runner.\"\r\n    19 September 2018.", "Associated Press.   \"Trial in Mollie Tibbetts Killing Now Pushed to February.\"\r\n    19 September 2018.", "Palma, Bethania.   \"Did Mollie Tibbetts' Family Make a Statement Condemning the Politicization of Her Death?\"\r\n    Snopes.com.   27 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]