["About this rating", "On 3 December 2015, Facebook user Kelly Roiz posted a photo purportedly showing President Obama in a car with ISIS leader Abu Bakr al-Baghdadi:", "Here is a picture of our supposed President Barack Hussein Obama with you won't believe who! None other then the Leader of ISIS the Radical Muslim Terrorist Group Abu Bakr Al-Baghdadi himself. They are best friends people and not only is that disgusting but Baghdadi is just a puppet of Obama's. President Obama is the actual Leader of ISIS he is the actual Caliph for the Caliphate. He wants to rule the whole world just like Hitler. We need to prepare ourselves for war not later but right now because ISIS is here as you plainly could see from the Terrorist Attack yesterday in San Bernardino CA. God Bless Everyone who believes and to those of you that don't stop being stupid and open your eyes already.", "While the origins of the photo are still unclear, it appears that it was first posted to the internet on 21 July 2014 on the web site Live Leak. That photo was also accompanied by a similar claim:", "A Photo depicting a young Barack Obama as Mujahedeen has emerged through leaked files. President Obama can be seen wearing a white shirt, holding a rocket propelled grenade launcher. In the bottom left corner, President Obama's dearest friend and currently most valuable asset, Abu Bakr al-Baghdadi can be seen.", "Photo is reportedly taken in Syria in the beginning of the 1980s when Muslim Brotherhood tried to overthrow the Great, Compassionate, Loved, Dearly Respected and Democratically elected President Hafez al-Assad", "It's thought to be at this time when Barack Obama and Abu Bakr al-Baghdadi first came up with the idea of the Islamic State.", "\"Shireen Said,\" the Live Leak user who originally uploaded the photo, admitted in the comment section that Obama was not pictured in the above-displayed image and that she was \"trolling\" when she posted the photo:", "In addition to \"Shireen Said\"'s admission that s/he was \"trolling\" when s/he posted the above-displayed photo, it should be noted that Abu Bakr al-Baghdadi was between the ages of 10 and 12 in the \"beginning of the 1980s,\" when the photograph was allegedly taken.  So what we have is a picture that shows four people with weapons in a car, and one of those people bears a darker complexion and a minor resemblance to the President of the United States:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]