["ये नजारा नेपाल का है। ये एक इसाई था जो वहा के हिन्दुओ को बहला फुसलाकर उनका धर्म बदलवाकर उन्हे इसाई बनाता था। साले का पता चलते ही बीच चोराहे पर जला दिया वहा के हिन्दुओ ने। ऐसा हमारे हिन्दुस्तान मे भी हो रहा है इसको जल्दी नही रोका गया तो हिन्दु धर्म खतरे मे पड सकता है। (This image is from Nepal. He was a christian who was luring Hindus and converting them. Hindus there burnt him alive on the street. This is happening in India as well and if not stopped, Hindu religion will be in danger) (translated). This message which implicitly calls for violence and street justice against a religious minority is accompanied with a disturbing image of a man who has been stripped and tied to a stake. He can be seen screaming as the fire begins to engulf his legs.", "ये नजारा नेपाल का है। ये एक इसाई था जो वहा के हिन्दुओ को बहला फुसलाकर उनका धर्म बदलवाकर उन्हे इसाई बनाता था। साले का पता…", "Posted by सौगंध राम की खाते है हम मंदिर वही बनाएंगे on Wednesday, May 2, 2018", "This image along with the message is circulating on social media, particularly on Facebook. The page Saugandh Ram ki khate hain hum mandir wahi banayenge which has over 500,000 followers posted this image on May 2, 2018 and has been shared close to a thousand times. We scanned Facebook to find other instances and interestingly, we discovered that this image with the same claim had circulated back in 2014 as well. For instance, a little known Facebook page Hindu Rakshak Dal had posted this image in November 2014, openly calling for violence with the message नेपाल में एक इसाई युवक हिन्दुओ को बहका कर इसाई बना रहा था जिसे वहा के हिन्दुओ ने जिन्दा जला दिया ..क्या हमारे देश में ऐसा नहीं हो सकता ??? क्या नेपाल के हिन्दुओ से हम कम ताकतवर है ??? (A Christian youth in Nepal was converting Hindu youth, he was burnt alive by Hindus there. Can this not happen in our country? Are we less powerful than the Hindus of Nepal?) (translated).", "The unimpressive share count of these posts was compensated by the sheer number of pages, groups and individual users which had shared it. In another context, the image was shared widely in 2014 with the claim that the person was burned alive for preaching the gospel, and with a call for prayer for preachers across the world. The photograph with the fake claim has now resurfaced on social media.", "What is the truth?", "The photograph of the man being set ablaze is not from Nepal but from Ecuador. The incident had most likely occurred in 2006, and the victim was a suspected thief who was caught by locals, tied to a stake and set on fire at Pelileo Grande, 75 miles south of the capital Quito. The incident was reported by the U.K based news publication The Daily Mail. According to the report, the person was rescued with the intervention of the local priest and some villagers. This photograph has been circulating online for several years. In a different context, it was alleged that this man had been burnt alive as part of the Islamic (Sharia) law.", "Alt News monitors social media on a daily basis and comes across countless instances of misinformation/disinformation with communal overtones wherein photos and videos are taken out of context. The dominant narrative with regard to such messages is harassment, violence and persecution faced by one religious sect at the hands of another religious community, and a call for sectarian unity against such ‘injustice’, often in favour of a political party or leader. However, this instance is particularly sinister and alarming as it tacitly endorses the use of violence and brutality against religious minorities.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]