["By Angelo Fichera", "Posted on May 25, 2018", "Q:  Is CNN going to shut down because of poor TV ratings?", "A: No. There is no evidence to support that headline from a known purveyor of viral deceptions.", "CNN is not preparing to shutter, despite what an online headline claims.", "“CNN To Permanently Close Its Doors As Ratings Plunge 30 Percent,” reads the May 18 headline on Your News Wire, a routine publisher of fabricated news  stories. The story was posted elsewhere online, and shared on Facebook, where users rightfully flagged it as potentially false.", "It presents no actual evidence of CNN’s closing, and instead cherry-picked ratings data to show that the network is having a “ratings crisis.”", "It’s true that CNN “posted double-digit audience losses” during a week earlier this month, according to an Adweek article to which Your News Wire linked. CNN experienced a 29 percent decline in prime-time viewers during the week of May 7, compared to the same time last year, according to data from  the analytics company Nielsen.", "But neither Your News Wire, nor the conservative website Breitbart, which wrote a sizable portion of the text used in the story about CNN’s alleged demise, provided additional information that would paint a less dire picture of the network’s viewership.", "For example, during the month of April, CNN saw a 4 percent year-over-year increase in prime-time viewers. And two of its programs, “New Day” and “CNN Tonight,” saw their largest average April audience ever.", "Robert Thompson, director of the Bleier Center for Television & Popular Culture at Syracuse University, told us that ratings can be “complicated.”", "“Especially when you start cherry-picking individual ratings for a certain month or a certain week,” he said. “Whoever’s trying to make the argument that X show is doing horribly can usually find … data to support one argument or another.”", "For instance, when comparing the first quarter of 2018 with the first quarter of 2017, Fox News was down both in total day viewers, by 16 percent, and in prime-time viewers, by 13 percent. And, among Fox News, MSNBC and CNN, MSNBC was the only cable network whose ratings rose for the first quarter, year-over-year, with a 30 percent increase in both total day and prime-time viewers. Even so, Fox News remained the top cable news network, by ratings standards.", "Generally, it’s best to examine data over longer periods of time to address trends — a year is better than, say, a week — and consider things “across the board,” Thompson said. In the case of CNN, that would include considering other factors, such as CNN’s performance internationally. (Nielsen ratings are specific to the U.S.)", "“There are so many different numbers that are relevant,” Thompson said, “and so many different ways one can try to make sense of those numbers.”", "He added: “I think CNN is looking at a whole bunch of their data when they decide to stay in business.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Adl-Tabatabai, Sean. “CNN To Permanently Close Its Doors As Ratings Plunge 30 Percent.” Yournewswire.com. 18 May 2018.", "“Fox News Channel Continues to Top Cable News Landscape in Both Total Day and Primetime for 65 Consecutive Quarters.” Press Release. Fox News. April 2018.", "Katz, A.J. “April 2018 Ratings: CNN New Day and CNN Tonight Each Post Their Best April Ratings Ever.” Ad Week. 1 May 2018.", "Katz, A.J. “The Big Three Finish Among Top 10 in Total Day; Fox News Is No. 1 and Posts Year-Over-Year Growth.” Ad Week. 15 May 2018.", "Thompson, Robert. Director, Bleier Center for Television & Popular Culture at Syracuse University. Phone interview with FactCheck.org. 23 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]