["As part of its #IndiaRejectPropaganda campaign, Times Now recently announced that it will carry out “extensive fact checks to separate truth from fiction”. One such fact-check analysed a tweet from a handle @thezaiduleaks which had posted an image of a scene from the popular TV show ‘Game of Thrones’ with the text, “Kashmiri girl who became blind after she was hit by pellet gun, her brothers, father & mother were mercilessly killed, her sister was raped by Indian Army now begging on street of Srinagar. Where is Humanity?”", "Kashmiri girl who became blind after she was hit by pellet gun, her brothers, father & mother were mercilessly killed, her sister was raped by Indian Army now begging on street of Srinagar.", "Where is Humanity?#KashmirUnderThreat #OperationKashmir#IndiaUsingClusterBombs pic.twitter.com/Pcc94cQ7zC", "— Fan of Zaidu🇵🇰 (@TheZaiduLeaks) August 3, 2019", "With its screen flashing “Pak’s fakery caught out” and “Pak’s ISI propaganda exposed”, Times Now anchor said, “there is someone with a handle that has got a Pakistani flag on it and when we did a fact-check we found that this image is from a fictional TV series ‘Game of Thrones’…. and Pakistan is trying to peddle these lies as part of what is happening in India as part of abrogation of article 370.”", "Times Now is correct that the picture is from ‘Game of Thrones’. But was this a part of Pakistani propaganda? Is there an ISI hand behind this tweet as concluded by Times Now?", "The @thezaiduleaks is a popular parody handle on Twitter. It’s bio states, “All tweets are for fun 100% fake imaginary”.", "The handle has a Pakistani flag and mentions Rawalpindi, Pakistan as its location which could be misleading at first glance. However, the fact that it calls itself a parody handle in its Twitter bio should have been a hint that its stated identity may not be its actual identity.", "A simple fact-check ascertains that the handle is not run by Pakistanis let alone by the ISI.", "This Twitter handle was created in 2010. When Alt News searched for the earliest tweets addressed to the handle, we found that the @thezaiduleaks account used to be called @er_dev_singh in its early days.", "The account was later renamed to @theghazwatimes. We found this upon searching for tweets addressed to the handle @thezaiduleaks in the period between January and February 2018.", "The @theghazwatimes account was first promoted by a Twitter account @AndColorPocket.", "Mitron chacha Zaid Hamid ka account twitter ne fir uda diya , please follow Chacha’s new account. @TheGhazwaTimes #FF", "— 🦁 (@AndColorPockeT) February 2, 2018", "According to an article on the right-wing portal rightlog.in, @AndColorPocket is an account run by one Rajat Rawal who is/was an admin of the Facebook page The Frustrated Indian.", "The @theghazwatimes was eventually renamed as @thezaiduleaks. If you search for @theghazwatimes on Google, it leads back to @thezaiduleaks. This is because an account’s username can be changed multiple times but its Twitter ID remains unique. In the video below, one can see Google search results for “twitter.com/theghazwatimes” redirect to tweets by @thezaiduleaks.", "Thus, a parody Twitter handle promoted by an Indian associated with the right-wing portal rightlog.in was claimed to be running by Pakistanis and ISI by Times Now. Not just Times Now, but India TV too had declared that a Pakistani handle is making pictures from ‘Game of Thrones’ viral as those from Kashmir.", "In this video, @indiatvnews uses Parody accounts tweets to explain how Pakistani are running their propaganda against India. 🤦🤦🤦 pic.twitter.com/SEBcJuZTpN", "— Mohammed Zubair (@zoo_bear) August 14, 2019", "Joining both these TV channels was Madhu Kishwar who was also unaware that the image depicts a scene from the popular TV show.", "You liar and cheat. This photo was being peddled by jehadis as Kashmiri girl blinded by security forces. In fact I commented that it was too filmy to be true. How mean and stupid can you get @news18dotcom ? https://t.co/qxuZPILCQS", "— MadhuPurnima Kishwar (@madhukishwar) August 6, 2019", "Meanwhile, @thezaiduleaks handle and its followers are having a good laugh about the Times Now fact-check.", "U r famous dude ….the Dolts at TOI-let Media actually quoted ur tweet on PrimeTime news w/o realising its a parody handle !", "Following u just for this 🙂 ! Cheers", "cc : @TimesNow @RShivshankar @PadmajaJoshi @navik – that must have been really embarrassing 😃", "— Taansane (@BesuraTaansane) August 13, 2019", "Times Now and India TV have not only fallen for a parody handle but have carried out extensive fact-checks to declare it being run by Pakistan’s ISI. Times Now’s extensive fact-check failed to recognize that it is an Indian handle run out of India by Indians.", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]