["A TikTok video of a cell tower on fire has been viral on social media for the past few days. Several users are linking this clip to the ongoing farmers’ protests. Farmers vandalised 1,500 Jio cell towers in Punjab on December 29, 2020, venting anger against Mukesh Ambani-owned Reliance which they believe to benefit out of the farm laws. A Facebook page titled ‘Kisan Ekta Morcha’ posted the clip claiming that it shows one such tower. It received over 14,000 views at the time of writing. (Archive link)", "#जियो का टावर जलाया गया", "Kisan Ekta Morcha हिंसा की निंदा करता है", "Posted by Kisan Ekta Morcha on Monday, December 28, 2020", "Twitter user @IncKinju tweeted the video and accompanying claim, where it received more than 5,600 views at the time of writing. (Archive link)", "अभी तो @narendramodi के मालिक अंबानी सिर्फ़ टॉप 10 से बाहर हुआ है और अगर ‘होली’ तक #किसान_आंदोलन चलता रहा तो उसका दिवाला निकल जायेगा। pic.twitter.com/3xKUrjN1hJ", "— Kinju_inc (@IncKinju) December 28, 2020", "Another Facebook page named ‘A.H. Khan’ also shared this video. It was viewed more than 1,300 times at the time of writing. (Archive link)", "😝😜 जियो का टावर किया स्वाहा😝😜😜😜", "Posted by 𝐀.𝐇.𝐊𝐡𝐚𝐧 on Wednesday, December 30, 2020", "This clip is viral on Facebook.", "First of all, these visuals cannot be recent because this is a TikTok video. The central government banned the mobile application back in June 2020.", "Alt News performed a reverse image search of a few frames of the video and found an Amar Ujala report dated June 28, 2017. It says that the incident occurred in Dehradun. It also includes some other photos of the cell tower. The article states, “A fire broke out at the cell tower installed on the roof of Shakti Kumar Mehta, a resident of Ankitpuram’s GMS Road. The fire broke out at around five in the morning on Wednesday. The flames quickly grew prompting those in the neighbourhood to come out of their houses. They feared that the tower would fall and called the fire station. Fire engines quickly reached the spot and they extinguished the blaze. According to the Fire Department, the fire occurred due to a short circuit.”", "News18 Hindi also did a video story about this fire on June 29, 2017.", "Therefore, social media users falsely linked a June 2017 clip of a burning cell tower in Dehradun to the farmers’ protests.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]