["On January 6, 2019, Bollywood filmmaker Ashoke Pandit tweeted two screenshots – a Facebook post by JNU student Afzal Husain Khan and a screenshot of Khan’s Facebook bio – and claimed that a Muslim student of the varsity had ‘planned’ an attack on ABVP members. Pandit’s tweet came after JNU ABVP members alleged violence by students associated with Left-affiliated bodies. The highlighted text in the Facebook post reads, “We are planning to move into phase 2, and work on a flash mob strategy used by Hong Kong, and spread it across cities.”", "It was #AfzalGuru first & now we see #AfzalHussainKhan who is one of the masterminds of #JNUattack on @abvpjnu. #ArrestAfzalHussainKhan. #ShutdownJNUUniversity pic.twitter.com/sSoEEIzlXe", "— Ashoke Pandit (@ashokepandit) January 6, 2020", "The complete Facebook post informs about Shaheen Bagh coordination committee calling off the 20 day-long blockades in the area and remodelling the protests around individual agitations. It reads, “Shaheen Bagh Coordination Committee has #called off the blockade that has continued for more than 20 days. Protest will continue in the form of individual campaign to teach community and make them aware of future plan of actions. We’ll call for Bharat Bandh before hearing of the before the honourable Supreme Court. Our Committee and volunteers have withdrawn themselves from the protest site. We request all of you to stop sending any assistance to this stage which has been now hijacked by Congressis, and cash hungry gangs who don’t care about riots and its implications for the community. We are planning to move into Phase 2, and work on a flash mob strategy used by Hong Kong, and spread it across cities. Please share it as much as possible. – Shaheen Bagh Coordination Committee”.", "Twitter handle @RealHistoriPix also posted the same screenshots with the message, “As per reports, @DelhiPolice has arrested Afzal Hussain Khan, JNU student who planned violence in campus”. Multiple Twitter users have circulated the same claim.", "Chayan Chatterjee, grandson of Ashutosh Mukherjee, also shared the video with the false claim.", "Alt News found that Pandit’s claim about Khan ‘masterminding’ the attack on JNU is false. Afzal Husain Khan was formerly associated with the All India Students Association (AISA). Khan edited his post after it went viral to clearly state what ‘phase 2’ meant, “We are planning to move into Okhla Phase 2. Please share it as much as possible,” the post now reads.", "Alt News contacted Afzal Husain Khan who denied having any association with the Shaheen Bagh coordination committee and said that he was merely sharing the statement posted by Sharjeel Imam, one of the organizers of anti-CAA protests at Delhi’s Shaheen Bagh.", "We have called off the Shaheen Bagh road blockade today to avoid the impending violence from party goons and to avoid…", "Posted by Sharjeel Imam on Thursday, 2 January 2020", "“I just shared the statement regarding calling off of the Shaheen Bagh road blockade. It was shared in multiple WhatsApp groups and on Facebook as well. Actually there was much confusion among people regarding the call-off. So I took to FB and shared the same. As of now, I’m not associated with any party or organisation. I don’t know why BJP IT cell picked up my post and is trying to put my life in jeopardy. I’m receiving open threats on FB. I’m being framed by an FB post that has nothing to do with any kind of violence,” Khan said.", "Refuting the claim of his arrest, he added, “On Twitter “History of India” claimed that I have been arrested, this is worrisome, my family members, friends and well-wishers are deeply concerned for my safety.” According to media reports, arrests for the January 5-6 violence are yet to be made. Delhi police has however filed an FIR against JNUSU president Aishee Ghosh and named 19 others for “attacking security guards and vandalizing server room on January 4.”", "Khan’s post reads the same as Imam’s who had shared the information earlier.", "Imam’s statement about using “flash mob strategy” was also reported by mainstream media outlets like India Today, Outlook and The Finiancial Express on January 2, 2019.", "According to a Reuters report, pro-democracy protesters in Hong Kong adopted a “be water” strategy where demonstrators pop-up in different locations to catch the authorities flat-footed. The strategy has already been mirrored by anti-CAA protesters in Hyderabad. “The location of the protests, which change daily, are posted just an hour or two in advance, with the exact spots shared just minutes ahead of time,” stated the article published on January 4, 2019. It interestingly also refers to Sharjeel Imam who talks about utilising the same strategy in Delhi.", "Filmmaker Ashoke Pandit compared a JNU student with Afzal Guru and put out a bogus claim of Afzal Husain Khan ‘masterminding’ the violence. Pandit has been found sharing multiple instances of misinformation around the JNU violence. The filmmaker had falsely claimed that SFI activist Soori Krishnan faked injuries sustained in the attack. He also retweeted a video which was shared with the false narrative that ABVP members were assaulted in the violence when in fact the opposite was true.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]