["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A portion of Central Park in 2009 (Ed Yourdon via Creative Commons)", "A viral TikTok post says New York City’s Central Park once was a town called Seneca Village.", "The video, which was later removed from the platform, boasted over 3 million views. It’s preserved in this tweet.", "In the video, TikTok user Hannah Stater said in part, \"Central Park actually used to be a town called Seneca Village that was founded by freed African American slaves in 1825.\" She added that the residents were evicted and that this history is not well known because it’s \"uncomfortable.\"", "This description is largely accurate.", "From 1825 to 1857, Seneca Village consisted of the land between 82nd and 89th Streets and 7th and 8th Avenues.", "The land was purchased by a white couple, John and Elizabeth Whitehead, in 1824. It was soon subdivided into smaller plots.", "Columbia University's Seneca Village Project has identified Seneca Village as the first significant community of African American property owners in Manhattan.", "On Sept. 27,1825, Andrew Williams, a young African American, purchased three lots from the Whiteheads for $125.", "The same day, trustees of the African Methodist Episcopal Zion Church purchased six lots near 86th Street. Those trustees included Epiphany Davis, an African American store clerk, who purchased twelve lots for $578.", "These transactions provided the nucleus for Seneca Village. There were three churches, a school and several cemeteries.", "The land \"was occupied by various groups, including the African American and Irish residents of Seneca Village, as well as scattered small German farmers and Irish households,\" Elizabeth Blackmar, a Columbia University historian, told PolitiFact.", "By 1855, the community had grown to 264 residents, as German and Irish immigrants integrated into the village, according to the New York Times.", "Map of Seneca Village circa 1857", "By the 1840s, lower Manhattan, the original core of the city, had become unsanitary and overcrowded. Affluent and civic-minded New Yorkers grew concerned that commerce and industry were sullying the island. According to the New-York Historical Society, some leading residents resented an influx of poor immigrants and considered how to create new neighborhoods for wealthier New Yorkers.", "Between 1849 and 1853, New Yorkers debated how a \"grand\" park might be constructed to stretch from midtown to northern Manhattan could be created.", "\"In the summer of 1853, the city government authorized taking the land between 59th and 106th Streets, between Fifth and Eighth Avenues, to lay grounds for a public park. The city claimed the right of ‘eminent domain,’ which permits the state to take private land for public use, with compensation afforded to the land owners,\" wrote the New-York Historical Society.", "Seneca Village was directly in the path of the planned park.", "\"All residents were forced to vacate beginning in 1856,\" the historical society wrote, \"Approximately 1,600 people, spread over 7,500 lots of land, were directly affected by this decision. Nearly 300 of them lived in Seneca Village.\"", "The New-York Historical Society has noted that to ease evictions, popular newspapers and magazines at the time portrayed the site of the future park as a \"wasteland\" occupied by \"squatters,\" \"shanties,\" \"bloodsuckers\" and \"insects.\" But many of the residents fought to keep their land and requested higher compensation.", "Ultimately, Seneca Village residents were given final notice to leave in the summer of 1856. Residents were compensated for their land, but many didn’t want to leave or said their land was undervalued in the process, according to a history from the Central Park Conservancy.", "\"That's how Central Park was made, with most newspapers cheering the removal of ‘the insects,’\" wrote the New York Times.", "Some Seneca Village residents moved to different parts of the city, to Long Island, or out of New York state. Williams’ family ultimately settled in California.", "\"By 1857, a substantial community with deep spiritual and familial ties— some that went back more than thirty years—had vanished without leaving much evidence of its past,\" the New-York Historical Society wrote.", "The TikTok video said, \"Central Park actually used to be a town called Seneca Village\" founded by African Americans in 1825.", "Many of the earliest residents of Seneca Village were African Americans, and they were evicted through eminent domain before the park was built.", "The brief history on the TikTok does leave out some of the details, including that Irish and German immigrants were also residents of Seneca Village and that Seneca Village only accounted for a fraction of what became Central Park.", "But the gist of the story is accurate. We rate it Mostly True.", "@Juliannyc901, tweet of Hannah Stater TikTok, June 5, 2020", "New York Times, A Village Dies, A Park Is Born,  Jan. 31, 1997", "Seneca Village Project, Columbia's Seneca Village Project", "Vox, Seneca Village: the lost neighborhood under New York's Central Park, June 20, 2020", "NYHistory.com, Seneca Village, 2010", "Email interview with Jack Eichenbaum, New York City tour guide, July 26, 2020", "Email interview with Elizabeth Blackmar, Columbia University professor of American History, July 26, 2020", "Email interview with Falguni Smith, Central Park Conservancy Communications Director, July 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]