["About this rating", "On 6 February 2017, the Houston Leader web site published an article  reporting that President Trump had enacted a 90-day ban on childhood vaccinations via executive order:", "Late [on the] afternoon [of 6 February 2017] President Trump announced what may be one of his most controversial decisions to date when he signed an executive order placing a temporary 90-day ban on all childhood MMR (measles/mumps/rubella) vaccinations.", "The executive order will require all pediatric doctors to refuse the administration of MMR vaccinations in all of their patients under the age of 18-years-old for the next 90-days or risk losing their medical license.", "Additionally, the executive order implements a mandatory freeze on all MMR vaccinations from pharmaceutical distributors to health care professionals during these 90-days.", "The articles included screenshots of two genuine tweets critical of vaccinations that were posted by President Trump years prior to his run for the presidency:", "Healthy young child goes to doctor, gets pumped with massive shot of many vaccines, doesn't feel good and changes - AUTISM. Many such cases!", "— Donald J. Trump (@realDonaldTrump) March 28, 2014", "I am being proven right about massive vaccinations—the doctors lied. Save our children & their future. — Donald J. Trump (@realDonaldTrump) September 3, 2014", "Although the tweets were legitimate, the article's claim was not. President Trump's purported signing of a \"90-day ban on childhood vaccinations\" would constitute a highly newsworthy development, yet not a single additional source reported any such order was signed. And the site on which it was hosted was only recently established, one major hallmark of fake news sites:", "The Houston Leader web site is one of a series of fake news sites that masquerade as real news sites by emulating the appearance of big-city newspapers.  This fake web site should not be confused with that of the legitimate Houston-based news outlet The Leader.", "Although some posing-as-regional fake news outlets included disclaimers marking their content as fabricated, we were unable to locate any such notice on HoustonLeader.com.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]