["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A 6-day-old baby giraffe peers out at guests visiting the Milwaukee County Zoo on Sept. 22, 2015. Does the Milwaukee County executive have sole power to sell county assets such as the zoo? (Angela Peterson photo)", "The two Milwaukee Democrats sparring in the race for Milwaukee County executive are both busy talking about the incumbent, Chris Abele.", "The millionaire philanthropist, elected in 2011 to succeed Scott Walker, is touting his accomplishments -- claiming he balanced the county budget \"without raising taxes five years in a row\" (Half True), and that 1 million route-miles have been added to the bus system without a fare increase (Mostly True).", "Meanwhile, the leading challenger, state Sen. Chris Larson, has cast Abele as out of touch -- and too powerful. Larson, who was a member of the county Board of Supervisors before Abele took office, won election to the Senate in 2010 after defeating a Democratic incumbent.", "On the Nov. 22, 2015 \"Upfront with Mike Gousha\" public affairs TV show, Larson decried the power Abele he has gained at the expense of the County Board, which is essentially moving to part-time status as a result of a 2014 voter referendum.", "With the referendum, which Abele supported, salaries for the 18 County Board supervisors will be cut in half following the April 2016 elections. In addition, the supervisors’ health insurance will end and no additional pension benefits will be accrued.", "Gousha asked Larson whether a full-time County Board is better than a part-time board.", "Larson answered by making a claim we want to check, as well as a reference to rapper-producer Kanye West.", "\"I do understand that there’s a lot of people who don’t like the County Board. I’d also understand that there’s people who don’t like Congress,\" Larson said. \"The difference I have is that I don’t think we should abolish Congress, or abolish the legislative check and balance that we have in American-style democracy.\"", "Then Larson alluded to a recent change in state law that gives more power to the Milwaukee County executive, saying:", "\"If anything, I think we've erred too far in giving all this power to one individual, including land sales. He has unilateral authority over the County Board -- or, the County Board has no oversight over land sales, including the museum, the airport and the zoo. That's just scary to think what he could do with that. And to paraphrase Kanye West: No one man should have all that power.\"", "So -- not that it's likely -- but does the Milwaukee County executive have the power, on his own, to sell the Milwaukee Public Museum, General Mitchell International Airport and the Milwaukee County Zoo. All without approval from the County Board?", "The law", "In July 2015, while making final adjustments to the 2015-’17 state budget, GOP lawmakers inserted a provision to eliminate the Milwaukee County Board’s oversight of sales of county-owned properties that are not zoned for park use.", "County Board members made power-grab allegations against Abele who, despite being a Democrat, has forged alliances with some Republicans.", "The budget provision helped clear the way for Abele to sell 10 acres of land that is envisioned as part of a downtown Milwaukee development coinciding with a new arena for the Milwaukee Bucks basketball team.", "Now to Larson’s claim.", "Under the change in state law, any sale of non-park land owned by Milwaukee County requires the approval of only one other person besides the county executive -- either the elected county comptroller or a real estate expert who lives in the community where the land is located and who does not hold public office.", "That expert is appointed by the Milwaukee County Intergovernmental Cooperation Council, which is made up of elected representatives from the various cities and villages in the county.", "In other words, the County Board doesn’t have a say, although the county executive alone couldn’t sell non-park land, such as the museum, the airport or the zoo.", "The county’s top attorney, Corporation Counsel Paul Bargren, confirmed in a memo to the County Board that county-owned land that isn’t zoned for parks can be sold without the board’s OK.", "\"Specifically, the executive could lease, sell or convey any non-park county property regardless of board policy and without board approval,\" he wrote.", "Either the comptroller or the appointed real estate expert would have to determine that the sale \"is in the best interests of the county.\"", "Bargren noted that counties are considered an arm of the state. And that the state Legislature can delegate or remove powers from county boards in all 72 counties and can, as it did in this case, treat one county differently than the others.", "\"In effect, the Legislature has inserted itself in place of the (Milwaukee) County Board and, as a matter of county policy, has delegated administration of land sales and contracts and procurement to the executive,\" his memo says.", "Our rating", "Larson said the Milwaukee County executive can sell the public \"museum, the airport and the zoo\" -- all on his own, without County Board approval.", "A recent change in state law that applies only to Milwaukee County allows the executive to sell any county-owned land not zoned as park land without approval of the County Board.", "However, such sales would need the OK of at least one other person -- either the elected county comptroller or a real estate expert appointed by elected municipal officials who lives in the community where the land is located.", "We rate Larson’s statement Mostly True.", "More on Milwaukee County", "In Milwaukee County, juveniles arrested for car theft \"get sent immediately home, because under the point system in juvenile court\" on holding suspects, \"a stolen car gets zero points.\" Mostly False.", "In Context: Which black people did Milwaukee County Sheriff David Clarke call uneducated, lazy and morally bankrupt?", "YouTube, \"Upfront with Mike Gousha\" interview with state Sen. Chris Larson (quote at 3:15), posted Nov. 23, 2015", "Email exchange, Chris Larson campaign manager Joshua Kilroy, Nov. 25, 2015", "Milwaukee Journal Sentinel, \"State budget would limit Milwaukee County Board authority,\" July 8, 2015", "Milwaukee Journal Sentinel, \"Budget gives Chris Abele new authority in Park East land sales,\" July 9, 2015", "Milwaukee Journal Sentinel, \"Milwaukee County to revamp how it sells properties,\" Sept. 13, 2015", "Milwaukee County, corporation counsel memo, July 8, 2015", "Joint Finance Committee, budget modifications, July 2015", "Interview, Milwaukee County Executive Chris Abele spokeswoman Melissa Baldauff, Nov. 30, 2015", "Interview, Milwaukee County Corporation Counsel Paul Bargren, Nov. 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]