["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As he moves toward formally entering the 2016 presidential race, Wisconsin Gov. Scott Walker is hammering home the notion that Washington needs a \"fresh face.\"", "It’s a two-edged critique aimed at potential Republican rivals such as former Florida Gov. Jeb Bush, and at Hillary Clinton, the former Democratic senator and first lady who is gearing up for 2016.", "The Clinton-Bush era in the nation’s capital is well known -- from 1980 to 2004, Jeb’s father (George H.W. Bush) or brother (George W. Bush) or Bill Clinton won their party’s nomination for president or vice president. Hillary Clinton, of course, nearly made the top of the Democratic ticket in 2008.", "But there’s a more sweeping claim making the rounds on social media -- and various websites -- as the 2016 race takes early shape.", "This is how Washington Post Wonkblog reporter Matt O’Brien put it:", "Republicans haven’t won a presidential election without a Bush or Nixon on the ticket since 1928.", "Seems kind of unlikely, doesn’t it?", "That was our first reaction as we quickly tried to do think back through the roster of GOP presidential and vice-presidential contestants over that 84-year span.", "It’s right on, though.", "It’s a testament both to the Bush family legacy and to Nixon’s lengthy, comeback-dotted career.", "The period in question covers 21 presidential elections starting in 1932. Democrats prevailed 12 times; Republicans 9.", "The presence of a Bush or Nixon on the ticket turned out to be a boon for Republicans during those eight decades. But it didn’t mean a lock: in two races Republicans fell despite the connection.", "Here we go:", "Nixon was Dwight Eisenhower’s running mate in 1952 and 1956 and served as vice president. In 1960, Nixon narrowly lost the presidential contest to John F. Kennedy, but returned to win two terms before resigning amid the Watergate scandal in 1974.", "George H.W. Bush was Ronald Reagan’s running mate and vice president for two terms, then won the presidency in 1988 before bowing to Bill Clinton in 1992.", "Finally, Bush’s son George W. Bush was atop the GOP ticket in 2000 and 2004 before Barack Obama reclaimed the White House for Democrats in 2008 and 2012.", "You have to reach back to the GOP team of Herbert Hoover and Native American U.S. Sen. Charles Curtis in 1928 to break the streak. They won in a landslide over Democrats Al Smith and Joseph Robinson, with Socialist Party candidate Norman Thomas getting a smattering of support.", "Hoover, of course, was ushered out in 1932 as the Great Depression raged, and the Franklin Delano Roosevelt era began.", "Our rating", "No Republican has been elected president since 1928 without a member of the Bush family or Richard M. Nixon on the GOP ticket?", "You could look it up. But now you don’t have to.", "True.", "Tweet, Matt O’Brien, @ObsoleteDogma, Dec. 16, 2014", "The American Presidency Project, results of presidential elections, accessed Jan. 20, 2015", "Atlas of U.S. Presidential Elections, results, accessed Jan. 20, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]