["By Angelo Fichera", "Posted on November 25, 2019", "A viral story shared on Facebook falsely claims President Donald Trump has fired a “Muslim federal judge” over “Sharia Law.” The story was published two years ago by a website that calls its work satire, but it is being spread again by a Tumblr site.", "A headline shared more than 50,000 times on Facebook — from a Tumblr account whose URL is misleadingly made to look like a Fox News property — falsely tells users that President Donald Trump has removed a “Muslim federal judge for trying to implement Sharia Law.”", "The falsehood, now being spread by foxnw.tumblr.com, has circulated for two years, and was originally published in 2017 by the self-described satirical publication called America’s Last Line of Defense. The Tumblr account links to a post on another website, which refers to a “22nd Circuit Court of Appeals Justice” named “Hansam al Alallawalahi-Smith.” But neither the court nor the judge exist.", "We’ve written about many hoaxes stemming from America’s Last Line of Defense, which employs a network of different websites and publishes content that can mislead social media users. While the websites include satirical labels — for those who click beyond the headline — other websites, as in this case, often republish the stories without any such disclaimers. We’ve previously debunked similar stories from America’s Last Line of Defense that also claimed that Trump had fired made-up Muslim judges.", "What’s more, while presidents nominate federal judges and the Senate confirms nominees, the power to remove a federal judge is held only by Congress. Article III, Section 1 of the Constitution says federal judges “shall hold their offices during good behaviour,” which “has been interpreted to mean that the only way federal judges can be removed from office is if the House of Representatives impeaches them, and the Senate convicts them, of ‘treason, bribery, or other high crimes and misdemeanors,'” as the National Constitution Center explains on its website.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“About Us.” AsAmericanAsApplePie.org. Archived 28 Dec 2019.", "“Biographical Directory of Federal Judges.” Federal Judicial Center. Accessed 25 Nov 2019.", "“FAQs: Federal Judges.” U.S. Courts. Accessed 25 Nov 2019.", "Navarro Smelcer, Susan. “The Role of the Senate in Judicial Impeachment Proceedings: Procedure, Practice, and Data.” Congressional Research Service. 9 Apr 2010.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]