["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In the days following the 2020 U.S. presidential election, some social media users posted baseless claims that a whopping 132,000 ballots cast in Georgia's Fulton County were \"highly likely\" to be tossed out due to an unspecified issue stemming from changes of address. Here is one example of a post containing the claim:", "The tweet above was taken from another tweet posted by Richard Baris, director of Big Data Polling. But Baris told us that his commentary was taken out of context by various websites and social media users, including the Gateway Pundit junk news website.", "Baris told us that he never said 132,000 ballots were likely to be tossed out. He said that while researching voter files in Georgia, he noted there were 132,000 flags indicating that people had moved.", "\"A change of address flag means someone reported they have a forwardable address, yet they are on the voter rolls still,\" Baris told us by phone. \"I’m a big critic of that, we should clean this up.\" However, he added, \"having a change of address flag doesn’t mean someone voted illegally.\"", "Baris stated his tweeted rocketed around social media, but no one bothered asking him what he meant by it before taking it out of context.", "\"Unfortunately what usually gets around is what people think they thought you meant,\" Baris said, adding he would have appreciated, \"An email, or a phone call just to say, 'Hey, what did you mean by this?'\"", "According to Fulton County, a total of 522,050 ballots were cast there in the November 2020 general election; 132,000 ballots being disqualified would be roughly a quarter of the total ballots cast. Such a large number and proportion of ballots tossed out in the county that includes Atlanta would most likely be the source of major news stories and public statements from election officials there. As of this writing, there have been none of those.", "Georgia flipped in 2020, with more votes going to Trump's political rival, Democratic President-elect Joe Biden, in the presidential election there. As of this writing, Biden carried the state by more than 12,000 votes. Trump's team has requested a recount.", "Posts claiming that 132,000 ballots from Fulton County are to be rendered ineligible from the state's total vote count appeared to be based on a statement that was then taken out of context, and used incorrectly. We therefore rate this claim \"False.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]