["This video was shared several tens of thousands of times, and was seen more than 2.5 million times according to analytics from Twitter. It shows three launches of one or several missiles at night.", "“WAR HAS BEGUN! #IranvsUSA First footage of missiles launched by Iran at US bases in Iraq holding American troops!” a Twitter user wrote alongside one of the videos.", "US news channel CNN also aired the segments several times on TV on January 8, and published them on its website (CNN has since deleted the video).", "“CNN aired the footage, but cautioned viewers it could not independently verify the video. As soon as we were able to verify that these videos were not authentic (were not from 2020), we took them off all our channels and platforms,” a CNN spokesperson told AFP on January 8.", "However, these three missiles launches cannot be the ones that Iran conducted on the night of January 7-8, because identical video segments appear in this video posted on Al-Jazeera English’s YouTube channel on October 1, 2018 (at 6 seconds, 28 seconds and 36 seconds in the video).", "According to the caption, they depict Iranian missiles launched towards eastern Syria in retaliation for an attack on September 22, 2018 on the Iranian city of Ahvaz.", "In the first frame, exactly three missiles are visible in both videos, with the same time interval between each of them. The trail of smoke behind the first shot divides in two. These videos are the same.", "In the second shot, beyond various visual clues (the trees, the mountain crest on the right), the camera’s movement allows a comparison of both videos. The person filming this shot first moves the camera to the left, before moving upwards to follow the missile. It is the same video.", "Finally, in the third shot, as in the first, both videos show three missiles shot with the exact same interval between each.", "Here is a comparison between the images of the video published on January 7 and those released in 2018 by Al-Jazeera.", "Iran did launch a missile attack on an Iraqi air base where US forces are based on January 8, in retaliation for the death of the powerful Iranian general Qassem Soleimani, killed by a US strike.", "More than a dozen ballistic missiles were launched towards the Iraqi bases of Ain al-Asad and Erbil, where some of the 5,200 US troops in Iraq are based.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]