["Two clips have been juxtaposed to create what seemingly looks like a ‘before and after’ video. The video on left shows a bearded man rubbing currency notes on his nose and mouth. The man can be heard saying, “A disease like corona has no cure because it is a greeting from Allah for you (कोरोना जैसी बीमारी का कोई इलाज नहीं क्यूँकि यह अल्लाह का अदब है आप के लिए).” The video on the right also shows a bearded man however, he has brutal injury marks on his body and says that he was thrashed by Ranchi police. Thus, a video was manufactured to claim that the man who rubbed currency notes on his face, indirectly threatening to spread the infection, was beaten by the police.", "A Facebook user posted the viral video with the text, “Found and cured, doctor (translated from Mil gaya aur ilaaj ho gaya Dr)”. (archive link)", "Mil gaya aur ilaaj ho gaya Dr.", "Posted by Rajesh Kumar on Thursday, 2 April 2020", "Several other users posted the viral video along with the same text on Facebook.", "In this fact-check, we will trace both the videos one by one.", "Video 1", "In order to locate the first clip, Alt News performed a keyword search on Google and located multiple media reports. On April 3 Times of India reported that Nashik rural police arrested a 40-year-old man from Malegaon for making objectionable coronavirus-related TikTok videos. The report added that the man was arrested on April 2 and was produced before the Malegaon court the next day.", "Nashik Police quote-tweeted the TikTok clip and stated that the man in the video is in police custody.", "Lawful action has been taken against the accuse by Nashik Rural Police (Maharashtra) & he is in Police Custody.@invinciblearti@rahulroushan@SuchitShukla#coronavirus https://t.co/ooFIzIh7ql", "— NASHIK RURAL POLICE (@SPNashikRural) April 2, 2020", "Video 2", "The context to the second clip was also available on Twitter. One Sarfaraz Hussain tweeted the viral clip on March 31 and tagged Jharkhand Cheif Minister Hemant Soren, Jharkhand DGP Mandava Rao and several others hoping that justice is meted out to the wounded man. According to Hussain, the man in the video is Muheb Qureshi. He was arrested and tortured by Hindpiri police.", "माननीय मुख्यमंत्री जी राँची हिंदपीढ़ी मुहीब कुरेशी को हिंदपीढ़ी पुलिस ने गिरफ्त क्या और थाने में 28 घंटे उन पर अत्याचार किया गया जिस में मौजूद चोट अत्याचार का का प्रमाण है जाँच किसी निष्पक्ष 1/2 @HemantSorenJMM @JharkhandCMO @JharkhandPolice @MVRaoIPS pic.twitter.com/vvtQQ5eEHn", "— Sarfaraz Hussain (@Sarfara12958261) March 31, 2020", "Rao responded to Hussain’s tweet, “@ranchipolice started an enquiry into the incident. Initiated action against the officer responsible.” Ranchi police confirmed investigation in a reply to Rao.", "A March 31 report by Dainik Jagran states that Hindpiri station in-charge Sunil Kumar Tiwari was removed from his post after the incident came to light. SSP Anish Gupta ordered further investigation of the matter. The report further adds that the victim’s name is Mohammed Mujeeb, unlike Hussain’s tweet which identified him as Muheb Qureshi. Mujeeb was picked up by Hindpiri police on March 28 and kept in custody for more than 24 hours. He was brutally thrashed during this time with reports alleging that he was also forcefully made to drink urine. A Dainik Bhaskar report states that the police had picked up Mujeeb for flouting the lockdown imposed to tackle coronavirus pandemic.", "Thus, a video was manufactured to claim that the man who rubbed currency notes on his face, unbothered about coronavirus infection, was beaten by the police. The clip which shows a wounded man is unrelated to this incident. Moreover, the first incident happened in Maharashtra while the other one took place in Jharkhand.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]