["In the view of the protests against the Citizenship Amendment Act, a set of images are being circulated with the claim that they represent detention centres in Assam for illegal immigrants. “इस तरह के हालात मे रहना आप को मंजूर हे तो फिर आप का चुप रहना लाज़्मी हे..असम के डीटेंशन सेंटर की एक तस्वीर (If you are ready to live in these conditions then your silence is justified. Image of detention centre in Assam.)” This is the message shared with the photographs.", "इस तरह के हालात मे रहना आप को मंजूर हे तो फिर आप का चुप रहना लाज़्मी हे.. असम के डीटेंशन सेंटर की एक तस्वीर..!#Jamia #CABProtests #StandWithJamia #CAB_नहीं_चलेगा pic.twitter.com/eyiJf9nh9N", "— Salman Shaikh سلمان شیخِ (@SalmanS22496764) December 15, 2019", "The claim has also been circulated on Facebook.", "इस तरह के हालात मे रहना आप को मंजूर हे तो फिर आप का चुप रहना लाज़्मी हे।🤐🤐 असम के डीटेंशन सेंटर की एक तस्वीर,,,", "Posted by Aslam Khan Guj on Sunday, 15 December 2019", "In fact several users have shared it on the website.", "A simple reverse-search of the image reveals that it shows a border patrol facility in the United States. According to Getty Images, “MCALLEN, TX – JUNE 10: In this handout photo provided by the Office of Inspector General, overcrowding of families is observed by OIG at U.S. Border Patrol McAllen Station on June 10, 2019 in McAllen, Texas.”", "The second image is also of a detention centre in the US. Getty Images describes it as, “WESLACO, TX – JUNE 11: In this handout photo provided by the Office of Inspector General, overcrowding of families is observed by OIG at U.S. Border Patrol Weslaco Station on June 11, 2019, in Weslaco, Texas.”", "The last image has been fact-checked by Alt News in an earlier report. It shows the conditions of the La Romana prison in the Dominican Republic.", "Thus images of foreign border patrol facilities and prisons are being circulated as detention centres in Assam.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]