["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Testifying before the Senate Appropriations Committee on Sept. 16, Robert Redfield, director of the Centers for Disease Control and Prevention, said that face masks are the \"best defense\" against COVID-19.", "\"This face mask is more guaranteed to protect me against COVID than when I take a COVID vaccine, because the immunogenicity may be 70%, and if I don’t get an immune response, the vaccine’s not going to protect me,\" he said, holding a mask. \"This face mask will.\"", "But an Instagram post published on the social media platform the same day shared an old video of the CDC director with this message: \"CDC Director Robert Redfield says healthy people should NOT wear masks.\"", "In the video, U.S. Rep. Chrissy Houlahan, D-Pa., asks during a hearing of a House Foreign Affairs subcommittee, \"Should you wear a mask if you’re healthy?\"", "Redfield pushes the microphone toward his face and says, \"No.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The clip of the video in the Instagram post is authentic, but it says \"Today\" in the corner. In reality, this exchange happened in February 2020. You can hear it about 56 minutes and 30 seconds into the hearing on the country’s coronavirus response.", "This was before President Donald Trump declared COVID-19 a national emergency, and before the CDC changed its recommendations to encourage nearly everyone to wear a face covering when out in public and when social distancing is difficult.", "Early in the coronavirus outbreak, the CDC did discourage people from wearing face masks unless they had COVID-19 and were showing symptoms. But that changed on April 3, when the CDC said it was revising its guidance based on continuing studies that found the virus could be transmitted by people who were asymptomatic.", "The CDC’s website now says that everyone 2 years of age and older should wear a mask in public and when around people who don’t live in your household, especially when it’s hard to physically distance.", "On July 14, the CDC released a news release calling on \"Americans to wear masks to prevent COVID-19 spread.\"", "\"All Americans have a responsibility to protect themselves, their families, and their communities,\" the release said.", "Redfield was the co-author of an editorial that was published in the Journal of the American Medical Association. It was titled, \"Universal masking to prevent SARS-CoV-2 transmission—the time is now,\" and made the case that \"broad adoption of cloth face coverings is a civic duty, a small sacrifice reliant on highly effective low-tech solutions that can help turn the tide favorably in national and global efforts against COVID-19.\"", "Our ruling", "While Redfield did say in February that healthy people should not wear masks, the CDC reversed course months ago and since early April has recommended that healthy people wear face coverings.", "This Instagram post wrongly frames his comments from February as if he currently believes that healthy people shouldn’t wear masks.", "This was published online the same day that Redfield said masks are the most effective tool Americans have in the fight against COVID-19 — muddying the waters for people seeking clear, current information.", "Redfield says that healthy people should wear face coverings.", "We rate this Instagram post False.", "Instagram post, Sept. 17, 2020", "The New York Times, Watch full video: Robert Redfield testifies before the Senate, Sept. 16, 2020", "The Guardian, ‘Face masks are our best defence,’ says CDC director Redfield - video, Sept. 16, 2020", "C-SPAN, House hearing on coronavirus response, Feb. 27, 2020", "PolitiFact, To fight COVID-19, CDC now says wear masks in public, May 1, 2020", "Wired, How masks went from don’t-wear to must-have, July 2, 2020", "Centers for Disease Control and Prevention, Considerations for wearing masks, Aug. 7, 2020", "Centers for Disease Control and Prevention. CDC calls on Americans to wear masks to prevent COVID-19 spread, July 14, 2020", "JAMA, Universal masking to prevent SARS-CoV-2 transmission—the time is now, July 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]