["About this rating", "On Aug. 20, 2019, U.S. Department of Energy Secretary Rick Perry posted a notice on Instagram informing that company that “it is strictly forbidden to disclose, copy, distribute, or take any other action against me based on this profile and/or its contents.\" Though he later deleted it, the shared text falsely claimed that posting such a notice would legally prevent the company from using the material he posted to the platform:", "Perry was not alone in sharing this purported legal advice. Several celebrities including Judd Apatow, Debra Messing, Taraji P. Henson, Julia Roberts, Julianne Moore, and Usher also shared the same picture.", "Nothing contained in this viral text is true. A spokesperson for Facebook, which owns Instagram, told BuzzFeed News that \"there’s no truth to this post.\" In fact, the text contained within it is merely a re-purposed version of one of the most pervasive viral hoaxes of the social media era, as we recently noted in a post on Snopes’ Instagram account:", "Since at least 2012, people have littered Facebook with some variation of a legal notice intended to prevent the social media company from making users' posts public. The current iteration merely replaces the word \"Facebook\" with \"Instagram.\" Snopes’ debunking of the Facebook claim remains one of the most heavily trafficked fact checks in our database to this day.", "After being informed of the error, Perry deleted the post. Poking fun at himself, he later posted this “notice” to Instagram:", "The Department of Energy is responsible, in part, for safeguarding America’s nuclear energy secrets.", "Mack, David.   “Rick Perry, The Man In Charge Of American Nuclear Weapons, Fell For An Instagram Hoax.” \r\n   BuzzFeed News.   21 August 2019.", "Mann, Keith.   “Channel 13 News Instagram Update: Celebrities Share Hoax.”\r\n    Heavy.   21 August 2019.", "Department of Energy.   “Rita Baranwal Sworn in as U.S. Department of Energy Assistant Secretary for Nuclear Energy.”\r\n    11 July 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]