["Post gets the numbers right, but is missing some context.", "A viral Facebook post singles out Milwaukee as one of a handful of cities where large numbers of black voters didn’t vote.", "The image, shared from numerous different sources, is usually accompanied by some kind of call for black voters to get to the polls.", "It lists several states with narrow margins in the 2016 election and black turnout in their large cities. For Wisconsin it says, \"(President Donald) Trump won Wisconsin by 23,000 votes … in Milwaukee, 93,000 blacks didn’t vote.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Here’s what we found.", "The graphic is a screenshot from a Feb. 26, 2020, opinion piece in the New York Times by Karthik Balasubramanian, an information systems professor who worked for the Barack Obama campaigns in 2008 and 2012.", "The numbers are consistent with the story, but they are presented without context.", "The various versions of the graphic we saw didn’t include the header explaining this was based on the 2016 election — though that’s implied by the Trump reference — or the statistical note that the data is based on metropolitan statistical areas (cities plus surrounding areas), not just cities as the labels on the graphic imply. Most were also missing the bottom state or two, presumably because they don’t fit on a typical phone screen.", "The victory margin figures are accurate.", "The black turnout numbers are a little squishier. There isn’t firm data on turnout by race since voter registration doesn’t capture that data, so the figures on the right side of the graphic are an estimate based on a U.S. Census Bureau survey that breaks down race and voter participation by state and the demographic makeup of each city.", "Nationwide, the Census found black voter turnout was 59.6% in 2016, down sharply from 66.6% in 2012 — and the lowest black turnout rate since 2000.", "The 2016 rate was lower than white voters (65.3% of whom turned out) but higher than other minority groups. In 2012, black voters had a higher turnout than white voters for the first time, according to the Census.", "Of course, many people of other races did not vote as well, but the thrust of the message was to boost African American turnout in the 2020 election.", "A Facebook post says Trump won Wisconsin by 23,000 votes, while in Milwaukee alone 93,000 blacks didn’t vote.", "It makes a similar comparison for a series of other states decided by close margins in 2016, including Florida, Michigan and Pennsylvania.", "Those numbers are in line with what the story reported. But the screenshotted graphic leaves off the statistical detail that the numbers include the surrounding area for each city, and doesn’t specify that these numbers reflect only 2016.", "We rate this claim Mostly True.", "Facebook post, March 5, 2020", "New York Times, Democrats Are Ignoring the Voters Who Could Decide This Election, Feb. 26, 2020", "New York Times, Presidential Election Results: Donald J. Trump Wins, Aug. 9, 2017", "U.S. Census Bureau, Voting in America: A Look at the 2016 Presidential Election, May 10, 2017", "Brookings Institution, Census shows pervasive decline in 2016 minority voter turnout, May 18, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]