["About this rating", "In early July 2018, a photograph purportedly showing two young girls wearing t-shirts reading \"Fuck Trump\" at a protest in Denver, Colorado, was being shared on social media along with disparaging comments about the children's parents:", "This photograph was often posted with captions pegging it as depicting the results of \"liberal parenting.\"", "Although this picture has been shared by a wide variety of people and groups, we've yet to find a link back to the original image. We searched the \"Denver families belong together rally at civic center park\" event page and could not find another post by the person whose name was displayed on this one. (We've removed the name and covered faces to help prevent online vigilantes from seeking more information about the pictured children and their families.) Similarly, we could not find a Facebook profile for the person who supposedly posted this photograph, although it's possible that this picture and its underlying account were deleted shortly after the image became a focus of outrage.", "We did find one other photograph taken by \"Julie N.\" of these children at the rally in Denver. Although their shirts are obscured in that picture, it's clear that they were not wearing the pictured \"Fuck Trump\" t-shirts at that point. The child with darker hair looks to be wearing a tank top rather than a t-shirt, and a portion of a logo that seemingly doesn't match the \"Fuck Trump\" shirt can also be seen on the child with lighter hair:", "But even if these children weren't wearing \"Fuck Trump\" shirts during the entirety of the really, that doesn't mean that couldn't have (at least momentarily) donned anti-Trump attire at some point. And we did find several images of other protesters at the event wearing the same \"Fuck Trump\" shirts. In fact, one image posted to a Google Photos page showed a pile of these shirts at the rally site. It's not clear whether these shirts were being sold or were simply handed out to participants, but it seems plausible that children could have obtained some of these shirts at some time during the event:", "Of course, vulgar protest shirts aren't exactly a new phenomenon, and the Denver rally was far from the first instance of children being brought along to take part in political events.", "Smith, Stephen.   \"Student Wins Anti-Bush Shirt Clash.\"\r\n    CBS News.   13 December 2005", "Yahoo News.   \"Children at Trump Rallies.\"\r\n    15 September 2016.", "Landsbaum, Claire.   \"The Most Misogynistic Gear Spotted at Trump Rallies.\"\r\n    The Cut.   12 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]