["About this rating", "The issue of crowd size was once again a contentious topic online as U.S. President Donald Trump made a state visit to the U.K. in June 2019. While news outlets reported that thousands of anti-Trump protesters far outnumbered the president's supporters, Trump called reports of large protests \"fake news\":", "I have spent all day on the streets of London. We struggled through throngs of anti-Trump protestors, many tens of thousands of them. I also saw tiny handfuls of Trump fans. This is not fake news. We have the pictures. https://t.co/Cs2gQjrT7S", "— James Cook (@BBCJamesCook) June 4, 2019", "To further complicate the issue, a number of misleading images and videos were circulated on social media about pro- and anti-Trump crowds. For example, an image showing a championship parade for the Liverpool Football Club was circulated as if it captured a crowd of Trump supporters.", "A video supposedly showing hundreds of people chanting \"We Love Trump\" was also widely circulated on social media, often shared with the claim that the news media were refusing to report on this large crowd of Trump supporters. Facebook user James Johnson, the founder of NCFire, an anti-immigration group that has previously spread dubious information, captioned his version of the video: \"Massive crowd in the UK chants “We Love Trump” (that's funny, every report i see on TV has the SAME anti-Trump video and NOTHING about this pro-Trump video).\"", "Johnson's video racked up more than 1 million views within a day of its initial posting. Another posting of that same video on Twitter racked up an additional 500,000 views:", "The news media didn't report on this crowd scene in June 2019 because the video was not taken in June 2019. The original was produced nearly a year earlier, in July 2018, and shows a mixture of Trump fans and supporters of Tommy Robinson, a right-wing activist who founded an anti-Muslim group:", "Trump's visit to the United Kingdom in July 2018 coincided with a \"Free Tommy Robinson\" rally. Many of the attendees carried \"Britain Loves Trump\" signs, wore MAGA hats, and at one point chanted \"We Love Trump.\"", "Here's how Fox News and the Associated Press described the event:", "Associated Press: A small rally supporting US President Donald Trump in London has been joined by thousands of supporters of prominent right-wing activist Tommy Robinson.", "Robinson, whose real name is Stephen Yaxley-Lennon, founded an anti-Muslim group and was jailed for contempt of court after broadcasting outside a criminal trial in May.", "Fox News: Thousands of Trump supporters and right-wing activists took to the nation’s capital on Saturday — a day after anti-Trump protesters had dominated the city.", "While the displays of right-wing support were nowhere near as large as the enormous anti-Trump march that demanded the international media’s attention the day before, it was still a significant show of support for Trump from those eager to counter the claim that Trump had been unanimously rejected by Britons.", "The day started with a small pro-Trump rally outside the U.S. Embassy, featuring numerous red “MAGA” hats and U.S. and U.K. flags -- as well as a few anti-Hillary Clinton shirts.", "Later, approximately 3,000 people turned out near Trafalgar Square to show their backing of Trump as well as jailed right-wing and anti-Islam activist Tommy Robinson.", "Additional footage of that 2018 protest can be viewed below:", "Shaw, Adam.   \"Trump Supporters Turn Out in London a Day After Protests.\"\r\n    Fox News.   18 July June 2018.", "Batchelor, Tom.   \"Trump Factcheck: Is the US President Correct in Saying ‘Big’ Crowds Gathered to Support Him During UK State Visit?\"\r\n    The Independent.   5 June 2019.", "BBC News.   \"Trump's UK Visit: Nine Key Moments.\"\r\n    14 July 2018.", "Ross, Jamie.   \"Thousands of Brits Protest Trump’s Visit Alongside 16-Foot Farting Presidential Robot.\"\r\n    Daily Beast.   4 June 2019.", "Diebelius, Georgia.   \"12 Arrested Following Violent Clashes at Pro Trump and Tommy Robinson Protests.\"\r\n    Metro.   14 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]