["In the last week of November, several Twitter users claimed, “Did you know that till date India used to import cloth for defence uniforms from countries like China?” Twitter user @DoctorAjayita posted this claim and backed it up with a report by Ahmedabad Mirror (archived link). Her tweet gained over 500 retweets (archived link).", "Did you know that till date India used to import cloth for defence uniforms from countries like China? Now for the first time, Surat textile industry will manufacture the cloth. First order for 10 Lakh meters is already placed, to be delivered by Jan 2021. #AatmanirbharBharat 🇮🇳 pic.twitter.com/XMiuxP6lBD", "— Dr. Ajayita (@DoctorAjayita) November 25, 2020", "Around November 23, Ahmedabad Mirror (archived link) reported that the fabric for uniforms of the Indian Army, Navy and Air Force which used to be imported will now be manufactured in Surat. “In another first… Surat’s textile industry receives orders to manufacture 10 lakh metre of fabric for uniforms of Army, Navy and Air Force; delivery to be done by Jan 2021. Till now the fabrics were imported from China, Korea and Taiwan,” according to the article.", "The report further added that the Defence Research and Development Organisation (DRDO) held a meeting where a request was put forth regarding manufacturing fabrics as per the requirement of the armed forces. The DRDO is the research wing of the Ministry of Defence.", "Ahmedabad Mirror‘s report includes a video by ANI titled ‘Surat textile company receives orders to manufacture fabric for uniforms of defence personal’. As per the video, Lakshmipati Group has received order to make fabric for ‘uniforms of defence personnel’.", "This slideshow requires JavaScript.", "Ahmedabad Mirror has not specified the type of military uniforms, giving the impression that the fabric will be used to manufacture daily uniforms for the armed forces. But in fact, this fabric is used to make multiple military applications including making specific clothing, but not daily wear uniforms. National security and strategic affairs analyst Mandeep Singh Bajwa replied to @DoctorAjayita tweeting, “Fake news. Uniforms were always stitched from Indian-manufactured fabric.”", "Fake news. Uniforms were always stitched from Indian-manufactured fabric. https://t.co/mB0djdQcpN", "— Mandeep Singh Bajwa (@MandeepBajwa) November 25, 2020", "In the armed forces, apart from daily wear uniforms, there are various types of uniforms based on ceremonies such as parades, receiving dignitaries, funeral and social events. When in the field, gear such as bulletproof vests, arms and ammunition and parachutes can be regarded as a part of the uniform. Readers should note that in 2019, several media outlets — The Economic Times, The Indian Express and The Eurasian Times — reported that protective gear/ bulletproof jackets for the Indian Army were imported from China.", "Col Rajendra Bhaduri (Retd.) told Alt News, “The section which claims that “fabrics were imported from China, Korea and Taiwan” can be interpreted as daily wear uniforms of Army, Navy and Air Force officers. As per the article, DRDO approved [fabric] sample order by Surat-based textile manufacturers. Therefore, the said fabric can’t be the same as the fabric which is used by military personnel as their daily wear. The said fabric is likely a technical one used in specialised applications like bulletproof vests, rucksacks, parachutes, special forces clothing etc.”", "Alt News spoke with serving military officials, veterans and fabric experts to understand the process.", "“The officers in all the three armed forces have to get their own daily wear uniforms stitched with the help of a ‘uniform allowance’ alloted to them, while the uniforms to Personnel Below Officers Ranks (PBOR) are provided by the concerned government authority. Historically PBOR uniforms are manufactured by the Ordinance Clothing Factories, a unit of government body Ordinance Factory Board (OFB) at Shahjahanpur and Avadi. As of today, all armed forces personnel are given a uniform allowance. I’m a third-generation military officer in my family and I have never heard any officer purchasing imported fabric to make their official uniform,” said Bhaduri.", "Gagan Chaturvedi, deputy director-general, corporate communications at Ordinance Factory Board further told us, “Since 2018, Junior commissioned officer and PBORs cadre of the armed forces is entitled to a dress allowance. A list of dress allowance items has also been declared. The production of these dress allowance items has been discontinued in the OEF group. As a result, we manufacture combat uniforms and other products which can be viewed in our catalogue. Yet, the OFB remains the largest suppliers of uniform in the organised sector. As per latest available data, in 2017-18 the OFB manufactured uniforms, troop comfort items and combat gear comprising Coat Combat Army Logo, Combat Uniforms, Overall Combination Army Logo and Infantry Combat Kits. The fabric used for manufacturing all items for military products is entirely from India.”", "In 2018, Gautam Singhania, chairman and managing director at Raymond had tweeted, “General Rawat Chief of Indian Army today launched @TheRaymondLtd uniform for Army and Indian airforce which will be made available through CSD. #IndianArmy #AirForce #Raymond #Proud”", "General Rawat Chief of Indian Army today launched @TheRaymondLtd uniform for Army and Indian airforce which will be made available through CSD. #IndianArmy #AirForce #Raymond #Proud pic.twitter.com/1om69vRt6M", "— Gautam Singhania (@SinghaniaGautam) April 2, 2018", "We spoke to a Chandigarh-based tailor who has been making uniforms for Indian Army officers since 1970s. He said, “In my professional experience, the most used fabric brands have been Alok and Nahar to make Army uniforms. Fabrics of brands like Raymonds and S. Kumars are also used by officers these days. However, some officers also bring cloth of other brands which suit them better. As long as the fabric matches the designated colour, their uniforms can be made.”", "Delhi-based tailor who has been making uniforms for Indian Air Force officers for over 15 years said, “These days most officers buy the fabric from the defence canteen. In my experience, all fabrics used by the officers are manufactured by Indian companies. The fabric by Raymonds is the preferred choice.”", "Inputs from fabric manufacturer, Lakshmipati Group", "Sanjay Saravgi, MD at Lakshmipati Group, told ANI that the fabric the company is manufacturing was imported in India due to lack of demand. He further said that the fabric will be used by defence forces for various purposes like shoes, rug-sacks, trousers and tents. It is pertinent to note that Saravgi did not talk about uniforms but specific items.", "“This fabric is used for specialised purposes. It has a tenacity of 7.25 grams per denier (gpd). The fabric we make is plain white in colour and made using a high tenacity yarn. This type of yarn was mostly imported because there was no demand for it in India. Once the fabric is made, we give it to garmenters who make the final products. This fabric can be used to make equipment like tents, rug-sacks and highly specific military gears. It can also be used to make trousers which need higher endurance. This cloth isn’t used by common folks going to the office.,” Saravgi informed Alt News. Ahmedabad Mirror included inputs from Saravgi, however, failed to clarify that the fabric is unlikely to be used to make daily uniform.", "We asked Saravgi about Ahmedabad Mirror’s input that the fabric is so strong it cannot be torn by hand and attempting to tear it may even cut fingers. He clarified, “I was talking about the yarn, not fabric.”", "Therefore, the fabric mentioned by Ahmedabad Mirror and ANI is a specialised fabric which is used to make various military equipment. Due to the lack of technical details, the reports created an impression that daily wear uniforms for the Indian Army, Navy and Air Force were made using imported fabric until now. The headlines of the reports also gave the same impression. However, the truth is that the officers of the armed forces purchase their own fabric from Indian brands like Raymond and get their uniforms stitched.", "Ahmedabad Mirror’s article was shared by Union Cabinet Minister for Textiles and Women & Child Development Smriti Z Irani, BJP MP Darshana Jardosh, BJP MP Shobha Karandlaje, BJP MLA Purnesh Modi, co-founder of PuneTech and ReliScore Amit Paranjape and Group President at Reliance Industries Limited Dhanraj Nathwani.", "This slideshow requires JavaScript.", "Many of the above outlets had republished an ANI story. Similar reports were published by Zee News (archived link), Livemint (archived link), WebIndia123 (archived link), Defence News (archived link), Big News Network (archived link) and Russia News (archived link).", "This slideshow requires JavaScript.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]