["Ron Johnson. File photo", "A spokesman for U.S. Sen. Ron Johnson said this statement was in reference to deaths across the United States, which have been steady.", "But to suggest the United States has “flattened the curve” of new cases is not accurate.", "Plus, Johnson said this as he discussed Wisconsin, which is seeing record numbers of COVID-19 cases and deaths.", "U.S. Sen. Ron Johnson has raised eyebrows more than once during the coronavirus pandemic.", "Earlier this year, he noted most people survive COVID-19 and argued governments shouldn’t shut down economies to contain the virus. The senator himself tested positive in early October and said he would wear a moon suit if needed to vote in person to confirm Amy Coney Barrett’s nomination to the U.S. Supreme Court.", "On Oct. 21, 2020, Johnson, a Republican, made another comment that turned heads in Wisconsin, where cases of COVID-19 continue to skyrocket and overwhelm hospitals.", "\"Unfortunately, we’ve had more deaths, but generally the deaths are still pretty flat because we’ve flattened the curve,\" he said on a call with Wisconsin Manufacturers & Commerce. \"We’ve gotten better at treating it.\"", "Is he right that deaths are \"pretty flat because we’ve flattened the curve\"?", "Let’s dig in.", "Johnson’s claim came as part of his legislative update for the WMC, the state’s largest business lobby. Here’s his full statement about COVID-19 deaths, which he made after WMC president and CEO Kurt Bauer asked the senator how he was feeling:", "\"I think it’s important to note, and I heard a little bit of your earlier presenter, as we’re struggling with, there’s no doubt about it, a surge in cases — we had another record day yesterday in COVID — unfortunately, we’ve had more deaths, but generally the deaths are still pretty flat because we’ve flattened the curve, we’ve gotten better at treating it, we know about the anti-inflammatories and steroids and convalescent plasma, which will hopefully be available here shortly.\"", "According to the state Department of Health Services, COVID-19 cases and deaths in Wisconsin are at their highest ever. The state’s worst day came Oct. 21 — the same day Johnson made this claim — when officials reported 48 deaths, surpassing a previous record of 34 reported on Oct. 13. As of Oct. 22, 2020, the seven-day average for deaths sat at 21.", "In the spring, by contrast, the number of deaths reported in one day peaked at 22, and the seven-day average never surpassed 13.", "\"Of course the curve has not flattened and we don't have the virus under control,\" Patrick Remington, a former Centers for Disease Control and Prevention epidemiologist and director of the preventive medicine residency program at the University of Wisconsin-Madison, told the Milwaukee Journal Sentinel.", "When asked for evidence to support the senator’s claim, spokesman Ben Voelkel said Johnson was \"talking about flattening the curve of deaths nationally — ‘generally,’ as he puts it.\" Voelkel said that statement is supported by statistics from the U.S. Centers for Disease Control and Prevention and the New York Times.", "But Johnson began by mentioning the recent spikes in Wisconsin and was speaking to a group of Wisconsin business leaders, leaving listeners with the impression that he meant death numbers here. He made no attempt to distinguish statewide trends from national.", "Johnson also revisited the point during a telephone town hall the next day, saying \"we can see the light at the tunnel nationally on this.\"", "\"We have a dramatic increase in cases in Wisconsin,\" he said. \"And again, the good news is, if you do look at the number of deaths, those have kicked up as well, but it’s still relatively flat. It hasn’t followed the same uptick in terms of number of cases.\"", "Let’s take a look at the national data cited by Johnson’s staff.", "According to the New York Times, daily reported coronavirus deaths peaked in mid-April, with some days exceeding 2,700 nationwide. More recently, that number ranged from 267 deaths on Sept. 27 to 1,208 on Oct. 21. However, the more telling seven-day average largely stayed in the 700s over the past month.", "The Centers for Disease Control and Prevention, which tracks deaths weekly, pointed to similar trends: a peak in mid-April followed by a slight increase around August and a decline since early September.", "So, from that perspective, Johnson’s claim is more on point. Deaths have decreased overall since the pandemic’s onset, and seven-day averages reported by the New York Times remained steady in recent weeks even as daily numbers fluctuated.", "There is a problem here, though. Johnson attributes the \"pretty flat\" deaths in part to a flattening of the curve, which typically refers to the number of cases. And the United States clearly has not flattened the curve.", "As Johns Hopkins University has noted, flattening the curve \"involves reducing the number of new COVID-19 cases from one day to the next\" to help prevent hospitals from becoming overwhelmed.", "Data from the university show the United States is doing the opposite — the seven-day average has risen steadily since September.", "On a call with Wisconsin Manufacturers & Commerce, Johnson said, \"Generally the deaths are still pretty flat because we've flattened the curve.\"", "Cases are up nationwide and in Wisconsin, so the curve of new cases has not been flattened. And deaths in Wisconsin are at an all-time high, even if nationally they have been more stable.", "A Johnson spokesman argued the senator was referring to national trends when he spoke. However, he made the claim in the context of discussing the situation in Wisconsin, and even if one were to use a national perspective, he’s only partially correct.", "A statement is Mostly False when it contains an element of truth but ignores critical facts that would give a different impression.", "That fits here.", "Milwaukee Journal Sentinel, Sen. Ron Johnson is telling people to keep coronavirus in perspective, March 18, 2020.", "Milwaukee Journal Sentinel, 'I'll go in a moon suit': Sen. Ron Johnson says his COVID-19 diagnosis won't stop him from voting on Supreme Court, Oct. 5, 2020.", "Milwaukee Journal Sentinel, As Wisconsin coronavirus surge continues, U.S. Sen. Ron Johnson claims 'we've flattened the curve,' says virus isn't a death sentence, Oct. 21, 2020.", "Email from Ben Voelkel, communications director for U.S. Sen. Ron Johnson, Oct. 22, 2020.", "New York Times, Covid in the U.S.: Latest Map and Case Count, Oct. 23, 2020.", "Centers for Disease Control and Prevention, Daily Updates of Totals by Week and State, accessed Oct. 23, 2020.", "Johns Hopkins University, New cases of COVID-19 in world countries, accessed Oct. 23, 2020.", "Wisconsin Department of Health Services, COVID-19: Wisconsin Deaths, accessed Oct. 23, 2020.", "Milwaukee Journal Sentinel, Wisconsin reports record-high 48 coronavirus deaths as Sen. Johnson falsely claims state has flattened the curve, Oct. 21, 2020.", "Facebook, Senator Ron Johnson, Oct. 22, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]