["About this rating", "On 24 February 2016, the web site Now8News published an article reporting that a Florida woman gave birth to twins in a coffin after she was buried alive by her husband:", "A set of newborn twin girls are recovering in a Florida hospital after a very gruesome, bizarre situation. Anna Duncan, 37, gave birth to twin girls after being buried alive by her estranged husband who she says “did not want to pay such a large amount of child support.”", "... Reports state that as the family was saying their last goodbyes, they began hearing cries that sounded like an infant. “After the casket was lowered into the grave and covered with dirt, everyone who attended the funeral paid their last respects and tossed flowers onto the grave site,” said Clyde Harris. “But then we started hearing these cries, like babies crying. But there was no one around with an infant. They were accompanied by the screams of a woman.”", "... Harris said they immediately called 911 to report the suspicion once they realized the sound was coming from underground. They immediately demanded for the groundskeepers to dig up the soft dirt that covered the casket. They retrieved the coffin, which was pried open by firefighters and discovered Anna Livingston and two newborn twin girls inside.", "According to the official report, authorities stated that the discovery was a twisted plot to cover up an attempted murder crime. The original body of the deceased was switched last minute before the funeral with the body of the funeral director’s wife ... Anna Livingston and her newborn twin girls are in stable condition recovering at a local hospital. Michael Livingston is being held on a $1 million bond and is facing attempted murder charges. The Jacksonville family has properly buried their son, Jerry Harris, in another nearby cemetery.", "The report was reproduced across dozens of unreliable \"viral news sites\" after it was published:", "The story was republished by a number of Facebook pages in May 2016. Neither Now8News nor any subsequent reproductions of the story featured a disclaimer that warned readers that the casket birth tale (like all other stories from those sites) was completely fabricated.", "Previous Now8News hoaxes included reports that a man sexually assaulted a pig in a Walmart bathroom, aborted fetuses were ingredients of McDonald's Chicken McNuggets, Walmart bananas were contaminated with a deadly parasitic worm, a woman was found engaged in a sex act with a sausage in a Walmart, a separate woman was arrested for sampling tampons in an aisle at a Walmart, and a man fed his unfaithful fiancee's remains to her unsuspecting parents.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]