["Asked at a CNN town hall whether she supports Medicare for All, 2020 Democratic presidential candidate Tulsi Gabbard said she does. Explaining why, the U.S. House member from Hawaii made this claim:", "\"We pay far more for health care than any other country in the world, yet we have far worse outcomes than any other country in the world.\"", "The spending part of Gabbard’s claim doesn’t seem to be in dispute.", "In 2017, according to a December 2018 article by two health care experts from the nonpartisan Kaiser Family Foundation, health care spending in the United States was $10,227 per person. That’s about twice as much, on average, as 11 other large, wealthy countries, including Canada, the United Kingdom and Japan.", "Measured another way, in 2016 the United States spent nearly twice as much on medical care as the average of the other 10 highest-income countries. More specifically, the United States spent 17.8 percent of its gross domestic product on health care, versus an average of 11.5 percent for the other countries. That’s according to a study by Harvard researchers published in 2018 in the Journal of the American Medical Association.", "As for why, the main reason is high health care prices  — including for drugs, doctor and nurse salaries, hospital administration costs and many medical services; it is not that Americans use more health care, according to a January 2019 study in the journal Health Affairs. The study was led by a Johns Hopkins Bloomberg School of Public Health researcher. Kaiser has reached a similar conclusion about prices being more important than \"utilization.\"", "We also found evidence that the United States ranks poorly in health care outcomes.", "A 2017 report by the nonprofit Commonwealth Fund, which does health care research, ranked the United States last among 11 high-income countries in health care outcomes — that is, outcomes attributable to the performance of health care delivery systems. (Australia ranked first, Sweden second.)", "Among the nine measures of outcomes, the U.S. rated poorly in infant mortality, life expectancy at age 60 and deaths under age 75 from specific causes \"that are considered preventable in the presence of timely and effective health care.\"", "The 2018 Harvard study we mentioned, which is what Gabbard’s House office cited to back up her statement, found that among the 11 highest-income countries, the United States fared poorly on some measures, including having the lowest life expectancy (78.8 years), the worst maternal mortality rate (26.4 deaths per 100,000 live births) and the highest percentage of adults who were overweight or obese (70.1 percent).", "The Kaiser Family Foundation and Peterson Center on Healthcare also reported that the United States has a higher mortality rate (deaths per 100,000 people) and a higher \"disease burden\" (which refers to length and quality of life) than its peer countries.", "Experts did say there are some points to understand when it comes to the outcomes.", "Kaiser’s Cynthia Cox told us that the U.S. does have better health outcomes than some countries that are poorer and not typically compared to the U.S. She also said other factors play a significant role in both spending and outcomes. Kaiser research has found, she said, that the U.S. has more barriers to overcome in terms of \"social determinants of health that play a significant role in both spending and outcomes.\" The high obesity rate in the U.S., for example, is \"not completely within the control of health providers and can make treating patients more expensive and higher risk,\" she said.", "Health economist Irene Papanicolas, lead author of the Harvard study, made similar points. Many outcomes are partly the product of factors outside the health care system, such as behaviors and genetics, she told us.", "Moreover, the United States scores high on many health service outcomes, such as relatively low hospital mortality rates for things like heart attack and stroke.", "Timothy Norbeck, chief executive officer of the Physicians Foundation, which describes itself as a nonprofit that empowers physicians, told us that while the United States does spend more than other countries, he has argued that there are a number of reasons for that.", "Writing in Forbes, he said \"it is far easier to manage health outcomes in smaller and more homogeneous countries,\" and that the United States having a higher poverty rate than the other developed countries also drives up health care costs.", "Gabbard says: \"We pay far more for health care than any other country in the world, yet we have far worse outcomes than any other country in the world.\"", "The United States spends more on health care — per capita or as a percentage of gross national product — than similarly large and wealthy countries.", "And compared to other developed nations, the performance of the U.S. health care system ranked last in one study. In another study it ranked poorly on a number of health care outcomes. Experts said factors other than health care systems, such as poverty and personal behavior, can affect health outcomes.", "We rate Gabbard’s statement Mostly True.", "YouTube, CNN Tulsi Gabbard town hall (12:40), March 10, 2019", "Email, U.S. Rep. Tulsi Gabbard press secretary Lauren McIlvaine, March 13, 2019", "Peterson-Kaiser Health System Tracker, \"How does health spending in the U.S. compare to other countries?\" Dec. 7, 2018", "Peterson-Kaiser Health System Tracker, \"Mortality rate,\" accessed March 13, 2019", "Peterson-Kaiser Health System Tracker, \"How do healthcare prices and use in the U.S. compare to other countries?\" May 8, 2018", "Peterson-Kaiser Health System Tracker, \"Quality of life,\" accessed March 13, 2019", "The Commonwealth Fund, \"Health Care Spending in the United States and Other High-Income Countries,\" March 13, 2018", "The Commonwealth Fund, \"Mirror, Mirror 2017:International Comparison Reflects Flaws and Opportunities for Better U.S. Health Care,\" July 2017", "Journal of the American Medical Association, \"Health Care Spending in the United States and Other High-Income Countries,\" March 13, 2018", "Forbes, \"U.S. Health Outcomes Compared to Other Countries Are Misleading,\" April 9, 2018", "Johns Hopkins Bloomberg School of Public Health, news release, Jan. 7, 2019", "Health Affairs, \"It’s Still The Prices, Stupid: Why The US Spends So Much On Health Care, And A Tribute To Uwe Reinhardt,\" January 2019", "Washington Post, \"Why U.S. health-care reformers shouldn’t use other countries as a model. Swiss miss, anyone?\" Feb. 22, 2019", "PolitiFact, \"Fact-checking Sanders' claim that U.S. spends 3 times per capita what the U.K. spends on health care,\" Dec. 20, 2015", "Email, Eric Schneider, M.D., senior vice president for policy and research at The Commonwealth Fund and associate professor of medicine at Harvard Medical School, March 13, 2019", "Email, Irene Papanicolas, assistant professor of health economics at the London School of Economics and visiting assistant professor at the Harvard T.H. Chan School of Public Health, March 13, 2019", "Email, Cynthia Cox, director of the Program for the Study of Health Reform and Private Insurance at the Kaiser Family Foundation, March 13, 2019", "Email, Timothy Norbeck, chief executive officer of the Physicians Foundation, March 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]