["About this rating", "A Chicago woman became the center of a national controversy in the U.S. during the summer of 2018, after she posted a video online showing a man berating her in a public park because she was wearing a t-shirt bearing the flag of Puerto Rico — all while a local police officer stood by, unresponsive to her pleas for assistance.", "An edited version of Mia Irizarry's video was posted to Facebook by the viral content page \"Now This,\" garnering more than 33 million views within two days. The video's caption proclaimed that it captured: \"A man [who] harassed a woman wearing a Puerto Rico shirt because she 'should not be wearing that in the United States of America.'\"", "The original 36-minute Facebook Live video, which Irizarry streamed on the social networking site on 14 June 2018, depicts an interaction between herself and an older man, later identified as 62-year-old Timothy Trybus. Though it's not clear exactly what led up to the events shown in the video, Trybus can be seen and heard persistently harassing and criticizing Irizarry for her choice of attire, challenging her American citizenship, and approaching her in an aggressive manner.", "The incident took place at a picnic area in Caldwell Woods, in the Forest Preserves of Cook County, eleven miles northwest of Chicago. Also on the scene was a Forest Preserves District Police Deputy, later identified as Patrick Connor (or Conner, the spelling in reports has been inconsistent).", "On three separate occasions, Irizarry can be seen asking for Connor's assistance and expressing her discomfort with Trybus's harassment. Trybus does not appear to be aware that Puerto Rico is a United States territory, and that Puerto Ricans are United States citizens:", "Irizarry: Officer, I'm renting this area, and he's harassing me about the shirt that I'm wearing.", "Trybus: You're not going to change us, you know that?", "Irizarry: I'm not trying to change anyone, I'm just trying to come here for a birthday party.", "Trybus: The world is not going to change the United States of America. You should not be wearing that [shirt] in the United States of America.", "Connor can clearly be seen watching in the background as this exchange takes place. Trybus, who appears to be intoxicated, then steps much closer to Irizarry and demands of her, \"Are you a citizen?\"", "Irizarry: Yes I am a citizen.", "Trybus: Are you a United States citizen? Then you should not be wearing that.", "Irizarry:  Can you please get away from me.", "Trybus:  You should be wearing a United States of America flag, not Puerto Rico.", "Irizarry: Officer, I feel highly uncomfortable. Can you please grab him? Please? Officer?", "In response to this exchange, Connor looked away and moved back toward his patrol car.", "Trybus continued to rant and shout at Irizarry from a distance, intermittently approaching her at speed, and at times looming over her. At one stage he made what appeared to be a garbled threat that \"You know what, I got some really really really nieces and nephews that'll go down on you.\"", "Later, Irizarry's brother arrived at the scene and intervened, telling Trybus to \"calm down\" and insisting that he not follow Irizarry. At one point, Irizarry's brother approached Connor while the deputy stood next to Trybus, and Connor could be clearly heard saying, \"Hey don't you dare walk over here, okay?\"", "Mia Irizarry responded, \"How come you're saying something when he's [my brother's] going up, but when he [Trybus] was coming up to me you didn't do anything?\"", "In the end, several other Forest Preserve Police District officers arrived on the scene and arrested Trybus, charging him with assault and disorderly conduct.", "At a 10 July press conference, Forest Preserve District Police Chief Kelvin Pope said the force had started an internal investigation into Connor's conduct on the day of the incident, and that Connor had been placed on desk duty since 24 June pending the outcome of the probe. Connor had been on the force for around 10 years, Pope said, and had been disciplined in the past for \"working a part-time job and not carrying proper credentials.\"", "Pope added that the Forest Preserves District had \"sincerely apologized\" to Irizarry.", "At the same press conference, Cook County Commissioner Luis Arroyo Jr. was scathing in his evaluation of Connor's actions and called for Connor to be fired:", "This inaction by law enforcement will not be tolerated. I stand with law enforcement 100 percent, but when I witness an officer not protecting the rights of our citizens, and the dereliction of their duty, like I witnessed in that video, I will support the [recommended] disciplinary action, up to and including their termination.", "Me personally, I believe that this officer did not do his duty, and I will not accept anything else but this officer's termination.", "Dennis White, chief attorney for the Forest Preserves Police District, said it was possible the charges against Trybus could be elevated to the level of hate crimes but that no final decision had been made in that regard.", "The video has prompted widespread outrage and concern, both over Trybus's harassment of Irizarry and over Connor's failure to intervene. Ricardo Rossello, the Governor of Puerto Rico, said in a series of tweets that he was \"appalled, shocked and disturbed\" by Connor's behavior and vowed to demand his firing.", "The Forest Preserves of Cook County announced on 11 July that Officer Patrick Connor had resigned the previous day.", "Schmidt, Samantha.   \"Woman Harassed for Wearing Puerto Rico Shirt 'In America' as Officer Stands by Watching.\"\r\n    The Washington Post.   11 July 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]