["About this rating", "On 7 June 2018, beverage brand Country Time announced a summertime initiative to pay permit fees and fines for children caught operating lemonade stands without planning permission:", "Kids across the country are getting busted for operating lemonade stands without a permit. We're taking the lead to #SaveLemonadeStands by paying for kids' fines + permits this year. For every RT this gets we’ll donate $1 (up to $500,000) to help kids next year + beyond.", "— CountryTime (@CountryTime) June 7, 2018", "Using the hashtag #SaveLemonadeStands and saying, \"when life gives you arcane laws, make lemonade,\" the clip briefly featured what appeared to be headlines about lemonade stand-related prosecution, but was light on details about the frequency with which kids are fined for carrying on the childhood tradition.", "We were unable to find any citations on Country Time's (largely disused) Twitter timeline, but we did turn up some cases of lemonade stand closures that made the news. It appeared government meddling in the lemonade business was unusual enough to make headlines, suggesting the majority of roadside cold drink businesses operate uninhibited each summer.", "It appeared the marketing tactic may have been inspired by a 30 May 2018 Facebook post published by police in Denver. In that status update, police stressed that they \"don’t go out of [their] way to enforce matters of this nature and in this instance, [police] actions were complaint driven.\" Although the stand was shut down, no fine was mentioned:", "The most high-profile case of a lemonade fine we could find was not in the United States. In July 2017, a London girl was fined £150 for setting up shop near a festival. However, that fine was \"cancelled immediately\" and the child and her family received an apology from officials.", "In that case permit costs were a factor, but not fines. There was a lemonade-related brouhaha in Texas in 2015, but again the costs involved pertained to obtaining permits (not fines assessed). The same scenario made the news in Oregon in 2010, where a child needed a costly permit to continue hawking lemonade. And in 1998, a child was purportedly threatened with a fine for selling cold drinks on a hot day.", "Although it was difficult to say how common lemonade stand bureaucracy might be, there were definitely cases over the years where children's entrepreneurial dreams were dashed by municipal red tape. In most incidents, children were directed to obtain permits (and in the ones involving fines, the costs were typically waived). Country Time's \"lemon aid\" campaign aimed to cover the costs of both fines and permits for kids whose stands landed on the wrong side of the law.", "Aziz, John.   \"What's The Point Of Regulating Lemonade Stands?.\"\r\n    The Week.   4 February 2014.", "Jung, Helen.   \"Portland Lemonade Stand Runs Into Health Inspectors, Needs $120 License To Operate.\"\r\n    The Oregonian.   4 August 2010.", "Hill, Crystal.   \"Kids Were Selling Lemonade For Charity — Until Police Arrived To Stop It, Colorado Mom Says.\"\r\n    Miami Herald.   30 May 2018.", "Zaru, Deena.   \"Texas Cops Shut Down Girls' 'Illegal' Lemonade Stand.\"\r\n    CNN.   11 June 2015.", "BBC.   \"Girl, 5, Fined £150 For Lemonade Stand.\"\r\n    21 July 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]