["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post claims that enough people crossed illegally into the United States in February to fill the Kansas City Chiefs’ football stadium. The claim needs clarification but is mostly accurate.", "\"Seating capacity: 76416,\" said the text at the top of a picture of a football stadium. A sign in the picture says \"Chiefs,\" referring to the football team from Kansas City, Mo. Text on the lower end of the photo adds: \"In February alone there were enough illegal immigrants who crossed the border to fill this stadium.\"", "The March 11 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Kansas City Chiefs play at Arrowhead Stadium, which is able to fit 76,416 people, according to the 2018 NFL Record & Fact Book. (It also holds a Guinness record for crowd noise, PolitiFact Missouri found.) So that part of the claim is accurate.", "Did 76,416 people cross the border illegally in February? Close to it.", "The Facebook post doesn’t specify that it’s talking about the southwest border, but it likely is referring to southwest border migration data published monthly by U.S. Customs and Border Protection.", "In February, Border Patrol agents made 66,450 apprehensions at the southwest border. Apprehension data is commonly used as a metric to measure illegal immigration. The number refers to apprehensions between ports of entry.", "Customs and Border Protection also releases monthly tallies on the number of people who wanted to come into the United States legally but were turned away by border officers. Lacking proper travel documents is one of the reasons why someone might be denied entry. This segment is classified as \"inadmissibles.\" In February, 9,653 people were deemed inadmissible after presenting themselves at ports of entries along the southwest border.", "Adding the number of people apprehended for illegal entry and the number of people who wanted to come in legally but were denied entry results in 76,103 people. (It’s unclear if there’s overlap in the numbers; for instance, if someone denied legal entry later tried to come in illegally.)", "The post suggests that it’s mainly Mexicans who crossed the border illegally by featuring the Mexican flag in the middle of the stadium. Most immigrants now apprehended at the border are from Central America, not Mexico.", "One final note on the post's use of \"illegal immigrants:\" Many of the people crossing the border are seeking asylum protection. To apply for asylum, migrants need to be present in the United States. Federal and international laws allow immigrants to apply for asylum whether they arrived here legally or illegally.", "With those caveats, we rate the claim Mostly True.", "Facebook post on illegal immigration, March 11, 2019", "CBP.gov, Southwest border migration FY 2019, accessed March 11, 2019", "2018 NFL Record & Fact Book, Information about Kansas City Chiefs’ stadium", "Rescue.org, Migrants, asylum seekers, refugees and immigrants: What’s the difference?, June 22, 2018, updated Dec. 11, 2018", "PolitiFact Missouri, Is it true that Kansas City's Arrowhead Stadium is considered the loudest in the world?, March 11, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]