["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New political ads from John McCain accuse Barack Obama of raising taxes on the middle class.", "\"Obama voted to raise taxes on people making just $42,000,\" an announcer says in a television ad. \"He promises more taxes on small business, seniors, your life savings, your family.\"", "To support this statement, the McCain campaign points to two Obama votes on budget resolutions, one in March 2008 and another in June 2008.", "Problem is, neither of these votes actually raised taxes, nor were they expected to.", "Instead, the votes approved budget resolutions, which are blueprints for the federal budget. The resolutions set targets for the committees that write legislation on taxes and spending. Obama joined Democrats on what were largely party-line votes expressing the desire to roll back the Bush tax cuts in order to fund popular programs. The tax cuts would have been rescinded on people making about $42,000 and higher.", "The McCain campaign is correct that Obama voted for the measures, which expressed approval for tax increases. But as we have pointed out in other stories, it's inaccurate to suggest votes on non-binding budget resolutions, which don't have the force of law and don't include precise details on taxes or spending, are the same as votes on legislation that sets policy. The ad gives an overall false impression that Obama as president would favor tax increases for incomes of $42,000. He does not. Obama's tax proposals are crafted so that tax increases hit those couples $250,000 or more a year, or $200,000 for singles. He also proposes a $1,000 tax credit on income for working families ($500 for singles).", "Because the ad cherry-picks a vote that would not have directly changed the tax code, we find the statement Barely True.", "U.S. Senate,\n\nVote on budget resolution\n\n, June 4, 2008.", "The Tax Policy Center,\n\nAn Updated Analysis of the 2008 Presidential Candidates' Tax Plans\n\n, July 23, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]