["About this rating", "In a brief aside during remarks about the ongoing U.S.-China trade war, Trump said \"I am the chosen one.\"", "Trump's \"chosen one\" aside was likely tongue-in-cheek, not a sincere profession of any belief in his own messianic status. Separately, in a series of tweets, Trump quoted a radio host who claimed Jewish people in Israel admired the U.S. president so greatly that it was as though Trump were the King of Israel or the second coming of Christ. Trump never himself articulated any such belief.", "In August 2019, we received inquiries from readers about multiple claims that U.S. President Donald Trump had, in one day, called himself the \"second coming of God,\" the \"King of Israel,\" or \"the chosen one.\"", "On Aug. 21, the left-leaning Facebook page Occupy Democrats posted a meme that featured a quotation attributed to Trump: \"I'm the King of Israel. I'm the chosen one\" along with an unattributed quotation that read: \"The Anti-christ will pretend that he is the son of God.\" (That quotation is not Biblical in origin, and appears to have originated in a famous medieval text about the antichrist, written by the French Benedictine monk Adso of Montier-en-der.)", "The same Facebook page posted a second meme on similar themes, writing:", "Today, Trump:", "Promoted the idea that he is \"King of Israel.\"\nRetweeted that he's \"the second coming of God.\"\nThen said he's \"the chosen one.\"", "And in a third post on the same subject, Occupy Democrats published a meme that read: \"Trump says he's 'the second coming' and 'the chosen one.' I say we throw him in the sea to see if he can walk on it.\"", "Other mostly left-leaning sources posted similar claims on Twitter, garnering a high volume of retweets. One of them wrote:", "\"When the president of the United States starts declaring that he is:\n- 'The King of Israel'\n- 'The Chosen One'\n- 'The Second coming of God'", "It means he is out of his goddamn mind & it's time for the 25th amendment now.\"", "When the president of the United States starts declaring that he is:", "— \"The King of Israel\"\n— \"The Chosen One\"\n— \"The Second coming of God\"", "It means he is out of his goddamn mind & it's time for the #25thAmendmentNow.", "— Ryan Knight ? (@ProudResister) August 21, 2019", "The @BarristerSecret account tweeted that Trump had \"unironically [declared] himself 'the second coming of God,'\" and the controversial surgeon and left-leaning activist Dr. Eugene Gu claimed the president had \"[praised] himself as 'the King of Israel' and 'the second coming of God.'\"", "Vanity Fair also published an article with the headline \"Trump Declares Himself 'King of Israel,' 'the Second Coming of God.'\"", "The reality was much more complicated, and the claims and reports mentioned above largely misrepresented what Trump actually said or wrote by removing them from their proper context or issuing inaccurate descriptions of them.", "'The chosen one'", "While speaking with reporters about the ongoing U.S. trade war with China, Trump did briefly say \"I am the chosen one,\" but it's quite possible, even likely, that he was merely speaking tongue-in-cheek or for rhetorical effect.", "His remarks came on Aug. 21, while he was speaking with reporters on the South Lawn of the White House. In response to a question about recent talk of an impending economic recession, linked to the U.S.-China trade war, Trump held forth on what he presented as sharp economic practices by China, a common topic of discussion for the president. He said:", "\"One thing I have to do is economically take on China because China has been ripping us off for many years. President Clinton, President Bush, President Obama and others should have done this long before me. My life would be much easier — although I enjoy doing it — but my life would be much easier if I just said 'let China continue to rip off the United States.' It would be much easier, but I can't do that ...", "\"... Somebody said 'It's Trump's trade war' — this isn't my trade war, this is a trade war that should have taken place a long time ago, by a lot of other presidents ... Somebody had to do it. [Turning to the sky] I am the chosen one. Somebody had to do it, so I'm taking on China. I'm taking on China on trade, and you know what? We're winning ...\"", "President Trump: \"I am the chosen one.\"", "Full video here: https://t.co/BEh8qCGe79 pic.twitter.com/6pbll1a0NT", "— CSPAN (@cspan) August 21, 2019", "The concept of a \"chosen one\" — an individual predestined by prophecy to perform the role of a savior or messiah for a particular people — has roots in various cultures and religious traditions, including Christianity, Judaism, and Islam. However, it has evolved beyond those parameters to gain much looser and more secular connotations.", "It is a common trope in fiction and literature, especially science fiction and fantasy (think of Harry Potter), and is also frequently invoked, sometimes with tongue in cheek, in the context of sports. For example, the basketball player LeBron James famously had \"Chosen 1\" tattooed on his back, after Sports Illustrated published a cover story about him, describing the then-phenomenally promising high school junior as \"the chosen one.\"", "In theory, Trump could have been seriously declaring a sincere belief that he is destined by prophecy to be the savior of the American people, or indeed the world, when he said as an aside \"I am the chosen one,\" during a discussion with reporters about U.S.-China economic relations. However, it seems much more likely to us, especially in light of his somewhat theatrical glance to the skies, that he was either using the phrase as a figure of speech born out of his apparently rather certain belief in his own talents, or that he was simply speaking with tongue firmly in cheek, or a little bit of both.", "If the U.S. president refers to himself as \"the chosen one\" again, and with less ambiguous, more clearly messianic connotations, we will update this article accordingly.", "'The King of Israel' and 'the second coming of God'", "Trump never declared or called or described himself as \"the King of Israel\" or \"the second coming of God.\" Further, he did not even quote someone who personally professed that belief, and the person he did quote was not even claiming that others held that belief. As such, many sources, including those mentioned above, grossly misrepresented the pronouncements made in this episode.", "However, in a decision that concerned many observers, the president did directly quote the conspiracy theorist and radio host Wayne Allyn Root as saying that \"The Jewish people in Israel love [Trump] like he's the King of Israel\" and \"like he is the second coming of God.\" Trump did this in a series of tweets, also on Aug. 21, which he prefaced by writing \"Thank you Wayne Allyn Root for the very nice words\":", ".... like he's the King of Israel. They love him like he is the second coming of God ... But American Jews don't know him or like him. They don't even know what they're doing or saying anymore. It makes no sense! But that's OK, if he keeps doing what he's doing, he's good for .....", "— Donald J. Trump (@realDonaldTrump) August 21, 2019", "Trump almost entirely accurately quoted remarks Root made on his \"Newsmax\" TV show on Aug. 20. In response to a caller who lamented the purported irrationality and blind loyalty of Democrat voters, Root held forth on the traditional support for the Democrat party among Jewish voters in the U.S., in contrast with what he presented as widespread support for Trump among Jews in Israel. He said:", "\"... 75 percent of all Jews vote Democrat and they don't like Trump. And this is the greatest president for Jews and for Israel in the history of the world, not just America. Trump's the best president for Israel in the history of the world. And the Jewish people love him like he is the king of Israel. They love him like he is the second coming of God. And in America, American Jews don't like him. They don't even know what they're doing or saying any more, it makes no sense.\"", "The remarks in question can be watched here (beginning at 36:45). Root was echoing similar statements Trump himself made earlier that day. Speaking to reporters at the White House, the president addressed the controversy over Israel's reversed decision to bar U.S. Reps. Rashida Tlaib, D-Mich., and Ilhan Omar, D-Minn., from entering the country.", "Trump proclaimed: \"Where has the Democratic party gone? Where have they gone where they're defending these two people [Tlaib and Omar] over the state of Israel? And I think any Jewish people that vote for a Democrat, I think it shows a total lack of knowledge or great disloyalty.\"", "Root's original remarks came in the form of a simile, meaning it should have been clear by definition that he was not claiming that Trump actually is the King of Israel or the second coming of Christ, nor even that Jewish people in Israel believe he is those things. Rather, in order to emphasize what he perceives as the U.S. president's popularity among Israeli Jews, Root was indulging in rhetorical license, using the device of a simile, by saying Israeli Jews loved Trump as if he were the King of Israel or the second coming of Christ.", "(It is a matter for a separate discussion that the second component of Root's simile was woefully theologically illiterate. An important distinction between Christianity and Judaism is that Judaism traditionally rejects the notion of Christ as a messiah, thereby rendering the concept of a second coming inapplicable, and this part of Root's simile nonsensical by definition.)", "Root later emphasized the fact that he was engaging in simile, rather than claiming Trump was, in fact, the king of Israel or the second coming of Christ, or even that Israeli Jews regard him as such. During a discussion with former Fox News host Bill O'Reilly on Root's \"Newsmax\" TV show, Root said:", "\"... They [liberal opponents] took everything I said out of context ... Did I really say, on national TV, on my 'Newsmax' show last night, that Donald Trump is the second coming of Christ, and he's the king of the Jews? No. I said in Israel they treat him like he's the second coming of Christ and the King of the Jews. And it's a New York expression, you know, it's like you and I could have been having an expression [sic] and I'd say, 'Are you kidding me? In Israel they treat him like he's the King of the Jews.' Does that really mean that I believe he's the King of the Jews? ... Obviously, I didn't say that.\"", "<span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start lazy_load_iframe\">﻿</span>", "We know that certain Christians in the United States and beyond have professed a fringe belief in Trump as a Christ-like or messianic figure. It's even possible, theoretically, that Trump himself might harbor similar suspicions of his own destiny. But the series of statements he made on Aug. 21, 2019, did not constitute evidence of any such belief on his part.", "The president did say \"I am the chosen one,\" but he made the remark as an aside, combining it with a theatrical glance towards the heavens, while making a broader point about his engaging in a supposedly overdue trade war with China. The context, along with Trump's penchant for flippant and tongue-in-cheek asides, makes it highly unlikely he was choosing that moment to earnestly articulate some sincere belief in his own messianic destiny.", "In a series of tweets, Trump quoted a controversial conspiracy theorist, Root, who had lavished praise upon the president, professing that Jewish people in Israel so admired Trump that it was as though he was the \"King of Israel\" or \"the second coming of God.\" But Root (as he later confirmed) was using exaggerated language as part of a simile. He was not making the factual claim that Israeli Jews literally believe that Trump is the King of Israel, or the second coming of Christ (the latter of which claims would make no sense for theological reasons, anyway.)", "So the widely promulgated claim that Trump, simply by quoting Root's remarks, was in effect declaring himself to be the King of Israel or the second coming of Christ, was inaccurate by a considerable distance. Trump did not even quote someone who professed that belief, and the person he did quote was not even claiming that others held that belief.", "Kelman, Brett.  \"This Vanderbilt Doctor Got Political. Then He Sued Trump and Won. Now He's Out of a Job.\"   The Tennessean.  8 June 2018.", "Levin, Bess.  \"Trump Declares Himself 'King of Israel,' the 'Second Coming of God.'\"   Vanity Fair.  21 August 2019.", "Irwin, Neil.  \"How the Recession of 2020 Could Happen.\"   The New York Times.  17 August 2019.", "Washington, Jesse.  \"The Magazine Cover LeBron James Got Tatted On His Back.\"   The Undefeated.  15 February 2017.", "Mikkelson, David.  \"Barack Obama at Columbia.\"   Snopes.com.  23 February 2010.", "Borchers, Callum.  \"Columnist of Sheldon Adelson's Las Vegas Newspaper Blames 'Muslim Terror' for Shooting.\"   The Washington Post.  2 October 2017.", "Simmons, Shraga.  \"Why Jews Don't Believe in Jesus.\"   Aish.com.  6 March 2004.", "Mac Guill, Dan.  \"Did a Billboard in Missouri Show President Trump Alongside a Gospel Quote?\"   Snopes.com.  5 November 2018.", "Kestenbaum, Sam.  \"#MAGA Church: The Doomsday Prophet Who Says the Bible Predicted Trump.\"   The New York Times.  15 March 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]