["By Angelo Fichera", "Posted on March 14, 2018", "Q: Did a federal court order former President Barack Obama to pay “$400 million in restitution”?", "A: No. Multiple sites have carried the fictitious story.", "FULL ANSWER", "Former President Barack Obama would be in a particularly undesirable financial situation, if the stories circulating about him online in recent days were true.", "“Obama Appeal Denied: Judge Orders Him To Pay Back $400 Million,” reads a March 11 headline. Another proclaims: “Court Orders Obama To Pay $400 Million In Restitution.”", "But those stories are false.", "The posts, flagged by Facebook users as potentially fake, evidently did fool some into believing Obama was ordered to pay the large sum for alleged misdeeds: Numerous public posts and comments praised the fictitious court decision.", "“Wow, this is awesome!!!!!!! President Trump should use the money to build the wall that Obama did not want,” one Facebook user opined.", "The claims were published by sites such as reaganwasright.com — which labels its work as satire and says “everything on this website is fiction” — and specialnewsusa.com, which offers no such disclaimer. A Facebook page associated with the latter website has nearly 60,000 followers.", "Both stories cite federal courts that don’t exist, including the “West Texas Federal Probate Court” and the “West Texas Federal Appeals Court, operating out of the 33rd District.”", "The federal courts in Texas include the Northern, Southern, Western and Eastern districts. Appeals from those courts go to the 5th U.S. Circuit Court of Appeals, which covers districts in Texas, Mississippi and Louisiana.", "And the judges aren’t real, either. The reaganwasright.com post mentions “Judge Sanford Batt” and the specialnewsusa.com story names judges “Gary Jones,” “Amanda Perry,” and “Kris Weinshenker.”", "There are no federal judges by those names, according to the Federal Judicial Center’s online directory of federal judges.", "The $400 million references a payment made to Iran in 2016 during the Obama administration.", "The court “has ordered that Barack Obama repay $400 Million to the American people for funds he says were ‘lost’ during an illegal transaction with Iranian hard-liners,” reads the specialnewsusa.com story.", "While that cash payment was criticized by some, the Obama White House never claimed the money was “lost.”", "The $400 million was part of a $1.7 billion payment that resolved a dispute with Iran dating back to 1979 over military equipment for which Iran paid the U.S. but never received.", "Critics questioned the timing of the cash payment — made on the same day Iran released several American prisoners. The Obama administration maintained the payment was used as “leverage,” but denied that it amounted to ransom.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“About.” reaganwasright.com. Accessed 14 Mar 2018.", "“Biographical Directory of Article III Federal Judges, 1789-present.” Federal Judicial Center. Accessed 14 Mar 2018.", "“Brief History.” U.S. Court of Appeals for the Fifth Circuit. Accessed 14 Mar 2018.", "“Court Orders Obama To Pay $400 Million In Restitution.” specialnewsusa.com. 11 Mar 2018.", "Kiely, Eugene, et. al. “FactChecking the First Debate.” FactCheck.org. 27 Sep 2016.", "Lardner, Richard. “US payment of $1.7 billion to Iran made entirely in cash.” Associated Press. 7 Sep 2016.", "Lee, Carol E. and Jay Solomon. “U.S. Acknowledges Cash Payment to Iran Was ‘Leverage’ in Prisoner Release.” The Wall Street Journal. 18 Aug 2016.", "“Obama Appeal Denied: Judge Orders Him To Pay Back $400 Million.” reaganwasright.com. 11 Mar 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]