["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Nicholas Mattiello on the July 6, 2014 edition of WPRI's \"Newsmakers.\"", "Some things in life are a certainty -- death, taxes and members of the Rhode Island General Assembly staying up until the early morning hours to pass a flurry of legislation on the final day of the session.", "On the edition of WPRI-TV's \"Newsmakers\" program that aired July 6, 2014, reporter Tim White was talking to House Speaker Nicholas Mattiello about the assembly session that had just ended.", "He noted that legislators were passing bills as late as 4 a.m. White questioned whether they had time to fully consider them before voting and asked, \"Is this how you think the legislative process should happen?\"", "Mattiello argued that the House really didn't have an all-night session this year.", "\"We kept to our curfew every night of the last week of (the) session,\"  he said. \"Most of the business, even on the last night of the session, was concluded by, I think, roughly 11 o'clock.\"", "\"The session went late because of negotiations with the Senate over a Newport Grand gambling bill. So there was that one bill,\" Mattiello said. \"Most of the business, and I don't want to be fact-checked, but I think by 11 o'clock 95 to 98 percent of the business was done. So we really didn't have that late-night session. We were just holding on one bill.\"", "(He was referring to legislation, later signed by Governor Chafee, authorizing referenda on whether table games should be allowed at the slot parlor.)", "Mattiello may not have wanted to be fact-checked, but we couldn’t resist, because we had a very different recollection of a legislative day that didn't officially end until 4:06  Saturday morning. The last vote was at 3:48 in the morning.", "So was 95 to 98 percent of the business done by 11 p.m.? Was only one bill at issue? And did the House not really have a late-night session?", "When we contacted Mattiello's office, spokesman Larry Berman said in an email that \"There were 126 votes taken by House members on the final day of session (June 20). Of those, 87 were made before 11 p.m.\"", "That's 69 percent, not 95 to 98 percent.", "However, Berman said, Mattiello was referring to new business. Most of those after-11-p.m. votes don't count, he argued, because all but one of those issues had already been debated before by the House.", "That's a distinction the speaker didn't make on Newsmakers.", "The remaining votes did consist largely of cleaning up language so House and Senate versions were identical on bills that allowed optometrists to prescribe the opiate drug hydrocodone; regulated music therapists; authorized special license plates for Olympic medal winners, and eliminated the so-called master level that provides for straight-party voting.", "But those are still final votes on important issues. Those votes are not insignificant.", "And when you don't leave the building until after 4 a.m., that's a late night.", "Our ruling", "Nicholas Mattiello said that \"by 11 o'clock 95 to 98 percent of the business was done. So we really didn't have that late-night session. We were just holding on one bill.\"", "It's true that one issue -- Newport Grand and its associated bills -- was holding things up on the last night of the session.", "It's much less true that 95 percent of the business was done by 11 p.m.", "And Mattiello's suggestion that you shouldn't call a 4 a.m. adjournment a late-night session simply because most votes involved legislation that members had seen before strikes us as Pants On Fire ridiculous.", "His statement contains just enough truth -- the fact that one bill was at issue -- to escape having his slacks scorched. We rule it False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "WPRI.COM, \"Newsmakers 7/3/2014: RI House Speaker Nicholas Mattiello,\" aired July 6, 2014, accessed July 8, 2014", "Email, Larry Berman, spokesman, R.I. House Speaker Nicholas Mattiello, July 10, 2014", "RILIN.state.RI.US, \"Journal of the House of Representatives,\" June 20 and 21, 2014; \"2014 House Journals\" webpage, \"House Session Days\" webpage showing votes and when they were taken; House bills \"7131 Substitute A: An Act Relating to Health and Safety - Registration of Music Therapists,\" \"7700 Substitute B: An Act Relating to Towns and Cities - Zoning Ordinances,\" \"7137 Substitute A: An Act Relating to Businesses and Professions - Board of Medical Licensure and Discipline,\" \"8072 Substitute A: An Act Relating to Elections -- Conduct of elections,\" and \"8298 Substitute A as Amended: Joint Resolution Creating a Special Joint Commission to Study . . . the Impact of Innovative Technologist on the Market for Transportation Services,\" and Senate bills \"2292: An Act Relating to Motor and Other Vehicles - Registration of Vehicles,\" and \"2804: An Act Relating to Businesses and Professions - Optometrists;\" all accessed July 9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]