["As the new U.S. House speaker, Nancy Pelosi faces a slew of challenges this year. Being removed from a fundraiser for excessive drinking is not one of them.", "A post on \"The Last Line of Defense,\" a satire blog known for peddling made-up stories, claimed Pelosi had been kicked out of a benefit for children with cancer after having one too many drinks.", "\"After filling a beer mug with vodka and sprinkling some Crystal Light in there for color, Pelosi was so drunk she started making fun of the hats the kids had made earlier,\" the post said.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The tag line for the website is: \"Information you probably shouldn’t trust.\" Indeed, the story is bogus. We found no evidence of Pelosi having ever attended, or been removed, from any such fundraiser.", "Art Tubolls, the billionaire who organized the fundraiser quoted in the story, is in fact a \"propagandist for America's Last Line of Defense,\" according to his Twitter bio. His name is an anagram for Busta Troll, one of the many names used by author of the website, who we profiled in 2017.", "As the About Us page explains, \"Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.\"", "We rate the claim Pants on Fire!", "Correction Jan. 24, 2019: Nancy Pelosi is Speaker of the U.S. House of Representatives. An earlier version of this article listed a different title.", "Wearethellod.com, Nancy Pelosi Removed From Benefit for ‘Being So Drunk She Couldn’t Stand Up’, Jan. 12, 2019", "Twitter, Art Tubolls", "Snopes, Was Nancy Pelosi Removed from a Children’s Cancer Benefit for Being Drunk?, Jan. 12, 2019", "PolitiFact, If you're fooled by fake news, this man probably wrote it, May 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]