["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo of former President Barack Obama shared on Facebook claims that the photographer was \"in the right place at the right time\" because Obama was apparently furious the picture was snapped.", "The image shows Obama holding the book \"The Post American World,\" written by American journalist Fareed Zakaria.", "While the photo is legitimate –– it was taken by New York Times photographer Doug Mills in 2008 when Obama was campaigning in Montana –– the message in the post about it is not accurate.", "The text above the photo says:", "\"A picture is worth a thousand words. SOMEONE WAS AT THE RIGHT PLACE AT THE RIGHT TIME WITH A CAMERA. IT WAS REPORTED THAT PRESIDENT OBAMA WAS FURIOUS THAT HE WAS CAUGHT ON CAMERA AND IT WAS PUBLISHED AND TRIED TO BLOCK IT. The name of the book Obama is holding is called: The Post-American World, and it was written by a fellow Muslim.  (Fareed Zakaria) \"Post\" America means: The World \"After\" America! If each person sends this to a minimum of twenty people on their address list, in three days, all people in the United States of America would have the message. I believe this is the one photo that really should be passed around.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence and no credible news reports that supports the claim that President Obama was \"furious\" that the photo was taken. The photographer was a known member of the press and wasn’t secretly \"in the right place at the right time.\".", "Besides authoring several books, Fareed Zakaria hosts the show \"Fareed Zakaria GPS\" for CNN Worldwide, and he is a columnist for the Washington Post and a contributing editor for The Atlantic, according to his website.", "While Zakaria is Muslim-born, he has said in previous interviews that he does not consider himself a \"religious guy.\" The post also make the false claim that Obama is Muslim when it describes Zakaria as a \"fellow\" Muslim.", "The characterization of the book is also wrong. \"The Post American World\" is not a Muslim’s perspective on a future world with a toppled America, but is about \"the rise of the rest\" with the growth of countries like China and India.", "In the first chapter, Zakaria writes: \"This is a book not about the decline of America but rather about the rise of everyone else. It is about the great transformation taking place around the world, a transformation that, though often discussed, remains poorly understood.\"", "A Publishers Weekly review of the book called it \"a stimulating, largely optimistic forecast of where the 21st century is heading,\" saying that Zakaria \"predicts that despite its record of recent blunders at home and abroad, America will stay strong, buoyed by a stellar educational system and the influx of young immigrants, who give the U.S. a more youthful demographic than Europe and much of Asia whose workers support an increasing population of unproductive elderly.\"", "The New York Times Sunday Book Review said the book is \"a relentlessly intelligent book that eschews simple-minded projections from crisis to collapse … Zakaria’s is not another exercise in declinism. His point is not the demise of Gulliver, but the ‘rise of the rest.’\"", "We rate this post False.", "Facebook post, Nov. 4, 2019", "New York Times, From Books, New President Found Voice, Jan. 18, 2009", "The Village Voice, The Interpreter, Aug. 9, 2005", "Amazon, The Post-American World 1st Edition, May 2008", "FareedZakaria, About, Accessed Nov. 6, 2019", "Snopes, What Does Obama Read? ‘The Post-American World’, Oct. 8, 2008", "Publishers Weekly, Review of The Post-American World, accessed Nov. 6, 2019", "New York Times Sunday Book Review, The New New World, May 11, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]