["About this rating", "In March 2019, a blog on the religion-themed website Patheos featured an article reporting that U.S. Vice President Mike Pence refused to utter the phrase \"homo sapiens,\" the Latin term used by scientists to designate the human species.", "The subject came up in a conversation Pence allegedly had with a college professor named \"Andrew Canard\":", "Washington DC – Vice President Pence came out of the linguistic closet today when he refused to utter the words Homo sapiens.", "He was the keynote speaker at the Conference of American Scientists. Insiders state President Trump specifically sent him there to get him out of the White House. “President Trump thinks he’s a downer,” an anonymous source stated. “It weirds him out when Pence calls his wife Mother.”", "During the meet and greet Professor Andrew Canard from Taradiddle University asked Pence if he knew the proper scientific classification of humans. Friends of Canard report the professor didn’t like Pence’s speech about Adam and Eve.", "A visibly irritated Pence reassured Canard he knew what the term is. However, the Vice President added, “I dislike the term. I find it unnecessarily sexual.”", "The article went on to say that Pence also bristled when questioned about the words \"homophone\" (defined as a word that is pronounced the same way as another but that has a different meaning or spelling) and \"homogeneous\" (a mathematical term relating to variables in an equation, or a word meaning \"of the same kind\").", "The post was widely shared by social media users, some of whom may not have realized it was fictional. The name of the Patheos blog that published it is \"Laughing in Disbelief,\" and that blog's content, unlike most of the articles published on the website, is satirical. The blog links to a disclaimer identifying its content as such and prompting readers to look for humorous \"winks\" (hints) within the stories alerting them to its fictional nature. One of those is its use of the surname \"Canard\" (a French word meaning \"hoax\").", "Among the other \"Laughing in Disbelief\" fabrications that have gained traction as putatively true news stories is one reporting that Pence was kicked out of Iceland by government officials for being a \"religious fanatic.\" (N such incident occurred.)", "Pence, a former governor of Indiana and member of the U.S. House of Representatives, is a conservative Christian and well known for his opposition to LGBT rights.", "Drabold, Will.   \"Here's What Mike Pence Said on LGBT Issues Over the Years.\"\r\n    Time.   15 July 2016.", "Hall, Andrew.   \"Mike Pence Won't Say 'Homo Sapiens.'\"\r\n    Patheos.   21 March 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]