["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Following another violent weekend on Chicago’s South and West Sides, President Donald Trump’s attorney Rudy Giuliani unleashed a series of spelling and fact-challenged tweets aimed at pinning responsibility for unprecedented bloodshed on Mayor Rahm Emanuel.", "\"63 murders this weekend in Rahm Emmanuel’s Chicago,\" wrote Giuliani, the former New York mayor. \"His legacy [is] more murders in his city than ever before.\"", "63 murders this weekend in Rahm Emmanuel’s Chicago. His legacy more murders in his city than ever before. It’s only because of Democrat brain washing that he has even a chance of remaining. Support police professional Garry McCarthy.", "No and no.", "Giuliani’s attack was framed around an attempt to give a shout-out to one of Emanuel’s expected challengers in next year’s mayoral election, Garry McCarthy, the former Chicago Police superintendent fired by Emanuel in 2015. Except Giuliani misidentified McCarthy as \"Jerry\" instead of Garry.", "\"Chicago murders are direct result of one party Democratic rule for decades,\" Giuliani wrote, apparently unaware that McCarthy contends he is a Democrat. \"Policing genius Jerry McCarthy can do for Chicago what I did for NYC.\"", "Chicago murders are direct result of one party Democratic rule for decades. Policing genius Jerry McCarthy can do for Chicago what I did for NYC. He was one of the architects of Compstat. Slashed homicides over 70%. Tens of thousands of lives saved.", "There’s no question that gun violence remains a great challenge for Chicago, but Giuliani’s claims don’t come close to squaring with reality. Preliminary media reports of the weekend carnage referred to 63 shot, not 63 dead.", "The figure has since been updated. A spokeswoman for the Chicago Police Department said Monday afternoon that a total of 66 people had been shot between 6 p.m. on Friday and midnight Sunday, 12 of them fatally.", "That is, undoubtedly, 12 too many, though it also important to note the number of homicides this year are down substantially from 2016 when murders spiked to a two-decade high.", "To put Giuliani’s claim in perspective, 63 gun-related deaths would be greater than the toll in last October’s mass shooting in Las Vegas where a gunman using high-powered weapons claimed 58 lives.", "The second beat of Giuliani’s tweet holds up no better. The city suffered 762 murders in 2016, the highest number of Emanuel’s tenure. Still, that is well below the Chicago record of 970 in 1974. Murders also topped well over 900 during several years in the 1990s.", "The weekend death toll decried by Giuliani was hardly a record, either. On an October weekend in 2016, 17 people were killed in shootings.", "In 2014, when McCarthy was still running the Chicago police, 13 people were killed and at least 58 wounded during the July 4th weekend despite the deployment of hundreds of extra officers on the streets.", "Giuliani is hardly the first in Trump’s orbit to to use distorted claims to pick at Chicago’s lamentably persistent rate of gun violence. The president, his spokesperson and his attorney general have all at various times contended that the carnage persists despite the city having the toughest gun laws in the nation. It does not, and we have repeatedly rated such claims as Pants on Fire!", "The tweet storm from Giuliani fits into that pattern.", "There were too many shooting deaths in Chicago over the weekend, but nowhere near 63. And murders in Chicago began surging in 2016, but the numbers are still well below the city record of 970 set decades ago. The murder tally, while high under Emanuel, is nowhere near the worst in city history.", "It is possible Giuliani may have confused shootings with murders. Or, he may have simply been misinformed. Or, he may have made it all up. It’s impossible to tell, though it is worth noting that Giuliani’s numbers were quickly and widely called into question by news reports yet he did not seek to clarify them or delete his tweets.", "But Giuliani is not only a former New York mayor, he was also once a crime-busting U.S. attorney in that city. If anyone should have a feel for what is real and unreal when it comes to urban violence, it’s Giuliani.", "Yet he disseminated a wildly exaggerated claim, and that is why we rate it Pants on Fire!", "\"66 shot, 12 fatally, in Chicago weekend shootings,\" ABC 7, Aug. 6, 2018", "\"SAUER subject of Lake County probe — WRIGLEY joins the pot biz — A BLUHM donates to RAUNER— Politics meets MURDER in a WBEZ exclusive,\" Politico Illinois Playbook, Aug. 6, 2018", "Phone interview: Officer Jennifer Bryk, spokeswoman for the Chicago Police Department, Aug. 6, 2018", "Chicago Homicides Data Tracker, Chicago Tribune, accessed Aug. 6, 2018", "\"2016 ends with 762 homicides; 2017 opens with fatal Uptown gunfight,\" Chicago Tribune, Jan. 2, 2017", "\"1974 was a deadly year in Chicago,\" Chicago Tribune, July 8, 2012", "\"39,000 homicides: Retracing 60 years of murder in Chicago,\" Chicago Tribune, Jan. 9, 2018", "\"17 killed as Chicago sees deadliest weekend of the year,\" USA TODAY, Oct. 31, 2016", "\"13 dead, at least 58 wounded over holiday weekend,\" Chicago Sun-Times, July 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]