["The 30-second video was published here on Facebook post on November 20, 2020.", "The caption of the post reads: “A ceremony at the White House in America. A very exciting scene. Ahead of the first entry of Joe Biden as President to the White House, they chanted Sanskrit slokas with great devotion, invoking the Almighty to usher in a new era of peace, development and good governance. We have a lot to learn from them.”", "Sanskrit is an ancient Indo-Aryan language mostly spoken on the Indian subcontinent. Many sacred texts in Hinduism have been written in the form of Sanskirt ‘slokas’, or poetry.", "Joe Biden was declared the winner of the 2020 US presidential election on November 7. As of December 1, incumbent President Trump has refused to concede and continues to make baseless claims of election fraud, as reported here by AFP.", "The same video was also shared here, here, here and here on Facebook, alongside similar claims.", "However, this claim is false.", "A reverse image search on Google using keyframes extracted with InVID-WeVerify, a digital verification tool, found a longer version of the video published here on Facebook, dated October 15, 2014.", "The video description reads, in part: “Rudram Chanting @the White House by the American DUO... Jeffrey Erhard and Robbie Erhard started off the fourth annual Hindu American Seva Communities Conference with the first anuvakam of Sri Rudram Namakam. Celebrating Mahatma Gandhi's 145th birth anniversary at the White House on October 2nd 2014. This is the Hindu American Seva Communities fourth annual conference.”", "Mahatma Gandhi is an Indian independence icon, assassinated in New Delhi in 1948.", "Below is a screenshot comparison of the video in the misleading posts (L) and the 2014 Facebook video (R):", "The Hindu American Seva Communities referenced in the video description also published this notice about the October 2, 2014 event at the White House here on their website. They also published a video of the event, taken from a different angle, here on their YouTube page in October 2014.", "The event was also reported on by the US news outlet HuffPost here in October 2014.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]