["This post has been shared on Facebook 1,200 times since February 24, 2021.", "The post features various photos of former Pakistani prime minister Nawaz Sharif and his late mother Shamim Akhtar, who died in November 2020. One photo shows Akhtar appearing to affectionately touch her son’s cheek, while another picture shows Sharif standing with her coffin along with other family members.", "The Urdu-language text across the photos translates in English as: “Nawaz Sharif’s stomach cannot be filled with anything in the world because he had gotten his old mother elected on women-reserved seats so that money should come due to her.”", "The caption on the Facebook post claims that Akhtar was a Member of Provincial Assembly (MPA) for Pakistan’s Punjab province on a seat reserved for women under her son’s Pakistan Muslim League (Nawaz) party from 2013 to 2018.", "“She used to draw a salary and all the perks and she was 91 years old then. PML-N supporters, tell us truly who was aware of this? In how many ways this family has looted the treasury of this country,” it reads in part.", "Three-time prime minister Nawaz Sharif was ousted over corruption allegations in 2017 and is currently residing in Britain after being released from prison for medical treatment, as AFP reported.", "The claim that Sharif’s late mother was shared hundreds of times on Facebook and Twitter, including here, here and here.", "However, the claim is false. While various women named Shamim Akhtar have served as MPAs in the Punjab provincial assembly, none of them are Sharif’s late mother.", "The online records of members of the Punjab provincial assembly show three women with ‘Shamim Akhtar’ in their names.", "A woman named Ms. Shamim Akhtar Rana remained a lawmaker from 2002-2007 for PML-N. Another woman born on January 1, 1965 and named Mrs. Shamim Akhtar also served as a lawmaker between 2002-2007. Mrs.‏ Shamim Akhtar Alias Shahazadi Kabir was the lawmaker between 2013-2018 and she was born on March 9, 1954.", "A Wikipedia page entitled ‘Shamim Akhtar’ refers to a person who was both the late mother of Nawaz Sharif and  served as an MPA in the Punjab provincial assembly from 2013 to 2018.", "However, a search of the page’s edit history reveals that the Wikipedia page was originally that of a genuine Punjab MPA, and that reference to Sharif’s late mother was added on February 24, 2021.", "This is around the time that misleading social media posts began spreading the false claim.", "Sharif’s late mother was not politically active and she remained away from the media spotlight most of her life.", "Contacted by AFP, a spokesman for Sharif denied the claim.", "\"There is no truth in this. Nawaz Sharif’s mother was not an MPA,\" Mohammad Zubair, said on March 1, 2021 in a WhatsApp message.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]