["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Alabama Sen. Jeff Sessions, one of the earliest congressmen to back Donald Trump, echoed Trump’s critique of Hillary Clinton’s trade agenda at the Republican National Convention in Cleveland.", "\"She has been a champion of globalist trade agreements,\" Sessions said during the convention’s opening night. \"But the facts are in. They have not worked for the American people.  When those agreements were signed, Presidents (Bill) Clinton and Obama promised our dangerous trade deficits with China and Korea would be reduced. But, the deficit with China has increased fivefold and the deficit with Korea doubled. These are job-killing numbers. They are now pushing the disastrous 5,000-page ‘Obamatrade’ — the Trans-Pacific Partnership agreement.\"", "This sounds like a variation of Trump’s claim (parroted from Clinton’s Democratic primary, Bernie Sanders): \"Hillary Clinton voted for virtually every trade agreement that has cost the workers of this country millions, millions of jobs. \"", "Both Sanders and Trump received Half True ratings for their claims, but Sessions’ claim is less accurate. He’s painting Clinton’s position on free trade with an overly broad brush and is just plain wrong on her supporting for the Trans-Pacific Partnership, or TPP.", "In reality, Clinton has zigzagged through the years when it comes to free trade. From 1993 to 2016, she supported eight deals, opposed two, flip-flopped from opposing to supporting three, and flip-flopped the other way on two others.", "Clinton as first lady spoke favorably in the 1990s and 2000s of the North American Free Trade Agreement. (Sessions is right NAFTA was signed into law by President Bill Clinton, but he neglected to mention that the deal was envisioned by Republican Presidents Ronald Reagan and negotiated by George H. W. Bush).", "As a senator from New York, Clinton had the opportunity to vote on 10 trade deals. She said yes to six and no to the Dominican Republic-Central America Free Trade Agreement (DR-CAFTA) and a deal with Andean countries. She skipped the votes on agreements with Jordan and Peru, which came up when she was running for president the first time, but supported both deals.", "As a presidential candidate in 2008, Clinton had different opinions on various trade deals, and she changed her position on NAFTA. She called NAFTA \"a mistake\" and opposed pending deals with South Korea, Colombia and Panama. She reiterated her support for free trade with Peru on the campaign trail.", "As secretary of state, Clinton walked back her opposition to deals with South Korea, Colombia and Panama, and helped negotiate them as well as the Trans-Pacific Partnership.", "But as a presidential candidate in 2016, Clinton has reiterated her opposition to CAFTA and flip-flopped on her support for the Trans-Pacific Partnership.", "Here’s a breakdown:", "Our ruling", "Sessions said Clinton \"has been a champion of globalist trade agreements. ... Worst of all, they are now pushing the disastrous 5,554-page Obamatrade — the Trans-Pacific Partnership agreement.\"", "Clinton has largely supported free trade deals, but calling her a \"champion\" of them goes too far. Out of the 15 trade deals that she’s commented or voted on from 1993 to 2016, she currently opposes four of them, including the Trans-Pacific Partnership deal that Sessions singled out.", "We rate Sessions’ claim Mostly False.", "https://www.sharethefacts.co/share/66f39bcc-aed2-45b1-9d58-641cdff013eb", "PolitiFact, \"Clinton voted for 'virtually every' trade agreement, killing millions of jobs, Sanders says,\" Apri 10, 2016", "PolitiFact, \"Donald Trump quotes Bernie Sanders' Half True claim about Clinton, free trade,\" June 29, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]