["About this rating", "In March 2003 an updating of the venerable Do You Know Who I Am? legend began appearing in inboxes everywhere:", "Star 100.7 was doing one of their \"is anyone listening who\" bits this morning. The first one was, ever have a celebrity pull the \"Do you know who I am\" routine. A lady called in and said that when she was visiting her cattle rancher Uncle in Billings, MT a few years ago, they went to dinner at a restaurant that does not take reservations. The wait was about 45 minutes. Lots of other rancher types and spouses already waiting. In comes Ted Turner and Jane Fonda. They want a table. The hostess says they'll have to wait about 45 minutes.", "Jane asks if she knows who she is. \"Yes, but you'll still have to wait 45 minutes.\"", "\"Is the manager in?\" she says.", "The manager comes out, \"May I help you?\"", "\"Do you know who I am?\", ask both Jane and Ted.", "\"Yes, but these folks have all been waiting already and I can't put you in ahead of them.\"", "Then Ted asks to speak to the owner. The owner comes out. Jane again asks \"Do you know who I am?\"", "The owner says \"Yes, I do. Do you know who I am? I am the owner of this restaurant — and a Vietnam veteran. Not only will you not get a table ahead of all my friends and neighbors here, you also will not be eating in my restaurant tonight or any other night. Good bye.\"", "Would Jane Fonda attempt to play the \"Do you know who I am?\" card if she weren't being seated quickly enough to suit her tastes? Though it's tempting for many people to believe anything of the woman dubbed \"Hanoi Jane,\" there's not much to support the story other than the tellers' desire to believe it of her. (Ted Turner, from whom Fonda was divorced in 2001 after ten years of marriage, does own a number of ranches, including one in Montana.)", "Arguing against the story's premise is what Fonda herself said in 1994:", "\"If you're ever in a situation where you're not getting served or you can't get what you need, just cry,\" she recommends. Fonda, who attended the Goodwill Games in Russia with her husband, Ted Turner, said she tried the crying game when an elevator operator in Moscow was too busy reading a letter to take her upstairs, and once again when she couldn't get served in a restaurant. Worked every time.", "Specifically, the folks at Sir Scott's Oasis Steakhouse in Manhattan, Montana, where most versions of this e-mail claim the incident occurred, told us that although Jane Fonda had indeed been in their restaurant, she simply said she had to leave when she was told how long the wait was — Ms. Fonda engaged in no indignant \"Do you know who I am?\" histrionics, nor did she summon the owner to deliver a defiant \"You're never eating in my restaurant!\" put-down.", "Self-important celebrity tales are nothing new; they're a common way of capturing by way of a fable how society feels about particular media darlings who have earned condemnation by their insufferable acts. Another example of the genre is the legend which attached to cooking queen Martha Stewart, who supposedly also tried her hand at the \"Do you know who I am?\" game with deservedly disastrous results. But no matter how the tale is framed or whom it features, its underlying purpose is to convey by way of story-telling a society's opinion about someone it doesn't like.", "In October 2004, as that year's presidential race heated up, this story resurfaced as a John and Teresa Kerry anecdote:", "The radio station America FM was doing one of their \"Is anyone listening\" bits this morning. This first one was, \"Ever have a celebrity pull up and say 'Do you know who I am?' routine.\"A woman called in and said that several months back, while visiting her cattle rancher uncle in Billings, MT., they had occasion to go to dinner at a restaurant that does not take reservations. The wait was about 45 minutes. Lots of other rancher types and their spouses were already waiting. In comes John Kerry and Teresa Heinz Kerry. They wanted a table. The hostess says they'll have to wait about 45 minutes.", "Teresa Heinz Kerry asks the hostess if she knows who she is. \"Yes, but you'll still have to wait 45 minutes.\" Then Teresa says, \"Is the manager in?\" The manager comes out, \"May I help you?\" Do you know who I am?\" asks Teresa.\" Yes, but these folks have all been waiting already and I can't put you in ahead of them.\" Then John asks to speak to the owner.", "The owner comes out. John asks, \"Do you know who I am?\" The owner says, \"Yes, I do. Do you know who I am? I am the owner of this restaurant and a POW during the Vietnam War. Not only will you not get a table ahead of all of my friends and neighbors here, but you also will not be eating in my restaurant tonight or any other night. Good bye.\" Only in America, what a great country!", "To all who received this e-mail. This is a true story and the name of the steak house is:", "Sir Scott's Oasis Steakhouse204 W MainMANHATTAN, MT 59741", "Caen, Herb.   \"3-Dot Journalism Is Dead.\"\r\n    The San Francisco Chronicle.   9 June 1993   (p. B1).", "Romano, Lois.   \"The Reliable Source.\"\r\n    The Washington Post.   4 August 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]