["By Robert Farley", "Posted on November 5, 2019", "A number of national polls show more Americans want President Donald Trump impeached and removed from office than those who don’t. In swing states, however, a majority opposes removing Trump from office via impeachment, even as a majority supports moving forward with the impeachment inquiry.", "Those are the polling statistics that Trump twisted over the weekend when he accused the media of “reading the wrong polls” and said that “people don’t want anything to do with impeachment.”", "In remarks to the press on Nov. 2 and Nov. 3, Trump tried to keep the focus not on national polling, but more narrowly on only polls in swing states.", "Trump, Nov. 2: If you look at what’s happening, if you look at the poll numbers, if you look at the poll numbers in the swing states, they’re saying, “Don’t do this. Don’t do it.”", "Trump, Nov. 3: The impeachment polls have been very, very strong — and especially in the swing states, I think you see that.  The swing states — they don’t want to hear about it.  And we have polls — people don’t want to hear about impeachment. The only one that wants impeachment — to talk about it — is the fake media and the Democrats, who — basically, they work for the media", "When Trump says the public polled in swing states is saying, “Don’t do it,” that depends on if “it” means moving forward with the impeachment inquiry, or impeaching and removing Trump from office.", "According to a New York Times/Siena College poll released on Oct. 30, majorities in six battleground states — Arizona, Florida, Michigan, North Carolina, Pennsylvania and Wisconsin — oppose impeaching and removing Trump (52%-44%). (The battleground poll has a margin of error of 1.7 percentage points.) A Trump campaign official seized on those findings, telling The Hill that while large percentages in Democratic states like New York and California support impeachment, “in these states where the election is really going to be fought, we’re seeing that voters oppose impeachment, and there’s an intensity to that opposition.”", "William Galston, a senior fellow at the Brookings Institution, wrote about the divergence between national and swing-state opinion, noting, “As we know, presidential elections are made in the electoral college on a state-by-state basis … which is why it is important to look at public opinion by state.”", "Notably, though, that same poll shows that while a majority does not support removing Trump via impeachment, about the same percentage, 51%, supports the impeachment inquiry being conducted by the House (44% oppose it). That contradicts Trump’s claim that most “don’t want to hear about it” and don’t want to “talk about it.”", "Democrats have acknowledged that public sentiment is a key part of the impeachment process.", "“Public opinion is everything,” Rep. Terri Sewell said on NBC’s “Meet the Press” on Nov. 3. “Speaker Pelosi often quotes Thomas Jefferson, that it’s all about public sentiment. So having said that, I think it’s really important that we present in a deliberate fashion.”", "Nationally, public sentiment is more pro-impeachment than it is in just swing states. According to the Real Clear Politics average of recent polls, a plurality of voters, 48.1%, support impeachment and removing Trump, while 44.9% do not. That’s an average of many polls, including recent polls from NBC News/Wall Street Journal, ABC News/Washington Post, Fox News, Economist/YouGov, Politico/Morning Consult, USA Today/Suffolk, Grinnell College/Selzer, Quinnipiac and CNN.", "A slightly larger percentage, 50.9%, supports the House moving forward with an impeachment inquiry (42.3% oppose).", "The FiveThirtyEight impeachment poll tracker reports similar results: 50.4% support beginning the impeachment process, while 41.2% do not; and 48.1% say Trump should be impeached or impeached and removed, while 44.6% don’t support that.", "Those national polling figures got lost in comments Trump made to reporters on Nov. 3, when a reporter asked — correctly — about the fact that “according to several recent polls, more Americans want you to be impeached and removed from office than the number of Americans who don’t.”", "“Well, you’re reading the wrong polls,” Trump responded.  “You’re reading the wrong polls.”", "The reporter, again rightly, noted that included polls conducted by Fox News, the NBC/Wall Street Journal and ABC/Washington Post.", "“Let me just tell you, I have the real polls,” Trump said. “The CNN polls are fake. The Fox polls have always been lousy. I tell them they ought to get themselves a new pollster. But the real polls — if you look at polls that came out this morning — people don’t want anything to do with impeachment.”", "We reached out to the White House to find out what polls Trump was referring to, and whether that was from internal polling, but we did not receive a response. Perhaps the Trump reelection campaign has internal polls that show something different. But the majority of national public polls do not support Trump’s claim that “people don’t want anything to do with impeachment.”", "On CNN’s “State of the Union,” Democratic Rep. Jim Clyburn was asked about House Speaker Nancy Pelosi’s comment to the Washington Post back in March. “Impeachment is so divisive to the country that unless there’s something so compelling and overwhelming and bipartisan, I don’t think we should go down that path, because it divides the country,” Pelosi said.", "CNN’s Dana Bash noted that the House this week passed a resolution to approve procedures on impeachment, but got not a single Republican vote.", "Clyburn said “when we talk about bipartisan support, we are not limiting that to the Congress. I have been watching the polls all over the country. There is rising support within Republican voters in favor of moving forward. Independents seem to be — a majority of them seem to be in favor of moving forward, and certainly overwhelmingly Democrats.”", "According to the Real Clear Politics average of recent polls, just 12% of Republicans support the impeachment inquiry, while 83.2% oppose it. Among independents, 46.8% support an impeachment inquiry, while 38% oppose it. So, a plurality of independents support it, but not a “majority,” as Clyburn said. Among Democrats, 84.8% support an impeachment inquiry, and 8.8% oppose it.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]