["Gubernatorial candidate Tom Pauken of Port Aransas says that unlike ruling Republicans, he knows how to be tough on spending.", "In an Austin American-Statesman oped column posted online July 25, 2013, Pauken wrote: \"There are a number of areas where I differ with the direction that Texas is headed. Our recent state budgets have far exceeded population and inflation growth. ...I will veto any budget which exceeds that criteria.\"", "We’ll take that as Pauken’s promise.", "And have recent state budgets \"far exceeded\" inflation and population growth?", "Pauken’s campaign spokesman, Joe Gimenez, told us by email that Pauken based his claim on a June 7, 2013, Wall Street Journal editorial stating that Texas lawmakers this year agreed to increase spending by a whopping 26 percent, per research by the conservative Texas Public Policy Foundation.", "We spotted flaws in the foundation’s analysis while recently rating as Mostly True a counter-claim by Gov. Rick Perry that the 2014-15 budget he signed into law did not outpace projected population and inflation growth.", "The foundation did not contrast the latest two-year budgets. Instead, it compared spending approved by lawmakers in 2013 for the rest of this fiscal year plus spending budgeted for two more years to spending approved by lawmakers and Perry in 2011.", "For our part, we concluded that general revenue, or state, spending is budgeted to increase no more than 8.7 percent through August 2015. That is less than a 9.85 percent increase in population and inflation projection embraced by legislative leaders before the 2013 session, though officials also have mulled lower population growth/inflation predictions.", "Most authorities agree it makes sense to focus on general revenue because it’s directly under the Legislature’s control -- it comes from taxes and fees set by the state, not the federal government, and how such revenue is spent also is not controlled by dedications in the Texas Constitution.", "If the 2014-15 budget isn’t expected to outpace population growth/inflation, what of recent budgets?", "The latest Fiscal Size-Up report from the advisory Legislative Budget Board, issued in January 2012, includes a chart suggesting that \"all funds\" spending usually exceeded population and inflation growth from 2002-03 through 2012-13.", "However, the report’s Figure 22 indicates, general revenue spending usually ran short of population and inflation growth.", "Specifically, spending of all funds adjusted for population and inflation growth increased as little as 0.4 percent (from 2002-03 to 2004-05) to as much as 9.9 percent (from 2006-07 to 2008-09).", "All spending adjusted for population and inflation growth went down by nearly 15 percent in 2012-13, according to the chart. By telephone, though, budget board staff spokesman John Barton cautioned that legislative actions in 2013  will soon result in updates to the 2012-13 spending totals, changing the percentage growth.", "According to the report’s chart, state spending alone, adjusted for inflation and population growth, went up 2.5 percent from 2004-05 to 2006-07 and 10.8 percent from 2006-07 to 2008-09. Conversely, state spending adjusted for population and inflation decreased in four recent budgets: 2002-03 (down 0.3 percent); 2004-05 (down 9.6 percent); 2010-11 (down 5.9 percent); and 2012-13 (down 8.4 percent).", "The public policy foundation has said that by its calculations, state appropriations have greatly outpaced population growth plus inflation.", "When its conclusions were aired in 2012, though, the Statesman said in a Nov. 15, 2012, news story that the budget board said the foundation was inflating spending growth by starting its count in 1990, the year before the state’s last major tax increase took effect.", "The story quoted the budget board as saying that Texas' total budget had increased 176 percent over two decades, but \"that number drops to an average rate of 1.5 percent per budget biennium when adjusted for population growth and inflation. In fact, when federal dollars are taken out of the equation, the adjusted state spending has decreased by 2.6 percent over the same period of time, according to a budget board analysis.\"", "We asked Lori Taylor, an associate professor in the Bush School of Government and Public Service and an adjunct associate professor in Texas A&M University's Department of Economics, to pinpoint distinctions between the calculations of the foundation and budget board. By email, Taylor said the biggest difference lies \"in the way the two sources adjust for population growth. Although people who want to make a political point do it all the time, you shouldn’t just add the inflation rate and the population growth rate and call that the baseline. You should calculate the expenditures per capita and then apply an inflation adjustment like the\" Consumer Price Index \"to get to the real (i.e. inflation-adjusted) growth in spending.\" She said if this approach is taken with the foundation figures, the long-term results align with the budget board’s math.", "Talmadge Heflin, director of the foundation’s Center for Fiscal Policy, had no objections to Taylor’s math, but stood by the foundation’s approach. \"Different chefs cook differently,\" he said by phone.", "Our ruling", "Pauken said recent state budgets have far exceeded population and inflation growth.", "Spending of all funds, which folds in federal aid, exceeded population and inflation growth in five of six recent Texas budgets. Adjusted for those factors, the two-year budgets went up as little as 0.4 percent to nearly 10 percent. And while total spending trailed population growth/inflation in 2012-13, that conclusion could change once number-crunchers account for final spending decisions by the 2013 Legislature.", "In contrast, state spending alone, over which lawmakers have the most direct control, trailed population growth and inflation in four of the six two-year budgets from 2002-03 through 2012-13--and it’s not expected to exceed inflation/population growth through August 2015.", "We rate this claim, which has an element of truth but ignores critical facts giving a more meaningful impression, as Mostly False.", "Truth-O-Meter article, \"Rick Perry says the 2014-15 Texas budget increases spending by less than the rate of inflation and population growth,\" PolitiFact Texas, June 21, 2013", "Report, \"Fiscal Size-Up, 2012-13 Biennium,\" January 2012 (accessed July 26, 2013)", "Telephone interview, John Barton, staff spokesman, Legislative Budget Board, July 29, 2013", "Telephone interview, Joe Gimenez, communications director, Tom Pauken campaign, July 29, 2013", "Policy brief, \"Update: Trends in Texas Government  State Government Spending,\" Center for Fiscal Policy, Texas Public Policy Foundation, April 19, 2012", "News story, \"Perry, allies look to tighten state spending cap,\" Austin American-Statesman, Nov. 14, 2012", "Email, Lori L. Taylor, associate professor, George H.W. Bush School of Government and Public Service, adjunct associate professor, Department of Economics, Texas A&M University, July 30, 2012", "Telephone interview, Talmadge Heflin, director, Center for Fiscal Policy, Texas Public Policy Foundation, Austin, July 30, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]