["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This photo July 25, 2018 file photo shows Donald Trump's star on the Hollywood Walk of Fame that was vandalized, in Los Angeles. (AP)", "The claim that Hollywood is organizing an anti-Trump strike has been circulating online since he was elected. Fact-checking outlets have debunked versions of the hoax.", "There is still no evidence that movie stars are organizing a strike until Trump is removed from office.", "Those Trump-hating Hollywood liberals are at it again, according to a fake news article shared on Facebook.", "The story, which was published on a website called News Mag on April 3, claims that movie stars like Rosie O’Donnell and George Clooney have organized a strike, until President Donald Trump is removed or voted out of office.", "\"Portraying Hollywood as ‘the base of the entire current American culture’, the gathering likewise claims to speak for the advantage of ‘all of humankind,’\" reads the article, which has been shared in conspiracy theory and pro-Trump Facebook groups.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from NewsMag.pro)", "Plenty of Hollywood stars have been outspoken in their criticism of Trump. But there is no evidence entertainment celebrities are organizing a strike until he’s removed from office.", "According to public domain records, News Mag was registered on March 18. We found several copies of the Hollywood strike article on other bogus websites posing as legitimate news organizations.", "The claim that Hollywood is organizing an anti-Trump strike has been circulating online since he was elected. Other fact-checking outlets, including PolitiFact, have debunked versions of the hoax.", "The rumor appears to have stemmed from a January 2017 ad in the New York Times by a group called Refuse Fascism. The group included O’Donnell and called for millions to hold a protest and sign a petition to \"create a political crisis that prevents the Trump/Pence fascist regime from consolidating its hold on the governance of society.\"", "Many celebrities signed the petition, but they weren’t calling for a strike. And we could find no evidence to support the latest version of the hoax.", "The article is inaccurate. We rate it False.", "Factcheck.org, \"Hollywood Strike Hoax,\" May 24, 2017", "Fox News, \"Hollywood stars react to Trump's acquittal: 'Pure corruption,’\" Feb. 5, 2020", "Lead Stories, \"Fake News: These 4 Celebrities Did NOT Call For 'Total Hollywood Strike' Until Trump Resigns,\" March 27, 2018", "News Mag, \"CELEBRITIES CALL FOR ‘TOTAL HOLLYWOOD STRIKE’ UNTIL TRUMP RESIGNS,\" April 3, 2020", "PolitiFact, \"Hollywood celebs didn't announce strike if Donald Trump won't resign,\" Jan. 9, 2018", "Refuse Fascism, Ad in the New York Times, Jan. 4, 2017", "Refusefascism.org, \"Congress Certifies Trump. Growing 1000s Say NO! Vow To STOP Trump/Pence Fascist Regime Before It Starts!\" Jan. 6, 2017", "Whois.com, accessed April 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]