["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Austin mayoral hopeful Mike Martinez says his opponent in a December 2014 runoff conceded his law firm helped out Koch Industries, the Kansas-based conglomerate owned by billionaire brothers Charles and David Koch whose backing of conservative causes probably doesn’t play well among the city’s preponderance of Democratic voters.", "Martinez told reporters Nov. 12, 2014: \"Last night, Steve Adler admitted his law firm worked with Koch Industries for nearly a decade. But Steve Adler still hasn’t come clean about what work his law firm did for the Koch Brothers, and how much money they made from it.\"", "By email, Martinez campaign spokesman Nick Hudson said Martinez was referring to Adler telling KVUE-TV, Channel 24 in Austin, for a news story aired Nov. 11, 2014: \"My understanding from talking to my law partner is that back in the ‘70s and into the ‘80s, he did some work advising Koch on some cases; I was not involved in any of those.\"", "Martinez told KVUE: \"If his law firm benefited from working with the Koch brothers, then he benefited from working with the Koch brothers.\"", "Web pages", "There’s no Koch mention on the website for Barron & Adler LLP, where Adler is described as a co-founding partner. The firm, which focuses on eminent domain and condemnation issues, came to be in 1983, which would have been the year after Adler graduated from law school.", "Martinez pointed out a description of Adler’s firm that listed Koch Industries among the firm’s \"representative clients\" until it was amended shortly before the Nov. 4, 2014, election that launched Adler and Martinez toward their runoff. Martinez said his campaign’s copy of the FindLaw.com entry listing Koch Industries was downloaded in October 2014.", "We spotted a similar Koch notation in a FindLaw.com web page for Adler’s firm downloaded by the online Wayback Machine in December 2003. Aside from Koch Industries, proclaimed clients at the time included: May Department Stores, Inc.; McDonald's Corp.; Nations Bank; Sears, Roebuck & Co.; Southland Corp.; Trammell Crow, and Weingarten Realty Investors. And separately at our request, researchers at the Texas State Law Library checked legal directories from the 1980s and emailed us a 1989 Martindale-Hubble Law Directory entry listing Koch Industries among a dozen representative clients of the Austin law firm Barron, Graham & Adler.", "So, Adler’s firm previously wanted it known it did work for Koch Industries.", "Attorney interviews", "Seeking detail about the firm’s Koch work, we spoke by phone with Adler; attorney Mike Barron, described like Adler as a founding partner of the firm; and lawyer/mediator Sam Graham, formerly with the firm.", "Adler reaffirmed he personally never worked with a Koch company, though he said he believes Barron and possibly another lawyer helped a Koch entity in the 1970s and, he thinks, early-to-mid 1980s. Adler said that after he graduated from law school, he worked for another firm for a year and then did work for the firm which he joined in 1984 or 1985.", "Generally, Adler told us, his understanding is Koch was asking for the firm’s advice on acquiring pipeline easements in Texas off and on over about a decade.", "Barron and Graham said in separate interviews Koch enlisted the firm for a spell in the mid-1980s because it wanted to build a private pipeline to carry jet fuel from the Gulf coast near Corpus Christi to San Antonio, Austin, Waco and Dallas/Fort Worth. Koch, Barron said, \"hired us to shepherd them through\" buying rights-of-way from landowners along the desired route. Graham said the firm also was committed to filing eminent-domain lawsuits for Koch if needed to access the desired land. But, Graham said, Koch succeeded in negotiating the rights-of-way without having to go to court.", "Barron said Koch paid the firm a retainer of about $2,500 or $5,000 and the firm billed monthly against the retainer for its services. He said its advisory work started in 1984 and ended in 1985 or started in 1985 and ended in 1986.", "Graham said the firm probably made less than $10,000 from the work, which he said took place in 1985 or 1987.", "Adler might not have been employed by the firm when the Koch work started, Barron and Graham each said, and he was not involved in the Koch work. \"Steve never touched the file,\" which no longer exists, Barron said. \"I did it all.\"", "Koch spokesman singles out Barron", "To our queries, a Washington, D.C.-based Koch spokesman, Rob Tappan, said by email Barron was the only person at the firm that Koch worked with as it acquired the rights-of-way. Tappan said the pipeline, built in the late 1980s, carries gasoline, diesel and jet fuel from Corpus Christi to the Dallas/Fort Worth area with terminals in San Antonio, Austin and Waco.", "Our ruling", "Martinez said Adler admitted his law firm worked with Koch Industries for nearly a decade.", "We’re not judging here whether the firm’s work means anything about Adler vis a vis the Koch brothers and their views. But Adler did say his firm did work for Koch for a number of years, though other lawyers and Koch say the advisory work occurred over a few years. Also, like Adler, they say Adler had no role.", "We rate Martinez's claim -- which relies on Adler perhaps overstating the Koch activities -- Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Entry for Barron, Graham & Adler law firm in Martindale-Hubble Law Directory, 1989 (received by email from Ruth Harrison, reference librarian, Texas State Law Library, Nov. 12, 2014)", "Email, Nick Hudson, political director, Mike Martinez campaign, Nov. 12, 2014", "Telephone interview, Steve Adler, Austin, Nov. 12, 2014", "Telephone interview, Mike Barron, founding partner, Barron & Adler, LLP, Austin, Nov. 13, 2014", "Telephone interview, Sam Graham, mediator, Austin, Nov. 13, 2014", "Emails, Rob Tappan, director, External Relations, Koch Companies Public Sector, LLC, Koch Industries, Nov. 12-13, 2014", "Web page, \"Koch Pipeline Company Facts,\" Koch Pipeline Co. (accessed Nov. 13, 2014)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]