["Two images of health minister Dr Harsh Vardhan have gone viral. The first image shows him playing ludo with his wife and the other shows him chopping vegetables in a jovial mood. Several Facebook and Twitter users have shared the images while questioning his behaviour during the nationwide lockdown due to coronavirus pandemic.", "In addition to social media users, this image was tweeted by Congress member Pankaj Punia. He wrote, “Meanwhile, Health Minister Dr Harsh Vardhan is in full form. Watching his brilliant game, he won for 12th consecutive time in ludo. Congratulations! If there’s a minister, it should be like him! (Translated from इस बीच हेल्थ मिनिस्टर डॉ हर्षवर्धन फुल फॉर्म में हैं। शानदार खेल दिखाते हुए,लूडो में लगातार 12वीं बाजी जीती। बधाई मिनिस्टर हो तो ऐसा हो!)” (archive link)", "Just like Punia, the Twitter handle of All India Parisangh, an organisation formed by India National Congress member Udit Raj, tweeted the viral image (archive link). Raksha Ramaiah who handles social media at Indian Youth Congress also tweeted the viral image. His tweet was retweeted over 1,200 times (archive link).", "Mahendra Yadav, newsreader/editor at All India Radio News, posted the viral image along with the Hindi text same as Punia’s tweet. Yadav’s post was shared over 450 times (archive link). Similarly, Twitter handle @Kill_BillPandey also posted the viral image which was retweeted over 580 times (archive link).", "Alt News performed a keyword search on Google and found that the viral image was published by The Tribune on March 13, 2019.", "According to The Tribune, the image shows Dr Harsh Vardhan relaxing after Lok Sabha polls. The image is clicked by photographer Mukesh Aggarwal.", "Twitter handle @BhaktUnofficial posted two images where the one on the left shows a man wearing a medical mask talking to health workers. The text above the image reads “Health Minister of Maharashtra”. On the right, there is an image of Dr Vardhan chopping vegetables. The text above this photo reads ‘Heath Minister of India’. This tweet has been retweeted over 1400 times. (archive link)", "Alt News performed a reverse image search on TinEye and found that the viral image was published by Livemint on December 8, 2013. The article is a photo essay on Dr Vardhan after Delhi Legislative Assembly elections.", "Therefore, both the photographs do not represent Dr Harh Vardhan during the coronavirus pandemic and have been shared with misleading captions trying to portray him apathetic toward the coronavirus pandemic.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]