["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Bernie Sanders campaign ad, which regularly aired in Iowa and most recently in Nevada, tries to make a point that hard-working people have been falling behind economically.", "\"If you're doing everything right but find it harder and harder to get by, you're not alone,\" Sanders says. \"While our people work longer hours for lower wages, almost all new income goes to the top 1 percent.\"", "We wanted to check the three claims wrapped up in that last sentence. Are Americans working longer hours, are their wages lower, and is almost all new income going to the richest?", "Sanders doesn't specify a time frame, which complicates matters somewhat, and his campaign wouldn't give us one, despite repeated inquiries.", "The background graphic, depicting skyrocketing income among the top 1 percent, comes from a 2013 blog post by Pew Research. The Pew graphic is clearly labeled to note that the data cover 1917 to 2007. That labeling is gone from the Sanders commercial, although both the Pew and Sanders version mark 1980, a reasonable starting point for a dramatic income growth among top earners.", "We'll start there and consider the three claims individually.", "Hours", "The work week has been steadily declining, not increasing, over the past five decades, according to data from the Bureau of Labor Statistics. In 1980, the average work week was about 35 hours. It's now below 34 hours. There was, however, a significant decline to 33 hours in June 2009 during the Great Recession. To argue that we're working longer hours, you have to do a bit of cherry-picking and start then, not at 1980, at least according to the BLS.", "Workers might get the impression from their own lives that those numbers are too low. In fact, Gallup has consistently found from its surveys that full-time employees work, on average, seven hours longer than their 40-hour work week. Nonetheless, Gallup data from most of this century show no significant change in the work week of full-time employees from 2001 through 2014 and a decline in part-time hours, from 35.4 hours in 2001-02 to 25.9 hours for 2013-14.", "Neither measure shows hours increased, as Sanders claimed.", "However, it may be a different story if you look at families instead of individuals.", "The Sanders campaign referred us to a Washington Post article that references a 2011 Brookings Institution study. When Brookings looked at data through 2009 for the middle 10 percent of families, it concluded that income had increased by 23 percent since 1975. But that's not because wages had increased. It's because family members are working 26 percent more hours. Virtually all of that increase was seen among the mother, part of an effort to maintain the standard of living.", "\"The numbers suggest that the typical American family is earning more, but almost entirely because parents are working more — not because they are earning more per hour,\" the report says.", "Which brings us to . . .", "Wages", "Are Americans really earning lower wages?", "We called up quarterly data from the federal Bureau of Labor Statistics, specifically the annual averages for median, usual, weekly earnings for full-time wage and salary workers. We looked from 1980 through 2015. The numbers are adjusted for inflation in 1982-84 dollars.", "Over those 35 years, earnings rose from $318 per week to $342 per week, a 7.5 percent increase. If you want to create a decrease, you have to start tracking at 2009 (when weekly earnings hit about $345) or go back to early 1973, when hourly wages reached a peak. Again, timing is everything.", "As Pew's Drew DeSilver noted in October, \"after adjusting for inflation, today’s average hourly wage has just about the same purchasing power as it did in 1979, following a long slide in the 1980s and early 1990s and bumpy, inconsistent growth since then.\"", "But it's not the same for all income groups. Since 2000, the people in the lowest-paying jobs — the bottom 25 percent — have seen their weekly wages fall by 3 percent while the people at the top have seen a 9.7 percent rise.", "The Congressional Budget Office has used a different measurement. A 2014 report looked at data through 2011. It shows that since 1979, average after-tax income rose 40 percent for the poorest fifth and 29 percent for the middle class (those in the 21st to 80th percentile) once inflation was taken into account. (After-tax income takes into account tax policies designed to divert income from the wealthiest Americans.)", "So the overall trend is up.", "To say wages have gone down, you have to be very selective about where you start counting. The recovery brought things back up, but not as much as it did for the rich, which brings us to . . .", "New income", "By stopping at 2007 when he shows the rise in income for wealthiest Americans, Sanders misses some significant news. The great recession brought income for the top 1 percent down by more than a third.", "You can see it in the CBO after-tax data (above). From 1979 to 2007, the top 1 percent saw income grow by more than 275 percent. That growth fell dramatically the following year, and by 2011 it recovered to 175 percent over 1979 levels.", "There's no universally accepted way to calculate what percent of new income has gone to the top 1 percent.", "Sanders' claim came from the work of University of California Berkeley economics professor Emmanuel Saez whose analysis concluded that the top 1 percent accumulated 91 percent of all income gains from 2009-12. That's because the \"top 1 percent incomes grew by 34.7 percent while bottom 99 percent incomes grew only by 0.8,\" he said.", "One complication is that Sanders is looking at pre-tax income minus all government payments — think Social Security, unemployment compensation, welfare, food stamps and the Earned Income Tax Credit. That's more likely to show that income trends are favoring the rich, said Gary Burtless, an economist at Brookings and a former economist with the U.S. Department of Labor.", "\"If you omit income items that go disproportionately to the poor and middle class, it is easier to make the case that income trends are favoring the very well off,\" Burtless said in an email.", "Saez subsequently released updated numbers from 2009 through 2014 showing that the 91 percent estimate had dropped to 58 percent, a ratio Sanders acknowledged during a Senate speech in September.", "In that most-recent analysis, Saez concluded that over the much broader period of 1993 to 2014, the top 1 percent has captured 55 percent of the real income growth.", "Our ruling", "In his ad, Sanders asserts that, \"While our people work longer hours for lower wages, almost all new income goes to the top 1 percent.\"", "The question of hours is a mixed bag. The individual data suggest that people work the same or fewer hours. But family data analyzed by Brookings and only showing a limited slice of the population show that mothers are working longer hours.", "Wages have, in general, been going up, although barely at all compared to the gains seen among the rich.", "And while the super-rich may have accumulated 91 percent of the new wealth from 2009 to 2013 according to the economist Sanders has been relying on, the latest analysis shows that the ratio is now 58 percent since 2009, 55 percent since 1993. That's a huge amount of new income for just 1 percent of the population, but it's a stretch to say that it's \"almost all.\"", "On balance, we rate his statement Half True.", "PoliticalAdArchive.org, \"2016 Political Ad by Bernie 2016,\" Jan. 15, 2016, accessed Jan. 27, 2016", "PewResearch.org \"U.S. Income Inequality On Rise For Decades, Is Now Highest Since 1928,\" Dec. 5, 2013, accessed Jan. 28, 2016, and \"For most workers, real wages have barely budged for decades,\" Oct. 9, 2014, accessed Feb. 1, 2016", "Federal Reserve Bank of St. Louis, \"Average Weekly Hours of Production and Nonsupervisory Employees: Total private,\" accessed Feb. 1, 2016", "Gallup, \"The '40-Hour' Workweek Is Actually Longer -- by Seven Hours,\" Aug. 29, 2014, accessed Feb. 1, 2016", "Organisation for Economic Co-Operation and Development, \"Average annual hours actually worked per worker,\" data for the U.S. from 1980 to 2014, accessed Feb. 1, 2016", "PolitiFact.com, \"Hillary Clinton says wages haven't risen since turn of the century,\" Nov. 14, 2015, \"Martin O'Malley says U.S.has seen falling wages for 12 straight years,\" March 31, 2015 and \"Bernie Sanders says 99 percent of 'new' income is going to top 1 percent,\" April 19, 2015", "Bureau of Labor Statistics, \"Weekly and hourly earnings from the Current Population Survey,\" accessed Feb. 1, 2016", "Congressional Budget Office, \"The Distribution of Household Income and Federal Taxes, 2011, \" Figure 13 November 2014, accessed Feb. 1, 2016", "U.S. Census Bureau, \"Income and Poverty in the United States: 2014,\" September 2015, accessed Feb. 1, 2016", "Washington Post, \"The devalued American worker,\" Dec. 14, 2014, accessed Feb. 1, 2016", "Brookings, \"The Great Recession May Be Over, but American Families Are Working Harder than Ever,\" July 8, 2011, accessed Feb. 2, 2016", "Berkeley.edu, \"Striking it Richer: The Evolution of Top Incomes in the United States (Updated with 2013 preliminary estimates,\" Jan. 25, 2015 and \"Striking it Richer: The Evolution of Top Incomes in the United States (Updated with 2014 preliminary estimates,\" June 25, 2015, accessed Feb. 1, 2016", "New York Times Upshot column, \"The Gains From the Economic Recovery Are Still Limited to the Top One Percent,\" Jan. 27, 2015", "Interview and email, Gary Burtless, senior fellow in economic studies, Brookings Institution, Feb. 2, 2016", "Washington Post Fact Checker column, \"Bernie Sanders’s claim that 99 percent of new income is going to top 1 percent of Americans,\" Feb. 17, 2015", "Senate.gov, \"Senator Sanders Floor Speech, September 22, 2015,\" accessed Feb. 1, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]