["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"Duck Dynasty\" star Phil Robertson speaks at the conservative CPAC conference on Feb. 27, 2015. (Getty)", "At the annual CPAC convention -- a multi-day gathering that draws conservative politicians and activists to the Washington, D.C., area -- there were lots of speakers in suits and ties. And then there was Phil Robertson, the patriarch of the family featured on the A&E reality show Duck Dynasty, sporting his signature salt-and-pepper beard and a camouflage-colored bandana.", "Robertson, who was at CPAC to accept an award, gave a stemwinder of a speech on conservative values, which play a big role in his TV show. At one point, he brought up the topic of sexually transmitted diseases.", "\"I got my facts from the CDC the day before yesterday,\" Robertson told the crowd on Feb. 27, 2015. \"One hundred and ten million -- 110 million! -- Americans now have a sexually transmitted illness. One hundred and ten million? I’m looking at it, I said\" -- here Robertson sighs -- \"I don’t want you, America, to get sick. I don’t want you to become ill. I don’t want you to come down with a debilitating disease. I don’t want you to die early.\"", "Robertson’s CDC statistic certainly got our attention, since the entire U.S. population was roughly 309 million in 2012, according to the Census Bureau. This would mean that, for Robertson to be right, well over one-third of Americans must have a \"sexually transmitted illness.\" And once you subtract children under 15, the percentage would rise to 44 percent.", "Those are big percentages. Is Robertson right on the numbers?", "The short answer is no, but we can see why Robertson thought his stat was correct. (We contacted A&E Networks, Robertson’s publisher and several speakers’ bureaus that feature Robertson, but we did not get any response.)", "The CDC prominently uses the number 110 million in reference to sexually transmitted diseases. In February 2013, the CDC published a document titled \"Fact Sheet: Incidence, Prevalence, and Cost of Sexually Transmitted Infections in the United States.\"", "In it, the CDC wrote, \"CDC published an overall estimate of the number of prevalent STIs (sexually transmitted infections) in the nation. Prevalence is the total number of new and existing infections at a given time. CDC’s new data suggest that there are more than 110 million total STIs among men and women across the nation.\"", "CDC also plays up the 110 million figure several times in the fact sheet’s headlines and graphical elements.", "Here's how Robertson used it incorrectly.", "Not Americans, ‘infections’", "First, the study doesn’t refer to 110 million Americans -- it refers to 110 million infections.", "The distinction is everything. People can -- and do -- have more than one different infection, or they may contract the same infection more than once. To come up with the 110 million estimate, each of these infections would have been counted individually. The list of infections represented in the figure includes chlamydia, gonorrhea, hepatitis B virus, herpes simplex virus type 2, HIV, human papillomavirus, syphilis and trichomoniasis.", "The CDC did not provide us the number of Americans who have a sexually transmitted infection, and it's not clear that such a number exists.", "Not necessarily an ‘illness’", "The second issue with Robertson’s phrasing is that he uses the word \"illness\" instead of infection. In reality, while infected individuals can pass along an infection, and while they are at risk of getting sick themselves, the vast majority of individuals with infections are not actually ill.", "Simply put, you don't get ill just because you're infected.", "The lion’s share of infections -- almost three-quarters of the 110 million infections -- come from human papillomavirus, commonly known as HPV. This virus can cause several types of cancer, including cervical cancer, but only for a small percentage of people infected. The vast majority are not \"ill\" by any reasonable definition.", "According to CDC, \"the body’s immune system clears most HPV naturally within two years (about 90 percent), though some infections persist. … Most sexually active men and women will get HPV at some point in their lives.\"", "By contrast, the four most worrisome diseases included in the study -- syphilis, gonorrhea, hepatitis B and HIV -- account for about 1.5 percent of the total number of infections.", "What the experts say", "How problematic is Robertson’s framing of the issue? Two experts we checked with expressed concern.", "Arthur Caplan, director of the division of medical ethics at New York University’s Langone Medical Center, called Robertson’s emphasis on the 110 million figure \"fear-mongering.\"", "By way of comparison, Caplan said, \"would be to say more than 200 million of us have viruses and bacteria that come from — breathing and touching each other! They are widespread, serious and sometimes fatal — flu, pneumonia, TB, measles, enteroviruses, respiratory viruses, MRSA, meningitis etc.\" So is the answer, he said, to \"be a hermit? Do not breathe around others?\"", "Thomas Fekete, section chief for infectious diseases at the Temple University School of Medicine, also cautioned against over-reading the CDC’s figures. \"We have always had STIs in this country, and we have done some good things to reduce their burden on our citizens,\" Fekete said.", "Our ruling", "Robertson said that, according to the CDC, \"110 million Americans now have a sexually transmitted illness.\"", "The figure isn't out of thin air -- it has been touted aggressively by the CDC -- but Robertson describes its meaning incorrectly. There are 110 million infections -- not people who are infected -- and only a small percentage of infected individuals are considered to have an \"illness.\"", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Mediaite, \"Duck Dynasty’s Phil Robertson Rails Against STDs, ‘Revenge of the Hippies’ at CPAC,\" Feb. 27, 2015", "Centers for Disease Control and Prevention, \"Incidence, Prevalence, and Cost of Sexually Transmitted Infections in the United States,\" February 2013", "Satterwhite CL, et al., \"Sexually transmitted infections among US women and men: prevalence and incidence estimates, 2008,\" March 2013", "U.S. Census Bureau, \"Table 1. Population by Age and Sex: 2012,\" accessed Mar. 2, 2015", "Email interview with Arthur Caplan, director of the division of medical ethics at New York University’s Langone Medical Center, Feb. 2, 2015", "Email interview with Thomas Fekete, section chief for infectious diseases at the Temple University School of Medicine, Feb. 2, 2015", "Email interview with Salina Smith, spokeswoman for the Centers for Disease Control and Prevention, Feb. 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]