["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Danny O'Connor, the Franklin County recorder, speaks during an election night watch party at the Ohio Civil Service Employees Association, Tuesday, Aug. 7, 2018, in Westerville, Ohio. (AP)", "The Republican incumbent in Ohio’s 12th Congressional District is being outraised by his Democratic opponent by nearly $4 million.", "But Republican Troy Balderson says that’s because Democrat Danny O’Connor has received most of his campaign funds from out-of-state contributors.", "A Sept. 8, 2018, Cleveland Plain Dealer story points out that Balderson, of Zanesville, is badly losing the fundraising battle in his November rematch with O’Connor, a Franklin County recorder. The two faced off in an Aug. 7 special election that ended in Balderson narrowly beating O’Connor to hold the seat for the next two months.", "\"Liberal, out-of-state special-interest groups are continuing to prop up Danny O’Connor’s campaign in their efforts to retake the House and put Nancy Pelosi in the Speaker’s chair,\" the Balderson campaign said in a statement published in newspapers in Cleveland and Columbus. \"While O'Connor's campaign has raised 90 percent of his campaign funds from liberal out of staters, our campaign is funded by hard-working Ohioans who want someone who will fight for them and their middle class values.\"", "We wondered, do 90 percent of O’Connor’s campaign contributions come from outside of Ohio?", "No, but O’Connor is raising significant support from out-of-state donors.", "Trying to measure where a candidate’s campaign funds come from can be tricky for a couple of reasons. First, donations under $200 aren’t itemized, so campaigns aren’t required to provide the addresses of those low-dollar donors. Second, Democrats running for Congress have been using ActBlue PAC, which is based in Somerville, Mass., to manage online candidate contributions.", "We went to the Center for Responsive Politics, an authoritative database of campaign finance data, to examine O’Connor’s numbers, as well as the Federal Election Commission.", "Both databases show that, as of late August, O’Connor has raised around $5.5 million with a little over $1 million in cash on hand. (Balderson has raised almost $1.8 million with just under $93,000 in cash on hand.)", "O’Connor has received $405,528 in individual contributions from more than 2,000 Ohio donors, according to FEC filings. This compares to roughly $1,356,583 raised by the campaign from all other states combined.", "That adds up to $1.76 million in donations, just about a third of everything O’Connor has raised. Where is the rest of the money? More than $3.5 million of O’Connor’s donations are unitemized. FEC press officer Judith Ingram told us that donations under $200 do not require the identifying information needed to know where each geographically comes from.", "Brendan Quinn, outreach manager at the Center for Responsive Politics, said the same.", "\"Campaigns are only required to itemize contributions of $200 or more, and that includes multiple donations that add up to that amount,\" Quinn explained. \"And according to our data, over 60 percent (64.87) of O’Connor’s contributions are those small individual contributions under $200.\"", "But of O’Connor’s itemized donations, 23 percent of the money received comes from Ohio and 77 percent comes from out of state.", "So why did Balderson claim 90 percent of O’Connor’s funds came from \"liberal out of staters\"?", "Balderson campaign manager Jenna Knepper said the campaign zeroed in on the period between July 19 and Aug. 2, the closing weeks of the special election. It counted the number of people who contributed from Ohio versus other states during that time period.", "FEC filings for that report show that O’Connor received a total of 12,580 contributions. Of those, 1,368 came from Ohio, and the other 11,212 came from other states.", "By those figures, 10.9 percent of the contributions originated from Ohio and the other 89.1 came from outside of the state.", "The O’Connor campaign says he has raised more money from Ohioans than the FEC data show.", "They backed that up with figures from their records from Jan. 1, 2018, to Aug. 27, 2018, which they reported to the NGP, a privately owned voter database and web hosting service provider used by the  Democratic Party. These incorporate the contributions not included in national databases because of the lower donation amounts. The numbers show that O’Connor has raised around $866,233 in Ohio with an average donation of $37.54 — more than double what the FEC data show.", "Balderson said O’Connor has raised \"90 percent of his campaign funds from liberal out of staters.\"", "In the most recent fundraising report, almost 90 percent of O’Connor’s campaign contributions came from donors outside of Ohio. That’s donors, not money. But when it comes to O’Connors overall itemized donations thus far in the race, the situation isn’t as stark. Combined, 23 percent stemmed from in-state contributions, and 77 percent came from all other states combined.", "The percentages do not include contributions under $200, because the FEC doesn’t require certain information such as donors’ addresses.", "Balderson’s statement is inflated and incomplete. We rate it Half True.", "Cleveland Plain Dealer, \"Danny O'Connor has more than 10 times Troy Balderson's money going into November,\"  Sept. 6, 2018", "The New York Times, \"Troy Balderson, Ohio Republican, Wins Special Election for House Seat,\" Aug. 24, 2018", "ActBlue PAC web pages, \"ActBlue PAC,\" \"About,\" Accessed Sept. 20, 2018", "PolitiFact, \"Will Hurd way off on foe getting more money from Massachusetts residents than from Texans,\" Aug. 15, 2018", "Center for Responsive Politics, \"Campaign Funds Database,\" Accessed Sept. 18, 2018", "Federal Election Commission, \"Campaign Receipts Database,\" Accessed Sept. 18, 2018", "Spreadsheets to Danny O’Connor from out of state and Ohio residents from July 19, 2018 to August 27, 2018, Federal Election Commission, Accessed Sept. 19, 2018", "Axios, \"House Campaign Contributions Outside Money,\" Accessed Sept. 18, 2018", "NGP, https://www.ngpvan.com/about, Accessed Sept. 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]