["The video was published on Facebook here on April 11, 2020. It has been viewed more than 331,000 times and shared more than 8,700 times.", "The one-minute 37-second video shows Dr. Pornthep Siriwanarangsan, the former director-general of Thailand’s Department of Disease Control, saying that eating papaya salad can protect people from COVID-19 infection.", "Below is a screenshot of the misleading post:", "At the video’s one-minute 15-second mark, Siriwanarangsan can be heard saying: \"In papaya salad there is garlic and chilli, which are mucolytics that will help protect you from COVID-19.\"", "The post's caption reads: “Do you want to eat papaya salad? Papaya salad, the menu for fighting against COVID-19 by Dr. Pornthep Siriwanarangsan”.", "Papaya salad, locally known as som tam, is a popular dish in Thailand. Its main ingredient is green papaya, which is tossed in a dressing made of mixed spices.", "The video has also been shared here on Facebook, here on Twitter and here on YouTube.", "But the claim is false.", "“It’s a bogus claim,\" Dr. Thira Woratanarat, an associate professor in the Department of Preventive and Social Medicine at Thailand’s Chulalongkorn University, told AFP by phone on April 27, 2020.", "\"To date, there is no evidence pointing to the efficacy of eating papaya salad, or any other kinds of food to prevent or cure viral infections,”", "- Dr. Thira Woratanarat, associate professor at Chulalongkorn University", "“The most effective way to protect yourself from infection is to wash your hands regularly, wear facial masks, and keep social distance from 1-1.5 metres,” Woratanarat added.", "As of April 2020, the WHO also maintains there is no medicine that can prevent or treat COVID-19.", "“To date, there is no vaccine and no specific antiviral medicine to prevent or treat COVID-2019,\" the agency states in this Q&A page.", "“If you want to protect yourself from getting infected with the new coronavirus, you should maintain basic hand and respiratory hygiene, and safe food practices and avoiding close contact, when possible, with anyone showing symptoms of respiratory illness such as coughing and sneezing.”", "As of April 29, 2020, the WHO has reported more than 2.9 million infections and over 200,000 deaths from COVID-19 worldwide.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]