["The claim was published here on a Burmese-language website on November 3, 2020.", "The title of the Burmese-language post translates in English as: “WHO has designated Russian made vaccine as COVID-19 vaccine”.", "After the misleading headline, the article says: “Russia applies to the WHO for emergency use of its vaccine.", "“Russia's Direct Investment Fund (RDIF) has applied to the World Health Organization (WHO) for inclusion of its COVID-19 vaccine Sputnik V in for Emergency Use Listing, Russia’s sovereign wealth fund said on (October 27) Tuesday.”", "The article was widely shared on Facebook, for example here, here, here, and here.", "However, the claim in the headline is misleading.", "The WHO has not designated any Covid-19 vaccine and says on its website that “there are no medicines that have been shown to prevent or cure the disease”.", "It also says clearly on its website that there is no current vaccine: “To date, there is no vaccine and no specific antiviral medicine to prevent or treat COVID-2019.”", "On October 27, 2020, the Russian Direct Investment Fund, which oversees the country’s vaccine production, published this statement about its application to the WHO for an Emergency Use Listing of the country’s Sputnik V coronavirus vaccine.", "The press statement states in part: “The Russian Direct Investment Fund has submitted applications to the World Health Organization for accelerated registration (Emergency Use Listing, EUL) and prequalification of the world’s first registered vaccine against the coronavirus Sputnik V, which is based on a well-studied platform of human adenoviral vectors.”", "This registration had not been granted as of November 11.", "Multiple Covid-19 vaccines are being trialed and on November 11 US pharmaceutical giant Pfizer said its drug had shown 90 percent effectiveness, sending markets soaring and raising hopes of an end to the worst pandemic in a century. Here is an AFP report on the development.", "WHO Director-General Tedros Adhanom Ghebreyesus hailed the news as \"encouraging\" shortly after warning that the world \"might be tired of Covid-19. But it is not tired of us.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]