["Have you been given a free colourful key holder at a petrol station or shopping centre?", "According to a decade-old hoax being shared anew on Facebook there’s a catch - the key holder is actually “a detector to follow u home”.", "The hoax has been debunked a number of times in different countries. Snopes said it began in South Africa in 2008 when Caltex petrol stations were giving away free key holders as part of a promotion.", "This early version of the hoax also claimed there were tracking devices in the key holders. It showed photos of a Caltex key holder taken apart to reveal the “tracking device’’.", "In the past decade the hoax has popped up in the UK, Australia, Singapore and Malaysia.", "The new Facebook version of the hoax shows a picture of colourful Bluetooth key trackers and suggests they are being used to track people. But a key tracker simply uses Bluetooth technology to find lost keys. It’s connected wirelessly to a smartphone and clipped on a key ring. If the keys are lost, an app on the phone helps the user find them.", "Police spokesperson Sally de Beer said the warning didn’t come from the police. “Kindly regard it as a hoax. However, we always urge communities to be ever vigilant.”", "But could Bluetooth key trackers be used to track potential victims?", "Besides being rather costly to be given away freely to lots of people, the trackers have a limited range, associate professor in the academy of computer science and software engineering at the University of Johannesburg, Dr Dustin van der Haar, told Africa Check.", "This means criminals would have to constantly follow the tracker so they wouldn’t lose connectivity – which defeats the purpose of using a tracker in the first place. - Naphtali Khumalo (14/11/2018)", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]