["17.4 million people voted to leave and 16.1 million voted to remain in the EU referendum.", "Correct.", "406 constituencies voted to leave, 242 voted to remain in the EU referendum.", "Best estimates show it was probably about 410 to 240.", "In the 2016 EU referendum, 148 Labour constituencies voted to leave, 84 to remain. 247 Conservative constituencies voted to leave, 80 to remain.", "Best estimates are that 249 Conservative constituencies probably voted to leave, and 81 to remain (based on the 2015 general election seat distribution). For Labour it was 148 for leave, and 84 for remain.", "Nine regions voted to leave and three voted to remain in the EU referendum.", "Correct.", "160 MPs are for leave and 486 are for remain.", "That’s pretty close to survey results of all the MPs just before the 2016 referendum. There has since been a general election and some MPs could have changed their view.", "We’ve been asked to check an image that presents the EU referendum result split by constituency and region, and how MPs supposedly voted in the referendum. It’s had over 35,000 shares on Facebook.", "Some of the numbers are not quite right, but all the trends are broadly correct. Below we’ve looked at each claim in turn.", "“EU Referendum Results 2016", "By Votes 17.4 million Leave | 16.1 million Remain”", "This is correct.", "“By constituency 406 Leave | 242 Remain”", "This is broadly in line with the best estimates available, based on the seats parties won at the 2015 general election, although the numbers are not quite perfect (there are 650 constituencies in the UK, but the numbers in this image only add up to 648).", "Estimating referendum results by parliamentary constituency isn’t easy, because the results weren’t counted by constituency seat. Some councils released a breakdown of votes by constituency as well (although they didn’t have to), and the BBC accessed some data via Freedom of Information requests.", "The best overall figures we have on this are estimates from Professor Chris Hanretty, a political scientist at Royal Holloway University, who combined official results and the BBC data with statistical methods in order to estimate the proportion of Leave and Remain voters in every seat in England, Scotland and Wales (Northern Ireland published results by constituency). We’ve written more about these calculations here.", "Professor Hanretty estimated that 64% of seats in Great Britain probably voted to leave, or around 403 constituencies. Including the known results for Northern Ireland, that amounts to 410 constituencies voting leave (63%) and 240 voting remain.", "“By constituency By Party", "Lab: 148 Leave | 84 Remain", "Con: 247 Leave | 80 Remain”", "Once again, the numbers in this claim are not quite perfect but the trend is broadly correct.", "Using Professor Hanretty’s estimates, and looking at the results from the 2015 general election, 249 Conservative-voting constituencies probably voted to leave, while 81 probably voted to remain (not including the speaker’s constituency Buckingham, which probably voted to remain, based on these estimates).", "148 Labour-voting seats probably voted to leave, while 84 probably voted to remain, which is exactly what the image says.", "Professor Hanretty acknowledges that we can’t be certain about these numbers though, as there is some margin for error in the calculation.", "But if you take out the constituencies where there’s most uncertainty about the result, the general pattern is still the same.", "Of course, there has since been another general election, so these figures don’t reflect the situation today. However, even based on the 2017 general election results, the pattern is broadly the same.", "“By Region", "9 Leave | 3 Remain”", "The image is correct in saying that nine regions overall voted to leave and three voted to remain (Scotland, Northern Ireland and London).", "“By MP 160 Leave | 486 Remain”", "Again, these numbers don’t add up to 650, with four MPs unaccounted for.", "It’s based on MPs elected at the 2015 general election, rather than the current set of MPs we have now, who were elected in 2017. It also refers to those MPs stated positions before the referendum, rather than after the result.", "The figures quoted are similar to the results of a survey by the Press Association, which asked every MP how they would vote in the referendum just before it happened in 2016.", "480 said they would vote to remain, 159 said they would vote to leave, and 11 MPs did not declare. Politics Home published a similar article just before the referendum, based on public statements by the MPs, which concluded that 485 intended to vote remain, 156 to leave, and 9 had not declared.", "Of course, we can’t know for sure how each MP voted in the referendum, so surveying them or using public statements is the best we’ve got.", "Providing a more up to date figure is difficult.  The more recent 2017 general election means some MPs have changed, and others have changed their position since the referendum result.", "We also know that many MPs who voted remain have since supported measures to leave the EU. 498 MPs voted in February 2017 in favour of triggering Article 50, which formally began the UK’s exit process from the EU. Additionally, 286 voted in favour of Theresa May’s withdrawal agreement in March 2019. During two rounds of the “indicative vote” process in March and April, the two options that would have opened the door to parliament potentially revoking Article 50 were defeated, each gaining fewer than 200 votes.", "Correction 8 May 2019", "A typo in the \"in brief\" section of this article has been corrected. It previously stated that 184 Labour constituencies (rather than 148) probably voted to leave in 2016.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as true\n            as most of the figures are either true or close to the best estimates we’ve seen.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]