["A screenshot shared here on Instagram shows two police officers from Nigeria’s Rapid Response Squad (RRS) apprehending a man in the street.", "“A face mask seller was arrested for not wearing a face mask by policemen who were not wearing face masks,” reads the image text, before asking: “Who did we offend in Nigeria?”", "The same screenshot has also been shared on Facebook here, here and here.", "The claim originated from a blog post by MMSPlus, a website in Nigeria that publishes content about business sectors like the maritime industry, energy, oil and gas, and finance.", "“What an irony!” reads the blog post from May 17, 2020. “Are police officers immune to Covid-19? If police officers can flout the directive on face masks, why can’t this mask seller do the same?”", "Face masks are compulsory in public and the Nigerian government has set up mobile courts to prosecute people who break the law.", "However, the claim, which has resurfaced nine months later, is false and uses the image out of context.", "AFP Fact Check cropped the text from the claim image and ran the picture through a reverse image search.", "This led us to online reports, the earliest of which was published in April 2016 — three years before the coronavirus was discovered. The picture was part of a photo essay by Legit, a news site in Nigeria, on the enforcement of the use of pedestrian bridges across the Ikorodu Road in Lagos, Nigeria’s commercial capital.", "We checked Google Maps and found that the street in the photo shows part of Ikorodu Road.", "At the time, the Lagos state government made the use of pedestrian bridges compulsory, leading to long queues in the city of more than 21 million people, as reported here and here by local media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]