["About this rating", "In 2009, Forbes magazine ranked Peter Lewis at #366 on its list of the richest Americans, pegging his net worth at just over $1 billion. Lewis acquired his wealth primarily through his stewardship of Cleveland-based Progressive Insurance, a company co-founded by his father in 1937.", "When he assumed the position of CEO of Progressive in 1965, Lewis took over a business with about 100 employees and $6 million in yearly revenue; forty years later, Progressive had become the third largest auto insurer in the United States, employing over 27,000 people with yearly revenues topping $13 billion.   This success spawned chain emails and memes decrying Lewis' supposed political leanings and involvement:", "This is a heads up regarding Progressive Auto Insurance. You know who they are. They’re the ones with the clever television ads featuring the perky brunette actress all dressed in white. What you might not know is that the chairman of Progressive is Peter Lewis, one of the largest funders of the left in America. He's your typical rich spoiled kid who took over the company from his father and apparently feels \"guilty\" for his success and now dedicates himself to making it impossible for anyone else to become wealthy.Between 2001 and 2003, Lewis funneled $15 million to the ACLU, the group most responsible for destroying what's left of America's Judeo-Christian heritage. Indeed, Lewis is himself an ACLU member. One of the ACLU projects he earmarked his funds for was an effort to sue school districts who have drug testing policies. In other words, this idiot wants teachers to be able to use drugs without fear of exposure. I wonder what he would think if all his own employees came to work drugged out every day.", "Lewis also gave $12.5 million to MoveOn.org and American Coming Together, two key components of the socialist left. The former group is perhaps the main group used by the Obama forces to organize their activists; the latter group is a 527 political action group that essentially served as a front for the SEIU union thugs who ran ACORN. His funding for these groups was conditional on matching contributions from George Soros, the international socialist who finances much of the Obama political network.", "It's disturbing that Lewis made a fortune as a result of capitalism but now finances a progressive movement that threatens to destroy the free enterprise system. He reminds me somewhat of Armand Hammer, the former head of Occidental Petroleum who did business with Joseph Stalin and became his good friend, around the same time Stalin was executing businessmen all over the USSR.", "What angers me further is the way this company is targeting television shows watched by conservatives such as Fox News. Peter Lewis is making a fortune off of conservative Americans so that he can destroy our country. He's banking on no one finding out who he is. I think it's time we expose this clown.", "Boycott Progressive Insurance", "Peter Lewis personally donated a good deal a money to various philanthropic efforts over the years, including hundreds of millions of dollars to Princeton and Case Western Reserve universities, and another $50 million to the Guggenheim Museum. He has also given large amounts of money to various political organizations, including donations of $7 million and $8 million to the ACLU in 2001 and 2003. (The former donation went to the Trust for the Bill of Rights, the ACLU's endowment fund; the latter was described by the ACLU as being earmarked \"to fight Bush Administration policies that trample on civil liberties.\" According to the Boston Globe, Lewis stipulated that $5 million of his 2001 donation go \"to the ACLU's drug-policy litigation project, which deals with drug-testing in schools and the medicinal use of marijuana.\")", "Lewis also made donations of $3 million and $2.5 million (both of which were reportedly matched by billionaire activist George Soros) to America Coming Together (a liberal political action group which has since disbanded), and MoveOn.org (a progressive/liberal political action committee and public policy group) in 2004.", "Among his other causes, Lewis was an advocate for the removal of criminal penalties for marijuana use, particularly for medicinal purposes (he was himself arrested and charged in New Zealand for possession of marijuana in 2000), adding his name to a 1998 letter to U.N. Secretary General Kofi Annan calling for the initiation of a \"truly open and honest dialogue regarding the future of global drug control policies,\" and becoming the largest donor (including $3 million in 2007 alone) to the Marijuana Policy Project. (The Progressive Insurance company, as opposed to Peter Lewis personally, supports multiple non-political charitable causes.)", "However, the \"heads up regarding Progressive Auto Insurance\" reproduced above, originally circulated in 2010, is now woefully out of date: Lewis stepped down from his role as Progressive Insurance's CEO in 2000 and after that date was neither an executive of that company nor involved in its day-to-day management. Although after 2000 he continued to hold the position of chairman of the board of the Progressive Corporation and was that entity's single largest individual shareholder, he passed away in November 2013 and therefore obviously no longer has any connection with Progressive Insurance.", "As well, some of the statements made in the above-quoted call for a boycott of Progressive Insurance were inaccurate and misleading:", "[A school board] policy required any teacher who suffered an injury on the job to submit to a drug test — even if that \"injury\" resulted from being punched by a student.The drug test of two-time East Baton Rouge Teacher of the Year Peggy Reno illustrates how the School Board's now defunct drug-testing policy was put into effect. Ms. Reno, a veteran and respected teacher, never in her life used an illegal drug, and her school never suspected otherwise.", "A student punched Ms. Reno on September 24, 2008. Although there was no suspicion that she was under the influence of drugs or alcohol, Ms. Reno was forced by a School Board official to submit to an invasive drug test. Countless other teachers who have never used drugs — and who have never been suspected of using drugs — have been subjected to similar unconstitutional searches.", "The Fourth Amendment to the Bill of Rights forbids government searches when there is no reasonable suspicion of wrongdoing.", "Clarke, Josie.   \"Eccentric Billionaire Has High Profile at Home.\"\r\n    The New Zealand Herald.   31 August 2000.", "Edsall, Thomas B.   \"Soros-Backed Activist Group Disbands as Interest Fades.\"\r\n    The Washington Post.   3 August 2005.", "Healy, Rita.   \"Mellowing Out on Marijuana.\"\r\n    Time.   8 November 2007.", "Kranish, Michael.   \"Rich Activists, Hoping to Sway Voters, Give Vast Sums to 527s.\"\r\n    Boston Globe.   21 September 2003   (p. A8).", "Leinwand, Donna.   \"Super-Rich Trio Put Cash into Marijuana Initiatives.\"\r\n    USA Today.   5 November 2002   (p. A8).", "ACLU.   \"Individual Donor Sets Record with $7 Million Donation.\"\r\n    18 July 2001.", "ACLU.   \"$8 Million Gift Will Boost Campaign to Fight Bush Administration's Assault on Civil Liberties.\"\r\n    15 January 2003.", "Forbes.   \"The Forbes 400 Richest Americans 2009.\"\r\n    30 September 2009.", "The Nation.   \"The Beat-Bush Brigades.\"\r\n    26 April 2004.", "USA Today.   \"Partisan Groups' attack Ads Dodge Disclosure Rules.\"\r\n    16 March 2004   (p. A12).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]