["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump, real estate mogul and New Jersey Generals owner, is pictured in New York, Aug. 1, 1984. (AP)", "There was a time decades ago when the New York Times praised the idea of a President Donald Trump, a viral story on Facebook said.", "\"This is amazing: In 1984, the New York Times said Trump would be our BEST president...They forgot...,\" said a July 9 headline by Bling News, a website with clickbait headlines that lacks original reporting.", "Facebook users flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. Read more about our partnership with Facebook.", "The story mischaracterizes what the New York Times magazine wrote about Trump in 1984 in an article headlined \"The expanding empire of Donald Trump.\"", "At the time Trump, was the 37-year-old owner of the New Jersey Generals, a franchise in the upstart United States Football League. He was also the owner of many other businesses and properties.", "The Times wrote: \"Donald J. Trump is the man of the hour. Turn on the television or open a newspaper almost any day of the week and there he is, snatching some star form the National Football League, announcing some preposterously lavish project he wants to build. Public-relations firms call him, offering to handle his account for nothing, so that they might take credit for the torrential hoopla.\"", "Nothing in the article declared that Trump would be the best president. The article did include a line that Trump said he didn’t want to be president:", "\"He is constantly asked about his interest in running for elective office. Absolutely not, he answers,\" the Times wrote. \"All of the false smiles and the red tape. It is too difficult to really do anything. He dislikes meetings and paperwork and is in the enviable position of being able to avoid both.\"", "Bling News drew its report from another website, 100percentfedup. That website posted this update and correction following an article by Factcheck.org:", "\"We like to think our readers can think subjectively and ‘get’ our nuanced titles once they read the article. We give you credit for understanding where we’re coming from. Factcheck.org has claimed that the New York Times didn’t say Trump would be our BEST president. To clarify, if you read the intro paragraph of the article we hope you’ll think subjectively and understand what we said about the article. We believe that the New York Times INADVERTENTLY DESCRIBED HOW TRUMP WOULD BE A PERFECT FIT FOR THIS TIME IN AMERICA, therefore, THE BEST PRESIDENT ‘FOR THIS TIME IN AMERICA.’\"", "We found no contact information on Bling News’ website. The New York Times magazine story in 1984 didn’t say that Trump would be our best president; instead, it was an in-depth profile of Trump the businessman. We rate this statement Pants on Fire.", "Bling News, \"THIS IS AMAZING: In 1984, the New York Times said Trump would be our BEST president…They forgot…..,\" July 9, 2018", "100 Percent Fed Up, \"THIS IS AMAZING: A 1984 New York Times Interview of Citizen Trump Not To Be Missed,\" July 8, 2018", "New York Times,  \"The expanding empire of Donald Trump.\" April 8, 1984", "Factcheck.org, \"Trumped Up Headlines Distort Old Story,\" July 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]