["About this rating", "On 4 November 2016, an image macro containing the text of an email purportedly written by Hillary Clinton's longtime aide Huma Abedin to her brother Hassan began circulating via Facebook and Twitter:", "<< On September 03, 2016 at 8:57 PM, humamabedin@yahoo.com wrote: Sorry for my late reply, Hassan, yes, let me tell you about Her. The woman is so odd, so starved for validation, so tormented and vain it is a constant surprise to me anyone takes her seriously. Everyone on the team knows how unwell she is but they're more determined than ever to see her win. This woman has a dozen seizures a day. This godless shrieking malcontent passed out in her medical van. This walking cadaver. She's nonfunctional, Hassan, nobody cares. We sober her up for speeches and indulge the press corps with cheap sentiment. The first female president. The last glass ceiling, etc. They trip over themselves lining up behind her. Surely they know it's not Her they're getting, it's the one in the corner, the quiet helper, your sister Huma. You asked me once how I did it. How did I take the castle? Hassan, I didn't take it, they gave it to me. Yes, there was a cost, I will admit, subjecting myself to men like AW and WJC is mortal torture. But I do it gladly, brother, everything they ask of me, however sick and depraved, I do it and I smile, rejoicing at the thought of whose glory I serve. >>", "The premise, in case it isn't obvious, is that this is a private message intended for her brother's eyes only, in which Huma Abedin, a Muslim from birth, supposedly confesses her true, secret reason for being in America and working for Hillary Clinton — to \"take the castle,\" i.e., to infiltrate and take over the U.S. government on behalf of Islam once Clinton is elected.", "The conspiracy theory dovetails with ongoing efforts by partisan rumor-mongers to convince the public that Abedin, who is American-born and has been Clinton's closest aide for most of 20 years, has allegiances to radical Islam.", "Pardon us if we scoff.", "There's no evidence that this message, allegedly written on 3 September 2016, existed at all prior to 4 November 2016, which is when people began sharing it via social media. No source has been cited. The text cannot be found via searches of the WikiLeaks, DNCLeaks, or Judicial Watch document archives. Despite its potentially earth-shattering content, the e-mail has not been covered or discussed by any legitimate news agencies.", "Indeed, we find it implausible that after 20 years of (supposedly) keeping her subversive mission a secret while working undercover as Hillary Clinton's assistant, Abedin would commit the stupid indiscretion of speaking openly of the conspiracy in an e-mail to a family member, and all the more implausible that she would do so via her personal e-mail account — humamabedin@yahoo.com — which, since 2015, had been subject to public scrutiny because of the FBI's investigation into Clinton State Dept. e-mail irregularities. We found an online source that sent a test message to Abedin's personal address during or before the first week of September 2016 — which was when she supposedly sent the incriminating e-mail to her brother — and reported that the message was returned as undeliverable, indicating that her account was no longer active.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]