["Last week, as Americans waited for President Donald Trump to announce his nominee to the Supreme Court, some social media users suggested he might make an unconventional pick: himself.", "On Instagram, the account latinos.4.america shared a screenshot of what appears to be a news article, headlined \"Trump Nominates Himself To The Supreme Court.\" It is accompanied by a portrait of Justices Neil Gorsuch, Sonia Sotomayor, Elena Kagan, Clarence Thomas and John Roberts — with Trump, clad in a black robe, too.", "To add to the absurdity, the article is dated \"June 20th, 2020\" — months before Justice Ruth Bader Ginsburg died, opening up a seat on the high court.", "In a message on Instagram, latinos.4.america wrote, \"No one in their right mind should take that post seriously.\"", "Fact check:No evidence Schumer called Judge Amy Coney Barrett 'wildly out of mainstream'", "If the thought of Trump naming himself to the Supreme Court seems like satire, that's because it is.", "The claim came from The Babylon Bee, which bills itself as \"the world’s best satire site, totally inerrant in all its truth claims.\"", "In reality, Trump has already announced his pick for the Supreme Court: Judge Amy Coney Barrett, 48, who currently sits on the U.S. Court of Appeals for the 7th Circuit.", "The Senate will begin her confirmation hearings on Oct. 12.", "Still, it's possible that a president could, technically, nominate himself or herself to the Supreme Court.", "In 2010, Jeffrey Rosen — a law professor at George Washington University — suggested in the Washington Post that then-President Barack Obama \"could nominate himself to replace John Paul Stevens.\"", "Fact check:In early 1970s, RBG represented woman discharged from military because she wouldn't get an abortion", "Based on our research, the claim that President Donald Trump nominated himself to the Supreme Court — in June, no less, when there was no vacancy — is FALSE. That claim originated on a satirical website, The Babylon Bee. In reality, Trump has tapped Judge Amy Coney Barrett as his third nominee to the high court.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]