["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Joe Biden, participates in a Democratic presidential primary debate with Sen. Bernie Sanders, I-Vt., at CNN Studios, March 15, 2020, in Washington. (AP/Evan Vucci)", "Sanders voted against a set of funds that financed most of the auto bailout, but the funds’ primary purpose was bailing out Wall Street firms, which Sanders strongly opposed.", "Sanders voted in favor of a standalone meausre providing auto companies with $14 billion, which was separate from the Wall Street bailout funds he opposed. The standalone measure failed.", "As the United States faces economic fallout from the coronavirus pandemic, former Vice President Joe Biden and U.S. Sen. Bernie Sanders argued about their past records on bailouts following the 2008 financial collapse.", "Sanders said that he voted against the 2008 bailout while Biden supported it.", "Biden then countered: \"Part of that was bailing out the automobile industry — saving thousands of jobs, tens of thousands of jobs over time. (Sanders) voted against that as well.\"", "Sanders interjected: \"No, I did not vote against that. That bailout money was used later on by Bush to protect the automobile industry.\"", "We found that both Biden and Sanders are only telling part of the story about Sanders’ votes.", "RELATED: Bernie Sanders overstates recession aid to Wall Street banks", "In October 2008, Congress approved the $700 billion Troubled Asset Relief Program (TARP). The money was intended to assist financial institutions, but it also ended up bailing out the auto industry.", "That December, Congress tried to pass a separate $14 billion bailout program specifically for the auto industry. But the measure failed in the Senate, so President George W. Bush instead used his authority to allocate some of the TARP funds to General Motors and Chrysler.", "Just days before President Barack Obama started his first term in January 2009, some members of Congress tried to block the release of the the second half of the $700 billion TARP funds, a package that included some auto bailout money. The attempt failed, and the funds went out to the banks and motor companies.", "So Sanders had two opportunities to show support on the auto bailout: in December 2008, when Congress tried and failed to pass an auto bailout, and again in January 2009, when members considered blocking TARP funds.", "Sanders voted in favor of the December separate auto bailout and against the January measure.", "After the favorable December vote, Sanders spoke in an interview about the value of automobile industry jobs, which he described historically as the \"gold standard for manufacturing workers\" due to the good wages, benefits and strong union.", "Sanders told Vermont Public Radio that he supported the measure because \"I think it would be a terrible idea to add millions more to the unemployment rolls.\"", "However, Sanders voted to block the release of the second half of the TARP funding, including the auto bailout funds. (Sanders opposed the initial TARP bill in October.)", "Sanders said he opposed bailout funding for financial firms, which is where the majority of TARP dollars were headed.", "\"I have strong reservations about continuing this bailout without strong taxpayer protections written into law,\" he said in a statement. \"I also object to using middle-class taxpayer money to bail out the exact same financial institutions whose greed and recklessness led to the greatest financial crisis since the Great Depression.\"", "Auto companies ended up receiving about $85 billion in TARP funds, according to the New York Times.", "Biden said that Sanders voted against the auto bailout.", "Sanders did vote against a set of funds that financed most of the auto bailout — though the funds’ primary purpose was bailing out Wall Street firms, which Sanders strongly opposed.", "But Biden left listeners with the impression that Sanders’ opposed bailing out the auto industry. Sanders voted in favor of providing auto companies with $14 billion, which was separate from the Wall Street bailout funds he opposed. That standalone measure failed.", "We rate this claim Half True.", "Andrew Bates (Biden campaign), Tweet, March 15, 2020", "Los Angeles Times, Opinion: Bernie Sanders was for the auto industry bailout before he was against it, March 8, 2016", "Thom Hartmann talks with Senator Bernie Sanders, Dec. 19, 2008", "PolitiFact, In Michigan, Hillary Clinton says Bernie Sanders 'was against the auto bailout' March 7, 2016", "Email interview, Anna Bahr, U.S. Sen. Bernie Sanders campaign spokeswoman, March 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]