["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Democratic state senator called for regulations after police fatally shot a 15-year-old boy who was brandishing what turned out to be a non-lethal air pistol.\n\nIn an interview posted online Jan. 6, 2012, by KRGV-TV, Channel 5, Eddie Lucio of Brownsville said: \"First of all I think that there should be a prohibition of some kind on the appearance of these pellet guns and airsoft guns that are sold in the state of Texas.\" At least, Lucio said, such guns should visibly stand out so \"we understand exactly what they are.\"\n\nIn the same segment, reporter Eddie Flores said Lucio told him that \"right now, there are no known regulations or prohibitions in the appearance of pellet guns or airsoft guns in the state of Texas.\"", "No regulations in Texas?", "When we inquired, Lucio’s legislative director, Sara González,said the senator intended to stress the lack of state, not federal, regulations of the facsimile firearms’ appearances.\n\nAirsoft guns, she said, are required by federal law to display a 6-millimeter orange tip, a mandate that doesn’t apply to pellet or BB guns. \"What (Lucio) meant is there is nothing in the state that we know of,\" she said. \"There’s federal regulation on airsoft guns, but that doesn’t apply necessarily to metal pellet-type guns or BB guns.\"\n\nIn the Jan. 4, 2012, incident at a Brownsville middle school, the student was wielding a Umarex SA177, according to news accounts. The device solely fires steel BBs, Justin Biddle, a marketing manager at Umarex USA, told us in an interview.\n\nGonzález helped us isolate the federal law that regulates the appearance of imitation firearms, stipulating the 6-millimeter orange marking requirement for airsoft guns. Those guns shoot projectiles at a lower speed than pellet or BB guns, according to Jeffrey Welty, an assistant professor of public law and government at the University of North Carolina School of Government, who specializes in criminal law and procedure.\n\nBut the marking requirement does not apply to \"traditional BB, paint-ball, or pellet-firing air guns that expel a projectile through the force of air pressure,\" the law says.\n\nSo, the gun used in Brownsville was exempt from federal marking requirements.\n\nIn the wake of the shooting, the office of Rep. Rene Oliveira, D-Brownsville, also examined legal issues related to facsimile firearms, said J.J. Garza, Oliveira’s chief of staff. Garza pointed us to another part of the U.S. Code, Section G, which states that federal provisions on imitation gun identification supersede such local or state laws and ordinances.\n\nBut are there state and local restrictions anyway?  \n\nMeagan Dorsch, a spokeswoman for the National Conference of State Legislatures, emailed us the organization’s July 2011 list showing states with imitation firearm statutes:  Arkansas, California, Connecticut, Kansas, Louisiana, Minnesota, Mississippi, New Jersey, New York, Tennessee and Wisconsin.\n\nWe wondered how any state statutes survive without conflicting with the superseding federal law. By addressing aspects not included in the federal provisions, advised David Kopel, an expert on firearms policy and research director at the Independence Institute, a free-market think tank in Colorado. For instance, he said by email, \"Louisiana’s statutes only applies to guns that fire blanks, and those aren't covered by the federal law.\"\n\nSeparately, experts at the Texas Legislative Library said that some Texas cities, including Plano, Horseshoe Bay, Farmers Branch and Carrollton have local ordinances that regulate how people display facsimile firearms--no reckless displays of imitation guns in public places, for example--but these statutes don’t regulate the appearance of the guns.\n\nOur ruling\n\nThere are no state-level regulations of the appearance of pellet/BB or airsoft guns sold in Texas, but federal law requires airsoft guns to have special markings -- a wrinkle Lucio did not clarify.\nWe rate his statement Mostly True.", "Interview, State representative speaks about toy guns,  KRGV-TV, Channel 5\n\nTelephone interview, Sara González, legislative director, state Sen. Eddie Lucio, Jan. 6, 2012\n\nTelephone interview, Justin Biddle, marketing manager, Umarex USA, Fort Smith, Ark., Jan. 12, 2012\n\nTelephone interview, J.J. Garza, chief of staff to state Rep. Rene Oliveira, Jan. 10, 2012\n\nTelephone interview, Meagan Dorsch, Director of Public Affairs, the National Conference of State Legislatures,  Jan. 13, 2012  \n\nTelephone interviews, Becky Johnson, reference librarian, Texas Legislative Reference Library, Jan. 10 and Jan. 18, 2012\n\nThe U.S. Code, 15 U.S.C.§ 5001: US Code-- Section 5001: Penalties for entering into commerce of imitation firearms\n\nTelephone and email interview, David Kopel, Jan. 18, 2012\n\nTelephone interview, Jeffrey Welty, assistant professor of public law and government, the University of North Carolina,  Jan. 23, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]