["About this rating", "On 8 October 2015, a Facebook post appeared to show a message from Hollywood actor Richard Gere. It said that he had given $100 to \"every homeless person\" he saw after going undercover as a homeless man in New York. The post with Richard Gere's name on it went viral. However, it contained a mixture of facts, exaggerations, and unsubstantiated stories.", "Richard Gere did play a homeless man in the film \"Time Out of Mind.\" While it's a stretch to say he went \"undercover\" as a homeless person for the movie, the approach his director had him take during its first day of filming was a bit unusual:", "On the first day of shooting his new movie, director Oren Moverman had an unusual task for his star, Richard Gere: He wanted the famous actor to stand in New York City's bustling Astor Place with an empty coffee cup begging for change.", "Moverman needed the scene for \"Time Out of Mind,\" in which Gere radically goes against type to play a homeless man. But the filmmaker soon realized it served another purpose.", "\"Richard stood there for 40 minutes‎. No one gave him a cent. No one even recognized him,\" Moverman said. \"And that proved the whole point: The homeless are all around us and we don't see them.\"", "Moverman hopes to heighten their visibility with his new film. Rigorously shot and calculatedly observational, \"Time Out of Mind\" is a look at a broken man's life over the course of several hopeless, restless days.", "Several other anecdotes about the actor going unnoticed while filming on the streets of New York emerged afterward. For instance, on April 24, 2014, the New York Post snapped a few photographs of the actor accepting charity in the form of a slice of pizza from an unsuspecting woman:", "Actor Richard Gere plays such a convincing homeless man that a kindhearted woman — who had no clue he was really a famous actor worth nearly $100 million — gave him a bag of food on the set of his latest movie in Midtown.", "Not a single New Yorker recognized the handsome star of “Pretty Woman” and “An Officer and a Gentleman,” who was dressed in shabby clothes and munching a burger from a trash can near Grand Central Station around 5:45 p.m. Tuesday.", "Sporting a ski cap and scruffy facial hair, Gere guzzled a beer from a brown bag amid rush-hour commuters as cameras shot the scene from across the street.", "The portion of the viral Facebook post which claims that Gere gave \"every homeless person\" he saw $100, however, was initially unconfirmed. This story originated on a fan page for the actor which is not officially endorsed by Richard Gere. While the words quoted in the post do summarize some of the events that occurred during the filming of \"Time Out of Mind,\" they do not comprise an actual quote from Richard Gere.", "Gere and screenwriter/director Oren Moverman later appeared in a Facebook Q&A during which the actor was asked about this rumor, and he responded by acknowledging that reports of his making $100 handouts to the homeless were \"fictional\":", "While the story that accompanied the photograph was somewhat fictional (especially the $100 handouts), it seemed to have touched something important in people. I’d like to find out what that is and what we can do together to make something good and meaningful happen for our homeless brothers and sisters.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]