["At the backdrop of the recent CBI raid on Kolkata police commissioner Rajeev Kumar’s residence over the issue of Saradha chit fund scam, a rumour on social media claims that “490 benami companies are registered to the address of the city police headquarters 9/12, Lal Bazar street 1st floor, room no. 9.”", "The claim was given birth to by self-proclaimed ‘whistleblower’ and ‘anti-corruption activist’ Neil Haslam in the morning of February 4. “I support CBI Raid against Calcutta Police commissioner’s office & commissioner himself,” was the ending statement of his tweet.", "HERE IS A LIST OF 490 BENAMI COMPANIES ALL REGISTERED TO CALCUTTA POLICE HQ", "9/12, LAL BAZAR STREET 1ST FLOOR, ROOM NO. 9 KOLKATA WB 700001 IN", "I support CBI Raid against Calcutta Police commissioner’s office & commissioner himself. #CBIRAID #ShellCompanies #Breaking pic.twitter.com/xcR06z6oJv", "— Neil Haslam (@neilhaslam90) February 4, 2019", "Responding to a few comments on his claim, Haslam said that he had sent the list to the finance ministry in 2017 itself. “Hence the raid,” he tweeted in reference to the income tax raid that took place two years ago in Kolkata’s Lal Bazaar. But more on that later.", "Haslam’s list of 490 benami companies is viral on Facebook and Twitter alike.", "BJP Delhi spokesperson Tajinder Pal Singh Bagga was among those who retweeted it.", "The claim, however, is far from the truth.", "The rumour claims that these fronts for earning black money are registered to 9/12 Lal Bazar, which is the address of the city’s police headquarters. However, the Kolkata police headquarters is located at 18, Lal Bazar. The address is given on the official website of the city police.", "Alt News also contacted Lal Bazar police station to confirm the address and we told the same location as mentioned on the website. 9/12 is the address of the Mercantile Building, the police informed.", "Upon cross-checking on Google maps, we found that the Mercantile Building (9/12 Lal Bazar) is situated at a distance of 200 metres from the Lal Bazar police headquarters (18, Lal Bazar).", "Moreover, the buildings look completely distinct from one another.", "The mismatch in addresses was enough evidence to invalidate Haslam’s claims.", "Haslam claimed that all the companies were registered to the same address – “9/12, Lal Bazar street 1st floor, room no. 9, Kolkata.” However, a quick glance at his list reveals that quite a few companies did not have the same address.", "For some of them, the floor and the block were different. More importantly, many of them had “mercantile building” written as part of the address. This further proved that while Haslam claimed that 9/12 was the address of Kolkata police headquarters, his list itself gave away that the location actually houses the city’s Mercantile Building.", "The Mercantile Building is a colonial-era construction in the Bengali heartland. It was built in 1918 and since then has become home to numerous offices. It was in the news in 2017 when law enforcement and revenue officials raided more than 400 shell companies working out of the building. An Economic Times article had misreported the address of this building as the Kolkata police headquarters.", "However, the raid had nothing to do with the Lal Bazar police station.", "“Still famous for colonial-era commodities such as tea and dying goods and services such as typewriters and wedding bands, the bustling area in central Kolkata is almost synonymous with the city police headquarters, housed in a red brick building at 18 Lalbazar Street. Right across the street is the dilapidated Mercantile Buildings at 9/12. In its recent crackdown on shell companies, the income tax (I-T) department has identified this address as the home of 90 per cent — or 300 — of such entities in the country,” read an August 2017 report by Business Standard.", "Another report by Reuters said, “A high-level task force leading the investigation has found hundreds of shell companies are registered in a few buildings in the eastern city of Kolkata, according to the government note reviewed by Reuters. More than 400 companies listed their address in a dimly-lit colonial-era building at 9/12 Lalbazar Street.”", "The reason why Haslam’s list includes addresses that start with “9/12 Lal Bazar” but have different floors and blocks is because various shell companies were registered to different rooms of the building.", "In conclusion, the rumours floating online are completely baseless. The address provided by Haslam is that of the Mercantile Building in Kolkata’s Lal Bazar and not the city’s police headquarters.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]