["मीडिया नहीं दिखायेगा, आप आगे बढ़ाइये ! अनुरोध है, देशहित के लिए ! #ElectionCommission (Media wont show you this, you take this forward in the interest of the nation! (translation).", "Along with the above message, a video has been posted on Facebook. The video shows a man being questioned inside a hotel room, in which Electronic Voting Machines (EVMs) are placed. The person is told that EVMs cannot be placed here and that he ought to be at the polling booth. Further, he is reprimanded by the interrogator for staying at a hotel, when he should have been at the facility provided by the Election Commission. Later, the video shows EVMs being shifted from the hotel room into a vehicle.", "मीडिया नहीं दिखायेगा, आप आगे बढ़ाइये ! अनुरोध है, देशहित के लिए ! #ElectionCommission", "Posted by News FYI Hindi on Monday, 27 May 2019", "The above video is 4:14 minutes long and has been posted by a page News FYI Hindi. The video has been viewed over 176,000 times already, and shared in excess of 12,000. The following text is superimposed on the video:", "‘ऐसा खेला गया चुनाव में का गन्दा खेल ? मीडिया नहीं दिखायेगा, आप आगे बढ़ाइये’ (Is this how the dirty EVM game was played? Media wont show, you take this forward- translation).", "The video in question has been shared now on social media, after the Lok Sabha election has concluded. This misleads social media users into believing that the video depicts a recent event related to the general election. However, this is not the case.", "The video represents a sting operation which was conducted by a journalist during the Madhya Pradesh assembly election of December 2018. The incident had taken place at a hotel in Shujalpur constituency in Shajapur district of MP. According to an article by The LallanTop, it was shot by a India Today stringer named Manoj Purohit. The incident had been reported by several news organisations including Newslaundry and Pune Mirror.", "The Chief Electoral Officer (CEO), Madhya Pradesh had taken cognizance of the incident and had issued a press note on December 1, acknowledging that the instructions of the EC were violated by the said officials, and that appropriate action had been taken against them.", "A video pertaining to the assembly election of 2018 in Madhya Pradesh, was shared with the implication that this is a recent incident. After the Lok Sabha election, several claims have floated on social media raising doubts over Electronic Voting Machines. In most cases, old pictures and/or videos are recirculated.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]