["At a Joe Biden rally in Pennsylvania on Oct. 24, the Democratic presidential candidate spoke on many issues, including taxes and climate change. According to one Facebook post, Biden also mixed in an insult.", "\"Joe Biden calls Pennsylvanian voters who don't support him 'chumps,'\" claims a meme shared by author and news personality Benny Johnson on his personal Facebook page. Beneath the text is an image of Biden taken at the rally by Agence France-Presse photographer Angela Weiss. \"This is what Biden really thinks of Pennsylvanians,\" Johnson wrote.", "Johnson's post has been shared more than 3,500 times since Oct. 25 and has more than 7,500 reactions. USA TODAY was unable to reach Johnson for further comment.", "Fact check:Decades-old joke about cattle guards ropes in Biden, Obama", "At the drive-in rally outside Bucks County Community College, a group of apparent supporters of President Donald Trump gathered. The group shouted, \"Four more years,\" according to CNN, while the former vice president spoke. For the most part, Biden ignored the hecklers, addressing them only during his concluding remarks.", "\"And by the way, we don’t do things like those chumps out there with the microphone are doing, the Trump guys. It's about decency,” he said.", "Images tweeted by ABC News' Beatrice-Elizabeth Peterson show a crowd of maskless people waving flags and holding up Trump signs standing to the side of Biden supporters.", "Fact check:Thin Blue Line flag has taken a prominent place at Trump rallies", "We rate this claim MISSING CONTEXT because without additional context, it might be misleading. Biden did use the word \"chumps\" during a drive-in rally in Pennsylvania on Oct. 24; however, the quote was directed at Trump supporters heckling the former vice president outside the event, not a generalized insult of Pennsylvania voters who disagree with him.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]