["About this rating", "The Clinton Global Initiative is downsizing and ending annual meetings as of 2017, as announced by former President Bill Clinton in a 22 August 2016 letter.", "The Clinton Foundation is not shutting down.", "On 16 January 2017, Fox News reported that the Clinton Global Initiative (CGI), an offshoot of the Clinton Foundation charitable organization, was downsizing:", "The Clintons are moving ahead with plans to downsize their controversial foundation’s network of offshoots, a decision carried out as the powerful family’s political influence wanes and its once-lengthy donor list shrinks.", "In a decision announced last week, 22 additional employees are being laid off from the Clinton Global Initiative — known for its annual glitzy gathering of high-powered leaders and celebs. The layoffs are tied to a decision to shutter CGI that originally was announced in an Aug. 22 letter from former President Bill Clinton.", "At the time, the Clintons were under pressure to explain how they would handle potential conflicts of interest with their namesake foundation if Democratic presidential nominee Hillary Clinton were to win the White House.", "The news left some readers with the mistaken impression the entire Clinton Foundation was shuttering its doors. However, as former President Bill Clinton announced in a 22 August 2016 letter, only the Clinton Global Initiative wing, and not the entire foundation, would be downsizing operations:", "Finally, the Clinton Global Initiative (CGI) has accomplished even more than I dreamed when it began in 2005, and we’ve made the decision that the Annual Meeting this September will be the last, and that we will no longer hold our CGI America meetings. Nine years ago in my book Giving, I wrote, “I want to continue these meetings for at least a decade, with the objective of creating a global network of citizen activists who reach across the divides of our interdependent world to build real communities of shared opportunities, shared responsibilities, and a genuine sense of belonging.” That is exactly what CGI, its members, and its dedicated staff have done.", "Brian Cookstra, spokesman for the Clinton Foundation, told us that while CGI is indeed downsizing, some staff will remain on board \"to work on ongoing commitments that are helping millions of people worldwide.\" Cookstra said the annual meetings are ending and staff has been let go, but CGI University, a meeting that brings college students together, will continue.", "The CGI, intended to find \"bold new ways to address global challenges,\" is only one of several initiatives that have operated under the Clinton Foundation umbrella (including the Clinton Health Access Initiative, the Clinton Climate Initiative, the Clinton Development Initiative, the Clinton Giustra Sustainable Growth Initiative, the Clinton Health Matters Initiative). The CGI is not the same thing as the Foundation itself, as CNN noted in an explainer article:", "Q: Is the foundation the same thing as the Clinton Global Initiative?", "A: The Clinton Global Initiative is part of the foundation. Bill Clinton started CGI in 2005. In contrast to other parts of the organization, it doesn't fund or manage projects, or handle any of the money involved. Instead, it's like the OKCupid of the charity world, matching funders with good causes. They do this at events throughout the year, including a big annual meeting in New York every September that's a who's who of global movers-and-shakers.", "Of course, it's possible that the winding down of the CGI is just a precursor of factors (e.g., unfavorable publicity, declining donations, the presumably permanent retirement of Mrs. Clinton from the political arena) that will lead to a major scaling down — or possibly the end — the Clinton Foundation itself, but for the moment the Foundation itself is still a going concern.", "Derespina, Cody.   \"Clinton Global Initiative to Lay Off Employees, Shut Down Amid Dwindling Donations.\"\r\nFox News.   16 January 2017.", "Braun, Stephen, and Eilleen Sullivan.   \"Many Donors to Clinton Foundation Met with Her at State.\"\r\nAssociated Press.   23 August 2016.", "Clinton, Bill. \"Empowering People to Build Better Futures for Themselves, Their Families, and Their Communities.\"\r\nThe Clinton Foundation. 22 August 2016.", "Gaouette, Nicole. \"What Is the Clinton Foundation and Why Is It Controversial?\"\r\nCNN. 24 August 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]