["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A misleading headline purporting to link Hillary Clinton and top aide Huma Abedin to a mysterious New York death has blown a small connection way out of proportion.", "\"Hillary in hiding as police discover dead body hidden in Huma Abedin’s dumpster,\" said a July 12, 2018, headline from Mad World News, a conservative website that has peddled falsehoods before.", "This story was flagged as part Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "\"Another dead body has turned up in connection to Hillary Clinton,\" the story said. \"This time, the remains of a woman were found in a dumpster at Huma Abedin’s New York apartment. Hillary has gone into hiding as Huma’s neighbors told the cops they believe the death has something to do with Anthony Weiner’s recent conviction.\"", "Authorities did find a woman dead in the trash compartment of a New York apartment building on July 10, 2018. But allegations implicating Clinton or Abedin in the incident are uncorroborated.", "Let’s take a look at what actually happened, according to credible reports detailing the tragedy.", "On July 10, police responded to Zeckendorf Towers, an upscale apartment complex in New York. There, they \"discovered a 48-year-old female unconscious and unresponsive inside a trash compactor,\" police told the New York Post. The woman, who was later identified as building resident Lara Prychenko, was found by a maintenance worker.", "Surveillance video later showed her in a nearby elevator moments earlier, where she left her handbag before entering the hallway. Police later told reporters they believed she may have fallen down the chute while drunk.", "Abedin and her ex-husband, imprisoned former congressman Anthony Weiner, previously owned an apartment in the same complex. The former couple reportedly owned the apartment for multiple years, but listed it for rent on March 19, 2017, the same day Weiner pleaded guilty for explicit texts to a minor and Abedin filed for divorce. The listing was taken off the market days later, though it is not clear whether the apartment was sold or taken off the market for another reason.", "Most news outlets referred to the building as a place that Abedin \"used to call home.\"", "Regardless, the trash compactor where the dead woman was found was commonly shared. It was not \"Abedin’s dumpster,\" despite what the Mad World News story said.", "Further, apartment residents did not tell cops and NBC \"they believe the death has something to do with Anthony Weiner’s recent conviction.\" According to the NBC report cited in the Mad World News story, the neighbors actually \"said they initially thought the police presence had something to do with the building's famous resident, Anthony Weiner.\"", "Clinton, for her part, has not actually gone into hiding. She has been active criticizing President Donald Trump and promoting her upcoming events on Twitter and Facebook. Three days after the body was discovered, she addressed a teachers union conference in Pittsburgh. She is also set to attend a festival in New York on July 21, 2018, according to her Twitter.", "The New York Police Department did not respond to a request for comment.", "A headline said, \"Hillary in hiding as police discover dead body hidden in Huma Abedin’s dumpster.\"", "A dead body turned up in the trash compactor at the same apartment building that Abedin used to call home, but we could not find any evidence that Abedin and Clinton played any role in the incident or were implicated in the police investigation.", "We rate this statement False.", "Mad World News, \"Hillary In Hiding As Police Discover Dead Body Hidden In Huma Abedin’s Dumpster,\" July 12, 2018", "The New York Times, \"Woman Found Dead in Manhattan Trash Compactor,\" July 11, 2018", "New York Post, \"Woman found dead in trash compactor of swanky NYC apartment building,\" July 10, 2018", "ABC News, \"Police ID woman found dead in trash compactor at New York City condo building,\" July 11, 2018", "NBC New York, \"Woman Found Dead in Trash Compactor at Luxury Manhattan Building: Police,\" July 10, 2018", "Daily Mail, \"Mystery as woman, 48, is found dead in the trash compactor machine at Anthony Weiner and Huma Abedin's former Manhattan apartment block home,\" July 11, 2018", "Fox News, \"Hillary Clinton top aide Huma Abedin's former posh home is scene of grisly trash compactor death,\" July 11, 2018", "CBS Pittsburgh, \"Hillary Clinton Addresses Teachers Union Conference At Convention Center,\" July 13, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]