["“Beef products sold at Walmart recalled due to E. coli,” reads the headline of the article published on February 5, 2020.", "It claims that the Canadian Food Inspection Agency (CFIA) issued a recall on all beef products sold at Walmart stores in the country on February 3. The recall was allegedly expanded to include products sold at “Pusateri’s Fine Foods, and others in Ontario, Quebec, Alberta, Saskatchewan, Manitoba, Nunavut, Northwest Territories, and New Brunswick.”", "But the CFIA’s website, which lists all active food recalls in the country, shows that there has not been a recent recall for beef products of any kind, nor were there any recalls issued on February 3.", "Marsha Johnston, the agency’s spokeswoman, confirmed that “the CFIA did not issue a recall.”", "“Walmart Canada does sell beef products and there are no recalls on any of these,” Felicia Fefer, a Walmart representative, told AFP by email.", "The last CFIA warning for any beef product was published on January 17 and was about a type of beef sausages made by VG Meats and sold in Ontario.", "It is highly unlikely that a recall for beef products was issued on February 3 and subsequently deleted, because recalls usually remain on CFIA’s website “for a few years in case someone still has some of the product in their freezer,” Christine Carnaffan, another CFIA spokesperson, told AFP.", "AFP Fact Check has debunked false content from the source of this incorrect warning, toronto-ontario.news, in the past. In July 2019, the website warned of an E. coli outbreak affecting lettuce sold in the central Canadian province of Ontario.", "AFP also debunked false reports of a recall of 400 million eggs in Canada in June 2019 due to a salmonella outbreak.", "Consumers who want more information about product recalls in Canada can learn about the food safety investigation process on this webpage.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]