["The claim was shared over 7,800 times after it was published on Facebook here on April 5, 2020.", "Below is a screenshot of the misleading post:", "The post’s Thai-language text graphic translates to English as: “Malaysia gives money to everyone to combat COVID-19 at 8,000 baht [245 USD] for 6 months. They already got it. No need to pay for the electricity bills for 6 months. What about Thailand? Very selective for 5,000 baht [153 USD]?”", "The posts circulated after the Thai government announced that eligible workers can apply to receive 5,000 baht from a government COVID-19 relief package. Todsaphon Kritwongwiman, Secretary-General of the Social Security Office, detailed the aid in this statement broadcasted by ThaiPBS, Thailand’s national broadcaster.", "A similar claim comparing Thailand's coronavirus relief package with Malaysia's was also published on Facebook here, here, here and here.", "The claim is misleading. On March 27, 2020, the Malaysian government unveiled measures in the form of the Prihatin Rakyat Economic Stimulus Package in a bid to boost the economy during the novel coronavirus pandemic.", "According to a Ministry of Finance document, the government said it would provide financial assistance to lower income households. An estimated nine million people in Malaysia, out of a population of 31.6 million, were expected to receive the cash aid, the ministry said.", "The one-off payments were capped at 1,600 Malaysian ringgit (12,000 Thai baht or 370USD) for almost four million households earning less than 4,000 Malaysian ringgit per month, as stated in this report published by Malaysian news site The Edge Markets on March 28, 2020.", "The Star, an English-language newspaper in Malaysia, reported on April 6 that eligible households and individuals had started to receive assistance that week.", "Below is a screenshot of The Star’s article:", "The Ministry of Finance document also notes that discounts would be given on electricity bills, but it does not state the fees would be waived entirely.", "Tenaga Nasional Berhad, Malaysia’s only electricity provider, said in a statement that electricity bills would be subsidised during the crisis.", "Below is a screenshot of the Tenaga Nasional Berhad’s announcement:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]