["About this rating", "Gravity Payments CEO Dan Price rented out his house during part of the year via Airbnb after raising his company's minimum wage and taking a steep pay cut.", "Dan Price chose to rent out his house and did not have to do so as an austerity measure.", "On 2 January 2017, former Alaska governor Sarah Palin posted a message referencing a quote from former British prime minister Margaret Thatcher about socialism, along with a link to a story about Dan Price, the CEO of Gravity Payments, who took a drastic pay cut to raise the minimum salary at his company to $70,000 and then had to rent out his home in order to make ends meet:", "The linked story was not current news; it was originally published by Young Cons on 1 August 2015:", "Back in April we told you about Dan Price, CEO of Gravity Payments, who said he would pay every single one of his employees $70,000 annually.", "Every single one, from the lowest skilled workers on up.", "Now, as expected, Price has fallen on hard times financially, even having to rent out his own home.", "The Young Cons article was based on a comment Price made in a video interview with the New York Times. Price, who slashed his own $1 million pay package to provide a minimum salary of $70,000 to all his employees, told the newspaper that he had received mixed reactions about the new pay structure and was still adjusting to life on his own much lower salary.", "Price's relevant comments come at the 2:30 mark of the following video:", "My hope is that I'll be right at the end of the day. But I actually don't think that the idea is so good to guaurantee that I'll be right. I'm working as hard as I've ever worked to try to make it work.", "I'm renting out my house right now to make ends meet for myself. I haven't made this little amount of money since I was in my early 20s. It helps that I'm 31 and don't have kids. And no girlfriend to tell me I'm crazy.", "Price did indeed put his house up for rent on AirBnB (an online marketplace and homestay network). The first review for the listing was posted in June 2015, and the house was reviewed eight additional times (with the most recent review as of this writing coming from August 2016).", "However, Price's actions didn't necessarily demonstrate any failings of socialism, indicate that Gravity Payments was suffering financially, or show that Price had \"fallen on hard times.\"", "Price told Today in August 2016 (more than a year after he made his initial salary announcement) that some of the financial adjustments he made, such as renting out his house during the summer, were neither permanent nor based purely on financial necessity:", "Price himself made some cutbacks to adjust to the lower salary, although more out of sensibility than necessity. He now rents his house on Airbnb during the summer to make extra cash, and sleeps in the guest room at a friend’s house.", "“You might call it a sacrifice,” he said, speaking from the borrowed room. “But to me, it’s fun. It feels good.”", "Price is quick to state the obvious: that any life adjustments he’s made as a result of earning less after earning so much more are hardly “putting me in some horrible, awful position.”", "Of course, even as he's emerged as a champion for income equality, he won’t be making $70,000 forever, and that was never the plan.", "“When I made the announcement, I said I would just put my salary back where it was once the company’s profits had gone back to where they were,” Price said. “I expected us to take a big step backwards.”", "Price's salary adjustments sparked massive interest in Gravity Payments (a credit card processing company), and according to an article published by Inc Magazine, the company's revenues and profits doubled in the six months following Price's announcement:", "Six months after Price's announcement, Gravity has defied doubters. Revenue is growing at double the previous rate. Profits have also doubled. Gravity did lose a few customers: Some objected to what seemed like a political statement that put pressure on them to raise their own wages; others feared price hikes or service cutbacks. But media reports suggesting that panicked customers were fleeing have proved false. In fact, Gravity's customer retention rate rose from 91 to 95 percent in the second quarter. Only two employees quit — a nonevent. Jason Haley isn't one of them. He is still an employee, and a better paid one.", "We talked to a close associate of Dan Price's at Gravity Payments who confirmed all of the above for us.  Mr. Price chose to put his house up on Airbnb during the summers months not out of financial necessity, he said, but because Price lives alone and has far more room than he needs (in addition to plenty of friends and acquaintances in the area with whom he can stay), so why not let others enjoy his beautiful home part of the year and raise some extra revenue in the process?  He also noted that because the company's revenues and profits have shot up dramatically since the minimum wage announcement (rather than sharply declining, as initially expected), Price could have returned his salary to its previous much higher level but has so far opted not to.", "Murray, Rheana.   \"Gravity Payments' $70K Minimum Salary: CEO Dan Price Shares Result Over a Year Later.\"\r\n    Today.   11 August 2016.", "Keegan, Paul.   \"Here's What Really Happened at That Company That Set a $70,000 Minimum Wage.\"\r\n    Inc Magazine.   November 2015.", "Cohen, Patricia.   \"A Company Copes with Backlash Against the Raise That Roared.\"\r\n    The New York Times.   31 July 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]