["The post claims that research carried out by an American NGO has concluded that men are likely to die after “cutting the foreskin of their manhood” due to a medication that “reacts after 10 years”.", "It was first published on a Facebook page called Malawian Eye on August 20, 2018, and began circulating again recently in Africa. The claim is that an NGO named “Deltas Clare” or “Delta Clare” -- two different spellings are used -- has written a report proving that the West has pumped billions of dollars into campaigns for circumcision in Africa with the intention of “wiping out the black race”.", "The same claim was found on online news sites such as Uganda Spy, the Zambian Observer and The Independent Observer Zambia.", "The post also claims that the report was published on the WikiLeaks website.", "A non-existent report from a non-existent NGO", "However, a search on the WikiLeaks database does not return any results for either “Deltas Clare” or “Deltas Clare”. In fact, there is no sign of any such organisation anywhere online. A Google search for the non-existent NGOs purported name(s) reveals several fact-checking articles, including one by Malawi24 that debunked the circumcision claim after it first emerged back in 2018.", "Collins Boakye, a spokesman for the World Health Organization (WHO) regional office in Africa, told AFP Fact Check that the information in the post is false.", "“There is no such organisation called Delta Clare,” he said, adding that the purported report cited in the post was nowhere to be found.  “If such a study and evidence exists and is made available, WHO would review it as per normal processes.”", "No specific medicine", "Dr. John Chol, a surgeon at Juba Teaching Hospital and a lecturer at the University of Juba, South Sudan, told AFP Fact Check there is no special medication used for circumcision.", "“Circumcision is a simple surgical procedure. Sometimes we use a pain killer and a simple antibiotic,” he said.", "He added that many men from different age groups get circumcised and they do not experience early deaths. “Here, in South Sudan, many were circumcised after getting married, and yet after their circumcision, they are still alive for more than ten years.”", "Dr. Odion Aire, a urologist at The Urology Hospital in South Africa, told AFP Fact Check that he was not aware of any medication specifically associated with circumcision.", "“I have not heard anything about any form of medication associated with circumcision, even between the cultural/traditional circumcision and the medical circumcision, that is of any potential danger to [life].”", "However, he says traditional circumcisions conducted outside of medical settings, which are common practice in many countries across Africa, are linked to an increased risk of death.", "“It's difficult to know the exact causes but the identified belief right now is sepsis -- an infection from a surgical procedure which was done under septic circumstances that led to the introduction of organisms or infection into the bloodstream of the patient,” he said.", "If someone died during a circumcision carried out in a medical setting, Aire said it would be “more likely to be related to the anaesthetic or anaesthetic complications, which by itself is exceedingly rare and would be classified as a medical freak accident”.", "He cautions that sharing false information is dangerous because “in doing so it's actually preventing a very simple procedure which has maximum benefits in terms of the fight against HIV, which is so critical in the African context”.", "According to the WHO, there is evidence that male circumcision reduces the risk of heterosexually-acquired HIV infection in men by approximately 60 percent.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]