["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jim Kenney’s proposed soda tax went national last week.", "Hillary Clinton led off what became a back-and-forth political battle by voicing her support for the tax at a forum in Philadelphia. Bernie Sanders chimed in later to call the tax regressive.", "Kenney fired back in an editorial on Huffington Post that his proposal, which would levy a three cent per ounce tax on distributors, was a \"corporate tax\" and said Sanders was siding with beverage corporations. Then Sanders responded with an editorial of his own, in Philly Mag. He basically gave an elongated version of what he said earlier in the week, which was, \"A tax on soda and juice drinks would disproportionately increase taxes on low-income families in Philadelphia.\"", "Is Sanders correct? Or was this political grandstanding?", "Berkeley, Calif., remains the lone American city to enact a sugary drink tax. It taxes the distributors of sodas and similar beverages like sports drinks 1 cent per ounce. Studies have shown some of the cost of tax has been passed on to consumers. A Cornell study found about 25 percent of it was passed on, and a University of California-Berkeley study found the amount to be between about 50 to 70 percent, depending on the type of beverage. The prices of soft drinks were more likely to go up at supermarkets than chain drug stores.", "Carl Davis, the research director at the Institute on Taxation and Economic Policy, told Billy Penn last month soda taxes like the one proposed by Philadelphia are \"imperfect:\" \"The first thing you realize is that it is regressive. It’s going to hit lower and more moderate income families more heavily than higher-income families.\"", "William Shughart, a Utah State University professor and sin tax expert, explained taxes like the one proposed by Kenney disproportionately affect lower income residents because a greater amount of their income is used on food and drinks.", "Warren Gunnels, senior policy advisor for Sanders, said in an email, \"It would make much more sense to finance universal pre-school in Philadelphia by raising taxes on its wealthiest residents, who currently benefit from flat state and city tax rates. Right now wealthy Philadelphians pay state income tax of 3.07 percent, an unemployment tax of 0.07 percent, and a city income tax of 3.92 percent. That’s a total state and local tax burden of 7.06 percent. By contrast, New York City’s wealthiest residents pay a top rate of 12.6 percent.\"", "Such a plan would be easier said than done, according to Kenney’s administration. \"Because of the uniformity clause, it’s constitutionally impermissible right now in Pennsylvania to raise the income tax rate only for wealthy individuals,\" said Lauren Hitt, Kenney’s communications director. \"The Republican controlled state legislature would have to change the constitution and we’re not holding our breath on that one. Our kids need Pre-K now.\"", "Kenney has said the tax is not regressive because he believes the money will stay in the neighborhoods. His finance director, Rob Dubow, said most consumers of sugary drinks are in poor neighborhoods. When Dubow suggested distributors would absorb some of the tax, City Council president Darrell Clarke responded, \"Fundamentally, I don’t believe that.\"", "Our ruling", "Sanders said Kenney’s proposed soda tax would disproportionately increase taxes for low income families. In the only other instance of a soda tax in the United States, studies have shown somewhere between 25 and 70 percent of the cost of the tax gets passed to consumers. Tax experts say if this tax reaches the consumer level it would affect low income residents to a greater extent.", "We rule the claim True.", "https://www.sharethefacts.co/share/19db2be2-02d7-4cfd-baa1-423db2d4d80f", "Interview, Carl Davis, research director at the Institute on Taxation and Economic Policy.", "Interview, William Shughart, Utah State University professor and sin tax expert.", "News article, \"Bernie Sanders says Jim Kenney’s soda tax is regressive,\" Philadelphia, April 22, 2016.", "News article, \"Clinton ‘very supportive’ of Philadelphia soda tax,\" CNN, April 21, 2016.", "News article, \"Experts: Philadelphia’s poor will pay for Jim Kenney’s ‘imperfect’ soda tax,\" Billy Penn, March 1, 2016.", "News article, \"Kenney official admits soda tax would hit poor neighborhoods the hardest,\" Billy Penn, March 29, 2016.", "News article, \"Study: Berkeley soda tax falls flat,\" Cornell Chronicle, August 17, 2015.", "News article, \"Berkeley’s soda tax boosts retail prices of sugary drinks, study confirms,\" Berkeley News, October 7, 2015.", "News article, \"Sen. Sanders should refute his support for corporate opposition to a beverage tax,\" Huffington Post, April 23, 2016.", "Tweet, Darrell Clarke via Julia Terruso, March 29, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]