["The ten second video was shared in this Facebook post on June 13, 2019.", "The footage shows a woman shouting at Hong Kong riot police. One officer points a thin black object at the woman’s face before an explosion is heard and the woman recoils. The man next to her is then seen pulling her away.", "The misleading post’s caption says: “A woman shot in the head by Hong Kong Police.”", "Below is a screenshot of the post:", "The video was shared one day after police clashed with demonstrators in Hong Kong during a protest against a proposed extradition law on June 12, 2019. Here is an AFP report about the unrest.", "The day after the clashes, groups including Amnesty International Hong Kong and the Hong Kong Bar Association criticised what they said was excessive use of police force. Here is an AFP report on the claims.", "The same video was viewed thousands of times after being posted on Twitter here with a caption saying: “Hong Kong Police Professionalism - shoot a woman, a mother as well, closely #HK69parade #香港反送中大游行 #extraditionbill #HongKongProtests #HongKong #HongKongPolice #HKPD”.", "The same footage has also been included in longer videos, which make similar claims and have been viewed tens of thousands of times on Facebook here and here, on Twitter here, and YouTube here.", "The longer videos include additional footage taken from this video by HK television channel i-Cable News which show the same female protester, at 1:12, pleading with police.", "But the claim is false; the misleading footage actually shows one police officer pointing his baton at the woman while another officer nearby detonates a tear gas canister.", "An analysis of keyframes from the video shows the police officer points his baton at the woman’s face at the five second mark.", "Below is a screenshot of the video paused at the five second mark:", "Below is a zoomed in screenshot of the video at the five second mark with the baton circled in red:", "Here is an AFP photo taken the same day of other Hong Kong police officers holding batons.", "Below is a screenshot of the photo:", "Also at the same time -- the five second mark in the video in the misleading posts -- another police officer can be seen detonating a tear gas canister, which causes a loud bang.", "Below is a screenshot of that moment with the tear gas canister circled in red:", "The same officer then throws the tear gas canister high into the air, while the man standing on the woman’s left hand side pulls her away from police.", "Below are two screenshots of the moment the police officer throws the canister (L) and the moment it sails through the air (R) with the canister circled in red:", "The same incident was filmed from a different angle in this longer Facebook live video published on June 12, 2019 at 5.21pm.", "In the Facebook live video, the police officer can be seen detonating a tear gas canister at 6:50. The same female protester can then be heard again shouting at police, before walking away unaided.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]