["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Demonstrators protesting a Senate health care bill hold signs in Cleveland on Tuesday, June 27, 2017. (AP)", "A liberal super PAC says repealing the Affordable Care Act could lead to dire consequences for the health of Ohioans and hurt the economy.", "\"Repealing the Affordable Care Act — and with it, Ohio’s Medicaid expansion — could cost Ohio more than 81,000 jobs, jeopardize nearly 1 million Ohioans’ health care coverage, and leave more than 220,000 Ohioans with mental illness or substance use disorders without insurance,\" claimed the For Our Future PAC on its Stop Mike DeWine website.", "For Our Future PAC, launched by California billionaire Tom Steyer and unions, is targeting Republicans including Ohio Attorney General Mike DeWine, who is running for governor against Democrat Richard Cordray.", "DeWine unsuccessfully sued in an effort to overturn the health care law. Republicans have repeatedly tried and failed to achieve a repeal.", "We found that the statements require more explanation about the impact of repealing the Affordable Care Act.", "The left-leaning Economic Policy Institute published an analysis related to jobs and the Affordable Care Act in March 2017. At the time, the Republicans were pursuing the American Health Care Act, a bill to repeal the Affordable Care Act. The bill never became law.", "The first thing to know about economist Josh Bivens’ analysis is that he didn’t predict layoffs but instead came up with a rough estimate of the potential drag on job growth if the repeal occurred. For Ohio, that number was 81,385 jobs.", "The For Our Future PAC’s website doesn’t take into account the caveats in the report which stated: \"Given all of this uncertainty, we present our findings as a drag on potential job growth, rather than as clear predictions of ‘jobs lost.’\"", "George Washington University experts came up with a lower estimate for job losses in Ohio by 2026 based on the House bill and a higher one for the Senate bill.", "However, other experts have expressed doubts that repeal would lead to such a high number of job growth losses or that it’s possible to put a precise prediction on job losses.", "Joe Antos, a health care expert at the conservative American Enterprise Institute, said such analyses take \"an extreme view that everything is going to collapse.\"", "Antos said if the Affordable Care Act were repealed, he would expect some initial reduction in employment in the health care sector but some increase in other sectors.", "\"On balance, what happened to employment, I don’t know,\" he said.", "Antos said that the predictions about job losses by Democrats are similar to the predictions by Republicans in 2010 that the requirements for small firms to cover employees would create massive disruption, but that ultimately didn’t happen. (We have fact-checked several claims that the Affordable Care Act is a \"jobs killer\" and repeatedly found the evidence fell short.)", "Two experts on health care economics, Jean Abraham at the University of Minnesota and Anne Beeson Royalty at Indiana University, reviewed literature and concluded that the Affordable Care Act had minimal effect on employment, hours of work, and compensation.", "For Our Future pointed to analysis by the Urban Institute in 2017 that analyzed the implications of partial repeal through the budget reconciliation process, an approach considered by Congress at that time. The Urban Institute predicted that it would lead to an increase of the uninsured population in Ohio of 964,000.", "However, the Urban Institute has done a more recent analysis of full repeal and nationally found a smaller number for how many would be uninsured due to policy changes. It didn’t publish new estimates for the states; however, Linda Blumberg, a health policy expert at the Urban Institute, said it would be lower than the 964,000 figure.", "There are about 1 million people in Ohio who are insured through the Affordable Care Act, including about 230,000 people through the marketplace and almost 700,000 as a result of expanded Medicaid.", "This part of the statement refers to research by Harvard health economics professor Richard Frank and New York University Dean Sherry Glied. They said in January 2017 that repealing the Affordable Care Act would have \"stark effects on those with behavioral health illnesses.\"", "Nationwide, the researchers estimated that approximately 1.25 million people with serious mental disorders and about 2.8 million Americans with a substance use disorder, would lose some or all of their insurance coverage if the federal health care law was repealed.", "They found that repealing the health care law would particularly harm states hit hard by opioid deaths, including Ohio where 220,512 people with addiction or mental health disorders have coverage through the law’s marketplace or Medicaid expansion.", "Since there is no Obamacare replacement bill under serious consideration right now, it’s unknown whether all of these people would end up uninsured.", "For Our Future Ohio PAC said \"repealing the Affordable Care Act — and with it, Ohio’s Medicaid expansion — could cost Ohio more than 81,000 jobs, jeopardize nearly 1 million Ohioans’ health care coverage, and leave more than 220,000 Ohioans with mental illness or substance use disorders without insurance.\"", "The statement about jobs ignores the caveats in the study by the Economics Policy Institute. The study came up with a number about the potential drag on job growth under a scenario that was pushed by Republicans in 2017 but that never became law. It does not refer to job layoffs.", "About 1 million Ohioans are currently covered by the Affordable Care Act. An academic study found that about 220,000 Ohioans with addiction or mental health disorders have coverage through the law. However, since there isn’t a repeal-and-replace bill under serious consideration right now, it’s difficult to predict how many people in Ohio would be left without coverage.", "We rate this claim Half True.", "Stop Mike DeWine, Accessed July 2, 2018", "Columbus Dispatch, \"1 million Ohioans to lose health coverage under Obamacare replacement,\" May 25, 2017", "Economic Policy Institute, \"How many jobs could the AHCA cost your state?\" March 24, 2017", "George Washington University Milken Institute of Public Health, The Economic and Employment Consequences of Repealing Federal Health Reform: A 50 State Analysis", "Ohio Medicaid office, Actual vs estimated Medicaid eligibles, FY 2018", "Congressional Budget Office, H.R. 1628, American Health Care Act of 2017, May 24, 2017", "Policy Matters Ohio, Repeal of Health Law Threatens Ohio Residents, January 2017", "Urban Institute, The ACA Remains Critical for Insurance Coverage and Health Funding, Even without the Individual Mandate, June 2018", "Washington Post The Fact Checker, \"Pelosi's claim that an estimated 1.8 million jobs will be lost through AHCA,\" June 20, 2017", "New York Times, \"Democrats Are Unified, but Not Always Accurate, on Health Bill Attacks,\" March 22, 2017", "Commonwealth Fund, The Better Care Reconciliation Act: Economic and Employment Consequences for States, July 6, 2018", "Commonwealth Fund, The American Health Care Act: Economic and Employment Consequences for States, June 14, 2017", "PolitiFact, \"Sherrod Brown credits Obamacare for helping pay for opioid treatment,\" April 20, 2018", "Interview, Daniel van Hoogstraten For Our Future - Ohio spokesman, July 2, 2018", "Interview, Joe Antos, American Enterprise Institute, July 2, 2018", "Interview, Amitabh Chandra, proofessor of Social Policy and Director of Health Policy Research at the Harvard Kennedy School of Government, July 2, 2018", "Interview, Gail Wilensky, economist and senior fellow at Project HOPE, and director of the Medicare and Medicaid programs from 1990 to 1992, July 2, 2018", "Interview, Linda Blumberg, Institute Fellow in the Health Policy Center at the Urban Institute,", "Interview, Leighton Ku, Professor, Dept. of Health Policy and Management Director, Center for Health Policy Research Milken Institute School of Public Health George Washington University, July 2, 2018", "Interview, Josh Eck, Mike DeWine campaign spokesman, July 2, 2018", "Interview, Dan Tierney, Attorney General Mike DeWine spokesman, July 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]