["Even if nothing changes, Tuesday’s election would be a historic win for Republicans.\n\nGov. Chris Christie said in a recent radio interview that decades of history show governors lose seats in their first midterm election. But he said this year will be different.\n\n\"Over the last 48 years, every governor at the midterm of his first term or her first term has lost seats in the Legislature, with the exception of Jim McGreevey in 2003, who was working off a newly gerrymandered map,\" Christie said Oct. 26 on WCBS 880 AM.\n\nChristie said the Republicans face a gerrymandered map this year, \"gerrymandered in favor of the Democrats\"\n\n\"But despite that we're going to make history. You will not see the Republican party lose seats ... in two weeks. And my prediction is you'll see us gain seats,\" he said.\n\nAll 120 seats in the state Legislature are on the line Tuesday. Of those, Democrats hold 71 and Republicans hold 49.\n\nAs Tuesday approaches, Christie -- and his party -- have repeated in public speeches and internal memos the claim about historical midterm losses.\n\nPolitiFact New Jersey found it’s true.\n\nSince Richard Hughes, a Democrat, took office in 1962, the governor’s party has lost seats in the Legislature in the governor’s first midterm election. McGreevey, also a Democrat, is the only exception.\n\nSome New Jersey governors faced worse losses than others. William Cahill lost 26 Republican seats in the 1971 election. Fellow Republican Christine Todd Whitman lost two seats in 1995.\n\nIn 1991, Republicans gained control of 31 Democratic seats in Jim Florio’s first -- and last -- midterm election. Fellow Democrat Jon Corzine lost one legislative seat to Republicans in 2007 in what would also be his only midterm election.\n\nMcGreevey picked up six Democratic seats in the state Legislature in 2003. He was the first governor to gain seats since Robert Meyner, a Democrat, did in the 1950s.\n\nThis trend is not unique to New Jersey.\n\nSince Harry Truman became president in 1945, the president has lost seats in Congress in the midterm of his first term, except George W. Bush in 2002.\n\nSo what gives?\n\nThe public has a somewhat schizophrenic attitude toward politicians, said John Weingart, associate director of the Eagleton Institute of Politics at Rutgers University.\n\nOn one hand the public thinks \"they are all useless, at best,\" he said. On the other hand the public expects \"great things from them. And then there is a disappointment when they’re not able to change the world in two years or four years.\"\n\nBen Dworkin, director of the Rebovich Institute for New Jersey Politics at Rider University, said \"governors typically come in on a wave and when the governor is no longer at the top of the ticket some of the people who were elected during the gubernatorial election might not be as strong.\" They \"ride in on somebody’s coattails and then you don’t have the coattails anymore,\" he said.\n\nBut, Dworkin said, the Republicans have \"have been downplaying expectations\" and have positioned themselves \"to be able to spin a positive message regardless of what the results are\" on Tuesday. \n\n\"If the Republicans just stay even,\" it’s a victory, he said. But if the Republicans \"win one or two or potentially five or six seats\" between the Senate and Assembly it’s a \"huge, huge victory, even if they don’t take control of the Legislature.\"\n\nOur ruling\n\nChristie said for more than 48 years, every governor of New Jersey has lost legislative seats at the midterm of his or her first term, with the exception of McGreevey in 2003.\n\nBesides McGreevey, you have to go back to the the 1950s to find a governor who has picked up legislative seats from his or her party in the first midterm election.\n\nWe rate Christie’s statement True.", "To comment on this ruling, go to NJ.com.", "CBS New York,Interview with Gov. Chris Christie, Oct. 26, 2011\n\nManual of the Legislature of New Jersey, pgs. 306-310 and pg. 516, accessed Oct. 31, 2011\n\nInterview with John Weingart, associate director of the Eagleton Institute of Politics at Rutgers University, Nov. 2, 2011\n\nEmail interview with Larry Sabato, director of the Center for Politics at the University of Virginia,\nNov. 2, 2011\n\nInterview with Ben Dworkin, director of the Rebovich Institute for New Jersey Politics at Rider University, Nov. 2, 2011\n\nThe American Presidency Project,  Seats in Congress Gained/Lost by the President's Party in Mid-Term Elections, accessed Nov. 1, 2011\n\nPolitiFact, Do presidents always get \"shellacked\" in midterm elections?, Sept. 7, 2010\n\nPolitickerNJ, NJGOP memo: trend against gains for sitting Gov., Oct. 31, 2011", "The Star-Ledger, The winning strategy: A midterm governor keeps a low profile, Nov. 5, 2003\n\nThe Star-Ledger, Democrats seize control of both legislative houses, Nov. 5, 2003\n\nNew Jersey Lawyer, McGreevey is no Arnold, but N.J. is no California, Oct. 20, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]