["Photographs of burned ballot papers have been shared in Facebook posts that claim they show evidence of fraud in the 2020 Myanmar elections. The claim is false; the photos actually show ballots from Myanmar’s 2015 election which were destroyed by local authorities after the poll, in accordance with election law.", "The photos, which have been shared widely on Facebook for example here on January 3, 2021, show partly-burned yellow ballot papers.", "The Burmese-language caption translates to English as: “Don’t know where it occurred or in which township. Election fraudsters! Now they are trying to get rid of the evidence. It is a crime. Thieves, what are you guys afraid of after committing election fraud?”", "Similar claims have been published in multiple Facebook posts, including here, here and here.", "But the claim is false.", "The ballots seen in the misleading posts are yellow, which was the colour of ballots used during Myanmar’s historic 2015 election.", "Below is a photo comparison of AFP photo in the 2020 election (L) and AFP photo in the 2015 election (R).", "The colour of the ballots can also be seen in other media reports in 2015 here and here and 2020 here and here.", "Below is a screenshot comparison between photos from the 2020 election (L) and photos from the 2015 election (R):", "The burned ballots that can be seen in the misleading post were destroyed by local authorities as they could no longer store the old, unused ballot papers, a Union Election Commission (UEC) official said in this Facebook post.", "The sub-commission office in Tounggup township in Rakhine state burned old ballots and documents from the 2015 election on December 30, 2020 in accordance with Myanmar election law as they lacked space to store them.", "The post’s caption says in part: “As the sub-commission office in Tounggup township needs space to store records and documents from the 2020general election, documents and ballot papers from the 2015 election were destroyed on December 30, 2020 at 15:00 in accordance with Myanmar election law.”", "U Myint Lwin, Chairman of the Union Election Commission for Tounggup township told AFP Fact Check by phone on January 6, 2021 that they had carried out the destruction of the ballots and documents in accordance with Myanmar election law.", "He also stressed that they had burned documents and ballots from the 2015 election, nothing related to the 2020 election.", "U Myint Lwin said, “We carried out destroying ballot papers and documents from the 2015 general election as per the UEC’s order. We didn’t burn ballot papers, documents and anything related to the 2020 general election.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]