["By Angelo Fichera", "Posted on July 24, 2019", "Fox News is airing the congressional testimony of former special counsel Robert S. Mueller, contrary to social media posts claiming otherwise.", "As former special counsel Robert S. Mueller testified before the House Judiciary Committee the morning of July 24, Fox News was airing the testimony live — as the network said it would.", "Yet some on social media were still sharing posts that claimed otherwise.", "“Fox News announced that it will NOT air Mueller’s testimony before congress,” one Facebook post said. “You know the testimony that will exonerate TRUMP.”", "But Fox News never announced that. Instead, in a July 22 press release, the cable network said it would “present live coverage” with co-anchors Bret Baier and Martha MacCallum, for both the judiciary committee hearing as well as Mueller’s expected, subsequent testimony before the House Intelligence Committee.", "Fox News did indeed air the morning committee hearing, which we observed, as Mueller answered lawmakers’ questions regarding his completed investigation into Russian interference in the 2016 election and potential obstruction of justice by President Donald Trump.", "The falsehood has circulated across social media platforms over several days.", "A viral post by the popular Facebook group Occupy Democrats that also made the erroneous claim was subsequently updated with a text apology and correction. The group said the meme “was based on a since-deleted tweet by MSNBC contributor Joy Vance,” which was “later repeated on MSNBC by contributor Rick Wilson and MSNBC anchor Nicole Wallace didn’t correct the misinformation.”", "That claim was made by Vance on Twitter on July 21 and also stated by Wilson the next day on MSNBC’s “Deadline: White House” with Wallace.", "“Almost every person sitting on that panel has not read the report. Robert Mueller knows it… This is also a moment where the premise of television in our political lives is going to come to the fore. And Donald Trump knows this” – @TheRickWilson w/ @NicolleDWallace pic.twitter.com/y5PJxBilw6", "— Deadline White House (@DeadlineWH) July 22, 2019", "Vance took to Twitter the same day as her original tweet to say she had deleted her earlier post: “I’ve deleted an earlier tweet I intended ironically, but that some took as factual regarding Fox news coverage of Mueller’s testimony. My apologies to anyone I confused. I don’t like to delete tweets but that seems a better course than unintentionally misinforming people.”", "Wilson also posted a correction on Twitter, which Wallace retweeted.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Deadline White House (@DeadlineWH). “‘Almost every person sitting on that panel has not read the report. Robert Mueller knows it… This is also a moment where the premise of television in our political lives is going to come to the fore. And Donald Trump knows this’ – @TheRickWilson w/ @NicolleDWallace.” Twitter. 22 Jul 2019.", "“Fox News Channel to present live coverage of special counsel Robert Mueller’s live testimony before the House Judiciary Committee and the House Intelligence Committee on Wednesday July 24th.” Press release, Fox News Channel. 22 Jul 2019.", "Wilson, Rick (@TheRickWilson). “I stand corrected: Fox apparently will cover the Mueller hearings. The MAGA Javerts were all aflutter.” Twitter. 22 Jul 2019.", "Vance, Joyce (@JoyceWhiteVance). “I’ve deleted an earlier tweet I intended ironically, but that some took as factual regarding Fox news coverage of Mueller’s testimony. My apologies to anyone I confused. I don’t like to delete tweets but that seems a better course than unintentionally misinforming people.” Twitter. 21 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]