["By Saranac Hale Spencer", "Posted on June 14, 2018", "Q: Has Attorney General Jeff Sessions resigned?", "A: No. That claim came from a made-up story originally posted on a self-described satirical site.", "Attorney General Jeff Sessions is still in office.", "But a website that posts stories it labels as satire has played on the sometimes fraught relationship between Sessions and President Donald Trump and posted a story with this headline: “BREAKING: Jeff Sessions Resigning Over ‘Health Issues.'”", "The story has been copied by at least one other website that has no satire disclaimer, and has been posted by several Facebook pages that each have tens of thousands of followers. One of those pages goes by the name “America’s First Lady, Melania Trump,” which lists itself as a “public figure.”", "The story claims that there is a “clip being circulated on the Dark web” of Sessions talking to his therapist. The links included in the story, however, go to a picture of a clown standing next to a booth that says, “Psychiatric Help — 0¢” and a stick figure drawing of a man pointing and saying, “NUH-UH!”", "The story also gives a link that it claims will take readers to a site where they can hear the clip, but the link actually leads to the website of a sound production company in New York City.", "Sessions is still very much the head of the Justice Department. On June 11, he announced a new rule that restricts the circumstances under which U.S. immigration judges can approve applications for asylum. And his schedule for the rest of the week includes stops in Fort Wayne, Indiana, on June 14, and Scranton, Pennsylvania, on June 15, to talk about immigration issues.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“BREAKING: Jeff Sessions Resigning Over ‘Health Issues.'” AmericasLastLineOfDefense.org. 8 Jun 2018.", "Matter of A-B-, Respondent. U.S. Department of Justice. Decided by the Attorney General. 11 Jun 2018.", "Sessions, Jeff. Remarks to the Executive Office for Immigration Review Legal Training Program. 11 Jun 2018.", "Department of Justice. Media advisory — Attorney General will travel to Fort Wayne, Indiana. 12 Jun 2018.", "Department of Justice. Media advisory — Attorney General will travel to Scranton, Pennsylvania. 13 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]