["A transphobic post being shared on social media uses an image of Rachel Levine, a transgender woman President Joe Biden tapped to be assistant secretary of health, to spread false information about Dr. Seuss books.", "\"Schools banning Dr. Seuss books,\" the post says, \"but teaching our children that this is normal.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Since Dr. Seuss Enterprises announced on March 2 that it would stop publishing and licensing six Dr. Seuss books that have been criticized for how they depict Black and Asian people, misinformation about so-called \"cancel culture\" has spread online.", "President Joe Biden had nothing to do with the decision, as some people have claimed. We also didn’t find evidence of schools banning books by the children’s author, as this Facebook post claims.", "Dr. Seuss Enterprises announced that it made the decision last year to stop publishing and licensing six books — \"And to Think That I Saw It on Mulberry Street,\" \"If I Ran the Zoo,\" \"McElligot’s Pool,\" \"On Beyond Zebra!,\" \"Scrambled Eggs Super!\" and \"The Cat’s Quizzer\" — after consulting with a panel of experts that included educators.", "About three dozen other Seuss titles, such as \"The Cat in the Hat,\" \"Green Eggs and Ham,\" and \"The Lorax,\" are not being pulled from the market.", "The day that Dr. Seuss Enterprises made its announcement was also the author’s birthday and National Read Across America Day, which was established by the National Education Association in 1998 to encourage children and teenagers to read. Schools nationwide have held read-aloud events featuring Dr. Seuss books and characters, but in 2017, NEA said it would start refocusing its literacy program on more diverse children’s books.", "\"Kids need books that are as diverse and complex as the society in which we live,\" an NEA spokesperson told PolitiFact.", "The post that’s being shared on social media doesn’t identify which schools are supposedly banning Dr. Seuss. But one school district dominated search results when we went looking for evidence: Loudoun County Public Schools in Virginia, which was the subject of recent headlines about canceling Dr. Seuss.", "The Loudoun district has followed the NEA’s lead and advised schools not to tie Read Across America Day to Dr. Seuss’ birthday, according to the school district.", "However, contrary to social media posts and some reports, \"Dr. Seuss books have not been banned in Loudoun County Schools,\" the district said in a statement.", "\"Research in recent years has revealed strong racial undertones in many books written/illustrated by Dr. Seuss,\" the statement said. \"Examples include anti-Japanese American political cartoons and cartoons depicting African Americans for sale captioned with offensive language. Given this research, and LCPS’ focus on equity and culturally responsive instruction, LCPS provided this guidance to schools during the past couple of years to not connect Read Across America Day exclusively with Dr. Seuss’ birthday.\"", "Still, Dr. Seuss books \"are available to students in our libraries and classrooms,\" the statement said.", "Loudoun County Public Schools hasn’t banned Dr. Seuss books, and we didn’t find evidence that other schools have either.", "We rate this Facebook post False.", "Facebook post, March 3, 2021", "Statement from Dr. Seuss Enterprises, March 2, 2021", "The New York Times, Dr. Seuss books are pulled and a ‘cancel culture’ controversy erupts, March 4, 2021", "PolitiFact, Biden wasn’t involved in Dr. Seuss or Mr. Potato Head changes. They reflect company decisions, March 5, 2021", "Loudoun County Public Schools, Media rumors concerning LCPS and Dr. Seuss, Feb. 27, 2021", "The Daily Wire, Oh the places the woke will go: Dr. Seuss canceled for ‘racial undertones,’ Feb. 26, 2021", "Fox News, Virginia school system cancels Dr. Seuss, citing racial ‘undertones’ in writings: report, Feb. 26, 2021", "Read Across America Day FAQs, Jan. 28, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]