["An image from an early version of \"Copernicus,\" the massive multiplayer online game that 38 Studios hoped to bring to market.", "The role played by Democrat Gina Raimondo in Rhode Island's investment in 38 Studios, the now-defunct video game company created by former Boston Red Sox star Curt Schilling, has been a source of contention throughout her run for governor.", "Raimondo’s Republican opponent, Allan Fung, has attacked her for urging the state to pay investors who bought the moral obligation bonds used to raise money for the company.", "In response, since Oct. 7, 2014, the Raimondo campaign has repeatedly aired a television commercial called \"From the Beginning,\" which is intended to address the controversy.", "\"You might have seen Allan Fung’s ad attacking me over 38 Studios,\" it begins. \"I fought 38 Studios from the beginning.\"", "Raimondo has repeated that claim in debates, with Fung challenging that claim, saying that one email doesn't constitute a fight.", "So who’s right?", "First, a little background.", "In 2010, the General Assembly passed a bill authorizing the Rhode Island Economic Development Corporation to guarantee up to $125 million in economic development bonds. The bill did not mention any potential beneficiary.", "But within weeks, the beneficiary became clear when the EDC approved a $75-million loan guarantee for 38 Studios. The company ultimately went bankrupt; the EDC, now the Rhode Island Commerce Corporation, owes a total of  $115.9 million in principal, interest and fees to repay the bonds.", "At least two prominent Rhode Island politicians vigorously opposed the deal when it was proposed.", "Lincoln Chafee, when he was running for governor as an independent in 2010, repeatedly urged the EDC to reject the proposal. He repeatedly tried to address the EDC directly and showed up at one of its meetings, only to be rebuffed.", "Then-General Treasurer Frank Caprio, a Democrat also running for governor, eventually joined Chafee in his opposition, to the point where Gov. Donald Carcieri, who chaired the EDC, complained, \"The attitudes and positions taken by Mr. Caprio and Mr. Chafee serve only to undermine the positive economic development steps the state has taken in recent years.\"", "Where was Raimondo, then a candidate for general treasurer, in all this?", "On July 16, 2010, she wrote an email to Keith Stokes, then EDC's director, expressing \"significant concerns.\"", "\"I would proceed very carefully on this,\" she wrote. \"The fact that many have looked at it and passed is a red flag,\" a reference to other groups that had decided not to help finance the 38 Studios venture.", "So she was clearly voicing serious concerns.", "In addition, Raimondo's TV commercial references The Providence Journal of July 22, 2010, where an Ed Fitzpatrick column quotes Raimondo as saying, \"Truly, this is a gamble. This company hasn’t launched a game yet. It’s pre-revenue; they haven’t made one penny. This could very easily be out of business in a year or two.\"", "The column appeared two days before the EDC took its final vote on the 38 Studios deal.", "Fitzpatrick, paraphrasing Raimondo, wrote: \"Venture capitalists prefer to spread risk among a portfolio of 20 to 30 companies, but this $75-million loan guarantee is a big chunk of the state's new $125-million Job Creation Guaranty Program.\"", "Then he quoted Raimondo as saying, \"This strategy is like, 'put all your chips on red and cross your fingers. It makes me nervous.'\"", "But neither example shows Raimondo actively fighting the project.", "We asked Raimondo's campaign if it had any evidence of the candidate trying to block the deal. Spokeswoman Joy Fox said Raimondo met with Stokes and separately with Karl Wadensten, the only EDC member to vote against the proposal.", "We checked with Wadensten. He said he asked her about the pending deal during commercial breaks when he had her on his WPRO radio show.", "Asked about Raimondo's claim that she fought the deal, he responded, \"With who? That's what I'm trying to figure out. With who? I had already made up my mind at that point.\" He said he couldn't recall how strongly she advised against the deal.", "Our ruling", "Gina Raimondo says, \"I fought 38 Studios from the beginning.\"", "It's clear Raimondo had concerns about the deal.", "But calling something \"a gamble,\" saying a deal makes you \"nervous\" and urging someone to \"proceed very carefully\" signals opposition but doesn't rise to the level of fighting.", "We couldn't find -- and her campaign couldn't produce -- any evidence that she actively tried to block the 38 Studios loan or that she specifically told anyone in authority that the deal should be rejected.", "To say she \"fought 38 Studios\" is a big stretch. We rate her claim as Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "YouTube.com, \"From the Beginning,\" Gina Raimondo channel, Oct. 7, 2014, accessed Oct. 28, 2014", "ProvidenceJournal.com, \"Ads for candidates Fung, Raimondo target roles in 38 Studios debacle,\" Oct. 7, 2014", "The Providence Journal, \"Should state be in the bullpen for the Schilling deal?\" Page A4, July 22, 2010; \"Candidates dispute loan to Schilling: Lincoln Chafee calls on EDC to back away from $75-million deal, seek other proposals; Frank Caprio suggests changes to agreement,\" Page A1, Aug. 10, 2010; \"Chafee still critical of Schilling deal,\" Page A12, Aug. 19, 2010; \"Carcieri denies Chafee request,\" Page A8, Aug. 20, 2010; \"Chafee denied bid to protest RI offer to Schilling,\" online only (link no longer active), Aug. 23, 2014; \"Foe of Schilling deal silenced,\" Page A1, Aug. 24, 2010; and \"Caprio tries to halt Schilling loan deal,\" Page A1, Sept. 1, 2010", "Interview and email, Joy Fox, spokeswoman, Raimondo for Governor, Oct. 29, 2014", "Interview, Karl Wadensten, board member, Rhode Island Commerce Corporation and owner, VIBCO Vibrators, Oct. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]