["About this rating", "Comedian Cris Shapan has mastered the art of creating humor in the form of imagined vintage print advertisements. His fans are undoubtedly aware that products such as boned rolled pig only exist in the artist's mind (and his Facebook page), but these images occasionally find their way in front of unsuspecting viewers who think, at least for a moment, that consumers in the 1950s really used products such \"Johnson's Winking Glue\" to glue their eyes into a permanent winking position.", "We've received numerous queries about another one of Shapan's creations -- Cadmium-enriched meat softener from the fictitious entrepreneur Arden Weenus:", "Shapan has crafted a number of advertisements that feature the fictitious Weenus. Although this meat softener promotion is likely the most popular of the Arden Weenus ads, Weenus has also putatively offered \"pre-toasted toast\" and \"Weenut Butter\" to the grocery-buying public:", "(Note: The images in this article are a bit smaller than the ones on Shapan's Facebook page, which may make it a bit difficult to peruse all of their text. If you find these vintage ads humorous, you may want to view the images direct from the source so you can read all of the ad copy.)", "While none of these products actually existed, these images were all based on real vintage advertisements. We've managed to dig up the source images for Weenut Butter and Pre-Toasted Toast, but the source of the meat softener ad is still unknown.", "Weenus Butter was made from a 1952 advertisement for Peter Pan Peanut Butter. The Pre-Toasted Toast ad was created from another 1950s advertisement that promoted the use of DuPont Cellophane to keep bread fresh:", "While Shapan's fictional vintage advertisements border on the absurd, they are still occasionally mistaken for genuine products. In April 2017, Shapan talked to Dangerous Minds about what it's like to see his posters taken for real thing:", "Richard Metzger: With your Photoshop skills you can “edit” the past -- in a very Orwellian sense -- and it’s frightening to see how fucking gullible people can be. I recall we posted one of your Alan Hale parody album covers and idiots on Facebook were commenting “I used to have this record!” “Me too!” and “I still have mine!” Ummm ... no you don’t.", "Cris Shapan: Yeah, it’s scary to see something I did purely to entertain friends become someone else’s reality. Some claim to remember or even own something that never existed. Others will repost a parody ad as real, especially if it reinforces some agenda they’re touting (sexism in advertising, the past was a horrible place, frankenfood, etc.). People read the fake ad copy and leap to the wildest interpretations, often expressing outrage at something that never actually happened. It’s just bizarre. Some people are so convinced these parody pieces are genuine that they’ve gone in and modified Wikipedia pages to reflect their existence, which of course compounds the stupidity.", "Metzger, Richard.   \"Everything on the Internet Is a Lie (Except for This).\"\r\n    Dangerous Minds.   1 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]