["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Democrats attacked their GOP colleagues for using a procedural regulation to shut down Elizabeth Warren’s criticism of a fellow senator, but not when Texas Republican Ted Cruz did the same thing two years ago.", "During a Feb. 8 CNN interview, Sen. Jeanne Shaheen, D-N.H., excoriated Republicans for invoking Rule 19 the day before to force Warren to stop her floor speech against Alabama Sen. Jeff Sessions, President Donald Trump’s nominee for attorney general.", "Warren, D-Mass., had been reading a 1986 letter by Coretta Scott King that protested Sessions’ failed appointment as a federal judge in Alabama. The letter from King said Sessions \"has used the awesome power of his office to chill the free exercise of the vote by black citizens in the district he now seeks to serve as a federal judge.\"", "During Warren’s speech, Senate Majority Leader Mitch McConnell of Kentucky cited Rule 19, which prevents senators from impugning one another. Senators voted along party lines to silence Warren, a move Shaheen said was hypocritical.", "\"Back when Ted Cruz called Mitch McConnell a liar on the floor of the Senate floor, nobody invoked Rule 19 to censor him, so this has been a very subjective process,\" Shaheen said.", "Cruz did take to the Senate floor in 2015 to accuse McConnell of lying to him. While other Republicans did admonish Cruz for doing so, the rule that silenced Warren was not invoked.", "‘A simple lie’", "According to the Senate Committee on Rules and Administration, Rule 19 says in part that \"no Senator in debate shall, directly or indirectly, by any form of words impute to another Senator or to other Senators any conduct or motive unworthy or unbecoming a Senator.\"", "Shaheen and other Democrats argued that if the rule applies to Warren, it also should have applied to a July 24, 2015, speech by Cruz.", "He took to the Senate floor to castigate McConnell for allegedly making a private deal with some senators to allow a vote to renew the charter for the Export-Import Bank in exchange for votes on a trade deal. Cruz and many other Republicans oppose the bank, which acts as the nation’s official credit agency to help businesses find foreign markets.", "After McConnell moved a proposal to reauthorize the bank through a transportation bill, Cruz went on the attack. Cruz said McConnell had told him there was no such deal — \"Like Saint Peter, he repeated it three times,\" Cruz said — but Cruz’s office staff had said McConnell was lying.", "\"I cannot believe he would tell a flat-out lie. ... What we just saw today was an absolute demonstration that not only what he told every Republican senator, but what he told the press over and over and over again, was a simple lie,\" Cruz said.", "So Cruz didn’t specifically use the word \"liar\" to describe McConnell, an important caveat. But he did make it very clear that, according to Cruz’s account, McConnell had told him and others a lie.", "McConnell denied the charge, saying he had held the position that the transportation bill would be the best opportunity to hold a vote on renewing the bank’s charter (it passed).", "We didn’t find any evidence that anyone in the Senate moved to silence Cruz with Rule 19. But Republicans did denounce his attack on the party leader as improper in the days following.", "\"I think it was outside the realm of Senate behavior,\" Sen. John McCain, R-Ariz., told CNN a couple of days later. \"I would never contemplate going to the floor of the Senate and impugning the integrity of another senator. Just not something we do here. I really think it was a very wrong thing to do.\"", "Sen. Orrin Hatch, R-Utah, then the Senate president pro tempore, suggested in a date floor speech that Cruz may have been grandstanding to draw attention to his presidential bid.", "\"Squabbling and sanctimony may be tolerated in other venues — or perhaps on the campaign trail — but they have no place among colleagues in the United States Senate,\" Hatch said. \"The Senate floor has even become a place where senators have singled out colleagues by name to attack them in personal terms, to impugn their character, in blatant disregard for Senate rules.\"", "No senator defended Cruz’s speech, and he was defeated by his own party on several procedural maneuvers in the days after he spoke. His Texas colleague, GOP Sen. John Cornyn, even questioned Cruz’s recollection of events, noting he \"would have to say he's mistaken\" about what McConnell said.", "Gregory Koger, a University of Miami political science professor, further noted to us that the Senate majority leader isn’t the only senator who can invoke Rule 19.", "\"(What Cruz said) was definitely a violation of the norms of the Senate and he was not called to account,\" Koger said. \"I would just say that any senator — including any Democrat or any Republican — could have called him on it.\"", "Our ruling", "Shaheen said, \"Back when Ted Cruz called Mitch McConnell a liar on the floor of the Senate floor, nobody invoked Rule 19 to censor him.\"", "Cruz didn't call him a \"liar,\" exactly, but he did say in a 2015 floor speech that McConnell had told him a lie about whether the Senate majority leader had made a deal to renew the Export-Import Bank’s charter. Republicans chastised Cruz afterward, saying it was not the proper thing to do. But he was not silenced under Rule 19.", "We rate this statement Mostly True.", "Sen. Jeanne Sheehan, comments on CNN, Feb. 8, 2017", "Washington Post, \"Ted Cruz calls Mitch McConnell a liar on the Senate floor,\" July 24, 2015", "Politico, \"Cruz accuses Mitch McConnell of telling a 'flat-out lie',\" July 24, 2015", "The Atlantic, \"Ted Cruz's Cry for Attention,\" July 24, 2015", "The Guardian, \"Ted Cruz calls Senate majority Leader Mitch McConnell a liar - video,\" July 25, 2015", "NPR, \"Senior Senate Republicans Rebuke Cruz After He Criticizes McConnell,\" July 27, 2015", "CNN, \"Republicans rebuke Cruz over his charge McConnell lied,\" July 27, 2015", "Washington Post, \"Ted Cruz bullied Republicans for years. Now they’re standing up to him.,\" July 28, 2015", "The Hill, \"Cruz on Ex-Im: Battle won, war rages on,\" July 30, 2015", "New York Times, \"Republican Senators Vote to Formally Silence Elizabeth Warren,\" Feb. 7, 2017", "CNN, \"Silencing Elizabeth Warren backfires on Senate GOP,\" Feb. 8, 2017", "CNN, \"The Coretta Scott King letter Elizabeth Warren was trying to read,\" feb. 8, 2017", "NBC News, \"Warren Silenced for Reading Coretta Scott King Letter at Sessions Debate,\" Feb. 8, 2017", "Congress.gov, HR 22, accessed Feb. 8, 2017", "U.S. Senate Committee on Rules and Administration, \"Rules of the Senate: Debate,\" accessed Feb. 8, 2017", "Interview with Ryan Nickel, Shaheen spokesman, Feb. 8, 2017", "Interview with Gregory Koger, University of Miami political science professor, Feb. 8, 2017", "Interview with Steven Smith, Washington University in St. Louis political science professor, Feb. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]