["The 30-second clip was shared in this July 16, 2019 Facebook post where it has been viewed more than 43,000 times and shared over 1,300 times.", "It shows a group of school students in light green uniforms shouting a short slogan in Hindi, while people including police officials record the scene on their mobile phones.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “Long live Pakistan slogans were shouted outside Anjuman school in Mandsaur. Then these scared people ask what have they done?”", "Mandsaur is a district in the central Indian state of Madhya Pradesh. Anjuman Esalami Madrsa school is located in Mandsaur.", "The claim is false; the students in the video are actually shouting “Sabir Sahab Zindabad”, meaning “Long live Sabir Sir”, which sounds like “Pakistan Zindabad”, or “Long live Pakistan”.", "AFP spoke to Mandsaur district senior police official Narendra Solanki by telephone on July 24, 2019. He said:", "“There was an internal issue between the school principal and school authorities, students thought that their principal was going to be sacked so they shouted the slogan ‘Long Live Sabir Sir’, in support of their principal.", "“We have seen the video, analysed it and our forensics found it out that no pro-Pakistan slogans were made. We are also in the process of identifying the locals who have shared the video with the misleading claim and we will take action against them.”", "AFP used an online video editing tool called Kapwing to slow the Facebook video down to 0.75 times its original speed. In this slower version, it is easier to tell that the students are not saying “Pakistan”.", "The slowed version of the video is embedded below. At two seconds in, when the students chant “Sabir Sir” for the second time, two “S” sounds can be heard; the “P” of Pakistan cannot:", "Similar videos were published on Facebook, for example here and here.", "A different video showing the same scene, which is one minute 17 seconds long, was also published here on Twitter on July 15, 2019, alongside a similar misleading claim.", "Multiple national and local news organisations in India have also debunked the false claims; for example, broadcaster NDTV reported on the misleading posts in this video report on July 16, 2019, while local Hindi-language channel G7 News ran a similar report on the same day here.", "At the 5:50 mark in the G7 News video, the teacher Sabir says: “There was a dispute between me and school secretary and students thought that I am being removed from my post and they shouted slogans in my support long live Sabir sir.”", "That part of the video report is embedded below:", "Another local news organisation, Naidunia Jagran, published this text report in Hindi about the dispute between the school authorities and principal, and the ensuing online misinformation, also on July 16, 2019.", "It says: \"In Mandsaur, the tussle between the secretary of the Anjuman-e-Islam committee and principal of the committee-run higher secondary school in Khanpura has intensified. On Monday, the secretary asked the principal to leave the school, alleging him of financial fraud of 15 million rupees. A controversy grew up after this.\"", "“The principal declared holiday in school and the students started shouting slogans. Some organisations complained to the local police, alleging the kids of shouting anti-national slogans when a video of the event went viral. However, the principal and other people have stressed that the students were shouting ‘long live Sabir sir’. The CSP (Circle Superintendent of Police) has promised to investigate the matter.”", "Meanwhile, another local media organisaton, Janmat Sarokar, published this video report on the misinformation incident on July 15, 2019.", "The report quotes the principal, school secretary, a teacher and a police official, all four narrating the same that an internal dispute led to sloganeering by students in support of school principal Sabir Husain.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]