["About this rating", "Arizona senator John McCain's background of service to his country is well-known: A U.S. Navy pilot during the Vietnam War, Lieut. Commander McCain was shot down in his Skyhawk dive bomber while flying a mission over Hanoi, North Vietnam on 26 October 1967.", "McCain was taken prisoner by the North Vietnamese (with fractures in his right leg and both arms, for which he received minimal care) and spent the next five-plus years enduring torture and brutality as a POW before being released following the signing of the Paris Peace Accords in early 1973. Given Senator McCain's reputation and status, first as a military officer and later as a member of Congress, many people would be rather surprised to learn that many years after the end of the Vietnam War, during an interview with a major news magazine, he supposedly declared himself to be a \"war criminal\" who \"bombed innocent women and children.\"", "John McCain did no such thing, however, and the claim that he did is a prime example of how important context is in understanding the meaning of one's statements.", "As John McCain recalled shortly after his return from captivity, the pressure put upon him by his captors to acknowledge that he was a \"war criminal\" began almost immediately after he was taken prisoner:", "For the next three or four days, I lapsed from conscious to unconsciousness. During this time, I was taken out to interrogation — which we called a \"quiz\" — several times. That's when I was hit with all sorts of war-criminal charges. This started on the first day. I refused to give them anything except my name, rank, serial number and date of birth. They beat me around a little bit. I was in such bad shape that when they hit me it would knock me unconscious. They kept saying, \"You will not receive any medical treatment until you talk.\"", "After I had been there about 10 days ... \"The Cat\" [a man in charge of all the POW camps in Hanoi] said — through an interpreter, as he was not speaking English at this time — \"The French television man is coming.\" I said, \"Well, I don't think I want to be filmed,\" whereupon he announced, \"You need two operations, and if you don't talk to him, then we will take your chest cast off and you won't get any operations.\" He said, \"You will say that you're grateful to the Vietnamese people, and that you're sorry for your crimes.\" I told him I wouldn't do that.", "Nearly twenty-five years later, what Senator McCain said to Mike Wallace during an interview for a segment of the 60 Minutes news magazine (originally broadcast on 12 October 1997 and aired again on 6 June 1999) was not a personal declaration that he had been a \"war criminal\" who \"bombed innocent women and children,\" but a lamentation that while a POW he had, under pain of torture, finally allowed his captors to coerce him into issuing a \"confession\" stating such.", "A transcript of the relevant portion of the 60 Minutes interview from 1997 shows that when McCain spoke the sentences \"I was guilty of war crimes against the Vietnamese people\" and \"I intentionally bombed women and children,\" he was referring to the substance of a confession his North Vietnamese captors had forced him to write as wartime propaganda, not making a open admission of personal guilt:", "WALLACE: (Voiceover) People who know McCain well say he can hold a grudge. He also has a legendary temper. But if McCain can be hard on his friends and even harder on his enemies, he can also be very hard on himself.", "Sen. McCAIN: I made serious, serious mistakes and did things wrong when I was in prison, OK?", "WALLACE: What did you do wrong in prison?", "Sen. McCAIN: I wrote a confession. I was guilty of war crimes against the Vietnamese people. I intentionally bombed women and children.", "WALLACE: And you did it because you were being tortured and you'd reached the end of the line?", "Sen. McCAIN: Yes. But I should have gone further. I should have — I never believed that I would — that I would break, and I did.", "In early 2017, related rumors about McCain began recirculating alongside media coverage of his opposition to some of incoming President Trump's actions, with videos and memes on social media asserting that McCain would have been tried upon his release from captivity were it not for a pardon granted by President Richard Nixon:", "Those who promulgate the \"pardon\" aspect of McCain rumors never cite a single piece of evidence documenting that such a pardon was extended to McCain, save for occasional vague references to the notion that McCain was supposedly one of a group of 33 Vietnam-era POWs who were collectively granted pardons.", "We contacted Professor of Political Science and Pardon Power Blog editor P.S. Ruckman, Jr. to ask whether there was any truth to the claim that John McCain had been pardoned by President Richard Nixon, who told us that his extensive review of data from multiple sources did not corroborate it:", "There are some famous pardon [myths;] \"Washington's first pardon was to the Whiskey Rebels\" (false), \"Jimmy Carter pardoned Robert E. Lee and Jefferson Davis\" (again, false, Congress restored their rights posthumously, in a resolution, that President Carter signed), \"H.W. Bush pardoned Orlando Bosch\" (false), etc. In my mind, this McCain \"pardon\" is quickly climbing the ladder of notoriety.", "With most [of these legends] one can kind of figure how mistakes were made. So the tale of development can be reasonably mapped out ... The McCain one strikes me as an exception to the rule, however. It seems to come out of nowhere and, apparently, is aimed at slandering him (the usual goal is to slander the granting president). Maybe it is simply a play on the fact that many are aware that there was an amnesty following the Vietnam War?", "Using State Department and DOJ records (on microfilm, in Annual Reports and in records at the National Archives, College Park), I have developed a researchable data set of every individual grant of clemency from 1789 to present. I have been over the data (30,000 plus cases), dozens of times over the years. John McCain's name simply does not appear in the data.", "Alexander, Paul.   Man of the People: The Life of John McCain.\r\n    Hoboken, NJ: John Wiley & Sons, 2003.   ISBN 0-471-22829-X.", "Bradner, Eric.   \"McCain Steps Up Trump Criticism.\"\r\n    CNN.   21 February 2017.", "Duff, Gordon.   \"John McCain: Aid and Comfort.\"\r\n    Veterans Today.   1 October 2009.", "Enten, Harry.   \"Is John McCain a Maverick?\"\r\n    FiveThirtyEight.   27 February 2017.", "McCain, John.   \"John McCain, Prisoner of War: A First-Person Account.\"\r\n    U.S. News & World Report.   14 May 1973.", "Wallace, Mike.   \"The Maverick from Arizona.\"\r\n    60 Minutes.   12 October 1997.", "The Powdered Wig Society.   \"'33 POWs Faced Execution for Treason After Vietnam Until Nixon Pardoned All Pows.' McCain Was #1 on the List.\"\r\n    21 July 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]