["Misinformation regarding COVID-19 has peaked since the Tablighi Jamaat markaz in Delhi’s Nizamuddin emerged as one of the hotspots of the outbreak. On April 7, 2020, news agency ANI tweeted quoting the DCP of Gautam Budh Nagar that those in Sector 5, Harola, Noida who came in contact with Tablighi Jamaat members have been quarantined.", "ANI’s news was amplified by Smita Prakash, Editor of ANI and Amish Devgan, Managing Editor of News18 Hindi.", "ANI’s news regarding the link with Tablighi Jamaat was however refuted by DCP Noida’s official twitter handle saying that people who had come in contact with the positive case were quarantined as per the laid procedure. “There was no mention of Tabligh Jamat. You are misquoting and spreading fake news,” wrote the DCP. ANI subsequently deleted the tweet without any explanation.", "@ANINewsUP people who had come in contact with the positive case were quarantined as per laid procedure. There was no mention of Tabligh Jamat. You are misquoting and spreading fake news@noidapolice @Uppolicehttps://t.co/HwIM5Cr7K3", "— DCP_Noida (@DCP_Noida) April 7, 2020", "Even though DCP’s office reacted immediately to the misinformation and ANI’s tweet was deleted, it found a mention in Times of India’s Delhi lockdown news update.", "The erroneous tweet also found its way in a Jagran report.", "ANI has subsequently issued a correction taking out the reference to Tablighi Jamaat.", "Correction- Those in Sector 5 Harola, Noida, who came in contact with #COVID19 positive case* have been quarantined: Sankalp Sharma, Gautam Budh Nagar (DCP) pic.twitter.com/R5m5NLEoze", "— ANI UP (@ANINewsUP) April 8, 2020", "The news agency has been featured in several Alt News reports for publishing misleading news. In a report from February 6, 2020, Alt News found that ANI’s coverage of citizenship law protests held abroad was skewed – reporting on pro-CAA rallies but missing out on anti-CAA protests. Last year, we published a compilation of the ‘inadvertent errors’ made by the news agency corrected mostly without clarifications.", "Donate Now", "Nobody's cheerleader, I tweet at @samjawed65", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…"]