["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Separate protests from Black Lives Matter and another group rallying against President-Elect Donald Trump combine to march in Cincinnati on Nov. 12, 2016. (USA Today Network)", "Nine days after the presidential election, a discussion about protests against Donald Trump led a Wisconsin congressman to lash out at Black Lives Matter and President Barack Obama.", "The attack was made on the Nov. 17, 2016 edition of \"The O’Reilly Factor\" talk show by Republican Sean Duffy, a Trump transition team member who has been mentioned as a potential challenger to Democratic U.S. Sen. Tammy Baldwin in 2018.", "Fox News Channel’s Eric Bolling, who was filling in for host Bill O’Reilly, asked whether Obama should take \"a more forceful stand\" on demonstrations over Trump’s victory that, in some cities, such as Portland, Ore., turned violent.", "Duffy responded by saying that Obama \"might not be instigating these rallies, but he’s not shutting them down.\"", "Then he shifted to Black Lives Matter, which formed after a Florida jury in 2013 found George Zimmerman not guilty of murder in the shooting death of Trayvon Martin, an unarmed African-American teen.", "\"And frankly, Eric, you know, Black Lives Matter, who are attacking law enforcement officers, he (Obama)  had them to the White House. You have to recognize what President Obama is doing by not shutting down the violence that’s coming from the left-wing extremists in his party.\"", "So, Duffy is saying that Obama, in \"not shutting down violence,\" invited members of Black Lives Matter to the White House even though members of the group \"are attacking law enforcement officers.\"", "Attacking officers", "Duffy’s congressional office referred us to news reports on two incidents.", "August 2015: More than a year before Duffy made his statement, protesters in a Black Lives Matter march in Minnesota were captured on video yelling \"pigs in a blanket, fry 'em like bacon.\"", "September 2016: A Dallas police officer filed a lawsuit against Black Lives Matter, Obama and others, alleging they \"incite people to violence and cause violence\" against law enforcement officers, including including five Dallas officers killed in an ambush two months earlier.", "Duffy spokesman Mark Bednar told us: \"To incite violence, especially against a specific group of people -- in this case, law enforcement officials -- is a form of attack.\"", "There have been isolated incidents of physical attacks against officers at Black Lives Matter events. Here are three examples from July 2016:", "Chicago: A well-known activist was charged with striking a police commander and trying to disarm another during a Black Lives Matter protest of fatal shootings by police in Louisiana and Minnesota.", "St. Paul, Minn.: 21 officers were injured after protesters blocked I-94. A Black Lives Matter St. Paul leader said the protesters throwing things at police were not from his community. But Black Lives Matter Minneapolis posted on Facebook: \"We shut down 94 for Philando,\" a reference to Philando Castile, who was shot dead days earlier by a suburban Minneapolis officer.", "Baton Rouge, La.: A police officer said he sustained injuries during a protest and in turn he filed a lawsuit against a prominent Black Lives Matter activist. He accused the activist of having \"incited the violence,\" but did not allege that the activist was the one who attacked him.", "So, there have been isolated incidents of attacks on officers during Black Lives Matter events, but it’s not always clear who is responsible.", "Visit to the White House", "The second part of Duffy’s claim refers to a forum Obama held at the White House in July 2016 involving three dozen people.", "News reports said Obama met for more than four hours with the group, which included two Black Lives Matter leaders, other activists, Louisiana Gov. John Bel Edwards and other elected officials, law enforcement officials and community leaders.", "So, this wasn’t a personal audience with the president for leaders of Black Lives Matter -- it was a large gathering of people representing diverse interests.", "Moreover, Obama, while defending the Black Lives Matter movement, has condemned those who advocate violence. For example, while in Madrid in July 2016, he said: \"Whenever those of us who are concerned about fairness in the criminal justice system attack police officers, you are doing a disservice to the cause.\"", "Our rating", "In saying Obama is \"not shutting down violence,\" Duffy claimed: \"Black Lives Matter, who are attacking law enforcement officers\" -- Obama \"had them to the White House.\"", "There have been isolated incidents of law enforcement officers being attacked during Black Lives Matter demonstrations, although it’s not always clear whether members of the movement are responsible. Two leaders of the movement were at a White House event with Obama, but so were some three dozen other people representing a wide variety of organizations. And Obama, while defending Black Lives Matter, has condemned attacks on police officers.", "For a statement that has an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.\n\nDuffy fact checks from 2016 presidential campaign", "➤ \"One of George Soros' companies has provided some of the (voting) machines\" for some states. Pants on Fire.", "➤ Says Hillary Clinton aide Huma Abedin has \"ties to the Muslim Brotherhood.\" False.", "➤ \"Barack Obama and Hillary Clinton have left us with $19 trillion in debt.\" Mostly False.", "YouTube, \"The O’Reilly Factor (27:00),\" Nov. 17, 2016", "CBS News, \"’Pigs in a blanket’ chant at Minnesota fair riles police,\" Aug. 31, 2015", "Fox News, \"Dallas cop files lawsuit against Black Lives Matter, Obama,\" Sept. 18, 2016", "Washington Times, \"Obama hosts meeting with police, civil-rights leaders,\" July 13, 2016", "ABC News, \"Obama Cites 'Deep Divisions' on Tackling Race in Policing After 4-Hour Meeting,\" July 13, 2016", "USA Today, \"Obama calls for mutual respect from Black Lives Matter and police,\" July 11, 2016", "The Hill, \"Prominent Black Lives Matter activist to attend Obama meeting,\" July 13, 2016", "CNN, \"Black Lives Matter activists join Obama at forum on policing,\" July 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]