["The photo was published here on Facebook on October 31, 2020.", "The post’s Hindi-language caption translates to English as: “Ayodhya: First photo of Lord Ram temple. Those who feel elated at this picture, they should chant the cry of victory to Lord Ram with a pious heart.”", "In August 2020, Prime Minister Narendra Modi announced the construction of a new temple to the Hindu deity Ram at a flashpoint religious site in the holy city of Ayodhya that has sparked some of the country's bloodiest sectarian violence, AFP reported.", "The photo was also shared here, here and here on Facebook; here and here on Instagram, and on Twitter here and here alongside a similar claim.", "However, the claim is false.", "A reverse and keyword search on Google found the photo had been published here on the official Twitter account of Indian state radio broadcaster on October 27, 2020.", "The tweet reads as: “Under construction Kashi Vishwanath Temple in Varanasi.”", "Kashi Vishwanath temple is located in the north Indian city of Varanasi. Prime Minister Modi laid the foundation stone for the building in March 2019. The ceremony was streamed live here on the prime minister’s official YouTube Channel.", "?:Under construction #KashiVishwanath Temple in Varanasi pic.twitter.com/kD04af7iV7", "Below is a screenshot comparison of the photo in the misleading post (L) and Twitter photo (R)", "A similar photo of construction work being carried out at Kashi Vishwanath temple was published in media reports in October 2020 here on the India TV website and here on the Hindustan Times news website.", "The construction of Ram Temple in Ayodhya is yet to begin as the temple board in Ayodhya has invited a call for design ideas in a tweet posted here on their official Twitter account on November 4, 2020.", "श्री रामजन्मभूमि तीर्थ क्षेत्र परिसर निर्माण हेतु सुझाव सहृदय सादर आमंत्रित हैं।\n\t\tश्री रामजन्मभूमि तीर्थ क्षेत्र जन्मभूमि परिसर के 70 एकड़ क्षेत्र के मास्टरप्लान हेतु सभी विद्वतजनों, वास्तुविदों के सुझाव आमन्त्रित करता है। pic.twitter.com/lTvNm7LuQd", "The official Twitter account of the Ram temple board also posted the photos here on October 9, 2020, on Twitter of stones being shifted to the temple site which will be used in the construction of the temple.", "Jai Shri Ram!\n\n\t\tThe work of shifting the carved stones from the workshop to the Mandir premises has started. The stones will be used in construction of Shri Ramjanmabhoomi Mandir. pic.twitter.com/Vn3P4IvLHk", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]