["About this rating", "Backpacks marketed as \"bulletproof\" are available for purchase at some stores in the United States.", "These backpacks may provide protection against handguns, but they aren't entirely \"bulletproof,\" and they weren't officially certified by the National Institute of Justice.", "On July 30, 2019, a photograph purportedly showing a bulletproof backpack on sale at a store in the United States was posted to Twitter by @sportsrainman along with a message about how the product broke the user's heart. The image went viral after it was posted with a dark joke about the price of the item:", "120$?????? My son getting clapped https://t.co/EybdB2bfsy", "— Sad Lee (@Losherb) July 30, 2019", "This product evoked a number of emotional responses on social media. Some expressed dismay that this sort of product was becoming a necessity due to the number of school shootings in the U.S., while others praised the company for its efforts to protect school children. This product also sparked a number of political comments concerning gun-control legislation.", "Whatever your take on bulletproof backpacks, this is a genuine photograph of a product available at many stores in the U.S.", "The above-displayed product comes from the company Guard Dog Security. It is one of many such backpacks the company sells on its website. It's unclear how widely available these backpacks are in brick-and-mortar stores, but various news outlets have reported that these bulletproof backpacks can be found in Office Depot locations ranging from Spokane, Washington, to Normal, Illinois: According to one news story:", "The book bags are made by a company out of Sanford, Florida, called Guard Dog Security. The ‘bulletproof bags,’ specifically the ProShield Scout, come with a level IIIA protection. According to the US National Institute of Justice (NIJ), this level will protect against a .44 Magnum handgun.", "“We like to say if there’s a series of home invasions or home security issues or home robberies, then people are going to buy home security systems,” said Yasir Sheikh, president of Guard Dog Security. “Because of the times we live in, people are making the decision to buy bulletproof backpacks as a preventative measure.”", "Guard Dog Security says its products were tested by the National Institute of Justice (NIJ), the research, development and evaluation agency of the Department of Justice, and that the backpacks meet the organization's level IIIA standards. According to NIJ, level IIIA is \"tested to stop .357 SIG and .44 Magnum ammunition fired from longer barrel handguns. No rifle ammunition protection.\"", "While these backpacks may meet NIJ standards, the government organization released a statement to clarify that it did not certify this product (or any other backpacks) as bulletproof:", "\"The National Institute of Justice—the research, development, and evaluation agency of the Department of Justice—has never tested nor certified ballistic items, such as backpacks, blankets, or briefcases, other than body armor for law enforcement. Marketing that claims NIJ testing or certification for such products is false.\"", "According to Education Week, a journal covering education in the U.S., 114 people were killed or injdured during school shootings in 2018.", "CBS News.   \"Bullet-Resistant Backpacks on Sale at Major Retailer's Stores.\"     31 July 2019.", "WTEN. \"Is a ‘Bulletproof Backpack’ the New Essential Back to School Item?\"\r\n    31 July 2019.", "Blad, Eviel Peele, Holly.   \"School Shootings in 2018: How Many and Where.\"\r\n    Education Week.   Retrieved 1 August 2019.", "Miller, Andrea.   \"Bulletproof Backpacks: What You Need to Know.\"\r\n    ABC News.   1 March 2018.", "Herrera, Carlos.   \"Before You Buy a Bulletproof Backpack | Need to Know.\"\r\n    ABC 10.   31 July 2019.", "Lopez, German.   \"2018 Was by Far the Worst Year on Record for Gun Violence in Schools.\"\r\n    Vox.   10 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]