["About this rating", "The 887 monolithic human figures carved from rock on Easter Island (known as moai) are familiar to many people through iconic images that show the statues to be either just heads or a combination of heads and shoulders only:", "However, such pictures represent only a subset of the different forms in which the human figures on Easter Island appear.  A combination of the popularity of the \"giant head\" images, the fact that the heads on the statues are disproportionately large in comparison to their bodies, and the circumstance that the bottoms of some of the statues are set deep into the ground where they are obscured from view has produced a widespread misconception that all of the Easter Island statues are nothing more than giant heads. Many viewers are surprised, therefore, to learn the moai actually do have bodies:", "Example:", "The Stone Statues in Easter Island have bodies!", "This is absolutely incredible.  Here we've been thinking for all these years that they were just heads.  They are going to be absolutely huge when they are completely excavated.  It all just adds to the mystery of these amazing sculptures.  Maybe now they can get more information about them seeing as they have writings on them.", "Additionally, the revelation that the statues have bodies is not a recent discovery, as suggested by the above example: many of the moai (as shown above) are situated fully above ground and displayed in their entirety, and some of the statues even sport arms and what appear to be red hats (actually depictions of hair):", "In recent years the Easter Island Statue Project (EISP) has undertaken efforts to excavate and study some of the moai, thereby revealing previously hidden portions of the statues.", "Miller, Joshua Rhett.   \"Altered Sears Web Site Offers Grill to 'Cook Babies.'\"\r\n    FOXNews.com.   20 August 2009.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]