["About this rating", "Example: [Collected via e-mail, October 2001]", "Please think about this when you buy your next car!After seeing a short news listing on \"CNN Headline News\" regarding Ford and GM's contributions to the relief and recovery efforts in New York City and Washington D.C., I was prompted to see what the other automotive companies were contributing. I have never worked for an automotive company — nor has anyone in my family. It is, however, the prominent industry here in Michigan. I also feel it is important to know which companies are there for us in a crisis.", "I went to (the news, press release and philanthropic areas of) each of the companies web sites. If the company had several sites, I tried to visit them all.", "Additionally, I visited the leading news and automotive sites. As of today, one week since the attacks, this is what I have found:", "Aston Martin - Nothing.", "Audi - Nothing. Audi's web site states \"Audi News: Always up to the minute.\"", "BMW - Nothing despite other press releases/postings since 09/11/01. BMW's web site states \"The news service from the BMW Group: fast, informative and comprehensive.\"", "Daewoo International - Nothing.", "Daimler Chrysler (includes Dodge, Jeep, Mercedes-Benz and Plymouth) - $10 million to support the children and victims in addition to other donations from their employees, dealers and suppliers.", "Fiat - Nothing.", "Ford Motor Company (includes Jaguar, Lincoln, Mazda, Mercury and Volvo) - $1 million to the American Red Cross, matching employee contributions to the American Red Cross and 10 Excursions to the New York Fire Department. The company has also offered emergency response team services and office space to displaced government employees.", "General Motors (includes Buick, Cadillac, Chevrolet, Oldsmobile, Pontiac, Saab and Saturn) - $1 million to the American Red Cross, matching employee contributions and a fleet of vans, trucks and SUVs.", "Honda (includes Acura) - Nothing. Honda's site states \"If you're looking for the latest developments taking\nplace at Honda, you've come to the right place\" and \"Informative. Timely. Credible. The latest news on\nHonda can always be found right here?\" No press releases/postings since 09/04/01 when the release\nboasted \"American Honda Motor Co., Inc. recorded its second best sales month ever in August ?\" My search\nincluded: hondamotorcycle.com (other press releases posted on this site since 09/11/01), honda.com, honda2001.com, world.honda.com, acura.com and honda.co.jp.", "Hyundai Motors Group (includes Kia) - $300,000 to the American Red Cross.", "Isuzu - Nothing.", "Mitsubishi Motors - Nothing. Mitsubishi-motors.co.jp site states \"The latest news about Mitsubishi Motors.\"\nI also searched mitsubishimotors.com.", "Nissan - Nothing despite other press releases/postings since 09/11/01.", "Porsche - Press release with condolences posted on the Porsche web site on 09/12/01, but no contribution.", "Subaru - Nothing despite other press releases/postings since 09/11/01.", "Suzuki - Nothing.", "Toyota (includes Lexus) - Press release with condolences posted on the Toyota web site on 09/14/01, but no contribution despite earlier press releases boasting that Toyota had high sales in July and August.", "Volkswagen - The employees and management created a Foundation, funded initially with $2 million, to assist the children and victims with humanitarian help including medical and psychological assistance, rehabilitation and scholarships.", "I can only hope that it is an oversight by the companies that have not made a contribution and that they will join the relief efforts. We have the freedom to choose which companies we make purchases from and I, for one, will make my purchases from and give my money the companies that are giving their money to America at this time of need. I hope that you will, too.", "Please forward this e-mail — especially to anyone you know who is thinking of purchasing a vehicle.", "The item quoted above detailing automobile companies' contributions to relief efforts following the 9/11 terrorist attacks on the U.S. originally began circulating on the Internet in October 2001 and gained renewed currency in November 2008 (as Congress was debating a $25 billion bailout plan for the Big Three U.S. automakers).", "At the time, we took on the information-gathering task of visiting the web sites of all the automobile manufacturers listed above (plus a few not on the list), looking for information about September 11-related relief efforts and reported our findings below.", "Important points to keep in mind are:", "(Also see the entry for Volkswagen, as the Volkswagen Group includes Audi and Volkswagen in the United States.)", "Buchanan, Doug.   \"Honda: Sept. 11 E-mail a Hoax.\"\r\n    Business First of Columbus.   6 February 2002.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]