["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The results of an FBI investigation into Hillary Clinton’s use of a private email server as secretary of state shredded Clinton’s most oft-recited defense — that she never sent or received information marked classified.", "Clinton made the case for a year and as recently as Saturday, hours after being interviewed by investigators.", "\"Let me repeat what I have repeated for many months now,\" Clinton said July 2, 2016. \"I never received nor sent any material that was marked classified.\"", "In reality, Clinton has made the same general claim two ways. At a Democratic debate in February, Clinton said, \"I never sent or received any classified material.\" Other times she’s added the qualifier that she never sent material \"marked\" classified.", "We previously found that Clinton was spinning what was publicly known about the FBI investigation and Clinton’s emails. We rated her claim Half True. (See an archived version of that fact-check.)", "Now we know it’s just plain wrong.", "At PolitiFact, our policy is that we fact-check statements and claims using the information available at the time. That policy stands. But in this case, while the evidence FBI director James B. Comey presented wasn’t available to us, it was available to Clinton through her own emails. She had every opportunity to present an accurate accounting in comments to the public and voters. She did not do that.", "We think it’s important to make the record abundantly clear.", "We’ve decided to look at Clinton’s claim again with the information that was available to her when she spoke but only became available publicly July 5.", "The claim", "In an interview with NBC’s Chuck Todd hours after being interviewed by the FBI, Todd asked Clinton how her practices did not violate federal law.", "\"Let me repeat what I have repeated for many months now,\" Clinton responded. \"I never received nor sent any material that was marked classified.\"", "Comey’s statement directly contradicted that point.", "FBI investigators reviewed the 30,000 emails Clinton turned over to the State Department in 2014. The investigation found \"a very small number\" contained classification markings at the time they were sent.", "The State Department confirmed July 6 that it was aware of two emails that were marked confidential, the lowest level of classification, when they were sent. An aide sent the two emails to Clinton to prepare her for phone calls with foreign leaders, according to The New York Times.", "State Department spokesman John Kirby said call sheets are often classified when they are prepared. But then at some point before the call is made, someone with the appropriate authority will declassify them. These two call sheets sent to Clinton unnecessarily retained their confidential markings due to human error, Kirby said.", "Although just two emails out of many thousands were marked classified at the time they were sent, it’s more than the number Clinton cited: zero.", "In total, the investigation found 110 emails in 52 email chains containing information that was classified at the time it was sent or received. Eight chains contained top secret information, the highest level of classification, 36 chains contained secret information, and the remaining eight contained confidential information. Most of these emails, however, did not contain markings clearly delineating their status.", "Even so, Clinton and her team still should have known the information was not appropriate for an unclassified system, Comey said.", "\"There is evidence to support a conclusion that any reasonable person in Secretary Clinton's position or in the position of those with whom she was corresponding about the matters should have known that an unclassified system was no place for that conversation,\" Comey said of some of the top secret chains.", "About 2,000 additional emails have been retroactively classified, or up-classified, meaning the information was not classified when it was first emailed. This is a regular practice when documents are reviewed for release, according to transparency experts.", "Throughout this saga, Clinton has said she turned over all work-related emails to the State Department. But Comey said FBI investigators uncovered \"several thousand\" work-related emails that she had not handed over, and three of those were classified at the time they were sent, though they were not marked as such.", "Comey added that some work-related emails are still out there, but FBI investigators were unable to find them. It’s possible those emails could contain classified information.", "The Clinton campaign told PolitiFact it doesn’t know which emails Comey is referring to and reiterated that the State Department has not said any were classified at the time they were sent.", "The context", "Some of Clinton’s emails now made public actually show Clinton’s team talking about how they couldn’t email each other classified information over the private server and instead have to move the conversation to a more appropriate venue. Clinton has said she viewed classified information in hard copy in her office. If she was traveling, she used other secure channels.", "But the FBI investigation found that Clinton sent and received classified information over her private server.", "Why the disconnect?", "Experts say the story here is more about the dysfunction of government classification than about how Clinton regularly handled sensitive information.", "Agencies regularly disagree over what should be classified or not. As the email story has unfolded, the State Department has squabbled with the intelligence community over whether certain emails should be classified today and if it was classified back when it was sent during Clinton’s tenure.", "\"The decision to mark a document is more art than science and leads to bureaucratic in-fighting on whether something should be classified or not,\" said Gary Bass, Bauman Foundation executive director and former director of OMB Watch, a government accountability organization.", "Also, transparency advocates say the government regularly classifies more than it needs to. The government classifies incorrectly 70 percent of the time, according to the Interagency Security Classification Appeals Panel.", "Thomas Blanton, director of the National Security Archive at George Washington University said some of the classified material the FBI identified might not be particularly sensitive. \"There is not a line in any of Mrs. Clinton's emails that meets the smell test of classification, which is their release would be damaging to our national security,\" he said.", "Given these concerns, it’s reasonable to give Clinton a little benefit of the doubt regarding how she treated classified information that landed in her inbox unlabeled, said Steven Aftergood, director of the Project on Government Secrecy at the Federation of American Scientists.", "\"If it had been marked as classified and she or her staff transmitted it through nonsecure email anyway, that would have been an overt violation of procedures,\" Aftergood said. \"If it wasn't marked as classified, then it could easily have been handled in good faith as unclassified.\"", "Our ruling", "Clinton said, \"I never received nor sent any material that was marked classified.\"", "Clinton has made this claim over and over again. An independent FBI investigation has found that to be inaccurate.", "It’s important to remember that only \"a very small number\" of her emails, two, were marked classified when they were first sent, and just 110 out of the 30,000 she turned over were classified but unmarked. Evidence seems to suggest that Clinton generally dealt with classified information in an appropriate manner.", "But over the course of a year, Clinton and her staff have painted a picture of an email setup where absolutely zero classified information slipped through the cracks, case closed.", "We rate this statement False.", "Editor's note: The day after we published this fact-check, Comey testified before the House Oversight and Government Reform Committee on July 7. Comey said he believes three emails on Clinton's server contained information labeled classified at the time they were sent. This information was not properly marked in that the emails did not have a classification header, even though a \"(c)\" immediately preceded text in the body of the emails, designating confidential information. Without the clear classification header, it's reasonable to infer that Clinton did not realize these three emails contained classified information, he said.", "FBI, Statement by FBI Director James B. Comey on the investigation of Secretary Hillary Clinton’s use of a personal email system, July 5, 2016", "NBC, \"Hillary Clinton's First Interview After FBI Meeting,\" July 2, 2016", "U.S. Code, 18 USC Section 1924 Unauthorized removal and retention of classified documents or material, Jan. 3, 2012", "PolitiFact, \"Four pressing questions about Hillary Clinton’s State Department email,\" July 29, 2015", "PolitiFact, \"Hillary Clinton's emails: classified or not?\" Sept. 10, 2015", "PolitiFact, \"What we know about the FBI’s investigation into Hillary Clinton’s emails,\" May 12, 2016", "PolitiFact, \"Fact-checking Hillary Clinton's claim that her email practices were 'allowed,’\" May 31, 2016", "The Associated Press, \"More Clinton emails released, including some she deleted,\" June 22, 2016", "The Washington Post, \"Clinton’s claims about receiving or sending ‘classified material’ on her private e-mail system,\" Aug. 27, 2015", "The Washington Post, \"How did ‘top secret’ emails end up on Hillary Clinton’s server?\" Feb. 4, 2016", "The Washington Post, \"Officials: Scant evidence that Clinton had malicious intent in handling of emails,\" May 5, 2016", "The Washington Post, \"New analysis shows 160 emails missing from Clinton’s disclosure to State,\" June 29, 2016", "The Washington Post, \"FBI interviews Hillary Clinton for more than 3 hours in email probe,\" July 2, 2016", "The New York Times, \"Unclassified Clinton emails may have consequences for a key deputy,\" Feb. 26, 2016", "The New York Times, \"Last batch of Hillary Clinton’s emails is released,\" Feb. 29, 2016", "The New York Times, \"Use of unclassified email systems not limited to Clinton,\" May 10, 2016", "The New York Times, \"F.B.I. interviews Hillary Clinton over private email server,\" July 2, 2016", "Email interview, Clinton spokesman Josh Schwerin, July 3, 2016", "Email interview, Bauman Foundation executive director Gary Bass, July 3, 2016", "Email interview, Steven Aftergood, director of the Project on Government Secrecy at FAS, July 3, 2016", "Email interview, National Security Archive Director Thomas Blanton, July 3, 2016", "Phone interview, Danielle Brian, executive director of the Project on Government Oversight, July 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]