["The deadly face-off between Indian and Chinese soldiers in Galwan valley on June 15 led to the deaths of 20 Indian army men. The casualties suffered on the Chinese side, on the other hand, has been left to much speculation by the Chinese government thus giving rise to misinformation. While rumours have killed anything between five to 100 People’s Liberation Army (PLA) soldiers, the official death toll remains a mystery.", "On August 31, however, Aaj Tak claimed to have obtained ‘exclusive’ imagery that proves “40 PLA soldiers” were killed in the cross-border skirmish. Anchor Rohit Sardana claimed in an impassionate narration, “We are showing you pictures of the graves of Chinese soldiers. Several people in the country wanted proof of the Chinese soldiers who were killed in Galwan clashes. The proof is on your television screens…more than 40 Chinese soldiers died in clashes with India and you can watch how Chinese soldiers paid respect to their tombs.”", "[Translated from: “आज तक एक्सक्लूसिव तस्वीरें. ये आपको दिखा रहा है चीनी सैनिकों की कब्र की तस्वीरें हैं. गलवान में जो झड़प हुई थी उसमें जो चीनी सैनिक मारे गए थे, जिसके लिए देश में भी बहुत सारे लोग खड़े हो गए थे कि सबूत कहां है उसका? उसका सबूत ये सामने टेलीविज़न स्क्रीन पर है…भारत से झड़प में चीन के 40 से ज़्यादा जवान मारे गए थे और उनकी कब्रों पर आप देख सकते है उनको श्रद्धांजली दी जा रही है”]", "गलवान में मारे गए चीनी सैनिकों की क़ब्रों की तस्वीरें हैं. जिसको गिनना हो गिन ले. और दोबारा सुबूत माँग कर भारतीय सेना के शौर्य पर सवाल न उठाए. pic.twitter.com/DkcKUVnIP7", "— रोहित सरदाना (@sardanarohit) August 31, 2020", "Aaj Tak’s English counterpart, India Today, also broadcast similar visuals. The channel showed satellite imagery of the same set of graves with two red arrows pointing at specific area claimed to be “new graves”. Anchor Nabila Jamal claimed, “China soldiers who died in Galwan clash buried at Kangxiwa war memorial. Pictures of that show graves being visited by PLA soldiers…proof of China’s massive Galwan casualties.”", "Chinese soldiers, who died in #GalwanValley clash, buried at Kangxiwa war memorial. #IndiaChinaClash #galwanvalleyclash", "Chinese soldiers, who died in #GalwanValley clash, buried at Kangxiwa war memorial. #IndiaChinaClash #galwanvalleyclash", "Posted by India Today on Sunday, 30 August 2020", "Times Now, on the other hand, claimed, “Photos of 106 PLA tombstones reveal [the] extent of Chinese casualties in June 15 Galwan clash.” The channel further wrote in a tweet, “PM Modi was right about Galwan grit, pro-China lobby ‘doubted’ India.”", "What ‘sold out China lobby’ buried. Photos of 106 PLA tombstones reveal extent of Chinese casualties in June 15 Galwan clash. PM Modi was right about Galwan grit, pro-China lobby ‘doubted’ India.", "Rahul Shivshankar on INDIA UPFRONT. | Tweet with #IndiaCrushChinaLobby pic.twitter.com/q6ixlnxlDe", "— TIMES NOW (@TimesNow) August 31, 2020", "Swarajya penned an article based on Times Now’s reportage.", "NewsX and ABP News also broadcast shows where they claimed over 30 graves of Chinese soldiers who died in Galwan clashes were discovered.", "This slideshow requires JavaScript.", "These photographs are of the Chinese military cemetery in Kangxiwa town that contains graves of PLA soldiers martyred in the 1962 Indian-Sino war.", "While Aaj Tak claimed that 40 PLA soldiers died in the Galwan clashes, India Today did not make a verbal claim on the death toll yet ran images of the cemetery as “proof of massive casualty”. An infographic aired during the show suggested that the cemetery has 105 graves. A defence expert invited on the show, however, said these graves have been present at least since December 2019 and some new graves have recently cropped up.", "Alt News found that the Google Earth photo aired by India Today dates back to 2011. As per our calculation as well, there are 105 graves (43 on the left and 62 on the right) in this imagery.", "Quite ironically, India Today had used the same map in a report published on August 29 which mentioned that it is from 2011.", "We will break down the rest of the fact-check into two sections that separately count the number of graves on the left and right sides of the cemetery.", "A photograph of the cemetery which is viral on social media was found using Chinese search engine Baidu. It dates back to 2011 and clearly shows 43 graves on the left side. The last row (marked in red) contains only one grave.", "On August 24, the Chinese military had shared a video of their visit to the war memorial on the micro-blogging website Weibo. The same video can also be watched on Chinese video-sharing platform Bilibili. Here, the last row on the left has two graves (marked in red). It’s unclear when the new grave was built, however, it was certainly dug up after 2011. Thus bringing up the total number of graves to 44.", "Another image of the cemetery circulating on social media gives a clear view of 63 graves on the right. This image is also fairly recent as the last row on the left has two graves (marked in red circle).", "If you notice the above image carefully, the last row on the right contains five graves (marked in red line). However, in the latest visuals uploaded by the Chinese military, there is a new grave in this row (marked in green below) bringing up the total number of graves in the last row to six and the total number of graves on the right side of the cemetery to 64.", "This means the cemetery has 108 graves. The video uploaded by the Chinese military on August 24 also says that there are 108 graves in the war memorial.", "[Tip: Upload images on Google docs or Google translate (phone) to extract texts.]", "A document uploaded on the website of the Chinese Defence Ministry in April 2020 had put the total number of martyrs buried in Kangxiwa war memorial at 108. The military face-off between Indian and Chinese troops in Galwan reportedly took place in May-June. Thus the imagery aired by Aaj Tak and India Today cannot represent graves of Chinese soldiers martyred in these clashes.", "In fact, we found another picture aired by India Today which dates back to at least December 2019. This picture was uploaded on Chinese question and answer website zhihu.com akin to quora.com. The date can be seen at the bottom of the article.", "It is noteworthy that one of the widely circulating photographs may be recent but we were unable to confirm the antecedents of this grave.", "Dead Chinese soldier’s grave, first evidence of PLA losses in #Galwan", "Tombstone says, “Tomb of Chen Xiangro. He was sacrificed in the struggle against India’s border troops in June 2020…”", "A report by @saikirankannan#IndiaChinaStandoffhttps://t.co/3hoVYy2qO2 via @indiatoday pic.twitter.com/HeyamcBQ1S", "— Geeta Mohan گیتا موہن गीता मोहन (@Geeta_Mohan) August 28, 2020", "To sum up the fact-check, India Today used a satellite image from 2011 to report on Chinese casualties in the Galwan clashes. The pictures aired by India Today, Aaj Tak and Times Now show the memorial in Kangxiwa that contains graves of Chinese soldiers who died in the 1962 war with India. Alt News found that at least three new graves were built on the site post-2011. Another picture of a grave that appears to have been recently built is floating online. However, we were unable to confirm the details of this grave.", "Journalist Sushant B Sinha tweeted pictures of the Kangxiwa war memorial as graves of Chinese martyrs in the Galwan clashes. “Do not except the ‘give us proof’ brigade to feel any shame,” he wrote.", "ये गलवान घाटी में भारतीय शूरवीरों के हाथों मारे गए चीन के सैनिकों की क़ब्रें हैं।मैंडरिन में लिखा है कि जून में भारतीय फौज के साथ झड़प में मारे गए हैं। वैसे ये उम्मीद मत कीजिएगा कि इससे ‘सबूत मांगो ब्रिगेड’ को कोई शर्म महसूस होगी। उनका एजेंडा चलता रहेगा। बहुत मोटी चमड़ी है उनकी। pic.twitter.com/iiUIRr9MHI", "— Sushant Sinha (@SushantBSinha) August 31, 2020", "Newly-founded website Kreately published a report claiming more than 100 Chinese soldiers were killed in the clashes. This was shared by BJP leader Kapil Mishra and party supporter Sanjay Dixit. Kreately had earlier promoted the false claim that Chinese dissident Yang Jianli had said that 100 Chinese soldiers died in Galwan skirmish.", "Rishi Bagree tweeted “big blow to China and Congress” while claiming “35-106” Chinese soldiers fell in the Galwan clashes based on the same set of images.", "Picture of graves of Galwan-Chinese Casualities has emerged on Social Media", "Claims Ranging from 35-106 Chinese soldiers were killed by Indian Army Jawans during #galwanvalleyclash", "This is a big blow to China & Congress pic.twitter.com/3ecplYSL6L", "— Rishi Bagree (@rishibagree) August 31, 2020", "[Also read: Rishi Bagree: A relentless purveyor of misinformation]", "Other Twitter users that drew hundreds of retweets were @IndoPac_Info and @BefittingFacts.", "This slideshow requires JavaScript.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]