["“This happened in Houston today!,” reads a Facebook post published on February 18, 2021, with more than 3,000 shares.", "Another Facebook post, this one with more than 250 shares, features the caption: “Houston is Freezing right now!”", "The same claim was also shared here on Twitter, adding that this was the result of frozen water pipes that had burst.", "A reverse image search on Google shows that the image was shared online back in 2019 (here and here) and 2018 (here and here), long before the recent winter storm in Texas. Some posts claim it was taken in the state of New York, while others claim it was in Wisconsin.", "While it is clear that the image is not recent, AFP Fact check has not been able to establish the location or origin of the picture.", "AFP Fact Check has debunked other claims related to the Texas winter storm here and here.", "Last week, Texas was hit hard as a frigid airmass paralyzed parts of the southern and central United States, claiming more than 70 lives. Millions of people were left temporarily without power and water lines were frozen.", "Following the storm, US president Joe Biden issued a major-disaster declaration for much of Texas so as to provide badly-needed financial and administrative aid.", "The state’s governor has ordered an investigation into its power grid operator, while several of the operator’s board members have resigned. The Federal Energy Regulatory Commission has also said it will probe the factors behind the power outages.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]