["This post was published on Facebook on December 14, 2020. It has been shared more than 700 times.", "It features an image of Buddhist monk Medille Pagngnaloka thera, a representative of a Sinhala nationalist organisation named Sinhale.", "The post purports to show a Sinhala-language news article. The headline translates to English as: “The President has not worked outside of the people's mandate", "\"We have to be proud of the fact that we are exporting meat without consuming it in this Buddhism empire led by the principle of non-violence”.", "The Sinhala-language text superimposed on the image reads:  “Take a look at this monk preaching”.", "The post circulated online shortly after the opening of a meat processing plant -- said to be one of South Asia’s largest -- in the outskirts of Colombo on December 12, 2020 as reported by local newspaper Daily Mirror.", "Critics mocked the plant's opening, pointing out that the government had laid out plans to ban cattle slaughter countrywide a few months ago. Here is an AFP report on the issue.", "The image was shared alongside a similar claim in multiple Facebook posts here, here and here.", "The claim is false; the image of the newspaper article has been doctored.", "The purported newspaper screenshot shows a byline for Anura Balasuriya, who is a senior reporter at the Sinhala language daily Divaina.", "In response to the misleading posts, a newspaper spokesperson told AFP that no such article quoting Medille Pagngnaloka thera had appeared in the paper that week.", "“Although the layout appears to be similar, a closer look at it will indicate that the header font is different to that of the Divaina layout,” the spokesperson told AFP by phone on December 16, 2020.", "AFP searched the archives of the Divaina newspaper edition from December 12 to December 14 and found no such article quoting the monk was published.", "The body of the article has been completely blurred out, indicating only the header has been doctored to add the false quote attributed to the monk.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]