["About this rating", "Archaeologists excavating a well-known burial site believed to be the final resting place of Cleopatra discovered a number of mummies dating back an estimated 2,000 years, some of which had golden tongues placed within their mouths.", "Kathleen Martinez, of the University of Santo Domingo in the Dominican Republic, reported that her team discovered 16 burial shafts at the Taposiris Magna Temple in western Alexandria. The find was shared in a Facebook post dated Jan. 29, 2021, and in a statement made by Egypt’s Ministry of Tourism and Antiquities.", "Taposiris Magna is an ancient town located on Lake Mariut in Egypt with a temple whose name implies that it was a tomb of Osiris, the Egyptian god of fertility and the afterlife. This nearly 100-foot-tall landmark has been theorized to be the final resting place of Queen Cleopatra, the Greek famed for her beauty who reigned over Egypt 2,000 years ago. Cleopatra was the last ruler of Egypt before it was annexed to Rome in 30 B.C., according to Ancient History.", "Archaeologists said that the number of “mummies in a poor state of preservation” found inside the shafts highlighted the characteristics of mummifications in the Greek and Roman eras. According to research published by the Spurlock Museum of World Cultures, mummification processes were much different when Egypt was considered a part of Greece and Rome. In many instances, the art of embalming “rapidly declined” and embalmers no longer could no longer afford to take the time to efficiently mummify a body. Often, bodies had already started to decay before the process had begun.", "“X-rays of mummies from this time period show wrappings that cover incomplete bodies with missing parts replaced by bones, pottery, or palm fibers,” wrote the institution. “The emphasis for these later mummies was not on the treatment of the body but on the external additions. Within the bandages were wrapped masks, breastplates, and foot coverings made of cartonnage.”", "Among the items discovered were a funeral mask made for a woman. Egypt Ministry of Tourism and Antiquities", "And these external adornments were exactly what Martinez and her team discovered at Taposiris Magna. Some mummies were wrapped in gilded cartonnage, the material that is used to wrap a mummy, while amulets of tongue-shaped golden foil were placed inside the mouths of others in what is believed to have been part of a ritual to enable speaking in the afterworld. To be clear, they were not actual tongues covered in gold.", "Marble statues found at the temple were indicative of Roman and Greek art. Egypt Ministry of Tourism and Antiquities", "Of particular interest were two of the newly discovered mummies, one of which was adorned with decorations in the likeness of Osiris, the god of the afterlife, and the other of which wore what is known as the Atef crown. Also symbolic of Osiris, this feathered white crown was decorated with horns and a cobra snake on the forehead. The chest of this mummy also exhibited a gilded decoration in the form of a necklace with the head of a falcon, a symbol of the god Horus.", "Other significant archaeological treasures were discovered, according to Dr. Khaled Abu Al-Hamd, director general of Alexandria Antiquities, including a funeral mask designed for a woman. Also found were eight golden flakes representing a golden wreath, and eight masks of marble that also dated to the Greek and Roman areas.", "Excavations over the last decade have revealed important finds that have helped archaeologists piece together the history of the Temple of Tabosiris Magna. These include coins bearing the name and image of Cleopatra VII and other pieces of archaeological significance that prove the temple was built by King Ptolemy, the younger brother of Cleopatra who was ceremonially married to her so she could ascertain the throne.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]