["About this rating", "On 18 July 2016, Donald Trump's wife Melania delivered a speech that was stirring in many ways — portions of the audience watching in the convention hall and on television were moved, while others\nwere spun into a frenzy upon immediately noticing that portions of Melania's convention address appeared to have been lifted from Michelle Obama's 2008 convention speech.", "A litany of explanations were floated by the Trump campaign, its surrogates, and the media for two days after the controversial incident. But on 20 July 2016, the Trump campaign released a letter [PDF] that initially prompted more questions than answers, attributing the error to Trump speechwriter/ghostwriter Meredith McIver and asserting that McIver had tendered her resignation (which was summarily rejected by Donald Trump):", "Meredith McIver offered resignation over Melania speech. Statement and letter ---> pic.twitter.com/qfVPsTuN19", "— Katy Tur (@KatyTurNBC) July 20, 2016", "In a year of what felt like increasingly implausible news, Melania Trump's controversy and the involvement of Meredith McIver in it was just another bizarre twist to many social media users and journalists. No one could recall having previously heard of Meredith McIver even though many of the campaign's operatives were well known to the news media, making the public suspicious that Melania's \"speechwriter\" was another \"John Barron.\" (Barron was one of two pseudonyms used by Trump himself to interact with the media earlier in his career.)", "Entire articles pointed out seeming \"holes\" in the putative existence of the Meredith McIver \"character\":", "McIver’s Facebook page is only a day old as well and she has no friends. One would hope that as a “long-time employee” she would have made at least a few friends in the Trump organization.", "McIver has a page at Speakerpedia, but strangely there are only two reviews, both of which came over the past two days. And the page has yet to be claimed by Ms. McIver. McIver does have an author page on Amazon.com, but there’s no photo, or any writing credits outside of work done for Trump.", "Her Twitter identity is a little shaky as well.", "A Google search restricted to a few months prior to July 2016 was populated with references to McIver as a Trump employee, primarily with respect to her co-authorship of Trump books. And in 2007 the Guardian published a piece (which has not since been edited to include a reference to McIver) in which the elusive writer made a brief appearance in an article about Donald Trump:", "Time being money, Trump springs up to hand me some propaganda: glossy brochures featuring Trump Towers, Trump Palaces, Trump Plazas, Trump Hotels and Trump Golf Clubs all over North America — correction, the World.", "'I'll get you a biography, too.'", "Well, I mutter, I've read several of your autobiographies and ...", "'This'll be a little easier for you. MEREDITH!'", "Trump has what some of his employees refer to as an open-door policy; its main function seems to be that he can shout at them through it.", "'Would you get me a biography please!'", "Meredith McIver, one of the assistants who doubles as his ghost writer, scuttles in with a few sheets of paper, on which a company bio is printed in bold and written in similar fashion: 'A schoolboy's dream ... a competitor's challenge. Donald J Trump is the very definition of the American success story. In August 2006, Mr Trump was voted by the staff and writers of Business Week as one of the Top 10 most competitive business people on the planet.'", "McIver was also heard (but not seen) in a 2005 New York Times article about ghostwriters that referenced her (open) co-authorship of that year's Trump book, Think Like a Billionaire:", "Thus, at the end of \"Think Like a Billionaire,\" after Trump has thanked all the pertinent people, McIver thanks her family, her friends, her minions, the Trump Organization and even Tassos of Patmos. If we have reached the point in our history where ghostwriters find it necessary to thank Tassos of Patmos for his contribution to the making of \"Think Like a Billionaire,\" I shudder to think what is coming next. Whoever Tassos of Patmos is.", "Furthermore, Meredith McIver is registered to vote in New York City (but presumably didn't cast a ballot in the state's closed primary for her boss, given that she is registered  as a Democrat).", "While Meredith McIver may have maintained a low profile throughout her years in Trump's employ, she has been spotted by at least one journalist and maintains an active voter registrant. The sudden spotlight shined upon her made her convenient appearance suspicious, but the evidence suggests McIver has been kicking around Trump Tower for quite some time.", "Perry, Tod.     \"Is Trump Speechwriter Meredith McIver a Real Person?\"\r\n    GOOD.   20 July 2016.", "Queenan, Joe.   \"Ghosts in the Machine.\"\r\n    Vice.   20 March 2005.", "Surico, John.   \"Remembering John Barron, Donald Trump’s ‘Spokesman’ Alter Ego.\"\r\n    Vice.   6 November 2015.", "Wood, Gaby.   \"Donald Trump: The Interview.\"\r\n    The Guardian.   7 January 2007.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]