["About this rating", "It's not every day that readers see a paid online advertisement that describes the cumulative weight of someone's bowel movements.", "One such ad for the FloraSpring weight loss supplement reads as follows: \"65 y/o Man Poops Out 42 Lbs.\" A somewhat similar YouTube video ad also promised a \"pooping habit\" for customers who take FloraSpring.", "First, this is the Google-hosted ad that claimed a 65-year-old man had 42 pounds of bowel movements:", "However, the photo in the misleading ad did not show a man who \"pooped out 42 pounds\" (nor was he actually 65 years old). It was originally posted by photographer Pavel Ladziak in 2017.", "In 2017, Bodybuilding.com reported that Ladziak was nowhere near 65 years of age:", "\"Pawel Ladziak, a 35-year-old Polish fitness pro and personal trainer, is causing a sensation on Instagram by intentionally aging himself. His goal: to look as muscular and as old as he possibly can.\"", "There was no indication that Ladziak had any involvement with or knowledge of the \"Man Poops\" ad. We reached out to him, and will update this story should we hear back.", "The misleading ad led to a full-screen seminar-style video on a website for FloraSpring. It was described as \"a weight loss supplement that assists in the weight loss process by increasing one’s metabolism.\"", "At first, a red line at the bottom of the screen looked to be a progress bar for the video player. However, the line appeared to be part of the video itself. It moved at a fairly quick speed at the beginning of the video, giving the effect that its running time would be short (as promised in the ad). However, the line later slowed to a crawl for the remainder of the presentation.", "Around 80 seconds into the video, the video's voice-over announced: \"In the next 6 minutes and 27 seconds, you're going to get to go behind the scenes at Dr. (Steven) Masley's private clinic.\" However, the video lasted well over 45 minutes.", "Viewers who attempted to leave the video page were shown a notice. It said: \"WAIT! BEFORE YOU GO... READ THE FREE REPORT FROM DR. MASLEY INSTEAD OF WATCHING THIS VIDEO NOW... CLICK HERE NOW.\" It led to a fairly lengthy page with an introduction from Dr. Steven Masley, MD.", "The page purported to feature success stories for FloraSpring. The pictures next to the stories were from unrelated websites. For example, one of the pictures was from a YouTube video that featured dancing. Another looked to have come from the satirical website ClickHole.", "We contacted Revival Point LLC, the company that sells FloraSpring. We asked about the ad that claimed a 65-year-old man released 42 pounds of fecal matter. The company's name was \"Revival Point Labs\" in the ad.", "A company spokesperson claimed that an affiliate was to blame. They also said the ad was a violation of the company's terms of service:", "This advertisement is not run by Dr. Masley or Revival Point LLC.", "The man in the photo does not represent a Revival Point LLC customer and the ad copy does not represent any of the studies supporting the ingredients in the product.", "The spokesperson later said they \"submitted the link to Google Adwords to get the ad account removed that's running the ads.\" They also told us that they \"terminated the link from these ads and permanently removed the affiliate.\"", "We asked about the unrelated photographs in the success stories. They told us that the three stories were representative of Masley's patients, but that real names and photos were changed for privacy reasons:", "As for the photos on the longer page, these people represent three of Dr. Masley's patients, but their names and photos have been changed to keep their identity private. Due to Doctor/Patient confidentiality, we cannot provide any further information on these patients or their medical history with Dr. Masley.", "The photos on the page have been replaced with licensed stock imagery.", "Following our email to Revival Point LLC, the original pictures were changed to stock photographs.", "We also stumbled upon a YouTube video that purported to show a FloraSpring video advertisement about a \"pooping habit.\" Masley appeared in the video, which looked to have been screen-recorded and posted by a YouTube user. The ad mentioned \"poop\" and \"pooping\" many times. The small, corner photograph of Masley matched the profile picture on a YouTube channel for Revival Point Labs.", "The ad's voice-over script promised a \"pooping habit\" with FloraSpring:", "The good news is this pooping habit is something that anyone can start at any time at any age. It will help burn off pounds of fat, restore energy, shut down cravings, and yes, help you have amazing poops.", "Poop more often. Poop better. Make your poops more solid, and yet come out much easier, all while flushing out pounds of fat, flushing those excess calories and fat right out your butt into your toilet, and right down the drain, gone for good.", "We asked Revival Point LLC about the FloraSpring \"pooping habit\" ad. In response, they said: \"This does not appear to be from us or affiliated with us.\"", "In sum, a picture in an online advertisement did not show a 65-year-old man. He also did not \"poop out 42 pounds\" after taking FloraSpring. The man in the ad is Ladzia, a Polish photographer. He's in his late 30s, and ages himself to look older as a hobby. Revival Point LLC claimed that the Google ad and the \"pooping habit\" YouTube video ad were not created by their company.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]