["About this rating", "In July 2015, the World News Daily Report (WNDR) entertainment website published an article about a 5-meter-tall (approximately 16.5 feet) human skeleton that was unearthed in Australia:", "The gigantic hominid specimen that measures an incredible 5.3 meters tall (17 foot and 4 inches) was discovered near the ancient ruins of the only megalithic civilization ever discovered in Australia, which makes the discovery twice as puzzling admits professor Hans Zimmer of the University of Adelaide.", "“The discovery of the Uluru archeological site last year already took us by surprise, but this new find is just jaw-dropping” he admits, visibly dumbfounded.", "“Theoretically, a five-meter-tall hominid cannot exist. How did this occur? How is this possible. Although this discovery is fascinating, we are left with more questions than answers” he concedes.", "Although this claim originated with a well-known entertainment website — a disclaimer on the site explains that all of its content is \"entirely fictional\" and satirical in nature — the above-displayed text and photographs continued to spread online by third parties. In 2017, for instance, WNDR's content was repackaged into a video by the YouTube page \"UFOmania - The truth is out there.\" A year later, the website ScienceVibe passed this content off as if it were genuine news. In June 2019, this content went viral again after it was shared by the Facebook page Historistic.", "The above-displayed pictures, of course, do not actually show a 5-meter-tall skeleton. These photographs were taken in France (not Australia) in November 2012 and show an archaeologist excavating the remains of a woolly mammoth that was found at a quarry site near Paris.", "The top photograph from the WNDR article is available via Reuters along with the caption:", "A French archaeologist from the French National Institute for Preventive Archaeological Research (INRAP) works to finish up the excavation of remains from a preserved woolly mammoth skeleton, nicknamed 'Helmut' by the excavation team and estimated to date from 125,000 to 200,000 years ago, at a quarry site in Changis-sur-Marne, East of Paris, November 8, 2012. French archaeologists have uncovered a rare, near-complete skeleton of a mammoth in the countryside near Paris, alongside tiny fragments of flint tools suggesting the carcass may have been cut into by prehistoric hunters. The archaeologists say that if that hypothesis is confirmed, their find would be the clearest ever evidence of interaction between mammoths and ancient cavemen in this part of Europe. REUTERS/Benoit Tessier (FRANCE - Tags: SOCIETY SCIENCE TECHNOLOGY)", "The other photograph shows the same woolly mammoth skeleton. That picture was taken by Denis Gliksman of the Institut national de recherches archéologiques préventives (INRAP) and is available on the French website Sciences et Avenir with the following caption (loosely translated via Google):", "HELMUTH. Les ossements d'un squelette entier de mammouth adulte ont été découverts en juillet dernier sur le chantier de fouille d'un site gallo-romain. L'animal aurait vécu entre 200.000 et 50.000 ans avant notre ère. Il s'agit du quatrième spécimen trouvé en France en un siècle et demi.", "HELMUTH. The bones of an entire adult mammoth skeleton were discovered last July at the excavation site of a Gallo-Roman site. The animal would have lived between 200,000 and 50,000 years before our era. This is the fourth specimen found in France in a century and a half.", "These images do not show a 5-meter-tall human skeleton that was unearthed in Australia. These images actually show an approximately 150,000-year-old woolly mammoth skeleton nicknamed \"Helmut\" that was discovered near Paris in 2012.", "This is hardly the first time that images supposedly showing \"giant human skeletons\" have gone viral online. We've previously written about several of these so-called \"discoveries.\" To date, we've yet to come across any genuine photographs of an actual skeleton belonging to a real ancient giant human.", "World News Daily Report.   \"5-Meter Tall Human Skeleton Unearthed in Australia.\"\r\n    28 July 2015.", "Ignasse, Joel.   \"L'année 2012 en Images.\"\r\n    Sciences et Avenir.   3 January 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]