["Anothr genius frm @RahulGandhi ‘s team Ashok Gehlot @INCIndia Raj CM wannabe – “Govt is bldng a dam 4 power generatn. Once power is extracted, water is relsd to farms. But pwr is alrdy extracted from water, so what is use of such water to farms whch hs no power in it?” Rajeev Chandrasekhar, BJP MP and media baron has tweeted this message along with a video clip of Rajasthan Congress leader Ashok Gehlot. The tweet has now been deleted.", "In the 16-second clip, Gehlot is heard saying, “Jab pani mein se bijli nikal jayegi, aur pani kheto mein jayega, toh pani mein se bijli nikal jayegi toh takat hi nikal jayegi, phir kheto mein pani kaam kya ayega (If electricity is removed from water and the water goes to the farm, such water will have no energy and will be useless in the farm- translated).", "Alt News had established the truth of the video clip featuring Ashok Gehlot which was circulated earlier in June 2018 on social media. Among those who shared it included BJP spokesperson Sambit Patra.", "Friends I received this video! Is it authentic?? Is this the way the Congress misguided our Farmers?? Pls enlighten!! अशोक गहलोत का विज्ञान – पानी मे से बिजली पैदा करके खेतो में भेजेंगे तो प… https://t.co/cLPCawUXiz via @YouTube", "— Sambit Patra (@sambitswaraj) June 5, 2018", "Numerous social media users had tweeted the video, ridiculing the Congress party and the former Rajasthan CM with the hashtag #ScientistGehlot.", "The video is of a press conference by the Congress party on May 26, 2018. Watching the video in totality makes it clear that Gehlot is referring to Jan Sangh, the forerunner of the BJP. According to Gehlot, when he was young he had witnessed how Jan Sangh cadres were spreading misinformation about the Bhakra dam which was inaugurated by former PM Jawaharlal Nehru, spreading rumours that once electricity is removed from water, the water will become useless. He had said, “I remember, during childhood there was the Jan Sangh. When the Bhakra dam was built, Jan Sangh cadres used to preach that ‘Pandit Nehru has lost it. He is building a dam, on which he will construct a hydro power plant. If electricity is removed from water and the water goes to the farm, such water will have no energy and will be useless in the farm”- translated).", "Gehlot had tweeted a clarification with a longer version of the video after he was derided on social media. He had earlier posted the complete video of the press conference on his official Facebook page.", "ये इनकी असलियत है और इनकी फितरत में है कि मुझ जैसे साधारण इंसान को भी #ScientistGehlot का दर्जा दे देते हैं। This is the original, which was edited.. pic.twitter.com/KGygG7RPMn", "— Ashok Gehlot (@ashokgehlot51) June 5, 2018", "Political propaganda is pervasive on social media, and is not restricted to anonymous identities on various platforms. A little research on the internet would have helped avoid this faux pas by Chandrasekhar, who jumped the gun in his rush to mock the Congress party.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]