["The image was published on Facebook here on October 22, 2020.", "The text in the image translates to English as: “For 70 years we were teased by the Pakistan national flag, yesterday at a rally in Karachi, an Indian national flag was raised. Victory to mother India.”", "The post’s caption translated as: “Hail Mother India / Hail India”", "The image was also shared alongside a similar claim on Facebook here, here, here and here; and by two politicians of India’s ruling Bharatiya Janata Party here and here.", "The image, however, has been doctored.", "A reverse image search on Google found that the original photo shows no Indian flag raised in the crowd. The photo was published by Pakistani English-language newspaper Dawn here on October 19, 2020.", "The photo is attributed to Dawn and is captioned: “Supporters of opposition parties gather at Bagh-i-Jinnah in Karachi for PDM’s second rally.”", "PDM, an acronym for Pakistan Democratic Movement, is a coalition of opposition political parties united against the ruling government Prime Minister Imran Khan. The photo shows PDM supporters gathering on October 18, 2020, for a rally in Bagh-i-Jinnah, a historic park in Karachi.", "Below is a screenshot comparison of the image shared in the misleading post (L) and the original Dawn photo (R):", "Similar photos from the rally were also published on Twitter here on the official account of the Pakistan Muslim League (Nawaz), a PDM political party, and here by the party’s chief, Maryam Nawaz.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]