["About this rating", "On 20 February 2018 the satirical web site Reductress turned a Black Panther tie-in piece into a swipe at racial profiling by law enforcement -- and did it well enough that readers contacted us asking if the story was real.", "According to the site, the cast of the Marvel Entertainment film was placed on a Federal Bureau of Investigation's watch list for \"domestic terror organizations\":", "Sources report that A-list celebrities Chadwick Boseman, Michael B. Jordan and Lupita Nyong’o have been added to the watch list, with little justification other than seeming \"suspicious.\"", "\"It's an imperfect process,\" says one source within the FBI. \"But if anything uses the words 'black' and 'panther' we're all over it.\"", "The cast is not on any \"watch list\"; the site makes it clear that its stories are fabricated. Unlike disreputable blogs that hide behind the \"satire\" label, though, Reductress does not generate traffic with inflammatory posts that play on fear and racial prejudice.", "Instead, Reductress's stories poke fun at tropes in stories about relationships or self-help, among other topics. The site bills itself as \"the first and only satirical women's magazine,\" adding:", "The mission of Reductress is to take on the outdated perspectives and condescending tone of popular women's media, through the eyes of the funniest women in comedy today. Also, we want people to think we're pretty.", "If the Black Panther story resonated, it might be in part because of a leaked FBI report about alleged \"Black Identity Extremist\" groups. The report said:", "The FBI assesses it is very likely Black Identity Extremist (BIE) perceptions of police brutality against African Americans spurred an increase in premeditated, retaliatory lethal violence against law enforcement and will very likely serve as justification for such violence. The FBI assess it is very likely this increase began following the 9 August 2014 shooting of Michael Brown in Ferguson, Missouri, and the subsequent Grand Jury November 2014 declination to indict the police officers involved.", "The leak led to a meeting between members of the Congressional Black Caucus and FBI Dirctor Christopher Wray, as well as a House Judiciary Committee hearing in November 2017 in which lawmakers pointedly questioned Attorney General Jeff Sessions.", "Reductress editor Sarah Pappalardo told us:", "There are lots of pieces on our site that unfortunately people take as real. Hopefully people do the very simple work of clicking on the article to understand what they are reading, which is a satire site. As we live in a world where people of color are quickly labeled terrorists while white men are often labeled as \"misunderstood\" or \"mentally ill\" after committing mass atrocities, we hope people are more aware of the racialized way that we determine who is and isn't dangerous.", "Critics of the FBI accused the agency of focusing more on alleged \"black extremists\" than actual white nationalists who attack or kill police officers.", "As of 21 February 2018, Black Panther had grossed $263.2 million at the box office.", "Duster, Chandelis R. \"Black Lawmakers Meet with FBI Director Over 'Black Identity Extremists' Report.\"\r\nNBC News. 29 November 2017.", "Associated Press. \"WATCH: Lawmaker asks Sessions why there's an FBI report about black 'extremists,' but not one about those who are white.\"\r\nAccessed via PBS Newshour. 14 November 2017.", "Irby, Kate. \"White and Far-Right Extremists Kill More Cops, But FBI Tracks Black Extremists More Closely, Many Worry.\"\r\nMcClatchy Washington Bureau. 24 January 2018.", "D'Alessandro, Anthony. \"'Black Panther' Posts Record $21M Pre-Summer Tuesday; Second Weekend To Reap $104M-$109M.\"\r\nDeadline. 21 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]