["About this rating", "A call to boycott the South Korean multinational conglomerate Samsung (best known in the U.S. for their electronics products) has been widely shared over the company's alleged involvement in the manufacture and sale of a device purportedly used to skin dogs alive for food preparation:", "These machines are manufactured by Samsung to ripped the hair off dogs while they are still alive in the machine as it spins!", "Samsung supplies these machines to vendors and dog meat traders. Not only is Samsung actively helping the barbaric practice of dog eating to continue but are also contributing to the suffering of thousands of dogs that are being tortured and killed, by being boiled, blow torched or skinned alive, the most horrific brutal methods possible by the dog meat butchers.", "Samsung does not care! Their interest is only in profit.", "The device pictured in the graphic is real, but the accompanying description of it is inaccurate. This device is not manufactured or sold by Samsung, and it was not used to skin a live dog. The photograph of the dog carcass was taken by Swiss documentary photographer Didier Ruef in South Korea in 2002, who noted the device was being used to eliminate the fur from an already-dead dog:", "South Korea. Kimje area. Dog's slaughter for meat. A machine spins the dead dog to get rid of its fur.", "While the notion of eating dog meat may be appalling to most westerners, Ruef observed that \"dog meat is a delicatessen [sic] of Korean traditional cooking\" and the dish known as Bosintang is \"made of dog meat cooked in a soup with various spices and vegetables.\"", "The machine depicted in the photograph probably wasn't designed for the sole purpose of skinning dogs. It closely resembles a contraption that is commonly used to de-feather slaughtered chickens and can readily be purchased commercially (although the version displayed here appears to be a homemade version).", "So what does Samsung have to do with any of this? A petition posted to Change.org calls on major companies, such as AT&T, Sprint, Verizon Wireless, Walmart, Costco, Best Buy, Amazon, Samsung, and LG to help stop the \"heinous butchering and eating\" of dogs in South Korea. Although these companies do not directly contribute to the culinary habits of South Koreans, the petition holds that by remaining neutral, these companies are condoning the act of eating dogs:", "Bishop Desmond Tutu said, “If you are neutral in situations of injustice, you have chosen the side of the oppressor.”", "As a major retailer of Samsung and LG products, you have the power to influence the S. Korean government to end the horrific cruelty that is perpetrated against innocent dogs and cats of South Korea.", "It's possible that whoever created the graphic seen here misread the petition and mistakenly associated the manufacture of the pictured machine with Samsung.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]