["On August 24, Mojo Story tweeted a video of a policeman mercilessly beating up a young boy. The channel, founded by journalist Barkha Dutt, reported that the boy was wandering the streets of Delhi’s R K Puram in search of food.", "#Delhi: A policeman seen assaulting a young boy, in a video that surfaced from RK Puram. The boy was allegedly wandering on the streets late at night in search of food. He is seen pleading #innocence. pic.twitter.com/RqCEPE8tpP", "— Mojo Story (@themojo_in) August 24, 2020", "What followed were a series of tweets claiming that the outlet revived an 8-month-old video of a cop thrashing a chain snatcher attacking women on the road with blades. BJP Delhi leader Kapil Mishra wrote “fake news by Barkha gang” while tweeting that the boy “attacked the cops as well with blades.” His tweet drew 8,500 retweets.", "Fake News by Barkha Gang", "This is 8 months old video", "The guy is a chain snatcher caught when he was attacking women on road with blades", "he attacked the cops as well with blades https://t.co/nDRASFTSvO", "— Kapil Mishra (@KapilMishra_IND) August 24, 2020", "Raj Shekhar Jha, journalist with The Times of India, tweeted claims similar to Mishra’s adding that the Delhi police has clarified that the boy had attacked cops before the video was shot.", "Responding to a Twitter user who had shared the video, DCP Delhi (South West) said policemen patrolling near Ekta Vihar JJ camp saw a group of 4-5 boys “sitting/ loitering” around a public toilet. “Since they were briefed about repeated concerns raised by women of nearby JJ camps, who had been using this public toilet especially at night, [they] were asked to leave the place immediately,” reads the tweet adding that the boys were “chased away” when the cops spotted them during the second round of patrolling at 3 am.", "“An enquiry has been ordered into the conduct of constable as shown in the video,” concludes the tweet.", "who had been using this public toilet especially in night, were asked to leave the place immediately. During their second round around 3am they again saw them back and were chased away. An enquiry has been ordered into the conduct of constable as shown in the video.", "— DCP South West Delhi (@dcp_southwest) August 25, 2020", "According to a report in The Indian Express, “An initial investigation revealed that lower staff in the R K Puram Police Station failed to brief their seniors with all the facts and tried to mislead them by saying it was an old video.”", "PTI subsequently quoted police officials stating that the cop was suspended. “Soon after the matter came into their notice, we immediately suspended the constable and have also initiated an inquiry into the matter,” said police official Devender Arya per the report.", "The boy who was beaten up was reportedly a minor. A video of the same was tweeted by Mojo Story but social media users including BJP leader Kapil Mishra and The Times of India journalist Raj Shekhar Jha rushed to the police’s defence. They justified the brutality by claiming that the boy who was beaten up was a chain snatcher armed with blades.", "In 2017, a false report published in The Times of India authored by Raj Shekhar Jha claimed that missing JNU student Najeeb Ahmed had joined terror outfit ISIS.", "The video was massively viral on Facebook before it was tweeted by Mojo Story on August 24. Varun Sharma, who identifies himself as a Delhi-based journalist, had shared the clip on his profile drawing 63,000 shares. This was on August 23 at around 11 pm.", "The video was earlier tweeted by ANI journalist Manish Gupta at 2:02 am on August 23. Gupta later deleted the video and also changed his username to @ANI_ManishG.", "However, the clip gained prominence only after Mojo Story’s tweet which attracted flak from several people targeting Barkha Dutt for carrying ‘fake news’ on her channel. Among them were Rajesh Singh, Keh Ke Pehno and @Being_Humor.", "This slideshow requires JavaScript.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]