["“FINALLY THEIR WASTED AGRO PRODUCTS HAVE SEEN BUYERS,” this Facebook post reads. “COW WINS BIG IN THE LATEST NORTH VERSUS SOUTH FOOD BLOCKADE! (sic)”.", "The post, which includes four similar versions of the same scene showing cows helping themselves to a mountain of tomatoes, has been shared more than 300 times since March 4, 2021.", "One of the photos was also shared alongside a similar claim on Facebook here and here.", "Northern Nigeria is known for herding and commercial agriculture and produce grown here is supplied to the south.", "But in February 2021, cattle farmers and food traders restricted movement of their products to the south in protest against recent unrest in the region, including clashes at a local market in Oyo state and the violence that followed deadly anti-police brutality protests in Lagos last October.", "Although the ban was lifted this week on March 3, 2021, numerous social media posts continue to circulate with the viral image and the claim that it shows how the disruption affected the supply of farm produce.", "The photo is unrelated to events in Nigeria.", "AFP Fact Check ran a Google reverse image search and found that the image appears in numerous older posts from India, including the earliest version featuring in a 2013 report by Hindi online publication Bhopal Samachar.", "The article describes the toils of Barwani farmers who struggled to offload their produce despite government intervention intended to help make agriculture profitable.", "Barwani is a trade centre for agricultural produce and timber, and it is located in Madhya Pradesh state in central India.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]