["By D'Angelo Gore", "Posted on May 27, 2020", "In a May 22 radio interview, presumptive Democratic presidential nominee Joe Biden made a number of false, misleading or exaggerated claims.", "Biden made all of those claims during a roughly 18-minute segment on “The Breakfast Club” radio program. But it was a controversial comment he made about African Americans near the end of the interview — that “if you have a problem figuring out whether you’re for me or Trump, then you ain’t black” — that received the most attention.", "The Columbia University study, which has not been peer reviewed, was posted on the preprint server medRxiv on May 20. The study’s authors calculated that, had social distancing and other enforcement measures, such as stay-at-home orders, been widely implemented in the U.S. on March 8 — rather than in mid-March — 35,927 of nationwide COVID-19 deaths through May 3 could have been avoided. If those public restrictions had gone into effect even sooner, on March 1, the researchers estimated that 53,990 deaths from the disease caused by the coronavirus could have been prevented.", "What the study does not say, however, is that Biden suggested taking such steps, which is the false impression he gave during the interview when he said: “They pointed out that if he had listened to me and others and acted just one week earlier to deal with this virus, there’d be 36,000 fewer people dead.”", "It’s true that “others” — including health officials in Trump’s own administration — said prior to March that social distancing would need to be enforced in order to slow the spread of the virus. We’ve written about some of the early warnings Trump got about how damaging COVID-19 could be for Americans.", "But we asked the Biden campaign for an example of Biden calling for social distancing, or something resembling a nationwide lockdown, by early March — and it didn’t offer one.", "In fact, Biden was still holding campaign rallies with large groups of people at that point. He reportedly spoke to a crowd of about 1,000 at a Detroit high school on March 9, the eve of Michigan’s Democratic primary, for example.", "The next day, the campaign did cancel a planned rally in Ohio, citing concerns about potentially spreading the virus. But, after Biden’s primary wins on March 10, he still delivered a victory speech before a group of “about 50 staffers, supporters, and members of the media,” at an event in Philadelphia that was closed to the public, according to the Philadelphia Inquirer.", "Biden didn’t release his own plan to combat the virus until March 12. It mainly called for, among other things, making testing for COVID-19 free and widely available, as well as offering financial assistance for all those affected by the outbreak, including paid sick leave.", "It was that same day when the Biden campaign reportedly issued a memo to staff instructing “all Biden for President employees both in our Philadelphia headquarters and in field offices across the country” to work from home, beginning March 14.", "Of course, it wasn’t until later, on March 16, that the White House coronavirus task force issued its own guidelines for a 15-day trial to slow the spread of the virus. In a press briefing, Trump said: “[M]y administration is recommending that all Americans, including the young and healthy, work to engage in schooling from home when possible. Avoid gathering in groups of more than 10 people. Avoid discretionary travel. And avoid eating and drinking at bars, restaurants, and public food courts.”", "The guidelines also encouraged the elderly, people with underlying health conditions and individuals who feel sick, or anyone in a household with someone who tested positive for COVID-19, to stay home.", "On March 29, Trump announced that the task force was extending its guidelines for an additional 30 days.", "In a statement to FactCheck.org, Mike Gwin, a Biden spokesman, said: “Starting in January, Vice President Biden repeatedly called on Donald Trump to take the threat of the coronavirus seriously, and to listen to the advice of scientists and experts in making necessary preparations and combatting its spread. Trump ignored Biden’s warnings, and failed to take quick action — and he refused to listen to public health experts in the administration who pushed for social distancing measures almost a month before they were actually taken. America has paid an unimaginable price because of Trump’s failure to act quickly, with 100,000 dead and the highest unemployment since the Great Depression.”", "At the very end of the radio interview, in response to a comment Charlamagne tha God, one of the show’s hosts, made about wanting more for the black community, Biden said: “I have a record that is second to none. The NAACP’s endorsed me every time I’ve run. I mean, come on, take a look at the record.”", "But that’s false.", "In a statement refuting Biden’s claim, Derrick Johnson, president and CEO of the 100-plus-year-old civil rights organization, said: “Yesterday, former Vice President Joe Biden made a comment about the NAACP’s endorsement. We want to clarify that the NAACP is a non-partisan organization and does not endorse candidates for political office at any level. Persons affiliated with the NAACP at the national, state, and local levels are free to make candidate endorsements in a personal capacity, but they do not reflect support by the NAACP as an organization.”", "The NAACP made its policy of not endorsing candidates known back in 2016, too.", "Earlier in the radio interview, Biden said, “I wrote an article back, I think, the 27th of January said this pandemic’s here. We should act.”", "It’s true that Biden’s opinion piece, which was published that day by USA Today, said the coronavirus outbreak would “get worse before it gets better,” and that there “will likely be more” than just the confirmed cases the U.S. and a few other countries had reported at the time.", "But Biden didn’t write that the new virus had already reached pandemic status. Instead, he argued that Trump was not prepared to lead the country through what he called a “global health challenge.”", "In fact, the first line of the op-ed said, “The possibility of a pandemic is a challenge Donald Trump is unqualified to handle as president.” We added emphasis on the word “possibility.”", "The World Health Organization declared the outbreak a Public Health Emergency of International Concern on Jan. 30, and officially labeled it a pandemic on March 11.", "Biden also told the radio show’s listeners, “I’m the guy that said we ought to take hard records and find out exactly how many people in the black community are getting COVID and are dying from it.”", "But to support his claim, the Biden campaign directed us to an April 9 statement showing that Biden was following what other Democrats had already asked the Department of Health and Human Services to do. He wasn’t taking the lead.", "In the post on the Medium, a publishing platform, Biden said, in part: “This pandemic has shown us the importance of leading with science and following the data — but we can’t follow the data if we don’t have it. That’s why I join my Democratic colleagues Senator [Elizabeth] Warren, Congresswoman [Ayanna] Pressley, Senator [Kamala] Harris, Senator [Cory] Booker, Congresswoman [Robin] Kelly, and others in calling on the CDC and other agencies to release more data about how COVID-19 is hurting our communities. Not just data on age, but also on income and race, so we can focus resources on where help is needed first and fastest.”", "Those Democratic lawmakers had already sent a March 27 letter to Health and Human Services Secretary Alex Azar, asking HHS and its agencies to pay close attention to racial disparities in the U.S. response to COVID-19.", "“During this unprecedented global pandemic, affordable and equitable access to care and treatment is essential to saving lives and slowing the spread of the coronavirus,” the letter reads. “It is critical that the federal government make a concerted effort to account for existing racial disparities in health care access and how persistent inequities may exacerbate these disparities in the weeks and months to come as our nation responds to this global health pandemic. We urge HHS to work with states, localities, and private labs to better collect data on health disparities as we continue to respond to this pandemic.”", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]