["About this rating", "During a Groundhog Day ceremony in 2014, New York Mayor Bill de Blasio accidentally dropped a groundhog. A few days later, that groundhog passed away.", "However, a spokesperson for the Staten Island Zoo said that the de Blasio incident and the groundhog's death were unrelated.", "It's Groundhog Day... again... and social media was full of claims... again... that New York Mayor Bill de Blasio once \"murdered\" a groundhog.", "These messages are referencing a genuine incident that took place in 2014 when de Blasio took part in the annual Groundhog Day ceremony. De Blasio was holding a groundhog named \"Charlotte\" — the ceremony traditionally featured a groundhog named \"Staten Island Chuck\" but Chuck was replaced after biting former Mayor Michael Bloomberg in 2009 — when the presumably prognosticating rodent squirmed out of his grasp and fell to the ground.", "Here's a video of the incident:", "The groundhog would be found dead in its cage a few days later.", "There are a few reasons why many people believe that de Blasio was responsible for the groundhog's death. For starters, the mayor of New York is relatively tall at 6 feet, 5 inches. In fact, when the New York Post reported on Charlotte's fall they quoted a 14-year-old onlooker saying: “Next year they’ll need a net ... Look how tall he is. Can you imagine falling from that height?”", "Some were also suspicious of Charlotte's death because the Staten Island Zoo did not make the news public until September 2014, more than seven months after the incident. Concerns of a Groundhog Day murder cover-up were heightened when it was revealed that a necropsy had been performed on the animal that indicated it had died from internal injuries.", "The evidence may seem damning, but a spokesperson for the zoo said that de Blasio was not to blame for the groundhog's death.", "Zoo spokesman Brian Morris told The Guardian that Charlotte was given a medical exam after she was dropped on Groundhog Day and that the checkup did not reveal any \"evidence of trauma or pain.\" In the days after the incident, Charlotte participated in several other events and did not appear to be injured.", "Morris said it wasn't clear what caused Charlotte's death, but that the injury likely occurred the night before she died:", "\"We don’t know how the animal suffered the injuries but we don’t think it was from the (Groundhog Day) fall. We believe it happened sometime the night before she was found dead.\"", "Morris also tried to dispel rumors of a political cover-up, saying that the mayor's office was not notified about the groundhog's death at the time because \"there was no reason to do it.\" Morris also clarified that the zoo frequently uses stand-ins for \"Staten Island Chuck,\" picking \"whichever groundhog is the least grouchy that day\" to participate in the ceremony.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]