["A national newspaper said there were 11 million stunted kids in Nigeria, a problem that would hold back the country’s growth.", "Different data sources produce different estimates of stunting, from 9.95 million to 13.9 million kids.", "A 2018 global report estimated Nigeria had the second highest number of stunted kids in the world, after India.", "Nigeria’s economy, one of the two largest in Africa, will struggle to grow if the country didn’t first improve healthcare, a national newspaper has argued.", "In a February 2019 ThisDay article headlined “Setting healthcare agenda for Nigeria”, writer Martins Ifijeh said countries such as the US owed their consistent growth to having beaten chronic malnutrition – “otherwise known as stunting” – in children under five years.", "This success meant children were able to grow to their full potential and contribute to economic growth.", "But this wasn’t the case in Nigeria, Africa’s most populous country and one of its two largest economies.", "“Sadly in Africa, Nigeria, which prides itself as the giant of the continent, has the highest burden of the condition with over 11 million children said to be stunted,” Ifijeh wrote.", "Has a lack of food stunted the development of 11 million children in Nigeria?", "Ifijeh told Africa Check he got the 11 million figure from Dr Annefrida Kisesa, a specialist with the United Nations International Children’s Emergency Fund (Unicef), at a media event in Kano state.", "Kisesa in turn told us the number could be verified by a 2018 Unicef report on global nutrition.", "But, she said, the number of stunted children given in the newspaper “is different from the one in my statement because of the different population figures used”.", "Nigeria’s population numbers have been the subject of controversy for decades.", "The World Health Organization describes stunting as the impaired growth and development of children as a result of poor nutrition, repeated infection, and not enough psychosocial stimulation.", "Children are said to be stunted if their height is lower than would be statistically expected for their age. This is often a sign that they will not develop to their full potential physically and mentally, the UN health agency says.", "Poor feeding, genetics and diseases were some of the reasons for stunting in children, said Prof Adebayo Onajole, a public health physician and epidemiologist at the Lagos University Teaching Hospital.", "In Nigeria, poor nutrition was the most common reason, Onajole told Africa Check.", "The National Nutrition and Health Survey was the best source of data to verify the claim, Prof Tanimola Akande, a public health physician at the University of Ilorin Teaching Hospital, told Africa Check.", "The most recent survey, released in June 2018, looked at 18,781 children aged under five. It was conducted from February to June 2018 by the National Bureau of Statistics and the ministry of health together with USAid, UKAid and Unicef.", "Nigeria’s latest Multiple Indicator Cluster Survey (MICS), released in October 2017, also has information on the health of children.", "Said Akande: “The reasons why I chose the national nutrition survey over the MICS is because it focuses on nutrition whereas MICS focuses on several health issues. Secondly, the nutrition survey was compiled by nutritionists who are experts in their field. It is also more recent than the MICS.”", "The 2018 nutrition survey found the national stunting prevalence for children aged under five years was 32% (or a range of between 30.7% and 33.4%).", "Nigeria’s most recent official population estimate for this age group is 31.1 million, in 2016. This would mean 9.95 million children were stunted (32/100 x 31.1 million = 9.95 million).", "Dr Isiaka Olarewaju is a director of statistics at Nigeria’s official data agency. He told Africa Check that multiplying the share of stunted children by the estimated population in that age group for that year would be the best way to work out the number of stunted kids.", "But there has been no population estimate since 2016.", "The nutrition survey is done annually. The 2015 edition estimated the stunting prevalence in children under five was 32.9%. Using a population estimate of 30.14 million children, this works out to about 10 million affected kids.", "The survey was not done in 2016.", "Stunting had dropped in some parts of the country, such as the south west, but was still a major issue in rural areas, the Lagos University Teaching Hospital’s Onajole said.", "“In places where famine, war, displacement and food taboos exist, stunting is likely to be high.” But reducing stunting wasn’t only the responsibility of the government, he said.", "“Ensuring a child has a balanced diet is the responsibility of parents. Families should consume nutrient-rich foods within their area.” Onajole added that nutritious food didn’t have to be expensive.", "Stunting: How does Nigeria compare internationally?", "Some 13.9 million Nigerian children aged under five are estimated to be stunted, according to the 2018 Global Nutrition Report by Unicef, the WHO, the Bill and Melinda Gates Foundation and others. (Disclosure: The foundation is one of Africa Check’s funding partners.)", "How was this calculated?", "Jordan Beecher, the lead data analyst on the report, told Africa Check the data was from the Joint Child Malnutrition Estimates Expanded Database run by Unicef, the WHO, the World Bank and other agencies.", "The database’s 2017 figures for Nigeria were from  the country’s 2016/17 Multiple Indicator Cluster Survey, Beecher said.", "WHO nutrition analyst Fabienne Borghi also told Africa Check Nigeria’s  stunting figures were from the 2016/17 MCIS. This gave the prevalence in Nigeria as 43.6%.", "“As the under five years old population estimate from the 2017 World Population Prospects edition is 31,802,000 Nigerian children, you get the number of children affected by stunting is approximately 13.9 million (43.6/100 x 31,802,000).”", "India (46.6 million), Nigeria and Pakistan (10.7 million) ranked as the top three of the 194 countries covered in the report.", "A national newspaper said Nigeria’s economy would not grow if the country didn’t overcome the problem of stunted development in children under five.", "It claimed there were 11 million stunted children in Nigeria – nearly the most in the world.", "Different data sources produce different estimates of stunting, from 9.95 million to 13.9 million kids. They all struggle with uncertain population data in Nigeria, which last held a census in 2006.", "While the number of affected children can’t be precisely determined, stunting is a profound problem that could indeed hold back Nigeria’s development.", "Please complete this form to receive the HTML sharing code.", "In this guide, we’ve taken it back to basics to explain how to identify images and videos where not everything is as it appears to be.", "This step-by-step guide explains how to do a reverse image search to check whether the photo you saw on social media is the real thing.", "Zombie claims don’t bite, but they’re annoying. Do your part to stop them resurrecting by following our tips for spotting recycled hoaxes.", "With movement restrictions in place due to Covid-19, unverified information still found a way of travelling, whether among family, colleague...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]