["A widely-shared video allegedly shows an unconventional voting process in the Democratic Republic of Congo, including scenes of voters dropping ballots into large plastic bags. But AFP can confirm that the voting depicted in the video was actually a symbolic 'protest vote' in areas where the December 30, 2018, presidential election had been postponed due to security fears and an outbreak of Ebola.", "The video was shared multiple times, for instance in this Facebook group with over 170,000 followers. The caption of the January 4, 2019 post read: “Free and Fair election in DRC”", "On Twitter, this account with more than 600,000 followers tweeted the same video and captioned it: \"Which country votes this style in Africa?\"", "In the video, a man wearing a blue jacket marked with the words ‘Electoral Agent CENI’ is seen carrying a large plastic bag which people are casting ballots into while another man is seen with a paper sticker on the back of his shirt with the words 'CENI-Butembo' written on it.", "On December 26, 2018, DR Congo's electoral body (CENI) announced that the elections had been postponed in three areas due to insecurity and an Ebola outbreak. The areas are Beni and Butembo in the eastern part of Congo and Yumbi located in the west.", "CENI rescheduled voting in the areas, estimated to have more than a million people, to March 2019. This move was met with a lot of opposition prompting residents in these areas to hold 'protest votes'.", "AFP journalist Alexis Huguet, who covered DR Congo's elections, reported on the mock voting conducted after the cancellation by CENI.", "Huguet confirmed that some areas used sacks or old ballot boxes from previous elections.", "Videos of the 'protest vote'  captured by AFP showed citizens casting their votes in ballot boxes used during the 2011 elections.", "The ‘protest vote’ was not an official election and the ballots cast will not be counted.", "The results of DR Congo’s presidential election were released on January 9, 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]