["About this rating", "As speculation heated up in late 2017 that President Donald Trump was going to fire special counsel Robert Mueller from his position leading the investigation into Russian interference in the 2016 United States elections, Internet users started sharing memes claiming to compare the men's integrity. For instance, an image purportedly showing Robert Mueller serving in the Vietnam War (left) was frequently shared next to photographs of Donald Trump (right), who received multiple deferments exempting him from the draft:", "The image of President Trump is real. According to Business Insider, it was taken from the New York Military Academy's 1964 yearbook and showed Trump with (not pictured) \"his fellow intramural bowling team staffers.\" The photograph purportedly showing Mueller, however, doesn't actually show the former FBI Director during the war.", "Robert Mueller truly did serve in the Vietnam War, where his distinguished service as a Marine earned a Bronze Star, the Purple Heart and other decorations. A 2001 profile from Time Magazine reported that Mueller joined the Marines in 1968 and served as the Commander of a rifle platoon of the 3rd Marine Division:\nIn 1968, while others of his generation were attempting to avoid the draft, Mueller enlisted in the Marine Corps. After officer candidate school, Army Ranger School and Army jump school, he shipped out to Vietnam, where he commanded a rifle platoon. Toward the end of his tour he became aide-de-camp to the commanding general of the Third Marine Division. He was awarded the Bronze Star, the Purple Heart, two Navy Commendation Medals and the Vietnamese Cross of Gallantry.\nMilitary.com provided some more information about Mueller's service:\nWhat was even stranger — he didn't curse, at least in front of them — and that was decidedly uncommon for a Marine. They also said that he was \"solid,\" and knew how to listen. And they also liked that he was a \"Mustang\" — he had enlisted out of Princeton and gone through Parris Island boot camp just like them, and then through Officer Candidate School.\nMueller would earn the Bronze Star, the Purple Heart and the Vietnamese Cross of Gallantry in his time in Vietnam. The citation for his Bronze Star said that during an attack on his rifle platoon, \"2nd Lt. Mueller fearlessly moved from one position to another, directing the accurate counterfire of his men and shouting words of encouragement to them.\"\nDuring the firefight on Dec. 11, 1968, Mueller \"personally led a fire team across the fire-swept terrain to recover a mortally wounded Marine who had fallen in a position forward of the friendly lines,\" the citation said.\nMueller certainly served in the Vietnam War. However, he is not the man featured in this photograph. This image actually shows Ed Episcopo, a Vietnam veteran who served in the 25th Infantry Division. The photograph was included in a Flickr album documenting Episcopo's time in Vietnam. All of the photographs were taken on a \"$12 Kodak Instamatic cartridge camera,\" in his words, before being scanned and processed with modern software:\n\nEpiscopo confirmed to us that he was the soldier in the photograph:\nYes, the soldier in the photo is me. I was 19 years old and I was serving with the 25th Infantry Division in Vietnam. I had just returned from a night ambush patrol. I probably just handed my $12 Instamatic film camera to a squad member to take the photo. My family was always asking me to send photos.\nObservant viewers may had already determined that the man in the photograph was not Mueller by noting the rank insignia on his uniform. The pictured soldier has a single chevron and rocker on his left sleeve, indicating the Army rank of private first class (PFC). Mueller, on the other hand, was a commissioned Marine officer who served as second lieutenant leading a rifle platoon. Although we have not been able to find any pictures of Mueller during his time in Vietnam, he was likely wearing a single bar on his collar.", "Robert Mueller truly did serve in the Vietnam War, where his distinguished service as a Marine earned a Bronze Star, the Purple Heart and other decorations. A 2001 profile from Time Magazine reported that Mueller joined the Marines in 1968 and served as the Commander of a rifle platoon of the 3rd Marine Division:", "In 1968, while others of his generation were attempting to avoid the draft, Mueller enlisted in the Marine Corps. After officer candidate school, Army Ranger School and Army jump school, he shipped out to Vietnam, where he commanded a rifle platoon. Toward the end of his tour he became aide-de-camp to the commanding general of the Third Marine Division. He was awarded the Bronze Star, the Purple Heart, two Navy Commendation Medals and the Vietnamese Cross of Gallantry.", "Military.com provided some more information about Mueller's service:", "What was even stranger — he didn't curse, at least in front of them — and that was decidedly uncommon for a Marine. They also said that he was \"solid,\" and knew how to listen. And they also liked that he was a \"Mustang\" — he had enlisted out of Princeton and gone through Parris Island boot camp just like them, and then through Officer Candidate School.", "Mueller would earn the Bronze Star, the Purple Heart and the Vietnamese Cross of Gallantry in his time in Vietnam. The citation for his Bronze Star said that during an attack on his rifle platoon, \"2nd Lt. Mueller fearlessly moved from one position to another, directing the accurate counterfire of his men and shouting words of encouragement to them.\"", "During the firefight on Dec. 11, 1968, Mueller \"personally led a fire team across the fire-swept terrain to recover a mortally wounded Marine who had fallen in a position forward of the friendly lines,\" the citation said.", "Mueller certainly served in the Vietnam War. However, he is not the man featured in this photograph. This image actually shows Ed Episcopo, a Vietnam veteran who served in the 25th Infantry Division. The photograph was included in a Flickr album documenting Episcopo's time in Vietnam. All of the photographs were taken on a \"$12 Kodak Instamatic cartridge camera,\" in his words, before being scanned and processed with modern software:", "Episcopo confirmed to us that he was the soldier in the photograph:", "Yes, the soldier in the photo is me. I was 19 years old and I was serving with the 25th Infantry Division in Vietnam. I had just returned from a night ambush patrol. I probably just handed my $12 Instamatic film camera to a squad member to take the photo. My family was always asking me to send photos.", "Observant viewers may had already determined that the man in the photograph was not Mueller by noting the rank insignia on his uniform. The pictured soldier has a single chevron and rocker on his left sleeve, indicating the Army rank of private first class (PFC). Mueller, on the other hand, was a commissioned Marine officer who served as second lieutenant leading a rifle platoon. Although we have not been able to find any pictures of Mueller during his time in Vietnam, he was likely wearing a single bar on his collar.", "Sisk, Richard.   \"A 'Magnificent Bastard' Is Investigating Russian Meddling in the US.\"\r\n    Military.com.   21 May 2017.", "Perez, Maria.   \"Will Trump Fire Mueller? Senate Democrats Aim to Stop Another 'Saturday Night Massacre.'\"\r\n    Newsweek.   2 December 2017.", "Smith, Allan.   \"Here Are 8 Photos of Donald Trump in High School.\"\r\n    Business Insider.   3 March 2016.", "Shannon, Elaine.   \"Robert Mueller: Straight Shooter with a Moving Target.\"\r\n    TIME.   6 July 2001.", "Updated [17 December 2017]: Added statement from photographer and information about military ranks.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]