["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While Donald Trump vows to build a wall between the United States and Mexico to keep undocumented immigrants out, he says Hillary Clinton has the opposite approach.", "\"She’s pledged to grant mass amnesty, and in her first 100 days, end virtually all immigration enforcement and thus create totally open borders for the United States, totally open borders,\" Trump said in a June 22 speech.", "Claiming that Clinton would create \"totally open borders\" is a serious charge that suggests allowing people to travel freely or with very few restrictions between two countries.", "That’s not what Clinton has proposed. Clinton has supported legislation that includes a path to citizenship (with conditions) and included heightened border security. As a candidate, she says she will focus on deportations of criminals.", "However, some experts argue that \"open borders\" doesn't necessarily mean no enforcement at all but making it far easier for undocumented immigrants to stay here. Clinton does want to make it easier for many undocumented immigrants, but that’s not the same as getting rid of enforcement.", "We emailed a Trump spokeswoman twice and did not hear back.", "Clinton’s immigration platform", "So if Clinton hasn’t called for \"open borders,\" what does she want to do on immigration?", "During this campaign, she has called for addressing immigration laws including a path to citizenship within her first 100 days. But she has also called for protecting borders and deporting criminals or those who pose threats.", "\"We need to secure our borders, I’m for it, I voted for it, I believe in it, and we also need to deal with the families, the workers who are here, who have made contributions, and their children,\" she said in November. \"We can do more to secure our border and we should do more to deal with the 11 or 12 million people who are here, get them out of the shadows.\"", "This is pretty consistent with her view as a senator and secretary of state.", "As a senator, Clinton supported changing immigration laws, including supporting immigration bills in 2004, 2006 and 2007, and she co-sponsored the Dream Act, an effort to help young people who emigrated illegally as children avoid deportation.", "In her 2014 book Hard Choices, Clinton praised the 2013 immigration bill, which included billions for border enforcement over a decade for new surveillance equipment and fencing along the Mexican border, as well as adding 20,000 border agents.", "Clinton’s immigration platform does not amount to open borders, said Alex Nowrasteh, an immigration expert at the libertarian Cato Institute.", "Open borders existed before 1875, when there were no federal restrictions on emigrating to the country, he said. The United States had immigration restrictions from 1875 to 1924 without a border patrol, which was created in 1924.", "\"Trump may be conflating the term ‘open borders’ with anything less than perfect enforcement of our immigration laws -- which would be a serious rhetorical error on his part,\" Nowrasteh said. \"Trump can’t claim Clinton is for open borders while she has also supported massive increases in border security to better enforce our restrictive immigration laws.\"", "Clinton has said she wants to limit deportations to violent criminals, not deport children and end raids and round-ups and go further than Obama for DREAMers and their parents if legally possible. That greatly expands who could avoid deportation in a Clinton White House.", "Those policies amount to less enforcement to supporters of reduced immigration, including Mark Krikorian, executive director of the Center for Immigration Studies, and Roy Beck, executive director of NumbersUSA.", "\"This really is a breathtaking step toward open borders,\" Krikorian told the Washington Post after the March 9 Miami debate. \"If you take that step, it needs to be put in front of the public: Do you think immigration laws are irrelevant unless the illegal immigrant has committed a violent offense or drug crime?\"", "Beck said the term \"open borders\" is imprecise. However, if undocumented immigrants can \"stay as long as you don’t commit a violent crime, that is pretty close to open borders. You don’t have to give amnesty -- you can just not have a threat of deportation and it allows people to stay.\"", "Clinton’s aim to reform immigration laws and focus on deporting criminals is not the same as ending enforcement and creating open borders, said David Leopold, past president of the American Immigration Lawyers Association. Trump also fails to acknowledge that Clinton has supported legislation with border patrol measures.", "\"Proposing immigration legislation is a far cry from mass amnesty, and it’s generally accepted that any immigration reform proposal will include background checks, an English requirement, back taxes and fines,\" he said.", "Our ruling", "Trump said Clinton’s immigration platform would \"create totally open borders.\"", "This is a huge distortion of Clinton’s proposals.", "Clinton has praised work already done to secure the border, and she said she supported a 2013 bill that would have invested billions more in border security while creating a path to citizenship for some undocumented immigrants. Her plan calls for protecting the border and targeting deportation to criminals and security threats. Her plan would make it easier for many undocumented immigrants to avoid deportation, but that’s not the same as ending all enforcement.", "We rate this claim False.", "Hillary Clinton campaign website, Immigration reform, Accessed June 22, 2016", "Politico, \"Full transcript: Donald Trump NYC speech on stakes of the election,\" June 22, 2016", "MSNBC/Telemundo, Transcript of Clinton-Sanders Town Hall, Feb. 18, 2016", "Washington Post/Univision, Transcript of Miami debate annotated, March 9, 2016", "Los Angeles Times, \"Clinton slams Trump's immigration plans, nudges Sanders to exit race in L.A. stops,\" May 5, 2016", "Latino USA, \"Clinton: you have to control your borders,\" Nov. 9, 2016", "Associated Press, \"Clinton pushes immigration overhaul to campaign forefront,\" May 6, 2016", "Washington Post, \"Clinton’s stance on immigration is a major break from Obama,\" March 10, 2016", "Washington Post, \"What did Hillary really propose on immigration?\" May 6, 2016", "Breitbart, \"Hillary Clinton releases plan to dissolve border within 100 days,\" May 25, 2016", "Huffington Post, \"Hillary Clinton Pledges To Take On Immigration Reform In First 100 Days,\" Feb. 19, 2016", "Factcheck.org, \"Trump’s attack on Clinton’s character,\" June 22, 2016", "PolitiFact, \"Clinton reaches too far on immigration claim,\" April 24, 2016", "PolitiFact Florida, \"Bernie Sanders says that Hillary Clinton opposed driver's licenses for illegal immigrants,\" March 9, 2016", "PolitiFact, \"Rand Paul said that Marco Rubio is for an 'open border,'\" Dec. 15, 2015", "Interview, Mark Krikorian, executive director of the Center for Immigration Studies, June 22, 2016", "Interview, Roy Beck, executive director of NumbersUSA, June 22, 2016", "Interview, Alex Nowrasteh, immigration policy analyst at the Cato Institute, June 22, 2016", "Interview, Frank Sharry, founder and executive director of America’s Voice, June 22, 2016", "Interview, David Leopold, founder and principal of David Wolfe Leopold & Associates and past president and general counsel for American Immigration Lawyers Association, June 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]