["New Mexico Gov. Michelle Lujan Grisham gives her State of the State address during the opening of the New Mexico legislative session in the House chambers at the state Capitol in Santa Fe, N.M. on Tuesday, Jan. 21, 2020. (AP)", "An inaccurate Facebook post goes after New Mexico Gov. Michelle Lujan Grisham over her support of a law that attempts to keep guns away from people who might be dangerous.", "\"In a move some would call ‘stunningly ironic’ Michelle Lujan Grisham (D) has had the firearms of her guards and household seized,\" says a Feb. 9 Facebook post by the Farmington Tribune. \"This comes only days after pushing her party's ‘red flag’ law through the Senate.\"", "We don’t call this statement ironic. We call it false.", "There is no evidence that guns were seized from Lujan Grisham’s home. And the state police officers who protect her remain armed, her spokesman Tripp Stelnicki told PolitiFact.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Farmington Tribune Facebook page doesn’t shed much light on its intentions. Some news reports have characterized the Facebook page as satire, but nothing on the site states that.", "This false story was inspired by Lujan Grisham’s support of the proposed Extreme Risk Firearm Protection Order Act that passed the state Senate on Feb. 7. It passed the House on Feb. 13. Lujan Grisham, who applauded its passage, is expected to sign the bill.", "About 17 states have similar \"red flag\" or extreme risk laws. The laws allow police to petition a court to order the temporary removal of firearms from a person who may be dangerous, or to block the person from obtaining a firearm. After a set amount of time, the firearm is either returned to the person or the court order is extended.", "RELATED: How Florida’s red flag gun law works", "There is no evidence that guns were seized from Lujan Grisham’s home or from her security detail after passage of the law. We rate this statement False.", "Farmington Tribune, NEW MEXICO RED FLAG GUN LAWS BACKFIRE, LEAVING GOVERNOR IN JAM, Feb. 9, 2020", "Gov. Lujan Grisham, Extreme-risk protection order legislation clears Senate, Feb. 7, 2020", "AP, New Mexico Senate endorses red-flag gun bill, Feb. 7, 2020", "The Santa Fe New Mexican, Revised 'red flag' legislation passes Senate, Feb. 8, 2020", "The Santa Fe New Mexican, Lawmaker: Nothing ‘inappropriate’ at Lujan Grisham meeting, Dec. 27, 2019", "Giffords, MEMO: Extreme Risk Laws and Their Role in Reducing Gun Violence, Aug. 5, 2019", "The Journal, Satirical website ‘The Farmington Tribune’ digs at Four Corners issues, Oct. 5, 2018", "Email interview, Tripp Stelnicki, Gov. Michelle Lujan Grisham spokesman, Feb. 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]