["About this rating", "In March 2015, rumors appeared on social media that dog treat brand Canine Carry Outs (commonly misspelled as \"Canine Carryouts\") contains anti-freeze under the \"hidden\" ingredient name of propylene glycol and is therefore dangerous to feed to dogs. Similar rumors had circulated online about Canine Carry Outs before the claim migrated to Facebook in 2015 (as well as earlier Facebook version did not circulate as widely):", "The Canine Carry Outs warning closely resembled a similar rumor about Purina's Beneful brand pet food, which circulated in early 2015 as well. Although Beneful wasn't mentioned in the Facebook warning shown above, it's possible that the rumor also stemmed from earlier alerts that mentioned other brands of dog foods in conjunction with propylene glycol.", "It's not accurate to suggest that propylene glycol is a \"hidden\" ingredient in pet treats, is the same thing as \"anti-freeze,\" and is inherently dangerous to dogs in any amount. As the Agency for Toxic Substances and Disease Registry (ATSDR) explains, propylene glycol is a common food additive that is classified as \"generally recognized as safe\" when consumed within recommended limits:", "The Food and Drug Administration (FDA) has classified propylene glycol as an additive that is \"generally recognized as safe\" for use in food. It is used to absorb extra water and maintain moisture in certain medicines, cosmetics, or food products. It is a solvent for food colors and flavors, and in the paint and plastics industries. Propylene glycol is also used to create artificial smoke or fog used in fire-fighting training and in theatrical productions. Other names for propylene glycol are 1,2-dihydroxypropane, 1,2-propanediol, methyl glycol, and trimethyl glycol.", "Although propylene glycol is not approved for use in cat food, it is classed as generally recognized as safe for dogs in addition to humans and is not \"anti-freeze,\" as Purina noted in response to questions about its use in pet food:", "Propylene glycol is quite different from ethylene glycol, the anti-freeze used in automobiles.", "Propylene glycol is approved as a food additive in human food and in feed for animals, except cats, in the U.S. and Canada.", "Ethylene glycol — not propylene glycol — is the active compound in most automobile radiator anti-freeze solutions, and is toxic to animals and humans when ingested. Propylene glycol has a different molecular structure, giving it different properties and allowing it to be used safely in animal feed, except for cats, as well as in human foods, such as cake mixes, salad dressings, soft drinks, popcorn, food coloring, fat-free ice cream and sour cream.", "Propylene glycol can be used as a non-toxic anti-freeze, just as salt can be used as an \"anti-freeze.\" The differences in the molecular make-up of propylene glycol and ethylene glycol have significantly different impacts on health and safety for humans and pets. Propylene glycol is approved for use by the Food and Drug Administration (FDA).", "A similar rumor was spread in 2016 by Dr. Chloe Charlton, a veterinarian in Little Rock, Arkansas, who claimed that one of her canine patients had been \"poisoned\" by Canine Carry Outs, that \"a report to the FDA has come back conclusive,\" and that the FDA had \"recommended removal of these treats\".", "When the Petful website attempted to question Dr. Charlton regarding the many questionable aspects of her claims, she declined to be interviewed.", "In fact, contrary to what Dr. Charlton asserted, the U.S. Food & Drug Administration (FDA) has never issued any warning or recall/withdrawal notice about Canine Carry Outs brand dog treats.", "The Huntsville Item.   \"J. M. Smucker Completes Acquisition of Big Heart Pet Brands.\"\r\n    25 March 2015.", "Baker, Dave.   \"No, These Treats Have Not Been Recalled — Despite the Rumors.\"\r\n    Petful.   4 August 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]