["The one-minute two-second video was shared in this Facebook post on February 17, 2021.", "The post’s Hindi-language caption translates to English as: “The one who thinks can do the impossible. We are the one who make five by adding two and two. The Indian Army destroying China-built bunkers by JCB machines after chasing away 150 Chinese tanks and 5000 Chinese soldiers from Pangong Lake.”", "The video circulated shortly after fresh clashes between Indian and Chinese troops at the contested Himalayan border along Pangong Lake. AFP reported on the clashes here on January 26, 2021. The lake runs across the contested territories of both India and China in the region of Ladakh.", "On February 21, 2021, India announced that both forces had withdrawn from the disputed area, as reported by AFP here.", "The video was also shared here, here, here and here on Facebook alongside an identical claim.", "The claim is false.", "A reverse image search by keyframes of the video obtained using digital verification tool InVID-WeVerify found the same video was tweeted by the Indo-Tibetan Border Police (ITBP) here on February 15, 2021.", "ITBP personnel with other sister organizations looking for missing at Raini, #Tapovan, #Uttarakhand today. #UttarakhandGlacierBurst pic.twitter.com/GB7aMiCucy", "“ITBP personnel with other sister organizations looking for missing at Raini, #Tapovan, #Uttarakhand today. #UttarakhandGlacierBurst,” reads the tweet.", "ITBP is India's border patrol organisation, primarily deployed along the mountainous border with China.", "Tapovan is a remote Himalayan valley in Chamoli district of Uttarakhand state. On February 7, 2021, a deadly flash flood left scores missing and destroyed bridges, roads and two hydroelectric power plants, AFP reported here.", "Indian news agency ANI also published a video report using the same footage here on YouTube on February 15, 2021.", "ITBP also tweeted four photos of the rescue operations on the same days here.", "A closer analysis of these photos shows the landscape, machines and soldiers' uniforms corresponds with photos of the glacier disaster taken by AFP.", "Below is an image comparison screenshot of photos tweeted by ITBP (L) and AFP photos (R) with identical elements highlighted in red:", "Local Indian media outlets published similar footage of rescue operations, for example The Indian Express and Hindustan Times.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]