["The photo and claim was shared here on Facebook in 2018 and began recirculating on the platform in July 2020, for example here, here and here with a similar claim.", "The post's Sinhala-language caption translates to English as: “You’ve heard of the mukalan bassa but you haven’t seen it before, right?”", "Mukalan bassa, which literally translates from Sinhala as Jungle Owl, is a reference to a bird endemic to Sri Lanka, known as the Chestnut-backed owlet or the jungle owlet.", "The same photo has also circulated on Twitter, for example here, alongside a similar claim.", "But the claim is false; the image shows a fish that is found only in North and Central America.", "A reverse image search of the image in the misleading posts found this post on discussion forum 9Gag. The post was published on July 6, 2018.", "The user posting the image wrote: “Flat water armadillo???? What the f is this???”", "Other 9gag users suggested the image shows a gutted Alligator gar - one of the largest species of fish found only in North and Central America as seen in the comment below:", "AFP contacted senior Sri Lankan environmentalist and avid bird watcher Jagath Gunawardana on August 10, 2020 by phone to inquire further about photo of the animal in the misleading posts.", "“This is no bird and definitely not an owlet given its size. It's a fish species named the Alligator Gar, which can be identified by the long snout. Its appearance in the picture is due to being gutted,” he told AFP during the conversation.", "The Alligator Gar is sometimes known as a \"living fossil\" by scientists as it can be traced back 100 million years.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]