["“Tired of mask idiocy and social distancing? TAKE THE SHOT and get your life back again!” reads the false post, which includes a Merck logo on the lower left corner and “www.taketheshot.gov” on the lower right, which is not a working web address.", "The post also includes a graphic of a doctor holding a syringe, which is available as clip art online.", "Facebook posts with the fake ad have been circulating since at least July 3, 2020. More US examples are available here and here, and Canadian examples are here and here. The post was also shared by anti-vaccine proponent Robert F Kennedy, Jr to his more than half a million Instagram followers, although the lawyer noted he is “pretty sure it’s a fake billboard.”", "A Merck spokesman told AFP by email that the billboard is not a legitimate company advertisement.", "Using a reverse Google image search, AFP found a blank version of the same billboard featured in a Detroit Free Press article, credited to “Sriphongngam, Getty Images/iStockphoto.”", "A keyword search with the photographer’s name plus “Getty” yields the original iStock photo on Getty’s website.", "An iStock customer service representative confirmed via email that the photo was taken in Bangkok, Thailand, on October 31, 2015 and submitted to iStock on November 20, 2015, more than four years before the novel coronavirus was discovered.", "A vaccine is not yet available for COVID-19, the disease caused by the novel coronavirus, which has killed more than 135,000 people in the US and 8,800 in Canada. Merck is among the companies working to develop a vaccine.", "AFP Fact Check has debunked more than 560 examples of false and misleading information about the novel coronavirus, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]