["On April 18, Delhi Chief Minister Arvind Kejriwal gave a 10-minute speech on the coronavirus situation in New Delhi. It was also live-streamed on YouTube. At the 2:00 mark, Kejriwal pointed out that some people in coronavirus hotspots area continue to step out on streets and visit their neighbours. He said in Hindi (from 2:00 to 2:44), “Yesterday in a containment zone at Jahangirpuri, 26 members from one community (translated from कुनबा) tested positive for corona… all members are from one family. Their homes were next to each other — thus they went to each other’s homes despite containment.”", "Since then the media has reported —", "1. 26-members from a family were infected in Jahangirpuri, quoting CM Kejriwal [The Free Press Journal, Hindustan Times, The Outlook(IANS syndicated copy) and NDTV]", "2. 31 people tested positive in Jahangirpuri out of which 26 members were from one family [Scroll, The Indian Express and Kalinga TV(IANS syndicated copy)]", "3. 31 members of an extended family tested positive for Covid-19 in Jahangirpuri [India Today (PTI syndicated copy) and ABP News]", "On April 19, The Indian Express reported 60 samples were taken as part of the government’s community testing efforts in Jahangirpuri, a coronavirus hotspot. Out of these, 31 people tested positive, including 26 from the same family.", "As per the report, the source of the infection was a 60-year-old woman who succumbed to coronavirus on April 5. As per the sources in the health department, the 26-member family are relatives of the elderly woman.", "On April 18, North District Magistrate Shinde Deepak Arjun told ANI, “These 31 people, who were tested positive with COVID-19, are either members of the family of an old woman who died after being infected with coronavirus or have visited her.” It is pertinent to note that Arjun did not state that a 26-member family was infected.", "On April 22, The Print published a ground report from Jahangirpuri. The report stated that Ajiman Bibi was the woman who passed away due to coronavirus on April 5. According to the report, the result came four days after her death.", "The scope of this fact-check is limited to —", "1. Verification of the number of members in Ajiman Bibi’s family.", "2. Circumstances that led to Ajiman Bibi’s death.", "Alt News spoke with Ajiman Bibi’s son", "Noor Mohammed’s family had 16 members. This was until 5 pm, April 5 when he lost his 52-year-old mother: “My mother hasn’t been healthy for the past 10 years. But the pain and discomfort she experienced in the days leading up to her death were unlike anything she had had to bear.”", "Alt News has a copy of Ajiman Bibi’s Aadhaar card which states she was born in 1968. Thus, the media had botched-up Ajiman Bibi’s age as well.", "Mohammed, who works as an electrician, informed, “Since March 30, my mother had a fever and trouble breathing. We visited three different hospitals multiple times on April 3 and April 4; none of them bothered to test her for coronavirus.” Mohammed and his family are a resident of ward 21, Jahangirpuri.", "State failure: Why wasn’t Ajiman Bibi tested for coronavirus when she was alive and showed symptoms?", "According to Mohammed, he took his mother for a health check-up to the following hospitals on April 3 and 4 — Babu Jagjivan Ram Memorial Hospital, Dr Baba Saheb Ambedkar Hospital, Rajan Babu TB Hospital and Dr Ram Manohar Lohia Hospital. The Print’s report that carries statements of neighbours corroborates the same.", "Mohammed shared documents which confirm that he visited some of the hospitals mentioned above. The image below shows a form of the Department of Radiodiagnosis at Baba Saheb Ambedkar Hospital on April 3.", "Despite having the symptoms for coronavirus, according to Mohammed, the government hospitals didn’t test his mother when she was alive. On April 5, she passed away at Dr Ram Manohar Lohia Hospital around 5 pm.", "Mohammed was allowed to take his mother’s dead body home after a couple of hours. The next day, Mohammed and 35 others — family members and neighbours — paid respects to Ajiman Bibi at her funeral.", "Alt News spoke with Poonam Ashwini Bagri, Jahangirpuri ward 21 municipal councillor. “On April 9, I received an official document which listed new COVID-19 positive cases — alive and deceased. As per this document, Ajiman Bibi’s coronavirus test report arrived on April 7. So why did Dr Ram Manohar Lohia Hospital allow Mohammed’s family to take Ajiman Bibi’s dead body on April 5? That has severely put my ward at risk.”", "Alt News has a copy of the said document. It is pertinent to note that Block ‘B’ Jahangirpuri was one of the first 22 containment zones in Delhi announced on April 8. Block ‘C’ (Ajiman Bibi’s block) was also added to the list on April 10, once the authorities realised Ajiman Bibi had tested positive.", "On April 10, Noor collected his mother’s reports from Dr RML Hospital which confirmed that she was coronavirus positive. “I can’t help but wonder, why did the hospital allow us to take her home if they were yet to confirm that she had contracted the infection,” questioned Noor.", "How many family members does Noor have?", "Mohammed and his family have been quarantined since April 10 at Delhi Development Authority (DDA) flats in Narela. “My family includes — my father, uncle, five brothers (of which three are married), three women and five children,” he said. This a total of 15 people.", "As of April 27, Mohammed’s family is quarantined in two separate facilities. “Eight of us were shifted in a building where people who have tested negative are quarantined. The remaining seven are in a different building where people who have tested positive are quarantined,” said Noor who has tested negative.", "According to Noor, out of the seven — six have tested positive. “The seventh member, who tested negative, is my sister-in-law’s baby. My sister-in-law tested positive but since the baby needs to be breastfed, she insisted to keep the baby in her custody.” Noor pointed out doctors have not given a hard copy of their test results.", "A Delhi-based journalist (identity concealed at request) shared an image of an excel sheet with Alt News that was provided by a government official. The document lists the names, ages and addresses of 31 people from Jahangirpuri who tested positive. Alt News has attached the image after concealing personal details.", "Noor said, “Since I work as an electrician in the area, I know all 31 people on the list. In fact, I must have visited their house at some point in the past. Out of the 31, 13 are a part of my extended family.” Noor informed that the 13 members from his extended family include his sister and her in-laws. While they stay nearby they aren’t a part of his 15-member immediate family.", "Alt News spoke with three people (identity concealed at request) from the list of 31 patients. Each of them confirmed that the people listed on the document do not belong to one family. They also informed at least one of the names and the addresses has been inaccurately recorded.", "According to Noor, two people from this list attended the funeral on April 6. At that time, none of them was aware that Ajiman Bibi (wrongly spelt in the list as ‘Ajeewan’) was infected with coronavirus.", "Simply put, six members of Noor’s immediate family have tested positive and 13 members of his extended family (sister and her in-laws) have tested positive. Since the hospital hasn’t provided the test reports to Noor, we were unable to independently verify the results. However, it is clear that 26 members of a single-family did not test positive.", "Additionally, municipal councillor Bagri also confirmed that the 31-member list does not include a 26-member family. “I’m not sure why CM Kejriwal felt the need to highlight the 26-member family despite the data collected shows no such family,” she said.", "Delhi CM Kejriwal’s statement that a 26-member family was tested positive for coronavirus in Jahangirpuri was therefore inaccurate. The media was also at fault for not verifying the data and instead, sensationalising that a 26-member family tested positive. Kejriwal blamed the family for not adhering to lockdown guidelines. The media failed to report that Noor took his mother, Ajiman Bibi, to multiple hospitals and despite showing symptoms she was neither admitted nor tested until it was too late. Dr RML Hospital allowed the family to take Ajiman Bibi’s dead body home without first confirming if she had the infection. The family held a funeral which was attended by several people. Inaccurate media reports overlooked the state’s failure and held the family responsible for contracting the infection.", "On April 18, Twitter account @India_Policy, which claims to inform on topics related to public policy and governance, tweeted, “#BREAKING : 26 members of a single family found #COVID19 positive in Jahangirpuri area of Delhi, including Husband, his 2 wives, 12 daughters, 7 sons and more…”(archive link)", "@India_Policy has over one lakh followers and its post was retweeted by 3,500 people. BJP Delhi spokesperson Tajinder Pal Singh Bagga quote-tweeted the tweet drawing 2,000 retweets (archive link). Alt News has debunked several instances in the past when Bagga promoted misinformation.", "Right-wing outlet The Frustrated Indian published an article which cited the tweet by @India_Policy. The article said, “Not only does this development serve as a clarion call for the government to bring in legislation on the lines of a population control bill, but it is all the more reason as to why a Uniform Civil Code is the need of the hour. How can anyone have 19 children, even if from different wives?” (archive link)", "Alt News also found that there is a WhatsApp image being circulated based on @India_Policy’s tweet.", "Just like the media reports, social media latched on “26-member family” to target the Muslim community. Noor confirmed that no one from his family or extended family has engaged in polygamy. BJP Delhi spokesperson Tajinder Pal Singh Bagga retweeted communal misinformation and promoted the stereotype that Muslim families are polygamous and have many children. The rumour was originally shared by @India_Policy, an anonymous Twitter account.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]