["Shortly after Joe Biden and Kamala Harris were sworn in as president and vice president, fans of \"The Simpsons\" took to social media to claim that the show, once again, had predicted a moment before it transpired in reality.", "The series has previously been credited for Super Bowl predictions, a World Cup final, Donald Trump's presidency and Disney owning 21st Century Fox. According to online posts, the show can add to the list \"predicting the outfit the vice president wore at her swearing-in\".", "\"Purple suit? Pearl earrings and necklace?! The Simpsons did it again!!!!!\" reads a Jan. 21 Facebook post with hundreds of shares. \"Predicting the 2020 election results?\" Included in the post are side-by-side images of Lisa Simpson and Harris, both wearing a purple outfit and and a pearl necklace.", "Another user shared a similar version of the meme and wrote, \"At This Point I think The Writers/Creators of this show were Time Travelers!!\"", "USA TODAY reached out to both Facebook users for comment.", "Fact check: Image of 'Simpsons' character doctored to mimic Capitol riot participant", "The image of Lisa Simpson seen in the posts comes from the episode \"Bart to the Future\" that originally aired on March 19, 2000. In the episode, Lisa is president and speaks to her staff about the budget crunch she inherited from President Donald Trump.", "In the episode, Lisa is wearing a purple pantsuit and pearls, similar to the outfit Harris wore on Inauguration Day. However, that is not evidence that the show predicted her outfit.", "Harris took a job at the Alameda County District Attorney's office in 1990, and was not elected to public office until 2003 — three years after that \"Simpsons\" episode aired — when she was elected San Francisco district attorney, according to the Associated Press.", "The \"Bart to the Future\" episode makes no specific mention of Harris' name or her background.", "Fact check: Viral TikTok alters Army Band's music to 'Hit the Road Jack'", "The purple suit Lisa is wearing as president is likely a coincidence, as politicians have historically worn purple to symbolize bipartisanship and women's suffrage, according to Insider.", "American women's suffrage colors of purple, white and yellow stood for loyalty, purity and hope. Some also speculated that Harris' purple outfit was a nod to Shirley Chisholm, the first Black woman elected to Congress, USA TODAY reported.", "Also wearing purple on Jan. 20 was 2016 Democratic presidential nominee and former first lady Hillary Clinton, who told reporters after the swearing-in that she wore purple because she knew \"the theme that President Biden was striking was unity,\" and she wanted to \"send a bit of a symbolic message that we need to come together.\"", "Clinton also wore purple when she gave her concession speech in 2016 to show bipartisanship and said she would have worn white if she had won the election, according to Vogue.", "Harris' Inauguration Day pearls are the symbol of her sorority, Alpha Kappa Alpha, according to the New York Times.", "The first female vice president has worn a pearl necklace on many occasions: when she graduated from Howard, questioned Brett Kavanaugh at his Supreme Court nomination hearing, was sworn into Congress, debated Vice President Mike Pence and when she received her COVID-19 vaccine, The Times reported.", "Fact check: Meme with images of Biden, Trump inaugurations draws false comparison", "This is not the first time social media users have claimed that \"The Simpsons\" predicted the future.", "Snopes has debunked dozens of false claims of predictions from \"The Simpsons\" throughout the years, and notes that there are over 31 seasons and 600 episodes of the show, creating a lot of opportunities for coincidences to appear.", "In an interview with The New York Times in 2018, executive producer Al Jean said, \"The Simpsons\" episodes air a year after they're produced and \"it’s just a sort of frame of mind that we’ve got that we think one year ahead.\" Jean told the Times he predicted people would \"make too much of our great predictions.\"", "The Times reported that a possible factor for the predictions could be a proposed concept by Harvard mathematicians Frederick Mosteller and Persi Diaconis called \"Methods for Studying Coincidences.\" \"The Simpsons\" is the longest running TV scripted series in history and the 1989 paper by the mathematicians states, “With a large enough sample, any outrageous thing is apt to happen.\"", "Stephanie Gillis, another writer for \"The Simpsons,\" told BBC in 2019, \"We are sort of futurologists in that we write 10 months ahead, so we're trying to guess what is going to happen.\"", "USA TODAY has previously debunked the claim that an episode from the show predicted the Capitol riot on Jan. 6.", "Fact check:Attendance at Biden's inauguration was restricted by COVID-19 pandemic", "The claim that \"The Simpsons\" predicted Harris' Inauguration Day outfit years ago is FALSE, based on our research. While the image of Lisa Simpson as president wearing purple is authentic, the episode makes no mention of Harris and many politicians wear purple to symbolize unity. Further, the episode aired three years before Harris was elected to public office and writers for the show have stated that content and predictions are made one year before the episode airs. Similar claims of predictions on \"The Simpsons\" have been debunked.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]