["At a fundraiser event, Joe Biden said people don’t need to own “military-style weapons” including pistols with 9 mm bullets that can hold 10 or more rounds.", "Biden was talking about high-capacity magazines needing to be banned, not the gun itself.", "His gun policies don’t call for outlawing traditional handguns, like pistols.", "The National Rifle Association says Joe Biden wants to ban 9 mm pistols.", "The gun-rights organization makes the claim in a November 2019 story that recently resurfaced online, citing comments he made at a fundraiser.", "But this is misleading. While Biden’s statement did call out guns that use 9 mm ammunition, he was referring to the high-capacity magazines that sometimes come standard, or are added onto, those types of guns. A pistol, according to federal regulations, is a handgun that has its chamber integrated with the barrel.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The NRA article cites a Seattle Times story on two Biden campaign fundraisers in the region. At one point the story says:", "\"While saying he supports the Second Amendment, Biden called the absolutist arguments of some gun-rights supporters 'bizarre.' Noting people can’t own machine guns or bazookas, Biden said, 'Why should we allow people to have military-style weapons including pistols with 9-mm bullets and can hold 10 or more rounds?'\"", "So, does that mean Biden wants to ban those pistols?", "His campaign says no.", "\"Predictably, the NRA is lying about the only candidate in this race who has taken them on and beaten them twice,\" Biden campaign spokesman Andrew Bates told PolitiFact.", "\"His statement here, as he has often said, is about banning high-capacity magazines for use in any type of weapon. The NRA's support for these magazines, despite the carnage that could not have taken place and the innocent lives that would not have been lost without them, is a moral crisis for that organization.\"", "There is no mention of banning any type of traditional handgun on Biden’s presidential campaign website. Among other measures, his gun control policies include: Banning the manufacture and sale of assault weapons and high-capacity magazines and initiating a buyback of these weapons; closing loopholes in the background check system and requiring checks on all gun sales; and ending the online sale of firearms and ammunitions.", "Biden has voted on amendments to ban certain rifles, guns considered assault weapons and semi-automatic weapons. But he has no record of supporting measures that would ban traditional pistols.", "We reached out to the NRA but did not receive a response.", "We rate this False.", "NRA.org, Joe Biden Wants to Ban 9mm Pistols, Nov. 25, 2019", "Seattle Times, Speaking at the ‘House of Amazon,’ Joe Biden gently raises company’s role in middle-class job losses, Nov. 15, 2019", "PolitiFact, Says \"Joe Biden calls for gun ban.\", July 9, 2019", "JoeBiden.com, THE BIDEN PLAN TO END OUR GUN VIOLENCE EPIDEMIC, Accessed March 17, 2020", "Email interview, Andrew Bates rapid response director for Joe Biden’s 2020 presidential campaign, March 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]