["About this rating", "In June 2002, twin infants in Turkey passed away within 24 hours of each other two days after receiving vaccinations", "The infants were diagnosed as having died of SIDS, and reports framing this event as evidence of the harm caused by vaccinations do so by misleadingly omitting any mention of contrary evidence.", "On 1 February 2017, Erin Elizabeth of “Health Nut News” published an article bearing the headline “Infant Twins Die Simultaneously After Vaccines, Medical Board Rules ‘Just a Coincidence’” that implied the simultaneous death of infant twins was caused by childhood vaccinations:", "PubMed reports that identical twin girls, aged 3.5-months and delivered via c-section, were found dead (by their poor momma) in their crib, both laying face up. Not surprisingly, both babies were healthy will no serious medical history. Two days before their death, both of the girls had received their second dose of oral polio, DPT, and their first dose of hepatitis B vaccines. They had a fever the day after the vaccines and were given a teaspoon of acetaminophen.", "All that and yet, “the death scene investigation, judicial investigation, parental assessment, macroscopic and microscopic autopsy findings and the toxicological analysis didn’t yield any specific cause of death.” Because the case was so rare it was referred to a board of multidisciplinary medical professionals at the Institute of Forensic Medicine, in the Ministry of Justice, in Istanbul. And yet, the Board still decided that the data they had was consistent with [Sudden Infant Death Syndrome, SIDS].", "Elizabeth's article was a highly deceptive one that deliberately omitted a wealth of contrary information in order to further her anti-vaccination agenda, starting with the fact that nowhere did she inform her readers that the report she was referencing was ten years old (2007), and that the infant deaths it examined occurred nearly fifteen years ago (2002).  Instead, she left readers with the misleading impression that she was describing a recent event and suggested that it was somehow suspicious that the non-homicide deaths of two infants in a remote part of the world fifteen years ago didn't garner the attention of the U.S. national press — likely because doing so served to further the anti-vaccination narrative that the “mainstream media” is withholding the truth about the dangers of childhood vaccinations.", "The incidence of two infant twin siblings dying within 24 hours of each other two days after receiving vaccines is factual. The information Elizabeth cited was originally published  as a conference presentation and later as a case report in the Journal of Forensic and Legal Medicine. (PubMed is a government repository of published journal abstracts, and as such does not “report” anything on their own.) This event was described in that report as follows:", "Twin girls (3.5-month-old) were found dead by their mother in their crib, both in supine position. The infants were identical twins and delivered at a hospital by cesarean section. Both infants were healthy and did not have any serious medical history. Two days prior to the incident, the twins had received the second dose of oral polio, DPT and the first dose of hepatitis B vaccines ...", "Both twins had been given 2 teaspoonful of acetaminophen due to fever on the first day of the vaccination. On subsequent two days they had no complaints of fever.", "The purpose of that report was to present the totality of information doctors and Turkish government officials had available to them to prior to making a ruling on the cause of death, the main objective of which was to determine if any evidence of criminal wrongdoing existed.", "A team of doctors, technicians, and judicial investigations did not find any clear cause for the deaths, so the case was referred to the Turkish Ministry of Justice’s Forensic Medicine Division, who ruled that the best available diagnosis was sudden infant death syndrome (SIDS):", "The death scene investigation, judicial investigation, parental assessment, macroscopic and microscopic autopsy findings and the toxicological analysis did not yield any specific cause of death. Likewise, the clinical history of the parents and the infants, the gestational follow up during the pregnancy did not imply any pathologic condition the death can be attributed to. The case was referred to a supreme board composed of multidisciplinary medical professionals at the Institute of Forensic Medicine, Ministry of Justice, in Istanbul. The Board decided that the available data was consistent with SIDS.", "Elizabeth makes it clear that she believes the two died as a result of their vaccinations, an assessment based on no evidence whatsoever other than the temporal proximity of the twins' deaths to their vaccinations (a classic expression of the post hoc, ergo propter hoc logical fallacy).  Anti-vaccine advocates commonly try to draw a line between SIDS and vaccinations, but citing a temporal relationship alone is not convincing evidence of any link, since by definition the time period during which a death can be considered to be the result of SIDS generally corresponds to the same time period when children receive a bulk of their vaccinations. To determine whether any possible causal connection exists between vaccines and SIDS, researchers have to look at the epidemiology of SIDS and vaccination as a whole.", "Several studies have attempted to investigate a possible connection by comparing populations of vaccinated SIDS victims against unvaccinated SIDS victims. One of the earliest large scale studies, published in 2001 in the BMJ, surveyed populations of infants in five regions of England and concluded that \"Immunisation does not lead to sudden unexpected death in infancy, and the direction of the relation is towards protection rather than risk.\"", "A similar study conducted in the United States in 2001 using data collected between 1990-1997 from the CDC’s Vaccine Adverse Event Reporting System also found no causal relationship, noting that the time period studied actually showed an increase in vaccination but a decrease in SIDS cases.", "Later studies published in 2007 also demonstrated a lack of a causal relationship between SIDS and vaccination, and they even suggested that vaccinations provided a protective effect against SIDS. Although the protective element remains a subject of debate, more recent work has continued to confirm a lack of association between vaccination and SIDS.", "A VAERS-based study published in 2015 that used death- after-vaccination reports from 1997 through 2013 documented (similar to the 2001 study) a continued decline in deaths from SIDS in the United States and, once again, no correlation between vaccination and SIDS:", "No concerning pattern was noted among death reports submitted to VAERS during 1997–2013. The main causes of death were consistent with the most common causes of death in the US population.", "Because SIDS peaks at a time when children are receiving many recommended vaccinations, it would not be unexpected to observe a coincidental close temporal relationship between vaccination and SIDS.", "Despite Elizabeth’s derision at the use of the term \"coincidence,\" it should be noted that given the high numbers of children vaccinated in the world, an infant death occurring 24-48 hours after a vaccination by chance alone — in small numbers — is highly probable on an annual basis. A 2005 study published in the journal Pediatrics investigated this question for the population of Australian children and found that:", "The overall estimated probability of vaccination within the last 24 hours for a child who has died of SIDS in Australia is estimated as 1.3%. In the last 48 hours, it is 2.6%. With the average number of SIDS deaths for the period 1997-2001 equal to 130 cases per year, we estimated that a case of SIDS will occur when vaccination was given in the last 24 hours in 1.7 cases per year and within 48 hours in 3.5 cases.", "That the specific infant death event discussed here involved two simultaneous cases of SIDS, of course, makes that Turkish tragedy more rare — but not quite as rare of Elizabeth suggests. That’s because the probability of SIDS is higher for twins in general, and much higher for an infant whose twin sibling has been a victim of SIDS, as noted in the case report:", "In [a 2005 study looking at Danish birth and death records from 1995-1998] the incidence of SIDS was 82% higher in twins as compared to singletons. The excess was especially prominent in term infants. The probability of a 2nd twin dying of SIDS, given that at least one twin had died of SIDS was 4.9 times higher than the overall risk of a twin dying of SIDS.", "Avoiding any mention of these significant factors was not the most egregious omission Elizabeth made in her article, however. That award goes to her neglecting to mention the mother’s family history of SIDS, also described in the case report:", "There is always the possibility of some familial metabolic or other genetic disease. When the familial history of the mother is explored; the mother’s mother had 3 twin births to 6 children, of whom 5 died sometime after the delivery. And the mother’s own twin sibling and the twins of the uncle of the mother also died.", "Although samples were collected to test this line of inquiry, the Turkish government did not pursue it due to a lack of facilities and cost. This factor, the researchers argued, was the largest limitation to their study (and study limitations are typically a factor mentioned in objective coverage of scientific papers).", "We reached out to Elizabeth to inquire whether she had read this portion of the paper (or anything more than its abstract), and if so, what her thoughts were on the probability of genetic mechanisms (rather than vaccinations) being responsible for the infants' deaths.  A response from her \"part-time assistant\" stated “Erin has read the entire paper” but provided no further comment.", "Elizabeth did an impressive job of reporting a misleadingly minimum amount of factual information about a tragic event in an effort to support claims of a link between vaccinations and SIDS — claims that have been repeatedly rejected (and rejected and rejected and rejected and rejected and rejected) by the scientific community.", "Elizabeth attempted to advance her biased viewpoint not by offering false data or overt lies, but by the deliberate omission of any information — genetic history, the time and location of the event, the relationship between twinning and SIDs, and the massive body of research addressing the subject — contrary to her preferred anti-vaccination narrative.", "Elizabeth, Erin.   \"Infant Twins Die Simultaneously After Vaccines, Medical Board Rules ‘Just a Coincidence’.\"\r\n    Health Nut News.   1 February 2017.", "Balci, Y., et al.   \"Simultaneous Sudden Infant Death Syndrome.\"\r\n    Journal of Forensic and Legal Medicine.   February 2007.", "Fleming, Peter, J. et al.   \"The UK Accelerated Immunisation Programme and Sudden Unexpected Death in Infancy: Case-Control Study.\"\r\n    BMJ.   7 April 2001.", "Silvers, L.E. et al.   \"The Epidemiology of Fatalities Reported to the Vaccine Adverse Event Reporting System 1990-1997.\"\r\n    Pharmacoepidemiology and Drug Safety.   June 2001.", "Vennemann, M.M.T. et al.   \"Sudden Infant Death Syndrome: No Increased Risk After Immunisation.\"\r\n    Vaccine.   4 January 2007.", "Vennemann, M.M.T. et al.   \"Do Immunisations Reduce the Risk for SIDS? A Meta-Analysis.\"\r\n    Vaccine.   21 June 2007.", "Kuhnert, Ronny et al.   \"Reanalyses of Case-control Studies Examining the Temporal Association Between Sudden Infant Death Syndrome and Vaccination.\"\r\n    Vaccine.   16 March 2012.", "Moro, Pedro, L. et al.   \"Deaths Reported to the Vaccine Adverse Event Reporting System, United States, 1997–2013.\"\r\n    Clinical Infectious Diseases.   15 September 2015.", "Brotherton J.M. et al.   \"Probability of Coincident Vaccination in the 24 or 48 Hours Preceding Sudden Infant Death Syndrome Death in Australia.\"\r\n    Pediatrics.   June 2005.", "Getahun, Darios et al.   \"Sudden Infant Death Syndrome Among Twin Births: United States, 1995–1998.\"\r\n    Journal of Perinatology.   27 May 2004.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]