["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Moms Rising, a group that supports paid parental leave, tweeted this image to its followers.", "Everyone knows that raising kids isn’t cheap. The latest estimate from the U.S. Agriculture Department says parents shell out over $240,000 for the average child by the time he or she is 18. For many families, that can be tough to manage, but a tweet from the advocacy group Moms Rising says the consequences can be very dire indeed.", "\"Having a baby is a leading cause of poverty spells in the United States,\" the group tweeted on Aug. 5, 2014. Moms Rising supports paid family leave and boasts a membership of more than 1 million people.", "For proof, the group points to a 2012 article in The Nation that said, \"a quarter of all ‘poverty spells’— falling into poverty for two months or more at a time — begin with the birth of a child.\" The article did not cast the birth of a child as a leading reason a person would slip into poverty, but it did link to a 2001 report by Jane Waldvogel, a professor of social work and public affairs at Columbia University.", "Waldvogel’s language was a bit more cautious than what appeared in The Nation.", "\"Recent estimates suggest that one quarter of all poverty spells in the United States begin with the birth of a new child,\" Waldvogel wrote.", "Waldvogel based that on 1998 data from the U.S. Health and Human Services Department. Here’s the key table:", "Percentage of First Poverty Spell Beginning by Event", "Event", "Spell Began 1973-79", "Spell Began 1980-85", "Spell Began 1986-91", "First birth - single mom", "4.2", "5.8", "7.3", "First birth - other", "2.3", "4.5", "2.3", "Second birth and up", "9.2", "10.2", "17.9", "Sub-total births", "15.7", "20.5", "27.5", "Mom’s work hours dropped 500+ hours/year", "12.5", "21.4", "28.6", "Other adult’s work hours dropped 500+ hours/year - no change in family structure", "29", "27.7", "27.7", "Other adult’s work hours dropped 500+ hours/year - change in family structure", "24.6", "22.9", "16.3", "Sub-total work hours drop", "66.1", "72", "72.6", "Let’s take the period when having a child had the biggest impact. When we add up the percentages tied to the arrival of a new baby, we see the source of the 28 percent cited by Waldvogel. But while that’s a large number, it fails to prove that the birth of a child was a leading change that tipped people into poverty.", "Since we added up the numbers tied to births, it makes as much sense to to add up the numbers for another set of related events, loss of work hours. The total there is 72.6 percent, or more than twice as large as having a child.", "The original table included four more categories that caused a poverty spell, including divorce, moving or becoming injured and unable to work. The chart doesn’t add up to 100 percent because respondents could select more than one category that fit their situation.", "We asked Ann Huff Stevens, an economist and director of the Center for Poverty Research at the University of California-Davis, what she made of these figures.", "\"That, to me, suggests that pregnancy is not the leading cause of poverty,\" Stevens said.", "However, Stevens warned that no one should go too far down the path of adding up the percentages because the events are not mutually exclusive. In other words, one person could experience both the birth of a child and a loss of work hours or some other event.", "She did note that the 1986-91 period was unusual because no full recession took place in those years. Stevens said in good times, giving birth would play a bigger role as a poverty trigger because the other leading trigger, job loss, would be less common when the economy is doing well.", "A 2014 report from the Health and Human Services Department reaffirms the primacy of a job. The target group is different, single mothers who start receiving welfare payments, but the pattern is consistent with the 1998 table. In the 2004-06 period, the three leading events that put a woman into poverty were: Recipient’s earnings decreased (48.6 percent), Other household earnings decreased (23.8 percent),  and New child in family (22.9 percent).", "Teasing out the most important events", "Part of the problem with the HHS table -- which is essentially the source for Moms Rising’s tweet -- is that the events that trigger poverty can overlap. This makes it difficult to say which is most important. But in 2002, analysts with the Urban Institute, an academic center in Washington, took the data files behind the HHS tables and used more sophisticated tools to assess how much each event -- by itself -- mattered.", "They calculated the likelihood of a person slipping into poverty if one of seven changes occurred.", "Event", "Likelihood of slipping into poverty", "Head of household loses employment", "16.7%", "Shift from two-adult to female-headed household", "15.3%", "Spouse loses employment", "8.9%", "Another household member loses employment", "7.2%", "Child under age 6 enters household", "5.8%", "Head of household becomes disabled", "5.8%", "Young adult sets up own household", "4.6%", "One of the Urban Institute researchers, Caroline Ratcliffe, said having a child plays a role, but not a leading one.", "\"The impact of having a child isn’t as large as losing a job,\" Ratcliffe said. \"But in the different analyses, we find that it’s either as important or more important than the onset of a disability of the family head.\"", "Out of the seven events Ratcliffe assessed, having a child ranks in the bottom three and it is about a third as potent a factor as job loss.", "Sheldon Danziger, professor of public policy at the University of Michigan and president of the Russell Sage Foundation, a group that funds poverty research, said the claim from Moms Rising puts too much weight on the wrong issue.", "\"The primary problem is an economic one,\" Danziger said. \"If you grow up poor and live in a bad neighborhood and go to a bad school and you are not likely to go to college, you are likely to be poor at age 20 whether or not you have had a child.\"", "Our ruling", "The advocacy group Moms Rising said having a baby is a major reason someone will slip into poverty. The evidence cited by Moms Rising goes back to 1998 and while one might say that having a child can trigger a spell of poverty about a quarter of the time, the impact of job loss is much greater.", "The most careful analysis separated the relative influence of different life changes. According to that, having a child ranks low and is much less important that changes in employment or shifting from a two-adult to a female-headed household.", "We rate this claim False.", "Moms Rising, tweet, Aug. 5, 2014", "Harrell Rodgers, \"American Poverty in a New Era of Reform\", 2006", "The Nation, Too Often, a New Baby Brings Big Debt, May 15, 2012", "The Future of Children, Caring for infants and toddlers, Spring/Summer 2001", "U.S. Department of Health and Human Services, Indicators of welfare dependence: Predictors and risk factors associated with with welfare receipt, October 1998", "U.S. Department of Health and Human Services, Welfare indicators and risk factors, 2014", "Philip Jefferson, editor, The Oxford Handbook of the Economics of Poverty, 2012", "U.S. Department of Health and Human Services, Transition events in the dynamics of poverty, September 2002", "CNN Money, Average cost to raise a kid: $241,080, Aug. 14, 2013", "Email interview, Gretchen Wright, spokeswoman, Moms Rising, Aug. 8, 2014", "Email interview, Ann Huff Stevens, professor and chair, Department of Economics, director, Center for Poverty Research, University of California - Davis, Aug. 8, 2014", "Email interview, Jane Waldfogel, Ph.D., professor of social work and public affairs at Columbia University, Aug. 8, 2014", "Email interview, Peter Gottschalk, research professor, Department of Economics, Boston College, Aug. 8, 2014", "Email interview, Caroline Ratcliffe, senior fellow, Urban Institute, Aug. 11, 2014", "Email interview, Sheldon Danziger, professor of public policy, University of Michigan, president, Russell Sage Foundation, Aug. 9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]