["About this rating", "In February 2018, as Americans still reeled from a deadly school shooting in Florida and gun lobbying groups floated proposals to arm teachers to defend their classrooms, various web sites posted articles conveying the claim that Gov. Jerry Brown had signed a law in California prohibiting teachers from doing just that.", "\"Liberals want to ban teachers from having their God-given right to defend the young and innocent from mass shooters,\" wrote the author of a 22 February post on the web sites Right Edition and Truth and Action:", "Unfortunately for the school-aged children in California, Governor Brown would rather see them dead than allow adults to have the right to take out a mass shooter. This is no joke. In response to the recent shooting at Marjory Stoneman Douglas High School in South Florida, Assemblyman Kevin McCarty (D-Sacramento) introduced bill AB 424.", "The catastrophic reach of this bill is appalling and unacceptable in a nation that considers itself to be a democracy.", "California Governor Jerry Brown signed a revolting bill banning teachers from being able to shoot back if a mass murder breaks into their school.", "This bill, AB 424, comes in reaction to the tragic shooting at Marjory Stoneman Douglas High School in South Florida.", "In fact, however, California's AB 424 was not enacted in reaction to the Florida high school shooting. It had been passed and signed by the state's governor several months before that event, in October 2017.", "Nor is \"banning teachers from being able to shoot back\" an objective and impartial description of the bill's content. (A 15 October 2017 article from Breitbart was similarly misleading, alleging that Gov. Brown had signed a bill \"ensuring that teachers can't shoot back if attacked.\")", "The main consequence of the bill's passage is that K-12 school district officials are no longer able to grant special authorization for teachers and other school employees to carry firearms on school grounds — an exception to California's Gun-Free School Zone Act of 1995 that was rarely taken advantage of in the first place.", "The official summary of AB 424 reads as follows:", "Existing law makes it a crime to possess a firearm in a place that the person knows, or reasonably should know, is a school zone, unless it is with the written permission of the school district superintendent, his or her designee, or equivalent school authority.", "This bill would delete the authority of a school district superintendent, his or her designee, or equivalent school authority to provide written permission for a person to possess a firearm within a school zone.", "The Gun-Free School Zone Act originally prohibited the possession of firearms on or within 1,000 feet of school grounds, except in two cases: concealed weapons permit holders were permitted to carry firearms in gun-free school zones (a provision that had already been repealed in 2015), and persons granted written permission by school district authorities could do so (the provision that was repealed by AB 424).", "Since AB 424 went into effect on 1 January 2018, it has been illegal for anyone besides security guards, law enforcement officers, military personnel engaged in official duties, and armored vehicle guards to possess firearms on or near K-12 school grounds in California. The law does not apply to college campuses.", "Only a \"handful\" of California's roughly 1,024 school districts had actually initiated programs to grant school employees permission to carry weapons, according to the Sacramento Bee (Associated Press estimated the number at about five). The Wall Street Journal reported that at least eight states currently allowed teachers \"in some capacity\" to carry guns on K-12 school grounds.", "Forty-four percent of Americans surveyed in a CBS News poll taken after the Parkland, Florida, school shootings favored allowing more teachers to carry guns.", "Bollag, Sophia.   \"California Lawmakers Aim to Strengthen Gun Ban in Schools.\"\r\n    Associated Press.   23 May 2017.", "Hawkins, Awr.   \"Jerry Brown Signs Bill Ensuring Teachers Can't Shoot Back If Attacked.\"\r\n    Breitbart.   15 October 2017.", "Lambert, Diana.   \"Some School Districts Allow Employees to Carry Guns. California Says They Need to Stop.\"\r\n    The Sacramento Bee.   17 October 2017.", "Maskara, Shreya.   \"Gov. Brown Signs Law Banning Concealed Guns at California Schools.\"\r\n    Daily Bruin.   12 October 2015.", "McGreevy, Patrick.   \"Law That Would Expand Firearms Ban on California Campuses Goes to Gov. Jerry Brown's Desk.\"\r\n    Los Angeles Times.   11 September 2017.", "CBS News.   \"Poll: Support for Stricter Gun Laws Rises; Divisions on Arming Teachers.\"\r\n    23 February 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]