["By Saranac Hale Spencer", "Posted on April 11, 2018", "Q: Did a federal judge rule that evidence collected from Michael Cohen’s office is inadmissible?", "A: No. That claim was invented by a website that labels its content as satire.", "The FBI seized records from Michael Cohen, one of President Donald Trump’s personal lawyers, on April 9.", "Stephen Ryan, the lawyer representing Cohen, said in a statement that the raid was partly related to special counsel Robert Mueller’s investigation of Russian interference in the 2016 presidential election. It is unclear what will happen to the evidence agents collected.", "What is clear is that a federal judge has not ruled that the evidence is “completely illegal and inadmissible in any court of law.”", "That claim was made up by a self-described satirical website and copied by another site that posted it on Facebook as if were real news. Users of the social media site flagged the story as potentially false. It is.", "The story originated on a website called Daily World Update, which is part of a network of sites that labels its content as satire aimed at conservatives. But it was copied by a site called Only Politics, which has no satire disclaimer, and was shared on at least four different Trump-themed Facebook pages with a combined following of 850,000. Each of the people who posted the story on those pages appear to live outside of the U.S. Three of them say on their Facebook profiles that they live outside of the U.S., and the fourth doesn’t provide a location, but “likes” several politicians and sports teams from Kosovo.", "The story draws on existing discord over Mueller’s investigation, which Trump has called a “witch hunt.” The president also referred to the raid on Cohen as “A TOTAL WITCH HUNT!!!” So, the made-up story claims that the judge who tossed the evidence from the Cohen raid called his ruling a “politically motivated favor.”", "But, the judge named in the story doesn’t even exist; he’s a completely made-up character. There has never been a federal judge named “Earl Manuel Mariano,” according to records kept by the Federal Judicial Center.", "The court doesn’t exist, either. There is no “Northern California 43rd Circuit Federal and State Court of Appeals.” The federal court system is separate from state court systems. The federal appellate court that covers California is the U.S. Court of Appeals for the Ninth Circuit. There are 13 total federal appellate courts below the U.S. Supreme Court, not 43.", "Another red flag indicating that the story is bogus are the hyperlinks: one goes to a picture of Jim Carrey in the 1994 movie “Dumb and Dumber;” the link attached to the word “clerk” goes to a picture from another 1994 movie, “Clerks“; and the last one takes readers to a Google search for the word “dumbass.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "Ryan, Stephen. Statement as Michael Cohen’s lawyer. 9 Apr 2018.", "“BREAKING: Federal Judge Tosses Michael Cohen Warrant And All Evidence With It.” DailyWorldUpdate.com. 9 Apr 2018.", "Federal Judicial Center. Biographical Directory of Federal Judges. FJC.gov. Accessed 11 Apr 2018.", "Trump, Donald. “This is the single greatest witch hunt of a politician in American history!” Twitter. 18 May 2017.", "Trump, Donald. “A TOTAL WITCH HUNT!!!” Twitter. 10 Apr 2018.", "Administrative Office of the U.S. Courts. “Comparing Federal & State Courts.” UScourts.gov. Accessed 11 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]