["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A series of social media posts widely circulated in August 2020 claimed that Legionnaires' disease, a respiratory infection that can cause a rare and sometimes fatal form of pneumonia, could be contracted from reused face masks worn to protect against COVID-19.", "Snopes readers asked us to verify this rumor that essentially argues respiratory droplets containing Legionella pneumophila, the pathogen that causes Legionnaires' disease, may persist in those contaminated respiratory droplets held within a used mask. Specifically, the social media posts stated that the “moisture and bacteria” found in an anonymous woman’s mask, which she wore daily, resulted in a misdiagnosis of COVID-19.", "Mask wearers beware ...\nA caller to a radio talk show recently shared that his wife was hospitalized and told she had COVID and only a couple of days left to live. A doctor friend suggested she be tested for legionnaires disease because she wore the same mask every day all day long. Turns out it WAS legionnaires disease from the moisture and bacteria in her mask. She was given antibiotics and within two days was better. WHAT IF these \"spikes\" in COVID are really something else due to improper mask wearing??\nCopied and pasted", "The claim in the social media post is false.", "According to Legionella, a nonprofit organization that shares educational material and scientific research about the disease, Legionnaires' is not contagious and cannot be transmitted by infected persons or their masks.", "“You cannot contract Legionnaires' disease from wearing face masks. Legionella bacterium is transmitted by aspirating drinking water or breathing in water droplets. Legionella is not spread from person-to-person in respiratory droplets nor does the bacteria survive on dry surfaces. Your mask would not be a source of transmission for the Legionella bacteria,” wrote the organization on its website.", "Legionnaires’ disease is a severe form of lung infection caused by breathing in mist or water that is contaminated with the bacterium. The condition is characterized by a cough, fever, headache, and shortness of breath — all symptoms that are also associated with COVID-19 and could potentially result in the misdiagnosis. Though Legionnaires' is treatable with antibiotics, about 1-in-10 infected people will die.", "However, as noted by Legionella, if a person were diagnosed with Legionnaires' disease, it would not be a consequence of wearing a mask. Water contaminated with the bacteria must be directly inhaled or drank by an individual in order to become infected. As such, a mask would theoretically need to come into direct contact with contaminated water in order for it to be inhaled. Even so, Legionella only grows in standing water under warm temperatures and cannot survive on dry surfaces.", "A microscopic view of Legionella pneumophila, the bacteria responsible for Legionnaires' disease. CDC Public Health Image Library", "In May, the Centers for Disease Control and Prevention (CDC) issued guidance for reopening buildings after widespread and abrupt COVID-19 shutdowns of businesses, schools, and other facilities. Those closures resulted in decreased water usage, which could contribute to pooling in water systems that are prime locations for the growth of Legionella bacterium. Combined with shutdown-related declines in water chlorination and regular cleaning, the agency noted that the bacteria may accumulate in standing water over the course of weeks or months before being aerosolized through devices like showers, hot tubs, fountains, and air conditioning cooling towers used once localities reopen.", "Snopes could find no mention of the radio show referenced in the Facebook posts, but we did track down an article published by the Naples Daily News Editorial Board that reported on a rumor of four Floridians who had been diagnosed with mask-related Legionnaires’ disease at a local hospital. The hospital's CEO Paul Hiltz told Naples Daily News he knew of no such cases.", "A 2017 case study described a 67-year-old woman who was diagnosed with Legionnaires’ disease after failing to clean the mask, tubing, and humidifier of her continuous positive airway pressure (CPAP) machine used for sleep apnea, which suggests that there may be a link between plastic facial masks directly connected to contaminated water systems. However, CPAP masks are generally made of hard plastic with a silicone seal and not the same material as standard cloth filter masks used during the COVID-19 pandemic.", "The CDC cautions that people at risk for Legionnaire’s disease, such as those with weakened immune systems and previous smokers, should consult with a doctor before they flush toilets that have not been used recently or perform any sort of cleaning activities that might result in the production of aerosols. In fact, the agency notes that the use of purifying face masks may help to limit the risk of infection.", "The CDC recommends that anyone in healthy respiratory health and over the age of 2 should wear a mask when in public. Masks should be worn over the nose and mouth, held snugly against the sides of your face, and feel secure under your chin. Cloth masks should be washed after each use.", "\"Fact Check: You Can’t Catch Legionnaires’ Disease By Wearing A Face Mask.\"\r\n    Reuters.   5 Aug 2020", "Centers for Disease Control and Prevention.   \"Reopening Buildings After Shutdown.\"\r\n    7 May 2020", "Schnirman, Ruby, et al.   \"A Case of Legionella Pneumonia Caused by Home Use of Continuous Positive Airway Pressure.\"\r\n    SAGE Open Medical Case Reports.   7 Jan 2017.", "Editorial Board.   \"Editorial: Mandatory Mask Ordinance May Boost Positive News Coming From NCH Regarding COVID-19.\"\r\n    Naples Daily News.   21 July 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]