["Days after a pregnant elephant in Kerala died after a fruit stuffed with firecrackers went off in her mouth, a similar incident came to light from Himachal Pradesh where a pregnant cow was injured after eating flour balls filled with explosives. In the backdrop of this incident, some images are being linked with this case from Himachal Pradesh.", "On June 6, former journalist and a member of Samajwadi party Preeti Chobey tweeted two images with the message, “Highly condemnable, Heinous crime. People (who did these) be damned, where are the people who took oath for cow vigilantism. Those who were still screaming over the incident in Kerala. A pregnant cow was fed with explosive material in the Himachal Pradesh’s Bilaspur which is considered to be a holy place. The cow was brutally injured. #HimachalPradesh”. At the time of writing this article, the tweet had amassed over 400 retweets.", "Facebook page ‘@Hinduarmychief’ posted the images with a similar narrative. The post has been shared more than 300 times so far.", "On June 7, ‘Tamil Express News‘ also published an article on the incident along with the same images. Bengali website ‘Pratifalak‘ also carried the images in their article.", "The images are widely circulating on Twitter and Facebook.", "With a reverse image search with keywords, we found a post by a Facebook page ‘Baba Mungipa Gaushala n Hospital Tosham‘ on July 3, 2015. The post said that the images are from Lilamba village of Rajasthan’s Raipur tehsil. Moreover, we performed a keyword search on Facebook with time filter and found a post by Facebook page ‘Savecowslife Vrindavan‘ which gave the same information.", "A subsequent keyword search on Google led us to a report published by Hindi news outlet Patrika on June 27, 2015. According to the report, a cow was grazing in a garbage disposal area when an explosive went off and the cow’s jaw blew off. The villagers started a ruckus and then accused miners of hiding the explosive material. Soon after, the police reached the spot, pacified the enraged locals and started searching for the explosives in the garbage. The report also stated that there was a blast in the village two months before the incident. At the time, the villagers had investigated the matter but found no clue. Taking cognizance of this matter, then station in-charge at the local police station had ordered an inquiry. We couldn’t find any news article related to the investigation or the accused in this incident.", "Hence, the three images being circulated as that of a recently injured cow in Himachal Pradesh are actually old and unrelated. These images depict a cow that was injured in an explosion at a village in Pali district, Rajasthan in 2015.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]