["About this rating", "Both President-Elect Donald Trump and Carrier maintained that the incoming administration brokered a deal to keep as many as a thousand jobs in Indiana.", "Terms and specifics of the deal or original plan to eliminate the jobs were not disclosed.", "On 29 November 2016, multiple news sources reported a pending deal between President-elect Donald Trump and the company Carrier, which would purportedly save hundreds of American jobs:", "From the earliest days of his campaign, Donald J. Trump made keeping manufacturing jobs in the United States his signature economic issue, and the decision by Carrier, the big air-conditioner company, to move over 2,000 of them from Indiana to Mexico was a tailor-made talking point for him on the stump.", "On Thursday, Mr. Trump and Mike Pence, Indiana’s governor and the vice president-elect, plan to appear at Carrier’s Indianapolis factory to announce a deal with the company to keep roughly 1,000 jobs in the state, according to officials with the transition team as well as Carrier.", "On 30 November 2016, reports solidified that the incoming administration had reached an agreement to keep Carrier jobs in Indiana:", "Carrier had planned to move production from a key factory in that state to Mexico, taking with it the roughly 1,400 jobs of those who work at the Indiana plant.", "But shortly after CNBC revealed that Donald Trump was expected to travel to Indiana on Thursday to announce that a deal had been reached, Carrier itself confirmed the agreement.", "Late on 29 November 2016, the company tweeted:", "We are pleased to have reached a deal with President-elect Trump & VP-elect Pence to keep close to 1,000 jobs in Indy. More details soon.", "— Carrier (@Carrier) November 30, 2016", "Further details about the terms of the arrangement or the original plan to eliminate the jobs were not immediately available, and some media outlets were skeptical of the claim:", "Carrier — the Indiana manufacturer that announced early this year that it was outsourcing 1,400 jobs to its plant in Monterrey, Mexico — announced on Tuesday that it had made a deal with President-elect Donald Trump to keep “close to 1,000″ of those production jobs in Indianapolis.", "The terms of the deal remain unclear. Even Trump’s involvement in the negotiation is unknown.", "Sources told CNBC that Vice President-elect Mike Pence negotiated with United Technologies (UTX, Carrier’s parent company) CEO Greg Hayes[.]", "If Trump did a Carrier-style deal every week for the next 4 years, he could bring back 4% of the manufacturing jobs lost since 2000.", "— Paul Krugman (@paulkrugman) November 30, 2016", "Details of the arrangement were not clarified by either party.", "Faber, Firstname.   \"Trump To Reveal Deal To Keep Nearly 1,000 Carrier Jobs In Indiana.\"\r\n    CNBC.   30 November 2016.", "Gauthier, Brendan.   \"It’s OK To Be Skeptical About Donald Trump’s Proposed Deal With Carrier.\"\r\n    Salon.   30 November 2016.", "Schwartz, Nelson D.   \"Trump to Announce Carrier Plant Will Keep Jobs in U.S.\"\r\n    The New York Times.   29 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]