["About this rating", "Dolphins and swans were indeed spotted in some of Italy's waterways after the nationwide lockdown was imposed.", "Dolphins and swans swimming in Italy's waterways were not necessarily new phenomena related to reduced human activity during the COVID-19 lockdown.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Outside of Asia, Italy has been hardest hit by the COVID-19 coronavirus disease pandemic. But in March 2020, as the country continued to deal with rising death tolls and a national lockdown, many found relief in posting images of wildlife on social media.", "Perhaps eager for good news, some shared the images and news stories with commentary saying the nationwide lockdown had resulted in unprecedented clear and tranquil waters in Italy, leading to a return of wildlife such as dolphins and swans to places like the now-uncrowded Venetian canals. Readers asked Snopes if this news was too good to be true. The answer is yes and no, as we will explain below.", "Here are some examples of social media posts:", "https://twitter.com/b8taFPS/status/1239863383354224641/", "The dolphins shown in the video, it turns out, were not swimming in the iconic canals of Venice, but off the coast of Sardinia, an Italian island in the Mediterranean Sea. Dolphin sightings in that area are not a new phenomenon, as a 2017 video demonstrates.", "National Geographic pointed out that the swan sightings were real, but not described accurately. \"The swans in the viral posts regularly appear in the canals of Burano, a small island in the greater Venice metropolitan area, where the photos were taken,\" National Geographic reported.", "Furthermore, although some social media users seemed to think the water seen in these images appeared more transparent because it was \"cleaner\" or due to reduced human activity, that wasn't necessarily the case. As experts interviewed by ABC News pointed out, the water was clearer, though not necessarily cleaner, due to a lockdown-related reduction in boat traffic, which typically \"kicks sediment to the surface\" and makes it murkier.", "On March 19, Italy's death toll officially surpassed that of China, where the virus was initially detected. Sadly, as of this writing, 3,405 people in Italy have died from COVID-19, and the country's hospitals in hard-hit regions are overwhelmed with patients.", "The COVID-19 pandemic has sickened and killed thousands globally. Per the latest World Health Organization report, there are 191,127 confirmed cases worldwide and 7,807 deaths.", "Christian, Bonnie. \"Dolphins and Swans Appear in Venice Canals a Week After City Locks Down to Prevent Coronavirus Spread.\"\r\n    Evening Standard.   18 March 2020.", "Jacobo, Julia. \"Venice Canals Are Clear Enough to See Fish as Coronavirus Halts Tourism in the City.\"\r\n    ABC News.   18 March 2020.", "Daly, Natasha. \"Fake Animal News Abounds on Social Media as Coronavirus Upends Life.\"\r\n  National Geographic. 20 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]