["About this rating", "The State Department is planning to provide $75 million worth of assistance to Mexico in the form of U.S. training and equipment in a joint effort to help secure southern borders and deal with issues of drug trafficking and immigration.", "Neither the State Department nor President Obama is providing Mexico with $75 million for the purpose of constructing a physical wall along Mexico's southern border.", "In September 2016, a number of web outlets published articles asserting that President Obama was providing Mexico with $75 million in order to construct a wall on that country's southern border (i.e., the frontier between Mexico and Guatemala and Belize).  Items about President Obama's investment in a Mexican wall were published to many blogs and Facebook pages, with one popular version stating:", "You have got to be kidding me! After all the times that Trump has been attacked by the Democratic side of our society for saying that we need a wall on our Mexican border to stop illegals from getting into our country and destroying our economy, Obama just pulled the most hypocritical and pointless move of his career.", "Obama just gave a ‘gift’ of $75 MILLION to Mexico to provide material and equipment for the building of a border wall on Mexico’s SOUTHERN border and to help cover the expense of training to help man the wall properly.", "Another version of the rumor maintained:", "Turns out Barack Obama isn’t all that against building a border wall to keep out illegals after all.", "Thing is, he wants illegals to enter America, he’s just not okay with them entering Mexico.", "Looks like the U.S. is giving our neighbors to the south $75 million so they can build their own wall to protect themselves from Central American invaders.", "Most such articles cited a 15 September 2016 Newsmax piece whose only reference to a wall was a metaphor, mentioning an \"invisible wall\" along Mexico's southern border with Central America:", "Amid talk of Donald Trump's plans to build a border wall between the United States and Mexico, Mexico itself has an invisible wall along its southern border with Central America as migrants head north.", "A Financial Times story details Mexico's role in stopping people from getting into its country from Guatemala. A reported 175,000 Central Americans were deported from Mexico in 2015 (a 68 percent jump from 2014), and so far in 2016 that number is approaching 100,000.", "The Times claims the U.S. is sending Mexico $75 million in the form of equipment and training to help shore up its southern border. Ultimately, some of the Central American migrants wind up at America's southern doorstep. Stopping them from entering Mexico is the first line of defense.", "Newsmax in turned linked to a 14 September 2016 Financial Times article (virtually inaccessible behind a paywall) that described how Mexico had essentially become a (metaphorical) \"wall\" against migrants from Central American countries attempting to flee to the U.S.  That article referenced the $75 million figure, clearly noted as being for \"equipment and training\" and not the construction of a wall:", "“Mexico has become a wall for migrants,” said Sister Magdalena Silva, co-ordinator of Cafemin, a privately run shelter in Mexico City that takes in refugee families, including Rosa’s. “The current policy is to arrest migrants to stop them from getting to the US border.”", "Although Mexico grants asylum to more Central Americans than does the US, Sister Magdalena estimates about seven out of 10 people who stay in her shelter still end up heading north.", "Rosa and her sons just joined that count: after weeks in limbo waiting on the appeal, they finally threw in the towel after the youths witnessed a woman lying in a pool of blood just blocks away from the shelter.", "“I don’t want them growing up thinking this is normal and happens everywhere,” says Rosa. The family travelled to the US, turning themselves in at the US border to ask for asylum. After a few weeks in detention, Rosa and her 14-year-old son were released to live with a family in Baltimore pending a decision. As an adult, her 19-year-old son is still in detention and could get deported.", "The US is coy about its role in Mexico’s crackdown but is sending $75m in equipment and training to help stop Central Americans from crossing illegally into Mexico. Hosting Mr Trump, President Enrique Peña Nieto said that “making Mexico’s border with our friends and neighbours in Central America more secure is of vital importance for Mexico and the US”.", "Ultimately, what all those articles referenced was a February 2016 Congressional Research Service (CRS) report on \"U.S.-Mexican Security Cooperation\" that mentioned plans for the U.S. to provide \"at least $75 million\" in assistance to Mexico.  However, that money would not be given to Mexico for the construction of a physical wall (which would largely be impractical given the geography of the region), but rather it would be provided in the form of U.S. training and equipment assistance (e.g., nonintrusive inspection equipment, mobile kiosks, canine teams, immigration agents) to help Mexico secure their southern border and better deal with shared U.S.-Mexico concerns over drug trafficking and immigration:", "One element of concern regarding enhanced bilateral border security efforts is that of southbound inspections of people, goods, vehicles, and cargo. In particular, both countries have acknowledged a shared responsibility in fueling and combating the illicit drug trade.", "Historically, Mexican Customs had not served the role of performing southbound (or inbound) inspections. As part of the revised Mérida Initiative, CBP has helped to establish a Mexican Customs training academy to support professionalization and promote the Mexican Customs’ new role of performing inbound inspections. Additionally, CBP is assisting Mexican Customs in developing investigator training programs and the State Department has provided over 148 canines to assist with the inspections.", "Policymakers may also seek to examine a relatively new element under pillar three of the Mérida Initiative that involves U.S. support for securing Mexico’s porous and insecure southern borders with Guatemala and Belize. With U.S. support, the Mexican government has been implementing a southern border security plan since 2013 that has involved the establishment of 12 advanced naval bases on the country’s rivers and three security cordons that stretch more than 100 miles north of the Mexico-Guatemala and Mexico-Belize borders. Mexico’s National Institute of Migration (INAMI) agents have taken on a new enforcement directive alongside federal and state police forces. These unarmed agents have worked with the military and the police to increase immigration enforcement efforts along known migrant routes. While several U.S. officials have praised Mexico’s efforts, human rights groups have criticized Mexico for abuses committed by its officials against migrants, for failing to provide access to humanitarian visas or asylum to migrants who have valid claims to international protection, and for detaining migrant children.", "The State Department has provided $15 million in equipment and training assistance, including NII [nonintrusive inspection] equipment, mobile kiosks, canine teams, and training for INAMI officials in the southern border region. It plans to spend at least $75 million in that area. The Department of Defense has provided training and equipment to Mexican military forces as well. Observers have urged U.S. policymakers to consider providing Mexico with support in how to investigate and punish crimes against migrants, training in how to conduct humanitarian screening, and support for Mexico’s asylum agency.", "As the report indicated, the State Department (not President Obama) \"plan[ned] to spend\" approximately $75 million in total over an unspecified period of time in a joint effort between the U.S. and Mexico to manage their borders. Those funds will go towards providing equipment and training, not bricks and mortar.", "Devaney, Jason.   \"Financial Times: US Gives Mexico $75M Aid for an Anti-Immigrant Wall.\"\r\n    Newsmax.   15 September 2016.", "Fredrick, James and Jude Webber.   \"Mexico Builds Its Own Wall Against Migrants.\"\r\n    Financial Times.   14 September 2016.", "Seelke, Clare Ribando and Kristin Finklea.   \"U.S.-Mexican Security Cooperation: The Mérida Initiative and Beyond.\"\r\n    Congressional Research Service.   22 February 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]