["About this rating", "A bill introduced to Congress in January 2017 would require \"the President to terminate U.S. membership in the United Nations.\"", "The bill was introduced to Congress two weeks prior to Donald Trump's inauguration and has been submitted to each new Congress for the last 20 years.", "In January 2017, many Americans were disconcerted to learn of the introduction to Congress of the American Sovereignty Restoration Act of 2017 (H.R. 193), a bill introduced by Rep. Mike Rogers of Alabama seeking to end the United States' membership, participation, and funding in the United Nations:", "This bill repeals the United Nations Participation Act of 1945 and other specified related laws.", "The bill requires: (1) the President to terminate U.S. membership in the United Nations (U.N.), including any organ, specialized agency, commission, or other formally affiliated body; and (2) closure of the U.S. Mission to the United Nations.", "The bill prohibits: (1) the authorization of funds for the U.S. assessed or voluntary contribution to the U.N., (2) the authorization of funds for any U.S. contribution to any U.N. military or peacekeeping operation, (3) the expenditure of funds to support the participation of U.S. Armed Forces as part of any U.N. military or peacekeeping operation, (4) U.S. Armed Forces from serving under U.N. command, and (5) diplomatic immunity for U.N. officers or employees.", "Although the existence of this bill was viewed by many with dismay as being a harbinger of newly inaugurated President Donald Trump's assumed belligerent approach to foreign policy, H.R. 193 is neither new in content nor related to a change in presidential administrations.", "\"Get us out of the UN!\" has been a rallying cry of some political groups ever since that global organization was established in 1945, and many efforts (of varying degrees of seriousness) have been undertaken to bring about that result in the last several decades.", "Accordingly, an identical \"American Sovereignty Restoration Act,\" intended to \"terminate U.S. participation in the United Nations,\" has been introduced to the House of Representatives at the beginning of each Congress for the last twenty years since 1997. The 2017 and 2015 versions were sponsored by Rep. Rogers, the 2013 version by Rep. Paul Broun of Georgia, and the 1997 through 2011 versions were sponsored by Rep. Ron Paul of Texas (all Republicans).", "In each case, the most recently submitted \"American Sovereignty Restoration Act\" bill has been referred to the House Committee on Foreign Affairs (also known as the House Committee on International Relations) and languished there without ever being passed or brought to a vote.", "Whatever the intent of the new administration might be in the foreign policy arena, the notion of American withdrawal from the U.N. is one that has been floated in congressional bills for decades now.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]