["A post offering Democratic presidential nominee Joe Biden's views on the Second Amendment started off as satire, but has now contributed to the spread of misinformation ahead of the 2020 election.", "“Biden Says the Second Amendment is ‘Obsolete,' ” reads the headline of the article from the site  America's Last Line of Defense that has been shared by users on Facebook.  USA TODAY reached out to those users for comment.", "“Just recently, Biden confirmed one of those very fears during a campaign speech at the Joe Barron Jewish community center in Pohtaytoe, Virginia, referring to the sacred and God-blessed Second Amendment right of all Americans to own and use firearms at any time anywhere for any reason whatsoever as ‘obsolete,’” the article reads.", "False quotes have been frequently attributed to Biden and Sen. Kamala Harris, the Democratic vice presidential nominee. Several originate as satire and are then shared by users who perceive them to be fact.", "Fact check: Biden, like Trump, received multiple draft deferments from Vietnam", "The claim that Biden called the Second Amendment \"obsolete\" stems from the site called America's  Last Line of Defense and the top of its page reads, \"SATIRE FOR YOUR CONFIRMATION BIAS.\"", "The article is listed under \"BIDEN SATIRE FOR DELUSIONAL TRUMPSTERS TO HATE\"  and according to the site's about us page, America's Last Line of Defense defines itself as a \"network of parody, satire, and tomfoolery.\"", "\"Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined,\" the site reads.", "Creator of America's Last Line of Defense Christopher Blair, who also goes by \"Busta Troll,\" launched the satirical site with other liberal bloggers during the 2016 presidential campaign as a joke among friends, the Washington Post reported in 2018.", "\"The more extreme we become, the more people believe it,\" Blair told the Post.", "Biden's gun control plan includes universal background checks, additional resources to enforce existing gun laws, pushing \"smart guns\" — firearms that require an electronic ownership confirmation — and banning assault weapons.", "The plan also calls for other measures, such as restricting purchases and possession of guns by fugitives and people convicted of hate crime, and banning online sales of weapons and ammunition.", "While Biden has advocated for stricter gun laws, he has never pledged to \"take away\" the Second Amendment.", "NBC reported that Biden has said on numerous occasions that he is \"not opposed to the Second Amendment.\"", "USA TODAY has also previously debunked claims that Harris would take away guns or use law enforcement to confiscate weapons.", "Claims that Biden called the Second Amendment \"obsolete\" are SATIRE, based on our research. The post originates from a satirical site that explicitly states all of their content is fiction.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]