["About this rating", "On Nov. 8, 2020, The Associated Press (AP) projected that former U.S. Vice President Joe Biden had defeated President Donald Trump and would become the 46th president of the United States. Trump has yet to concede and is fighting Biden's win in various courts claiming vote fraud.", "Three days after AP's projection, a tweet mentioning Vice President-elect Kamala Harris as the deciding vote in the U.S. Senate was posted on the Twitter account @GOPChairwoman, from Republican National Committee Chairwoman Ronna McDaniel. It suggested the reality that the Biden-Harris administration is beginning in January.", "It is true that the tweet was deleted. McDaniel's tweet appeared to be aimed at supporting Republican U.S. Sens. Kelly Loeffler and David Perdue in the upcoming Georgia runoff elections. The date for the runoff was set for Jan. 5, 2021.", "The tweet claimed that if Democrats were to gain control of the U.S. Senate in the Georgia runoff elections, Sen. Chuck Schumer would become majority leader, Sen. Bernie Sanders would become chair of the Senate Budget Committee leading to socialism, Sen. Ron Wyden would become chair of the Senate Finance Committee and get rid of tax cuts, Sen. Diane Feinstein would become chair of the Senate Judiciary Committee and appoint liberal judges, Sen. Patty Murray would favor government control of healthcare, and Vice President-elect Kamala Harris would be the deciding vote in the U.S. Senate. The tweet ended by promoting the Twitter accounts for Loeffler and Perdue.", "McDaniel's tweet did not cite any sources on what appeared to be fear-driven claims. The tweet was possibly deleted after McDaniel noticed that Bloomberg and other outlets reported that the post appeared to suggest a Biden win.", "Two days later, McDaniel issued perhaps a safer tweet to an Associated Press story as a way of supporting the two Republican Georgia runoff-election candidates:", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]