["About this rating", "In September 2018, Levi Strauss announced three actions aimed at advocating for gun violence prevention, including establishing $1 million in funding for gun control advocacy and forming a partnership with Everytown for Gun Safety, a group founded and funded by Michael Bloomberg.", "Contrary to characterizations in some reports, the September 2018 actions were not targeted at Second Amendment-supporting customers of Levi Strauss, were not \"anti-Second Amendment\" in the sense of wanting to get rid of the Second Amendment, and the aim of \"attacking gun rights\" was not articulated by the company but rather ascribed to them by gun rights-supporting commentators.", "In September 2018, several conservative web sites and the National Rifle Association (NRA) reported that Levi Strauss & Co., producer of the iconic Levi's brand of jeans, had partnered with businessman and former New York mayor Michael Bloomberg to \"attack gun rights.\"", "The NRA's Institute for Legislative Action (NRA-ILA) declared that Levi Strauss had left behind their \"rugged image\" and would be working with \"a billionaire oligarch in an effort to empower the government to trample upon the fundamental rights of the American people.\" The conservative LifeZette website similarly wrote that:", "The company plans to donate $1 million over four years through grants to anti-gun groups -- including the nonprofit Everytown for Gun Safety, a Michael Bloomberg-fronted group -- and will also encourage employee contributions through offering to double-match all the monies they throw toward the anti-gun campaign.", "On 5 September the NRA-ILA posted a meme on Facebook asserting that \"Levi Strauss turns their back on Second Amendment supporting customers\":", "It's true that Levi Strauss did announce in September 2018 they would be partnering with Everytown for Gun Safety, a non-profit organization that advocates for gun control measures and was founded and is heavily funded by Michael Bloomberg.", "However, the accounts highlighted above included subjective (and sometimes misleading) characterizations of the company's efforts rather than objective facts. For example, Levi Strauss CEO Chip Bergh wrote that the company was \"stepping up [their] support for gun violence prevention,\" not that they were working to \"attack gun rights.\" The latter characterization came from LifeZette and the NRA, not Levi Strauss itself.", "Similarly, the NRA's Facebook meme claimed that the company had \"[turned] their back on Second Amendment supporting customers,\" but none of the actions announced in September 2018 related specifically to customers rather than to the issue of gun violence in general. (In 2016, the company requested that customers not bring firearms into their stores as a safety measure.)", "Finally, LifeZette wrote that Levi Strauss would be donating money towards \"anti-Second Amendment activities,\" but that is not at all how the project was characterized by Levis Strauss themselves, whose CEO stipulated that he did not favor repealing the Second Amendment.", "In a blog post on 4 September 2018, Levi Strauss announced three actions in support of gun violence prevention:", "1. The Safer Tomorrow Fund: We’ve established this fund to direct more than $1 million in philanthropic grants from LS&Co. over the next four years to fuel the work of nonprofits and youth activists who are working to end gun violence in America.", "2. Everytown Business Leaders for Gun Safety: We are partnering with Everytown for Gun Safety and executives from the business community, including Michael Bloomberg, to form a coalition of business leaders who believe that business has a critical role to play and a moral obligation to do something about the gun violence epidemic in this country.", "3. Employee Support: We are doubling our usual employee donation match to organizations aligned with our Safer Tomorrow Fund. Additionally, we’re encouraging employees to utilize their five hours a month in paid volunteer time to get more politically active.", "In an op-ed column for Fortune magazine, Bergh addressed the potential concerns of gun-owning customers and stressed that he was not advocating getting rid of the Second Amendment and did not believe gun owners were irresponsible:", "You may wonder why a company that doesn’t manufacture or sell guns is wading into this issue, but for us, it’s simple. Americans shouldn’t have to live in fear of gun violence. It’s an issue that affects all of us -- all generations and all walks of life.", "So today, on top of our previous actions, Levi Strauss & Co. is lending its support for gun violence prevention in three new areas.", "I know that Americans, including many of our own consumers, employees, and other partners, hold a wide spectrum of views related to guns. I’m not here to suggest we repeal the Second Amendment or to suggest that gun owners aren’t responsible. In fact, as a former U.S. Army officer, I took a solemn oath to support and defend the Constitution of the United States. But as retired four-star general Michael Hayden once said, “There are some weapons out there that frankly nobody should have access to. And actually, there are some people out there who should never have access to any weapons.”", "We can’t insulate ourselves from every threat. We can’t “harden” every place we gather -- whether it be our schools, workplaces, shops, churches, or entertainment venues. But we can take common-sense, measurable steps -- like criminal background checks on all gun sales -- that will save lives.", "On the whole, the claims made by the NRA and certain conservative web sites about Levi Strauss & Co's newly-announced gun control activities were largely accurate and based on real announcements made by the company. However, these reports were colored, and at times distorted, by subjective characterizations and misleading descriptions of what Levi Strauss had actually announced.", "National Rifle Association, Institute for Legislative Action.   \"Levi's Teams with Billionaire Michael Bloomberg to Attack Gun Rights.\"\r\n    7 September 2018.", "LifeZette.   \"Levi Strauss Teams with Billionaire Michael Bloomberg to Attack Gun Rights.\"\r\n    9 September 2018.", "Ho, Catherine.   \"Inside the Bloomberg-Back Gun Control Group's Effort to Defeat the NRA.\"\r\n    The Washington Post.   20 June 2016.", "Bergh, Chip.   \"Levi Strauss CEO: Why Business Leaders Need to Take a Stand on Gun Violence.\"\r\n    Fortune.   4 September 2018.", "Levi Strauss & Co.   \"Ending the Gun Violence Epidemic in America.\"\r\n    4 September 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]