["About this rating", "Donald Trump donated land to the state of New York in 2006, but it was largely unused and officially closed in 2010 after budget cuts. The land is now considered a “passive park,” which means it is not maintained and has no amenities.", "The park does not exist on the New York state parks website, is undeveloped, and has officially been closed since 2010, even though signs advertising its presence remain in place.", "North of New York City, between Putnam and Westchester counties, lies a patch of land covered in brush and brambles that is advertised by signs around it as the Donald J. Trump State Park.", "The “park” itself displays little — the parking lot is a patch of gravel with a sign telling visitors to beware of ticks, there are no restrooms, places to sit, or trash cans. There is simply an empty field. We learned that the area is no longer considered a functional park.", "The land’s relationship with the incumbent U.S. President Donald Trump began in 1998 when he bought it from a real estate holding company for $2 million. He planned to make it into a golf course but soon withdrew those plans, blasting local politicians for holding up necessary permits. In 2006, he donated the land to the state government, saying, “I hope that these 436 acres of property will turn into one of the most beautiful parks anywhere in the world.” That year he wrote the donation off in his taxes, reporting non-cash charitable contributions of $34 million.", "But in 2010 the park was officially closed due to budget cuts. As of writing this, the park is not listed on the official website for New York’s state parks. Over the years legislators have tried to rename the land, which has been designated as a “passive park” by the state. But renaming efforts have stalled in part due to Trump’s demand in the donation contract that the land “bear a name which includes Mr. Trump’s name […] prominently displayed at least at each entrance to each property.”", "Dan Keefe, public information officer for the New York State Office of Parks, Recreation and Historic Preservation, said that in 2018 the state actually spent $385,000 on improvements to the park, including demolishing an old residential property and a swimming pool and installing two small parking lots. \"It is managed as an undeveloped, passive park — to preserve open space and provide low-impact recreation such as hiking and birdwatching,\" Keefe said. Sometimes people walk their dogs, or exercise in the area.", "Given that the land is technically a “passive” park managed by the state, only small changes have been made to it over the years. But because it is officially closed and hardly functional, we rate this claim as a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]