["The image was posted on Facebook here on November 22, 2020.", "The photo shows gas station workers installing a banner with Indonesian-language text that translates to English as: “[Special to Non-Muslims] FREE 2 litres of FUEL for those who recite the shahadah.”", "Shahadah is the Muslim profession of faith and is recited by those who convert to Islam.", "The image was also published with a similar claim on Facebook here, here and here.", "The claim, however, is false.", "A reverse image search on Google found that the image was doctored. The original photo was published here on an Instagram account called @newdramaojol.id on July 2, 2019.", "A post shared by NEWDRAMAOJOL.ID (@newdramaojol.id)", "The banner seen in the photo says: “EVERY FRIDAY FREE 2 L OF FUEL FOR CUSTOMERS WHO READ TWO JUZ’ OF THE KORAN.”", "The post’s Indonesian-language caption states “Every Friday. Free 2 litres of fuel at Kampir-Bulu gas station in Temanggung.”", "Juz’, or juz-un in Arabic, is one of the 30 equal parts of the Koran.", "Temanggung is a district in Indonesia’s Central Java province.", "The gas station’s location on Google Map can be seen here and its Instagram account here.", "Gas station supervisor Jerri Utomo confirmed to AFP via WhatsApp on November 25, 2020, that the original photo was taken at his station.", "He said the banner showed a promotional programme in the past that “was launched in 2019 and was only available for some days”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the genuine photo on Instagram (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]