["About this rating", "As U.S. President Donald Trump faced impeachment following the deadly Capitol insurrection on Jan. 6, 2021, a video of a Texas pastor circulated widely online alleging that anonymous sources told him Trump would soon declare \"martial law\" — the temporary military takeover of civil functions such as policing and courts.", "Rev. Wade McKinney, who leads a ministry in rural eastern Texas, used Facebook Live to stream himself talking in a vehicle for roughly 22 minutes on Jan. 9, and that video spread rapidly on YouTube and other platforms in the following days. In the footage, which Snopes obtained via McKinney's Facebook page before it was permanently removed, he said:", "I have got a lot of contacts the lord has helped me build over the last few years, and those contacts are people who have given me intelligence and given me information that has to do with our nation and it's future, so I could use it for Bible prophecy teaching. [...]", "We are looking imminently — and when I say imminently, I'm talking about the next two or three days — we're looking at a martial law being declared. This is coming straight from my contacts in D.C., ya'll. We are going to see martial law declared. What level, what degree of martial law? Whatever they have to do to bring things under a corrective mode. So, basically, what I'm trying to tell you is, you need to be prepared for there to be a martial law declaration.", "McKinney also claimed Trump's opponents in government \"are going to be brought down\" in some \"house cleaning\" and that the rest of America needed to prepare for that event. He urged viewers to secure cash, food, and supplies, such as fuel tanks for vehicles and bullets for gun owners, and develop communication plans should cell service supposedly stop.", "\"It's the president's last effort,\" McKinney said of the alleged event, while making several other baseless claims regarding military efforts, the 2020 presidential election, and the Capitol insurrection. \"We are in a battle for everything that God intended for this country.\"", "In short, the pastor alleged that Trump was preparing to invoke martial law and use military force to arrest his political opponents before Biden's inauguration on Jan. 20.", "First, to investigate those claims, Snopes reached out to McKinney to learn more about his alleged sources in Washington, D.C., and unidentified military bases — people he did not name but said told him about the president's purported plans. The pastor did not respond to us. We will update this report when, or if, he returns our message.", "It is common practice for reputable news organizations to report information from credible people who requested anonymity out of fear of repercussions for speaking publicly and that journalists have cross-referenced with other sources. McKinney did not explain why, or under what circumstances, his alleged sources asked not to be named, nor did he outline any efforts to investigate their truthfulness.", "Now, let us explain the nature of the pastor's allegations. No federal statute nor the Constitution defines martial law.", "However, other executive authorities — such as those provided in the Insurrection Act — give presidents the power to deploy the military or the National Guard in U.S. cities, whether due to terrorist attacks, natural disasters, or other safety issues. Over the course of history, presidents have relied on martial law to order military forces to take the place of civilian governments, like in Hawaii during World War II.", "The Brennan Center for Justice said of martial law:", "It describes a power that, in an emergency, allows the military to push aside civilian authorities and exercise jurisdiction over the population of a particular area. Laws are enforced by soldiers rather than local police. Policy decisions are made by military officers rather than elected officials. People accused of crimes are brought before military tribunals rather than ordinary civilian courts. In short, the military is in charge. [...]", "To some observers, a deployment of troops under the Insurrection Act might look and feel very much like martial law. Given the degree of confusion over the term, some within the media or the government itself might even call it martial law.", "Trump did not invoke the Insurrection Act before or after he encouraged his supporters to try to block a ceremonial vote to affirm Biden's presidency and an angry mob broke into the Capitol on Jan. 6.", "Additionally, he had not declared martial law as of this writing, and no credible evidence showed that he was preparing to do so.", "If, like McKinney alleged, people within the White House or Department of Defense wanted Americans to know that Trump was preparing to make the declaration, history shows they would not turn to one pastor living in rural Texas to spread the important announcement. Instead, they would use official communication methods, such as a news conference or public statement, to broadcast it widely.", "Also, Americans should rely on emergency management departments for trusted information on when, and how, they must prepare for natural or human-caused emergencies. None supported McKinney's recommendations to stock up on food and supplies prior to Biden's inauguration.", "Nonetheless, thousands of National Guard members were patrolling Washington, D.C., in the days between the Jan. 6 insurrection and Biden's swearing-in ceremony, and the FBI warned law enforcement agencies nationwide of armed protests at all 50 state capitols.", "But all of those efforts by military forces and law enforcement agencies were unrelated to martial law and the Insurrection Act, and they were not a scheme by Trump to arrest his political opponents during the final days of his term. Rather, they were strategies to try to preserve government properties and safety in the event of more election violence.", "In sum, since no evidence existed to support McKinney's assertion that credible sources said Trump was preparing to invoke martial law, we rate this claim \"False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]