["The three-minute, eight-second video, which appears to show people running away from a gunman, was published here on Facebook on October 26, 2019, here. The clip has been viewed more than 2,000 times.", "The post's caption states: “#gunattack #amsterdam #holland Gun attack at shopping Mall at Amsterdam, Holland this morning.”", "Below is a screenshot of the misleading Facebook post:", "The video was also published on Facebook here, here and here; on Twitter here, here and here; and on YouTube here and here with a similar claim.", "The claim is false; the video actually shows anti-terror police in Germany conducting a drill in Nuremberg Central Station in October 2019.", "The video's German-language subtitles translate to English as: “Anti-terrorist exercise at the main station\n\t“First security forces are on the move\n\t“The situation is still unpredictable\n\t“A second assassin appears\n\t“... and gets shot\n\t“Forces ensure the situation\n\t“Minister of the Interior of the state of Bavaria Joachim Herrmann”.", "A keyword search found the same video published here on Facebook on October 20, 2019. The video has been embedded below.", "The post’s caption translates to English as: “Screams, shots, explosions: Until well into the early morning hours ran in the Nuremberg main station a large-scale anti-terrorism exercise of the police. (Video: Alexander Brock)”.", "Below are two screenshot comparisons between the video in the misleading posts (L) and the video in the German-language Facebook post (R):", "A keyword search for an anti-terrorism exercise in Germany subsequently found this October 15, 2019, video published by Russian state-owned media outlet RT. The video has been embedded below.", "The video’s title states: “Germany: Nuremberg train station shuts down for massive anti-terror exercise.”", "The first two paragraphs of the video's description state: “Some 1,500 staff, including 300 police officers, took part in a massive anti-terror exercise at Nuremberg's central train station on Tuesday night.", "“The officers took turns playing a militant carrying out an attack at the train station, which was closed for the occasion, or the police response team, as seen in footage from the exercise.”", "Nuremberg is a city in the southern German state of Bavaria.", "Below are three screenshot comparisons of the video in the misleading posts (L) and the RT video (R):", "Joachim Herrmann, Minister of the Interior of the state of Bavaria, is shown speaking to journalists in the final segment of the video.", "The video corresponds with a Google user’s image tagged here at Nuremberg Central Station on Google Maps.", "Below is a screenshot of the photo on Google Maps:", "The same exercise was reported on by German public-service radio and television broadcaster Bayerischer Rundfunk here on October 16, 2019.", "The same video was debunked by AFP Hong Kong here after it was circulated with a misleading claim that it shows police officers shooting vandals at a railway station.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]