["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After a federal judge in Texas ruled against President Barack Obama’s actions potentially shielding thousands of unauthorized residents from deportation, the Texan who led the court challenge described Obama as a key helper for the states challenging the Democratic president’s authority.", "Gov. Greg Abbott, the Republican who in 2014 launched the legal challenge joined by more than 20 other states when he was still the attorney general of Texas, told Sean Hannity of Fox News: \"I think we will win all the way for one simple reason, and that is: The man you just had on the screen, Barack Obama, is our star witness.\"", "Abbott added in the Feb. 17, 2015, interview: \"22 times Barack Obama said he did not have the authority to implement this type of measure. And then the day after he signed this into law, he said, quote, ‘I just changed the law.’ Those words alone show that he violated the Constitution and violated federal law.\"", "We learned of Abbott’s quotation of Obama and his \"22 times\" count from a Breitbart.com news story, which also noted the president’s exact wording had previously been, \"I just took an action to change the law,\" and that Obama made that comment five days after the adminstration’s action was announced, not the next day.", "We looked into Abbott’s count of 22 and his quotation, ultimately finding his statement close to completely so.", "But we started by revisiting recent history.", "Obama and Abbott announcements", "In November 2014, Obama declared the administration’s plans to forswear the deportation of unauthorized residents meeting certain conditions, telling the American people: \"If you’ve been in America for more than five years; if you have children who are American citizens or legal residents; if you register, pass a criminal background check, and you’re willing to pay your fair share of taxes — you’ll be able to apply to stay in this country temporarily without fear of deportation. You can come out of the shadows and get right with the law.\"", "Shortly before Obama detailed his 2014 moves, PolitiFact in Washington, D.C., found False the Democratic president’s statement that his position hadn’t changed on using executive authority to address immigration. Notably, the administration in June 2012 demonstrated a willingness to apply its discretionary powers by issuing a \"deferred action\" directive that immigration officials not deport young immigrants who had not otherwise run afoul of the law. The move potentially shielded hundreds of thousands of residents under age 30. Critics called the move an abuse of authority. Proponents said it was in keeping with the yet-to-pass DREAM Act providing a path to citizenship for children brought to the U.S. by immigrants not legally permitted to live here.", "Fast-forward to Dec. 3, 2014; that’s when Abbott announced Texas and other states were challenging the latest Obama move in federal court. And what the state filed that day included a version of the Obama quotation we’re looking into: \"What you’re not paying attention to is, I just took an action to change the law.\" Speaking to reporters, Abbott commented: \"The president’s job is to execute the laws, not de facto make law by suspending parts of laws that are passed by Congress.\"", "We asked Abbott to elaborate on his claim to Fox News and didn’t hear back.", "But we recognized he’d echoed another Texan’s criticism. In December 2014, U.S. Rep. Michael McCaul, R-Austin, drew a Mostly True from us after saying Obama had previously \"said over 20 times he did not have the legal authority\" to act as he did on immigration. McCaul had relied on a list of Obama quotations posted online by House Speaker John Boehner, which we found partly flawed, making McCaul’s count too high. In the end, still, we confirmed nearly 15 instances from 2010 into 2014 of Obama saying he couldn’t do more to spare immigrants from deportation absent congressional action.", "White House response", "Asked about McCaul's claim at the time, White House spokesman Eric Schultz responded by email, pointing out a Nov. 19, 2014, memo from the federal Office of Legal Counsel stating the president’s actions fit within the government’s discretionary powers. The office, in the Justice Department, is responsible for providing authoritative legal advice to the president and executive-branch agencies.", "It’s a challenge to characterize the president’s remarks. For instance, Abbott’s legal filing included Obama’s Sept. 28, 2011, response to a law student’s request that he do his part to enable students who immigrated to the U.S. with their parents to become legal residents.", "As noted in the legal filing, Obama replied: \"I just have to continue to say this notion that somehow I can just change the laws unilaterally is just not true. We are doing everything we can administratively. But the fact of the matter is there are laws on the books that I have to enforce.\" The legal filing ends the quotation there, yet Obama continued talking and said he retained enforcement discretion. \"Now, what we can do is to prioritize enforcement,\" the president said, \"since there are limited enforcement resources, and say we’re not going to go chasing after this young man or anybody else who’s been acting responsibly and would otherwise qualify for legal status,\" if laws were changed.", "We counted 15 Obama quotations--not 22--in the Texas-led legal filing supportive of Abbott’s point, with nearly all of them previously tick-tocked in our check of McCaul. For more analysis of relevant details, see our rundown here.", "Did Obama say he personally ‘changed the law?’", "Next, we searched the White House website and isolated what Obama said in a Chicago speech Nov. 25, 2014 after at least one audience member interrupted his remarks to urge a complete end to deportations.", "Here’s what Obama replied, according to the government transcript:", "\"I've heard you. But you’ve got to listen to me, too. All right? (Applause.) And I understand you may disagree. I understand you may disagree. But we've got to be able to talk honestly about these issues. All right?", "Now, you're absolutely right that there have been significant numbers of deportations. That's true. But what you're not paying attention to is the fact that I just took action to change the law.  (Applause.) So that's point, number one.\"", "Obama went on: \"Point number two, the way the change in the law works is that we're reprioritizing how we enforce our immigration laws generally. So not everybody qualifies for being able to sign up and register, but the change in priorities applies to everybody.\"", "Our ruling", "Abbott said that 22 times, Obama \"said he did not have the authority to implement this type of\" anti-deportation \"measure. And then the day after he signed this into law, he said, quote, ‘I just changed the law.’\"", "Like McCaul, Abbott overstates the number of confirmed instances of Obama indicating he couldn’t independently do more to prevent deportations. He also left out some of what Obama said about changing the law and was slightly off on the president’s timing. With these clarifications, though, Abbott’s statement is spot-on.", "We rate the claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"Abbott: ‘Obama Is Our Star Witness’ In Amnesty Suit,\" Breitbart.com, Feb. 17, 2015", "News story, \"Abbott leads 17-state suit against Obama immigration order,\" Austin American-Statesman, Dec. 3, 2014", "Truth-O-Meter article, \"Michael McCaul says Obama said 'over 20 times' he lacked authority to act alone on immigration,\" PolitiFact Texas, Dec. 5, 2014", "Backup document for Truth-O-Meter article, \"Statements by President Obama Suggesting He Didn’t Have Authority to do More on Immigration Policy 2010-2014,\" PolitiFact Texas, Dec. 5, 2014", "Blog post, \"22 Times President Obama Said He Couldn’t Ignore or Create His Own Immigration Law,\" House Speaker John Boehner, Nov. 19, 2014", "Email, Eric Schultz, deputy press secretary, White House, Dec. 2, 2014", "Document, \"Remarks by the President at an Open For Questions Roundtable,\" the White House, Sept. 28, 2011", "Document, \"Remarks by the President on Immigration -- Chicago, IL  Copernicus Center,\" the White House, Nov. 25, 2014 (accessed Feb. 18, 2015)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]