["About this rating", "In April 2016, the issue of transgender bathroom usage dominated news and social media, mostly due to the passage of HB2 in North Carolina and Target's policy allowing people to use bathrooms that best match their gender identity.  Among those making headlines were lawmakers in the city of Oxford, Alabama.", "In late March 2016, lawmakers in North Carolina passed the sweeping HB2 (also known as the \"bathroom bill\"), which nullified a Charlotte ordinance affording protections to gay and transgender residents. The controversial legislation immediately became a matter of national discussion, and fallout extended well across the United States. On 19 April 2016, retailer Target responded to the law by instituting a policy allowing transgender employees and customers to use the restroom that best matched their gender identity, and a Kroger location in Georgia posted a sign to put transgender shoppers at ease.", "On 27 April 2016, the national debate took another turn when a city in Alabama responded to Target's policy:", "#CallItOut: Oxford Alabama City Council approves horrific and unprecedented anti-transgender law https://t.co/QNMow4Lg7e via @HRC", "— HumanRightsCampaign (@HRC) April 27, 2016", "The Associated Press reported that Oxford's ordinance prohibits individuals from using bathrooms that do not correspond to the gender listed on their birth certificates. Those who violate that ordinance potentially face fines and jail time for the misdemeanor offense:", "People in an Alabama city who use public restrooms intended for a gender other than what is listed on their birth certificate will be punished under an ordinance officials passed this week.", "Oxford City Council President Steven Waits was quoted by news media outlets as saying the ordinance was a response to a new policy announced by Target Corp. last week allowing transgender employees and shoppers to use the restroom that matches their gender identity. There is a Target store in the Oxford Exchange shopping center ... The Oxford ordinance makes it a misdemeanor for a person to use a restroom that doesn't correspond with their gender at birth. Violators of the ordinance could face a $500 fine or up to six months in jail.", "Oxford Police Chief Bill Partridge said the law will be enforced like any other city ordinance, such as noise violations or public indecency.", "\"If somebody sees something that makes them uncomfortable, they would call the police,\" he was quoted by Al.com as saying. \"If the person is still there when the officer arrives, the officer has to witness the crime. Then we take down the person's information, and the person who reported it has to sign out a warrant.\"", "The Anniston Star reported that the ordinance was passed on 26 April 2016, and its provisions apply within the city's jurisdiction. Oxford's council president said the measure was enacted in response to a large number of complaints about Target's policy:", "The new law, approved unanimously by the council’s members, restricts a person’s use of public bathrooms and changing rooms to the facilities designated for use by those of the gender listed on his or her birth certificate. The law applies within both the city’s limits and police jurisdiction.", "After members approved the new city ordinance, Council President Steven Waits read from a prepared statement ... Waits said he and the council sought the law “not out of concerns for the 0.3 percent of the population who identify as transgender,” but “to protect our women and children.”", "He said the measure isn’t meant to be discriminatory, and comes in direct response to the bathroom and changing-room usage policy put forth by supermarket chain Target, which has a store at Oxford’s Exchange shopping center ... Waits said he’s received an “overwhelming” number of complaints from city residents regarding the company’s policy since it was announced.", "Under the new law, alleged violations must be reported by a witness or committed in front of a police officer to be prosecutable ... Those found to have violated the law would be fined $500, or sentenced to six months in jail.", "Waits spoke about the ordinance on 27 April 2016:", "In the 27 April 2016 video, Waits maintained that Oxford's new bathroom ordinance was passed \"not out of concerns for the 0.3 percent of the population who identify as transgender,\" but to protect women and children from predators and deviants. Critics of the law objected to the latter remarks, noting that sexual misconduct is already illegal (in bathrooms and elsewhere) under existing laws.", "Gordon, Michael et al.     \"North Carolina’s Newest Law Solidifies State’s Role in Defining Discrimination.\"\r\nCharlotte Observer.     26 March 2016.", "Thornton, William.     \"Oxford Passes Transgender Bathroom Ordinance With Threat Of $500 Fine, 6 Months In Jail.\"\r\nAL.com.     26 April 2016.", "Tyler, Zach.     \"Oxford Council Rebukes Target Bathroom Policy With New Ordinance.\"\r\nThe Anniston Star.     27 April 2016.", "Associated Press.   \"Alabama City Passes Transgender Bathroom Ordinance.\"\r\n27 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]