["As Charlie Crist has been attacked for flip-flopping on an array of issues, he argued during an April 20 TV interview that one topic he has been consistent on is abortion.", "While Crist enthusiastically admitted he changed his view on gay marriage and now supports it, he argued with interviewer Michael Williams of WPTV about whether he changed his views on abortion.", "Williams: \"In the heat of the campaign you were once quoted ‘listen I’m pro-life, I’m pro-gun,’ on and on and on. You changed your view on abortion as well.\"", "Crist: \"That’s not true. No. I am pro-life -- by my definition.\"", "Williams: \"But you changed your mind on abortion restrictions in the state of Florida. That’s a matter of record....\"", "Crist: \"I am pro-life. And what I mean by that is I am for life. I think most of us are for life. And I think that’s very important to state because even though I am pro-life, which I mean for life, (it) doesn’t mean that I want to tell a woman what to do with her body, and I never have. Even as a Republican governor I vetoed the ultrasound bill on women ... \"", "Williams: \"The ultrasound bill, yes, but on the larger issue in the prior incarnation politically of Charlie Crist, you supported abortion restrictions outside of the ultrasound bill. That's a matter of record. You have changed the nuance or your view there.\"", "Crist: \"No, I haven’t. That’s not true.\"", "Crist then said he voted against a bill for a waiting period for women who wanted an abortion when he was a state senator in the 1990s.", "A couple of days later, at a meeting of the Capital Tiger Bay Club in Tallahassee, Crist repeated, \"I also don’t want to tell any woman what to do with her body. I never have.\"", "Crist’s comments left viewers with the impression that he hasn't changed his views on abortion restrictions. But does his record back that up?", "Crist on abortion in the 1990s and 2006 race", "We’ve been tracking Crist’s views on abortion for some time now. Overall, he’s been all over the map on the issue, calling himself both \"pro-choice\" and \"pro-life\" in the past.", "In 1992, when he ran for the state Legislature, Crist said he was \"pro-choice\" but opposed state-funded abortion. Crist won that race.", "In 1995, Crist was a Republican state senator from St. Petersburg serving on a Senate health care committee. As he mentioned in the recent interview, Crist voted against a bill that would have required a 24-hour waiting period for women to obtain an abortion. The 3-3 vote meant that the bill failed. \"I generally don't like the government telling people what to do,\" Crist said, according to the Tampa Bay Times. \"I believe in individual rights and freedom. That's why I'm a Republican.\"", "But in 1996, the health care committee approved a waiting period bill on a 5-3 vote, after an amendment offered by Crist to restrict the bill to women younger than 18. News reports at the time said Crist favored abortion rights but wanted minors to be adequately counseled. The bill failed in the House.", "In March 1998, Crist took a position against abortion when he voted to override Gov. Lawton Chiles’ veto of a bill that banned what opponents call a \"partial birth\" abortion, a late-term procedure. The House and Senate successfully overrode the veto.", "When he was running for the U.S. Senate for the first time in 1998, Crist said in a questionnaire for the Times: \"I am pro-choice, but not pro-abortion. I believe that a woman has the right to choose, but would prefer only after careful consideration and consultation with her family, her physician and her clergy; not her government.\"", "When debating his Democratic opponent, incumbent Sen. Bob Graham, Crist was asked if he would support a constitutional amendment banning abortion.", "\"No, I would not,\" Crist said. \"I think this is a very personal decision. And I think it is a decision that a woman should make and have the right to make after consulting with her family, her physician and her clergy but not her government.\"", "During Crist’s 2006 race for governor he again reiterated, \"I don't think that politicians ought to put themselves in the place of physicians.\"", "However, he also told a priest in Pensacola that he would sign a bill outlawing abortions except when the mother’s life was at stake. But then he told an AP reporter that he would only sign such a bill if it included exceptions for rape and incest.", "As Crist and then CFO Tom Gallagher competed in a Republican primary, Crist launched an attack ad calling Gallagher \"pro-choice\" and referring to himself as \"pro-life.\"", "Later, in the general election debate against Democrat Jim Davis, Crist said: \"I'm pro-life on this issue, but I also understand that it's very important to respect the views of others, and I do,\"' Crist said. \"I don't think it's important to change the law. What I do believe is important is that we change hearts and not the law. . . . I'm pro-life and I'm proud of it, but I don't think that I should impose my will on other people as a result of it.\"", "Crist on abortion 2010-14", "In January 2010, Crist’s Republican U.S. Senate campaign released a statement saying he would \"fight for pro-life legislative efforts.\"", "In April, as he lagged in a primary against Marco Rubio, Crist left the Republican Party to become a \"no-party affiliation\" candidate. Weeks later, he vetoed a bill that would have required women seeking abortions to get an ultrasound. He said he found the requirement that women pay for the procedure \"punitive\" and that the measure was \"almost mean-spirited.\"", "Crist lost the Senate race in 2010 and left the governor’s office in January 2011. In November, he announced he would challenge Republican Gov. Rick Scott as a Democrat.", "Crist spokesman Kevin Cate told PolitiFact that \"Charlie Crist doesn't believe it's government's role to tell women what they can or can't do with their own bodies. That's always been his position and always will be.\"", "On his campaign website, Crist states: \"Charlie supports a woman’s right to make her own health care decisions — as Governor, he vetoed a measure that required women seeking an abortion to have an ultrasound, a law that Rick Scott signed. Charlie believes that government should stay out of personal health decisions between a woman and her doctor.\"", "Our ruling", "Crist said in a TV interview that he hasn’t changed his view on abortion restrictions. We find that misleading -- unless you're talking about having views that have always been difficult to pin down.", "Even before he switched parties, Crist voted both for and against abortion restrictions: In the 1990s, he opposed a waiting period for adults but also backed restrictions that included a waiting period for minors and a ban on partial birth abortion. In 2010, he vetoed a bill to require women to undergo ultrasounds before they have an abortion.", "He's also called himself both \"pro-life\" and \"pro-choice,\" and he seems comfortable offering up his own personal definitions of the terms.", "If he's shown a kernel of consistency, it's that he often -- but not always -- talked about being personally \"pro-life\" but wanting to respect the right of women to make decisions with their doctors and without government interference.", "Interestingly, this is not a case of a politician changing his stance after switching parties. Crist has always been all over the map on abortion. On balance, we rate his claim Mostly False.", "Charlie Crist campaign website, Women’s rights, Accessed April 23, 2014", "Tampa Bay Times, \"Charlie Crist blasts Rick Scott in speech as a ‘disaster’ for Florida,\" Feb. 22, 2014", "PolitiFact, \"Charlie Crist has called himself ‘pro-life’ and ‘pro-choice’ and backed certain restrictions while opposing others,\" Feb. 7, 2014", "PolitiFact, \"After voting for ban, Charlie Crist now backs gay marriage,\" May 9, 2013", "O’Reilly Factor, \"Charlie Crist enters the ‘No spin zone,’\" Feb. 4, 2014", "Miami Herald, \"The gender factor,\" Oct. 25, 1992", "Marco Rubio campaign, Clip of Charlie Crist in Senate debate, 1998", "Tampa Bay Times, \"Veto override clears Senate,\" March 12, 1998", "Tampa Bay Times, \"The vote stalls abortion counseling measure,\" April 19, 2005", "Tampa Bay Times, \"Abortion waiting period clears senate panel,\" March 29, 2006", "Tampa Bay Times, \"Crist’s stance on abortion still hazy,\" Aug. 18, 2006", "Miami Herald, \"Crist pro-life stance in doubt,\" Oct. 26, 2006", "Tampa Bay Times, \"Storm clouds darken for Crist,\" Jan. 9, 2010", "Miami Herald, \"Abortion questions plague Crist campaign,\" Aug. 26, 2012", "PolitiFact, \"Charlie Crist says GOP platform bans abortion even in cases of rape,\" Aug. 27, 2012", "PolitiFact, \"Lenny Curry says Charlie Crist and Todd Akin hold the same abortion position: No exception except life of mother,\" Dec. 20, 2012", "PolitiFact, \"Charlie Crist was  pro-life, pro-gun and anti-tax, says George LeMieux,\"Sept. 6,  2012", "PolitiFact, \"Marco Rubio fires back at Charlie Crist attacks,\"Oct. 24, 2010", "Interview, Kevin Cate, spokesman for Charlie Crist campaign, April 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]