["About this rating", "On 10 February 2019, the Facebook page \"Friends of Farrakhan\" posted an old photograph that supposedly showed NFL quarterback Joe Namath's kneeling during a pre-game performance of the national anthem. A piece of text overlaid on the image claimed that, \"All the players used to kneel for the National Anthem.\" And the caption provided by the Facebook page, \"White History 101,\" insinuated that kneeling during the \"Star-Spangled Banner\" wasn't an issue until a black quarterback, Colin Kaepernick, picked up the practice in 2016 in protest of police brutality and racial inequality:", "This is a genuine photograph of Namath's kneeling on the sidelines of a football field. However, this picture has nothing to do with the national anthem, patriotism, or protesting.", "This photograph was taken on 11 November 1973 and shows Namath and Al Woodall on the sidelines during the third quarter of the New York Jets game against the New England Patriots. The photograph was captured by Barton Silverman of the New York Times and is available via the \"Lively Morgue\" Tumblr page, a website set up by the New York Times to showcase their archive of photographs:", "Nov. 11, 1973: “Joe Namath, in furs, and Al Woodall, who came out of yesterday’s game with an injured elbow.” Namath stood on the sidelines as his team played, a shoulder injury keeping him out of uniform. The Jets won the game without him. Victories, the reporter wrote, “come so infrequently these days that each one should be treated with awe and reverence.” Photo: Barton Silverman/The New York Times", "The Lively Morgue also provided a glimpse at the back of this image, which showed various notes, time stamps, and newspaper clippings. Although it is partly obscured by a newspaper clipping, you can see that the original caption for the image noted that this photograph was taken during the 3rd quarter (not during the national anthem) after Woodall was taken out of the game due to an injury:", "A contemporary news report regarding this 11 November 1973 football game confirmed that Woodall started the game in place of an injured Namath but left the game sometime during the second quarter due to an injured elbow. As this image shows the two injured quarterbacks on the sidelines, it's clear that this image was taken long after the pre-game ceremonies.", "In short, this photograph does not show Namath's kneeling during the anthem but rather an innocuous moment in which two injured quarterbacks watched their teammates play a football game.", "Namath has offered his two cents on Kaepernick's kneeling protest. Namath appeared on Fox & Friends in October 2017 and said he agreed with the motivation behind the protests, in which players kneel during the anthem, but added that owners had the right to object to their players' actions:", "“Going back to what Colin Kaepernick initially did, it was to point out some injustice that’s being done to the black race,” Namath said, “some of these dash cams and shootings that were done to unarmed people. He was reaching out to try to get it more investigated. So that’s where this oppression thing comes in.”", "Namath’s reference to oppression is a response to Mike Ditka’s assessment that there hasn’t been oppression in this country “in the last 100 years.” At the end of the segment, Namath also encouraged Ditka to “look up the definition of oppression.”", "[...]", "While Namath may support the message behind the protest and the players’ method of expression, he believes NFL owners have the right to tell players where they are and aren’t allowed to protest.", "“Ownership has ownership,” Namath explained. “If somebody starts walking through here carrying a sign, what are the powers that be at Fox going to say to you? ‘Excuse me. Go do that somewhere else. Don’t do it in the workplace.’”", "San Francisco Examiner.   \"N.Y. Jets 33, N. England 13.\"\r\n    12 November 1973.", "Gartland, Dan.   \"Joe Namath Supports NFL Players’ Motivations for Protests, but Unsure About the Venue.\"\r\n    Sports Illustrated.   10 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]