["You are twice as likely to get into the University of Oxford as a white applicant (24%) than a black applicant (12%).", "Correct, for UK undergraduate applicants between 2015 and 2017.", "A quarter of Oxford colleges did not admit a single black student in a whole year group at least once between 2015 and 2017.", "Correct, for undergraduate students from the UK who took up their place between 2015 and 2017.", "Eight Oxford colleges are less than 1% black.", "Correct, for undergraduate students from the UK who took up their place between 2015 and 2017.", "BME students make up 17.9% of all British Oxford undergraduates. That’s pretty close to the percentage of BME people among 17-24-year-olds in England and Wales – 18.3%.", "Correct, for undergraduate students from the UK who took up their place in 2017, and looking at those in the 2011 census who would be between 17 and 24 today.", "“You are twice as likely to get into @UniofOxford as a white applicant (24%) than a black applicant (12%). Why? 1/4 Oxford colleges did not admit a single black student in a whole year group at least once between 2015-17. 8 colleges less than 1% black. Why?”", "David Lammy MP, 23 May 2018", "“BME students make up 17.9% of all British Oxford undergraduates. That's pretty close to the percentage of BME people among 17-24-year-olds in England and Wales – 18.3%.”", "Toby Young, 23 May 2018", "Both David Lammy and Toby Young are both broadly correct in their claims, yet they are making contrasting points about how accessible the University of Oxford is for black and minority ethnic students.", "The exact figures vary depending on which year you look at, whether you’re talking about the overall student population or applicants’ relative chances of being accepted, and also which groups in particular you are talking about.", "2017 was the first year (in recent times at least) when Oxford’s UK undergraduate intake had a similar level of black and minority ethnic students to the general population of England and Wales aged 17-24, but black students are still underrepresented.", "Black students who apply to Oxford are less likely to be accepted than white students, and in some colleges make up less than 1% of all students from the UK.", "All figures in this article refer to applicants for undergraduate courses living in the UK.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "16% of black students living in the UK who applied to the University of Oxford in 2017 were offered a place, compared to 26% of white students. Over the last three years, the average is 17% for black students and 27% for white students.", "Not all of these students will necessarily take up their place though. 12% of black students living in the UK who applied to Oxford were admitted for the year 2017/18. 23% of UK-domiciled white applicants were. Over the last three years, the average is 12% for black students and 24% for white students.", "Around 6% of applicants to Oxford living in the UK didn’t declare their ethnicity from 2013 to 2017, so some students will not be included in the figures.", "The University of Oxford says that that “students from BME backgrounds are more likely to apply for the most competitive courses than White students”. 41% of black students from the UK who applied to Oxford between 2015 and 2017 applied for medicine or law, which Oxford describes as “highly competitive”. In comparison around 12% of white students applied for these courses.", "For these courses, white students are significantly more likely to be made an offer or admitted than black students. 11% of black law applicants from 2015to 2017 received an offer, and 6% were admitted. 23% of white applicants received an offer, and 20% were admitted. For medicine, 9% of black students received an offer and 8% were admitted, compared to 22% and 20% respectively for white students.", "Eight of the 29 colleges at Oxford admitted two or fewer black students between 2015 and 2017 (less than 1% of all UK students admitted to the college). This means that in at least one year those colleges can’t have admitted any black students. We don’t know what happened in each of the individual years between 2015 and 2017, so it’s possible there were more colleges who didn’t admit any black students in any given year.", "No college admitted more than seven black students across those three years—again that’s looking at students living in the UK.", "Across the university black students made up 1.9% of all UK students admitted in 2017.", "Black and minority ethnic students made up around 18% of Oxford’s 2017 UK intake. That’s roughly the same as the proportion of 17-24 year-olds in England and Wales who are black and minority ethnic, based on figures from the 2011 census.", "In 2016, 26% of UK students starting an undergraduate degree at all UK universities were black or minority ethnic, compared to 16% at Oxford.", "Applicants to Oxford normally need to get at least three As to be offered a place. Looking at UK students who got three As (or equivalent) at A-level, 20% of students were black or minority ethnic in 2015, compared to 14% of Oxford’s UK intake that year.", "Among black and minority ethnic students, certain groups are more represented than others. 1.9% of Oxford’s UK undergraduates starting in 2017 were black, and 1.7% were Bangladeshi or Pakistani. 6.5% were Asian (not including those who identified as Bangladeshi or Pakistani which Oxford provides separate figures for), and 6.6% had mixed heritage.", "Among the population of England and Wales now aged 17 to 24, around 4% identify as Bangladeshi/Pakistani, 4.5% identify as Asian, 4% identify as Black. This is based on approximations using the 2011 census.", "Update 4 June 2018", "We updated this piece to add more information on the proportions of black and minority ethnic students at Oxford.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]