["About this rating", "If a majority of Republican voters marked their ballots with Trump's name and did not vote for Georgia's Republican U.S. Senate candidates, their Democratic challengers would win; therefore, the write-in protest would undermine Senate Republicans.", "Since Georgia law only allows two candidates per race on ballots in runoffs, and since Trump was not one of them in the Jan. 5 election, he has no legal avenue to secure a Senate seat in this election. Additionally, there's no official space for write-in candidates in the runoffs, so ballots with Trump's name written on them would likely be considered invalid.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In late November 2020, after U.S. President-elect Joe Biden secured the battleground state of Georgia in the presidential election, a social media campaign emerged claiming his opponent, U.S. President Donald Trump, would have a chance to serve in the U.S. Senate if enough people voted for him in the state's upcoming runoffs.", "The Jan. 5, 2021, runoff election between incumbent Republican Sens. Kelly Loeffler and David Perdue and Democrats the Rev. Raphael Warnock and Jon Ossoff will decide whether Republicans or Democrats control the upper chamber at the outset of a Biden administration. Georgia election rules call for runoff races when no candidate exceeds 50% of voter share in either race during the general election.", "But with the hashtag #WriteInTrumpForGA on platforms including Twitter and Parler, an online haven for conservatives, posts attempted to convince Georgia voters to write in Trump's name and elect him to the Senate, even though he was not a candidate.", "\"We need to cover ALL bases in our stop the steal efforts, and one of these is simply utilizing our voice for the GA runoffs and writing in Donald J Trump for senate,\" read one Parler post. \"[We] can maintain a senate majority with TRUMP as the majority leader! We can put a STOP to the democrats!\"", "The underlying message of some posts echoed Trump's attacks on Georgia Republican state officials who oversaw the process for certifying votes in the presidential race. In tweets and emails to supporters soliciting donations, the Trump campaign called on Republican Gov. Brian Kemp and Secretary of State Brad Raffensperger to break state laws governing the democratic process and defy the outcome of the popular vote that awarded Georgia's 16 electoral votes to Biden. He won by fewer than 13,000 votes out of about 5 million cast.", "Some Parler posts obtained by Snopes, such as the ones displayed below, lumped Senate candidates Loeffler and Perdue into that group of Republicans who were not acceding to the Trump campaign's requests to delegitimize Biden's win by spreading baseless allegations that Dominion Voting Systems software had altered votes.", "“The president has basically taken hostage this race,” said Brendan Buck, once a top adviser to former House Speaker Paul Ryan, per The Associated Press.", "In short, some posts wanted Georgia voters to write in Trump's name to supposedly help him win a Senate seat. Meanwhile, others promoted the #WriteInTrumpForGA campaign not to necessarily elect Trump but to \"punish\" Loeffler and Perdue, since participating voters would, in theory, otherwise have voted for the Senate Republican candidates.", "The assumption behind the former approach — that Trump had a realistic chance to serve in the Senate — was false, but the latter reasoning had some validity to it, which we explain below.", "First, though, let us lay out laws governing runoff elections. Georgia is one of 10 U.S. states where statutes require runoff elections when no candidate receives more than 50% of votes in a general election. Per Georgia Code Title 21. Elections § 21-2-501:", "\"In instances where no candidate receives a majority of the votes cast, a run-off primary, special primary runoff, run-off election, or special election runoff between the candidates receiving the two highest numbers of votes shall be held.\"", "That means, per state law, all runoffs in Georgia only allow two candidates (the top two vote-getters in general elections) per race on ballots. So in the Jan. 5 Georgia runoffs, ballots allow voters the options of selecting either Loeffler or Warnock in one race, or Perdue or Ossoff in the other (see the sample ballot below).", "There is no line allocated for a write-in option, no matter if people cast paper ballots or use touch-screen voting.", "Nonetheless, people in theory could still answer the social media campaign's request to write in Trump's name on ballots unofficially, perhaps in the paper's margins or next to the Senate candidates' names.", "But that scribbling would not be an official vote for the sitting president (or anyone) for numerous reasons. Namely, as stated, Trump was not among the top two vote-getters in Georgia's Senate races, so the law does not consider him a viable candidate in the runoffs.", "Additionally, since the ballots do not include an official line for write-in candidates, writing outside of the bubbles for official candidates could force election officials to invalidate the paperwork all together, per laws governing the ballot-counting process. The statutes require poll workers to scan ballots for improper markings or other defects before they feed them into tabulation machines for official vote counts. As a result, spoiled or defective ballots are not legally counted in elections.", "Given that fact, opponents of Trump co-opted #WriteInTrumpForGA in attempt to help Democratic Senate candidates in Georgia. If a significant number of Republican voters wrote Trump on their ballots — and, as a result, election officials had to invalidate their votes under state law — the race's Democratic candidates could reap the benefit, and Republicans could risk losing a Senate majority.", "That communications strategy to convince die-hard conservatives that voting for Loeffler and Perdue would defy Trump's political agenda (cryptically in the name of helping Democrats) manifested in other ways, too.", "An anti-Trump political organization called \"Really American PAC\" was supposedly soliciting donations on ActBlue, a fundraising processor for Democratic campaigns, to pay for the billboards displayed below. At least one Twitter user claimed to have seen one of the signs in real life.", "\"If Trump supporters deliver Perdue and Loeffler a victory, they should be acutely aware that they will be delivering Trump and MAGA a serious political defeat,\" read a statement by the PAC.", "A website, writeintrumpforgeorgiasenate.com, was also part of that tongue-in-cheek campaign effort, per an attorney for an opposing political action group. The website read:", "\"With enough write-ins in the Georgia senate race, we can tilt the balance in Georgia in Trump's favor! If we can do this, we have a real chance at getting these RINO senators to act on the illegitimate and corrupt election presided over by a Democrat party that is invested in the Communist takeover of Our Great Nation. \"", "The site says it was funded by the political group \"Committee for American Sovereignty,\" which according to news reports was created in 2016 to help Republican operatives — including Trump's longtime political confidant Roger Stone — undermine Hillary Clinton's presidential campaign by spewing an unfounded conspiracy theory that Bill Clinton had an illegitimate biracial son.", "The Daily Beast, however, reported that Paul Jensen, an attorney for the committee, refuted its connection to the website, and alleged its \"goal is to elect the Democrat candidate, suggesting that a Democrat-leaning entity, not the Committee for American Sovereignty, is behind it.”", "On Nov. 23, Donald Trump Jr. refuted the messages urging Trump supporters to abstain from voting for Loeffler and Perdue.", "More than a week later, as Trump prepared for a Dec. 5 visit to Georgia to campaign alongside Perdue and Loeffler, the president echoed that sentiment, saying in a tweet \"we must work hard\" to ensure victories for the Republican Senate candidates.", "In sum, the outcome of the runoffs remained unknown; therefore, it was unclear how any ballots, much less those with invalid markings for Trump, would impact results.", "But if, instead of voting for Loeffler or Perdue, a significant number of Republican voters unofficially wrote Trump's name on their ballots — and, as a result, election officials had to throw out those ballots— Democrats' vote margins would benefit. Depending on the level of participation in that protest, it could undermine Senate Republicans' chance at securing the chamber's majority.", "Nonetheless, state and federal laws governing elections would not allow voters the opportunity to elect Trump to the Senate in the runoffs. For those reasons, we rate this claim \"Mostly false.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]