["A photograph of anti-CAA protesters at a sit-in near India Gate with Priyanka Gandhi is being widely shared on social media. A Facebook user asked people to zoom into the picture and read the placard.", "A prominently circled placard in the image reads, “कैब हटाओ इस देश को मुस्लिम राष्ट्र बनाओं (Remove CAB and make the country a Muslim nation -translated)”.", "A few more individuals on Twitter posted the same image with a similar narrative.", "With a Google search with keywords, “Priyanka Gandhi protest“, Alt News found several images of the Congress leader at a sit-in-protest led by the Congress party in solidarity with the students of Jamia Millia Islamia and several other universities which opposed the Citizenship Amendment Act 2019. Gandhi can be seen wearing the same attire as in the viral image.", "We then searched for images and videos from the same protest and found that the placard held by a woman in a black dress actually reads, “लाठी-गोली नहीं रोज़गार-रोटी दो (Not lathis and bullets but employment and food -translated)”.", "The text is clearly visible in the zoomed-in screenshot of the image posted below.", "In the comparison below, we compared an original image taken from a similar angle but a different time-frame with the morphed photo. The similarities are evident.", "In conclusion, a morphed image of Priyanka Gandhi sitting on a protest along with party workers is circulating on social media to a false claim that one of the protesters was holding a placard that they are against “CAB” because they want this country to become a ‘Muslim Rashtra’.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]