["By Lori Robertson", "Posted on April 1, 2020 | Corrected on April 2, 2020", "While his administration has faced criticism for being slow to ramp up testing for coronavirus infections, President Donald Trump has repeatedly claimed that the problem was with his predecessors, saying the administration “inherited a broken system” that it “rebuilt.” That’s misleading.", "The president has a point that the testing system of the Centers for Disease Control and Prevention alone couldn’t conduct the kind of wide-scale testing the coronavirus pandemic demanded, as Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, has said.", "But several former officials have reiterated Fauci’s comments, explaining that the CDC simply isn’t set up to be a commercial test lab, let alone the only test lab for the country in a pandemic like this. And it was a month after the administration declared a public health emergency that it took steps to allow testing to be conducted more broadly, and then several days more before the private sector announced testing availability.", "“The CDC designed a good system.” Fauci said on March 13. “If you want to get the kind of blanket testing and availability that anybody can get it or you could even do surveillance to find out what the penetrance is, you have to embrace the private sector.”", "Another problem, which we’ve outlined before, was a manufacturing issue with the CDC’s test kits, which it had sent to state and local public health labs in early February.", "The CDC didn’t provide a fix for the manufacturing issue for more than two weeks after it revealed the problem. The Food and Drug Administration then, on Feb. 29, said it would allow labs to create and use their own in-house tests immediately, and about a week later, private diagnostic companies began to step in with their own tests.", "Weeks prior, two former Trump administration officials, in a Jan. 28 opinion piece in the Wall Street Journal, had recommended working with the private sector to meet the anticipated testing needs, saying past experience showed the CDC wouldn’t be able to handle the volume of testing.", "“If the number of cases increases, experience from the 2009 swine flu pandemic and the 2015 Zika epidemic suggests that the CDC will struggle to keep up with the volume of screening. Government should focus on working with private industry to develop easy-to-use, rapid diagnostic tests that can be made available to providers,” wrote Luciana Borio, former director for medical and biodefense preparedness at the National Security Council, and Scott Gottlieb, former commissioner of the FDA.", "Dr. Pierre E. Rollin, who worked for the CDC for 27 years, retiring in 2019 as head of an epidemiology team for the Viral Special Pathogens branch, told us the U.S. government, and the CDC in particular, “never had the capability” to produce large quantities of tests. It hasn’t been the case, Rollin said, that one institution “governmental or nongovernmental” would produce test kits for the entire population.", "Rollin pointed to flu testing as an example: Those are commercial tests, with the CDC playing a role in checking different commercial tests and helping labs verify they’re getting good results.", "“I don’t think it would be reasonable for a government institution to decide to compete with private industry. That doesn’t make sense,” said Rollin, who wrote a March 26 opinion piece for STAT, saying it “shouldn’t come as a surprise” that the CDC wasn’t able to respond quickly to a pandemic like this but questioning why the CDC “seems to be sitting on the sidelines for this pandemic” now.", "Borio also told NPR in a late March interview that “traditionally, our nation has relied on the CDC to get the initial testing out to public health labs. So they’re the first to launch, and they have done so with tremendous success over prior epidemics. But we have to remember that they’re not a manufacturing facility; they are a research and reference lab,” she said. “And in this instance, they encountered some serious technical challenges which really exposed a significant vulnerability in our national capability to roll out tests quickly.”", "Dr. Tom Frieden, the former head of the CDC during the Obama administration, from 2009 to 2017, similarly told USA Today that Trump’s claim about a “broken” testing system is “just wrong. They inherited the system that has worked in every prior emergency. Now, it’s fair to say this is an emergency like no other. But CDC tests were never supposed to meet the entire need for the United States.”", "Frieden said in a March 31 opinion piece for USA Today that in addition to the CDC’s flawed test kit being a problem, the FDA “was slow to allow hospital labs to develop their own tests” and the Department of Health and Human Services was also late in working with the private sector to develop widely distributed tests.", "Trump, however, has blamed “a testing situation that just wasn’t right,” as he said in the March 29 coronavirus task force briefing. “It was okay for very small cases, but it was obsolete and it was broken, and it was only good for a very small situation.”", "Former and current officials have explained that having the CDC distribute tests was only good for a relatively small situation, but that doesn’t mean the system was “obsolete” or “broken.”", "The following day, the president repeated the assertion, saying in the task force briefing that “this administration inherited a broken system, a system that was obsolete, a system that didn’t work. It was okay for a tiny, small group of people, but once you got beyond that, it didn’t work.” He added, “We have built an incredible system.”", "And Trump said in a March 30 “Fox & Friends” interview: “We inherited a broken test. The whole thing was broken and we rebuilt it.” (There was, of course, no inherited “test” for the new coronavirus, but the president appears to have misspoke in that instance. He went on to talk about the amount of testing being done now in the United States.)", "We asked the White House for an explanation of the president’s repeated comments, but we haven’t received a response.", "Here we provide a timeline of the testing issues and the administration’s statements and response.", "Jan. 18: The CDC test was operational, as a subsequent CDC report suggests.", "Jan. 20: The CDC used its own kit to confirm the first case of COVID-19 in the U.S.", "Jan. 24: The CDC confirms the second case in the U.S. “Currently, testing must take place at CDC, but CDC is preparing to share these test kits with domestic and international partners,” the agency said.", "Jan. 31: The Department of Health and Human Services declares a public health emergency for the U.S.", "Feb. 5: The CDC ships test kits to state and local public health labs, as well as international labs.", "Feb. 12: The CDC reveals that some labs were having problems when doing verification tests to make sure the tests worked. It was a manufacturing problem with one component of the test, CDC later says.", "Feb. 25: Only 12 state or local labs out of more than 100 nationwide could do their own testing — in addition to the CDC processing tests itself. “Commercial labs will also be coming online soon with their own tests,” a CDC official tells reporters.", "Feb. 28: The CDC says it had a fix for the manufacturing problem and had manufactured new tests.", "Feb. 29: The FDA says labs can create and use their own in-house tests as long as they complete an emergency use authorization request within 15 days.", "March 4: Trump falsely claims that he had to end an Obama-era FDA “rule” to more quickly provide diagnostic tests to the public. Experts later told us no such formal regulation was ever implemented under President Barack Obama. Trump may have been referring to the Feb. 29 FDA announcement, allowing labs to use their own tests before getting an emergency use authorization approved by the FDA. But that announcement allowed an exception to a de facto FDA policy; there was no “rule” that needed to be overturned.", "March 5: LabCorp says its test is available for health care providers to order. Quest Diagnostics says it will provide testing four days later.", "March 6: The U.S. had conducted 1,326 tests, according to data collected by The COVID Tracking Project, including tests with results pending. The group, run by journalists, researchers, scientists and others, says it attempts to provide “the number of people being tested, not specimens submitted,” but it also notes state public health authorities, the source of the bulk of the data, are inconsistent in the way they report their information and the quality of their data varies.", "March 12: In a congressional hearing, Rep. Debbie Wasserman Schultz asks who was in charge of “making sure … as many people as possible across this country have access to getting tested as soon as possible.” Fauci answers: “The system — the system does not — is not really geared to what we need right now, what you are asking for. That is a failing. … The idea of anybody getting it easily the way people in other countries are doing it, we are not set up for that. Do I think we should be? Yes, but we are not.”", "March 13: Trump declares a national emergency. The administration holds a coronavirus task force briefing in which Trump announces a “new partnership” with the private sector. “Ten days ago, I brought together the CEOs of commercial labs at the White House and directed them to immediately begin working on a solution to dramatically increase the availability of tests,” he says.", "At the same briefing, Fauci says: “The system was not designed — for what it was designed for it worked very well. The CDC designed a good system. If you want to get the kind of blanket testing and availability that anybody can get it or you could even do surveillance to find out what the penetrance is, you have to embrace the private sector. And this is exactly what you’re seeing, because you can’t do it without it. So when I said that, I meant the system was not designed for what we need. Now, looking forward, the system will take care of it.”", "Dr. Deborah Birx, the White House coronavirus response coordinator, credits Trump for asking for “an entire overhaul of the testing approach” and calling on “private sector laboratories” to develop tests. “Following the meeting last week, major commercial laboratory equipment and diagnostic companies took immediate action to adopt and develop new testing systems,” she says.", "Trump and Birx suggest Google was developing a screening website that large numbers of Americans could use to see if they should be tested and where they could go to get a test. But it turns out the website is a project of a sister company to Google and limited to the San Francisco Bay Area.", "March 16: Roche announces that it will have completed shipping the first 400,000 of its high-volume tests to hospitals and reference labs by the end of the week.", "March 16: A total of 41,814 tests had been conducted in the U.S., according to The COVID Tracking Project.", "March 21: The FDA announces it has given emergency use authorization to a 45-minute test developed by Cepheid for point-of-care use in hospitals to help manage patients and health care workers. Cepheid plans to start shipping tests by the end of March.", "March 24: Trump and other administration officials tout a milestone in testing, saying by that day the U.S. will have done “more testing” in eight days than South Korea had done “in eight weeks.” But on a per-capita basis, the U.S. still lags behind South Korea, and other countries, as we explain.", "Trump says, without evidence, that the U.S. test “is considered the best test.” One expert told us there’s “no reason to believe US tests are any better (or worse)” than those being run in other countries.", "March 27: Abbott labs announces that it has received emergency use authorization from the FDA for its point-of-care test, which provides results within 13 minutes. Unlike the LabCorp or Quest Diagnostics tests, specimens don’t need to be mailed in to be tested — a process that can take several days — and instead can be run on a toaster-sized machine in urgent care clinics or doctors’ offices.", "March 31: The U.S. had conducted 1.1 million tests, according to The COVID Tracking Project.", "March 31: Republican Gov. Mike DeWine of Ohio tells CNN the state isn’t “quite sure” when it will see a peak in cases but expects it will be “between mid-April and mid-May.” DeWine says: “Part of this is driven by the fact that we don’t have, you know, widespread testing. That is not unique to Ohio.”", "Correction, April 2: We originally wrote that it was more than a month after HHS declared a public health emergency that the administration took steps to allow testing to be conducted more broadly, including by the private sector. It was one month before the FDA allowed labs to use their own in-house tests, and then several days more before the private sector announced testing availability. We have corrected the story.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]