["About this rating", "In August 2020, as players in the National Basketball Association (NBA) opted to boycott (i.e., refused to participate in) playoff games in order to protest the police shooting of Jacob Blake in Kenosha, Wis., social media users circulated a meme purportedly quoting former Boston Celtics star Larry Bird as declaring “Back in my day, the game had fundamentals and honored the commander in chief. Now it’s a bunch of radical fundamentalists who dishonor the flag and cross. They only care about looking flashy! Shut up and play the damn game.”:", "However, once searches in vain to turn up this statement attributed to Larry Bird (or anyone else) prior to its appearance in this August 2020 meme, or to find any real example of Bird's speaking publicly about the issue of players' boycotting NBA playoff games as a form of social protest.", "Moreover, Indianapolis television station WTHR contacted the Indiana Pacers (for whom Bird still serves in an advisory capacity), and the Pacers responded that putative quote was “Totally false”:", "Given that Bird once passed on takig a trip to the White House to meet President Reagan after the Celtics won the NBA championship in 1984, famously saying that “If the president wants to see me, he knows where to find me,\" it seems unlikely the basketball legend would be lecturing about players' \"honoring the commander-in-chief.\"", "Shaughnessy, Dan.   \"They Didn’t Make It to the White House, And It Wasn’t a Big Deal.\"\r\n    Boston Globe.   5 March 2017.", "Fenno, Nathan.   \"NBA Players Boycott? Why ‘Boycott’ Is Not the Correct Term.\"\r\n    Los Angeles Times.   26 August 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]