["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican U.S. Senate candidate Joe Kyrillos said he thinks the state’s lowest-paid workers deserve a raise.\n\nBut incumbent U.S. Sen. Robert Menendez, a Democrat, accused Kyrillos of reversing course on that position. The two will face off in the Nov. 6 election.\n\n\"Listen, you had the opportunity, you know, you just can't flip back and forth. You've become the biggest flip flopper. Now it's that you want to vote for the minimum wage increase but you voted against it when you had the opportunity. Why'd you vote against it?\" Menendez said during a heated debate on New Jersey 101.5-FM on Wednesday night.\n\n\"I already said. You look at -- I think when I voted against it, it was in the 80s. It was a long time. You were in the Assembly then,\" Kyrillos said, adding that \"you look at things in the context of their times. You look at the legislation as it’s proposed.\"\n\nLet’s refresh Kyrillos’ memory here, because PolitiFact New Jersey didn’t have to go back to the 1980s to find a time when he voted against increasing the minimum wage.\n\nKyrillos, a state senator from Monmouth County, voted against a 2005 proposal that boosted the minimum wage in two steps, eventually increasing it to $7.15 per hour in 2006.\n\nThat rate didn’t change until 2009, when the federal minimum wage jumped to $7.25 per hour. When federal and state minimum wages conflict, the higher one applies, according to the U.S. Department of Labor.\n\nWhen we pointed out the 2005 vote to Kyrillos spokeswoman Meaghan Cronin she said Kyrillos \"has supported increasing the minimum wage\" and cited another 2005 bill that he sponsored.\n\nTwo weeks after Kyrillos voted against the proposal that became law he introduced legislation that increased the minimum wage more, but at a slower pace. Under his bill, the minimum wage would increase in four stages, reaching $7.25 per hour on Aug. 1, 2008.\n\nThat bill was referred to committee but never came to a vote.\n\nStill, Kyrillos is wrong to claim his vote against the minimum wage happened more than two decades ago, because he voted against it again less than 10 years ago.\n\nIn fact, Kyrillos wasn’t even in office for much of the 1980s. He joined the Assembly in 1988 before winning a seat in the state Senate, where he has served since 1992.\n\nThen-assemblyman Kyrillos voted against a 1990 bill that hiked the minimum wage -- then set at $3.35 per hour -- in three phases, ultimately increasing it to an hourly rate of $5.05 in 1992.\n\nMenendez, who also served in the assembly at the time, voted in favor of the bill, according to assembly minutes.\n\nThe assembly later voted again on the same measure after the senate amended the bill. On that second vote, Menendez again voted yes, while Kyrillos is not listed in the minutes as voting.\n\nBy 1992 both Kyrillos and Menendez had joined the state senate. That year a bill was introduced to delay half of the final increase in the minimum wage hike approved two years earlier.\n\nKyrillos voted in favor of that legislation, while Menendez opposed it. The governor vetoed the bill.\n\nOur ruling\n\nKyrillos said, \"when I voted against [an increase in the minimum wage], it was in the 80s.\"\n\nActually the state senator and Republican U.S. Senate hopeful voted against a bill in 2005 that eventually increased the minimum wage to $7.15 per hour.\n\nWe rate this statement False.\n\nTo comment on this ruling, go to NJ.com.", "Townsquare Media New Jersey, NJ U.S. Senate Candidates Argue Throughout Their Debate [VIDEO/POLL], Oct. 11, 2012\n\nNew Jersey Legislature, Bill Search: S2065: 2005, accessed Oct. 11, 2012\n\nNew Jersey Legislature, Bill Search: A2008: 1999, accessed Oct. 11, 2012\n\nU.S. Department of Labor, Wage and Hour Division (WHD): Minimum Wage Laws in the States - January 1, 2012, accessed Oct. 11, 2012\n\nNew Jersey Legislature, S2353, Feb. 28, 2005", "New Jersey Labor Department, NJ State Wage and Hour Laws and Regulations, accessed Oct. 11, 2012\n\nThe Star-Ledger, Minimum Wage Bills Approved, March 24, 1992, accessed via archives on Oct. 11, 2012\n\nThe Star-Ledger, $5.05 An Hour, May 4, 1990, accessed via archives on Oct. 11, 2012\n\nThe Star-Ledger, Assembly Approves $5.05 Minimum Wage, April 3, 1990, accessed via archives on Oct. 11, 2012", "The Star-Ledger, Florio Vetoes Bill to Halve Minimum Wage Hike, April 7, 1992, accessed via archives on Oct. 11, 2012\n\nState of New Jersey Minimum Wage Advisory Commission, First Annual Report, Dec. 21, 2007\n\nMinimum Wages and Employment: A Case Study of the Fast-Food Industry in New Jersey and Pennsylvania by David Card and Alan B. Krueger, accessed Oct. 11, 2012\n\nState of New Jersey Minimum Wage Advisory Commission, Fifth Annual Report, January 2012\n\nE-mail interview with Meaghan Cronin, spokeswoman for U.S. Senate candidate Joe Kyrillos, Oct. 11, 2012\n\nUnited States Department of Labor, Minimum Wage, accessed Oct. 11, 2012\n\nNew Jersey Legislature, Senator Joseph M. Kyrillos, accessed Oct. 11, 2012\n\nMinutes of the General Assembly, June 18, 1988\n\nSenate Journal, Minutes from Dec. 17, 1998\n\nSenate Journal, Minutes from March 23, 1992\n\nMinutes of the General Assembly, March 16, 1992\n\nSenate Journal, Minutes from April 5, 1990\n\nMinutes of the General Assembly, April 30, 1990", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]