["About this rating", "In September 2017, numerous news accounts reported that the Healthcare.gov web site was scheduled to be shut down for maintenance on several occasions during the 2018 \"Obamacare\" health insurance open enrollment period, which runs from 1 November to 15 December 2017, prompting queries to us from readers about the issue.", "Kaiser Health News, a self-described \"nonprofit news service committed to in-depth coverage of health care policy and politics,\" reported that:", "The Trump administration plans to shut down the federal health insurance exchange for 12 hours during all but one Sunday in the upcoming open enrollment season. The shutdown will occur from 12 a.m. to 12 p.m. ET on every Sunday except Dec. 10.", "The Department of Health and Human Services will also shut down the federal exchange — healthcare.gov — overnight on the first day of open enrollment, Nov. 1. More than three dozen states use that exchange for their marketplaces. HHS officials disclosed this information during a webinar with community groups that help people enroll.", "Kaiser Health News reporter Phil Galewitz tweeted what appeared to be a slide from a related presentation, including details of the scheduled maintenance:", "..@HHSGov plans to shut down @HHSGov for 12 hours during all but one Sunday during the upcoming 6 week open enrollment season pic.twitter.com/0d5WUtLc9G", "— Phil Galewitz (@philgalewitz) September 22, 2017", "The same slide was independently tweeted by Vox's Sarah Kliff:", "HHS will take https://t.co/hHpJTTaZfz offline nearly every Sunday from 12 a.m. to 12 p.m. of open enrollment, per presentation sent to me. pic.twitter.com/0n5cZ9ENOK", "— Sarah Kliff (@sarahkliff) September 22, 2017", "A spokesperson for the Center for Medicare and Medicaid Services (CMS), which runs Healthcare.gov, confirmed the maintenance schedules reported by Kaiser Health News and Sarah Kliff:", "Maintenance outages are regularly scheduled on HealthCare.gov every year during open enrollment. This year is no different. The maintenance schedule was provided in advance this year in order to accommodate requests from certified application assisters. System downtime is planned for the lowest-traffic time periods on HealthCare.gov including Sunday mornings.", "That spokesperson also said the periods set out for web site maintenance constituted the maximum anticipated amount of downtime, and averred that the actual amount of downtime might end up being less. (We asked CMS to clarify the times involved in the 1 November downtime, which the presentation slide only describes as \"overnight,\" but we did not receive a response in time for publication.)", "The Trump administration has already cut in half the Obamacare open enrollment period, truncating the original period of 1 November 2016 to 31 January 2017 (three months) to the shorter period of 1 November to 15 December 2017 (six weeks).", "As pointed out by Kaiser Health News, this year's web site maintenance schedule means that Healthcare.gov will be online for 93% of the total time during the six-week open enrollment period. (If we assume the \"overnight\" downtime on 1 November will last 12 hours, then the web site will be online for 1,008 out of 1,080 hours.)", "According to the United States Digital Service, which is part of the Executive Office of the President, the Healthcare.gov web site was online 99.9% of the time during the 2015 and 2016 open enrollment periods, which were themselves twice as long as the upcoming open enrollment period.", "Galewitz, Phil.   \"Sunday Hours: Obamacare Website to be Shut Down for Portions of Most Weekends.\"\r\n    Kaiser Health News.   22 September 2017.", "MacGuill, Dan.   \"Did Donald Trump Cut Funding for Obamacare Enrollment Advertising?\"\r\n    Snopes.com.   6 September 2017.", "U.S. Digital Service.   \"Report to Congress — December 2016.\"\r\n    December 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]