["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The 2020 presidential election is now four months behind us, but misinformation about voter fraud persists on social media.", "One recent Facebook post claims that Nevada’s attorney general admitted to \"changing signature verifications manually for over 200,000 votes.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A spokesperson for Nevada Attorney General Aaron Ford told PolitiFact that \"there is no truth to this claim\" and provided a statement from the attorney general in which he reiterated that there has been no evidence of widespread voter fraud in Nevada.", "\"Our elections were fair and secure,\" Ford said in the statement. \"This has been demonstrated time and time again and across numerous courts.\"", "In Nevada, election officials verify voter signatures on every ballot they receive, according to the secretary of state’s website. If the signature is missing or the signature on the ballot return envelope doesn’t match the signature on file for the voter, the ballot isn’t counted until the voter verifies their signature.", "The state has procedures in place for voters to fix their ballots if the signature is missing or doesn’t match. But searching online, we couldn’t find any evidence that Ford said he manually changed the signature verifications for hundreds of thousand of ballots, as the Facebook post claims.", "USA Today, which also looked into this claim, consulted with two political reporters in Nevada who said they hadn’t heard of that Ford quote.", "\"I don’t even know what to say about this because it’s so insane,\" the newspaper quotes Nevada Independent reporter Jon Ralston as saying. \"Ford would not have the ability to do this, nor has he ever said he did so.\"", "In November, Adam Laxalt, a former Nevada attorney general who co-chaired Trump’s campaign in the state, said on Fox News that 200,000 votes were \"verified by a machine only\" after election officials lowered its settings so that ballots could be counted even if the signatures weren’t a match.", "\"No human being went back and checked these, those ended up just counting,\" he said.", "This may have spawned the claim that appears in the Facebook post. A blog called Fellow American Daily published a post about Laxalt’s Fox News appearance with a misleading headline: \"Nevada AG admits that they changed signature verification manually for over 200,000 votes.\"", "We previously reported on the Trump campaign’s claims about the machine that was used to verify signatures in Clark County, which includes Las Vegas. We rated False Trump’s claim that Nevada wanted to do away with signature verification.", "Also incorrect: this Facebook post’s claim that Nevada’s attorney general admitted to changing signature verifications manually for over 200,000 votes.", "We rate it False.", "Facebook post, March 10, 2021", "Nevada Secretary of State, Facts vs. Myths 2020, visited March 11, 2021", "PolitiFact, Trump’s misleading claim about ballot signatures in Nevada, Oct. 28, 2020", "USA Today, Fact check: Nevada’s AG did not admit to changing signature verification manually in election, Nov. 25, 2020", "Trump War Room tweet, Nov. 10, 2020", "Las Vegas Review-Journal, Voter fraud unproven in Nevada, despite multiple Trump campaign claims, Nov. 11, 2020", "Fellow American Daily, Nevada AG admits that they changed signature verification manually for over 200,000 votes, visited March 11, 2021", "Email interview with Monica Moazez, communications director, Nevada Attorney General’s Office, May 11, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]