["About this rating", "In the first quarter of 2019, internet users because encountering a somewhat unusual website that appeared to be the official \"Biden 2020\" U.S. presidential campaign site for former vice president Joe Biden. The website, at joebiden.info appeared slick and professional and appearance, but the material it offered was rather odd: pictures and animated GIFs of Biden touching and kissing women and young girls; a 2012 quote from Biden stating that \"I promise you, the president has a big stick”; and sections highlighting Biden's purported policy positions of having been \"AGAINST Gay Marriage, FOR Mass Incarceration, AGAINST Abortion Rights, AGAINST School Busing, FOR Iraq War, and FOR Death Penalty & Harsh Drug Sentences\":", "All of this was topped off by a notice to viewers that \"Uncle Joe is back and ready to take a hands-on approach to America’s problems! Joe Biden has a good feel for the American people and knows exactly what they really want deep down. He’s happy to open up and reveal himself to voters and will give a pounding to anybody who gets in his way!\" -- references to Biden's supposed \"groping problem\":", "Only in tiny type at the bottom of the page did the site inform readers that it was \"political commentary and parody of Joe Biden's Presidential campaign website\" and was \"not Joe Biden's actual website.\"", "That disclaimer merely stated that the parody site was \"a project BY AN American citizen FOR American citizens\" without disclosing its creator's identity. But a New York Times article of June 29, 2019, revealed the website to be the work of Patrick Mauldin, who runs the Republican political consulting firm Vici Media Group (not to be confused with Vici Media Inc. of Philadelphia) and has created content for Donald Trump's presidential campaigns:", "The Biden website was intended to help Democrats “face facts,” Mr. Mauldin said in an interview. He kept his name off it because “people tend to dismiss things that they don’t like, especially if it comes from the opposite side,” he said.", "Yet in anonymously trying to exploit the fissures within the Democratic ranks — fissures that ran through [Democratic] debates — Mr. Mauldin’s website hews far closer to the disinformation spread by Russian trolls in 2016 than typical political messaging. With nothing to indicate its creator’s motives or employer, the website offers a preview of what election experts and national security officials say Americans can expect to be bombarded with for the next year and a half: anonymous and hard-to-trace digital messaging spread by sophisticated political operatives whose aim is to sow discord through deceit. Trolling, that is, as a political strategy.", "Mr. Mauldin, who has not been previously identified as the creator of the website, said he had built and paid for it on his own, and not for the Trump campaign. But the campaign knows about the websites, raising the prospect that the president’s re-election effort condoned what is, in essence, a disinformation operation run by one of its own.", "Tim Murtaugh, the Trump campaign’s communications director, did not directly address that issue, though he said it was “great that talented supporters of President Trump use their time to help his re-election.”", "“We appreciate their efforts in their own time with parodies like this that help the cause,” he added.", "Mauldin set up similar fake campaign websites for other Democratic candidates, including Senators Bernie Sanders, Elizabeth Warren, and Kamala Harris. Biden campaign spokesperson T.J. Ducklo was quoted by the Times as saying the Biden campaign had been aware of the parody site but not the identity of its creator: \"Imagine our surprise that a site full of obvious disinformation is the handiwork of an operative tied to the Trump campaign.”", "Rosenberg, Matthew   \"Trump Consultant Is Trolling Democrats with Biden Site That Isn’t Biden’s.\"\r\n    The New York Times.   29 June 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]