["The claim was published on Facebook here on March 24, 2020. It has been shared more than 60 times.", "The post reads: “From HK today: ‘In our laboratory, we found trace amount of the virus on the skin of fruits and vegetables after 12 hrs. of being touched by another customer who was infected.\n\tWe recommend our staff to avoid salads. Do not eat the fruits within 48 hrs..of purchase, or pour some boiling water over the fruit before cutting. Berries, apples, cucumbers and tomatoes are the worst because some people eat the skin. (This would explain why the virus is spreading faster in the West than Asia.) Most Asians do not eat salad, and very few eat the skin of any fruit. WE have to assume anything that comes from outside our home within 48 hrs. is infected. Shoes, clothes, our hair, all food....’”.", "Below is a screenshot of the misleading post:", "The novel coronavirus has killed at least 72,000 people and infected more than 1.2 million others worldwide as of April 7, according to this report from the World Health Organization (WHO).", "An identical claim was also shared on Facebook here, here and here, and on Twitter here and here.", "The claim is false. On March 31, 2020, Hong Kong’s Centre for Food and Safety said on Facebook here that “no evidence has shown people can be infected with the 2019 coronavirus disease from food”.", "“The truth is: So far there’s no evidence suggesting human beings will be infected by novel coronavirus from food. Food safety risk assessment agencies around the world including those of the European Union, Australia and New Zealand, also believe that human beings are unlikely to be infected with 2019 coronavirus disease from food,” the traditional Chinese post reads in English.", "The CDC also said there is “no evidence to support transmission of COVID-19 associated with food” in a newsletter published on March 23, 2020. The US Food and Drug Administration, which enforces food safety standards, reiterated the position, saying here that “there is no evidence of food or food packaging being associated with transmission of COVID-19.”", "EFSA also said here that there is “no evidence that food is a likely source or route of transmission of the virus.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]