["The post -- shared here, here and here -- claims that Northam said: “You will give up your guns, if you don't I'll have the National Guard cut your power, your phone lines and your internet. Then, if you still refuse to comply I'll have you killed.”", "Addressing proposed legislation to regulate guns, the governor denied any of that would happen in his State of the Commonwealth Address on January 8, 2020.", "“No one is calling out the National Guard. No one is cutting off your electricity, or turning off the internet. No one is going door-to-door to confiscate guns. These laws are intended to keep Virginians safe. Period. It’s time to act,” Northam said.", "His press secretary, Alena Yarmosky, also told AFP on January 17 that the quote attributed to Northam was fabricated.", "“This is absolutely false. People who spread lies like this should be ashamed of themselves,” Yarmosky wrote in an email.", "Gun control is currently a highly controversial topic in Virginia. Northam is advocating what he has described as “common-sense legislation” on the issue, but the National Rifle Association gun lobby has condemned it as an “extreme gun control agenda.”", "Virginia’s Senate passed several pieces of gun control legislation on January 16.", "One measure requires background checks for firearms sales and transfers, but there are various exemptions, including for transfers between family members. Another limits handgun purchases by those who are not firearms dealers to one per month, with exemptions included for law enforcement and private security companies, among others.", "A third authorizes “any locality” to bar the carrying of guns, ammunition or components at public events that require permits.", "A more controversial measure -- which would have made it illegal “for any person to import, sell... manufacture, purchase, possess, or transport an assault firearm” -- did not advance in the Senate on January 13.", "Yarmosky sent AFP this link to a bill on the issue that she said was backed by Northam, which would include an exemption for previously-owned firearms.", "“Any person who legally owns an assault firearm on July 1, 2020, may apply for a permit to possess such assault firearm,” it says.", "A rally against gun control is planned for January 20 in Richmond.", "Ahead of the rally, Northam declared a state of emergency on January 15 that bans “all weapons, including firearms, from Capitol grounds.”", "“Law enforcement intelligence analysts have identified credible threats of violence surrounding the event, along with white nationalist rhetoric and plans by out-of-state militia groups to attend,” a statement on the declaration said.", "The FBI arrested three alleged members of a white extremist group on January 16, saying they accumulated ammunition and built a functioning automatic weapon. The three reportedly discussed attending the Richmond rally.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]