["By Jessica McDonald", "Posted on October 18, 2018", "In two recent interviews, President Donald Trump said he is not convinced that climate change is due to human activity, and he suggested that any changes will reverse themselves — two ideas that lack scientific backing.", "He also claimed in a third interview that there are scientists “on both sides” of climate change, despite published papers showing that the vast majority of climate scientists — as high as 97 percent — agree on the issue.", "Trump’s first comments on climate change this week came during a CBS “60 Minutes” interview on Oct. 14, when CBS’ Lesley Stahl asked whether Trump still viewed climate change as a hoax.", "Stahl, Oct. 14: Do you still think that climate change is a hoax?", "Trump: I think something’s happening. Something’s changing and it’ll change back again. I don’t think it’s a hoax, I think there’s probably a difference. But I don’t know that it’s man-made. I will say this. I don’t wanna give trillions and trillions of dollars. I don’t wanna lose millions and millions of jobs. I don’t wanna be put at a disadvantage.", "Stahl: I wish you could go to Greenland, watch these huge chunks of ice just falling into the ocean, raising the sea levels.", "Trump: And you don’t know whether or not that would have happened with or without man. You don’t know.", "Stahl: Well, your scientists, your scientists–", "Trump: No, we have–", "Stahl: At NOAA and NASA–", "Trump: We have scientists that disagree with that.", "Stahl: You know, I– I was thinking what if he said, “No, I’ve seen the hurricane situations, I’ve changed my mind. There really is climate change.” And I thought, “Wow, what an impact.”", "Trump: Well– I’m not denying.", "Stahl: What an impact that would make.", "Trump: I’m not denying climate change. But it could very well go back. You know, we’re talkin’ about over a millions of years.", "The following day, the president repeated these ideas during a briefing about Hurricane Michael when asked by a reporter why he had changed his mind about climate change being a hoax.", "Trump, Oct. 15: There’s no question. There is something there — man-made or not.  I mean, there’s something there. And it’s going to go, and it’s going to go back and forth. But there is something there.", "Then, on Oct. 16, in an interview with the Associated Press, Trump once again said he agrees “the climate changes,” but said that it “goes back and forth, back and forth.” He said he was unwilling to “sacrifice the economic well-being of our country for something that nobody really knows,” noting that “you have scientists on both sides of the issue.”", "The president presents climate change as a phenomenon that naturally swings back and forth, arguing that it might reverse itself all on its own.", "Climate systems are complex and do have natural cycles and feedbacks. But these cycles are already accounted for when scientists evaluate what is happening as the Earth warms from increases in greenhouse gases.", "“There is no reason to believe the climate would swing back because something would have to push it back,” said Drew Shindell, a climate scientist at Duke University, in a phone interview. “We have changed things so much that we now overwhelm things like the ice age cycles.”", "When scientists, such as those with the Intergovernmental Panel on Climate Change, or IPCC, model future climate changes, there are no scenarios in which the general warming trend decreases by the year 2100.", "The IPCC makes future projections under different greenhouse gas concentrations and emissions, among other factors, in what it calls Representative Concentration Pathways, to show what we might expect given various levels of action on climate change.", "According to the IPCC’s fifth assessment report, which was finalized in 2014, global surface temperatures are expected to rise by 0.3 to 1.7 degrees Celsius by the end of this century in even the most aggressive scenario, known as RCP 2.6. In this scenario, greenhouse gas emissions are severely limited, consistent with the goal of limiting temperature rise to 2 degrees Celsius. While this goal is thought to be technically feasible, it requires the participation of all countries.", "Taking no additional action on climate change is projected in the same report to result in a global temperature increase between that expected for the two most lax scenarios, which range from 1.4 to 3.1 and 2.6 to 4.8 degrees Celsius. Looking further out, warming continues after 2100 in all scenarios except for RCP 2.6, the most stringent one.", "“All the scientific evidence suggests that the changes humans are causing now will last for hundreds or thousands of years, so long enough that we will have to move cities and infrastructure,” Natalie Mahowald, a climate scientist at Cornell University, and a lead author of the IPCC’s latest special report on the impacts of global warming of 1.5 degrees Celsius above pre-industrial levels, told us in an email.", "On a very long timescale, the Earth might eventually cool after today’s warming has taken effect and an ice age sets in. But Shindell explained that won’t happen for at least thousands of years.", "“The CO2 going away will take thousands of years,” he said in an email, “and even then it’d have to be driven by changes in earth-sun orbital alignment going in the right direction once the CO2 levels have declined.”", "If that is the “back and forth” Trump has in mind, it will come too late to prevent the Earth from having to experience the ecosystem changes, extreme weather events, and rises in sea level that scientists expect from climate change in the near future.", "In both the “60 Minutes” interview and the briefing on Hurricane Michael, the president questioned whether climate change is caused by humans, saying, “I don’t know that it’s man-made,” and “There is something there — man-made or not.” As we have written before, this is not an open question. Hundreds of scientists from across the world agree that climate change is driven by humans.", "In the latest IPCC assessment, the group was even more confident than in its previous report that human activity causes climate change, writing, “It is extremely likely that more than half of the observed increase in global average surface temperature from 1951 to 2010 was caused by the anthropogenic increase in GHG [greenhouse gas] concentrations and other anthropogenic forcings together.” The IPCC defines “extremely likely” as between 95 percent to 100 percent probability.", "The U.S. Global Change Research Program’s 2017 Climate Science Special Report comes to the same determination. The program’s website explains that the “assessment concludes, based on extensive evidence, that it is extremely likely that human activities, especially emissions of greenhouse gases, are the dominant cause of the observed warming since the mid-20th century.” It adds, “For the warming over the last century, there is no convincing alternative explanation supported by the extent of the observational evidence.”", "In the “60 Minutes” interview, Trump also responded to Stahl’s example of ice chunks falling off of Greenland and raising the sea level by saying, “And you don’t know whether or not that would have happened with or without man. You don’t know.”", "Trump is right — but only to a point. It is impossible to tie any particular ice chunk to climate change and human activity. “Any individual chunk of ice, we don’t know if that particular bit of frozen water would have fallen off without climate change,” said Drew Shindell, the Duke climate scientist. But, he said, Trump is correct only in the narrowest sense. “We’re quite sure that the observations of the accelerated Greenland-wide loss are related to climate change,” he said.", "Trump has questioned the status of glaciers, or what he called “ice caps,” before, and as we’ve explained, satellite imagery shows that Greenland has been losing mass since at least 2002, with increases in that rate since 2009.", "The National Aeronautics and Space Administration estimates that for the last 15 or so years, Greenland has lost a whopping 286 gigatonnes of ice per year, and this has led to a 0.8 millimeter rise in the global sea level each year. Some of the ice loss is from iceberg calving, which is when ice breaks off from the edge of a glacier, and is likely what Stahl had in mind, and some is from surface melting.", "The fifth IPCC assessment also concluded that human activity likely was behind ice loss and that it is connected to sea level rise.", "“Glaciers have lost mass and contributed to sea level rise throughout the 20th century,” the report reads. “The rate of ice mass loss from the Greenland ice sheet has very likely substantially increased over the period 1992 to 2011, resulting in a larger mass loss over 2002 to 2011 than over 1992 to 2011.” The report adds, “Anthropogenic influences likely contributed to the retreat of glaciers since the 1960s and to the increased surface melting of the Greenland ice sheet since 1993.”", "Even in the specific case of Greenland’s ice sheet, the president’s skepticism about climate change being man-made is misleading and does not reflect what is known by scientists.", "In the AP interview, Trump repeatedly claimed that scientists do not agree about climate change, saying, “you have scientists on both sides of the issue.”", "The president made a similar statement two days before, when he said that “we have scientists that disagree” in response to Stahl challenging him on his remark about Greenland, when she brought up “your scientists” at NASA and the National Oceanic and Atmospheric Administration.", "It is unclear from the president’s comments whether he was saying that NOAA and NASA scientists disagree, and the White House did not respond to our request for clarification or for help identifying these scientists.", "But both the NOAA and NASA websites clearly support the scientific consensus that climate change is happening and is primarily caused by human activity, and these agencies are behind important climate change research projects in Greenland. NASA notes that studies have shown that “97 percent or more” of actively publishing climate scientists are in agreement — studies we have discussed before.", "“There are very few climate scientists today who are skeptical of climate change, and their arguments tend to be rather weak,” said Mahowald, the Cornell climate scientist. “They argue that the models are not accurate enough, and that the feedbacks will reduce the impact. But they can’t explain the trends.”", "Mahowald said the IPCC’s results, which represent the scientific consensus, are carefully put together by many scientists after assessing the scientific literature, and are accepted by governments, including the United States, in approval sessions.", "“Any results that are scientifically controversial do not make it into the reports,” she said. As a result, rather than exaggerating the impact or importance of climate change, she said the reports “tend to be rather conservative.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]