["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Debbie Wasserman Schultz, D-Weston, questions Budget Director Mick Mulvaney on Capitol Hill. Wasserman Schultz fired IT staffer Imran Awan on July 25, 2017, following his arrest on a federal bank fraud charge. (AP)", "U.S. Rep. Debbie Wasserman Schultz has been criticized for waiting to fire an information technology employee who did work for her office until his recent arrest.", "While many other Democratic members fired Imran Awan months ago when news reports stated he was under investigation, Wasserman Schultz waited until July 25, the day after his arrest for bank fraud. (Awan was a shared employee among multiple House members.)", "For all of the questions about how Wasserman Schultz handled the situation, there have been unsubstantiated attacks on the former Democratic National Committee chairwoman from Broward County.", "The website US Daily News 24 compiled various news reports, blogs and tweets about the Awan investigation in a July 28 post. However, the clickbait headline of the story is totally unsupported.", "It states: \"Wasserman Schultz going to mental hospital after what she did overnight desperate to escape arrest.\"", "There is no evidence that Wasserman Schultz is headed to a mental health facility.", "In fact, other than the headline, the article itself makes no mention of her going to a mental hospital or facing arrest -- and it’s unclear what the author is alluding to that she did \"overnight.\"", "Instead, the article contains some sweeping statements about her alleged state of mind with no evidence, such as there are reports that Wasserman Schultz \"has been an absolute wreck since Imran’s arrest\" and an unsourced text posted on twitter alleging that she was spotted berating her daughter about buying a $2 purse.", "We found no contact information for US Daily News 24, although we left a comment in the comments section asking for evidence. We found the same post on Freedom Daily and used their contact form but did not get a reply.", "The article does correctly state that Awan was picked up by police at the Dulles International Airport while he was attempting to leave the country.", "The criminal complaint filed in U.S. District Court in Washington, D.C., states that on July 24 Awan had purchased a flight to Qatar and then to Lahore, Pakistan, with a return flight in January. He was arrested on one count of bank fraud related to allegations that he provided inaccurate information when applying for a home loan. He pleaded not guilty.", "The criminal complaint makes no mention of allegations reported since February by Buzzfeed, Politico and The Daily Caller that Awan and other relatives were under investigation related to a procurement scam and theft of equipment and data. The articles we read attributed key information to unnamed sources.", "There is no evidence that Wasserman Schultz faces arrest.", "Eva Malecki, a spokeswoman for the United States Capitol Police, told the Miami Herald, a PolitiFact Florida news partner, on Feb. 8 that \"no members are being investigated\" related to the actions of the House IT support staff.", "Unrelated to this fact-check, the Miami Herald asked Wasserman Schultz’s spokesman David Damron on July 28 if she had scheduled any public events for the August congressional recess. Damron said that she planned to spend some time with family out of town during the first couple of weeks and would do district events later during the recess.", "The A. Philip Randolph Institute, an AFL-CIO group, also announced that Wasserman Schultz will speak at the group’s education conference in Broward on Aug. 3.", "Through Damron, Wasserman Schultz told PolitiFact that the website is a \"false story.\"", "A US Daily News 24 article headline states ,\"Wasserman Schultz going to mental hospital after what she did overnight desperate to escape arrest.\"", "While there are some statements in the article itself which are accurate -- including that a man who did IT work for her was arrested -- there is no evidence to support the headline. The article contains no information to prove that she is going to a mental hospital, only allegations that she is an \"absolute wreck.\" There is also no evidence in the article that she has tried to escape arrest. The U.S. Capitol Police said in February that no members were under investigation.", "We rate this headline Pants on Fire.", "U.S. District Court in Washington D.C., Criminal complaint against Imran Awan, (Accessed in PACER) July 24, 2017", "US Daily News 24, \"Wasserman Schultz Going To Mental Hospital After What She Did Overnight Desperate To Escape Arrest,\" July 28, 2017", "BuzzFeed, \"Congressional IT Staff Under Investigation In Alleged Procurement Scam,\" Feb. 2, 2017", "BuzzFeed, \"Here's The Deal With The Democratic IT Staffer Who Was Arrested For Bank Fraud,\" July 27, 2017", "Politico, \"House staffers under criminal investigation for alleged equipment theft,\" Feb. 2, 2017", "The Daily Caller, \"EXCLUSIVE: House Intelligence, Foreign Affairs Committee Members Compromised By Rogue IT Staff,\" Feb. 4, 2017", "Miami Herald, \"Wasserman Schultz kept paying tech expert suspected of stealing House computers,\" July 26, 2017", "Miami Herald Naked Politics blog, \"Wasserman Schultz fires arrested IT staffer under investigation,\" July 25, 2017", "Miami Herald Naked Politics blog, \"Debbie Wasserman Schultz staffer under investigation, report says,\" Feb. 8, 2017", "Miami Herald Naked Politics blog, \"Conservative group files complaint against Debbie Wasserman Schultz in Imran Aman case,\" July 31, 2017", "New York Times, \"Trump Fuels Intrigue Surrounding a Former I.T. Worker’s Arrest,\" July 28, 2017", "Gowen Rhoades Winograd and Silva law firm, Website, Press releases July 26 and 27, 2017", "A. Philip Randolph Institute, Website, Accessed Aug. 1, 2017", "Interview, David Damron, U.S. Rep. Debbie Wasserman Schultz spokesman, Aug. 1, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]