["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The New York Times’ editorial board recently published an interactive package called \"The Choice,\" aimed at helping readers decide who should be the Democratic presidential nominee. It includes transcripts of its interviews with the candidates, including former Vice President Joe Biden.", "What appeared to be an excerpt of that interview soon showed up on Facebook.", "The post is a screenshot of a tweet that appears to show a portion of the New York Times transcript of one of Biden’s answers. It reads:", "\"By the way, and that’s what some of those Bernie people don’t get. You have to get the center, too. It’s, I was eating a corn dog the other day, this is like a corn dog, with some mustard. When you get to the middle, it’s hard and tough and dry [CHUCKLES], but you have to eat that, too. You have to eat that to finish it. But it’s hard.\"", "\"Sir, are you talking about eating a [wooden] stick?\"", "\"A what?\"", "People who shared it on Facebook seemed shocked.", "\"Uhh,\" wrote the Facebook account that posted the image, which was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "You can read the interview transcript yourself; Biden didn’t say that. He didn’t talk about corn dogs at all, nor \"Bernie people\" or even \"centers,\" not counting a reference to the Centers for Disease Control.", "The fake Biden interview appears to be a joke. But like a game of telephone, not everyone is getting it.", "\"Dementia,\" wrote one person commenting on the Facebook post.", "We rate it Pants on Fire!", "Facebook post, Jan. 17, 2020", "The New York Times, The Choice, Jan. 13, 2020", "The New York Times, Joe Biden interview, Jan. 17, 2020", "Twitter post, Jan. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]