["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tom Perriello wants to know what Robert Hurt is hiding with his stance on tax loopholes, but the murkiness comes more from a cookie-cutter Democratic ad campaign than the Republican candidate’s position.\n\nIn a political ad, \"What is Robert Hurt Hiding?\",  Perriello, a Democratic congressman from Charlottesville, claimed that Hurt, his  Republican challenger  from Chatham, \"supports the tax loopholes that send American jobs overseas.\"\n\nThe basis of the claim is the Taxpayer Protection Pledge that Hurt signed in December after a much-publicized meeting with Grover Norquist, president of Americans for Tax Reform, a well-known anti-tax group in Washington. Hurt is one of seven challengers in Virginia congressional races -- six Republicans and one independent -- to take the pledge, which the anti-tax group enforces strictly.\n\nThe pledge for House candidates has two parts: They promise to oppose any increase in marginal income tax rates for citizens or businesses, and they vow to oppose the elimination of tax deductions or credits unless they are offset \"dollar for dollar\" by tax cuts or new credits.\n\nSimple enough. But it has given Democrats an opening to make a dubious connection to tax credits they portray as loopholes for shipping American jobs offshore.\n\nThe Democratic Congressional Campaign Committee has translated the second part of the pledge to mean that signers support tax loopholes for multinational companies operating in other countries. The DCCC backs up the claim not with the pledge the candidates actually signed, but with three specific bills opposed by Americans for Tax Reform that the group urged pledge signers to oppose. One of them was the $26.1 billion bill adopted in August to help states hire teachers and pay for Medicaid services. The money for those programs would come from closing the loopholes. Hurt opposed that bill, citing the increase in federal spending.\n\nDemocrats say the money from closing the loopholes was well-spent. \"Our point is if you’re going to spend the money, it should be on creating jobs here,\" Jesse F. Ferguson, the DCCC’s southern region press secretary, told us.\n\nBut the fact that someone signed the pledge doesn’t necessarily mean they are opposed to closing loopholes for off-shore companies.\n\nOur friends at FactCheck.org have been knocking down this claim since April, when the DCCC ran a TV ad against a Republican House candidate in Hawaii. They recently debunked the same claim in an ad in the Massachusetts gubernatorial campaign.\n\nHere’s the problem: The taxpayer pledge doesn’t prevent a signer from opposing any tax break as long as he or she finds a way to offset the resulting increase in taxes.\n\n\"The pledge doesn’t get into whether something is good or bad tax policy,\" Ryan Ellis, ATR’s director of tax policy, told us. The pledge means that if a bill would result in a net tax increase, \"you’re not free to vote for it,\" Ellis said.\n\nHurt hasn’t offered specifics about his position on the offshore tax rules, but in a TV ad last month, he called Perriello’s claim false.\n\nWe agree. Perriello has chosen to rest his claim on the DCCC’s spurious connection to the Taxpayer Protection Pledge, but that is a huge leap of logic and it doesn’t prove Hurt supports the offshore loopholes. So we find the claim False.", "Tom Perriello campaign, \"What is Robert Hurt hiding?\", Aug. 18, 2010.\n\nAmericans for Tax Reform, \"Taxpayer Protection Pledge.\"\n\nCongressional Quarterly, \"Vote haunts Virginia candidate,\" Dec. 17, 2009.\n\nAmericans for Tax Reform, \"Federal Taxpayer Protection Pledge Signers for 2010,\" June 7, 2010.\n\nAmericans for Tax Reform, \"Tax Pledge Alert: ATR will keyvote against state bailout/tax hike in House today,\" Aug. 9, 2010.\n\nTom Perriello campaign, e-mail responses, Oct, 21, 2010.\n\nDemocratic Congressional Campaign Caucus, interview with Jesse F. Ferguson, Oct. 22, 2010.\n\nFactCheck.org,  \"A False Tax Attack,\" April 9, 2010.\n\nFactCheck.org, \"A New Twist on an Old Tax Attack,\" Oct. 8, 2010.\n\nAmericans for Tax Reform, interview with Ryan Ellis, Oct. 21, 2010.\n\nDanville Bee, \"Perriello votes for $26 billion aid bill,\" Aug. 10, 2010.\n\nRobert Hurt campaign, \"Differently,\" Sept. 27, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]