["By Brooks Jackson, Lori Robertson, Robert Farley, Angelo Fichera, Jessica McDonald, Rem Rieder, Katie Busch and Eugene Kiely", "Posted on October 16, 2020", "In an Oct. 15 town hall on NBC News, President Donald Trump made false and misleading claims on the coronavirus, the economy and more:", "The NBC News town hall was held in Miami and hosted by “Today” show anchor Savannah Guthrie. Over on ABC News, Democratic presidential nominee Joe Biden was answering questions in another town hall at the same time. We fact-checked that as well.", "Trump wrongly said the CDC “came out with a statement that 85% of the people who wear masks catch” the coronavirus. Rather, among the COVID-19 patients surveyed in the study, 85% reported they “always” or “often” wore a mask in the 14 days before illness onset.", "Trump: I’m OK with masks. I tell people, wear a mask. But just the other day they came out with a statement that 85% of the people that wear masks catch it.", "The day before the town hall, the CDC released a tweet directly contradicting the president’s claim, saying, “the interpretation that more mask-wearers are getting infected compared to non-mask wearers is incorrect.”", "The major finding of the CDC study, released Sept. 11, was that people in the survey with COVID-19 were twice as likely to have eaten at a restaurant, and that eating in restaurants or drinking in bars might be a higher risk activity. The report also found that people in the study with and without COVID-19 reported high levels of mask wearing in public. Among the approximately 150 COVID-19 patients in the study, 85% reported they “always” or “often” wore a face mask in the 14 days before illness onset.", "Although Trump offered a tepid endorsement of mask-wearing — “I’m OK with masks. I tell people wear masks” — as we have written, Trump often equivocates on the subject, as he then did at the town hall, saying: “I’ve heard many different stories on masks,” and, “Hey, Dr. Fauci said don’t wear a mask.”", "In the early months of 2020, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, and other federal public health officials did tell the general public not to wear face masks. However, as health officials learned more about the virus, and how often it was being transmitted by asymptomatic carriers, the CDC reversed course on April 3 and recommended that people begin “wearing cloth face coverings in public settings where other social distancing measures are difficult to maintain.”", "“Anybody who has been listening to me over the last several months know that a conversation does not go by where I do not strongly recommend that people wear masks,” Fauci said in an interview on Sept. 30 on ABC News’ “Start Here” podcast.", "As the CDC tweeted on Oct. 14, “Much evidence shows wearing masks in public reduces transmission by blocking exhaled respiratory droplets.”", "In an interview on Sept. 24 on the “Today” show, Health and Human Services Secretary Alex Azar said the official messaging from the White House has been “clear and unambiguous” in support of public mask-wearing since early April. But the president has continued to hold densely packed rallies where many supporters are not wearing masks. Trump has said little to discourage them.", "Trump insisted that his administration had done well and the coronavirus pandemic was taking a turn for the better.", "“And what we’ve done has been amazing. And we have done an amazing job,” he said. “And it’s rounding the corner, and we have the vaccines coming and we have the therapies coming.”", "Trump has professed that the U.S. is “rounding the corner” on the coronavirus for more than a month. But Fauci is on record disagreeing with that assessment.", "On Sept. 11, he told MSNBC that he was concerned that the U.S. still had too many infections as the weather turned colder.", "“We are plateauing around 40,000 cases a day and the deaths are around 1,000,” he said, adding that especially as people start to spend more time indoors, “you don’t want to start off already with a baseline that’s so high.”", "Since then, coronavirus cases have only increased. As of Oct. 15, the seven-day average of new cases is topping 53,000 a day, per the COVID Tracking Project, and an analysis from Johns Hopkins University shows cases are on the upswing in many states, especially in the upper Midwest.", "An Oct. 15 report from the COVID Tracking Project concluded that a “third surge” was underway, with cases and hospitalizations up “almost everywhere.”", "Johns Hopkins epidemiologist Caitlin Rivers told the New York Times that the country is “headed in the wrong direction,” and said the combined indicators of new cases, test positivity rates and hospitalization “give a very clear picture that we are seeing increased transmission in communities across the country.”", "As has been the case for months, the president warned of mail-in ballot fraud in the general election, citing military ballots — seven for him — that were found in a trash can in Luzerne County, Pennsylvania. State elections officials have since said the ballots were discarded in error, according to the Times Leader of Wilkes-Barre, Pennsylvania.", "In a Sept. 30 story, the paper quoted Jonathan Marks, the state deputy secretary for elections, as saying military and overseas ballots sometimes are mailed in envelopes that are not clearly marked as ballots.", "When moderator Guthrie pointed out that “your own FBI director said there’s no evidence of widespread fraud,” Trump responded: “Oh, really? Then he’s not doing a very good job. All you have to do is pick up the papers every day. 50,000 in Ohio, the great state of Ohio. 50,000 in another location, I think North Carolina. 500,000 applications in Virginia. No, no. There’s a tremendous problem.”", "Trump is wrong to cite Ohio, Virginia and North Carolina as examples of fraud. They were errors, and they have been or are being corrected.", "In Ohio, the Franklin County Board of Elections said in an Oct. 9 press release that “49,669 voters received an inaccurate ballot,” promising to have correct ballots mailed out in 72 hours. “We want to make it clear that every voter who received an inaccurate ballot will receive a corrected ballot,” the board said. “Stringent tracking measures are in place to guarantee that a voter can only cast one vote.”", "In Virginia, ABC7 reported in August that 500,000 ballot applications were mailed to Fairfax County residents by the nonprofit Center For Voter Information with the wrong information. The center blamed a printing error. “We don’t believe this organization was acting maliciously, they just were not very diligent in their follow-through,” Gary Scott, the county general registrar and director of elections, told ABC7.", "Similarly, 11,000 North Carolinians received inaccurate pre-filled voter registration applications — not actual ballots — from Civitech, a technology vendor that works with companies and campaigns to increase voter registrations, the North Carolina State Board of Elections said in an Oct. 6 press release. Civitech Chief Operating Office Sarah Jackel apologized and promised to send out “corrected mailers with blank applications to all affected NC recipients.”", "After Trump told an audience member that “we are going to take care of DACA” if he is reelected, Guthrie offered some facts about the Trump administration’s current approach to the Deferred Action for Childhood Arrivals program.", "“Mr. President, in point of fact, the DACA program, there are — under your administration — no new applicants are allowed and in fact the DACA recipients now have to renew every year as opposed to every two years. So in fact the DACA program has been curtailed by your administration,” Guthrie said.", "Trump then falsely suggested that those changes were due to the COVID-19 pandemic.", "“Well what happened is because of the pandemic, much changed on the immigration front,” he responded. “Mexico is heavily infected as you know and we’ve made it very, very difficult to come in because of the pandemic and other reasons, and crime.”", "First of all, the DACA program isn’t for new immigrants. As we’ve explained, the program was started in 2012, and it was designed to defer deportation proceedings for two years for qualified individuals who were brought to the United States illegally when they were children. The program also provides those who are approved work authorization, and the approvals can be renewed. Among the requirements for the program, an individual has to have been living in the U.S. continuously since June 15, 2007.", "The Trump administration began in 2017 an effort to “wind-down” the program. But in June, the Supreme Court blocked the administration’s termination of the program.", "Chad Wolf, acting secretary of the Department of Homeland Security, then issued a memo in July outlining “immediate changes to the DACA policy to facilitate my thorough consideration of how to address DACA in light of the Supreme Court’s decision.”", "Among them were the changes cited by Guthrie: “no new initial requests for DACA should be accepted” and “going forward, renewals of deferred action and the accompanying work authorization should be granted for one-year, rather than two-year, periods,” Wolf’s memo said.", "Trump once again claimed that Biden wants to raise taxes on “everybody” including “middle income” people, when in fact Biden has vowed he won’t raise federal income taxes on anyone making under $400,000 a year.", "Trump: And if Biden comes in and raises taxes on everybody, including middle income taxes, which he wants to do.", "As we’ve explained before, Biden’s tax plan would not directly increase federal income taxes on anyone making less than $400,000 a year. But it would also raise corporate income taxes — which experts generally agree would have the indirect effect of holding down wages.", "However, Biden has also proposed a number of new tax credits for low- and middle-income earners. And those would offset even the indirect effect of increased corporate taxes. The most recent estimate (issued Oct. 15) by the Urban-Brookings Tax Policy Center, for example, calculates that the net result of all Biden’s tax proposals would be, on average, an increase in after-tax income (in effect, a tax cut) for the bottom 80% of households, with the top one-tenth of 1% of earners bearing 70% of Biden’s proposed tax increases.", "The business-supported Tax Foundation comes to a similar conclusion in its latest study, figuring that the middle 20% of earners would see a 1.4% increase in after-tax income in 2021. (However, the Tax Foundation also figures that the dynamic effects of Biden’s tax proposals would eventually — over the long run — hold down economic growth by 1.5% and result in a 1.2% reduction in after-tax income for that middle quintile.)", "Trump painted a too-rosy picture of the economy, past and present.", "He boasted that before the COVID-19 recession, “We were up to 160 million jobs.” Not true. At its peak in February, payroll employment was 152.5 million.", "He spoke of gaining 11.4 million jobs. That’s the number of jobs that have been regained in the six months following the loss of 22 million jobs in March and April. Even after that rebound, the U.S. still had nearly 11 million fewer jobs last month than it did in February — and 3.9 million fewer than in the month Trump took office.", "He said that gross domestic product “is going through the roof” and predicted that “we’re going to have a phenomenal third quarter.” Maybe so, compared with the second quarter when the economy shrank at an annual rate of 31.4%, by far the worst since the government began keeping records. But 2020 is still expected to be a terrible year for growth overall. For example, the most recent forecast of the Federal Reserve Board members and Federal Reserve Bank presidents, issued Sept. 16, produced a median estimate of a 3.7% drop in real GDP in the fourth quarter, compared with the same quarter a year earlier.", "And he repeated his false claim that “we had the greatest economy in the history of our country” before the recession hit. As we’ve often pointed out, that’s not correct. Economic growth and job growth have been faster, and the unemployment rate has been lower, at several other points in history. For example, GDP grew 2.2% last year and 3.0% the year before, which was Trump’s best. It grew faster — 3.1% — in 2015, which was then-President Barack Obama’s best year.", "Guthrie asked Trump about QAnon and whether he would condemn the widespread conspiracy theory, which hinges in part on the unsupported notion that Trump is working to dismantle an elite child sex trafficking ring involving top Democrats.", "Guthrie: “Let me ask you about QAnon — it is this theory that Democrats are a satanic pedophile ring and that you are the savior of that. Now can you just once and for all state that that is completely not true and disavow QAnon in its entirety?”", "Trump responded: “I know nothing about QAnon. I know very little … I do know they are very much against pedophilia.”", "Later, when pressed again by Guthrie, Trump again said, “I just don’t know about QAnon.”", "We don’t know how much Trump knows or doesn’t know about QAnon, but it’s worth noting that the question was far from the president’s first encounter with the high-profile conspiracy theory. The FBI in 2019 described the theory as a domestic terror threat, according to a memo obtained by Yahoo News.", "Trump has repeatedly shared posts on Twitter from accounts that espouse the theory, and QAnon signage and paraphernalia has also regularly shown up at Trump rallies.", "During a press briefing in August, a reporter asked Trump about his thoughts about the theory’s growth, and he said he didn’t “know much about the movement” but had “heard these are people that love our country.”", "Trump, Aug. 19: Well, I don’t know much about the movement, other than I understand they like me very much, which I appreciate, but I don’t know much about the movement. I have heard that it is gaining in popularity. And from what I hear, it’s — these are people that, when they watch the streets of Portland, when they watch what happened in New York City in just the last six or seven months — but this was starting even four years ago when I came here. Almost four years; can you believe it?", "These are people that don’t like seeing what’s going on in places like Portland and places like Chicago and New York and other cities and states. And I’ve heard these are people that love our country, and they just don’t like seeing it.", "In a follow-up question, the reporter explained to Trump the core gist of QAnon — as Guthrie did — telling him, “Mr. President, at the crux of the theory is this belief that you are secretly saving the world from this satanic cult of pedophiles and cannibals. Does that sound like something you are behind or a believer in?”", "Trump replied: “Well, I haven’t — I haven’t heard that. But is that supposed to be a bad thing or a good thing? I mean, you know, if I can help save the world from problems, I’m willing to do it.”", "In an exchange with Guthrie about how well the U.S. has handled the coronavirus pandemic, Trump falsely claimed that “we’re a winner” on excess mortality.", "But the U.S. does not have an especially good record on excess mortality, or the number of people who died from any cause, relative to a “normal” or expected number of deaths. The metric is an alternative way of estimating the impact of the coronavirus that avoids issues of miscounting or underreporting COVID-19 deaths.", "According to a paper published in the Journal of the American Medical Association on Oct. 12 that compared the U.S. to 14 other countries, America had a higher rate of per capita excess mortality than all but two nations since the start of the pandemic through late July.", "Only two countries — Spain and the U.K. — had higher per capita rates for the entire pandemic, and when evaluating excess mortality after May or June, the U.S. had the worst record by far.", "Trump has previously bragged that the U.S.’s excess mortality is significantly lower than Europe’s. But as we’ve written, the best estimates suggest the American rate is higher, not lower, than Europe’s.", "University of Oxford economists Janine Aron and John Muellbauer concluded in a report published last month that the U.S.’s excess mortality rate is “substantially worse” than Europe’s.", "In updating our earlier analysis using figures from the Human Mortality Database to include data through Sept. 27, or week 39, we also find that America’s excess mortality rate is 14.5% higher than normal, compared with a collective total of 12.2% for European countries that have data available through the same time period.", "And the U.S.’s rate is higher than almost all of the 35 countries included in the database. Only Spain, Chile, England and Wales, and Italy have higher excess mortality rates (Italy includes data only up to week 26).", "Trump said: “We’ve also brought down the price of Obamacare.” Premiums for plans purchased on the Affordable Care Act exchanges have gone down in 2020 (by 3.5% for the lowest-cost “silver” level premium) and 2019 (by 0.4%), but that was after a double-digit increase for 2018 plans (up 29.7%).", "The large increase then was driven by the Trump administration’s elimination of cost-sharing subsidies on the marketplaces and insurer uncertainty over the ACA’s future. When insurers set marketplace premiums for 2019, the Urban Institute wrote in a January report, “it became clear that many of them had overreacted to the tumult and uncertainty” in pricing 2018 plans. So, those premiums, which do “vary considerably across states,” the report noted, have now dropped.", "Trump argued that the precautions his administration took to minimize COVID-19 spreading avoided an expected loss of “2,200,000 people.”", "“We did the right thing. We were expected to lose 2,200,000 people, and maybe more than that. We’re at 210,00 people,” Trump said. “One person is too much, it should have never happened because of China. … But we were expected to lose, if you look at the original charts from original doctors who were respected by everybody, 2,200,000 people. We saved 2 million people.”", "Trump has made this claim numerous times in the past. As we reported before, the 2.2 million figure is based on a model from Imperial College London in March that predicted U.S. deaths if no mitigation measures were taken and no individual behavior changes occurred.", "The figure, therefore, was not intended to be a practical estimate of the true number of losses.", "Research does support the idea that lockdowns — which were instituted by states, not Trump — saved lives earlier this year, although it’s hard to say how many.", "For instance, Columbia University researchers estimated that if the U.S. had implemented social distancing one week earlier in March, 36,000 fewer people would have died.", "As of Oct. 16, according to the Johns Hopkins University tracker, there have been more than 217,000 deaths in the U.S.", "Trump repeated a false claim that the state of Michigan was in the midst of a lockdown.", "Trump: We won a big case in Michigan because that governor has a lockdown where nobody but her husband can do anything. He can go boating and do whatever he wants but nobody else can.", "The president had made a similar false claim in an interview Oct. 8 with Fox News’ Sean Hannity, saying that the state was “closed,” specifically and falsely mentioning churches and schools. But as we have written, that is not the case.", "In fact, Michigan Gov. Gretchen Whitmer, a Democrat and a frequent target of Trump, on June 1 lifted the state’s stay-at-home order, which the governor issued in March to combat the spread of COVID-19. The vast majority of the state’s businesses are open with some restrictions, as are churches and schools, although some of the latter are teaching remotely.", "The situation in Michigan was complicated on Oct. 2 when the Michigan Supreme Court struck down as unconstitutional the 1945 law that Whitmer had relied on in issuing her emergency orders on COVID-19.", "In the wake of the ruling, the Michigan Department of Health & Human Services, citing authority not covered by the state Supreme Court ruling, issued an emergency order replicating several aspects of Whitmer’s orders. They include requiring wearing masks at indoor and outdoor gatherings; limiting the size of crowds at indoor and outdoor gatherings, with some exceptions; and requiring bars to close indoor common areas.", "The reference to Whitmer’s husband and a boat goes back to an embarrassing contretemps for the couple late in May. Just before Memorial Day, when the governor was urging Michiganders not to crowd waterfront areas due to concern about COVID-19, Whitmer’s husband, Marc Mallory, called a marina in Northern Michigan to see if it could get his boat in the water for the holiday. When told that it was impossible, Mallory asked if the fact that he was married to the governor would help.", "News about the request triggered criticism of the Whitmers, particularly from people upset about strict stay-at home policies Whitmer had imposed. The governor said it had simply been an unsuccessful stab at humor on her husband’s part.", "Trump repeated some false and misleading claims when answering an audience member’s question about the response to COVID-19 and his purported “travel ban.”", "“I put on a travel ban far earlier than Dr. [Anthony] Fauci thought it was necessary, who I like, far earlier than the scientists,” he said. “I was actually the only one that wanted to put it on, and I did it actually against the advice of a lot of people.”", "As we’ve explained before, the travel restrictions were not a “ban”; tens of thousands of people continued to fly to the U.S. from China.", "And Trump wasn’t the “only one” who wanted the restrictions. Health and Human Services Secretary Alex Azar said on Feb. 7 that the “travel restrictions … were the uniform recommendations of the career public health officials here at HHS.”", "Trump also again claimed that Biden called him “xenophobic and racist and everything else because I put [the travel policy] in.” Biden did call Trump “xenophobic” on the day the restrictions were announced, but it was unclear why he said that, as we’ve reported.", "Biden said during a campaign event that Americans “need to have a president who they can trust what he says about it, that he is going to act rationally about it.” He added, “This is no time for Donald Trump’s record of hysteria and xenophobia — hysterical xenophobia — and fearmongering to lead the way instead of science.”", "Biden took no public position on the travel restrictions at the time, but his deputy campaign manager, Kate Bedingfield, in an interview on April 3 said that he supported the measures. She further said that the “reference to xenophobia was about Trump’s long record of scapegoating others at a time when the virus was emerging from China,” and that he was not talking about the travel rules.", "Trump falsely claimed that the Obama administration “spied on my campaign and they got caught.”", "The Justice Department’s inspector general has investigated and found that there is no truth to that allegation. As we wrote, the FBI launched a counterintelligence investigation on July 31, 2016, into whether individuals associated with the Trump campaign were coordinating with the Russian government based on information from a “Friendly Foreign Government,” according to the Department of Justice’s Office of the Inspector General report on the origins of the investigation.", "The inspector general’s report released in December 2019 found no evidence of illegal “spying” — either before or after the FBI opened the investigation, known as Crossfire Hurricane. “We did not find any documentary or testimonial evidence that political bias or improper motivation influenced the FBl’s decision to conduct these operations,” the report said. “Additionally, we found no evidence that the FBI attempted to place any CHSs [confidential sources] within the Trump campaign, recruit members of the Trump campaign as CHSs, or task CHSs to report on the Trump campaign.”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]