["\"AMERICA IN DECLINE,\" begins a description of a photo of what looks like President Joe Biden asleep at his desk in the Oval Office with a caption that describes him as a \"decrepit old grifter\" who \"works MAYBE five hours a day.\"", "But the photo, which is spreading widely on social media, appears to be doctored.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The original photo appears to be an image used by some news organizations reporting on the executive orders Biden signed on his first day in office.", "In this version of the photo, Biden’s hands appear on the desk as they do in the image being shared on social media. There is also a stack of executive orders sitting next to him and he’s wearing the same blue suit and tie. Only in the original, he’s also wearing a black face mask and looking up, eyes open.", "Video footage from that day shows the president wearing a mask, signing orders and speaking to the reporters as cameras can be heard clicking in the background.", "We found nothing to support the allegation that he was caught and photographed sleeping at his desk.", "The public schedule the Biden transition team released for Jan. 20, the day that picture was taken, began with an 8:45 a.m. church service and ended with a 9:55 p.m. appearance by Biden and the first lady on the Blue Room Balcony.", "The president’s public schedule is available online. While it doesn’t detail his every move on a given day, it shows Biden working full days with events slated for the mornings, afternoons and evenings.", "We rate this image False.", "Facebook post, Feb. 5, 2021", "Yahoo News, Everything Joe Biden has done since coming into office, Jan. 21, 2021", "WTVY, Biden signs orders on food and unemployment ais as talks start on big aid plan, Jan. 20, 2021", "The White House, President Biden signs executive orders and other presidential actions, Jan. 20, 2021", "The New York Times, Biden’s 17 executive orders and other directives in detail, Jan. 20, 2021", "CNN, Joe Biden and Kamala Harris’ public schedule on Inauguration Day, Jan. 20, 2021", "Factba.se, Joe Biden — President’s public schedule, visited Feb. 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]