["Georgia Democratic congressional candidate Jon Ossoff speaks to volunteers in his Cobb County campaign office on March 11, 2017. (AP/Bill Barrow)", "A day before a special election in Georgia to replace former U.S. Rep. Tom Price, President Donald Trump went on Twitter to criticize the top Democratic contender.", "\"The super Liberal Democrat in the Georgia Congressioal (sic) race tomorrow wants to protect criminals, allow illegal immigration and raise taxes!\" Trump tweeted April 17.", "The super Liberal Democrat in the Georgia Congressioal race tomorrow wants to protect criminals, allow illegal immigration and raise taxes!", "Eighteen candidates from all parties are seeking Atlanta’s 6th Congressional District seat, which Republicans have held for decades and is now up for grabs after Price joined the Trump administration as secretary of Health and Human Services.", "While Trump did not explicitly name Jon Ossoff in his tweet, the 30-year-old Democrat has emerged as the leading contender in the closely-watched race.", "In his tweet, Trump inaccurately characterized Ossoff’s immigration stance. The candidate has spoken in favor of securing the U.S. borders.", "The White House did not provide comment.", "Ossoff dismissed Trump’s tweet.", "\"While I’m glad the president is interested in the race, he is misinformed,\" Ossoff said in a statement.", "At an April 9 candidate forum, Ossoff spoke in favor of securing the borders. He did, however, have harsh words for Trump’s immigration promise to deport all undocumented immigrants.", "\"The notion that we are going to massively deport more than 11 million people is absurd. There is no way a program like that could be implemented constitutionally, in a way that is fiscally responsible or in a way that is humane,\" Ossoff said. \"The only real solution is comprehensive immigration reform that secures our borders and provides a path to legal status for non-felons who are here without proper documentation.\"", "That message is also delivered in a civil rights and liberties section on his campaign website.", "\"America needs a strong border policy that protects American citizens and American jobs,\" the section said. \"We should welcome those strivers who, like our own forebears, seek the opportunity to work hard, play by the rules, and build better lives in America.\"", "Ossoff also scoffed at another idea Trump floated during the presidential campaign. Ossoff’s campaign website says he believes \"it’s unconstitutional to ban anyone from entering our country on religious grounds.\"", "Trump’s executive orders to temporarily stop the entry of individuals from certain countries have been criticized by immigrant advocates and Democrats as a \"Muslim ban.\" (Those orders have been halted by courts.)", "NumbersUSA, an advocacy group that promotes reduced immigration, rates candidates on a wide range of issues, such as their position on amnesty, ending birthright citizenship and border security.", "On whether Ossoff is on the side to secure the border, NumbersUSA gave Ossoff a \"Yes\" rating.", "NumbersUSA said it bases its ratings on responses to its survey or on candidate statements on campaign websites and in news reports.", "Trump’s tweet called out Ossoff for wanting to \"protect criminals\" and \"raise taxes.\" But those characterizations also misrepresent the facts.", "Ossoff’s campaign website said he would work to empower law enforcement with tools and resources needed to bring down organized criminals, but would also seek to reduce mass incarceration of nonviolent offenders. Ossoff also said he would work to \"reduce the tax burden on small businesses and simplify small business tax filing.\"", "Our ruling", "In a tweet alluding to Ossoff, Trump tweeted that Ossoff wants to \"allow illegal immigration.\"", "Trump’s vague attack mischaracterizes Ossoff’s stance.", "Unlike Trump’s plan, Ossoff’s approach to immigration includes a path to citizenship or legal status for immigrants here without permission. Ossoff has also criticized Trump’s one-time promise to deport all immigrants in the country illegally as not feasible.", "Trump neglects that Ossoff supports strong border security — to prevent illegal immigration.", "We rate Trump’s statement Mostly False.", "Twitter, @realDonaldTrump tweet, April 17, 2017", "YouTube, Candidate Forum for Georgia’s 6th Congressional District hosted by Dunwoody HOA & The Crier 04/09/17, published April 10, 2017", "Email exchange, Jon Ossoff's campaign, April 17, 2017", "Jon Ossof campaign website, accessed April 17, 2017", "Atlanta Journal-Constitution, When is the Georgia special election to replace U.S. Rep. Tom Price?, April 16, 2017", "NumbersUSA, Jon Ossoff, accessed April 17, 2017", "Atlanta Journal-Constitution, Donald Trump slams ‘super Liberal Democrat’ in Georgia special election, April 17, 2017", "PolitiFact, Trump-O-Meter: immigration promises", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]