["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Cobb County Schools system will ask voters on Tuesday to extend its penny sales tax for another five years for several projects, including renovating facilities like Walton High School which has several overcrowded classrooms like this one.", "On Tuesday, Cobb County residents will go to the polls to vote on a fourth installment of the school system’s sales tax plan.\n\nThe 1-cent special purpose local option sales tax, or SPLOST (E-SPLOST when the tax program is conducted by and for a school system), will be collected for five years beginning in 2014. The system expects to bring in about $717.8 million in tax collections to pay for a host of capital projects.\n\nOpponents of the program say the project list includes unnecessary items that the district \"wants\" but doesn’t need, and that E-SPLOST renewals have become the \"crack cocaine\" of the school system. School system administrators and tax supporters argue that the tax is a good alternative to property tax increases. In addition to that, supporters say, the E-SPLOST has long helped the system’s bottom line by providing money to pay off long-term debts and avoid new bond debt for system projects.\n\n\"Cobb is also one of the largest school systems that is debt free,\" education activist JoEllen Smith said in a newspaper editorial published in a local paper last month. \"If SPLOST doesn’t pass, bonds will have to be issued or reserves used.\"\n\nPolitiFact Georgia wondered if that enviable position was indeed true. It’s hard for most people to pay off personal consumer debt, let alone a school system responsible for funding the educational needs of just over 108,000 students.\n\nThe district, the second largest in the state, has an 11-minute website video that includes the debt-free claim. And some Kennesaw businessmen, Jay Cunningham of Superior Plumbing and John Loud of Loud Security Systems, are featured in a SPLOST advocacy video also making the debt claim.\n\nSmith is a volunteer for EmpowerED Georgia, a group of parents and teachers that estimates its membership at 3,500. She and Cobb Schools spokesman Jay Dillon pointed us to a 2010 census education finance report. That report, issued in June 2012, was taken from 2010 data tables that were updated in November 2012 and collected from each state. Using the updated data, Cobb is listed as the 23rd-largest school system in the country (of the more than 14,000 listed) based on enrollment. Gwinnett County Public Schools -- Georgia’s largest school system -- is ranked 14th.\n\nThe report shows that Cobb has zero long-term outstanding debt at the end of the fiscal year. The system also has no short-term debt, Dillon said. Gwinnett is not in the same fortunate financial position as Cobb. Gwinnett still has almost $580 million in debt on the books to be paid off, a schools spokesman told us. That county funds its construction projects through a portion of property tax collections, and will use current E-SPLOST revenue to pay off bonds that were used to finance some projects.\n\nThe census report showed that Clayton County was the only other metro Atlanta school system without any long-term debt. Clayton County Public Schools, ranked 88th in size, paid off its last bond debt as part of a SPLOST passed in 1998, a district spokesman told PolitiFact Georgia.\n\nCobb’s current five-year E-SPLOST expires Dec. 31, 2013. Approval from voters next week would keep the sales tax collections continuous through 2018. The money is expected to pay for several new gyms, theaters and wings, along with 407 new classrooms, at schools throughout the district.\n\nGetting approval from voters could be a challenge. In 2011, a four-year extension of the county’s SPLOST for parks, recreation and road renovation throughout Cobb passed by only 79 votes. And a 10-year regional transportation SPLOST failed in Cobb by almost 38 percentage points.\n\nPaying for capital projects, like new schools and classroom expansions, with E-SPLOST funds is quite common in Georgia, said Herb Garrett, executive director of the Georgia School Superintendents Association.\n\nBefore the E-SPLOST legislation was passed, school systems had to pay for projects through their operating funds intended for day-to-day expenses, or through bonds. Under the bond method, the money was immediately available but was paid back with interest over several years, instead of the pay-as-you-go method of financing projects with E-SPLOST collections.\n\nUsing E-SPLOST funds, Cobb Schools paid off $184 million in bond debt in 2007. The school system has incurred no additional debt since then, meaning it has no outstanding bonds or loans, a state Education Department spokeswoman told us.\n\n\"The SPLOST program has allowed a rapidly growing state to meet its need for school buildings,\" Garrett said.\n\nSo what’s the fiscal fallout?\n\nEducation activist and education sales tax supporter JoEllen Smith said that Cobb County Schools is one of the largest systems in the nation that is debt free.\n\nThe district is the second largest in the state, and is the 23rd largest in the country, according to the Census Bureau.\n\nCobb Schools has used previous sales tax collections to pay off long-term bond debt, which education experts said is common practice in Georgia. This pay-as-you-go system of funding projects has kept the county school system debt free.\n\nWe rated Smith’s statement True.", "Marietta Daily Journal, \"Ed-SPLOST passage won’t raise sales tax,\" JoEllen Smith, Feb. 22, 2013\n\nPhone interview, JoEllen Smith, March 12, 2013\n\nPhone interview, Jay Dillon, spokesman, Cobb County School District, March 12, 2013\n\nU.S. Census Bureau, Public Elementary-Secondary Education Finance Data, individual unit tables for all school systems, updated Nov. 20, 2012\n\nU.S. Census Bureau, Public Education Finances 2010: Governments Division Reports, Mark Dixon, issued June 2012\n\nAll News 106.7, \"Will Cobb voters extend the ESPLOST?\" March 11, 2013\n\nMarietta Daily Journal, \"Cobb Schools SPLOST rhetoric heats up in run-up to vote,\" LIndsay Field, Feb. 17, 2013\n\nPhone interview, Herb Garrett, executive director, Georgia School Superintendents Association, March 13, 2013\n\nGeorgia secretary of state, July 31, 2012, primary election results\n\nPhone interview, Jorge Quintana, spokesman, Gwinnett County Public Schools, March 13, 2013\n\nCobb County School District, SPLOST 4 information, district website\n\nEmail interview, Clayton County Public Schools spokesman, March 13, 2013\n\nKennesaw Patch, \"Kennesaw businessmen in pro-SPLOST video,\" Wendy Parker, March 8, 2013\n\nEmail interview, Dorie Nolt, spokeswoman, Georgia Department of Education, March 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]