["About this rating", "Kellogg's announced that it was adding peanut flour to some of its products.", "Kellogg's did not fail to announce this change to the public.", "On 5 May 2016, the web site Snack Safely published an article reporting that Kellogg's was adding \"traces\" of peanut flour to all of its products:", "As we predicted, Kellogg’s is now intentionally adding traces of peanut flour to other products beyond their Keebler and Austin Cracker lines.", "[...]", "To date, the company has issued no press release explaining their decision to add minute quantities of peanut flour, but we can only surmise that we are in the early stage of a plan to add traces of allergens across much of their product line to avoid the complications of complying with the FSMA that were intended to make foods safer for the allergic community, not the opposite.", "While it is true that Kellogg's has recently added peanut flour to some its products, the article included some misleading information. The Snack Safely article used Kellogg's Nutri-Grain \"Fruit Crunch\" bars as evidence that the company was adding peanut flour to additional products, but those products are no longer available, and already contained peanut flour when they were introduced in 2012.  Kellogg's said in a statement that the information from Snack Safely is inaccurate:", "The “Fruit Crunch” Nutri-Grain bars mentioned in the Snack Safely blog post have been discontinued and are no longer on the market. Additionally, they always had peanut flour listed as an ingredient since they were introduced in 2012, and there is currently no new product or ingredient change.", "There have been changes to some products from the company.  However, the insinuation that it was done in secrecy and that Kellogg's has not commented on the ingredients in its products is misleading. At least two statements (one regarding the Austin Cracker line and one regarding Keebler) explained the ingredient updates, and subsequent label adjustments, in April 2016:", "The Kellogg Company would like you to know that starting in April, 2016 Austin will be changing the allergen statement on four flavors of sandwich crackers under the Austin® label.  The flavors, Austin® Cheddar Cheese Cracker Sandwiches, Austin® Grilled Cheese Cracker Sandwiches, Austin® Pepper Jack Cracker Sandwiches and the Austin® Variety Pack Cracker Sandwiches will contain Wheat, Milk, Soy, and Peanut ingredients.", "While Snack Safely also accused Kellogg's of adding peanut flour to its products in order to \"avoid the complications of complying with the Food Safety Modernization Act,\" they provided no evidence to back up that assertion:", "It is surmised that Kellogg’s is preemptively adding minute quantities of peanut flour to these crackers so the ingredient can be added to the ingredient list. This will allow the company to avoid the costs of complying with directives of the Food Safety Modernization Act (FSMA) that go into effect this September.", "Rather than implement the additional requirements of the new FSMA directives, it is believed Kellogg’s is adding trace amounts of the allergen to dispense with the entire process. If this is indeed true, they are making their products more allergenic in order to avoid the costs of complying with directives intended to make product safer.", "The main critique of the article published by Snack Safely (and the accompanying petition) is that Kellogg's did not do a good job of alerting the public about the change. While that is a matter of debate, the company does say that parents should always check the packaging, as the ingredients list occasionally goes through changes:", "Because product formulations may change from time to time, consumers are strongly encouraged to read the package label prior to every purchase.", "While it is true that Kellogg's added peanut flour to some of its products in 2016, there's no evidence that the decision to do so was to \"avoid the complications of complying with the Food Safety Modernization Act.\" After all, Kellogg's has announced dozens of ingredient changes over the years. Further, the company also said that it will be releasing an Austin Cracker flavor that does not contain peanut flour this September:", "As we told you when we first announced the change, we've been exploring ways to make a sandwich cracker that parents of children with peanut allergies can buy. Today, I want to share with you that we will be making our Austin Grilled Cheese Sandwich crackers without peanut products. They will be available in stores starting in September.", "Given the prevalence of peanut and other nut allergies and the strictness of the Food and Drug Administration (not to mention the high-profile public relations nightmare that would ensue after a spate of allergy-related illnesses or deaths) it seems extraordinarily unlikely that any company would alter recipes for popular foods in secret to introduce ingredients that would have a potentially devastating effect on its consumers.", "On 11 May 2016, Snack Safely published the following retraction:", "Yesterday, we posted an article entitled “Kellogg’s Now Adding Traces of Peanut Flour Across Product Lines” that asserted that Kellogg’s had recently begun adding trace quantities of peanut flour to Nutri-Grain Apple Cobbler Fruit Crunch Bars, much like their recent addition of peanut flour to the company’s Keebler and Austin cracker varieties.", "Despite our best efforts to verify the timing of this addition, we were wrong. Though the product information is listed on the company’s website, the product itself has been discontinued. We apologize to you, or readers, and to the Kellogg Company for this error.", "That said, this does not alter our belief that the company is adding minute quantities of peanut flour – as they have done with the Keebler and Austin crackers – to avoid the complications and cost of complying with new, stricter FSMA directives regarding the handling of allergens that take effect this September. We reiterate our call to the company to explain why they are adding this allergen to products and end the speculation.", "Kellogg's dispelled some of the rumors about its recent decision to add peanut flour to a few select products in an article published on the company's \"Open For Breakfast\" web site:", "Myth: Kellogg added peanut flour to some Keebler and Austin sandwich crackers to avoid complying with the Food Safety Modernization Act (FSMA)", "Fact: This is completely false. Food safety is a top priority for us at Kellogg. Our food safety standards are in full compliance with FSMA and FDA regulations issued under FSMA. These products all remain subject to FSMA and are not exempt from regulation.", "FSMA requires food companies to include allergen control as part of their hazard analyses and to ensure allergen preventative controls are in place where appropriate. Kellogg does all of these things. We carefully identify and evaluate all food safety hazards, including hazards posed by allergens.", "Guided by our robust hazard analysis, we have controls in place to prevent allergen cross-contact and contamination during shipping, receiving, storage, handling and use of all ingredients. We also have controls in place to ensure proper labeling of allergens on our foods. In many areas, our food safety standards even go above and beyond those required by the FDA.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]