["About this rating", "If you or someone you know is experiencing a mental health, suicide or substance use crisis or emotional distress, reach out 24/7 to the 988 Suicide and Crisis Lifeline (formerly known as the National Suicide Prevention Lifeline) by dialing or texting 988 or using chat services at suicidepreventionlifeline.org to connect to a trained crisis counselor.", "For most people, voyages aboard cruise ships are pleasant diversions, a form of recreation that allows vacationers to travel to exotic destinations while taking the comfort and luxury of a fine hotel room along with them. For some people, cruise ships have even become a way of life, as a few retirees have opted to spend their golden years permanently at sea. Have such ocean voyages now become a way of death as well, with a company offering \"euthanasia cruises\" on which the terminally ill (and others wishing to end their lives) can quietly expire in the company of like-minded individuals by sliding overboard into the sea?", "A Snopes reader writes:", "Is this true?", "“A group of Florida businessmen has created a company called Euthanasia Cruises, Ltd. Each month the company takes 25 passengers on The Last Supper, a three-masted luxury sloop, for three days at sea before the passengers voluntarily end their lives by jumping into the ocean. Although a few passengers are terminally ill, most are able-bodied adults.”", "Not quite. The information about \"Euthanasia Cruises, Ltd.\" quoted above was taken from a satirical column by prankster Alan Abel which was published in the Fairfield County Weekly on 16 February 2006. (Abel is a regular contributor to that publication; similar recent spoof articles by him have featured a Michigan restaurant called \"Hitler's Drive-In,\" operated by a proprietor who is the spitting image of his infamous German namesake, and plans to build a Miles Standish-inspired \"Pilgrims' Casino\" in Connecticut.)", "Although the example article cited here was published in 2006, the \"euthanasia cruise\" column is actually a rehashing of a hoax Alan Abel first unleashed back in 1993.", "Abel, Alan.   \"Euthanasia Cruises.\"\r\n    Fairfield County Weekly.   16 February 2006.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]