["By Angelo Fichera", "Posted on August 26, 2020", "A baseless conspiracy theory on Facebook suggests that the California wildfires were started by a “powerful laser.” The meme spreading the theory uses the same photos that circulated in 2018 to advance a similar claim.", "Facebook users are sharing a meme that recycles a conspiracy theory about California wildfires, and pulls out old photos to do so.", "An Aug. 25 post shared by 10,000 users is suggesting that the wildfires — which officials have attributed to lightning, a heat wave and dry conditions — were started by “powerful lasers.”", "“All of these images were captured during the wildfires in California,” the meme reads. “Is this evidence that powerful lasers were used to cause these fires?”", "No, it’s not.", "The images are actually the same ones that were shared on Twitter in November 2018 by Michael Coudrey, a conservative social media voice whose old Twitter account used the name “Mike Tokes.”", "At the time, a similar conspiracy theory was being spread through YouTube videos, as the Daily Beast reported then. The theory claimed that laser-caused fires were making way for a high-speed rail system.", "So, for starters, none of the pictures are from the current wildfires in California.", "Coudrey’s 2018 tweet described the photos in question as “[u]ser submitted photos on Facebook of the California fires” that “show weird beams of light emiting from the sky causing fires, destruction & property damage.”", "Here’s some background we found on each of the four photos used in the meme:", "In short, as we said, none of the photos in the meme are recent images from the California wildfires, and there’s no evidence that any of the fires were caused by “powerful lasers.”", "Officials have said lightning, plus the extreme heat and dry conditions, are to blame for the fires.", "According to CAL FIRE, California’s fire authority, there have been nearly 14,000 lightning strikes since Aug. 15. Since then, there have been more than 700 new wildfires, which have collectively burned more than 1.32 million acres. There are seven reported fatalities, and nearly 1,700 structures have been destroyed.", "The National Park Service has estimated that 10% of all wildfires in the U.S. are caused by lightning strikes.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“California Statewide Fire Summary August 26, 2020.” CAL FIRE. 26 Aug 2020.", "Evon, Dan. “Did a ‘Direct Energy Weapon’ Strike Michigan?” Snopes. 18 Jan 2018.", "Sommer, Will. “Conspiracists Blame California Fires on Airborne Laser Guns.” Daily Beast. 16 Nov 2018.", "SpaceX (@SpaceX). “More photos from today’s Falcon 9 launch → http://flickr.com/spacex.” Twitter. 22 May 2018.", "“Spreading Wildfires in California Have Killed 4.” New York Times. 20 Aug 2020.", "“Southern California Edison reaches $210 million settlement with LA County, Malibu over Woolsey fire claims.” Los Angeles Daily News. 13 Nov 2019.", "U.S. Forest Service – Klamath National Forest (@Klamath_NF). “Good Morning. Here is a photo of the Noland Fire, discovered earlier this morning near Carter Summit on the Salmon/Scott Ranger District. Fire suppression resources are currently walking in to this incident.” Twitter. 24 May 2018.", "“Wildland Fire Program | FAQs.” National Park Service. Updated 6 Jun 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]