["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The U.S. Postal Service is having financial problems, but \"not for the reason you might think,\" says a new ad from unions representing postal workers.\n\n\"The Postal Service is critical to our economy – delivering mail, medicine and packages,\" the ad says. \"Yet they’re closing thousands of offices, slashing service, and want to lay off over 100,000 workers. The Postal Service is reporting financial losses but not for reasons you might think. The problem: a burden no other agency or company bears, a 2006 law that drains $5 billion a year from post office revenue, while the Postal Service is forced to overpay billions more into federal accounts. Congress created this problem, and Congress can fix it.\"", "The ad makes it sound so simple -- if only Congress would fix the unfair law making the post office pay the federal government. But our research showed the post office had more problems than just the financial requirements of a 2006 law.", "To begin with, the U.S. Postal Service is a unique agency. It's meant to be self-sustaining, paying for itself from the money it makes off postage and other mail services. But unlike a private business, it has to follow rules set by Congress that result in higher costs, such as universal delivery.", "In recent years, as Internet communication has increased, the number of pieces mailed has been in decline. For a few years, postal revenues were nevertheless stable, but then they too started to decline. Patrick Donahoe, the U.S. Postmaster, said recently that first-class mail is dropping at a rate of 7.5 percent a year. While the post office has made up for some losses through productivity increases, it hasn't been able to make up enough.", "That has the post office looking for ways to save money and increase revenues, and for most significant changes, it has to get permission from Congress. Just as the ad says, the post office has floated the idea of closing smaller post offices, cutting Saturday service and laying off workers. Others have suggested that the post office get into new lines of business, but again, the Postal Service would need permission from Congress. \n\nThe ad is also largely correct that a 2006 law, the Postal Accountability and Enhancement Act, requires the post office to make payments \"into federal accounts.\" What the ad doesn't mention is the payments are meant to fund health benefits for future Postal Service retirees. The law requires that the Postal Service pay about $5 billion a year toward future health benefits for 10 years, until 2017. A 2009 report from the nonpartisan Congressional Research Service determined that the payments were having a \"considerable\" impact on the post office's profitability.", "The ad also mentions \"billions\" that the Postal Service is \"forced to overpay\" into federal accounts. This claim has to do with whether the Postal Service is required to pay more than needed for future pension benefits, and there's a lively debate over the issue. Inspectors general -- one from the U.S. Postal Service and another from the U.S. Office of Personnel Management -- have issued conflicting reports over the obligations and how they should be handled.", "Finally, we found widespread agreement that the Postal Service's problems are greater than just the retirement rules. Here's what Donahoe, the postmaster general, told the PBS NewsHour on Sept. 6, 2011: \"The problem is, when you start to look forward, even with the pre-funding money given back to us -- which there's not a lot of people coming forward telling us that they're going to give us that money -- the problem is, when you start to go forward, the volume and revenues continue to go down. We are losing first-class mail at the rate of 7.5 percent a year. That's not going to change.\"", "The postal unions themselves acknowledge in their press materials for the ad that changes to the retirement rules alone would not solve the Postal Service's financial problems. But changing the rules would buy time to come up with other ideas and solutions. \"This cannot be done in the current panic mode, with congressional inaction forcing management to throw every possible cut against the wall to see what sticks, while anti-government ideologues exploit the situation,\" said the unions in a written statement.", "The postal unions' ad blames financial problems on \"a 2006 law that drains $5 billion a year from post office revenue, while the Postal Service is forced to overpay billions more into federal accounts.\" The ad is right that the law did require payments of approximately that amount and that those payments have had a significant effect on the post office's bottom line. The additional overpayments are subject to debate. Even so, the law is hardly the only challenge the post office faces; it's also facing continuing declines in first-class mail. So we rate the ad's claim Half True.", "Save America's Postal Service, television ad and information sheet, accessed Sept. 28, 2011\n\nU.S. Office of Personnel Management Office of the Inspector General (OIG), OPM OIG Issues Study on USPS OIG's Proposals Regarding the Funding of USPS Retiree Benefits, Feb. 28, 2011\n\nU.S. Postal Service Office of the Inspector General, Federal Employees Retirement System FERS Overfunding, Aug. 16, 2010", "U.S. Postal Service Office of the Inspector General, Summary of Substantial Overfunding in Postal Service Pension and Retiree Health Care Funds, Sept. 30, 2011", "THOMAS, The Postal Accountability and Enhancement Act, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]