["About this rating", "On March 19, 2021, a video went viral on social media that supposedly showed U.S. President Joe Biden slipping and falling while ascending the stairs of Air Force One:", "This is a genuine video of Biden falling on the stairs of Air Force One.", "This video was taken on March 19, 2021, at Joint Base Andrews in Maryland and shows Biden before he departed to visit the Centers for Disease Control and Prevention (CDC) and to meet with Asian American leaders in the aftermath of a shooting that left eight people, including six Asian women, dead in Atlanta, Georgia.", "The above-displayed video was captured by Reuters reporter Trevor Hunnicutt. Photographs from Getty Images (such as the one at the top of this article) also documented Biden's tumble. The Hill posted a second video showing this fall from a different angle:", "White House Principal Deputy Press Secretary Karine Jean-Pierre said that Biden was uninjured in the fall. Jean-Piere said: “It was very windy. I almost fell coming up the steps myself. He is doing 100 percent. ... He’s doing fine. He’s preparing for the trip just fine.”", "As videos of Biden falling on the stairs of Air Force One went viral, many people commented that Biden's mishap was reminiscent of actor Chevy Chase's portrayal of U.S. President Gerald Ford on \"Saturday Night Live\" in the 1970s.", "In December 1975, Ford, like Biden, truly slipped and fell on the stairs of Air Force One. Here's some archival footage of the mishap from The Associated Press:", "President Ronald Reagan also slipped and fell on the steps of Air Force One. A 1984 photograph from Getty entitled \"President Reagan Falling Down Stairs\" carried the caption: \"President Reagan slips and falls to the deck of the stairway ramp to Air Force One as he was ascending the steps at King County Airport in Seattle. The president fell on the second stair from the top, picked himself up and waved to the crowd after earlier addressing an audience in Seattle.\"", "https://www.gettyimages.com/detail/news-photo/president-reagan-slips-and-falls-to-the-deck-of-the-news-photo/515129044", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]