["About this rating", "An asteroid will approach Earth on Nov. 2, 2020, the day before Election Day in the U.S. Asteroid 2018 VP1 is expected to come within about 3,000 miles of the Earth and has a slight chance (1 in 240) of entering the planet's atmosphere.", "Asteroid 2018 VP1 is not a large asteroid. If it does enter the earth's atmosphere, it is expected to burn up before making impact.", "When the words \"asteroid,\" \"impact,\" and \"Earth\" make their way into news headlines circulated on social media, it's easy to see why some internet users may come away with the impression that a catastrophic event will soon befall the planet. This was especially true in 2020, as many internet users felt — with a global pandemic, forest fires, volcanic eruptions, murder hornets, civil unrest, and heightened political tensions — that humanity's luck had simply run out.", "It's true that an asteroid will approach Earth on the day before the 2020 U.S. Presidential Election. However, this is a small asteroid with an even smaller chance of causing any damage to our planet.", "Asteroid 2018 VP1 is expected to come within 3,000 miles from Earth on Nov. 2, the day before Election Day in the United States. There's a small chance (1 in 240, or 0.41 percent) that the asteroid will make an even more direct approach and that it could even find its way into the planet's atmosphere.", "However, Asteroid 2018 VP1 is very small. According to NASA, this asteroid is only about 6.5 feet long. If it does head directly toward Earth, this asteroid will burn up in the planet's atmosphere before making impact.", "Donald Yeomans, a senior researcher at NASA’s Jet Propulsion Laboratory, told The New York Times: “Close approaches by small objects of this size are not rare, and even if something of this size were to impact, the object would not likely survive the Earth’s atmosphere.”", "NASA's official Twitter account, @asteroidwatch, dedicated to potentially hazardous space objects, posted a message to explain that Asteroid 2018 VP1 does not pose a danger to the planet:", "While there's a chance that 2018 VP1 will enter the Earth's atmosphere, in all likelihood it will pass by Earth without incident.", "Space.com writes:", "This year's flyby will be the asteroid's first close approach to Earth since it was discovered in 2018 by the Zwicky Transient Facility at Palomar Observatory near San Diego. But while scientists call the event a close approach, the space rock will remain quite far away from Earth: more than 260,000 miles (420,000 kilometers) away. That's about the same distance at which the much larger moon orbits Earth.", "NASA is constantly monitoring the skies for potentially hazardous objects. Asteroids that pose a serious threat to the planet are classified as Potentially Hazardous Asteroids (PHAs). Asteroid 2018 VP1 is much smaller (6.5 feet) than the required 500 feet to be classified as a PHA.", "Here's a description of the PHA requirements from NASA (emphasis ours):", "Potentially Hazardous Asteroids (PHAs) are currently defined based on parameters that measure the asteroid's potential to make threatening close approaches to the Earth. Specifically, all asteroids with an Earth Minimum Orbit Intersection Distance (MOID) of 0.05 au or less and an absolute magnitude (H) of 22.0 or less are considered PHAs. In other words, asteroids that can't get any closer to the Earth (i.e., MOID) than 0.05 au (roughly 7,480,000 km or 4,650,000 mi) or are smaller than about 140 m (~500 ft) in diameter (i.e., H = 22.0 with assumed albedo of 14%) are not considered PHAs.", "Asteroid 2018 VP1 is cataloged in NASA's Small-Body Database.", "Bowler, Jacinta.   \"Here's The Real Truth About That 'Election Day' Asteroid on Its Way to Earth.\"\r\n    Science Alert.   24 August 2020.", "Overbye, Dennis.   \"Just in Time for the Election: An Asteroid?\"\r\n    The New York Times.   23 August 2020.", "Bartels, Meghan.   \"No, An Asteroid Will Not Hit Earth the Day Before Election Day.\"\r\n    Space.com.   24 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]