["School attendance increased “from 51% in 1994 to 99% today”", "“Since 1994, over 4.7 million free houses have been built benefiting over 14 million people.”", "“More recently, we introduced unprecedented legislation in South African history – the national minimum wage – which will improve the wages of at least 6 million workers who are currently being paid below the national minimum wage level of R20 an hour.”", "“We have invested more than R2 trillion in infrastructure projects over thepast 10 years to build more schools, clinics, roads and the freight logistics network.”", "“Our support for university and TVET college students from poor and working-class backgrounds through the national student financial aid scheme (Nsfas) has hugely increased from R70 million in 1994 to nearly R15 billion last year.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]