["An image of a room with twin single beds in circulating on social media with the claim that it’s of a hostel room in Jawaharlal University, Delhi. From a Facebook page ‘I Support PM’ the post has received 12,000 shares and over 6,000 likes. The text on the infographic reads, “आज 10Rs.में चाय समोसा नहीं मिलता और JNU के इन मुफ्तखोटों को दिल्ली जैसे शहर में 10Rs.में कमरा मिला हुआ है वो भी हमारे टेक्स के पैसों से !!! (Today, you don’t even get a samosa for Rs 10 and these freeloaders from JNU get a room for Rs 10 in a city like Delhi with our taxes.)“", "The post was created by a page named ‘Bharat Vikas’ on November 14.", "आज 10Rs.में चाय समोसा नही मिलता और…", "Posted by Bharat Vikas – भारत विकास on Thursday, 14 November 2019", "A reverse image search on Yandex led us to a website which carried an image of the same room taken from a different angle and described as, “Students Inn Housing.”", "A keyword search led us to the Facebook page of ‘Students Inn Housing’ which is a paying guest (PG) accommodation in Delhi/ NCR. The same image was shared on May 16, 2018.", "It’s the personal touch that will help you feel at home immediately * #students #studentsinn #delhiuniversity #delhigram #delhi #hospitality #hostel #accomodation #pg", "Posted by Students Inn on Wednesday, 16 May 2018", "Alt News contacted students from JNU who shared photographs of the college hostel rooms. As evident, they aren’t similar to the viral photograph.", "In the midst of the ongoing protest against hostel fee like in JNU, which will nearly double the annual fee for students living in campus, a photograph of a PG accommodation was shared on social media as a hostel room in the university.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]