["About this rating", "A bizarre rumor holding that President Trump was using a Melania Trump body double at a press conference took hold on social media in October 2017 after Facebook user Andrea Wagner Barton posted photographic \"evidence\" of the charge:", "Will the real Melania please stand up?", "Is it me or during his speech today a decoy “stood in” for Melania??", "And....", "Why would the moron say “my wife, Melania, who happens to be right here...”", "Seriously, watch very closely!", "A video purportedly showing this \"fake\" Melania Trump was also widely circulated on social media. As of this writing, Barton's post has racked up more than 9 million views:", "The evidence provided above is flimsy at best. In fact, it appears that the conspiracy theorists pushing this rumor purposely used a blurry (and possibly distorted) video of Melania Trump in order to make this claim seem more plausible.", "The footage above was captured by filming a television screen showing a CNN report from 13 October 2017. When compared to the actual video available on CNN's web site, it's apparent that the strange visual was caused by the TV screen and not a faux first lady.", "Here's a screenshot from the Facebook video (left) compared to a still from the video available on CNN.com. Note that Melania's face is slightly shrunken, distorted, and rounder  in the Facebook video:", "This not evidence of a body double. It's evidence of a poorly working television.", "Several other images of the first lady from the same day are also available from news organizations such as Getty Images and the Associated Press. Many of those photographs, such as the following image from the White House, featured the first lady sans sunglasses, clearly showing that this woman is in fact Melania Trump and not some impostor:", "The \"Melania body double\" rumor came back for second lap around the track in July 2018, as pictures of President Trump and the first lady while they were in Brussels for the NATO Summit showed the president accompanied by a woman who seemingly resembled, but did not look exactly like, Melania:", "Fake Melania is back y’all pic.twitter.com/EuaTpPkjPN", "— James St. James (@JSJdarling) July 10, 2018", "I swear that this looks like fake Melania. pic.twitter.com/nudfbyqMrJ", "— Nurse Ratchett (@mycrankyboosez) July 11, 2018", "The #FakeMelania \"body double\" rumor took another lap around the track in March 2019 when the First Couple made a trip to Alabama to survey tornado damage:", "Hosts of “The View” commented on how the woman at Trump’s side in photos of the trip appeared shorter than usual and had a different facial structure than the first lady’s. One host allowed that the first lady might have been wearing flat shoes.", "In fact, the 5-foot-11 first lady had ditched her customary stilettos for sneakers to walk around the rough terrain with the 6-foot-3 Trump.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]