["About this rating", "The exchange shared on social media was confirmed by York University.", "On March 18, 2021, an email exchange between a faculty member of York University's department of mathematics and statistics named Emanoil Theodorescu and a student of his went viral:", "The series of screenshots begins with an email from the student in question asking Theodorescu for a deferral on a mid-term test due to an impending communication shut down imposed by Myanmar's military junta.", "\"I have just learned that from tomorrow all cellular data, wifi, and internet services will be cut off indefinitely.\"", "In response, Theodorescu denied that request, asking \"even the Internet came down with COVID-19?\" In response, the student explained that \"There was a military coup where I am living and almost 200 protestors have been shot … The regime has decided to shut off all communications by tomorrow.\"", "That explanation, evidently, was not acceptable to the professor at the Canadian university.", "\"The next time you miss something, it's over,\" Theodorescu responded in a later email, before blaming the student for how they perceived reality. \"By the way, your remarks (both related to this course and to your home country) made me wonder how you understand reality. People don't get shot for just protesting,\" Theodorescu explained with an egregiously misinformed view of the history of political protest, \"but for a lot of deeper reasons.\"", "The exchange created widespread outrage and myriad angry tweets directed at York University. In response, York confirmed that the exchange happened, stated that Theodorescu's statements didn't represent that values of their university, and announced that the accommodations sought by the student would be granted:", "York University is committed to upholding and promoting the values of respect, equity, diversity, and inclusion across our campuses and in our communication. There was a recent communication between a Department of Mathematics & Statistics instructor and a student that does not reflect those values. While employment matters are confidential, we can confirm that appropriate actions were immediately initiated upon learning of the exchange.", "We would like to assure all concerned that senior staff from the Faculty were able to directly make contact with the student the night of the exchange with the instructor, and clearly expressed support for their difficult circumstance and well-being, and further, assured them that necessary accommodations would be granted.", "In a second update, the university announced that \"it is taking steps to address the matter under the relevant collective agreement\" and that \"effective immediately, alternate arrangements for the teaching of the course have been made.\"", "Because the incident portrayed in viral social media posts was confirmed by the university itself, the claim is \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]