["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "From left, Rebecca Bradley, Joe Donald and JoAnne Kloppenburg are competing in the Feb. 16, 2016 primary for a seat on the Wisconsin Supreme Court. Kloppenburg says Donald twice supported Bradley.", "The first TV ad run by state Appeals Court Judge JoAnne Kloppenburg in the Wisconsin Supreme Court campaign criticizes Justice Rebecca Bradley, who was appointed to the high court by Republican Gov. Scott Walker.", "Then the ad turns quickly to Milwaukee County Circuit Judge Joe Donald, who is the third candidate in the Feb. 16, 2016 primary for Bradley’s seat. The two candidates who get the most votes will face off in the April 5, 2016 general election.", "\"Joe Donald,\" the narrator says in Kloppenburg’s ad, which was released Feb. 8, 2016, \"he supported Rebecca Bradley, Walker’s choice, twice.\"", "At the same time, these words are shown on the screen: \"Donald twice supported Walker appointee Bradley,\" with the quote attributed to a blog.", "Kloppenburg, who is running from the left, is associating Donald with the candidate who is clearly on the right.", "As we’ll see, Donald’s support for Bradley was explicit for one judicial post, but split for another.", "The candidates", "Kloppenburg, of Madison, ran for the Supreme Court once before, in 2011. Then an assistant state attorney general, she lost to Justice David Prosser in a race so close it went to a recount. Kloppenburg won election to the Madison-based District 4 Court of Appeals in 2012.", "Bradley, of the Milwaukee suburb of Wauwatosa, was appointed to the Supreme Court by Walker in October 2015 after the death of Justice Patrick Crooks, and is now running for the seat for the first time. Bradley had also been appointed by Walker to the Milwaukee-based District 1 Court of Appeals in May 2015 and before that to the Milwaukee County Circuit Court in 2012.", "Donald, of Milwaukee, was appointed to the Milwaukee County bench in 1996 by GOP Gov. Tommy Thompson and has won election to the court four times, without opposition. He is also running for the high court for the first time. The Milwaukee County court is the link between Bradley and Donald.", "Given her incumbency and her position on the ideological scale, Bradley is expected to advance to the general election, which means the real race in the primary is between Kloppenburg and Donald.", "Kloppenburg’s evidence", "On Kloppenburg’s claim that Donald twice supported Bradley, let’s look at the instances cited by Kloppenburg’s campaign. Both were first reported by WisPolitics.com.", "1. Donald specifically endorsed Bradley in 2013 in her first run for the Milwaukee County Circuit Court. She had been appointed the year before by Walker to the seat, and defeated two challengers in the election.", "It is common for sitting judges to support one another in elections, something Donald’s campaign itself has said in explaining Donald’s backing of Bradley.", "Donald, though, has also said he got \"bamboozled,\" telling WisPolitics: \"I really thought (Bradley) was about being a trial court judge. It became apparent that it had nothing to do with it, that this was clearly a process to put her in place to put her on the Supreme Court.\"", "2. Donald gave his name as a reference when Bradley applied to fill the 2015 vacancy on the state appeals court -- but he also recommended that Walker choose another candidate.", "Bradley’s application letter to Walker lists Donald as one of four references, noting that Donald had previously served as presiding judge of the Milwaukee County Children’s Court. Bradley served there after being appointed to the Milwaukee court by Walker.", "Donald’s campaign acknowledges that Donald consented to Bradley listing him as a reference for her appeals court application. But the campaign also cites a letter Donald wrote to Walker in which Donald recommended that Walker choose Milwaukee County Circuit Judge Timothy Dugan for the slot.", "So, in contrast to the first instance, when Donald’s support for Bradley was unilateral, his support in the second instance was split.", "Our rating", "Kloppenburg says Donald twice \"supported\" Bradley.", "Donald explicitly endorsed Bradley in a 2013 election for the Milwaukee County Circuit Court. When there was a vacancy on the state appeals court in 2015, Donald supported Bradley by allowing her to use him as a reference in her application, although he also recommended that the governor choose a different applicant for the post.", "For a statement that is accurate but needs additional information, our rating is Mostly True.", "YouTube, JoAnne Kloppeburg campaign TV ad, Feb. 8, 2016", "Milwaukee Journal Sentinel, \"Kloppenburg, Donald release ads in Supreme Court race,\" Feb. 8, 2016.", "Interview and email exchange, JoAnne Kloppenburg campaign manager Melissa Mulliken, Feb. 10, 2016", "Interview, Joe Donald campaign spokesman Andy Suchorski, Feb. 12, 2016", "Capital Times, \"Joe Donald has supported Rebecca Bradley in the past,\" Jan. 18, 2016", "WisPolitics, \"Donald in past has supported Bradley,\" first posted Jan. 15, 2016", "WisPolitics, Joe Donald letter, Jan. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]