["A set of images that shows piles of cash on a street has gone viral on social media. A Facebook user posted two such images along with the caption, “People in Italy threw their wealth on the streets. They say it’s of no use anymore. (इटली में लोगों ने अपनी दौलत सड़कों पर फेंक दी। उनका कहना है कि ये किसी काम की नहीं।)” Similarly, other users on Facebook and Twitter also shared these images with the same caption.", "A Twitter user @ynm_xo also posted shared the images and wrote in English, “Italians threw their money on the streets saying it is of no use, since you can’t even buy life with your own money.”(archive link)", "Alt News has received fact-check requests on its official Android application for a similar photograph which has been shared with the same claim.", "Image 1 and 2", "Alt News performed a reverse image search on Google and found that these images show scenes after the Venezuelan bank Bicentenario, Merida was looted. On March 11, 2019, Twitter handle @ConflictsW, managed by  Aurora Intel which tracks conflicts across the world, tweeted the viral images along with other photographs from the same area.", "The bicentenario bank in Merida was looted, people left the Venezuelan bolivars behind and left the money on the street and set fire to piles of Venezuelan bolivars to prove its worthless #Venezuela #SinLuz pic.twitter.com/YJlT2qFPrY", "— CNW (@ConflictsW) March 11, 2019", "A video package in Western Journal’s report from March 13, 2019, also shows a tweet which includes these images. Additionally, the photographs were posted on the social media site Imgur on March 12.", "Maduradas, a Venezuela-based news website, had published an article on March 12 that complied images and tweets about the incident. This article included tweets by a Venezuelan politician William Dávila and Venezuela-based photojournalist Nellie Belén Izarza.", "Dávila’s tweet also spoke about the robbery at Banco Bicentenario.", "Saquearon el banco bicentenario que está subiendo por la avenida 3 arriba de glorias patrias y querían saquear los árabes, en Merida.", "— Williams Dávila (@williamsdavila) March 12, 2019", "Image 3", "Alt News performed a reverse image search and found that this image was posted on Imgur on March 17, 2019. According to these posts, this image is also from Venezuela. While Alt News could not authenticate the exact source, it is highly probable that it depicts the aftermath of the robbery at Merida because a) the image is similar and b) it surfaced on the internet around the same time.", "Former Ambassador of Italy in Pakistan Stefano Pontecorvo called out a tweet which claimed that Italians threw currency notes in light of the coronavirus pandemic and growing loss of life.", "This is FAKE NEWS. It is a picture of Venezuela when they threw away the banknotes of old currency no longer in use. Let’s stop this bs. Italians are using their money to help in the struggle against #coronavirus . This post is simply stupid. With a PhD check your sources…. https://t.co/4YHNJQ8hOa", "— Stefano Pontecorvo (@pontecorvoste) March 31, 2020", "It is noteworthy that the Venezuelan economy has spiralled into hyperinflation, starvation and unemployment due to a wide range of issues under the governance of President Nicolás Maduro and his predecessor Hugo Chávez who died in 2013. A February 2019 BBC report states, “According to a study by the opposition-controlled National Assembly, the annual inflation rate reached 1,300,000% in the 12 months to November 2018. By the end of last year, prices were doubling every 19 days on average. This has left many Venezuelans struggling to afford basic items such as food and toiletries.” The unfavourable economic conditions have devalued the country’s currency to the extent that money is regarded as worthless. In December 2019, Al Jazeera reported how some Venezuelans are making craft from devalued money to extract value from their decimated currency.", "We compared the green coloured notes seen in the third image with the 50 Bolívar Fuerte and found them to be identical.", "The Bolívar Fuerte is Venezuela’s old currency which was replaced by the Bolivar Soberano in August 2018. By December 2018, all Bolívar Fuerte currency notes were withdrawn. The Bicentenario Bank was looted in March 2019 when the Bolívar Fuerte was worthless. This explains why the notes were discarded on the road. These photographs were earlier debunked by American fact-checking organisation Snopes.", "Thus the social media claim that Italians, frustrated with the large number of deaths due to the coronavirus pandemic, threw their money on the road is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]