["About this rating", "On 8 July 2018, social media users began sharing a report attributed to television station WLKY in Louisville, Kentucky, about a deadly viral outbreak that was supposedly ravaging the city:", "The university of louisville hospital has already confirmed 16 deaths within the past 8 hours from a rare strain of hr3211virus Dr hemiln head of internal medicine said this could very will be the biggest outbreak we have ever seen in the united states he warned if you have any symptoms headaches blurred vision bleaking from the ears or rectal area or ringing in your ears to go inside and stay there till medical help arrives again stay indoors do not come in contact with anyone it is known to be spread by airborne go to center for diseases control for further information and atay up to date on wlky for further details as we learn more about This deadly disiease", "Among the suspect features of that report were its horrendous grammar and misspellings, not to mention the fact that despite its prominent use of the WLKY logo, it was not published on WLKY's web site. Outbound links from the social media posts went instead to React365.com, a well-known prank web site that offers tools for users to create their own fake news articles.", "Within hours of the story's dissemination, a post on the Louisville station's Facebook page branded it a fake:", "PLEASE SHARE: We are aware of a false report from React365.com alleging a “deadly virus outbreak” in Louisville. This is a fake article that uses the WLKY logo and is NOT associated with our station. The website React365.com allows people to create fake articles to “prank your friends.” Please do not share the article to help prevent the spreading of false information.", "In lieu of removing the article, the prank site reacted to WLKY's post by deleting the station's call letters and logo from the page, otherwise leaving it intact.", "We searched in vain for evidence that an \"HR3211 virus\" exists (or that any other viruses with medical names beginning with \"HR\" exist). No legitimate media sources have reported that a viral epidemic killed 16 people in Louisville.", "React365.com.   \"Louisville KY Having Emergency Outbreak Deadly Virus.\"\r\n    8 July 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]