["About this rating", "In July 2015, a series of photographs purportedly showing a fallen angel who dropped from the skies above London began circulating online:", "While some web sites correctly noted that the photographs depicted an art installation, others decided to use the images to create a fake news story about a \"real\" fallen angel. The web site Trending Stylist, for example, claimed that the photographs depicted an angel captured in Texas:", "A human like \"Angel\" has fallen out of the skies over Texas. The extremely human like creature with what seems to be \"angel\" wings as arms appears to have fallen from the sky at around 1:50pm this afternoon. The 'Angel' like creature was quickly rushed away by what seemed to be undercover police officers dressed in suits and sunglasses, resembling the characters in the hit movie Men in Black.", "It comes just hours before NASA announced finding 'Earth 2.0' the most habitable planet ever discovered.", "Zon News shared a nearly identical story that simply changed the setting to London:", "A human like \"Angel\" has fallen out of the skies over London. The extremely human like creature with what seems to be \"angel\" wings as arms appears to have fallen from the sky at around 1:50pm this afternoon.", "The 'Angel' like creature was quickly rushed away by what seemed to be undercover police officers dressed in suits and sunglasses, resembling the characters in the hit movie Men in Black.", "The truth is that this fallen angel is a \"hyper-realistic sculpture\" made from fiber-reinforced polymer and silica gel created by Beijing artists Sun Yuan and Peng Yu in 2008:", "Sun Yuan and Peng Yu's works always start with a paradox. Their early objects and installations are made from real cadavers or human fat tissues. Yet, even though playing on the speculative and the spectacular, they focus on the investigation of the paradox rather than merely exploiting the spectacular. The tension between the bodies, organic tissues or animals and their artistic manifestations corresponds to the transposition of subjects from the plane of immanence onto the plane of transcendence. In their recent installations using hyper-realistic sculpture, they reverse their original practice: imagination and mythological subjects penetrate into the realm of everyday life and reality. Angel, a life-size sculpture in fiber-reinforced polymer and silica gel of a fallen angel is typical of this new approach. The angel, an old woman in a white gown and with featherless wings, is lying face-down on the ground; maybe sleeping, maybe dead, but certainly immobile and frozen into an all too realistic image. The supernatural being, now nothing more than an impotent creature, can neither carry out any supreme will nor be of any help to those believing in its existence. The angel is true but ineffective; dreams and hopes are sincere yet vain.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]