["About this rating", "In December 2016, the Thug Life Videos website published an article which reported positing that a mall Santa in Wisconsin had beaten up a child molester:", "Kid Tells Mall Santa A Secret; Seconds Later Him And His Elves Are Beating Up Child Molester", "Greendale, Milwaukee, Wisconsin. As busy shoppers rush around buying Christmas gifts for their loved ones inside the giant Southridge Mall, a group of men are being arrested by mall security and local police for affray.", "But this was no normal scuffle between gangs or a skirmish over the last iPads in stock before the big day. The fight involved SANTA CLAUS and his elves. Well, a mall Santa and his dwarf colleagues, at any rate. They weren’t fighting among themselves, though. They were beating the cr*p out of a CHILD MOLESTER.", "66 year-old Nicholas Cooper was taken into custody for assaulting Kris Kane, 38, after an unnamed young girl confided in him. She said that she ‘wanted to tell Santa a secret’ and that ‘all she wanted was for her stepdad to stop touching her at night’.", "﻿", "Thug Life Video publishes a mixture of viral content and fake news pieces. While this particular piece of holiday fiction was not labeled as a hoax or as satire, it was not a genuine news item.", "For one thing, no record of this incident taking place was published anywhere but viral and hoax news websites. Furthermore, the included pictures were lifted from unrelated incidents (a common tactic for fake news organizations) and do not show a mall Santa named \"Nicholas Cooper\" as he is being arrested for beating up \"Kris Kane.\" The picture of \"Santa\" getting arrested was taken in 2013 after a protest against Black Friday in Ontario, California, and the mugshot of \"Kris Kane\" actually shows a man who was charged with trespassing in 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]