["About this rating", "On Jan. 28, 2021, a team of researchers published an article in the journal Scientific Reports about the discovery of a new species of chameleon found in Madagascar: Brookesia nana. At a total length of only 21.6 mm, males of this new species, specifically, appear to be the \"smallest mature male amniote ever recorded,\" the authors reported, referring to a broad taxonomic classification that includes all reptiles and mammals. The previous record for smallest mature male amniote also belongs to the Brookesia genus, which is found only in Madagascar.", "The small size of this chameleon is not the only feature driving popular coverage of the creature. The authors also reported that the males had \"large, apparently fully developed hemipenes.\" As opposed to a single penis, male chameleons have two hemipenes (paired pesises) as their sex organ (the expansive material under the back legs of the fella pictured below).", "(Glaw et al. 2021)", "According to herpetologist Mark Scherz, who was an author on the paper and who tweeted a thread about the discovery, chameleon hemipenes are complex and unique, and as such scientists use them to help identify or distinguish between species.  Previous research has documented that Malagasy chameleons, in general, have proportionally large genitals. Based on a survey of other species, \"Brookesia nana had the fifth largest relative hemipenial length of the 52 studied species and the third largest in the genus Brookesia,\" the authors reported.", "The evolutionary reason for this \"miniaturization\" of chameleons in Madagascar is not fully understood, though it is apparent in many species and therefore assumed to provide some benefit. A simple mechanical explanation for the hemipenes, however, could explain the large genitals in these otherwise tiny males. Male Brookesia chameleons are smaller than their female counterparts. No matter how small they get, their genitals still must fit in their female mate. \"The idea is mechanical coupling,\" Schertz wrote on Twitter, \"if the male [shrinks] but female doesn't, his genitals still need to fit hers.\"", "Because the reporting of this new chameleon's genital proportions is accurately described in peer-reviewed scientific reports, the claim is \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]