["About this rating", "When Lena Paahlsson first met and married her husband Ola, she designed her own wedding ring: a white gold affair studded with seven small diamonds. One day in 1995, while doing some Christmas baking, the ring went missing. Lena Paahlson had placed it on a clean work surface, but the ring wasn’t where it was supposed to be. The couple searched the kitchen of their home in Mora, Sweden thoroughly, but it had simply disappeared.", "During renovations some years later, still hoping to find the wedding ring, they pulled up the tiles from the kitchen floor. The ring wasn’t there.", "In 2011, sixteen years after her wedding ring had gone missing, Lena was working in her vegetable garden. She pulled up a small carrot and was almost ready to discard it when she noticed something shiny was attached to it -- her wedding ring. The carrot plant had grown right through it, and the ring was snugly speared where the greens meet the carrot root. Lena let out a screech, which her daughter Anna heard from inside the house.", "The couple will never know for sure exactly how Lena’s wedding ring ended up in the garden. They guessed that the ring fell into the compostable food bin, and ended up in a compost pile that was eventually spread over the vegetable garden. Perhaps one of their sheep ingested it while looking for a tasty treat in the compost pile, and the ring ended up in manure in the vegetable garden.", "Regardless of how it happened, the Paahlssons are happy to have the ring back. Although the ring is too small to fit Lena Paahlsson any more, she said that she would be having it resized.", "As she told the Swedish newspaper Dagens Nyheter, \"Now that I have found the ring again, I want to be able to use it.\"", "Boroff, David.   “Swedish Couple Finds Long-Lost Wedding Ring on Carrot in Their Garden.”\r\n    [New York] Daily News.   4 January 2012.", "Ng, Christina.   “Swedish Woman Finds Lost Wedding Ring on a Carrot.\"\r\n     ABC News/Good Morning America.   4 January 2012.", "BBC News.   “Sweden: Wedding Ring Found on Carrot After 16 Years.\"\r\n    31 December 2011.", "Stephanie Larsen is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]