["About this rating", "On Jan. 6, 2021, a mob of violent Trump supporters broke into the U.S. Capitol as members of Congress were engaged in counting Electoral College votes confirming the victory of President-elect Joe Biden.", "During the sustained attack, social media users shared a picture of camouflage-clad National Guard troops guarding the Lincoln Memorial in the nation's capital during the Black Lives Matter protests in the summer of 2020:", "People shared the photograph, citing it as an example of unequal law enforcement practices in responses to the summer's civil rights demonstrations versus the pro-Trump mob, which occupied the Capitol building for hours, vandalizing the chamber, parading around with the Confederate flag, and breaking into the office of House Speaker Nancy Pelosi, among other things.", "The D.C. National Guard did deploy in response to the violent mob— with the approval of Vice President Mike Pence — after initial reports indicated the troops would not be deployed.", "These rioters were acting on Trump's prolonged disinformation campaign in which Trump falsely claimed the November 2020 election was beset by massive-scale fraud. Trump lost by more than 7 million ballots and 74 electoral college votes.", "The picture is authentic, as we reported in June 2020, and shows National Guard troops stationed around the Lincoln Memorial. As the caption on the Getty Images photograph states, the picture depicts members of the D.C. National Guard standing on the steps of the Lincoln Memorial, \"as demonstrators participate in a peaceful protest against police brutality and the death of George Floyd, on June 2, 2020 in Washington, DC.\"", "Black Lives Matter activists led massive demonstrations in the spring and summer of 2020 over the high-profile killings of Black people including Floyd, who died in custody after a Minneapolis police officer knelt on him while he was handcuffed, and Breonna Taylor, who was shot and killed during a police raid gone bad in Louisville, Kentucky. Although some violence did take place at some Black Lives Matter demonstrations, they were overwhelmingly peaceful.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]