["About this rating", "On 2 June 2003 the e-mail reproduced above was flung into the ether by a summer intern employed at the prestigious law firm Skadden, Arps, Slate, Meagher & Flom.  Unfortunately for this budding executive, thanks to the wonders of his own carelessness his message was received by forty people at that firm, including twenty partners:", "Congrats on the CFA. I'm sure you're about to make VP any day now.", "I'm busy doing jack shit. Went to a nice 2hr sushi lunch today at Sushi Zen. Nice place. Spent the rest of the day typing emails and bullshitting with people. Unfortunately, I actually have work to do — I'm on some corp finance deal, under the global head of corp finance, which means I should really peruse these materials and not be a fuckup...", "So yeah, Corporate Love hasn't worn off yet... But just give me time..", "JLB", "Jonas L. Blank\nSummer Associate\nSkadden, Arps, Slate, Meagher & Flom, LLP\nNew York, NY 10036-6522", "Jonas Blank is far from the first to see an e-mail he meant for just one recipient escape into the wilds of the Internet. Personal e-missives usually become public fodder through the acts of a legitimate recipient who (for whatever reason) chooses to forward a note meant only for himself to a far larger audience.  In this case, however, the victim did himself in — rather than sending his message to whomever he truly meant it for, he posted it to the underwriting mailing list.", "The intern's blunder was very quickly followed by this apology:", "I am writing you in regard to an e-mail you received from me earlier today. As I am aware that you opened the message, you probably saw that it was a personal communication that was inadvertently forwarded to the underwriting mailing list. Before it was retracted, it was received by approximately 40 people inside the Firm, about half of whom are partners.", "I am thorougly and utterly ashamed and embarassed not only by my behavior, but by the implicit reflection such behavior could have on the Firm.", "The addressing of the e-mail was obviously an honest mistake. The content of the e-mail was inappropriate, showed a total lack of discretion, responsibility and judgment, and undoubtedly did my reputation and my future here no favors. It showed disregard for the Firm's policies and procedures and for the very explicit speech that all summer associates were given about personal responsibility and using good judgment at the start of their training.", "The appropriate parties, including Hiring Partner Howard Ellin and Hiring Director Carol Sprague, are aware of the incident and working with me to deal with it appropriately.", "Although I cannot change what you and the other recipients saw, I do reiterate my sincerest apologies. I do and will take full responsibility for my actions in this incident, and I will do everything I possibly can to correct my mistakes and, more importantly, ensure that this and things like it will not happen again.", "With sincere regret,", "Jonas L. Blank", "The mea culpa must have worked. According to The Washington Post: \"The associate is still gainfully employed — making $2,400 a week, which figures to be $140,000 a year\" [sic].", "Young Mr. Blank can console himself with the knowledge that at least his admission was merely of the \"goofing off\" variety. Others have seen their sexual and dating misdeeds become the stuff of cyber legend. There was Claire Swire, who in 2000 announced that certain bodily emissions of her boyfriend were \"yummy.\" And Peter Chung, who in 2001 thought to regale his buddies with tales of his escapades with paid companions. Then there was Jacqueline Kim, whose 2002 assessment of her date brought her infamy. And who can forget Trevor Luxton, who in 2003 thought to report on a sex act being performed on him by one gal during a phone conversation with another woman.", "McGrath, Ben.   \"The Talk of the Town.\"\r\n    The New Yorker.   30 June 2003   (pp. 35-36).", "The Washington Post.   \"Blair Analogy Reaches Courtroom Far from NY.\"\r\n    16 June 2003   (p. E4).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]