["A video clip is massively viral on social media. It shows a group of men who seem to be wielding guns near a police vehicle subsequently moving inside a residential lane. Later in the video, one can sport an unconscious person lying on the road.", "On February 11, Rangoli Chandel, Bollywood actor Kangana Ranaut’s sister, tweeted the video and claimed, “Meanwhile over 25,000 killed they have started shooting down all the people with the virus in China,” Her tweet has amassed close to 2,100 retweets.", "Meanwhile over 25,000 killed they have started shooting down all the people with the virus in China… this is so sad 🥺🥺🥺 pic.twitter.com/IfVWMUuSw6", "— Rangoli Chandel (@Rangoli_A) February 13, 2020", "A closer look at the video reveals that it is a combination of at least four different sequences which have been merged into one video. In the course of this article, we will fact-check the four sequences individually.", "Authorities in China had appealed to other countries to help with supplies of protective face mask, according to a BBC report published on February 6, 2020. “Medical advice in China is to change face masks regularly, as often as four times a day for medical teams, which would require two million masks each day. This is the procedure being followed in one of the main hospitals in Wuhan, the largest city in Hubei province,” stated the report, adding that there is widespread use of face masks among the ordinary population, whether or not they’ve been instructed to do so by the authorities.", "Posted below is a video report by The New York Times titled, “How Residents in Wuhan Are Coping With Coronavirus.” It shows multiple shots of almost every resident in Wuhan wearing a mask. Thus, it is unlikely that people in Hubei province’s Wuhan city would be seen without a mask given the mass panic triggered by the outbreak of coronavirus.", "In the third sequence, one can easily spot people who aren’t wearing masks standing near the person being attended by medical workers.", "Same with the fourth sequence – multiple people can be spotted without a protective mask.", "Below, we analyse the sequences individually.", "In the first and second sequences, three people with identical clothing can be spotted. In the screenshots posted below, one can read ‘police’ and the Chinese police emblem inscribed on the car.", "The first two sequences only show gun-wielding men moving into a lane surrounded by apartments.", "The second sequence is also viral with a separate claim that “three unknown people” wielding guns and wearing protective gear were walking somewhere in Wuhan. It has been circulating since February 1, 2020.", "We found a tweet in Chinese which said that this video was shot after two people were bitten by “crazy dogs”. The men in the clip are apparently hunting for the dogs in a street in Yiwu, Zhejiang Province in 2018. “It can be verified that the language in the video is Yiwu dialect,” reads the tweet posted on February 2, 2020.", "China Global Television Network (CGTN) tweeted the screenshots of the same video and informed that police in Yiwu, Zhejiang district called-out social media posts falsely alleging that the police was “shooting people sick with #coronavirus that refuse to be evacuated.” According to the police, the armed officers were only dealing with a rabid dog. Police said that the video has been maliciously edited with separate scenes.", "Police in Yiwu, Zhejiang said online video alleging them “shooting people sick with #coronavirus that refuse to be evacuated” is fake", "The police said the video was “maliciously” manipulated with separate scenes since the armed officers were only dealing with a rabid dog pic.twitter.com/10NLLX7B1I", "— CGTN (@CGTNOfficial) February 13, 2020", "Yiwu city falls under the Jinhua jurisdiction of Zhejiang province. The license number on the police vehicle is ‘G1796’ where ‘G’ stands for Jinhua. We corroborated this with an image of a different police vehicle available online.", "In this sequence as well, one can hear sounds in the background which come across as gunshots. However, it is important to note that all that the viewers can spot are men, possibly medical professionals with protective gear, attending those lying on the ground. While there are sounds of gunshots in the background, no visuals of actual firing can be seen.", "Moreover, passers-by go on about as usual though it is being suggested patients are being shot dead. It is unlikely that gunshots would not arouse panic. There is also no bloodshed in the video.", "With a Chinese keyword search on Twitter, we found a clearer, extended version of the same video posted on January 26, 2020. The tweet claimed that the visuals depict people in rural areas around Wuhan region unable to visit a hospital and that the noise in the background is of fireworks lighted to celebrate the new year.", "武汉周圍很多農村人，被感染后进不了医院，只有醫护上门，也無法確診，最終死在家里！這些死亡病例肯定是不会統計进官方肺炎死亡人数的！背景中是欢庆新年的烟花爆空，而他們死得绝望無辜！歷史也許永遠不会有真相！ pic.twitter.com/bw5co9vuk3", "— 财经冷眼 (@charles984681) January 26, 2020", "In the replies, a user argued that the dialect is not from Hubei province, let alone Wuhan. We were unable to independently locate the video.", "France 24 Observers investigated the video and found that the clip has nothing to do with CoV outbreak. It is related to an accident in the small town of Wuzu, located about 200 km east of Wuhan. The media outlet spoke to a local who confirmed that the video pertains to a motorcycle accident that took place in front of the Siyuan school on January 29, 2020. He also sent France 24 Observers a version of the same video.", "“At the end of a version of this same video sent by Zhang W, we see an additional image for a fraction of seconds. Pausing, we can see on the sidewalk, a few meters from the person on the ground, a two-wheeled vehicle lying on its side. Earlier in the video, at 0’04, we also notice that a piece of concrete ledge surrounding one of the trees visibly received a shock,” reads the report.", "Moreover, we found a tweet in Chinese calling out misinformation and informing that two minors were involved in an accident. While one died on the spot, the other was hospitalised with serious injuries.", "地点：湖北省黄梅县五祖镇思源学校对面 事件：两个未成年的骑摩托车太快。撞上路沿石失控。骑摩托车的死了坐摩托车重伤的送医院。 完全是驾驶人自己的过失。 造谣人称暴力执法将驾驶员打死，望各位理智。 pic.twitter.com/wGcppBTVEz", "— wenhao.hong (@RyPllPIchQEmrP1) February 1, 2020", "The same sound of fireworks heard in the third sequence is audible in the fourth as well. Below is a 21-second video of this sequence posted by a Twitter user on February 4, 2020, where no gunshots can be heard.", "At Wuzu Town, Huangmei County in #Hubei , a woman was said to have shot dead after she attempted to break the blockade set up to contain #coronavirus . 湖北省黄梅县五祖镇 , 据说这名妇女因强闯 #武汉肺炎 封锁线被警察打死。#CoronavirusOutbreak 何不 #全民自救 #全民互救 ？ pic.twitter.com/HqEvzSknz2", "— 曾錚 Jennifer Zeng (@jenniferatntd) February 4, 2020", "Therefore, it can be said that the audio of fireworks in the third sequence was also superimposed here.", "While the message posted along with the video alleges that over 25,000 people affected with CoV have been killed in China, no media reports corroborate the claim. According to the tracker set up by CGTN, 59,882 cases were reported in China at the time of writing this report. The death toll has now passed over 1,300 in the country, including one in Hong Kong.", "Alt News had earlier debunked a junk news story which falsely claimed that China sought the court’s approval to kill 20,000 coronavirus patients.", "Here is what we know so far: A dubious video was manufactured by combining multiple visuals. Audio of fireworks was superimposed to claim that 25,000 coronavirus patients were killed in China. Alt News found that one of the clips pertains to an accident that took place in China’s Wuzu town. We were able to verify that the gun-toting police personnel walking in Zhejiang province’s Yiwu city were there to kill a rabid dog. Moreover, the absence of protective masks also suggests that the clips are unrelated to coronavirus.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]