["About this rating", "As many as one in five Americans suffers from chronic migraine headaches, an episodic condition exacerbated by a lack of consistent treatment options. Many migraine sufferers struggle to avoid known triggers but inevitably experience periodic (and crippling) episodes.", "Perhaps owing to the hit-and-miss nature of migraine treatment, anecdotal claims about preventing, alleviating, or even stopping migraines altogether abound online. In mid-2015, sufferers began spreading an article that maintained a specific kind of ear piercing (known as a \"daith piercing\") could alleviate migraines.\nThe article was published by a student-run web site at State University of New York (SUNY) Purchase and titled \"A 'Piercing' New Alternative for Migraine Relief\":", "With an open mind these [migraine treatment] alternatives are capable of being the answer, and there is a new one on the market, which is simple, inexpensive, and doubles as a piece of jewelry.", "The daith piercing is a small ring that pierces the inner cartilage of either ear, running through a pressure point, which for some will relive migraine pain. It is a relatively new procedure, mainly preformed at tattoo and piercing shops with not many statistics to back it up yet.", "Tammi Bergman, NP, of ERiver Neurology, who specializes in headache relief, says that she always encourages her patients to try things like this as alternative relief measures to medication. \"I haven't really heard of it yet, none of my patients have done it,\" she said. \"It could just be too new, and in the blogs, but often that’s where these things get started.\"", "Bergman was the only medical professional quoted in the article, which primarily included comment from migraine sufferers and body modification studio owners. Evidence presented about the efficacy of daith piercings for migraine relief was purely anecdotal (and the source of the claim unclear):", "Dave Kurlander, owner of the Tempest Artistic Studio in Hopewell Junction, NY performs the daith piercing on clients, and he truly believes it's the way to go.", "\"I've had many people come to me looking for migraine relief. It's a much cheaper alternative to medicine and even acupuncture, and many of their doctors recommend it to them, and if you're into piercings that's even better. Essentially it's the same concept as acupuncture, the piercing hits a pressure point which then relieves the pressure in your head. I recommend getting it done on the ear that corresponds with the side of your head where most of your migraines hit.\"", "In the long run it's a toss up, it may not cure your headaches but you will be left with an ear piercing. Hey, you win some you lose some right?", "At this juncture, it's worth noting a specific aspect of the daith piercing claim. While body modification may be inexpensive (compared to other alternative health options), it involves an aesthetic commitment that might not appeal to sufferers. Slightly less common than ear lobe piercings, a daith piercing likely wouldn't physically harm a patient desperate for relief, but many sufferers could feel pressured to try it despite personal considerations (such as employer dress codes or discomfort with a cartilage piercing).", "Moreover, no non-anecdotal evidence was presented in the article touting the potential efficacy of such piercings. Even the health professional consulted (who adopted a \"can't hurt\" stance) hadn't heard of the rumor, much less matched it with any extant medical advice about migraine relief. No studies examined the potential benefit of ear piercings on migraine headaches, though some research has been carried out on acupuncture and migraines.", "Due in part to a dearth of steady treatment options for migraine sufferers, the efficacy of acupuncture on the condition has long been scrutinized in clinical settings. Data has been inconsistent but strongly favors a pronounced placebo effect in patients exposed to both \"real\" acupuncture and \"sham\" acupuncture (treatments that mimicked acupuncture in ways indetectable to the patients):", "Acupuncture appears to be effective for prophylaxis of migraine headaches, and may be slightly better than pharmacotherapy. Sham acupuncture is just as effective as real acupuncture.", "Researchers similarly theorized the negligible difference between true and simulated acupuncture suggested factors other than the alternative therapy itself influenced outcomes:", "In conclusion, we found acupuncture to be superior to both no-acupuncture control and sham acupuncture for the treatment of chronic pain. Although the data indicate that acupuncture is more than a placebo, the differences between true and sham acupuncture are relatively modest, suggesting that factors in addition to the specific effects of needling are important contributors to therapeutic effects.", "Overall, clinicians generally adopted the stance that while acupuncture was of questionable benefit, it wasn't a harmful option for most patients resistant to first-line therapies:", "Acupuncture has been studied as a treatment for migraine headache for more than 20 years. While not all studies have shown it helps, researchers agree that acupuncture appears safe, and may work for some people. A study published in 2003 suggest that getting an acupuncture treatment when migraine symptoms first start works as well as taking the drug Imitrex. As symptoms continue, however, the medication works better than acupuncture.", "The article proposing daith piercings as a migraine treatment didn't specify whether its conclusions were based on rumor or inference and didn't cite any non-anecdotal evidence specifically supporting ear piercings as a viable alternative to acupuncture. No part of the article demonstrated a piercing would even work in the manner acupuncture purportedly did. How acupuncture's scant benefits could even be approximated by a permanent body piercing wasn't explained or referenced (and a number of social media users with the piercing report no reduction in episodic migraines).", "Even if daith piercings were deemed a sufficient analogue to acupuncture treatment (for which we could find no evidence), acupuncture itself is controversial at best and of exceptionally limited benefit (often a \"last ditch\" option among patients for whom all other treatments have failed). Accepted medical science generally holds it poses little risk, but clinical proof of its benefits remains elusive despite extensive research.", "In short, acupuncture itself is a scientifically questionable therapy even when administered by protocol; daith piercings as an acupuncture proxy goes several steps further into the territory of shaky folk medicine. Like acupuncture, daith piercings are unlikely to hurt or harm most patients. However, cartilage piercings are uncomfortable to painful to receive and would likely be considered unsightly or undesirable by the vast majority of sufferers who stand to benefit from the purported treatment.", "Removed the misnomer \"inner ear\" from descriptions of the daith piercing.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]