["“This is incredibly strange! World Bank website shows COVID-19 testing kits purchased by countries in 2017 and in 2018,” claims a September 6, 2020 Facebook post from Ben Swann, which has been shared thousands of times.", "Swan, who describes himself as a “journalist who speaks truth to power” and recently promoted the widely debunked film “Plandemic: Indoctornation,” goes on to claim: “I have verified that this is in fact posted on the World Banks World Integrated Trade Solution (WITS) website,” focusing on product code 382200.", "The same product code could also be found in Facebook posts in English, including here and here, and in Arabic here.", "Posts making similar claims, but with a focus on product number 300215, circulated on Facebook in Australia and in Italy, and on Twitter in Spanish.", "AFP Factuel also found posts in French, with a focus on product code 902780.", "The tables are real and could be found on the WITS website. Archived versions can be found here and here.", "WITS is a joint initiative of the World Bank, the United Nations Conference on Trade and Development, and the World Trade Organization (WTO), among others, providing data on trade and tariffs.", "However, it does not prove that countries were buying test kits for Covid-19 prior to the detection of Sars-Cov-2 in December 2019 in China.", "Asked on September 8, 2020 by AFP, the World Bank said in an email that the products with the mention “Covid-19” in the WITS database corresponded to medical equipment used for a long time for other purposes, but which assumed particular importance during the pandemic.", "These items were classified as Covid-19 products by the World Customs Organization (WCO) to facilitate monitoring their movements.", "“In April of this year, the World Customs Organization collated a list of Harmonized System (HS) codes to enable countries to track and speed up the movement of  ‘critical products’ related to Covid-19,” the World Bank said.", "In this list are “dozens of specific medical devices used to diagnose or treat Covid -- including ventilators, which as we all know, existed well before the Covid-19 outbreak,” it explained.", "According to WCO, product code 382200 corresponds to “diagnostic reagents based on polymerase chain reaction (PCR) nucleic acid test.” Similarly, code 300215 also tracks “diagnostic reagents based on immunological reactions.”", "Code 902780 helps track “instruments used in clinical laboratories for in Vitro Diagnosis,” which the World Bank said is “intended to help health care professionals quickly check whether patients are properly connected to a ventilator.”", "In a statement released on September 8, the World Bank further clarified that because of misinformation posted on social media, the WITS site was “updated to reflect the reality: Covid-19 tests did not exist before 2020.", "What a few days ago was labeled on WITS as a ‘Covid-19 Test Kit’ (using the WCO label) is now correctly labeled on the WITS Covid section as ‘Medical Tests.’”", "The novel coronavirus pandemic has killed at least 904,000 people worldwide as of September 10.", "AFP Fact Check has debunked more than 600 false and misleading claims about the pandemic. A full list in English is available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]