["Mumbai Indians (MI) beat Delhi Capitals in the 2020 Indian Premier League (IPL) final to win the tournament for the fifth time on November 10. Since then several social media users have posted an image that shows MI captain Rohit Sharma’s photo displayed on Dubai’s Burj Khalifa. As per the claim, he is the first cricketer and third Indian after Mahatma Gandhi and Shah Rukh Khan to receive this honour.", "A Rohit Sharma fan tweeted the image on November 11 shortly after the match ended. It was retweeted over 50 times. (archived link)", "Telugu YouTube channel NTV Sports displayed the viral image in their video. It has been viewed over 70,000 times. (archived link)", "Telugu website MyKhel also made this claim. However, the didn’t post the viral image. (archived link)", "బూర్జ్ ఖలీఫాపై తళుక్కుమన్న రోహిత్ శర్మ.. తొలి క్రికెటర్‌గా అరుదైన రికార్డు!!https://t.co/t3SzVUf9wh#RohitSharma #BurjKhalifa #MumbaiIndians #IPL2021", "— Penthalasampath (@Penthalasampath) November 11, 2020", "Several Twitter and Facebook users have posted this image. We also received several requests to fact-check this claim on our WhatsApp helpline (+917600011160) and on our official Android application.", "This slideshow requires JavaScript.", "Alt News performed a keyword search ‘Burj Khalifa blue filter:verified’ on Twitter and found a 2016 image similar to the one viral. It was tweeted by UAE-based news website Emirates 24/7. The montage below shows the comparison between both images. Readers should note that the brightness has been lowered in the viral image.", "More recently, on October 25, UAE Mission to the UN tweeted a video that shows Burj Khalifa with similar blue lights on the occasion of the World UN day which is observed on October 24.", "We couldn’t find any tweet related to Rohit Sharma or the Mumbai Indians uploaded by Burj Khalifa on Twitter.", "Shortly after the match, the Twitter account of MI posted an image of Burj Khalifa that shows MI’s logo and the building surrounded by fireworks. In the tweet, the photo has been credited to Trivandrum-based graphics designer Amith S Hari. Alt News rummaged through MI’s Facebook and Twitter handles and couldn’t find a single post that shows Rohit Sharma’s image on Burj Khalifa.", "📍 Dubai is BLUE & GOLD! 💙🏆", "📸: @amithndd#OneFamily #MumbaiIndians #Believe🖐🏼 #MIChampion5 #MIvDC pic.twitter.com/YzIoKtBUhY", "— Mumbai Indians (@mipaltan) November 10, 2020", "Even Rohit Sharma hasn’t posted any images on Twitter, Facebook, Instagram that indicate that his image was displayed on the world’s tallest skyscraper.", "In the past as well, Alt News has debunked multiple morphed images of Burj Khalifa.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]