["The post was shared by a Papua New Guinea-based Facebook user here.", "The lengthy post, purportedly shared from a “Dr Sam Maima”,  claims politicians and doctors are creating unnecessary panic around PNG’s Covid-19 outbreak “for common cold and flu when people can manage [it] themselves”.", "The post goes on to state the panic “will be self destructive because it will generate huge stress and somebody with underlying comorbidities will succumb to death from stress alone when told of PCR positive when he or she is in the public hospital”.", "The post then advises people in PNG “not to come for covid test” because “health officials will not give decent care when the PCR is positive”.", "“You will be put away to isolation centre only to be troubled with huge stress that will quickly weaken you including your immune system,” the post goes on to state.", "The post then lists a number of things one should do: \n\n\t“- Stay at home and isolate.\n\t- Steam bath\n\t- Drink warm lime tea two cups every 6 hours\n\t- Take panadol 6 hourly\n\t- Amoxicillin every 8 hours\n\t- For running nose and headache get\n\t- Sinutab every 8 hours.”", "The recommendations made in the Facebook post have also been shared hundreds of times in Facebook posts here and here.", "The claims started to circulate as Papua New Guinea warned it could see a surge in coronavirus infections in late March 2021 and called for one million emergency vaccine doses, AFP reported.", "The Facebook posts' claims, however, are misleading.", "In a statement provided to AFP Papua New Guinea’s Covid-19 Joint Agency Task Force (Covid-19 JTAF) said “people who are exhibiting symptoms of COVID-19 are urged to go in for COVID-19 test”.", "Dr Gideon Kendino, medical advisor to PNG’s COVID-19 Control Centre, also told AFP people should get tested if they are experiencing Covid-19 symptoms, because it’s difficult to differentiate between the flu and coronavirus if you haven’t been tested.", "“You need to get tested from the start and protect yourself and others… You must not put your family or your community at risk,” Dr Kendino said in a March 17 interview.", "The Queensland Department of Health, which has been assisting Papua New Guinea with Covid-19 testing, recommends people diagnosed with coronavirus self-isolate and only take medications prescribed by their doctor.", "“If you are recovering with the virus at home, it’s important to get plenty of rest, drink fluids, and eat well when it’s comfortable to do so.”", "“It’s important to only take medicines your doctor has recommended, because they will understand how these might interact with any other medicines you take and your health history,” the Queensland Health website reads.", "Papua New Guinea’s health minister, Jelta Wong, told AFP in an interview the Facebook post’s recommendations goes against the country’s current public health advice and could be dangerous.", "“It hasn’t been proven that amoxicillin, or the other medicines that he has prescribed, works [for Covid-19]. For people to take medicine that they are not supposed to be taking, it could have another effect on their body,” Minister Wong said.", "The Papua New Guinea Covid-19 JTAF also said they do not recommend people to follow the treatment advice provided in the misleading Facebook post.", "Dr Kendino said the purported author of the Facebook post, Dr Samuel Maima, has a “vested interest” in people buying his herbal and stem cell products.", "“Dr Samuel Maima is peddling fake stem cell medicine as a cure for all Illnesses including HIV, all forms of Cancers and lately COVID-19. And is downplaying the seriousness of COVID-19,\"", "“Sam Maima is a quack, he is not with the official Covid-19 response centre,” Dr Kendino added.", "News articles and a Linkedin account list Maima as a stem cell doctor and CEO of Medline Pacific, see here and here.", "In an interview with AFP Dr Maima argued the PCR test used to diagnose Covid-19 is not the gold standard test and could return a positive result if a patient just had the flu or cold.", "However, the Therapeutic Goods Administration, the regulator that oversees the efficacy of medical products in Australia, says here PCR tests “are currently the gold standard for diagnosis of COVID-19”.", "“In conjunction with clinical findings, a positive result is generally considered to be accurate, however further testing by PCR may be required in some cases,” the website also states.", "During the interview Dr Maima walked back on his treatment advice in the Facebook post, claiming the recommendations were posted to a closed group and were reposted outside the group without his permission.", "“The idea was just to prevent people from catching flu and Covid. And if they do how to best take care of themselves if they develop pneumonia like symptoms and what else they can do,” he said.", "During an outbreak of Covid-19 the World Health Organization (WHO) recommends people take precautions such as physical (social) distancing, wearing a mask, ventilating rooms, cleaning hands and coughing into an elbow or tissue.", "You can find detailed advice from the WHO on their website, here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]