["About this rating", "Since at least early 2021, TikTok videos appeared to show McDonald's customers purchasing $9 chocolate and vanilla birthday cakes. The center of the cakes featured an image of a juggling Ronald McDonald.", "TikTok user @williejtheartist drove to a McDonald's to find out if the cakes were real. He left empty-handed and posted \"lies and deceit,\" believing that the cakes were a hoax. His video was viewed nearly 13 million times.", "However, the cakes are real, and the videos were legitimate. McDonald's sells frozen chocolate and vanilla birthday cakes in limited quantities.", "Some videos featured McDonald's employees in freezers showing off cake boxes. The boxes read: \"Juggling Ronald White Birthday Cake.\" According to the expiration dates visible in several videos, the frozen cakes appeared to last several weeks.", "McDonald's birthday cakes may bring to mind memories of kid's birthday parties from the 1980s and 1990s. At the time, the company advertised its parties on television:", "In one TikTok video, commenters joked that the frozen cake looked \"like it was made in the 90s.\"", "One comment with more than 76,000 likes read: \"It's $9 cuz they been trying to sell it since 1983.\"", "TikTok user @thesirenxx said: \"Did anyone else remember birthday parties at McDonald's or was that just me? They provided cake and balloons.\"", "We were unable to find a page for McDonald's birthday cakes on the company's website. However, the \"PlayPlace & Parties\" page mentioned cakes:", "You bring the kids. We’ll bring the party.", "Fun for kids and stress-free for you, we’ve got parties down to a science. For Happy Meals, cake, decorations, and party favors, just talk to your local McDonald's manager. Choose a McDonald's location with an Indoor or Outdoor PlayPlace for even more fun!", "Find a McDonald's near you to get the party started.", "Several TikTok users said in comments that the cakes were also sometimes used for employee birthdays.", "A number of other videos featured customers buying the cakes and opening the boxes. Others showed people asking questions about their availability and taste-testing them with family.", "We reached out to several McDonald's restaurants to find out about availability. Employees said they had no cakes in their freezers at that time. They told us that it all depended on if their distributor sends any stock. The cakes may also be harder to find because of the TikTok trend.", "We also contacted McDonald's via their corporate website. They confirmed to us that the cakes can be ordered by restaurant owners and operators. They're shipped \"directly from their local distribution center for special occasions – like employee or customer birthdays, graduation ceremonies, or other celebrations.\" They said that \"some restaurants may choose to make the cakes available for customers to purchase, but this is the exception, not the rule. The cakes are not on the official menu and are not available at all locations.\"", "In May 2020, McDonald's locations in Croatia delivered birthday cakes to children at their homes. The shape and texture of the cake was different than the one sold in the United States. Parties at the restaurants had been canceled because of the COVID-19 pandemic.", "Speaking of celebrating birthday parties at home, the company has something special for that too. \"From hosting past birthdays at McDonald’s PlayPlaces to helping with virtual parties during the pandemic with our At-Home Birthday Party Pack, we’ve been there to help families celebrate these special moments,\" McDonald's told us.", "\"McDonald’s is always providing small moments of joy to our customers – and that includes birthday celebrations.\"", "We also found information about other McDonald's cake types available in slices in select countries around the world. They included chocolate coffee cake, red velvet cake, lemon loaf cake, dulce de leche cheesecake, cinnamon carrot cake, and blueberry cheesecake.", "Feb. 15, 2021: The end of this story was updated with more information from a McDonald's corporate contact.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]