["An old rumor that claims posting a legal message on your Facebook wall will stop the social media company from using your photos and status updates has surfaced yet again.", "And it is just as false now as it was when it popped up nearly seven years ago.", "The faux warning says:", "\"An attorney advised us to post this. The violation of privacy can be punished by law. NOTE: Facebook is now a public entity. All members must post a note like this. If you do not publish a statement at least once, it will be tacitly understood that you are allowing the use of your photos, as well as the information contained in your profile status updates. I HEREBY STATE THAT I DO NOT GIVE MY PERMISSION. Copy and re-post.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This online rumor first appeared in November 2012 when Facebook started trading publicly, and while the language is slightly tweaked from earlier iterations, the message remains the same: Post this or else Facebook has control of your content.", "But it isn’t that simple. Facebook users cannot just undo the privacy or copyright terms they agreed to when they first signed up and made an account. As well, simply posting a notice will not have any impact on new policy changes.", "In 2012, the rumor spread around the same time Facebook announced it was considering removing users’ rights to vote on policy changes.", "The company released a statement at the time to address the rumor:", "\"There is a rumor circulating that Facebook is making a change related to ownership of users' information or the content they post to the site. This is false. Anyone who uses Facebook owns and controls the content and information they post, as stated in our terms. They control how that content and information is shared. That is our policy, and it always has been.\"", "That policy hasn’t changed either, according to the company’s terms of service:", "\"You own the content you create and share on Facebook and the other Facebook Products you use, and nothing in these Terms takes away the rights you have to your own content,\" Facebook says.", "Specifically, when you share, post, or upload content that is covered by intellectual property rights (like photos or videos) on or in connection with our Products, you grant us a non-exclusive, transferable, sub-licensable, royalty-free, and worldwide license to host, use, distribute, modify, run, copy, publicly perform or display, translate, and create derivative works of your content (consistent with your privacy and application settings). This means, for example, that if you share a photo on Facebook, you give us permission to store, copy, and share it with others (again, consistent with your settings) such as service providers that support our service or other Facebook Products you use.", "You can end this license any time by deleting your content or account. You should know that, for technical reasons, content you delete may persist for a limited period of time in backup copies (though it will not be visible to other users). In addition, content you delete may continue to appear if you have shared it with others and they have not deleted it.\"", "Meanwhile, it isn’t so much your status updates or photos that Facebook is necessarily interested in, it’s your data.", "Facebook, as well as other websites, wants to know your age, gender, hometown, marital status, religion, general interests … anything that will help it better target advertisements to you. You can visit Facebook’s data policy page for more information.", "An old refurbished rumor claims that posting a message on your Facebook wall will effectively bar the company from using your photos and information.", "The rumor has been debunked as a hoax for some time and does not override Facebook’s terms of use that users agree to when they sign-up.", "We rate it Pants on Fire!", "Facebook post, April 24, 2019", "ABC News, Stop! Don't Copy and Paste that 'Copyright' Facebook Message, Nov. 26, 2012", "WayBack Machine, 2012 Facebook fact-check statement, Accessed April 30, 2019", "Facebook, Terms of Service, Accessed April 30, 2019", "Facebook, Data Policy, Accessed April 30, 2019", "Snopes, Will Posting This Notice Stop Facebook from Making Your Posts Public?, June 4, 2012", "CBS, This viral Facebook privacy hoax is back – don't fall for it, Oct. 17, 2016", "Los Angeles Times, Here's why sharing that Facebook privacy notice is worthless, Sept. 29, 2015", "9 News, Social Scoop: Does Facebook own your data?, Jan. 5, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]