["Gov. Scott Walker says proficiency is rising among third grade readers in Wisconsin schools. Test scores show modest gains now compared to the year before Walker took office in 2011.", "Gov. Scott Walker responds to critics of his cuts to education funding by pointing out signs of progress in the state’s elementary and high schools.", "State residents look at results, Walker says.", "\"For all the hype and hysteria about education, they look at the fact that graduation and third-grade reading scores are up in the state since I took office,\" he told WISN-AM (1130) talk host Jay Weber on April 16, 2014. \"ACT scores continue to be some of the best in the country.\"", "Wisconsin students’ longstanding high-achievement scores on the ACT college-readiness exams (second nationally) are well known.", "But we were interested in what has been happening on the other two measures the governor cited.", "When asked for backup, Walker campaign spokeswoman Alleigh Marré said state Department of Public Instruction data proves the governor’s case. And we found it’s the best source of data in both areas.", "Finishing high school", "Wisconsin’s statewide public school graduation rate was 85.7 percent in the last full school year (2009-’10) before Walker’s term started in January 2010, according to the data. The figure counts those who graduate within four years of starting.", "In 2010-’11, the rate rose to 87 percent. This school year began months before Walker took office, so any policy changes would have had negligible effect on graduation rates.", "The results since then:", "2011-’12: 87.5 percent", "2012-’13: 88 percent", "That 88 percent rate was tied for second-best in the country along with Nebraska, Texas and Vermont. Iowa topped the list at 89 percent, DPI reported.", "At the time Walker spoke on WISN, that 88 percent figure for 2012-’13 was not yet public.", "Also, we should note that pre-2009 data that is comparable is not available. The new data tracks individual students, while the old method used a different methodology.", "Under any of the scenarios, the arrow is pointing up, though not emphatically.", "Reading Scores", "Third-grade readers, the group cited by Walker, are the youngest public-school students to take the annual Wisconsin Knowledge and Concepts Examinations.", "State officials typically measure progress, or lack thereof, on reading by calculating the number of students deemed \"proficient\" or \"advanced\" based on the exams.", "The recent history of that figure for third-graders follows a pattern of one-year improvement followed by one-year decline.", "2005-06: 32.8 percent proficient or advanced", "2006-’07: 34.4 percent", "2007-’08: 33.9 percent", "2008-’09: 35.2 percent", "2009-’10: 32.7 percent (last full school year before Walker’s election)", "2010-’11: 34.2 percent", "2011-’12: 33.1 percent", "2012-’13: 34.9 percent", "2013-’14: 34.6 percent", "So the figure has ping-ponged between about 33 percent and 35 percent. The current figure is higher than most going back nearly a decade, but lower than two of the years.", "It hasn’t been a straight line upward in Walker’s time, the figures show.", "Still, the latest year’s count is \"up\" compared to the baseline year pre-Walker. It’s up just slightly compared with 2010-’11, and more significantly compared with 2009-’10, depending on which is used as the baseline for Walker’s term.", "Public schools, of course, are not the only ones receiving state education aid. Under the voucher or \"choice\" program, private schools in certain districts, most notably Milwaukee, benefit from publicly funded vouchers. We concentrated in this item on public schools because Walker’s comments were in the context of responding to criticism of his public-school funding moves.", "But for the record, third-grade reading scores also have improved in the Milwaukee Parental Choice Program since 2010.", "Did the governor cherry-pick third-graders because they did better?", "Not really. Reading scores were up as a whole for students in grades 3-8 and grade 10 who take the test.", "Walker has made third-grade learning a focal point of his educational platform, and DPI official John Johnson told us that \"third-grade reading and eighth-grade mathematics assessments are often pointed to as predictors of future academic success or struggles.\"", "Finally, there’s the issue of credit.", "Walker doesn’t directly credit his own policies as responsible for the positive trends. He cited the numbers as part of litany of positive things around the state while discussing voter attitudes.", "But implicit in Walker’s statement is some degree of chest-thumping, of course. He’s a candidate seeking re-election, after all.", "He and his critics no doubt would disagree on his impact on these statistics. But it’s clear that longer-term trends are at play here on the shorter time frame Walker cites.", "Our rating", "Walker said, \"Graduation and third grade reading scores are up in the state since I took office.\"", "The numbers, in both cases, are up compared with the year before he took office, though the reading scores bounced around some.", "Some credit may be due prior elected officials, though, because the trend lines haven’t really changed much going back deeper into the pre-Walker era.", "We rate his statement Mostly True.", "WISN-AM (1130) podcast of Gov. Scott Walker appearance on April 16, 2014", "Interview with John Johnson, director, Education Information Services, state Department of Public Instruction, June 2, 2014", "Milwaukee Journal Sentinel, \"State, MPS post improved high school graduation rates,\" May 17, 2012", "Milwaukee Journal Sentinel, \"Wisconsin high school graduation rate rises to 87.5%,\" April 9, 2013", "Wisconsin DPI, press release, \"Graduation rates continue to climb,\" May 8, 2014", "Wisconsin DPI press release, \"Last year for WKCE math and reading; results improve over five years,\" April 8, 2014", "Interview with Walker campaign spokeswoman Alleigh Marré, April 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]