["Prime Minister Narendra Modi had addressed a public gathering in Raebareli on December 16; his first rally following BJP’s recent loss in assembly elections. Covering his speech, NDTV had put out a tweet at 12:16 PM quoting the PM – “Over 1250 crore houses have been set up. People have celebrated Diwali in their new homes. The houses we make will have water, electricity, gas connections and toilets.” The media organisation, however, made a faux-pas vis-a-vis the number of houses PM Modi claimed his government built.", "If one carefully listens to his speech, PM Modi says at 19:42 minutes – “अब तक देश में सवा करोड़ से ज़्यादा घरो का निर्माण किया जा चूका है (Till now more 1.25 crore houses have been constructed.)”", "At 2:08 PM, NDTV corrected the number – “Over 1.25 crore houses have been constructed. People have celebrated Diwali in their new homes. The houses we make will have water, electricity, gas connections and toilets.”", "While NDTV’s earlier tweet attracted 162 retweets, the updated tweet was retweeted only 20 times. The news outlet made the change to 1,250 houses without deleting its earlier tweet, which gave many the opportunity to share it while criticising the PM for claiming that BJP built 1,250 crore houses when the country’s population is only 125 crore.", "The official Twitter handle of Account of INC SC department quoted NDTV’s tweet and wrote – “1250 Crore houses for india? 10 houses for each indian? Even after defeat in 5 states, It seems Modi Ji has not learned any lesson and still doing Jumlebaazi.” It is to be noted that AICC SC’s tweet came before NDTV tweeted PM Modi’s correct statement.", "Mumbai Congress Committee President Sanjay Nirupam also made similar claims while quoting a tweet by BJP MP Smriti Irani where she criticised Congress President Rahul Gandhi for consulting party members before speaking with the media. Nirupam posted his tweet on December 19, which was after NDTV tweeted PM Modi’s actual statement.", "National Convenor of INC India Ruchira Chaturvedi and INC mainstream media communication member Rachit Seth quoted NDTV’s tweet, saying that PM Modi claimed to have built 1,250 crore houses when the population of India is 125 crore. Both of them had tweeted before NDTV’s second tweet.", "Several other AICC members (1, 2, 3) also made similar claims.", "Due to NDTV’s incorrect attribution of a statement to PM Modi, he came in the crosshairs of Congress members who quoted the media outlet’s tweet.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]