["In September, both before and after the first Trump-Biden debate, social media users falsely claimed that then-candidate Joe Biden wore an earpiece or a wire through which he received answers.", "Now, after a debate between Republican Sen. Kelly Loeffler and her Democratic challenger, the Rev. Raphael Warnock, social media users have levied the same allegation — this time against Loeffler.", "On Facebook, some users shared photos of Loeffler with circles around a light-colored strand on her head, accompanied by the text, \"Looky looky. Is this an earpiece? That's why she sounded like a parrot.\"", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "Others shared screenshots and links to a story in the International Business Times, headlined \"Kelly Loeffler Caught Wearing a 'Wire' During Georgia Senate Debate: Was She Being Fed Answers?\"", "The users behind the posts and the International Business Times have not responded to requests from USA TODAY for comment.", "In reality, Loeffler was not wearing a wire at the debate.", "After the rumor began to circulate online, the Atlanta Press Club — which hosted the debate on Sunday, Dec. 6— took to Twitter to debunk it.", "\"The candidates in last night's @atlpressclub debates had no audio assistance from their campaigns,\" its account wrote on Monday.", "Both the New York Times and Reuters concluded that the light-colored strand in question was likely just a stray piece hair that caught the light on stage during the debate.", "Stephen Lawson, a spokesperson for Loeffler, has not responded to a request from USA TODAY for comment on the matter.", "Fact check:More than 40 patients receiving treatment in converted hospital parking garage", "Fact check:Fake story claims former President Barack Obama was arrested for espionage", "Based on our research, the claim that Republican Sen. Kelly Loeffler wore an earpiece or wire during her debate against Democrat Raphael Warnock on Sunday, Nov. 6 is FALSE. The Atlanta Press Club, which hosted the debate, confirmed that candidates had \"no audio assistance.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]