["About this rating", "One of the primary historical \"facts\" many of us learned as schoolchildren was that \"In 1492, Columbus sailed the ocean blue,\" and in three ships named the Niña, the Pinta, and the Santa Maria, the intrepid Italian explorer  —sponsored by Spanish monarchs — sailed across the Atlantic Ocean and \"discovered America,\" in the process finally proving to the world that the Earth was round.", "We're now more aware that much of that simple historical narrative is inaccurate. At no time during any of his four voyages across the Atlantic did Christopher Columbus make landfall at, or set foot on, the North American continent. During his first expedition (1492-93), Columbus' ships touched on various islands that we now know as the Bahamas, Cuba, and Hispaniola, i.e., the Dominican Republic and Haiti. And even if Columbus had reached North America proper by ship at some point, it's unlikely he would have been the first person, or even the first European, to do so. And finally, Columbus certainly didn't \"prove\" the Earth was round, nor did he set out to do so. That information was already a generally accepted fact among educated people of Columbus' time, and, in any case, Columbus didn't definitively establish it by circumnavigating the globe:", "As early as the sixth century B.C., Pythagoras — later followed by Aristotle and Euclid — wrote about Earth as a sphere, and historians say there is no doubt that the educated in Columbus’s day knew quite well that the Earth was round. Columbus in fact owned a copy of Ptolemy’s Geography, written at the height of the Roman Empire, 1,300 years before Chris Columbus set sail. Several books published in Europe between 1200 and 1500 discussed the Earth’s shape, including “The Sphere,” written in the early 1200s, which was required reading in European universities in the 1300s and beyond. The big question for Columbus, it turns out, was not the shape of the Earth but the size of the ocean he was planning to cross.", "It turns out that even some inconsequential basic \"facts\" about Columbus' famed first voyage are problematic. No contemporaneous images of his famous 1492-93 expedition's three ships exist, but we at least know the names of those vessels, right?", "As we all learned by rote in school, they were the Niña, the Pinta, and the Santa Maria. Yet uncertainty remains among historians about the \"official\" or \"original\" names of the ships, as opposed to the nicknames given to them by their crews. The Washington Post, for example, observed that:", "The Santa Maria was also known at the time as La Gallega, meaning \"The Galician.\" The Niña is now believed to be a nickname for a ship originally called the Santa Clara, and the Pinta was probably also a nickname, though the ship’s real name isn’t clear.", "The website for The Columbus Foundation, an entity that operated replicas of two of Columbus' ships (the Niña and the Pinta), also noted the difference between official religious names and nicknames for ships in that time and place:", "The Niña was Columbus' favorite, and for good reason. She was named Santa Clara after the patron saint of [the Spanish port of] Moguer. A Spanish vessel in those days had an official religious name but was generally known by nickname, which might be a feminine form of her master's patronmyic, or of her home port. Santa Clara was always Niña, after her master-owner, Juan Nino of Moguer.", "John Dyson's 1991 biography of Columbus avers that the Santa Maria was Columbus' own renaming of a vessel called La Gallega:", "In Puerto de Santa Maria, [Columbus] found a three-master of about seventy tons called La Gallega ... When she sailed up Tinto and dropped anchor off Pálos, Columbus decided to rename her Santa Maria.", "A Christian Science Monitor contributor went so far as to assert that the ships' common names were irreverent nicknames referring to prostitutes:", "[The ships'] original names were la Santa Clara, la Pinta, and la Santa Gallega.", "As was common of the time, the crews gave each ship nicknames. La Santa Clara became la Niña (\"the girl\"); la Pinta became la Pintada (\"the painted one,\" in other words, \"the prostitute\"); and la Santa Gallega became Maria Galante (the name of another prostitute). The church censored these nicknames, but the way we remember them today borrows heavily from the crews' vernacular.", "Completely accurate details about the names of Columbus' ships may be impossible to determine at this remove, but the reality is definitely more complicated than the common mythology so many generations of youngsters were taught.", "Mach, Andrew.   \"Christopher Columbus: Five Things You Thought You Knew About the Explorer.\"\r\n    The Christian Science Monitor.   10 October 2011.", "Weiner, Eric.   \"Coming to America: Who Was First?\"\r\n    NPR.   8 October 2007.", "Strauss, Valerie.   \"Christopher Columbus: 3 Things You Think He Did That He Didn’t.\"\r\n    The Washington Post.   14 October 2013.", "The Nina.   \"The Original Niña.\"\r\n    Accessed 12 October 2020.", "Dyson, John.   Columbus: For Gold, God, and Glory.\r\n    Toronto: Madison Press Books, 1991.   ISBN 0-670-83725-3   (p. 102).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]