["A message which has spread like wild fire on social media and WhatsApp, states that the Reserve Bank of India is all set to discontinue the Rs 2000 currency note. This message is posted below.", "Posting as received… *Central Reserve Bank of India* Releasing new Rs.1000/- notes on 1st January 2020.", "*Reserve Bank taking back all the Rs.2000/- notes.*", "You can only exchange Rs.50,000/- in 10 days. So, kindly start changing your 2000/- notes immediately.", "*After 10th October 2019 you cannot change your Rs.2000 notes.*", "Several individual users on Facebook have posted this message, with identical text, on their timelines. It states that the Rs.2000 note will be withdrawn by the RBI and in its place, new Rs1000 currency note will be released on January 1, 2020. In addition, the message states that the RBI is taking back the existing Rs 2000 notes, but will only do so till October 10, after which it will not be possible to exchange the Rs 2000 notes.", "The message has also been circulating on WhatsApp and was sent to us for verification on the official Alt News application. It may be noted that the Rs 2000 currency note was introduced after the Central government had announced demonetization in November 2016, invalidating the old Rs 500 and Rs 1000 currency notes.", "The same information was broadcasted by the channel Suvarna News.", "Alt News’s fact-check found that the message is a hoax. There has been no such announcement from the Reserve Bank of India. Any communication put forward by the RBI is published on the official website of the Central Bank, where no such notification has been put up.", "Alt News contacted the Reserve Bank of India for clarification. Department of Communication, RBI stated, “These are all rumours. There has been no such notification (by the RBI). Please refer to the website for all communication”.", "The claim that the RBI is going to withdraw the Rs.2000 note is absolutely false. This is only the latest instance of misinformation targeting the RBI. Earlier in September 2019, a message had gone viral on social media and WhatsApp, which falsely stated that the Central bank is set to shut down nine prominent banks.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]