["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Milwaukee Mayor Tom Barrett and Milwaukee County Sheriff Earnell Lucas attended a \"Dinners with Winners\" event with youths at Milwaukee's Ujima House on Nov. 14, 2018. (Courtesy Jermaine Reed).", "Wisconsin’s juvenile correctional facilities have been in turmoil since about 2012, when the sexual assault of a Racine County youth was mishandled by officials at Lincoln Hills School for Boys.", "In February 2012, Racine County Circuit Judge Richard Kreul wrote to Gov. Scott Walker about one of his cases. Kreul wrote that a Lincoln Hills inmate from Racine was forced to perform a sex act on his roommate and then beaten unconscious. Lincoln Hills workers delayed getting the victim medical treatment for three hours because other inmates were playing a basketball game, according to reports.", "Racine County officials responded by pulling all their youth offenders from Lincoln Hills.", "Since then, there has been a string of additional scandals, and the state faces a Jan. 1, 2021 deadline to shutter the facility (Gov. Tony Evers has sought to extend that deadline). The plan calls for multiple regional facilities that are smaller than Lincoln Hills. One of two new youth prisons will be built in the Milwaukee area.", "But where should it be located? That has been a critical issue.", "The state has identified a location on city-owned land at North Teutonia Avenue and West Mill Road, just south of the city's Safety Academy.", "\"This decision was made without input from my office, the community or Milwaukee County and no further details have been provided about this facility,\" Common Council President Ashanti Hamilton said in a March 12, 2019 news release.", "The site is in Hamilton’s district. He hosted a March 14, 2019 community meeting, which was attended by about 100 residents and grew heated at times. Officials in nearby Glendale have also opposed the state’s selection of the Teutonia Avenue site.", "At the meeting, state Sen. Lena Taylor, D-Milwaukee, sharply criticized Milwaukee Mayor Tom Barrett, describing him and his actions this way:", "\"The mayor who didn't want the children here in the first place, who has never been to a juvenile facility, who didn't want it to be done, should not be the voice at all.\"", "That caught our attention, since Barrett had been a critic of Lincoln Hills, located in Irma in Lincoln County  --  about three and a half hours from Milwaukee -- and an advocate for creating a facility closer to the families of inmates.", "Is Taylor right that Barrett did not want a juvenile facility in Milwaukee, \"has never been to a juvenile facility,\" and didn't want it to be done at all?", "The background", "A spate of proposals, including community halfway houses and a 2018 proposal for Milwaukee County to open a treatment center for male teens on Milwaukee's north side, have come and gone, as officials struggled to find an appropriate location for a new facility.", "On March 12, 2019, Evers announced that two new youth facilities would be built: The Milwaukee one and one northwest of Appleton, in the town of Hortonia. Evers’ budget calls for spending nearly $200 million on the smaller replacement youth prison facilities.", "We reached out to Taylor’s office to seek backup for her claim, but her staff did not respond to repeated requests via phone and email.", "We did find a Feb. 9,  2016 FOX6 news report in which Barrett said he was in favor of protecting the youths from possible abuse at Lincoln Hills, but said \"I don’t want the ramifications of that to affect public safety in Milwaukee. I’m very concerned about that.\"", "Does that amount to opposition? Sort of. At least at the time.", "The Barrett record", "When we reached out to Jodie Tabak, Barrett’s communications director, she noted things have changed since the 2016 news report.", "\"The idea being pushed at the time by the county was focused on group homes,\" Tabak said. \"At that time, Mayor Barrett expressed his concerns about violent offenders and violent repeat offenders who should be in a secure facility, closer to families, receiving services and not in group homes in neighborhoods.\"", "As for Taylor’s three criticisms, here is a closer look:", "-- \"Didn’t want the children here in the first place.\"", "In addition to the information above, on July 13, 2016, Barrett told the Milwaukee Journal Sentinel that Lincoln Hills was a failed \"experiment.\" He said he wanted the state to take immediate steps to reopen Ethan Allen School for Boys, the Waukesha County juvenile correctional facility shut down five years earlier by Gov. Walker.", "\"The question becomes what happens to the young people there. And some of the young people need to be in a secure facility,\" Barrett said at the time. \"And from a logistics standpoint, from a cost standpoint, from a programmatic standpoint, from a staffing standpoint, Ethan Allen provides an opportunity that must be explored very, very quickly.\"", "Waukesha County officials objected, saying it would be too costly to reopen Ethan Allen.", "In any case, Barrett was on the record for being in favor of having the youth moved closer -- though not specifically in Milwaukee.", "-- \"Has never been to a juvenile facility.\"", "On this point, Tabak said Barrett \"recently had dinner at a local facility where youth are under court order to be there, including those that have been to Lincoln Hills.\"", "Tabak said the Nov. 14, 2018 dinner took place at Ujima House.", "In a March 7, 2019, opinion piece for Milwaukee Neighborhood News Service, Executive Director Jermaine Reed described Ujima House as \"a non-secure facility in the heart of the inner-city of Milwaukee.\"", "In a telephone interview, Reed said although some of the youths do wear monitoring bracelets, the shelter is \"not a correctional facility\" but \"our services are sometimes used as an alternative to corrections. We have had youth on a GPS monitoring system. If they violate their conditions of release they could be sent to detention or possibly Lincoln Hills.\"", "So, the visit to Ujima House was to something very different than to a Lincoln Hills-style facility.", "In a followup email, Tabak said the mayor has visited several correctional facilities.", "\"He has been to St. Rose’s, Lakeside (St. A’s), State Correctional Facility in Racine, Taycheedah, Vel Phillips Center, Felmers Chaney Center in the heart of the City, the County corrections facility in Franklin, the downtown jail and Waupun. He has not been to Lincoln Hills, but he’s obviously been to many juvenile and adult corrections facilities.\"", "-- Who \"didn't want it to be done.\"", "As noted, Barrett initially proposed reopening Ethan Allen, in Waukesha County’s Town of Delafield. Two years later, Barrett had dropped the Waukesha County idea and supported a Milwaukee facility.", "Our rating", "Taylor said Tom Barrett did not want a juvenile facility in Milwaukee, \"has never been to a juvenile facility\" and \"didn't want it to be done.\"", "The mayor was opposed to early plans, but mainly because of concerns about the possibility of violent offenders being placed in neighborhood group homes instead of a secure facility. While he initially suggested reopening Ethan Allen in Waukesha County, he has backed a city site.", "As for the visit to a juvenile facility, while Ujima House is a far cry from Lincoln Hills, the mayor has visited numerous other facilities.", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "Emails, telephone calls, Jodie Tabak, Mayor Tom Barrett’s communications director", "Telephone call, Jermaine Reed, executive director Ujima House, March 28, 2019.", "Common Council President Ashanti Hamilton news release \"Community voices must be heard before final decision on Youth Justice Facility,\" March 12, 2019.", "Milwaukee Journal Sentinel, \"FBI joins wide-ranging probe at Lincoln Hills,\" Dec. 10, 2015.", "Milwaukee Journal Sentinel \"Walker’s office heard multiple warnings about Lincoln Hills,\"Dec. 17, 2015.", "Milwaukee Journal Sentinel  Racine County pulled youths from Lincoln Hills because of botched case,\" Feb. 11, 2016", "Milwaukee Journal Sentinel \"Crisis at Lincoln Hills juvenile prison years in the making,\" Dec. 17, 2016.", "Milwaukee Journal Sentinel Milwaukee County plans local treatment center for teen offenders in wake of Lincoln Hills crisis,\" Jan. 24, 2018.", "Milwaukee Journal Sentinel \"Lincoln Hills' replacements to be built in Milwaukee and Outagamie County,\" March 12, 2019.", "Milwaukee Journal Sentinel \"Milwaukee residents rip mayor and county officials for ignoring input on juvenile facility,\" March 14, 2019.", "Fox6 News \"It’s wrong: Franklin mayor not sure HOC is best option for offenders from Lincoln Hills,\" Feb. 9, 2016.", "Milwaukee Journal Sentinel \"Glendale officials register opposition to sate plans for juvenile detention facility on Teutonia Avenue,\" March 26, 2019.", "Milwaukee Journal Sentinel \"Tom Barrett calls for closing Lincoln Hills, reopening Ethan Allen,\" July 13, 2016.", "Milwaukee Journal Sentinel \"Lincoln Hills' replacements to be built in Milwaukee and Outagamie County,\" March 12, 2019.", "WTMJ-TV \"Positively Milwaukee: Ujima House helps young men reach potential,\" Feb. 23, 2018.", "Milwaukee Neighborhood News Service \"Let’s reimagine youth justice in Milwaukee,\" March 7, 2019.", "Associated Press \"Evers’ budget includes gas tax, minimum wage hike, automatic voter registration,\" March 1, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]