["“Trudeau spotted in Christ Church, Barbados,” reads the headline of a January 2 article shared more than 3,000 times on Facebook.", "The article, which is based on anonymous sources and speculative tweets, was published by Conservative Beaver, a website created just three months ago. AFP Fact Check has previously debunked two other false articles published on the site.", "This story was published after a December 31 Facebook post suggested that Trudeau was in Barbados, pointing to the fact that a Challenger 600 series jet from Canadian plane maker Bombardier had landed there that day.", "The Canadian government transports officials in Challenger aircrafts, but one Twitter sleuth pointed out that the plane in Barbados did not originate from Canada.", "Ann-Clara Vaillancourt, a spokeswoman for the Prime Minister’s Office, told AFP by email, “The Prime Minister has not travelled, he spent the holiday period with his family at home.”", "Vaillancourt did not wish to specify whether the family was at the official residence at Rideau Cottage in the capital Ottawa, or the country residence of the prime minister, Harrington Lake, about 16 miles (26 kilometers) in the province of Quebec.", "Travel between Quebec and Ontario does not violate current health restrictions.", "According to the prime minister’s official itinerary, Trudeau was either in “private meetings” or on “personal” time between December 21 and January 4, except for a media appearance in Ottawa on December 23.", "The prime minister did not post on social media over the holidays, but his wife Sophie Gregoire sent her wishes to Canadians on December 24 in an Instagram video with a geolocation in Ottawa.", "Twitter accounts have continued to question the prime minister’s whereabouts, leading the hashtag #WhereisTrudeau to trend briefly in Canada.", "Trudeau faced criticism in 2019 when footage showed the prime minister on vacation surfing in Tofino on Canada’s west coast. His 2016 Christmas trip to the Bahamas was also found to break ethics rules.", "Glen McGregor, the Parliamentary Press Gallery reporter for Canadian broadcaster CTV, wrote on Twitter on January 1 that the Liberal prime minister was in Harrington Lake with his family for the holidays.", "McGregor confirmed to AFP that the information in his tweet was accurate and “based on reliable sources.”", "Personal travel over the holiday season, despite strict recommendations to stay home from health and government officials, has led to nearly two dozen Canadian politicians resigning or facing reprimand.", "Pierre Arcand, a Liberal member of parliament from Quebec, lost his shadow cabinet role after being spotted in Barbados in December.", "On January 4, Alberta Premier Jason Kenney released a statement outlining consequences for members of his government who traveled abroad.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]