["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Less than one week after polls closed in the 2020 presidential election, U.S. President-elect Joe Biden began discussing health care and the ongoing COVID-19 pandemic at news conferences. Photos and videos of the highly publicized events in Biden's hometown of Wilmington, Delaware, showed him on stages decorated with posters reading, \"Office of the President Elect.\"", "Biden, Vice President-elect Kamala Harris, and their allies promoted the briefings and a website titled \"buildbackbetter.com\" as evidence of their work preparing for the White House before Inauguration Day on Jan. 20, 2021.", "Meanwhile, President Donald Trump and his Republican supporters refused to acknowledge such efforts and blocked government officials from cooperating with the Biden-Harris team.", "Trump and his inner circle spewed misinformation in an attempt to convince Americans the country's constitutionally mandated elections process — which requires a group of electors to officially cast votes for president after Election Day — provided Trump the time to use court systems or other means to defy the popular vote. (We explain the Electoral College and the process for certifying election results after news media declare winners in presidential races here.)", "As part of that messaging strategy, a claim surfaced on social media alleging Biden created the \"Office of President Elect\" to nefariously convince Americans that Trump had no chance at another term. Sebastian Gorka, a former adviser to Trump who hosts a conservative talk show, for example, posted the below-displayed tweet:", "But that was not true. Firstly, Biden did not create the \"Office of the President Elect,\" nor was he the first person to address the country under that title. A photographer for Getty Images captured Trump on Jan. 11, 2017, speaking at a podium decorated with the same phrase in the weeks after his 2016 victory over Democratic candidate Hillary Clinton.", "Xinhua/Gary Hershorn via Getty Images", "Next, we sought evidence to confirm or deny that Biden was using the office as a political strategy to mislead Americans about voting results.", "Looking at states' Secretary of States' websites, which are databases of official voter information, news media announced Biden secured the majority of the nation's electoral votes — 270 — on Nov. 7. That announcement kicked off a series of steps outlined in the Constitution, federal statutes, and state laws to officiate Biden as America's 46th President.", "Two days later, Biden addressed the country at a podium decorated with a sign that read \"the Office of the President Elect.\" Opponents called such events premature since Trump had not conceded defeat and states had yet to certify voter tallies. However, it was not unusual for state election officials to take days, or weeks, to certify voter tallies and designate electors, and that process continues under federal laws regardless of a losing candidate's willingness to acknowledge defeat.", "No evidence showed Biden's group of officials, aids, and other staff — otherwise known as the Biden-Harris transition team — used the decorations reading \"the Office of the President Elect\" to try to convince people that he had illegitimately won the presidency. Rather, it appeared to be a marketing strategy for its efforts to plan staffing and policy agendas before Inauguration Day.", "We reached out to the Presidential Transitional Center, a nonprofit that brings together politicians from both political parties to develop best practices for presidential transitions, which provided us the following analysis:", "During the period between Election Day and the inauguration, presidents-elect must shift from campaigning to governing. As our analysis reveals, this traditionally entails a mix of activities that include personnel announcements, policy development, and stakeholder, media and public engagement.", "At least one federal document obtained by Snopes — a memorandum of understanding between the General Services Administration (GSA), an executive branch agency that oversees presidential transitions, and Biden's team — said the \"Office of President Elect\" was synonymous with efforts by \"President Elect [Biden] and Vice President-elect [Harris].\"", "Yet no federal law establishes \"the Office of the President Elect\" as a formal section of government. Rather, federal agencies appear to accept the office as an informal title for teams working on behalf of presidents-elect (as shown via the above-displayed document), carrying out efforts under the 1963 Presidential Transition Act. That congressional package outlines steps for the GSA to green light millions of federal dollars to the president-elect's transition team to set up operations.", "In an email to Snopes, researchers with the Presidential Transitional Center wrote:", "[There] is no formal office of the president-elect, however president-elect support is traditionally its own office within the larger transition team. This office coordinates the president-elect's schedule and travel, including communications, press engagements, and the like.", "In other words, initiatives promoted by Biden and Harris under the title of \"Office of the President Elect\" were part of a larger effort by their transition team to prepare for their new jobs, not a nefarious conspiracy to undermine Trump.", "Additionally, the researchers told Snopes buildbackbetter.com would turn into a government-run website if, or when, the administrator of the GSA, a Trump appointee, ascertained the \"apparent successful candidate\" — or formally recognized Biden as the election's winner. That had not happened as of this writing, and the agency did not explain why that was the case.", "The administrative delay dragged on as the Trump campaign banked on several lawsuits alleging schemes to undermine ballot casting or counting and attempted to energize his loyal supporters. A  team comprised of Trump senior officials and campaign aids told journalists those lawsuits were less about winning arguments over specific voter tallies and more about forestalling \"a loss he can't quite grasp,\" per The Associated Press.", "In sum, considering the visual evidence of Trump addressing the country using the title \"Office of the President Elect,\" as well as acknowledgment from researchers of presidential transitions that the office informally represents work by transition teams, we rate this claim \"False.\"", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]