["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on February 17, 2021", "President Joe Biden got some facts wrong and spun others in a Feb. 16 town hall that aired on CNN.", "The town hall was held in Milwaukee, Wisconsin.", "Biden said it was “not true” that he had revised his 100-day school reopening goal to mean a majority of schools only need to be open one day a week, claiming that was “what was reported.”", "It’s what was reported because that’s exactly what White House Press Secretary Jen Psaki said.", "As we noted in our story “Biden’s Underwhelming School Reopening Goal,” two studies that looked at random samples of school districts around the country estimated that a majority of schools were already offering in-person school at least one day a week, and had been doing so before Biden took office.", "At his town hall, Biden told CNN’s Anderson Cooper that his 100-day goal is to have a majority of kindergarten through eighth grade schools open five days a week, and he blamed the confusion on “a mistake in the communication.”", "Cooper: Well, let me ask you, your administration had set a goal to open the majority of schools in your first 100 days. You’re now saying that means those schools may only be open for at least one day a week —", "Biden: No, that’s not true. That’s what was reported. That’s not true. That was a mistake in the communication. But what I’m talking about is I said opening the majority of schools in K through eighth grade, because they’re the easiest to open, the most needed to be open in terms of the impact on children and families having to stay at home.", "Cooper: So when do you think that would be K through eight, at least five days a week if possible?", "Biden: I think we’ll be close to that at the end of the first 100 days.", "Biden’s answer may have left the impression that the media had misreported the specifics of his goal. But that’s not the case.", "The fine-print addition to Biden’s stated 100-day goal was detailed by Psaki in a Feb. 9 press briefing, when a reporter asked what exactly Biden’s definition of “open schools” was.", "“His goal that he set is to have the majority of schools — so, more than 50 percent — open by day 100 of his presidency,” Psaki said. “And that means some teaching in classrooms. So, at least one day a week. Hopefully, it’s more. And obviously, it is as much as is safe in each school and local district.” Later, she put it his way: “teaching at least one day a week in the majority of schools, by day 100.”", "Psaki did not move off that clarification of the goal when asked at a press conference the following day why Biden had never “mentioned the small print that that was just going to be for one day a week.” Psaki said, essentially, that no one had asked.", "“The president made a — set a goal of reopening the majority of schools within 100 days, and when you asked what that meant, I answered the question,” Psaki said.", "Psaki described that narrower goal as “our own effort to … set a bold and ambitious agenda for how we’re going to measure ourselves and progress.” She added that the administration hoped to “exceed” that goal.", "Indeed, as we have written, the U.S. may already be exceeding the goal defined by Psaki. According to Burbio, a company that aggregates school event information and tracks school reopenings, 40.6% of K-12 students in the U.S. are attending schools that offer traditional, in-person learning; 25.5% are attending schools that offer hybrid, or two to three days a week in-person learning; and 33.9% are attending schools that offer “virtual only” school.", "In other words, as of Feb. 10, an estimated 66.1% of K-12 students attended schools that offer either traditional in-person instruction every day, or hybrid instruction — at least one day a week in person.", "Reaching the goal as stated by Biden may take a little longer. As we said, Burbio estimates that about 40% of K-12 students in the U.S. are attending regular, full-time, in-person school.", "We should note that the Burbio data is for K-12 students, and Biden’s goal is specifically for kindergarten through eighth grade — not high schools — a caveat Biden has been adding since late December. At the town hall, Biden said his goal has been focused on the earlier grades “because they’re the easiest to open, the most needed to be open in terms of the impact on children and families having to stay home” and because high school students “socialize a lot more and they’re older and they transmit more than young kids do.”", "The Department of Education says it will begin collecting data on the status of elementary and middle school reopenings, but that information is not yet available.", "Biden made some confusing comments on the amount of COVID-19 vaccines that were available when he took office, and his remarks left the false impression that the preceding administration had contracted for fewer vaccines than it actually had.", "Biden said when he took office “there was only 50 million doses that were available. We have now, by the end of July we’ll have over 600 million doses, enough to vaccinate every single American.”", "Shortly after that, he said that “we got into office and found out the supply, there was no backlog, I mean there was nothing in the refrigerator figuratively and literally speaking.”", "The latter comment appeared to contradict his earlier statement that there were 50 million doses available when he was inaugurated, but Biden said “there was no backlog.”", "That’s not surprising, given the Washington Post had reported on Jan. 15 that the Trump administration had stopped holding in reserve second doses of the vaccines and had begun sending those to states in late December. (Both of the COVID-19 vaccines authorized so far — from Pfizer/BioNTech and Moderna — require two shots, spaced a few weeks apart.) The then-incoming Biden administration also had supported such a policy of not holding back doses.", "There was a backlog in terms of allocated vaccines not yet being administered. As of the morning of Jan. 30, the Centers for Disease Control and Prevention said nearly 50 million doses had been distributed and nearly 30 million had been administered. As of the morning of Feb. 17, 56.2 million doses have been administered out of 72.4 million delivered, according to the CDC.", "Overall, there have been issues with vaccine supply. A late December NBC News analysis determined: “The Trump administration’s Covid-19 vaccine distribution program needs a major shot in the arm because at the current rate, it would take almost 10 years to inoculate enough Americans to get the pandemic under control.”", "As for Biden’s comment that “by the end of July we’ll have over 600 million doses,” that was the plan of Donald Trump’s administration, too, though that plan depended on other vaccines in development getting authorization from the Food and Drug Administration. The Biden administration asked Pfizer and Moderna, the only two companies that now have authorized COVID-19 vaccines, to provide the U.S. with more.", "According to the Government Accountability Office, “As of December 31, 2020, the government had at least 800 million vaccine doses under contract expected to be delivered by July 31, 2021, pending any issues with clinical trials, EUA issuance, or other factors.” Those doses included vaccines from four companies who have not yet received FDA authorization.", "In the town hall, Biden said: “We’ve moved out, went to the Pfizer and Moderna and said, can you produce more vaccine and more rapidly? They not only agreed to go from 200 to 400, then they agreed to go to 600 million doses.”", "Pfizer and Moderna had already agreed to go to 400 million doses (200 million each) in December. The initial agreement with the Trump administration was for 200 million doses total from the two companies, but the administration made agreements for another 200 million total by July 31, according to the GAO report.", "The Biden administration announced this month the two companies would provide another 200 million doses by then, for a total of 600 million.", "When asked what he would do to increase the number of available vaccines for Black and Hispanic people, Biden overstated what his administration has done.", "Biden wrongly claimed that Federally Qualified Health Centers, or FQHCs, would now receive 1 million vaccines per week. But that’s the total number of vaccines that they will receive — at least initially.", "Biden: That’s why last week I opened up, I met with the Black Caucus in the United States Congress and agreed that I would — all of the — all of community health centers now, which take care of the toughest of the toughest neighborhoods in terms of illness, they are going to get a million doses, you know, a week, and how we’re going to move forward because they’re in the neighborhood.", "On Feb. 9, the Biden administration announced that FQHCs would receive vaccines for their clients, beginning Feb. 15. On the day of the announcement, Psaki, the White House press secretary, said, “Ultimately, in this initial program phase, we plan to reach 250 community health centers. And again, across this initial phase, our goal is to allocate 1 million doses during this phase. That’s 500,000 first doses and 500,000 second doses.”", "Biden claimed, without evidence, that racehorse owners receive tax breaks worth almost $9 billion. The president made that remark while advocating for having the federal government pay to provide free tuition for community college students.", "Biden: Everyone should be able to go to community college for free, for free. That costs $9 billion. And we should pay for it. And the tax policies we have now, we should be able to pay for you. You spend almost that much money as a break for people who own racehorses.", "Biden is right that it would cost about $9 billion to provide free tuition at the two-year colleges, according to the Department of Education. But we found no evidence of a $9 billion tax break for racehorse owners. The White House did not provide any evidence, and tax and budget experts we interviewed were left scratching their heads trying to figure out what the president meant.", "There was criticism late last year of certain tax provisions contained in a massive $2.3 trillion bill that then-President Trump signed into law on Dec. 27 to fund the government and provide COVID-19 relief.", "Among other things, the bill contained provisions that benefited racehorse owners. “The provision most people focus on is the special cost-recovery rule for racehorses age 2 or younger,” Howard Gleckman, a senior fellow at the Tax Policy Center, told us.", "“Most horses must be depreciated over 7 years, but one of the tax extenders temporarily allows these young horses to be depreciated over just 3 years,” Gleckman explained. “This is scheduled to expire at the end of 2021.”", "But the Joint Committee on Taxation, Congress’ nonpartisan scorekeeper, said that provision had no impact on federal revenues, despite criticism of it. “Special depreciation rules for young racehorses may be indefensible as tax policy but they don’t cost the government a lot of money, at least in the context of the federal budget,” Gleckman said.", "“Horse breeding overall is a relatively small business as these things go: about $1b annually in revenues” for all North American breeders, Gleckman said, citing 2019 data from the Jockey Club. Alicia Hughes, a spokeswoman for the National Thoroughbred Racing Association, also cited the $1 billion in annual revenues in an email to us about Biden’s statement.", "“The President is NOT correct when he says the tax break for horse owners costs almost $9 billion – especially when the total sales figures for horses at public auction is only around $1 billion,” she said.", "Alex Waldrop, CEO of the National Thoroughbred Racing Association, said: “I don’t really know what he’s referring to.” He was not alone.", "Steve Ellis, president of the government waste watchdog group Taxpayers for Common Sense, said Biden’s remark about racehorse owners “leaves me scratching my head,” adding, “for the life of me I can’t figure out what he was referencing beyond this relatively small provision.”", "Biden said there is “consensus among economists left, right, and center” that “we can’t spend too much” in a COVID-19 relief bill. In fact, even some center-left-leaning economists have raised concerns that Biden’s proposed $1.9 trillion American Rescue Plan may be too large.", "Cooper: You’ve made passing COVID relief bill the focus of your first 100 days. Those on the right say the proposal is too big. Some on the left say it’s not big enough. Are you committed to passing $1.9 trillion bill or is that final number still up for negotiation?", "Biden: I’m committed to pass — look, here’s — some of you are probably economists or college professors or you’re teachers in school. This is the first time in my career — and as you can tell, I’m over 30 — the first time in my career that there is a consensus among economists left, right, and center that is over — and including the IMF and in Europe, that overwhelming consensus is, in order to grow the economy a year, two, three, and four down the line, we can’t spend too much.", "In fact, there has been spirited debate among center-left economists about just that.", "In an op-ed published in the Washington Post on Feb. 5, Larry Summers, former U.S. treasury secretary to Bill Clinton and Barack Obama’s National Economic Council chair, argued that legislators needed to consider the potential risk that the spending is too large.", "“Judged relative to either the macroeconomic output gap or declines in family incomes, the proposed covid-19 relief package appears very large,” Summers wrote.", "Summers warned the massive spending package could trigger a sharp rise in inflation and could hinder future “public investments that should be the nation’s highest priority.”", "Former International Monetary Fund Chief Economist Olivier Blanchard echoed Summers’ concerns, writing on Twitter on Feb. 5, “I am known as a dove. I believe that the absolute priority is to protect people and firms affected by covid. Still, I agree with Summers. The 1.9 trillion program could overheat the economy so badly as to be counterproductive. Protection can be achieved with less.”", "The following day, Blanchard added, “Let me double down and go through some numbers. I agree that too much is better than too little and we should aim for some overheating. The question is how much. Much too much is both possible and harmful. I think this package is too much.”", "Douglas Holtz-Eakin, president of the center-right American Action Forum and a former director of the Congressional Budget Office, told the New York Times, “We’re already in uncharted territory.” Noting that fourth-quarter gross domestic product was only about $119 billion below where it was a year ago, Holtz-Eakin said, “Do we need another $1.9 trillion to deal with that problem? I have an arithmetic problem with where we are.”", "In an analysis of Biden’s plan, the Committee for a Responsible Federal Budget calculated that the $1.9 trillion proposal would “likely be enough to close the output gap” between actual and potential GDP “two to three times over.” That “overshoot could be beneficial” the report states, but the authors also warned it could “pose risks to the economy and the fiscal outlook.”", "“While the economy can operate above its long-term potential for periods of time, it cannot do so indefinitely or sustainably,” the authors wrote. “One possibility is that the excess funds are economically ineffective, adding to the debt without improving the economy.” The excess stimulus could also lead to higher inflation, the report states, and could lead to “an economic cliff or crash as the stimulus fades.”", "To be sure, there are also many economists who think the stimulus package proposed by Biden is appropriately sized. We’re not going to wade into how many economists may agree or disagree with Biden’s proposal, let alone who is right, but as the examples we cited above show, Biden was stretching the facts when he claimed there is “consensus among economists left, right, and center” that “we can’t spend too much.”", "In talking about his support for a $15 federal minimum wage, Biden mixed up his talking points, wrongly saying that if the current rate had been indexed for inflation, it would be $20 an hour now.", "Biden: For example, if it went — if we gradually increased it — when we indexed it at $7.20, if we kept it indexed by — to inflation, people would be making 20 bucks an hour right now.", "The federal minimum wage was set at $7.25 in July 2009, and it remains there today. If it had been tied to inflation, however, it would be $8.81, according to the Bureau of Labor Statistics’ inflation calculator.", "The left-leaning Center for Economic and Policy Research, however, did say that the minimum wage would be more than $20 if it had kept pace with worker productivity, not inflation. The White House press office referred us to that report. “While the national minimum wage did rise roughly in step with productivity growth from its inception in 1938 until 1968, in the more than five decades since then, it has not even kept pace with inflation,” senior economist Dean Baker wrote in January 2020. “However, if the minimum wage did rise in step with productivity growth since 1968 it would be over $24 an hour today.”", "While answering a question on whether he would sign immigration legislation that did not include a pathway to citizenship for the millions of people already living in the U.S. illegally, Biden wrongly said that most of the unauthorized population is not Hispanic and came to the U.S. legally but overstayed their visas.", "“The vast majority of the people, those 11 million undocumented, they’re not Hispanics,” Biden said. “They’re people who came on a visa, was able to buy a ticket to get in a plane, and didn’t go home. They didn’t come across the Rio Grande and swim.”", "That’s false.", "A February 2020 report written by Robert Warren of the Center for Migration Studies estimated that, of the 10.6 million people in the U.S. illegally in 2018, “about 5.7 million (54 percent) entered across the border, and 4.9 million (46 percent) entered with a temporary visa and overstayed.”", "The report does make the point that a majority of the 4 million of the total unauthorized population who arrived between 2010 and 2018 originally came to the U.S. legally.", "“Of those, 2.6 million (66 percent) overstayed their temporary visas, and 1.3 million (34 percent) entered illegally across the border,” it said.", "And though the report doesn’t offer a breakdown by race or ethnicity, it does show that at least 70% of individuals in the U.S. illegally, as of 2018, are estimated to have come from primarily Spanish-speaking countries in Latin America. Mexico alone (5.11 million) accounted for nearly half (48%) of the unauthorized population in the U.S. in 2018, the report said.", "Those figures are similar to the most recent country-of-origin estimates from the Migration Policy Institute.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]