["About this rating", "U.S. Senator Mitch McConnell experienced an influx of family wealth in 2008 due to an inheritance his wife received.", "McConnell didn't mysteriously increase his net worth by $2.4 million every year over the course of a decade while serving in the Senate.", "In late February 2019, a misleading meme was circulated on Facebook that led viewers to ask whether U.S. Senate Majority Leader Mitch McConnell of Kentucky had mysteriously amassed vast wealth in yearly increments to the tune of $2.4 million while in office:", "As Senate Majority Leader, McConnell received an annual salary of $193,400, but the Kentucky Republican reported an influx of family wealth between $5 million and $25 million in 2008, according to his financial disclosures. That influx was the result of an inheritance his wife received upon the death of her mother, and that  information has been part of public discourse since 2014, when it became campaign fodder for McConnell's Democratic opponent, Allison Lundergan Grimes:", "Although the meme and the campaign ad upon which it was likely based were set up to make it seem as if McConnell's wealth increase were the result of his role in the Senate and thus involved unethical or illegal activities, most of his net worth actually derives from his wife, Transportation Secretary Elaine Chao, who hails from a wealthy business family and married McConnell in 1993.", "Chao is the daughter of James S.C. and Ruth Mulan Chu Chao. Her father is the founder of the New York-based international shipping and trading company Foremost Group, an organization her sister, Angela, chairs. How wealthy is the Chao family? Wealthy enough to have bestowed Harvard Business School with a $40 million gift in 2012.", "According to the non-profit government transparency organization Center for Responsive Politics, McConnell's net worth jumped from an estimated $7.8 million in 2007 to $17 million in 2008, owing entirely to a tax-exempt, money market fund in an account he held jointly with his wife:", "As the Washington Post reported in 2014, McConnell's increase in wealth reflected inheritance mone Chao received when her mother passed away in 2007:", "That’s almost a sevenfold increase in 10 years. McConnell has quadrupled his net worth since 2007, when it was $7.8 million.", "So what happened in 2008? His financial disclosure form tells the story—suddenly there appeared a tax-exempt money market fund, valued at between $5 million and $25 million, listed as a “gift from a filer’s relative.” (Look at Line 2 and then Line 3.)", "Indeed, a McConnell spokesman confirms that this was an inheritance for McConnell’s wife, former Labor Secretary Elaine Chao, after her mother died in 2007. Chao, who married McConnell in 1993, earns significant income on her own, serving on corporate boards, and has at least $1 million in a Vanguard 500 Index Fund. (Since these shares are in her name, McConnell only needs to report they have a minimum value of $1 million.)", "The Center for Responsive Politics estimated McConnell's net worth in 2015, the most recent figure available, to be nearly $27 million.", "Kessler, Glenn.   \"How Did Mitch McConnell’s Net Worth Soar?\"\r\n    The Washington Post.   22 May 2014.", "Newmyer, Tory.   \"The Secret to Mitch McConnell's Millions.\"\r\n    Fortune.   20 March 2014.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]