["Amidst the preparations for the Ram Temple, the centre greenlit the construction of the Ayodhya International Airport in February 2021. Now, a letter attributed to Prime Minister Modi is viral on social media. The alleged letter shows him thanking Yogi Adityanath for his efforts towards building a Hindu nation. Apart from this, he grants the constructions of an international airport in Ayodhya for which he approves a sum of Rs 1,000 crore. The second paragraph reads, “Hindus will always be grateful to you and your team for your honest and steady hard work towards the milestone of saffronisation, which is a major pillar of Hindu Rashtra. I wish you and your team the very best for your future elections in 2022 and once again congratulate you for this remarkable achievement.” It is dated March 5, 2021.", "Twitter user Zakir Hussain Ansari shared this letter, claiming that it reveals the truth of the Modi administration. (Archive link)", "The hidden truth of Modi government is exposed, BJP is engaged in making the country a Hindu nation.#INDvENG #RishabhPant #SwedenIndiaforInnovation #WandaVisionFinale #MessiMagicInIndia #TaxChor #RheaChakraborty #FarmersProtest100Days #INDvsENG #fridaymorning #XiaoZhan #Pant pic.twitter.com/rJcrBCJFho", "— Zakir Hussain Ansari (@zakir50403) March 5, 2021", "Several handles tagged Alt News inquiring about the veracity of this letter.", "क्या ये लेटर सही है? अगर सही है तो बहुत ही शर्मनाक है..@AltNews पुष्टि कर सकते है..@ajitanjum @LambaAlka pic.twitter.com/V5nlIOGoOX", "— kundan singh (@KundanSNawada) March 6, 2021", "Twitter user @nandtara was among them.", "Please tell me this is fake, because if it’s true then Narendra Modi has shattered our last vestige of being a SECULAR DEMOCRATIC nation. Surely @LiveLawIndia this is actionable in Courts, if true???@AltNews @zoo_bear please clarify pic.twitter.com/DOBzWoQZsJ", "— Be the Change👊🏻 (@nandtara) March 6, 2021", "Alt News did not find any media reports covering this alleged letter from Prime Minister Narendra Modi to Uttar Pradesh Chief Minister Yogi Adityanath.", "Apart from this, Yogi Adityanath has been addressed as ‘प्रिय’ (Dear) by Prime Minister Modi. However, the Prime Minister usually uses ‘Sh.’ (Shri) or ‘Smt.’ (Shrimati) in his official communications.", "In contrast to official correspondence, the name and address of the recipient are not mentioned in the bottom left corner.", "In 2020, the prime minister wrote a letter of condolence to the Uttar Pradesh CM after his father passed away. A copy of this is given below.", "The fact-checking arm of the Uttar Pradesh government also tweeted that this correspondence is fake.", "A purported letter written by the Hon. Prime Minister Shri @narendramodi Ji to #UPCM Shri @myogiadityanath Ji for the development of Ayodhya International Airport is doing rounds on social media.#InfoUPFactCheck: This letter is #Fake! pic.twitter.com/jEYKbjVi2q", "— Info Uttar Pradesh Fact Check (@InfoUPFactCheck) March 6, 2021", "The letter makes a few claims about the international airport to be built in Ayodhya. According to a Livemint report dated March 3, 2021, once the Centre approved the construction of an international airport in Ayodhya, the airline is likely to start by the beginning of next year (2022). It also states that recently, the central government gave Rs 250 crore and the state government set aside Rs 1,000 crore for the airport’s construction. The UP government sanctioned a total of Rs 1001 crore and 77 lakh to purchase 555.66 acres of land for the project.", "Another purported letter from rime minister Modi to Yogi Adityanath went viral earlier where he is seen thanking the latter for supporting Hindu Rashtra. It also stated that Prime Minister Modi has allocated Rs 50 crore for the Ram Temple’s construction.", "On August 8, 2020, PIB Fact-check tweeted that the letter is fake.", "Claim: A Facebook user, has posted a letter, allegedly written by PM @narendramodi to Chief Minister of #UttarPradesh @myogiadityanath#PIBFactCheck: This letter is #Fake pic.twitter.com/9dHdcEEMu4", "— PIB Fact Check (@PIBFactCheck) August 9, 2020", "Several other media outlets concluded the same in their fact-check reports.", "There are several similarities in both viral letters – the Prime Minister thanking Yogi Adityanath, appreciating his hard work toward building a Hindu nation and wishing them success in the upcoming election.", "This slideshow requires JavaScript.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]