["The 1:06 video was published here on Facebook on March 31, 2019, and shared more than 4,700 times.", "The footage shows De Lima, a former justice secretary and prominent critic of President Rodrigo Duterte, singing a karaoke rendition of George Michael’s ‘Careless Whisper’.", "The Tagalog-language caption says: “Throwback: Colango Concert inside the Bilibid prison DOJ Secretary De Lima is special guest”.", "The caption is referring to the New Bilibid Prison south of Manila and a reported event there organised by inmate Herbert Colanggo.", "Below is a screenshot of the post:", "The video was also posted here on April 9 and shared more than 2,200 times.", "De Lima was arrested on February 24, 2017 on charges of drug trafficking following allegations she profited from selling narcotics at the prison during her time as justice secretary. She says she is innocent and the accusation is politically motivated by her opposition to Duterte. Here is an AFP story about the incident.", "Herbert Colanggo is a gang leader and inmate in Bilibid Prison who made headlines in 2014 after a police raid on the penitentiary uncovered his recording studio. After receiving a 12 to 14 year sentence for a deadly bank heist, he began a career as a musician and recorded an album of love songs while behind bars.", "Colanggo has accused De Lima of accepting kickbacks from alleged drug traffickers inside the prison, according to this local media report.", "A reverse search of a screengrab from the video led to this May 21, 2016 post on Facebook.", "AFP contacted Evelyn Tanael Tagoo, who posted the original video on Facebook, and asked her where the performance was filmed.", "“That is not inside Bilibid,” she said. “That is in St. Charbel in Quezon City. That’s her victory party as she won as senator around that time. She held a victory party for those who distributed flyers for her,” Tagoo told AFP in a Facebook message on July 26, 2019.", "AFP checked Tagoo’s other posts from May 21, 2016 and found other pictures of the event here and here:", "The photos show the same room featured in the video, including a banner with the words “WE LOVE YOU TOO!!!” FROM: HUSTISYA VOLUNTEERS” and an air-conditioner as shown below:", "Hustisya is the Filipino word for “justice”.", "De Lima called for “Hustisya” volunteers to assist her 2016 senatorial campaign in this tweet.", "Her spokesman also told AFP on August 14 that the video shows De Lima’s victory party for her volunteer team.", "“The alleged video where De Lima was singing was actually taken during a victory dinner party a few days after the May 2016 elections. The victory party was held at the clubhouse/basketball inside the St. Charbel Executive Village,” Ferdie Maglalang said in a statement emailed to AFP on August 14.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]