["By Saranac Hale Spencer", "Posted on October 26, 2017", "Q: Were two Democratic congressmen arrested for having ties to the Islamic State?", "A: No. The two congressmen named in a fake news story don’t exist.", "A completely fabricated story claiming that two Democratic congressmen were arrested for having ties to the Islamic State terrorist group has been posted by more than a dozen websites.", "Facebook users recently flagged the story as potentially false after it was posted Oct. 21 on thetrumppers.com with the headline: “BREAKING: 2 Democrat Congressmen On ISIS Payroll Arrested For Treason.” However, the story was originally published by a website called America’s Last Line of Defense on Sept. 3.", "That site has a disclaimer that says: “We present fiction as fact and our sources don’t actually exist.” Also, its web address was recently changed from thelastlineofdefense.org to nunadisbereel.com, which reads as: None of this be real.", "In fact, the two congressmen named in the story don’t even exist.", "“Rep Harold Somersworth of Maryland’s 43rd district and Rep Omar Sali of New Jersey’s 112th, will face a trial if they are deemed to be within their rights as citizens to habeas corpus,” the story says.", "But, no one with the name Somersworth or Sali currently serves in the House of Representatives, according to the House directory. Also, Maryland has only eight congressional districts, and New Jersey has only 12 districts.", "And the pictures that were published with the story are of two unrelated public officials. One picture shows the former mayor of Hoboken, New Jersey, Peter Cammarano, being taken into the FBI’s Newark headquarters following a major corruption bust in 2009. The other shows the 2016 arrest of Arkansas state Rep. John Walker for allegedly obstructing governmental operations after he filmed a traffic stop by police in Little Rock. The charge was later dropped.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“BREAKING: 2 Democrat Congressmen On ISIS Payroll Arrested For Treason.” Thetrumppers.com. 21 Oct 2017.", "America’s Last Line of Defense. Disclaimer. Nunadisbereel.com. Accessed 25 Oct 2017.", "U.S. House of Representatives. Directory. Accessed 25 Oct 2017.", "Lysiak, Matthew and Lisberg, Adam. “Shocking bribe probe hauls in dozens in New Jersey.” New York Daily News. 23 Jul 2009.", "Brantley, Max. “Police release Walker arrest video; shows cops accusing him of being ‘race baiter.’” Arkansas Times. 28 Sep 2016.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]