["U.S. Route 19 in West Virginia (Wikimedia commons)", "Facing a competitive reelection bid in 2020, West Virginia Gov. Jim Justice sought to tout his record on improving the state’s highways.", "\"Our WV highways rank 16th in the country in a national survey of highway systems, up 20 spots from last year’s ranking!\" Justice tweeted Aug. 22. \"This ranking affirms all the hard work we’ve done, and that we continue to do, fixing our state’s roads.\"", "Our WV highways rank 16th in the country in a national survey of highway systems, up 20 spots from last year’s ranking! This ranking affirms all the hard work we’ve done, and that we continue to do, fixing our state’s roads. #WV #WVGov https://t.co/GY699UI0M6", "Let’s take a closer look at the source of his assertion. (Justice’s office did not respond to inquiries for this article.)", "Justice’s tweet linked to a news release from the governor’s office that cited the source of the rankings as the Reason Foundation’s 24th annual highway report. The Reason Foundation has a libertarian perspective, including individual liberty and free markets, the foundation’s website says.", "The annual highway study uses spending and performance data that state agencies send to the federal government. To do this, it ranks the 50 states in 13 categories, such as highway expenditures per mile, pavement conditions, congestion, bridge conditions and fatality rates.", "Looking at the overall state figures, West Virginia does rank 16th in the country, a rise of 20 notches from 36th in the previous year’s survey.", "Compared to its neighbors, the report finds West Virginia slightly ahead of Ohio (18th) and Maryland (39th) in overall ranking but behind Virginia (2nd). West Virginia is doing worse than some regionally comparable states like Kentucky (5th) but better than others such as Indiana (33rd).", "The top overall state was North Dakota, and the worst was New Jersey. Read the full list here.", "It should be noted that West Virginia’s 16th-place overall ranking obscures some aspects of the report that paint a less rosy picture of the state’s highways.", "For starters, the bulk of the highway data in the most recent report covers 2016,which is before Justice took office. Only two categories out of 13 use 2017 data, when he had begun his first term.", "So while this report represents a positive development for West Virginia, it doesn’t fully reflect Justice’s own policies, as he implied when he referred to \"all the hard work we’ve done.\"", "In addition, a technical change in the report’s methodology played a role in West Virginia’s increase. According to the report’s summary of the state’s rankings, West Virginia \"benefited from the report no longer measuring narrow rural arterial lanes,\" a category where the state ranked 50th last year.", "Finally, looking only at the overall ranking, as Justice does, obscures some relatively weak ratings for West Virginia on key sub-categories.", "Notably, the state ranks 36th in its overall fatality rate, 48th in structurally deficient bridges, 20th in urban Interstate pavement condition and 21st in rural Interstate pavement condition.", "The state scored better on cost measures, ranking second in total spending per mile and third in capital and bridge costs per mile.", "\"To improve in the rankings, West Virginia needs to reduce its percentage of structurally deficient bridges and its rural arterial pavement condition,\" Feigenbaum told PolitiFact West Virginia. \"The state is in the bottom five for structurally deficient bridges and the bottom 15 for rural arterial pavement condition in the country.\"", "Justice tweeted, \"Our WV highways rank 16th in the country in a national survey of highway systems, up 20 spots from last year’s ranking! This ranking affirms all the hard work we’ve done, and that we continue to do, fixing our state’s roads.\"", "Justice has a point about the overall number, but his celebratory tone is somewhat exaggerated. Most of the data reflects a period before he became governor, and a major reason for the increase came from the elimination of a category from the previous year’s report in which West Virginia ranked 50th nationally.", "The statement is partially accurate but leaves out important details, so we rate it Half True.", "Jim Justice, tweet, Aug. 22, 2019", "Office of the Governor, \"West Virginia Highways rank 16th in country in national survey of highway systems; up 20 spots from last year’s ranking,\" Aug. 22, 2019", "Reason Foundation, \"24th Annual Highway Report — Executive Summary,\" Aug. 22, 2019", "Reason Foundation, \"Ranking the Best, Worst, Safest, and Most Expensive State Highway Systems — The 23rd Annual Highway Report,\" Feb. 8, 2018", "Email interview with Baruch Feigenbaum, assistant director for transportation policy with the Reason Foundation, Sept. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]