["About this rating", "The American corporation has long been a target, especially in online debate, of criticism and condemnation — sometimes well-founded and justified, but at other times irrelevant and wrong-headed.", "According to a theory advanced by Academy Award-nominated director Adam McKay, there is a direct link between the modern corporation and 1930's style fascism — one that Merriam-Webster even went so far as to censor from its definition of fascism following a corporate takeover in the 1980s.", "In April 2018, McKay's words were turned into a widely-shared online meme published by the Facebook page \"Americans Against Fascism\":", "Benito Mussolini created the word \"fascism.\" He defined it as \"the merging of the state and the corporation.\" He also said a more accurate word would be \"corporatism.\" This was the definition in Webster's up until 1987 when a corporation bought Webster's and changed it to exclude any mention of corporations.\"  — Adam McKay.", "The quote is taken word for word from a 2010 op-ed written by McKay for the Huffington Post, in which he offered a scathing criticism of large corporations and the recent Citizens United decision in the U.S. Supreme Court. (He accused four of the court's justices of treason.)", "McKay's account is riddled with errors. For one thing, the definition of fascism commonly attributed to Mussolini is \"the merging of the state and corporate power,\" not \"the corporation,\" as McKay presents it. Second, it's not clear that Mussolini — or even his ghostwriter, the philosopher Giovanni Gentile — ever actually gave this precise definition of fascism.", "Most importantly, though, the meme's central point revolves around a common misunderstanding of what \"corporatism\" was in Mussolini's fascism and a conflation with the modern capitalist \"corporation,\" most likely borne out of the similarity between the words.", "Corporatism (\"corporativismo\" in Italian) was one of the cornerstone principles in Mussolini's fascism, and had to do with the way society and the economy would be organized, with state power at the head of a system of guilds or corporations (\"corporazione\") representing each major industry.", "In his Dictionary of Political Thought, Roger Scruton describes corporatism in this way:", "The economy was divided into associations (called ‘syndicates’) of workers, employers and the professions; only one syndicate was allowed in each branch of industry, and all officials were either fascist politicians or else loyal to the fascist cause. According to law the syndicates were autonomous, but in fact they were run by the state. The ‘corporations’ united the syndicates in a given industry, but made no pretence at autonomy from the state.", "This ultimate power and pervasive influence of the state (led by one man, of course) was famously summed up by Mussolini in a speech in 1927, in which he declared: \"everything in the state, nothing against the State, nothing outside the state.\"", "In the Doctrine of Fascism, in 1932, Mussolini (with the help of Gentile) wrote:", "Fascism desires the State to be strong and organic, based on broad foundations of popular support. The Fascist State lays claim to rule in the economic field no less than in others; it makes its action felt throughout the length and breadth of the country by means of its corporative, social, and educational institutions, and all the political, economic, and spiritual forces of the nation, organized in their res­pective associations, circulate within the State.", "In other words, corporatism in Mussolini's fascism was not a free-market capitalist system. Far from it. It did not allow for the kind of competition, innovation, market entry, and research and development characteristic of modern capitalism, and it was closely ruled in every way by the state with Mussolini at its head.", "Anything that draws a direct link between what are now referred to as corporations (large, powerful private companies operating in a modern free-market capitalist system) and Mussolini's corporatism, is founded on a misunderstanding — most likely caused by the similarity between the words.", "As for the claim that Webster's dictionary censored its definition of fascism when it was taken over by a public relations-sensitive corporation in 1987: Merriam-Webster has in fact been owned by Encyclopedia Brittanica Incorporated since 1964, and has operated as Merriam-Webster Incorporated since 1982; that claim is inaccurate.", "Bier, Daniel.  \"Fake Quote Files: Benito Mussolini on Fascism and Corporatism.\" \r\n The Skeptical Libertarian.  7 February 2013.", "Berlet, Chip.  \"Mussolini on the Corporate State.\"\r\n  Political Research Associates.  January 2005.", "Scruton, Roger.  \"The Palgrave Macmillan Dictionary of Political Thought.\"\r\n  Palgrave Macmillan.  3rd Edition 2007.", "Mussolini, Benito; Gentile, Giovanni.  \"The Doctrine of Fascism.\"\r\n  Fascism: Doctrine and Institutions/World Future Fund.  1935.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]