["About this rating", "In March 2021, an online advertisement appeared to claim there was something special about the McDonald's golden arches logo. A page in the resulting story said that, in the 1960s, a psychologist named Louis Cheskin advised that McDonald's customers \"associated the arches with a 'pair of nourishing breasts.'\"", "The advertisement in question.", "\"It's not just an 'M,'\" read the picture that showed the McDonald's Golden Arches. \"28 Hidden Images in Famous Business Logos (That You Never Noticed).\"", "McDonald's Ahh, the famous Golden Arches! You probably realized that the \"M\" design stands for \"McDonald's.\" However, you probably didn't know that the successful food chain's marketing team consulted a psychologist, Louis Cheskin, while creating their famed logo. Cheskin suggested that customers would unconsciously associate the arches with a \"pair of nourishing breasts.\" Talk about subliminal symbolism.", "While it's misleading to say that Cheskin advised McDonald's when the logo was being created, we found that the main part of the claim was true. At a time when the company was considering ditching the golden arches, Cheskin advised McDonald's to keep them because they were, as Cheskin put it, \"mother McDonald's breasts.\"", "The July 1995 issue of Reader's Digest appeared to be one of the sources of the information. While the issue wasn't available online for further reading, we found a story that cited the magazine in a Tennessee daily newspaper, The Jackson Sun. On July 24, 1995, the newspaper reported:", "Louis Cheskin, a specialist in the psychology of marketing who began his research in the 1930s [...] worked with McDonald's when it was about to abandon the arches as the architectural elements of its outlets. His research showed that the arches were great assets because they had \"Freudian implications in the subconscious mind.\" Exactly what was meant by this was uncertain, but Davis Masten, who runs the company that Cheskin started, recalls that Cheskin also referred to the arches as \"Mother McDonald's breasts\" - a powerful association if you're replacing home cooking. Robert and Margaret Sneed, of Texas, were getting in their car at the McDonald's on Highland after lunch Saturday. They were en route to South Carolina through the Smokies. Asked if that was the association they had with the yellow arches of McDonald's, the retired couple laughed. \"I believe that my only thought was a cup of coffee, fries, and a Big Mac,\" Robert Sneed said. \"But I guess this is some kind of subliminal thing where we're presumably thinking this but not supposed to know we're thinking this, is that it?\" \"I think of an arch as being an entryway,\" Margaret offered. \"I think of it more as being an entry to a restaurant, but then, I never was very imaginative.\"", "The newspaper also printed that \"market research showed many people subconsciously connected\" McDonald's golden arches \"to mother and home cooking.\"", "In the 1997 book \"The Total Package\" by Thomas Hine, he published the same information, including the mention of \"mother McDonald's breasts\":", "Cheskin worked with McDonald's at the time it was about to abandon arches as architectural elements of its outlets.", "He advised that the memory of the arches be kept in the form of the M in \"McDonald's.\" His case was based, he said, on research that showed that \"the arches had Freudian applications to the subconscious mind of the consumer and were great assets in marketing McDonald's food.\"", "In other words, Cheskin said, the arches are \"mother McDonald's breasts, a useful association if you're replacing homemade food.\"", "We thank the reader who sent us information on this book. It helped to add to the data that showed the overall claim in this fact check is true.", "Another bit of credible reporting came from the BBC. In 2003, it printed a special article titled \"Fast Food Factory.\" The story invited readers to \"explore the past, present, and future of McDonald’s and with it the fast-food industry.\" The piece mentioned the famed golden arches and its purported association to a pair of breasts:", "Attracting the Customers The logo for McDonald's is the golden arches of the letter M on a red background. The M stands for McDonald's, but the rounded m represents mummy’s mammaries, according to the design consultant and psychologist Louis Cheskin. In the 1960s McDonald's was prepared to abandon this logo, but Cheskin successfully urged the company to maintain this branding with its Freudian symbolism of a pair of nourishing breasts. This may seem funny, but it is no laughing matter to the industrial psychologists and marketing consultants who are paid millions to find new ways to seduce us into buying by manipulating our unconscious desires.", "We reached out to McDonald's and provided questions for our story, and the company responded by asking for our deadline. We heard back a second time when the company let us know that they may need more time. We reached out two additional times but did not receive any further responses.", "In sum, it's true that, in the 1960s, Cheskin advised McDonald's to keep the golden arches at a time when the company was considering getting rid of them.", "On Oct. 25, 2021, the rating for this story was changed from \"Research In Progress\" to \"Unproven\" for the reasons mentioned at the end of the fact check.", "On Nov. 12, 2021, the rating for this story was changed from \"Unproven\" to \"True\" after we received information from a reader about a book that contained data on Cheskin's past.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]