["By Angelo Fichera", "Posted on September 24, 2019", "Viral posts falsely claim Democratic presidential candidate Beto O’Rourke can’t own a gun due to a felony. O’Rourke has not been convicted of a felony.", "Social media users have spread viral posts that falsely call Beto O’Rourke a “felon” and claim that the Democratic presidential candidate cannot own a firearm. (In fact, the former congressman from El Paso, Texas, has said that he inherited guns from a great uncle.)", "The posts use the deception to suggest that O’Rourke is ill-positioned to advocate for gun control. According to his campaign website, O’Rourke supports universal background checks and wants to “ban the manufacturing, sale, and possession of military-style assault weapons and high-capacity magazines.” He also has proposed a “mandatory buyback program for assault weapons and a voluntary buyback program for handguns.”", "Federal law generally prohibits someone “who has been convicted in any court of, a crime punishable by imprisonment for a term exceeding one year” — under U.S. law, a felony — from possessing a gun.", "But O’Rourke hasn’t been convicted of such a crime.", "El Paso County court records available online show two criminal cases — both misdemeanors — involving O’Rourke. The records align with the arrests that O’Rourke has publicly addressed before: a 1995 trespassing incident and a 1998 charge of driving while intoxicated, or DWI.", "The first incident occurred at the University of Texas at El Paso on May 19, 1995. A police report describes the matter as “attempted forcible entry” and “attempted burglary,” and says O’Rourke and two friends entered a facilities plant and triggered an intrusion alarm. O’Rourke has said he was arrested “after jumping a fence” at the site. An El Paso County court record shows that no charges relating to O’Rourke’s arrest on that date were ever prosecuted.", "Records obtained and published by the Texas Tribune and Houston Chronicle also show O’Rourke was arrested on Sept. 27, 1998, in Anthony, Texas, after he lost control of his car, struck a truck traveling in the same direction, and then crossed the median into a lane for incoming traffic.", "O’Rourke failed a subsequent breathalyzer test, according to the incident report, and was charged with DWI — which records list as a misdemeanor, not a felony. The police report also says O’Rourke tried to flee the scene. O’Rourke has denied that detail, but the officers involved have said they stand by their report.", "The El Paso County case record shows that the DWI charge was dismissed following O’Rourke’s completion of a “DWI School” as part of a “misdemeanor diversion” program.", "O’Rourke has spoken about the DWI offense before. In a 2018 Houston Chronicle op-ed, he called the incident a “serious mistake for which there is no excuse.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Categories of Prohibited People.” Giffords Law Center to Prevent Gun Violence. Accessed 20 Sep 2019.", "Diaz, Kevin. “Police reports detail Beto O’Rourke’s 1998 DWI arrest.” Houston Chronicle. 30 Aug 2018.", "Hagan, Joe. “Beto O’Rourke: ‘I’m Just Born to Be In It.’” Vanity Fair. 13 Mar 2019.", "O’Rourke, Beto. “O’Rourke: Texas should lead the way on true criminal justice reform.” Houston Chronicle. 27 Aug 2018.", "The State of Texas vs Robert Francis O’Rourke. Case No. 980C18629. El Paso County Case Records. Accessed 20 Sep 2019.", "The State of Texas vs Robert Francis O’Rourke. Case No. 950C08243. El Paso County Case Records. Accessed 20 Sep 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]