["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Bob Goodlatte says President Barack Obama exceeded his authority last month when he bypassed Congress and unilaterally extended legal status to millions of immigrants.", "The evidence lies in the words of the president himself, Goodlatte said.", "\"It’s both perplexing and alarming that the president has decided to move forward with executive actions on immigration that he has said on numerous occasions that he didn’t have the constitutional power to take,\" Goodlatte, R-6th, said in a news release.", "Obama announced on Nov. 20 that he will delay deportation of immigrants who have lived illegally in the U.S. for more than five years but have children who are citizens or have greencards. If applicants pass background checks and pay a fee, they can qualify for a work permit and avoid deportation for three years at a time. More than 4 million people could qualify for the program, which will be open for applications this spring.", "Obama also expanded a program he began by executive action in June 2012 to halt the deportation of students -- known as \"dreamers\" who were brought to the U.S. as children when their parents entered the country illegally.", "Obama’s action came after the House of Representatives failed to approve a comprehensive immigration reform bill that had cleared the Senate.", "We asked Goodlatte’s office to back his claim that Obama had repeatedly said he lacked the power to order sweeping immigration reform. Beth Breeding, Goodlatte’s spokeswoman, pointed us to a Nov. 19 news release by House Speaker John Boehner, R-Ohio, citing 22 instances of Obama saying he couldn’t act unilaterally on immigration.", "Some of the items on the list don’t affect immigration at all, but are general statements that Obama made as a candidate about cutting down on executive orders. But there are some comments on the speaker’s list get to the heart of Goodlatte’s statement. Let’s take a look:", "March 28, 2011", "During a town hall meeting at the Bell Multicultural High School in Washington, Obama  was asked if he could issue an executive order to stop deportation of undocumented high school students. The president dismissed the idea.", "Obama said, \"With respect to the notion that I can just suspend deportations through executive orders, that’s just not the case, because there are laws on the books that Congress has passed -- and I know that everybody here at Bell is studying hard so you know that we’ve got three branches of government. Congress passes the law. The executive branch’s job is to enforce and implement those laws. And then the judiciary has to interpret the laws.", "\"There are enough laws on the books that are very clear in terms of how we enforce our immigration system that for me to, simply through executive order, ignore these constitutional mandates would not conform with my appropriate role as president. That does not mean, though, that we can’t make decisions, for example, to emphasize enforcement on those who’ve engaged in criminal activity.\"", "Jan. 30. 2013", "During an interview with Univision, a Spanish-language television network, Obama was asked if he would consider a moratorium on deportations of non-criminal immigrants.", "The president said, \"Well, I think it is important to remind everybody that, as I said I think previously, I’m not a king. I am the head of the executive branch of government. I’m required to follow the law. And that’s what we’ve done. But what I’ve also said is, let’s make sure that we’re applying the law in a way that takes into account people’s humanity. That’s the reason that we’ve moved forward on deferred action. Within the confines of the law we said, we have some discretion in terms of how we apply this law. The same is true with respect to the kinds of the length of time that people have to spend outside of the country when their spouses are already here, for example.\"", "Feb. 14, 2013", "Obama was asked  During a Google+ Hangout, by a woman named Jackie, if he would be willing to take executive action on immigration to ensure \"families are not split apart.\"", "Obama said, \"Well look Jackie, this is something I’ve struggled with throughout my presidency. The problem is that I’m the president of the United States. I’m not the emperor of the United States. My job is to execute laws that are passed and Congress, right now, has not changed what I consider to be a broken immigration system and what that means is we have certain obligations to enforce the laws that are in place, even if we think in many cases the results may be tragic.", "\"And what we have been able to do is to make sure that we are focusing our enforcement resources on criminals as opposed to someone who is just here and trying to work and look  after their families. What we have tried to do is administratively reduce the burdens and hardships on families being separated, and what we’ve done is obviously passed a deferred action which made sure the dreamers -- young people who were brought here and think of themselves as American -- are American except for their papers, that they are not deported. Having said all that, we’ve kind of stretched our administrative flexibility as much as we can. That’s why making sure we get comprehensive immigration reform done is so important.\"", "Sept. 17, 2013", "Obama was interviewed by Jose Diaz-Balart, anchor for Noticias Telemundo. The broadcaster asked the president if he would \"consider unilaterally freezing deportations for the parents of deferred action kids.\"", "Obama said, \"Here’s the problem that I have, Jose, and I’ve said this consistently. My job in the executive branch is supposed to be to carry out the laws that are passed. Congress has said here’s the law when it comes to those who are undocumented, and they allocate a whole bunch of money for enforcement, and what I have been able to do is make to a legal argument, that I think is absolutely right, that given the resources that we have, we can’t do everything that Congress has asked us to do.", "\"What we can do is then carve out the DREAM Act folks, saying young people who have basically grown up here are Americans,that we should welcome. We not going to have them grow up under a cloud, under a shadow. But if we start broadening that, then essentially I would be ignoring the law in a way that I feel would be very difficult to defend legally.\"", "Obama’s order does not specifically protect parents of dreamers from deportation. But many of them, if they can pass background checks and pay a fee, will still be able to delay their deportation under general provisions of the executive action.", "Still, in this interview, Obama casts doubt that his executive powers to shield people from deportation extends beyond the dreamers.", "In a Nov. 18 press conference, White House spokesman Josh Earnest was asked about the president’s 2013 comments that broadening protections beyond the dreamers \"would be very difficult to defend legally.\"", "\"Since this interview aired, the president did direct the attorney general and the secretary of Homeland Security to conduct a review of the law to determine what, if any, authority he could use to try to fix some of the problems that House Republicans have refused to address,\" Earnest said.", "In announcing his executive actions, Obama said he was well within his legal authority to take them. Twenty-five states -- but not Virginia -- have joined a suit challenging the president’s power to issue the immigration order.", "Our ruling", "Goodlatte said, \"The President has decided to move forward with executive actions on immigration that he has said on numerous occasions that he didn’t have the constitutional power to take.\"", "The record supports Goodlatte. We rate his statement True.", "Rep. Bob Goodlatte, \"Unilateral, unconstitutional immigration actions must be stopped,\" Nov. 21, 2014.", "Email from Beth Breeding, spokeswoman from Bob Goodlatte, Dec. 9, 2014.", "House Speaker John Boehner, \"22 times President Obama said he couldn’t ignore or create his own immigration law,\" Nov. 19, 2014.", "PolitiFact, \"Barack Obama: Position on immigration actions through executive orders ‘hasn’t changed,’\" Nov. 20, 2014.", "Washington Post Fact Checker, \"Obama’s royal flip flop on using executive action on illegal immigration,\" Nov. 18, 2014.", "FactCheck.org, \"Obama’s immigration amnesia,\" Nov. 18, 2014.", "Politico, \"Obama’s immigration flip flop,\" July 25, 2014.", "ABC News, \"Flip Flop? White House concedes shift in immigration action,\" Nov. 18, 2014.", "ABC News, \"President Barack Obama’s interview with Univision,\" Jan. 31, 2013.", "The White House, \"Remarks by Barack Obama at G20 press conference,\" Nov. 16, 2014.", "YouTube, \"Obama’s 2013 Google+ fireside hangout,\" Feb. 14, 2013.", "The White House, \"Remarks by the president at Univision town hall,\" March 28, 2011.", "The White House, \"Press briefing by the press secretary,\" Nov. 18, 2014.", "ABC News, \"Transcript: President Barack Obama’s interview with Univision,\" Jan. 31, 2013.", "PolitiFact Virginia, \"Kaine says all presidents since Eisenhower have taken executive action on immigration,\" Nov. 30, 2014.", "The White House, \"Watch: President Obama answers your questions in a Google+ Hangout,\" Feb. 14, 2013.", "YouTube, \"President Obama on immigration reform in a Google+ Hangout -- Part 1,\" Feb. 21, 2014.", "YouTube, \"Obama won’t halt deportations for parents of kids brought to U.S. illegally,\" Sept. 17, 2013.", "PolitiFact, \"12 key fact-checks on immigration and executive action,\" Nov. 20, 2014.", "The New York Times, \"For Obama, executive order on immigration would be a turnabout,\" Nov. 17, 2014.", "U.S. Citizenship and Immigration Services, \"Executive actions on immigration,\" accessed Dec. 19, 2014.", "Politico, \"Why Obama limited immigration scope of action,\" Nov. 20, 2014.", "Huffington Post, \"Legal experts say there’s ‘no support’ for excluding Dreamers’ parents,\" Nov. 25, 2014.", "CNN, \"Obama: You can come out of the shadows,\" Nov. 21, 2014.", "U.S. Department of Justice, \"The Department of Homeland Security’s authority to prioritize removal of certain aliens unlawfully present in the United States,\" Nov. 19, 2014.", "The New York Times, \"Obama defends his use of executive authority on immigration,\" Nov. 23, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]