["By Saranac Hale Spencer", "Posted on February 26, 2019", "A photo showing a large group of people apprehended at the southern border is circulating online with the false information that it was taken this month. It is from 2010.", "A photo of handcuffed people trudging through the Arizona desert shows immigrants who were apprehended while trying to enter the U.S. illegally. The photo was taken nearly nine years ago.", "Recently, though, the photo has been circulating on Facebook — racking up almost 50,000 shares — with the claim that it shows: “100+ illegals caught, 8Feb2019, Arivaca, AZ…”", "That’s not true. The 105 people shown in the picture were apprehended on April 28, 2010, according to a press release from U.S. Customs and Border Protection that included the photo.", "Using a mobile surveillance system, border patrol agents spotted the immigrants traveling in three groups, and then rounded them up with the help of a helicopter crew from the Office of Air Marine, according to the release.", "The photo began recirculating this year around the time when President Donald Trump and Congress were negotiating funding for the president’s proposed border wall. Trump ultimately rejected the nearly $1.4 billion in wall funding as inadequate and declared a national emergency at the southern border, a move that would allow him to reallocate more federal funds for the wall without congressional approval.", "In declaring a national emergency, the president described the situation at the southwest border as an “invasion of our country.”", "The actual number of apprehensions at the border has increased in recent years, but it remains historically low compared to the peak in 2000.", "So far, there has been an average of 50,374 apprehensions each month for the first four months of fiscal year 2019, which started Oct. 1, 2018. That’s higher than the monthly average in fiscal year 2017 (25,326 per month) and fiscal year 2018 (33,048 per month).", "Still, the number of apprehensions is down significantly from what it was at the turn of the century.", "In fiscal year 2000, there were 1.64 million apprehensions, an average of 136,973 per month. So, there has been a 63 percent drop in the average number of monthly apprehensions since 2000.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Coordination Along the Border Yields Large Apprehension.” Press release. U.S. Customs and Border Protection. 28 Apr 2010.", "U.S. Government Accountability Office. “Progress and Challenges with the Use of Technology, Tactical Infrastructure, and Personnel to Secure the Southwest Border.” 15 Mar 2018.", "Trump, Donald. “Presidential Proclamation on Declaring a National Emergency Concerning the Southern Border of the United States.” 15 Feb 2019.", "U.S. Customs and Border Patrol. Southwest Border Migration FY 2019. CBP.gov. Accessed 22 Feb 2019.", "U.S. Customs and Border Patrol. Southwest Border Migration FY 2017. CBP.gov. Accessed 25 Feb 2019.", "U.S. Customs and Border Patrol. Southwest Border Migration FY 2018. CBP.gov. Accessed 25 Feb 2019.", "U.S. Customs and Border Patrol. Total Illegal Alien Apprehensions By Month. CBP.gov. Accessed 22 Feb 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]