["President Donald Trump pumps his fist as he tours a section of the U.S.-Mexico border wall, Tuesday, Jan. 12, 2021, in Alamo, Texas. (AP)", "We found there is no simple metric to determine if Biden inherited the “most secure” border. Some cite miles of barriers, while others use various apprehension figures.", "Trump ignores that the surge started in the spring of 2020 when he was still in office.", "Besides U.S. policy, factors that drive migrants to leave their home countries have included economic havoc caused by hurricanes and the pandemic, and yearslong problems associated with violence.", "Former President Donald Trump said that the Biden administration has created a \"national disaster\" at the border by ditching Trump’s immigration policies.", "\"We proudly handed the Biden administration the most secure border in history,\" Trump said in a March 21 statement. \"All they had to do was keep this smooth-running system on autopilot. Instead, in the span of just (a) few weeks, the Biden administration has turned a national triumph into a national disaster.\"", "Trump was responding to comments on the Sunday news shows by Homeland Security Secretary Alejandro Mayorkas who pointed the finger back at the Trump administration for the border woes.", "\"The entire system under United States law that has been in place throughout administrations of both parties was dismantled in its entirety by the Trump administration,\" Mayorkas said on ABC This Week.", "We found that the situation at the border is more complicated than either Trump or the Biden administration is indicating. Trump’s claim that the border was the \"most secure\" and \"on autopilot\" is a significant exaggeration.", "We found there is no simple metric to determine if Biden inherited the \"most secure\" border. Some cite miles of barriers, while others use various apprehension figures.", "\"A secure border is really about definitions, and each side has their own definition of secure,\" said Laura Collins, director of the George W. Bush Institute-SMU Economic Growth Initiative.", "Trump’s office didn’t respond to our emails asking what metric he was citing on border security. When Trump said near the end of the campaign that \"we achieved the most secure border in American history\" he cited the number of miles of border barriers that were built. But most of the miles were to replace existing structures, including in low-traffic areas.", "Another metric that Trump highlighted in May was apprehension numbers on the southwest border. Immigration experts have told us that high apprehension numbers could be an indication of effective border enforcement, others say low apprehension numbers are a sign that U.S. policies are working to deter illegal immigration in the first place.", "Some experts point to the border apprehension rate, which is the proportion of attempted border crossers apprehended. The Department of Homeland Security’s August border security metrics report showed that the apprehension rate in fiscal year 2016 — Obama’s last full year — was the highest of any year between 2000 and 2018.", "So by that metric, the border was most secure in 2016, said Jessica Bolter, an analyst at the Migration Policy Institute. But the federal government hasn’t yet released more recent data, so we can’t use the apprehension rate to evaluate Trump’s claim that he handed off the most secure border to Biden.", "Finally, due to the barriers and other deterrents at the border, unauthorized migrants largely enter at ports of entry and overstay a visa or turn themselves in and request asylum. That’s why miles of the border fence don’t tell us much about the status of border security.", "While Trump presents the border surge as a \"disaster\" under Biden, the spike in migrants, especially unaccompanied minors, started in the spring of 2020 during the Trump administration and generally continued to climb each month. The numbers of migrants apprehended at the border rose between January and February, but it’s still less than the surge in May 2019. And in February, most of the encounters that Customs and Border Protection recorded at the border resulted in quick expulsions under the same public health-related authority that was invoked under the Trump administration.", "Besides U.S. policy, factors that drive migrants to leave their home countries have included economic havoc caused by hurricanes and the pandemic, and yearslong problems associated with violence. The numbers of migrants arriving at the border also tend to spike in the spring and summer months.", "When Biden took office, there was a pent-up demand to cross the border due to asylum seekers who were waiting in Mexican border towns because of Trump’s \"Remain in Mexico\" program and pandemic-related border closures.", "The Biden administration has repeatedly said that the border is closed. But it has made some policy changes, such as choosing not to expel unaccompanied children who cross illegally, even though it has the legal authority to do so.", "Trump said Biden could have operated on autopilot, but experts said each administration must examine legal rulings and current conditions.", "\"There is no such thing as 'autopilot' in immigration,\" said Susan Martin, an immigration expert at Georgetown University. \"I don't see how Biden could have maintained Trump's policies, given the outcome of the election and the shifting situation on the border.\"", "The Trump administration’s asylum policies on the border were also challenged in court.", "\"Operating on autopilot might have been a problematic policy because it involved denying people their ability to lodge an asylum case,\" said Josiah Heyman, director of the Center for Inter-American and Border Studies at the University of Texas at El Paso", "Because Congress has failed to reach agreement on major immigration policies, that leaves it up to each new presidential administration to issue orders, set priorities and use words to convey a tone about immigration.", "\"The border surge is just the latest symptom of a broken immigration system,\" Collins said. \"Congress needs to do the hard work of modernizing our immigration system and adopting an ‘all of the above’ border policy that anticipates future crises and has the flexibility to adapt to changing circumstances.\"", "Trump said \"we proudly handed the Biden administration the most secure border in history. All they had to do was keep this smooth-running system on autopilot.\"", "While Trump promoted building a wall, some metrics suggest Trump didn’t attain the most secure border in history. And Trump ignores that the surge started in the spring of 2020 when he was still in office.", "He also grossly oversimplified how the immigration system works. It’s not as straightforward as keeping it on \"autopilot.\"", "Biden’s actions and tone on immigration play a role in migration, but so do other factors such as ongoing economic and social havoc in Central America.", "We rate this statement Mostly False.", "RELATED: Did the increase of children arriving at the border start under Trump or Biden?", "RELATED: Fox News’ Jeanine Pirro wrongly claims US border is ‘open to anyone from anywhere’", "Sean Spicer, Tweet of former President Donald Trump’s statement to the media, March 21, 2021", "Rev.com, Donald Trump Rally Speech Transcript Dubuque, Iowa Nov. 1, 2020", "U.S. Department of Homeland Security, Border Security Metrics Report, August 2020", "Donald Kerwin at the Center for Migration Studies, Real Needs, Not Fictitious Crises Account for the Situation at US-Mexico Border, March 17, 2021", "Washington Post, Trump plans to cut U.S. aid to 3 Central American countries in fight over U.S.-bound migrants, March 30, 2019", "Washington Post, ‘No end in sight’: Inside the Biden administration’s failure to contain the border surge, March 20, 2021", "Washington Post op-ed, There’s no migrant ‘surge’ at the U.S. southern border. Here’s the data. March 23, 2021", "New York Times, Fact-Checking Claims on the Migrant Surge at the U.S.-Mexico Border, March 20, 2021", "Politico, ‘The crisis is in Washington’: Overwhelmed border officials urge D.C. to act, March 20, 2021", "Pew Research Center, Migrant apprehensions at U.S.-Mexico border are surging again, March 15, 2021", "El Paso Times, Donald Trump administration touts completion of 450 miles of border wall, Jan. 5, 2021", "PolitiFact, Donald Trump’s immigration promises: failures and achievements, July 27, 2020", "PolitiFact, Border apprehensions then and now: Fact-checking McEnany’s comparison to 2014, March 11, 2021", "PolitiFact, Donald Trump promised to build a border wall and make Mexico pay for it. That didn’t happen, July 15, 2021", "PolitiFact, Fact-checking Donald Trump’s claim of ‘best numbers’ at the border, May 20, 2020", "Telephone interview, Josiah Heyman, Director, Center for Inter-American and Border Studies and anthropology professor at the University of Texas at El Paso, March 22, 2021", "Aaron Reichlin-Melnick, policy counsel at American Immigration Council, Tweet, March 22, 2021", "Email interview, Susan Martin, professor emerita of international migration at Georgetown University, March 22, 2021", "Email interview, Laura Collins, director of the George W. Bush Institute-SMU Economic Growth Initiative, March 22, 2021", "Email interview, Jessica Bolter, associate policy analyst at the Migration Policy Institute, March 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]