["By Robert Farley", "Posted on November 27, 2019", "Q: Did President Barack Obama immediately fire all Bush-appointed ambassadors “the day he was elected office”?", "A: No. As is the custom, Obama immediately replaced most — not all — of Bush’s politically appointed ambassadors. Obama did not remove any of the career appointees to ambassadorships.", "Subject: Ambassadors", "Did President Barack Obama fire all the ambassadors who had been appointed by George W. Bush?", "The issue of ambassadors “fired” by President Barack Obama has arisen recently in the context of President Donald Trump’s abrupt removal of U.S. Ambassador to Ukraine Marie Yovanovitch in May.", "Although the State Department announced at the time that Yovanovitch was ending her three-year assignment in Ukraine “as planned,” her term was not yet completed.", "Yovanovitch emerged as one of the key witnesses in the House impeachment inquiry. In her public testimony on Nov. 15, Yovanovitch said that Rudy Giuliani, the president’s private attorney, spread false statements about her that led to her removal as ambassador.", "“Mr. Giuliani should have known those claims were suspect, coming as they reportedly did from individuals with questionable motives and with reason to believe that their political and financial ambitions would be stymied by our anti-corruption policy in Ukraine,” Yovanovitch testified. “Although, then and now, I have always understood that I served at the pleasure of the President, I still find it difficult to comprehend that foreign and private interests were able to undermine U.S. interests in this way.”", "During her testimony, Trump tweeted criticism of Yovanovitch, claiming that everywhere she has served as an ambassador, including in Somalia, “turned bad.” Trump noted: “It is a U.S. President’s absolute right to appoint ambassadors.”", "In an interview with Sean Hannity the following night, White House Press Secretary Stephanie Grisham said the president, in his tweet, “was telling people why he was unhappy with that ambassador, which is every president’s right.”", "Grisham then added, “I’d also like to remind people that Obama fired every Bush-appointed ambassador the day he was elected office. Every president has the right to have people representing them in foreign countries that he trusts.”", "That same day, Republican Rep. Mark Meadows tweeted: “For Washington Democrats and pundits who are incredulous that @realDonaldTrump recalled an ambassador, certain that it must be evidence of a conspiracy… President Obama fired every Bush appointed ambassador upon his election.”", "The same argument about Obama firing all of Bush’s appointments made its way into a number of Facebook memes. We received numerous questions from our readers asking about the claim as well.", "Trump is right that he has the authority to remove and replace any ambassador he wishes. But his defenders are twisting the facts about Obama to make an argument that Trump’s removal of Yovanovitch was not out of the ordinary. It was.", "There are two types of ambassadors appointed by presidents: career ambassadors and political ambassadors. Career ambassadors are those who make a career in the foreign service and often serve under multiple presidents of different parties. Those career ambassadors usually make up about 70 percent of the ambassadors. Political ambassadors, on the other hand, are typically replaced with political supporters of the incoming president.", "“All ambassadors by tradition present their resignations at the start of any new presidential term (either first or second),” explained retired U.S. Ambassador Dennis Jett, a professor of international affairs at Penn State. “The resignations of the 70 percent (typically) that are career officers are almost always returned and they are allowed to stay and complete whatever is left of what is normally a 3-year tour of duty. Usually, all of those of the 30 percent that are political appointees are accepted.”", "Obama was no different in that respect. Meadows’ tweet linked to a Washington Post story from Dec. 3, 2008, which stated that the “incoming Obama administration has notified all politically-appointed ambassadors that they must vacate their posts as of Jan. 20, the day President-elect Barack Obama takes the oath of office, a State Department official said.”", "The article speculated that while “political ambassadors sometimes are permitted to stay on briefly during a new administration” the “sweeping nature of the directive suggests that Obama has little interest in retaining any of Bush’s ambassadorial appointees.”", "In fact, though, Obama did keep on more than a dozen of Bush’s political appointees, some for a few weeks, some for more than a year. For example, Clifford Sobel stayed on until August 2009. An online bio of Sobel, who is an international council member at the Belfer Center for Science and International Affairs at Harvard Kennedy School, notes that he served as “Ambassador to the Netherlands and Brazil, spanning both the Bush and Obama Administrations.” And Victor Ashe, a Bush political appointee, told PolitiFact he was “flattered” that Obama asked him to continue serving as ambassador to Poland until his successor was confirmed, which ended up being nine months into Obama’s presidency.", "In addition to those two men, some political ambassadors were kept on a few extra weeks, leaving in February. Others were kept longer: one until April, one until May, two until June and two until the following year.", "By contrast, a New York Times story on Jan. 5, 2017, noted the Trump administration was far less flexible, “breaking with decades of precedent by declining to provide even the briefest of grace periods” and requiring all of Obama’s political appointees to be out by Trump’s inauguration. (There was one exception made for S. Fitzgerald Haney, the ambassador in Costa Rica, who was allowed to extend his ambassadorship a few extra months to allow his children to graduate high school. But by February 2017, he was the lone non-career ambassador appointed by Obama still in his position.)", "Political appointees to ambassadorships have the expectation that they will vacate their position by the Inauguration Day of the incoming president, said Ásgeir Sigfússon, executive director of the American Foreign Service Association. Given that tradition, it “sounds a little harsher” to describe those ambassadors as being “fired,” but the effect is the same, Sigfússon, said.", "Regardless of the terminology, though, Obama did not fire any of the career foreign service ambassadors, James Steinberg, the deputy secretary of state under Obama from 2009 to 2011, told us via email. We checked, using data from the State Department’s Office of the Historian, and of the more than 100 career ambassadors appointed by Bush, and inherited by Obama, none was terminated at the start of Obama’s presidency.", "And that’s where this analogy falls apart.", "Yovanovitch is a career diplomat. She has served for 33 years as a foreign service officer during six administrations, four Republican and two Democratic. She was appointed to serve as an ambassador three times: twice by George W. Bush (Kyrgyz Republic and Armenia) and once by Obama (Ukraine). Although her initial term as ambassador to Ukraine was scheduled to expire in March 2019, she was asked by Trump’s under secretary of state for political affairs, David Hale, to extend her tour until 2020. Trump removed her two months after the extension.", "“The attempt to ‘normalize’ Trump’s treatment of Yovanovitch fails,” W. Robert Pearson, a former ambassador to Turkey and currently a non-resident scholar at The Middle East Institute, told us via email, because of “the repeated complaints that she was interfering in Giuliani’s effort to push the bogus Ukraine conspiracy theory.”", "Said Jett: “She was a very distinguished career officer, three-time ambassador, and had just been asked by the department … to extend for a fourth year, which is very rare.”", "So to recap, although Obama immediately terminated most of Bush’s political appointees, he made more than a dozen exceptions (compared with the one exception that Trump made). But Obama did not “fire” any of the career foreign service officials appointed to be ambassadors by Bush. Yovanovitch, the ambassador at the heart of this debate, was a career appointment.", "U.S. Department of State website. Marie L. Yovanovitch, U.S. Ambassador to Ukraine. Accessed 26 Nov 2019.", "Miller, Christopher. “U.S. Ambassador To Ukraine, Openly Criticized By Top Ukrainian Prosecutor, Departing Early.” Radio Free Europe. 6 May 2019.", "U.S. House of Representatives Permanent Select Committee on Intelligence. Press release: Three Chairs Statement on State Department Inspector General Briefing. 2 Oct. 2009.", "Politico. Opening Statement of Marie L. Yovanovitch to the House of Representatives Permanent Select Committee on Intelligence. 15 Nov 2019.", "Fox News. “Video: Grisham: The president is being transparent, releasing transcripts because he did nothing wrong.” 16 Nov. 2019.", "The American Foreign Service Association. Appointments – George W. Bush. Accessed 26 Nov 2019.", "The American Foreign Service Association. Appointments – Barack Obama. Accessed 26 Nov 2019.", "Kessler, Glenn. “Obama Gives Political Ambassadors Their Pink Slips.” Washington Post. 3 Dec 2008.", "Resources – Bureau of Human Resources. “List of U.S. Ambassadors.” U.S. State Department website. Accessed 26 Nov 2019.", "Rennie, Julianna. “No, Obama didn’t fire all of Bush’s politically-appointed ambassadors.” PolitiFact. 21 Nov 2019.", "Davis, Julie Hirschfeld. “In Break with Precedent, Obama Envoys Are Denied Extensions Past Inauguration Day.” New York Times. 5 Jan 2017.", "Alex Daugherty, Alex and Ordoñez, Franco. “Trump to nominate South Florida’s Sharon Day as Costa Rica ambassador.” Miami Herald. 14 Jun 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]