["A video of two women allegedly caught allegedly attempting to steal groceries by concealing them under Islamic garments has been viewed hundreds of thousands of times in multiple Facebook posts which claim it was filmed at a supermarket in Sydney, Australia. The video is being used in a misleading context; it was actually filmed at a supermarket in London, England.", "The video was published here on Facebook on August 23, 2019. It has been viewed more than 348,000 times and shared more than 5,000 times.", "The post's caption states: \"Woolies Bankstown\". It refers to this Woolworths supermarket in the Sydney suburb of Bankstown.", "Below is a screenshot of the misleading post:", "At least some of the users who shared the video on Facebook appeared to be convinced that the video was filmed in Bankstown. AFP has redacted their identities in the screenshot below.", "The same video was also published on Facebook here and here with a similar claim.", "The claim is false; the video was filmed at an Asda supermarket in London, England.", "A reverse image search on Google for a keyframe extracted from the video found this article published by Britain’s Daily Telegraph newspaper. The article states two women were accused of using Muslim dress to aid a shoplifting spree at an Asda supermarket in the London suburb of Dagenham in August 2019. Police told the newspaper that the incident happened at a store in Merrielands Crescent, Dagenham on August 4, 2019.", "One of the members of staff who appears in the video can be seen wearing a uniform which displays an Asda logo on the back.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the Daily Telegraph's video (R) with the Asda logo circled in red:", "The video corresponds with Google user images tagged at the Asda store in Merrielands Crescent, Dagenham here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]