["A two-minute video of men dressed in camouflage uniform attacking a group of people huddled up around an idol of Hindu deity Durga is circulating on Facebook. Around October 27, a day after Durga Puja celebrations came to an end, this video was shared along with Bengali text, “Police carried out this kind of an attack on people who follow the Hindu religion in this state.” The message gives the impression that the incident took place in West Bengal.", "(Translated from এই রাজ্যে হিন্দু ধর্মাবলি মানুষদের ওপর এহেন পুলিশি আক্রমণ!…”)", "A Facebook user who posted this video gained over 27,000 views.", "এই রাজ্যে হিন্দু ধর্মাবলি মানুষদের ওপর এহেন পুলিশি আক্রমণ! ধিক্কার শুধুই ধিক্কার !! ছি:!", "Posted by Krishnendu Kar on Tuesday, 27 October 2020", "Other Facebook users have also shared the clip.", "Alt News performed a Google search with keywords ‘Durga Puja police lathi charge’ and found a report by The Times of India published on October 26. It stated that the incident took place in Munger district of Bihar.", "According to India Today, violence erupted during idol immersion in Munger. Shots were fired that led to the death of one person. The cops lathi-charged the group, claiming that “anti-social elements” had fired bullets. The Election Commission (EC) took cognisance of the matter, ordering the immediate removal of the SP and DM.", "#Breaking | Election Commission orders immediate removal of SP and DM of Munger, Bihar @Chaiti @rohit_manas#Bihar #BiharElection #LunchBreak #MungerFiring #ITVideo pic.twitter.com/pBzjrDpXtA", "— IndiaToday (@IndiaToday) October 29, 2020", "As per NDTV, the incident took place on the night of October 27, a day before the commencement of voting in Bihar assembly elections.", "The Indian Express reported, “As is the local precedence, the Badi Durga idol is immersed first in Munger. But as the police insisted on immersing over 25 idols before midnight of October 26, several organisers objected started pelting the police posse with stones.” The deceased has been identified as 25-year-old Anurag Poddar from Munger. Almost 30 people we injured in the incident.", "In a follow-up NDTV report, the police was quoted as stating that they had to shoot to “defend themselves” from stone-pelting.", "Thus a video of violence during Durga Puja idol immersion in Bihar was shared with a Bengali text and sans clarification that the incident did not take place in West Bengal.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]