["Since April 6, Alt News has received several requests to fact-check a 30-second video on WhatsApp (+91 76000 11160) and on our official Android application. In the video, we can see several policemen wearing a mask and a few fruit vendors.", "The video has been shared with the following text in Hindi: “Check all fruit and vegetable vendors properly. Since 2-3 days around 6-7 am, two vendors were seen in Mahalaxmi Nagar. Since they were coming early in the morning, people had their doubt. When some people asked their names, they went mum. In a matter of a few minutes, they said their name is Shiva, Mukesh, Dinesh and said they didn’t have identity cards on them. The vendors were stopped. When the police came to enquire they found out the boys were Muslim. That means, there is something really wrong. Please be alert.”", "[Translated from: कोई भी सब्जी और फल वाला कॉलोनी में ठेले वाला आया तो उसकी पूरी तरह जांच पड़ताल कर ले महालक्ष्मी नगर कॉलोनी में 2 ठेले वाले 2-3 रोज से सुबह सुबह 6 से 7 बजे में संतरे का ठेला ला रहे है इतनी जल्दी आने के कारण आज उन पर शक हुआ उनको कॉलोनी के कुछ लोगो ने रोक कर नाम पूछा तो उनकी सिट्टी पिट्टी गुम हो गई 2 मिनिट में 3-4 नाम बता दिए शिवा, मुकेश, दिनेश न ही उनके पास I D थी फिर उन्हें रोककर रखा पुलिस को बुलाया तो वो मुसलमान लड़के निकले इसका मतलब कुछ गड़बड़ है कृपया सतर्क रहे ).", "A Twitter user posted the video with a different Hindi text but the same anti-Muslim narrative. He claimed that the viral video is from Indore (archive link).", "इंदौर के महालक्ष्मी नगर में कुछ मुसलमान फ्रूट बेचते पाए गए जिनको पुलिस कार्रवाई में पकड़ा … pic.twitter.com/Xa60CfT8Ft", "— Naresh G Pahuja (@png60) April 6, 2020", "Alt News watched the video carefully and did a keyframe analysis. We found:", "1. At the 11-second mark, a man can be heard giving directions to their current location. The instruction mentioned Mahalaxmi Nagar and Partabh Medical as landmarks. We performed a keyword search on Google and found that a medical store with the same name is located in Mahalaxmi Nagar, Indore. Just Dial lists the full address as G-1 577 /78 Sai Shraddha Apartment, Balaji Height Road, Mahalaxmi Nagar, Indore – 452010, Near Water Tank.", "2. At the 27-second mark, we can see a yellow jeep with the words ‘Nagar Nigam Indore (translated from नगर निगम इंदौर)’", "Alt News spoke with Vivek Sharma, inspector general (IG), Indore Police. He stated that the video is at least a week old and the claims made on social media are false. IG Sharma connected Alt News with the concerned officer Yusuf Qureshi, superintendent of police (SP), East Indore.", "SP Qureshi and his team traced the two fruit vendors in the viral video (highlighted above). According to the police investigation, vendors Rohit and Ravi are employed by Girraj Gupta, who owns a fruit shop. SP Qureshi informed, “Girraj Gupta is 40 years old and stays at Tapeshwari Bagh, MR Ten Road.”", "The distance between Tapeshwari Bagh and Partabh Medical, Mahalaxmi Nagar is less than two kilometres away according to Google Maps.", "SP Qureshi added, “Due to the lockdown, Gupta wasn’t able to sell the remaining stock of fruits. Rohit and Ravi stepped out to sell the remaining fruits in the colony. That’s when the police and the municipal authorities seized the handcart.”", "The officer shared a video with us which was taken on April 13 by Indore police. It captures their conversation with Gupta. At 1:14 mark, Gupta confirms both Rohit and Ravi hail from the Hindu community.", "Alt News also spoke with Gupta, who said, “My carts, fruits and weighing scale were ceased. That’s a loss of up to 1.5 lakhs rupees.” He also confirmed that the men standing behind the cart are Rohit and Ravi.", "Therefore, the claim associated with the viral video is false. Indore police have not arrested the fruit vendors. However, their cart has been seized by the municipal authorities. Alt News couldn’t independently verify the religious affiliation of the vendors seen in the video.", "Since the last few weeks, several misleading social media posts have been circulated to target Muslim vendors with the claim that they are intentionally spreading coronavirus. Such misinformation causes panic that ultimately manifests in communal violence. On April 13, Alt News verified a video where a man can be seen assaulting a vegetable vendor after he revealed that his name is Mohammad Saleem.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…"]