["About this rating", "As of early 2020, we were still receiving inquiries about the truthfulness of an article published by the unreliable Natural News website.", "Under the headline \"New bill would allow farmers to sue Monsanto if GMO crops invade their property,\" the article began:", "Farmers in Oregon could finally get a win in their fight against companies like Monsanto. House Bill 2739 is under consideration and, if passed, it would allow farmers and landowners to sue biotech patent holders like Monsanto for essentially trespassing on their property.", "The House Bill 2739 summary states that it “Allows cause of action against patent holder for genetically engineered organism present on land without permission of owner or lawful occupant.” Defenders of the bill believe it is a step in the right direction to remedy problems caused by GMOs", "That information was true as far as it went, but some readers who encountered the Natural News article in 2020 ⁠— particularly through undated reprints on other websites ⁠— didn't realize that the article was originally published in March 2017. The bill that article referenced, HB 2739, died in committee without being voted upon in mid-2017 and therefore is no longer before the Oregon Legislature. A similar bill, HB 2882, was introduced in Oregon's House of Representatives in 2019 and met the same fate of languishing in committee.", "Despite the emphasis in the Natural News article's headline, the Oregon bill simply referenced \"genetically engineered organisms\" and did not mention or single out Monsanto (or any other company). Also, Monsanto has since been acquired by Bayer, who opted to drop the Monsanto brand name.", "Dewey, Caitlin.   \"Why ‘Monsanto’ Is No More.\"\r\n    The Washington Post.   4 June 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]