["“Joe Biden completely botches the Pledge of Allegiance: ‘I pledge allegiance to the United States of America, one nation, indivisible, under God, for real,’” Trump’s campaign posted on its official Facebook page on September 22, 2020, along with a video of Biden.", "The same claim was also made on Facebook by prominent conservatives Dinesh D’Souza and Sean Hannity, as well as by Trump’s campaign on Instagram and Republican Party Rapid Response Director Steve Guest on Twitter.", "Trump has sought to portray Biden as sleepy and generally mentally unfit to hold the office of US president, and his alleged inability to say the Pledge of Allegiance fits into that narrative.", "The implication resonated with people who commented on the posts, with one saying: “How can people think he is mentally capable of running our country,” and another writing: “He can be the president of the assisted living facility.”", "The pledge, which some students recite at the beginning of school, says: “I pledge allegiance to the flag of the United States of America and to the republic for which it stands, one nation, under God, indivisible, with liberty and justice for all.”", "The clip spread by the Trump campaign comes from remarks by Biden on September 21 in Manitowoc, Wisconsin. The full version of his speech makes clear that he was not attempting to recite the pledge verbatim.", "Rather, he was criticizing Trump for saying that US coronavirus numbers would be “at a very low level” if Democrat-led states were excluded.", "According to Biden, Trump is “saying if you live in a state like Wisconsin, Michigan, Pennsylvania, states with Democratic governors, you’re not his problem -- he has no obligation, he’s not responsible for you as president, your family, or your well-being. I don’t see the presidency that way.”", "“I don’t pledge allegiance to red states of America or blue states of America. I pledge allegiance to the United States of America, one nation, indivisible, under God, for real. I’m running as a proud Democrat, but I’m not gonna govern as a Democratic president, I’m gonna govern as a president,” Biden said.", "In addition to the Trump campaign's false claim about the clip of Biden in Wisconsin, the president and his team have openly spread digitally altered images during the 2020 race.", "AFP Fact check has previously debunked manipulated videos of Biden that Trump has spread on social media, as well as an ad from his campaign that featured doctored images of his Democratic rival.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]