["Six candidates qualified for the first debate of 2020.", "By Brooks Jackson, Eugene Kiely, Lori Robertson, Robert Farley, Jessica McDonald, Saranac Hale Spencer, D'Angelo Gore and Angelo Fichera", "Posted on January 15, 2020", "In the final Democratic debate before the Iowa caucuses, there were fewer candidates — only six — but more than a few false, misleading and exaggerated claims:", "The Jan. 14 debate, hosted by CNN and the Des Moines Register, was held at Drake University in Iowa.", "Biden was wrong when he said only the wealthy are doing well in the current economy.", "Biden: [T]he American public is getting clobbered. The wealthy are the only ones doing well, period.", "Whether workers are doing “well” may be a matter of opinion, but the fact is, rank-and-file workers have been making steady gains in weekly paychecks.", "Figures released earlier on the day of the debate by the Bureau of Labor Statistics show average weekly earnings of all private-sector workers in “real” terms — that is, after adjusting for inflation — rose 2.5% during President Donald Trump’s first 35 months in office. That’s actually a more rapid pace than when Biden was vice president, when real weekly earnings rose 4% over eight years.", "Furthermore, rank-and-file production and nonsupervisory workers (82% of all workers) are doing just a bit better than their bosses during Trump’s tenure. Real earnings for them have gone up 2.6%.", "To be sure, those at the top are gaining faster. A study last year by ISS Analytics for the Harvard Law School’s Forum on Corporate Governance found that the median compensation of chief executive officers of S&P 600 corporations rose 95% (before inflation) between 2009 and 2018, while median worker pay rose only 20%.", "But saying that “only” the wealthy are doing well is just not true.", "Biden continued to spin the history around his vote in 2002 to authorize the use of military force in Iraq, claiming the Bush administration “said they were not going to go to war” and only sought weapons inspections. In a speech days before Biden’s vote, Bush made clear that military action was possible.", "Biden also misleadingly claimed that from the moment the war started, “I was in the position of making the case that it was a big, big mistake.” Biden criticized President Bush for getting into the war too soon, with too few allies, and without a clear plan to “win the peace,” but he did not initially oppose the war altogether.", "Here’s how Biden described things during the debate:", "Biden: It was a mistake to trust that they weren’t going to go to war. They said they were not going to go to war. They said they were just going to get inspectors in. The world, in fact, voted to send inspectors in, and they still went to war. From that point on I was in the position of making the case that it was a big, big mistake. And from that point on I voted to — I moved to bring those troops home.", "In a speech on Oct. 7, 2002, just days before Congress would vote on a resolution authorizing military force against Iraq, Bush said that after years of “containment, sanctions, inspections, even selected military action, the end result is that Saddam Hussein still has chemical and biological weapons and is increasing his capabilities to make more. And he is moving ever closer to developing a nuclear weapon.”", "Bush did call for new, tougher inspections and sanctions — as Biden said during the debate. But contrary to Biden’s claim that the Bush administration assured “they were not going to go to war,” Bush made clear in that speech that war was possible.", "“I hope this will not require military action, but it may,” Bush said.", "A day after the resolution passed the House on Oct. 10, 2002, it passed the Senate 77-23, with Biden, chairman of the Senate Foreign Relations Committee, voting in favor.", "In the days and weeks before and after the war started, Biden said that while the hope was that the resolution could be used to leverage further inspections, he also acknowledged it was a vote for the possibility of war.", "“The way the Constitution works is, we voted to give the president the authority to go to war,” Biden said in a CNN interview two weeks after the war started. “It’s our decision whether or not we go from a state of peace to a state of war. We gave him that authority. You can second guess whether we should have or not. Once we’ve [done] that then it’s his decision to prosecute the war.”", "During the debate, Biden also misleadingly claimed that from the moment the war actually started, “I was in the position of making the case that it was a big, big mistake.”", "As we have written before, Biden was a consistent critic of the way the Bush administration handled the war: its failure to exhaust diplomatic solutions, its failure to enlist a more robust group of allies for the war effort, and the lack of a plan for reconstruction of Iraq. Some of his comments proved to be quite prescient, including his warnings about the likely higher-than-expected cost and length of the war, and the complexity of “winning the peace” once Iraqi leader Saddam Hussein’s regime was toppled.", "In other words, Biden argued that it was a mistake the way the Bush administration went to war, but Biden never outright opposed military action in Iraq in the immediate days after the start of the invasion. The day the war commenced, Biden told CNN: “There’s a lot of us who voted for giving the president the authority to take down Saddam Hussein if he didn’t disarm. And there are those who believe, at the end of the day, even though it wasn’t handled all that well, we still have to take him down.”", "In an interview with Charlie Rose on March 20, 2003, the day after the start of the war, Biden said, “I all along, Charlie, believed the right decision is to separate him from his weapons and/or separate him from power.”", "“If the U.N. didn’t do it, do it?” Rose interjected.", "“Yes, you’ve gotta do it,” Biden said. “Now, it’s not the time to argue it, but I am disturbed at the lost opportunities we had to bring the rest of the world along with us to this point. … And so now the question is … can you make lemonade out of lemons here?”", "In a Brookings Institution address on July 31, 2003, Biden said the Bush administration was “right to confront the challenge posed by Saddam thumbing his nose at the world and refusing — refusing — to alter his conduct. Contrary to what some in my party might think, Iraq was a problem that had to be dealt with sooner, rather than later. So I commend the president. … For me, the issue was never whether we had to deal with Saddam, but when and how we dealt with Saddam. And it’s precisely the when and how that I think this administration got wrong. We went to war too soon. We went to war with too few troops. We went to war without the world, when we could have had many with us, and we’re paying the price for it now.”", "It wasn’t until Nov. 27, 2005, that Biden acknowledged on NBC’s “Meet the Press” that his 2002 vote authorizing force in Iraq was “a mistake.”", "Sanders made several claims about health care that were close to true, but not quite there.", "Sanders went too far (again) when he claimed: “We’re spending twice as much per capita on health care as do the people of any other country.” The U.S. spends twice as much as most countries — and twice as much as the average for Organization for Economic Cooperation and Development countries — but not twice as much as “any other country.”", "According to the most recent OECD data, the U.S. per capita spending ($10,586) was twice as much as every country except six others, though the U.S. spending was close to double the amount for several of those nations (Denmark, Austria and Sweden). However, Switzerland’s per capita spending was $7,317; Norway’s was $6,187, and Germany came in at $5,986.", "The senator also exaggerated in claiming that “you’ve got 500,000 people going bankrupt because they cannot pay their medical bills.” The research he has cited indicates that medical bills or health problems contributed to — but not solely caused in all cases — a half million bankruptcy filings. We wrote more about the claim after the September debate.", "Sanders claimed that “workers” were “paying on average 20% of their incomes for health care. That is insane.” His campaign pointed us to a figure from the Milliman Medical Index, which said in 2018 the cost for a “typical family of four” with an employer-sponsored health plan was $12,378, which includes employee contributions to premiums and out-of-pocket costs. That figure is nearly 20% of the 2018 median household income of $63,179, according to Census Bureau figures (see Table H-11), the campaign said. But that’s not the correct Census statistic to use for a “family of four.”", "The average household size was 2.52 people. Census does have a median income figure for a family of four, and that’s $97,631 (see Table F-8). That would make $12,378 in health care spending 12.7% of the median income for a family of four.", "Near the end of the debate, moderators asked candidates about climate change, drawing out a response from Sanders in which he suggested the planet could become unlivable.", "Sanders: If we as a nation do not transform our energy system away from fossil fuel, not by 2050, not by 2040, but unless we lead the world right now — not easy stuff — the planet we are leaving our kids will be uninhabitable and unhealthy.", "It’s unclear exactly what timeline Sanders had in mind, or what he meant by “uninhabitable,” but many scientists disagree with the notion that the entire planet will soon become uninhabitable because of climate change.", "As we’ve noted before when clarifying politicians’ comments about climate change being an “existential” threat, NASA scientist Benjamin Cook said that it was plausible that some parts of the world could become unlivable. “In a given locality, if the impacts are so severe,” he said in a phone interview, the current way of life could become “no longer tenable.”", "But he did not think that would happen everywhere. The effects, he said, are likely to be uneven, hitting the poorest and most vulnerable the hardest.", "Scientists who reviewed a 2017 New York magazine story about climate change, “The Uninhabitable Earth,” for the website Climate Feedback also repeatedly noted that they found the notion that the planet would be uninhabitable to be unrealistic.", "“While it is clear that ongoing warming of the global climate would eventually have very severe consequences, the concept of the Earth becoming uninhabitable within anywhere near the timescales suggested in the article [by 2100] is pure hyperbole,” said Richard Betts, a climate researcher at the U.K.’s Met Office Hadley Centre and a professor at the University of Exeter.", "University of California, Los Angeles climate scientist Daniel Swain also commented, “The title itself is hyperbolic—there’s not really a plausible climate change scenario in which the Earth becomes truly uninhabitable.”", "Klobuchar sought to separate herself from other Democratic candidates on the issue of Iran by claiming that she alone was prescient enough to see that Iran was the “biggest threat to our world.”", "Klobuchar: I’m the one person on this debate stage on the first night of the very first debate when we were asked what we saw as the biggest threat to our world, I said China on the economy but I said Iran because of Donald Trump. Because I feared that exactly what happened would happen: enrichment of uranium, escalation of tensions, leaving frayed relations with our allies.", "That’s technically correct, but misleading.", "Because of the large Democratic field, the first debate was split into two nights — June 26 and June 27, 2019, and 10 candidates participated in each debate for a total of 20 candidates. Klobuchar is referring to a question that was asked only of 10 of the 20 candidates — the “first night of the very first debate” — and the only candidate on stage last night who was also in that first debate with Klobuchar was Sen. Elizabeth Warren.", "That night, co-moderator Chuck Todd asked: “What is our — what is the biggest threat — what is — who is the geopolitical threat to the United States? Just give me a one-word answer.”", "Klobuchar gave two answers, and was chided for it by Todd.", "Klobuchar, June 26: Two threats, economic threat, China, but our major threat right now is what’s going in the Mideast with Iran, if we don’t get our act together.", "Todd: OK, try to keep it at one — slimmer than what we’ve been going here. One or two words.", "Warren, following the rules, simply replied “climate change.” Biden, Sanders, South Bend Mayor Pete Buttigieg and businessman Tom Steyer were not in the June 26 debate, so they weren’t asked that question.", "Klobuchar also misled when she said that in her answer to the question about the biggest threat she said Iran “because of Donald Trump, because I feared that exactly what happened would happen: enrichment of uranium, escalation of tensions, leaving frayed relations with our allies.” We provide her entire answer above.", "Klobuchar is referring to another question asked during the same debate — but that question was not asked of Warren or any of the other candidates in last night’s debate.", "Lester Holt, who was also a moderator of the June 26 debate, asked Klobuchar if the nuclear agreement was a “good deal” for the United States. She said it was “imperfect” but a “good deal for that moment.” She went on to express concern about Iran exceeding the limits on enriching uranium and the possibility of war.", "But Klobuchar is not the only Democratic candidate who sees Iran as a threat or fears Trump will lead the U.S. to war with Iran.", "In the first night of the second debate, Warren  said the world is getting “closer and closer to nuclear warfare” because Trump pulled out of the nuclear agreement with Iran.", "Warren, July 30: At a time when Donald Trump is pulling out of our nuclear negotiations, expanding the opportunities for nuclear proliferation around the world, has pulled us out of the deal in Iran, and Iran is now working on its nuclear weapon, the world gets closer and closer to nuclear warfare.", "Sanders exaggerated when he said repeatedly that 500,000 people are “sleeping out on the streets.”", "Sanders: How does it happen that … half a million people are sleeping out on the streets tonight?", "Sanders: We got 500,000 people sleeping out on the streets tonight.", "That’s wrong. The most recent annual assessment of the homeless population, released Jan. 13 by the Department of Housing and Urban Development, estimated that 211,293 people were homeless and without shelter on the night the census was taken in 2019.", "Sanders was referring to the total population of homeless people, which HUD estimated at 567,715. As HUD’s report to Congress stated, “Just under two-thirds (63%) of people experiencing homelessness were staying in sheltered locations, and just over one-third (37%) were found in unsheltered locations.”", "By that measure, Sanders’ talking point is not even half true.", "After Sanders’ uninhabitable comment, Biden was given the floor to talk about climate change — and he used the opportunity to remind viewers of his historical role in taking action on the issue.", "“My response is, back in 1986, I introduced the first climate change bill,” he said, adding, “and check [PolitiFact], they said it was a game changer.”", "We did check PolitiFact, and as in the November debate, when Biden made the same claim, it doesn’t pan out.", "PolitiFact wrote in May about Biden’s role in legislation that was introduced in 1986 and passed in 1987, after the former vice president claimed to be “one of the first” people to introduce a climate change bill.", "While the headline referred to Biden as a “climate change pioneer,” the article never used the words “game changer.” The article also specifically noted that the bill, which directed the president to establish a global warming task force, essentially was a plan to make a plan — and should not be confused for a substantive bill that tackled greenhouse gas emissions.", "Sanders blamed two trade agreements — the North American Free Trade Agreement and permanent normal trade relations with China — for the loss of 4 million American jobs.", "But it’s not clear exactly how many jobs have been affected by the deals.", "Here’s what the senator said in an exchange with Biden:", "Sanders: [T]he end result of those two, just PNTR with China, Joe, and NAFTA, cost us some 4 million jobs, as part of the race to the bottom.", "Sanders’ figure is backed up by the labor-funded Economic Policy Institute. The EPI estimated that the U.S. has lost 3.4 million jobs since the U.S. granted permanent normal trade relations with China in 2001. The institute also estimated that NAFTA cost the U.S. 682,900 jobs, as of 2013.", "The Congressional Research Service, however, found that NAFTA didn’t have a big impact on jobs. In a 2017 report, it said, “In reality, NAFTA did not cause the huge job losses feared by the critics or the large economic gains predicted by supporters. The net overall effect of NAFTA on the U.S. economy appears to have been relatively modest, primarily because trade with Canada and Mexico accounts for a small percentage of U.S. GDP.”", "And the impact of PNTR with China since it joined the World Trade Organization in 2001 is similarly unsettled. A 2017 working paper published by the National Bureau of Economic Research found that the job losses in manufacturing have been partly offset by job gains in other parts of the economy.", "This isn’t the first time that Sanders has trotted out a reference to job losses due to trade deals, we wrote about a similar claim he made during a primary debate in 2016.", "Kiely, Eugene et. al. “FactChecking July’s Round Two Debate.” FactCheck.org. 1 Aug 2019.", "Kiely, Eugene et. al. “FactChecking the October Democratic Debate.” FactCheck.org. 16 Oct 2019.", "Cook, Benjamin. Climate scientist, NASA. Interview with FactCheck.org. 26 Jul 2019.", "ClimateFeedback.org. “Scientists explain what New York Magazine article on ‘The Uninhabitable Earth’ gets wrong.” 12 Jul 2017.", "Kruzel, John. “Was Joe Biden a climate change pioneer in Congress? History says yes.” PolitiFact. 8 May 2019.", "Kiely, Eugene et. al. “FactChecking the November Democratic Debate.” FactCheck.org. 21 Nov 2019.", "Organisation for Economic Co-operation and Development. Health spending (indicator). Accessed on 14 Jan 2020.", "Robertson, Lori, et. al. “FactChecking the September Democratic Debate.” FactCheck.org. 13 Sep 2019.", "Girod, Chris, et. al. “2018 Milliman Medical Index.” Milliman. May 2018.", "U.S. Census Bureau. Table H-11. Size of Household by Median and Mean Income. Accessed 14 Jan 2020.", "U.S. Census Bureau. Table F-8. Size of Family — Families by Median and Mean Income. Accessed 14 Jan 2020.", "U.S. Department of Housing and Urban Development. “The 2019 Annual Homeless Assessment Report (AHAR) to Congress.” 13 Jan 2020.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Average Weekly Earnings of All Employees, 1982-1984 Dollars.” Data extracted 15 Jan 2020.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Average Weekly Earnings of production and nonsupervisory employees, 1982-1984 Dollars.” Data extracted 15 Jan 2020.", "Roe, John and Kosmas Papadopoulos. “2019 U.S. Executive Compensation Trends.” Harvard Law School Forum on Corporate Governance. 16 Apr 2019.", "“Democratic candidates on the biggest geopolitical threat facing the US.” CNBC. 26 June 2019.", "“The first Democratic debate night transcript, annotated.” Washington Post. 27 June 2019.", "“Transcript: Night 2 of the first Democratic debate.” Washington Post. 28 June 2019.", "“Transcript: The first night of the second Democratic debate.” Washington Post. 30 Jul 2019.", "“The North American Free Trade Agreement (NAFTA).” Congressional Research Service. 24 May 2017.", "Asquith, Brian, et al. “U.S. Job Flows And The China Shock.” National Bureau of Economic Research. Nov 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]