["A video of street rioting is widespread on social media as an incident that recently took place in France. The clip is circulating against the backdrop of the recent French killings. “Wake up call to the seculars of the rest of the world,” reads the viral message in reference to the attacks carried out by Muslim fundamentalists.", "This is France Wake up call to the seculars of rest of the world. Open ur eyes ☝️ pic.twitter.com/GFgvHKXyo9", "— Ajay Singh (@ajaysingh0018) November 4, 2020", "The same video is also massively viral on Facebook with the same caption.", "This is France Wake up call to the seculars of rest of the world.👇", "Open ur eyes 👇👍", "Posted by Join Rss on Friday, November 6, 2020", "Alt News has received several requests to fact-check the video on WhatsApp (+91 76000 11160) and on our official Android application.", "We broke down the video into multiple keyframes. Upon reverse-searching some of them, we found the same video on Reddit captioned as, “Why you shouldn’t knock a cop off his bike, unless you’re prepared for vengeance…”. In the comment section, a user wrote that the video is from Barcelona and the crowd was protesting the new lockdown policy.", "Reuters had published a fact-check report on November 4 on the same incident falsely claimed to be the Vienna attack. The report however, carries a video of the Barcelona riots taken from a different angle. The location, police cars and bikes, and identical markings on the road suggest that both videos represent the same incident.", "We broke down the Reuters video into multiple keyframes and a reverse-image search led us to a Spanish news article published on October 30, 2020, where the same clip was posted. The report mentioned that the incident happened in the Plaza de Sant Jaume in Barcelona. According to the article, “A group of young people from the Gamonal neighborhood, in Burgos, have also protested against the curfew, decreed by the Junta de Castilla y León 10 pm onward throughout the region. The police have already carried out several charges against the protesters, who, in addition to throwing firecrackers and stones at the agents, have burned several containers on Victoria Street.”", "Daily Mail similarly reported, “The violence erupted after prime minister Pedro Sánchez declared a state of emergency and imposed a nationwide curfew between 11pm and 6am on October 25, with people only allowed to leave their homes for essential journeys.”", "Therefore, a video of police clashing with protesters in Barcelona is falsely viral as a recent incident that took place in France.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]