["An image of a fighter plane has been shared on Twitter with the claim that the Indian Air Force (IAF) is mocking Pakistan’s claim that four trees and one crow were the only casualties in the 2019 Balakot airstrike. The viral image also has a watermark ‘Bharat Rakshak’ at the bottom.", "Twitter user Dr Shobha was among those who shared the picture. She has over 1.5 lakh followers including Prime Minister Narendra Modi. (archived link)", "IAF – thoroughly enjoyable professional force with an admirable sense of humour at official level.", "The adversary admitted that only 4 trees and a crow were the casualties in the Balakot Strike !", "All other trolls (past, present & future) put together – 0", "IAF – 1 pic.twitter.com/sgcs8Qwa7O", "— Dr Shobha (@DrShobha) October 26, 2020", "Similarly, Wg Cdr Nitin Purandare (Retd), a former IAF officer (as per Twitter bio), Twitter user @satya_AmitSingh and Twitter user @samarjeet_n also posted the viral image. All the three tweets carried the text, “Admire the sense of humour. They are trolling Pakis for admitting that only 4 trees and one crow were the casualties in Balakot strike.”", "This slideshow requires JavaScript.", "Following the Pulwama attack in 2019, the IAF claimed to have bombed Jaish-e-Mohammad’s “biggest” terror-training camp in Pakistan’s Balakot. Media reports placed the casualties at 300 citing “top government sources” even as the centre did not release any official statements. Defense Minister Nirmala Sitharaman in fact said that the casualty figure will not be provided.", "Two days after the airstrike, Reuters published a ground report from Balakot where a local was quoted as saying, “No one died. Only some pine trees died, they were cut down. A crow also died.”", "Before we proceed with the fact-check, it must be pointed out that it’s improbable for the IAF to engage in such puerile mockery. The claim itself sounds absurd.", "We performed a reverse image search on Google and found the image on the website ‘zone5aviation‘ (archived link). It is the ninth photograph in the gallery. “IAF Mirage 2000H/TH In late 2012, I spent a few days at Maharajpur Air Force Station in Gwalior, where Squadrons No. 1, 7 & 9 flying Dassault Mirage 2000H/TH combat aircraft are based,” reads its description. The aircraft does not have four trees and a crow imprinted on the side.", "This slideshow requires JavaScript.", "The image below shows the comparison between the viral image and image uploaded on the website ‘zone5aviation’. The only difference is that the viral image has the watermark ‘Bharat Rakshak’.", "Bharat Rakshak, a website that posts content related to the Indian military, tweeted, “Sorry, but this is a fake photo being circulated and did not originate with @bharatrakshak. We do feel flattered that the person who faked it wanted the BR watermark to assign some sense of authenticity to it – but yeah.. its fake.. sorry @CestMoiz if this was disappointing!” Twitter user @CestMoiz had posted the viral image and later took it down. (archived link)", "Sorry, but this is a fake photo being circulated and did not originate with @bharatrakshak We do feel flattered that the person who faked it wanted the BR watermark to assign some sense of authenticity to it – but yeah.. its fake.. sorry @CestMoiz if this was disappointing! https://t.co/kAVYpzgjUs", "— Bharat Rakshak (@bharatrakshak) October 25, 2020", "The claim was earlier fact-checked by The Quint that spoke with the founder of Zone5Aviation website Angad Singh. He told the outlet that the image in circulation is “fake” and that he had captured the original one in December 2012 in Gwalior.", "The image now being used to claim that the IAF ‘mocked’ Pakistan was initially shared by Pakistani Twitter users to ridicule the IAF. An Indian Twitter user had posted the original picture back in April and called out the misinformation.", "Pakistani Trolling level on IAF Mirage-2000H 😂😪..Just 4 trees and one crow. 1st fake pic vs 2nd real pic… pic.twitter.com/RAmUam5kAs", "— Sukhoi Su-57 Felon 🇷🇺🇮🇳 (@I30mki) April 4, 2020", "Another photograph of an aircraft was similarly morphed with images of trees and a crow to mock the Indian Air Force.", "” #IAF Mirage 2K with an updated livery after the successful airstrike on trees and crows 😃😜#ISPR #PakistanArmy pic.twitter.com/OjqMUDMkzO", "— Umaır Şhahzad 🇵🇰 (@ImUmairShahzad) March 30, 2019", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]