["About this rating", "In September 2013, Guido Barilla, the chairman of Barilla Group, one of the world's leading pasta manufacturers, engendered controversy and prompted calls for boycotts when during the course of an interview with an Italian radio program, he responded to a question about whether he would ever feature a gay family in his company's commercials by saying (as roughly translated into English): \"We won't include gays in our ads, because we like the traditional family. If gays don't like it, they can always eat another brand of pasta. Everyone is free to do what they want, provided it doesn’t bother anyone else\":", "Barilla — one of the best known pasta brands around the world — is one of Italy's biggest advertisers, and for many years has used the image of a happy family living in an idealised version of the Italian countryside, with the slogan: \"Where there's Barilla, there's home.\"", "\"I would never do (a commercial) with a homosexual family, not for lack of respect but because we don't agree with them. Ours is a classic family where the woman plays a fundamental role,\" Barilla, 55, said in an interview with Radio 24.", "In the interview, Barilla said he opposed adoption by gay parents, but was in favour of allowing gay marriage, which is not legal in Italy. His comment about advertising was in response to a direct question about whether he would ever feature a gay family in his company's commercials.", "If gays \"like our pasta and our advertising, they'll eat our pasta, if they don't like it then they won't eat it and they can eat another brand,\" he said.", "Then the pasta magnate upped the ante by attacking gay adoption. \"I have no respect for adoption by gay families because this concerns a person who is not able to choose,\" he said.", "Guido Barilla subsequently issued a \"clarification\" (i.e., a typically evasive form of apology) for his remarks on the company's web site and Facebook page, stating:", "With reference to remarks made to an Italian radio program, I apologize if my words have generated controversy or misunderstanding, or if they hurt someone's sensitivity.", "For clarity, I would like to point out that:", "- I have the utmost respect for anyone, without distinction of any kind.", "- I have the utmost respect for gay people and for everyone's right to express themselves.", "- I've also said — and I would like to reiterate — that I respect gay marriages.", "- In its advertising, Barilla represents the family — because it’s what welcomes everyone.", "By the end of the following year, Barilla (the company and the man) seemed to have executed an about-face on the issue of non-traditional families, an adjustment of viewpoint that at least some observers believed to be genuine:", "Not long ago, pasta-maker Barilla was just one more major company that had run afoul of the gay rights movement, a distinction it earned last year when its chairman said he would never feature a same-sex couple in an ad. If gays didn’t like it, he added, they could eat something else.", "But in a sign of how toxic it has become for a company to be viewed as unfriendly toward gays, Barilla has made a dramatic turnaround in the space of one year, expanding health benefits for transgender workers and their families, contributing money to gay rights causes, and featuring a lesbian couple on a promotional Web site.", "Guido Barilla issued multiple video apologies in the wake of the scandal. Barilla Group did not make Guido Barilla available for an interview, but in a statement, he apologized again, adding: “I am proud to say that, as a result of these discussions, we have all learned a great deal about the true definition and meaning of family, and over the past year we have worked hard to reflect that throughout our organization.”", "Some of the gay advocates who have worked with Guido Barilla since his comments believe his contrition is sincere. “He was horrified at the consequences and his personal beliefs,” said David Mixner, a veteran gay rights activist and author who served as a consultant for Barilla.", "He called the recent diversity initiative “the most all-encompassing effort to bounce back from an unfortunate misstatement that I’ve ever been part of.”", "Davies, Lizzie.    \"Pasta Firm Barilla Boycotted Over 'Classic Family' Remarks.\"\r\n    The Guardian.   26 September 2013.", "Day, Michael.    \"Barilla Pasta Brand Faces Boycott After Boss's Comments Spark Backlash.\"\r\n    The Independent.   26 September 2013.", "Scherer, Steve.    \"Italian Pasta Baron's Anti-Gay Comment Prompts Boycott Call.\"\r\n    Reuters.   26 September 2013.", "Somashekhar, Sandhya.   \"Human Rights Campaign Says Barilla Has Turned Around Its Policies on LGBT.\"\r\n    The Washington Post.   19 November 2014.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]