["About this rating", "While several online fabrications were designed to elicit anger against former pro football star Colin Kaepernick (\"satirically\" or otherwise) after the announcement of his inclusion in a Nike ad campaign, at least one fake item rebuked consumers who professed a desire to burn their own Nike apparel in protest against Kaepernick and the sportswear company.", "In September 2018 a popular Facebook post proffered an alleged \"response from Nike\" regarding the angry outcry that followed their announcement that Kaepernick would be featured in the ad campaign marking the 30th anniversary of the Nike slogan \"Just Do It\":", "At least one user who shared the post claimed that they found the text posted on the public relations web site PRWeb, but that the notice had since been deleted. A staff member for PRWeb referred us to Nike but would not comment further. But no such statement was ever spotted or archived from Nike's social media accounts, and the company confirmed to us via email that it did not originate with them.", "The mention of people \"burning\" their Nike apparel could be a reference to separate pictures that spread online claiming to show a person burning his Nike shoes while wearing them. In reality, though, that picture set was a hoax posted by a Twitter user who employed a photograph of some other foot burn patient.", "The claim that veterans comprise \"nearly a fifth of all homeless people\" does not match up with federal data. According to the department of Housing and Urban Development, the U.S. homeless veteran population increased in 2017 to an estimated 40,000 people. But that figure constitutes far less than 20 percent of the overall homeless population, which is estimated to be around 554,000 people.", "Kaepernick has been the subject of right-wing criticism since he began \"taking a knee\" during the playing of the national anthem before games in protest of extrajudicial killings on the part of police, a move that he undertook at the suggestion of a U.S. Army veteran and former National Football League player, Nate Boyer.", "After Kaepernick generated another round of controversy by announcing that he would be part of the Nike campaign,  \"reports\" from spurious web sites claimed that the company had quickly dumped him; that Nike lost contracts with both the University of Alabama and the federal government; and that pro basketball hall-of-famer Michael Jordan pulled his signature Air Jordan brand from the company.", "While President Donald Trump has claimed that Nike was suffering because of a purported boycott incited by the Kaepernick ad campaign, social media data reportedly showed a lack of \"a strong negative call\" against the company.", "On 5 September 2018, Nike released a two-minute TV commercial voiced by Kaepernick that aired during the 2017 season premiere of Thursday Night Football a day later.", "Draper, Kevin and Ken Belson.   \"Colin Kaepernick's Nike Campaign Keeps N.F.L. Anthem Kneeling in Spotlight.\"\r\n    The New York Times.   3 September 2018.", "Green, Dennis.   \"Trump Says Nike is 'Getting Absolutely Killed' Over Its Colin Kaepernick Ad, But the Boycott Movement May Already be Dying.\"\r\n    Business Insider.   5 September 2018.", "Shane, Leo III.   \"Number of homeless Vets Rises for First Time in Seven Years.\"\r\n    Military Times.   6 December 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]