["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is a sample 3rd grade test question", "The state announced the first round of the Georgia Milestones tests on Sept. 3 and, as predicted, scores were low.", "Only 10 percent of students who took a language arts or science course at any grade level finished in the top category of distinguished learners. In math, 60 percent of all Georgia students scored as beginning or developing learners.", "State School Superintendent Richard Woods said the new test sets standards that are higher, more comparable nationally and essential if students are to be college- and career-ready.", "\"Our previous assessment, the CRCT, set some of the lowest expectations for student proficiency in the nation, and that cannot continue,\" Woods said in the press release announcing the results.", "The Criterion-Referenced Competency Tests, or CRCT, is infamous for being central to the Atlanta Public Schools test-cheating scandals. Dozens of teachers and administrators risked careers and criminal prosecution changing CRCT scores to avoid losing bonus pay, even jobs.", "More than 20 educators pleaded guilty to reduced charges in the scandal. Eleven others were convicted in April on racketeering and other charges, receiving sentences from probation to three years in prison. Some are appealing.", "With all that said, did the CRCT really set some of the nation’s lowest expectations for student proficiency, as Woods suggests? ( Keep in mind that an easy test can still be failed.)", "First a little background about the CRCT. It stood as one of the primary measures of student achievement in Georgia from 2000 until it was retired in Summer 2014.", "The multiple-choice tests also were used to determine whether schools made adequate yearly progress (AYP), the benchmark of success under the federal No Child Left Behind law.", "The A-Plus Education Reform Act of 2000, pushed by former Gov. Roy Barnes, required all Georgia students in grades 1 to 8 to take the CRCT in reading, English/language arts and math.", "Students in grades 3 through 8 also were tested in science and social studies. A writing test was required in grades 3, 5, 8 and 11.", "Passing the CRCT was required for promotion to the next grade for students in grades 3 (reading) and 5 and 8 (reading and math).", "Who knew? Answer: Many", "Woods, who became state superintendent in January, isn’t saying something about the CRCT that hasn’t been said for years by some parents, teachers and certainly educators and education researchers/advocates.", "What was the tell-tale sign that the test was too easy?", "It was the wide gulf between passing rates on the CRCT and the National Assessment of Educational Progress (NAEP), considered the gold standard of tests.", "The Education Trust in Washington D.C. raised a red flag back in 2006. The non-profit pointed out, for example, that 87 percent of Georgia fourth-graders were considered \"proficient\" in reading on the CRCT, but only 26 percent of a sampling of those same students were proficient on the 2005 NAEP reading test. (If the two tests had the same expectations, there should be a minimal gap. Wide disparities in results on the state and national test are referred to as the \"honesty gap.\")", "State officials at the time said the report findings could lead to a strengthening of the test. If that happened, it doesn’t appear to have shown up in the data.", "A subsequent report from the group, relying on 2011 data, showed about the same results. Nearly 90 percent of students met standards on the CRCT, but only 32 percent did so on NAEP.", "It wasn’t a state secret either", "Our research turned up a report from the Governor’s Office of Student Achievement, \"A Snapshot of K-8 Academic Achievement in Georgia.\"", "The report said that performance on the CRCT had improved modestly between 2009-10 and 2012-13. But it said a comparison with national tests showed that Georgia set a low bar for proficiency on the CRCT and still ranked in the bottom half of national comparisons on NAEP.", "The report pointed out that a recent Education Next study found Georgia had the lowest mathematics and reading cut scores in the nation. (Georgia students had to answer fewer test questions right to pass the test, or be classified as proficient. About 50 percent was standard.)", "For 2013, the most recent year for which data is available, here's what a NAEP Mapping Study showed: (This study uses NAEP as a common scale to compare one state’s expectations of what their students should know and be able to do in order to be considered \"proficient\" on their state assessments to other states.)", "-- Georgia had the lowest numeric 4th grade reading expectations in the nation (Proficiency by NAEP standards was a scale score equivalent of 238 or better. But researchers found Georgia classified students who scored 167 or above, as proficient. No other state had that low a bar.);", "-- Georgia was third from the bottom on 4th grade math expectations (Georgia's NAEP scale score equivalent of 210 was numerically better than Maryland's and Alabama's; top was Texas at 256);", "-- Georgia was last in 8th grade reading expectations (Georgia had a NAEP scale score equivalent of 199 and was a distant last at that, with Idaho the next lowest at 217. Best was New York at 282 out of possible 500);", "-- and Georgia numerically ranked third from the bottom in 8th grade math expectations. (The state's NAEP scale score equivalent was 245, which is tied with Alabama, 245, and was followed by Connecticut, 244. Best was New York at 304, out of a possible 500.)", "\"Too many students were labeled as proficient when, in reality, they had not fully mastered the standards and needed additional support,\" Woods said recently. \"That hurt our kids who need to be competitive with others across the country and hurt our teachers by making it difficult for them to have a true picture of the academic strengths and weakness of their students.\"", "Our ruling", "There’s ample evidence that, for years, Georgia’s CRCT \"set some of the lowest expectations for student proficiency in the nation,\" as research has repeatedly shown and State Superintendent Richard Woods stated last week.", "We rate Woods’ statement True.", "\"First Georgia Milestones test results released: district- and school-level results will be released in October,\" press release, Georgia Department of Education, Sept. 4, 2015", "\"State releases Milestones results. As predicted, fewer students show proficiency,\" By Maureen Downey, AJC Get Schooled blog, The Atlanta Journal-Constitution, Sept. 3, 2015", "\"Higher standards means fewer pass Georgia’s new K-12 tests,\" By Ty Tagami, The Atlanta Journal-Constitution, Sept. 3, 2015", "Richard Woods, superintendent of schools, Georgia, bio", "Interview with Allison Horowitz, a K-12 policy analyst at the Education Trust", "Ed Watch, a publication of the Education Trust, spotlighting Georgia 2006.", "Excerpt from Ed Watch, a publication of the Education Trust, spotlighting Georgia, using 2011", "Interview with Grady Wilburn, PhD., statistician at National Center for Education Statistics", "\"A Snapshot of K-8 Academic Achievement in Georgia\"", "\"Mapping State Proficiency Standards Onto NAEP Scales: Results From the 2013 NAEP Reading and Mathematics Assessments\"", "\"Despite Common Core, States Still Lack Common Standards,\" Education Next, September 2013", "Interview with Matt Cardoza, spokesman, Georgia Department of Education", "----------------------------------------------------------------------------------------------------------------------------------", "CRCT cut scores 2013* (from Georgia Department of Education)", "Reading Grade 4; Meets --  50 percent and Exceeds -- 85 percent", "Reading Grade 8: Meets -- 48 percent and Exceeds -- 88 percent", "Mathematics Grade 4; Meets -- 57 percent and Exceeds -- 82 percent", "Mathematics Grade 8; Meets -- 52 percent and Exceeds  -- 82 percent", "Cut scores are how many questions a student has to answer correctly.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]