["The video was published here on Facebook on November 18, 2020. It has been viewed 2,400 times.", "The video shows part of a news segment by OAN. The strapline reads: “ELECTIONS 2020 / JOE BIDEN LISTED AS CRIMINAL SUSPECT IN UKRAINIAN COURT”.", "The post’s caption, written in both traditional Chinese and English, states: “Ukraine has now listed Joe Biden as wanted on Class A felony Charges”.", "The video and screenshots of it have also been shared alongside a similar claim here and here on Facebook, here on Twitter, and on various websites, such as here.", "However, the claim is false.", "A keyword search on Google found the original video published here on OAN’s YouTube channel on May 21, 2020. The title reads: “Joe Biden listed as criminal suspect in Ukrainian court”.", "The video reports, in part: “Candidate and former Vice President Joe Biden finds himself in hot water this week. Just confirmed, a Ukrainian court ordered Joe Biden to be formally listed in a criminal case. The crime - the alleged firing of Ukraine's former prosecutor general Viktor Shokin, in exchange for dropping an investigation into Joe Biden’s son Hunter Biden and the company for which he was a board member, Burisma oil.", "“At the time Shokin called for this case, back in February, the courts listed one of the defendants as ‘an unnamed American’, an individual widely understood to be Joe Biden, Obama’s Ukraine point man, but Biden was never formally named. Now, courts have ruled it is improper to conceal Biden's name and there is sufficient evidence to proceed with an investigation. The ruling cannot be appealed.”", "There is no reference to “Class A felony charges” in the video.", "The clip also makes a misleading claim about the Ukrainian case in which Biden was mentioned.", "In February 2020, Ukraine's ex-prosecutor general Viktor Shokin filed a criminal complaint against Biden, accusing the then-US vice president of pressuring for his dismissal.", "Opening a criminal case file in Ukraine is not the same as launching a criminal investigation. Ukraine expert Adrian Karatnycky, a senior fellow at the Atlantic Council, told PolitiFact: “Criminal case files are opened pending investigations at the request of parliamentarians, on the basis media allegations, requests from civic groups and citizens. This is not the same as an actual criminal investigation. Such cases are registered and do not rise to the level of criminal investigations until the allegations are first vetted.”", "Ukraine police subsequently announced on November 11 that it had closed its criminal probe, prompted by Shokin's complaint, after finding no evidence of wrongdoing. Ukraine’s national news agency Ukrinform announced here on November 11, 2020 that the case had been closed.", "Multiple keyword searches also found no credible reports of criminal charges against Biden in Ukraine as of November 20, 2020.", "AFP has previously debunked false claims about Biden’s involvement in the firing of Shokin here in October 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]