["\"Breaking news… Indians are now throwing away gods, claiming that it's not helping them anymore with this pandemic, they are accepting Jesus now in large numbers,\" reads a Facebook post shared more than 400 times since it was published on May 5, 2020.", "The footage shows men in high-visibility jackets climbing into a truck containing large statues. They then toss the sculptures one by one over the bridge into a river below.", "The same footage was shared alongside the false claim in this Facebook post and on YouTube. Similar claims were shared in French here and here.", "According to the World Health Organization, India has recorded more than 106,000 cases of COVID-19 and over 3,300 deaths as of May 18, 2020. The disease has claimed more than 300,000 lives since it emerged in the Chinese city of Wuhan last December.", "Using the Invid-WeVerify tool, AFP Fact Check ran reverse image searches on the video frames and traced the footage to Facebook posts as far back as 2015.", "A Facebook post from September 29, 2015 shares the clip alongside the caption, \"Although the idol is gone, Ganesh lives forever! This story is the same for the real being, the soul too. It is in this spirit and this fervor that immersion is celebrated everywhere in India\".", "AFP ran a Google search for the keywords \"Ganesh\" and \"Visarjan\" (which means \"Ganesh\" in Hindi) and found this Times of India article about a ritual known as Ganesh Chaturthi, which is dedicated to the god Ganesh and takes place every year in August-September.", "As the newspaper explains, \"on the first day of the holiday, believers mark the beginning of Ganesh Chaturthi by displaying the effigy of the god Ganesh in their homes, public places and offices. On the last day, they go out in procession, carrying the idols of their god before carrying out the immersion.\"", "The video shows that last part of the ritual.", "AFP fact checker Uzair Rizvi in New Delhi spotted the same clip in a post published on an Indian Facebook account.  The caption (in Hindi) identified the location as National Highway 44 near Krishna river in the southern Indian state of Telangana.", "A search on Google Maps allowed us to locate the bridge that runs over the Krishna river in the town of Beechupally.", "Comparing the bridge seen in the video to the one on Google Maps, we notice three visual clues; the red barrier, the cylindrical white structure and a raised piece of land piece in the river; all indicating it is the same location.", "Contacted by AFP, Telangana state police chief, Rema Rajeshwari confirmed the video was taken in Beechupally.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]