["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks at a rally near the White House on Jan. 6, 2021, in Washington. (AP)", "A mob breached the U.S. Capitol building on Jan. 6, forcing evacuations in both chambers of Congress and halting the Electoral College vote count — a historic insurrection against the federal government.", "The chaotic day started with a demonstration at the White House to promote the falsehood that President Donald Trump won the 2020 election.", "For more than two months, Trump has uttered and encouraged inaccurate claims that the election was stolen from him to put Joe Biden in the White House. The claims festered on social media and found a home on television networks like Fox News, One America News and Newsmax.", "In remarks to his supporters on Jan. 6, Trump doubled down on his false claim to victory. He said lawmakers were trying to \"illegally take over our country\" and encouraged people to march toward the Capitol, which they did.", "RELATED: A day of crisis at the US Capitol, fact-checked", "\"We won. We won in a landslide,\" he said during a speech on the Ellipse outside the White House. \"This was a landslide.\"", "No, it was not a landslide. And he didn’t win. Here’s how we know that:", "All 50 states and the District of Columbia have certified their election results, which Congress sought to finalize Jan. 6. Those results show that Biden won with 306 electoral votes, to Trump’s 232. Biden won the popular vote by about 7 million.", "There is no evidence that voter fraud affected that outcome.", "Election officials in every state have said there was no sign of significant voter fraud during the voting process. The Cybersecurity and Infrastructure Security Agency and its election partners called the 2020 election \"the most secure in American history.\" Former Attorney General William Barr said the Justice Department had uncovered no evidence of widespread fraud. Barr reiterated that point before his Dec. 23 resignation.", "Not one of the 62 lawsuits that Trump and his allies filed in state and federal courts has proved that voter fraud affected the election outcome. The suits have been dismissed by Democratic-appointed and Republican-appointed judges.", "PolitiFact has fact-checked dozens of allegations of voter fraud before and after Election Day. Under the Constitution, states have the power to administer elections and count votes. The states certified their results, some following audits and recounts, almost a month ago.", "Each state has its own process for certifying results, but here is how the process generally works:", "After voters cast their ballots, local election workers tabulate them at ballot-counting centers, where Republican, Democratic and nonpartisan challengers observe the process. They verify that the results match the number of votes cast, and that provisional ballots were cast legally.", "Local election offices then send the results to a county canvassing or certification board, which is typically bipartisan. If there doesn’t appear to be a problem with the vote tally, the results are passed on to the state for final certification.", "A state canvassing board, the secretary of state or other officials certify the election results. Each state had until Dec. 8 to certify its results and send them to the federal government. Anyone can access copies of the Electoral College certificates from the National Archives.", "There is no credible reason to believe that that process was plagued by fraud in 2020. In Georgia, where Biden had one of his slimmest margins of victory, two recounts — including one conducted by hand — reaffirmed his victory. Georgia’s secretary of state, a Republican, has repeatedly swatted down claims that voter fraud affected the vote.", "Both chambers of Congress met Jan. 6 to formally count the Electoral College votes and finalize the election results, but the session was disrupted by the Capitol breach. House Speaker Nancy Pelosi said Jan. 6 that Congress would reconvene that night to count electoral votes.", "When that does happen, there is no real chance that the election results will be overturned.", "In his address to the Senate before the chamber was evacuated, Majority Leader Mitch McConnell called on his colleagues to accept the outcome of the election.", "\"Nothing before us proves illegality anywhere near the massive scale, the massive scale that would have tipped the entire election — nor can public doubt alone justify a radical break when the doubt itself was incited without any evidence,\" he said. \"The voters, the courts, and the states have all spoken. They've all spoken. If we overrule them, it would damage our republic forever. This election actually was not unusually close.\"", "In a speech to his supporters on a violent day in Washington, Trump said he won the 2020 election \"in a landslide.\"", "That’s ridiculously wrong. He didn’t win at all, let alone in a landslide.", "Biden won the presidential election with 306 electoral votes, to Trump’s 232. All 50 states and the District of Columbia have certified their votes, which Congress will formally tally before Biden’s inauguration.", "None of the 62 lawsuits that Trump and his allies filed after Election Day has proved that voter fraud affected the election outcome. Federal agencies and state election officials have repeatedly said there is no evidence of widespread fraud.", "Trump’s claim is Pants on Fire!", "RELATED: A note to our readers who think President Trump won", "Associated Press, \"Disputing Trump, Barr says no widespread election fraud,\" Dec. 1, 2020", "Associated Press, \"EXPLAINER: How does election certification usually work?\" Nov. 18, 2020", "Associated Press, \"EXPLAINER: What’s with all the election audits?\" Nov. 21, 2020", "National Archives, 2020 Electoral College Results", "National Conference of State Legislatures, Poll Watchers and Challengers", "National Constitution Center, Elections Clause", "Newsweek, \"Full Text of Mitch McConnell's Speech Before 'Most Important' Vote of His Career,\" Jan. 6, 2021", "The New York Times, \"The Times Called Officials in Every State: No Evidence of Voter Fraud,\" Nov. 10, 2020", "NPR, \"Biden's Victory Cemented As States Reach Key Electoral College Deadline,\" Dec. 8, 2020", "PolitiFact, \"Counting the electoral votes on Jan. 6: What you need to know,\" Jan. 4, 2021", "PolitiFact, \"Fact-checking false claims about the 2020 election,\" Nov. 19, 2020", "PolitiFact, \"Here’s why Georgia’s Republican officials are confident in their presidential election results,\" Jan. 5, 2021", "PolitiFact, \"How Fox News, Newsmax vote-rigging coverage squares with defamation law,\" Dec. 23, 2020", "PolitiFact, \"How online misinformation unfolded after Election Day, boosted by Trump and his allies,\" Nov. 5, 2020", "PolitiFact, \"Is this a coup? Here’s some history and context to help you decide,\" Jan. 6, 2021", "PolitiFact, \"Trump falsely and prematurely claims 2020 presidential victory,\" Nov. 4, 2020", "Rev, Donald Trump Speech \"Save America\" Rally Transcript January 6", "Thomas Reuters/West, \"ELECTION LAW VOTING CERTIFICATION OF RESULTS – GENERAL ELECTIONS (STATUTES),\" June 2009", "USA Today, \"By the numbers: President Donald Trump's failed efforts to overturn the election,\" Jan. 6, 2021", "USA Today, \"Congress to reconvene Wednesday night to continue Electoral College count after riot at Capitol,\" Jan. 6, 2021", "U.S. Cybersecurity and Infrastructure Security Agency, JOINT STATEMENT FROM ELECTIONS INFRASTRUCTURE GOVERNMENT COORDINATING COUNCIL & THE ELECTION INFRASTRUCTURE SECTOR COORDINATING EXECUTIVE COMMITTEES", "Voice of America, \"How Media Organizations Report Election Results in Real Time,\" Oct. 27, 2020", "Vox, \"What does the storming of the Capitol mean for the electoral vote count?\" Jan. 6, 2021", "The Washington Post, \"Live updates: Woman dies after shooting in U.S. Capitol; D.C. National Guard activated after mob breaches building,\" Jan. 6, 2021", "The Washington Post, \"Undercutting Trump, Barr says there’s no basis for seizing voting machines, using special counsels for election fraud, Hunter Biden,\" Dec. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]