["About this rating", "In February 2016, a meme asserting that the soft drink Coca-Cola was an effective solution for eliminating head lice began circulating on social media. Although this claim has frequently appeared in answers to lice-related questions on web sites such as MamaPedia and Budget 101, it has not been vetted by any authoritative source. The Coca-Cola lice remedy is also mentioned in the \"miscellaneous treatments\" section of Itch No More, an Australian business that specializes in head lice removal, but the company provides no information on how that method ostensibly works:", "Miscellaneous treatments:  Vaseline, Tea Tree Oil, Olive Oil, Mayonnaise, Kerosene, Coca Cola, Hair Dye, Raid, Lysol, Dog Shampoos, Vinegar", "The best approach to treating head lice:  Many decisions about treating head lice is best approached with an understanding of the biology of the lice.  When exploring lice treatment options, consider the life cycle of the head lice and when they are most vulnerable.  Adult head lice are able to lay as soon as they reach full size and continue doing so for their entire 30 day life span resulting in as many as 100 nits per lice.  This means that even if you get rid of all the adult lice, there will be plenty of viable nits and immature nymphs to take their place and repeat the cycle if they are not removed or killed during the initial lice treatment process.", "The National Pediculosis Association, which is a nonprofit organization dedicated to educating the public about head lice infestations (and selling lice combs, a removal method that's endorsed by the American Academy of Dermatology) said in an e-mail response that they had never heard Coca-Cola as a lice remedy, nor could they provide any scientific reasoning why it would work:", "For what it is worth — nits on hair sold to wigmakers remain glued to that hair even after repeatedly being dipped in chemicals to remove all the color from the hair and [being] dyed again for a new wig. But nits remain stuck to the hair.  We don't know of anything that truly loosens the glue beyond the use of a physical method.", "The organization stated that the effectiveness of these methods, such as Coca-Cola, may only appear to work due to the determination of the parents:", "Many who try \"alternatives\" have already had failure with readily available pediculicides from the local drug stores. If there is success with such alternatives, we suspect that it may have to do with motivation and the \"parent power\" behind the effort rather than any particular pediculicidal or ovicidal property.", "Effective screening and combing is the ultimate complement to whatever course of action an individual selects. It is impossible to obtain independent scientific data as to the effectiveness and safety on many of the different ideas being circulated about \"natural\" remedies. Ultimately, it will always be the \"parent power\" behind the effort that makes the difference.", "Coca-Cola is not an officially endorsed product for removing head lice, and while some people may have found the beverage to be seemingly effective on an individual basis, there is no evidence that this is a reliable method of lice removal.  If you're trying to get rid of your nits, it's probably best to stick to the tried-and-true methods: a lice comb, medicated shampoo, and patience.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]