["By Saranac Hale Spencer", "Posted on June 7, 2019", "A video clip of a July 2018 rally in support of President Donald Trump has gone viral with the false claim that it is from his June 2019 trip to London. The posts wrongly accuse the media of ignoring the year-old rally to make the president look bad.", "The day after President Donald Trump left London following his three-day visit in the summer of 2018, there was a pro-Trump rally in the city that merged with a separate rally supporting a jailed British anti-Muslim activist who goes by the name Tommy Robinson.", "A video clip of that combined rally — in which the crowd chants “we love Trump” after being prompted by British right-wing activist Raheem Kassam — has been circulating online recently with captions wrongly suggesting that it happened during Trump’s June 2019 visit to London.", "A video uploaded to YouTube in July 2018 by a Russian-owned broadcasting agency shows several hours of the rally, including the chant that was used in the shortened clip.", "One version of the 38-second clip that has been viewed more than 1.4 million times on Facebook was posted with a caption that says: “Massive crowd in the UK chants ‘We Love Trump’ (that’s funny, every report i see on TV has the SAME anti-Trump video and NOTHING about this pro-Trump video).” Another version that was posted on June 4 — the second day of Trump’s visit in 2019 — says: “This massive pro-Trump rally happened today but the mainstream media won’t report on it.”", "But that’s not true. The rally shown in the clip happened on July 14, 2018, and it was reported on at the time.", "The viral post echoes Trump’s complaint about the media coverage during his most recent London trip. The president said he saw “thousands of people on the streets cheering” and only a “small protest,” when in fact there were thousands of anti-Trump protesters. As we wrote, president falsely called the media coverage of the protests “fake news.”", "There were Trump supporters among the crowd of protesters during Trump’s recent state visit. One Trump supporter had a milkshake thrown on him, another pierced a cartoon blimp depicting Trump, and a group of about 20 were shuffled into a pub by police separating them from the crowd of people protesting Trump’s visit.", "Estimates of the crowd size during the June 4, 2019, protest ranged from 10,000 to 75,000, although there hasn’t been an official count. London’s Metropolitan Police said there were more than 3,000 police officers assigned to patrol the scene that day.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "U.S. Embassy & Consulates in the United Kingdom. Visits of Presidents of the United States to the United Kingdom. Accessed 6 Jun 2019.", "Remarks by President Trump and Prime Minister May in Joint Press Conference. The White House. 4 Jun 2019.", "Gore, D’Angelo. “Anti-Trump Protests in London Not ‘Fake News.’” FactCheck.org. 5 Jun 2019.", "Metropolitan Police (@MetPoliceEvents). “Whilst this is a significant operation and 3,182 officers are committed to the visit of President Trump today, it is business as usual across London.” Twitter. 4 Jun 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]