["By Eugene Kiely", "Posted on March 2, 2020", "In recent interviews, former Vice President Joe Biden acknowledged that he was wrong to say he was “arrested” while trying to visit Nelson Mandela in South Africa. He was actually “stopped” and briefly “detained,” Biden said.", "“I guess I wasn’t arrested, I was stopped,” Biden told CNN on Feb. 28. Similarly, Biden told “Fox News Sunday” host Chris Wallace in an interview March 1: “I guess I should have said, I was detained.”", "As the New York Times first reported on Feb. 21, Biden said on at least three occasions that he had been “arrested” in Soweto while trying to see Mandela on Robben Island, where the future leader of South Africa had been imprisoned from 1964 to 1982. Mandela spent another eight years in prison after he left Robben Island before he was finally freed in 1990.", "In Columbia, South Carolina on Feb. 11, Biden claimed that as a senator he had been arrested along with the U.S. ambassador to the United Nations.", "Biden, Feb. 11: This day, 30 years ago, Nelson Mandela walked out of prison and entered into discussions about apartheid. I had the great honor of meeting him. I had the great honor of being arrested with our U.N. ambassador on the streets of Soweto trying to get to see him on Robbens Island.", "The New York Times noted that Biden — who mistakenly called the prison “Robbens Island, instead of Robben Island — made a reference to being “arrested” two more times.", "During a campaign stop on Feb. 18 in Las Vegas, Biden told the story of how he proposed to his wife, Jill, immediately upon returning from South Africa, going straight from the Philadelphia airport to her apartment in Wilmington, Delaware.", "Biden, Feb. 18: I came back from South Africa trying to see Nelson Mandela and getting arrested for trying to see him on Robbens Island. He was in prison. And when I came back, first thing I did, I landed in Philadelphia, and I went back to her apartment, which was in Wilmington Delaware. She was teaching.", "Biden proposed to his wife in 1977, the Times story said. Andrew Young, who was the U.S. ambassador to the United Nations from 1977 to 1979, told the Times that he had traveled with Biden to South Africa but “I was never arrested and I don’t think he was, either.”", "We asked the Biden campaign to clarify Biden’s remarks, but it did not respond to our request. It also did not respond to the New York Times. “Mr. Biden’s campaign did not respond to five efforts to seek comment and clarification,” the Times wrote.", "However, Biden did address it on CNN’s “New Day” on Feb. 28 — one day before his big victory in South Carolina’s Democratic presidential primary — and then again on “Fox News Sunday” on March 1.", "On CNN, Biden said upon landing in South Africa he refused to take the whites-only entrance, because he would have been separated from African American members of the congressional delegation. As a result, he said he was “stopped” — but not arrested.", "Biden, Feb. 28: And here’s the deal, I was with a black delegation, the CBC, the Congressional Black Caucus. They had me get off a plane. The Afrikaners got on in their short pants and their guns, let me off for — led me off first and moved me in a direction totally different. I turned around and everybody — the entire black delegation was going another way. I said, I’m not going to go in that door that says white only. I’m going with them. They said, you’re not. You can’t move.", "You can’t go with them. And they — and they kept me there until finally I decided they were clear I wasn’t going to move. And so what they finally did, they said, OK, they’ll not going to make the congressional delegation go through the black door. They’re not going to make me go through the white door. They went — took us out — if my memory serves me, through a baggage claim area up to a restaurant and they cleared out a restaurant.", "I felt strongly about apartheid. One of the reasons we were there. And after — long after this, when Nelson Mandela was freed and came to the United States, he came in my office. He was one of the most incredible men I ever met. He sat down in my office and thanked me — thanked me for trying to — all the work I did on apartheid.", "And so that’s — that’s the context of it. When I said arrested, I meant I was not able to — I was not able to move. Cops, Afrikaners, would not let me go with them. Made me stay where I was. I guess I wasn’t arrested, I was stopped. I was not able to move where I wanted to go.", "Biden told a similar story on “Fox News Sunday.”", "Wallace, March 1: You now say you weren’t arrested and that it didn’t happen in Soweto. You were at the airport in Johannesburg and you were stopped from going through the door for blacks. I guess the question is, were you confused or were you just trying to embellish a story?", "Biden: No. No, what I was trying to — what I was doing was talking about the fact that I was strongly opposed to apartheid. When we landed and — we were going to Soweto actually. We landed in Johannesburg and the Afrikaners took me off the plane and took me into one direction, wanted me to go through a white-only door, and in fact, I wouldn’t move. I said everybody else is going through to another door, I’m going with the — with the black delegation that I came with.", "They said, no, you can’t. And I said, I’m staying here, I’m not going to move. And they would not let me move anywhere so I guess I should have said, I was — I was detained, I was not able to move forward. So what they finally did was they went out, and they cleared out a baggage claim area, took us all up through the baggage claim area, up through — cleared out a restaurant.", "Biden won South Carolina largely with the support of the black vote. The former vice president — who was boosted in South Carolina by the endorsement of Democratic Rep. James Clyburn — won 61% of the non-white votes, as reported by the Associated Press. Biden finished with 48% of the vote in South Carolina — nearly 30 points ahead of second-place finisher Sen. Bernie Sanders.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]