["Editor's Note:In a previously published version of this article, a word was missing in Deputy Secretary of State Jordan Fuchs’ comment about bringing a photo of a ballot to a taco stand. It has been restored.", "A man on the Parler social media app and a woman on Facebook posted the same photo of a Georgia ballot and alleged that their votes for Republican Sens. David Perdue and Kelly Loeffler in the Georgia runoff elections were flipped by a computer code printed on the ballot to the Democratic candidates, Jon Ossoff and Raphael Warnock.", "In addition to voting for the Senate candidates, whoever filled out the pictured ballot also picked Republican Lauren Bubba McDonald Jr. for the Georgia Public Service Commission.", "State election officials the USA TODAY Network spoke with on Thursday said the claim that the votes were flipped in the ballot’s QR code to the Democratic candidates is a not accurate.", "More:Fact check: These 5 election statistics do not discredit Joe Biden's victory", "The Parler post is from Dec. 19; the Facebook post is dated Dec. 30. The Parler account seems to indicate the user lives in the Buckhead area of Atlanta. The woman’s Facebook page says she lives in Baltimore.", "Both posts have the exact same words: “Here’s my Georgia Runoff Ballot. The Ballot says I voted for Loeffler and Perdue BUT the QR Code says I voted for Democrats. Scanned it into a Dominion Voting Machine. The SCAM is Real!” And they include the same image.", "The Parler post adds, “HERE’S YOUR PROOF, DEMONRATS!”", "The Parler user made a similar post on Nov. 30, with a photo of a ballot from the Nov. 3 general election. The words on the ballot say he voted for Republican President Donald Trump and other Republican candidates. The man claims the QR code says he voted for Democrat Joe Biden.", "USA TODAY reached out to the Facebook user about her post, which had been shared 630 times as of Saturday.", "More runoff election news:Judge rejects attempt to halt Georgia U.S. Senate runoff elections.", "The Georgia elections are operated by the Secretary of State office, which is headed by Republican Brad Raffensperger.", "The document in the photo appears to be a Georgia runoff election ballot printed by a Georgia voting machine, said Deputy Secretary Jordan Fuchs of the Georgia Secretary of State office and Gabriel Sterling, the state’s voting system implementation manager.", "In Georgia, in-person voters make their selections on a voting machine that then prints a paper ballot. The paper ballot has the names of the voter’s choices written on it plus a large QR code — a square-shaped pattern of dots that a computer scanner can read.", "The voter puts the ballot into a scanning machine, and the machine reads the QR code to count which candidates the voter chose. The paper ballot is then stored in a locked box and kept in case it’s needed for election audits and recounts.", "People who vote absentee by mail in Georgia use the more traditional ballot, on which they fill in bubbles next to the candidates’ names to mark their choices.", "The QR code has no candidate names written in its code, Sterling said. Instead, the code tells the counting machine which bubbles would have been filled in had the machine received a traditional paper ballot with bubbles.", "The QR code is encrypted, Sterling said. This prevents people from using commonly available cellphone apps to scan the code and see what it says, he said.", "For further security, Sterling said, the ballots are made with a special paper that has security fibers embedded in it, similar to the fibers embedded in paper money to prevent counterfeiting. During election audits, the ballots are checked for the fibers to verify no counterfeit ballots have been slipped into the machines, he said.", "More Senate news:Where Georgia Senate runoff candidates stand on climate issues.", "It appears that whoever made the ballot photo broke the law, Fuchs said, as it is illegal to take a photo of a ballot in the polling site. The law is to hinder vote buying.", "“You can’t take a photo of your ballot and, say, go to your favorite Republican taco stand and get a taco for your vote,” she said.", "Neither social media user explained what was seen on the ballot to indicate that the GOP votes were flipped to Democrats in the QR code.", "“She had a ballot — a picture of a ballot, which is illegal to have — saying that it’s telling her things that it has an inability to do,” Sterling said of the woman’s Facebook post. (When Sterling was interviewed on Thursday, the USA Today Network had not yet found the similar post.)", "“Every part of this is just wrong,” Sterling said.", "The claim that a QR code on a Georgia runoff ballot indicates votes for Republican candidates were switched to Democratic candidates is FALSE, based on our research. Georgia uses encrypted QR codes that cannot be read by cellphone apps, and there is nothing on the ballot to indicate votes were switched, according to a Georgia elections official.", "Paul Woolverton can be reached at pwoolverton@gannett.com and 910-261-4710.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here. https://offers.usatoday.com/specialoffer/", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more. https://www.poynter.org/ifcn/factchat/"]