["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There’s nothing to support the recurring claim that Oprah Winfrey is hiding an ankle monitor.", "In March 2020, after baseless allegations that Oprah Winfrey was under house arrest and wearing an ankle monitor started to spread on social media, the media powerhouse addressed the rumors on Twitter.", "\"Just got a phone call that my name is trending,\" she wrote nearly a year ago. \"And being trolled for some awful FAKE thing. It’s NOT TRUE. Haven’t been raided, or arrested. Just sanitizing and self distancing with the rest of the world.\"", "Following her interview with Meghan Markle and Prince Harry that aired on March 7, similar baseless allegations emerged.", "\"Oprah? Ankle monitor?\" reads the description in one of four images on Facebook that all draw attention to Winfrey’s footwear during the interview. In each photo, the left boot she was wearing is circled in red.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We watched clips of the interview and looked at still images. What some people are identifying as a hidden ankle monitor looks to us like a fold in Winfrey’s leather boot.", "Unfounded claims that powerful figures such as politicians and celebrities have been arrested are not new and they’re rooted in the QAnon conspiracy theory.", "There is no evidence to corroborate the claim that Winfrey was wearing an ankle monitor in the interview.", "We rate this post Pants on Fire.", "Facebook post, March 8, 2021", "PolitiFact, Bogus conspiracy about Obama, others wearing house arrest monitors spreads online, June 18, 2020", "Oprah Winfrey tweet, March 18, 2020", "CNN, Meghan: I didn’t want to be alive anymore, March 8, 2021", "Oprah Winfrey Instagram post, March 7, 2021", "Independent, Oprah targeted by bizarre QAnon conspiracy theory after Harry and Meghan interview broadcast, March 8, 2021", "Newsweek, QAnon supporters think Oprah was wearing ankle monitor during Meghan Markle interview, March 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]