["भारतीय मुद्रा प्रिंटिंग प्रेस में डेपुटी कन्टृॏल ऑफिसर , प्रतिदिन अपने जूतों में छुपाकर नोटों की गड्डियों को चुराकर ले जाता था। Cisf वालों ने पकड़ लिया और उसके घर से दस हजार करोड़ रुपए बरामद किया। (Deputy control officer in the official printing press would hide currency notes in his shoes and smuggle them out. He was caught by CISF personnel and Rs.10,000 crore was seized from his house- translation).", "Along with the above message, a set of videos has gone viral on social media. In one of the video clips, a person is seen apprehended by uniformed personnel. Also can be seen in this video clip is a wooden box containing currency notes.", "भारतीय मुद्रा प्रिंटिंग प्रेस में डेपुटी कन्टृॏल ऑफिसर , प्रतिदिन अपने जूतों में छुपाकर नोटों की गड्डियों को चुराकर ले जाता था। Cisf वालों ने पकड़ लिया और उसके घर से दस हजार करोड़ रुपए बरामद किया।", "Posted by सुबोध गिरी जी on Monday, September 23, 2019", "In another video, shot from the top of a building, the uniformed personnel can be seen retrieving a large, steel box from the premises of a building on the other side of the street. Two other video clips depict the scene inside the premises with the officer and the security personnel.", "These video clips have been posted by several individual users and some groups on Facebook. They have also found their way to Twitter.", "The incident in question, as depicted in the videos, did indeed occur but the news is old. Alt News searched Google with the keywords ‘Deputy Control officer CISF‘ and came across several news reports from January 2018. Manohar Verma, Deputy Control officer at the Bank Note Press in Dewas, Madhya Pradesh was apprehended by CISF personnel for stealing freshly minted currency notes by concealing them inside his shoes. A total of more than Rs 90 lakh was seized in subsequent raids at the premises of the officer.", "Moreover, Alt News found that these videos of the incident too were posted online in 2018. It may be noted Alt News could not independently ascertain that the particular video clip, shot outdoors from the top of the building and shared along with the other videos, pertains to the same incident. These video clips were circulated in 2018 as well.", "A video report by India TV regarding the incident is posted below.", "A video from January 2018, regarding theft inside a government mint in Madhya Pradesh, has now gone viral on social media. It may be noted that the incident is not recent.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]