["The video was published here on Twitter on December 17, 2020.", "It has been viewed more than 8,900 times.", "The post’s caption, written in simplified Chinese characters, translates to English as: “Down with the stinky McConnell and his wife Elaine Chao. / Those who do not support or praise the great leader Trump are all Communist spies and public enemies of the US nationals.”", "Mitch McConnell is a Senate Majority Leader of the United States and husband of Elaine Chao, the Secretary of Transportation of the US.", "McConnell acknowledged Biden’s victory on December 15, 2020 in the 2020 US presidential election, as reported here by AFP.", "The video was also viewed tens of thousands of times here, here and here on Twitter, and on Facebook here and here alongside a similar claim.", "But the video was shared in a misleading context.", "A keyword search on Weibo found the same footage as the Twitter video published by We Video, a video channel of Chinese state-owned newspaper Beijing News. The dateline is October 23, 2018.", "Below are two screenshot comparisons between the Twitter video (L) and the footage published by We Video (R):", "The Weibo video’s caption, also in simplified Chinese characters, translates partly as: “[US Transportation Secretary Elaine Chao and husband confronted in restaurant: Get out of the United States] On October 19, the US Transportation Secretary Elain Chao and her husband (Senate Majority Leader) were confronted during a meal: Why don’t you leave our entire country? The protester yelled at them.”", "The 2018 confrontation with images of the same scene was also reported by media outlets such as here by HK newspaper Wen Wei Po; here by Chinese state newspaper Reference News; here by US television broadcaster CNN; and by US newspaper The Hill here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]