["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ohio honors citizens who give their lives in military service for their country with the Ohio Military Medal of Distinction.\n\nThe medals are presented to family members of fallen service members during a joint session of the General Assembly. The day also includes a memorial program that includes remarks from the governor and a wreath laying ceremony.\n\nOn May 21, 2013, the General Assembly presented medals to families of 16 fallen service members.\n\nIn his remarks, Senate President Keith Faber noted that Ohioans have always served on the front lines \"to preserve and protect our freedoms.\"\n\nHe particularly noted Ohio’s service during the American Civil War.\n\"During the Civil War, more than 300,000 Ohioans served in the Union Army, more per capita than any other state.\"\n\nPolitiFact Ohio knew that Ohio has a deep history of service in the Civil War, and asked Faber for support of his claim.\n\nHis staff referred us to data from the Ohio Historical Society, a nonprofit organization, partially funded by the state, that champions and preserves Ohio history. It maintains, by law, the state archives of Ohio.\n\nAs part of its commemoration of the sesquicentennial of the Civil War, the historical society published an article that discussed Ohio’s war effort.\n\n\"Although most of the American Civil War was fought outside of Ohio’s borders, the Buckeye State played a huge role in determining the outcome,\" the article notes. \"Between 319,000 and 330,000 Ohioans served in the Northern army for varying lengths of time.\"\n\nThe level of recruits, according to the Historical Society, was more per capita than any other state.\n\n\"Three out of every five Ohio men between the ages of 18 and 45 served at various times in the Union Army and Navy during the Civil War. Ohio men fought in every major battle of the war.\"\n\nIn all, almost 3 million men served in the Union army during what remains the bloodiest military conflict in American history, according to the U.S. Army Center of Military History. Nearly 360,000 federal troops were killed during the war. About 160,000 Confederate soldiers perished.\n\nPolitiFact Ohio checked the historical society’s Civil War pages and found other notable points from Ohio’s role in the Civil War:", "The Ohio Channel, Joint Legislative Session: Presentation of the Ohio Military Medal of Distinction,  May 21, 2013", "The (Canton) Repository via CantonRep.com, \"Our Civil War -- a house divided in Ohio, too,\" article by the Ohio Historical Society,\" April 11, 2011", "Ohio History Central, American Civil War, site researched and maintained by the Ohio Historical Society", "Ohio Historical Society Collections Blog, \"Ohio in the Civil War: Interesting Facts,\" April 16, 2011", "Ohio Historical Society, Online Relic Room: Flags by Heroes Borne, Civil War Room", "Ohio Historical Society, About OHS", "U.S. Army Center of Military History, Civil War Research and Commemoration", "CivilWar.net, Union Troops furnished and losses", "Springfield News-Sun, Ohio Military Medal of Distinction Ceremony, May 21, 2013", "The Columbus Dispatch, \"Statehouse ceremony remembers fallen soldiers from Ohio,\" May 22, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]