["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Alicia Menendez appeared on ABC's \"This Week\" on April 27, 2014.", "ABC’s This Week spent much of their show Sunday discussing race issues, from affirmative action to racist comments allegedly made by Los Angeles Clippers owner Donald Sterling to economic disparity.", "During a roundtable segment on the difference between the middle class in the United States and Canada, Fusion reporter Alicia Menendez argued that differences in wealth aren’t just generational, they’re racial.", "\"We also know that there is a racial component to this, that a white family is likely to have about six times as much wealth than a black or Hispanic family coming out of the recession,\" she said.", "PunditFact finds her ratio correct.", "Menendez pointed us to an April 2013 report from the Urban Institute, a nonpartisan social policy think-tank. The institute measured mean wealth by race. Using 2010 data from the Survey of Consumer Finances, the Urban Institute looked at assets including cash savings, homes, retirement accounts and subtracted any debt.", "The Urban Institute concluded that, post-recession, for every $1 an average black or Hispanic person has in wealth, an average white person has $6. That’s up from 1983, the farthest back the study goes, when the ratio was 5-to-1.", "Thomas Shapiro, a Brandeis University social policy professor who studies the wage gap, said the 6-to-1 ratio is correct, but represents the lower end of the wealth gap range researchers have come up with.", "At the higher end of the spectrum, Pew Research cited a 20-to-1 ratio in 2011. They took median wealth from the Census Bureau’s Survey of Income and Program Participation 2009 data. So the data varies by survey used, year and measure of average (mean vs median).", "There’s debate among economists and social scientists about which ratio is the most accurate. Darrick Hamilton, an urban policy professor at The New School, said the Census Bureau surveys more low-income families, while the Survey of Consumer Finances oversamples high-income families where minorities aren’t as well represented.", "Overall, any ratio from 6-to-1 to 22-to-1 could be considered an accurate measure of the wealth gap, Shapiro told us.", "Our ruling", "Menendez said, \"A white family is likely to have about six times as much wealth than a black or Hispanic family coming out of the recession.\" A study from the Urban Institute supports her statistic. Other research shows an even wider gap, further proving her point that race is a factor in U.S. wealth.", "Menendez's statement is accurate, and might even understate the issue. We rate her claim True.", "CNNMoney, \"Worsening wealth inequality by race,\" June 21, 2012", "Email interview with Alicia Menendez, Fusion reporter, April 27, 2014", "Email interview with Darrick Hamilton, The New School urban policy professor, April 27, 2014", "Email interview with David Grusky, Stanford Center on Poverty and Inequality director, April 27, 2014", "Email interview with Thomas Shapiro, Brandeis University social policy professor, April 27, 2014", "New York Times, \"Wealth gap among races has widened since recession,\" April 28, 2014", "Pew Research, \"Wealth gaps rise to record highs between whites, blacks, Hispanics,\" July 26, 2011", "Stanford Center on Poverty and Inequality, \"State of the Union,\" 2014", "Urban Institute, \"Demystifying the changing wealth of Americans numbers,\" accessed April 27, 2014", "Urban Institute, \"Less than equal: Racial disparities in wealth accumulation,\" April 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]