["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic Congressman Ron Klein has gone on the offensive in his campaign against Republican retired Army Lt. Col. Allen West -- whose $2 million war chest and national media attention have turned the race into one of the hottest Congressional contests in Florida. Klein represents a swing Congressional district that spans parts of Broward and Palm Beach counties.Klein wants to capitalize on voters' anger about the BP spill and hammers West in a June 28 fundraising e-mail. The bulk of his e-mail with the subject line \"Apologize to BP?!\" relates to West's stance on the oil spill and his connection to Congressman Joe Barton, the Texas Republican facing heat after apologizing to BP and calling Obama's demand for the escrow account a \"shakedown.\"\"In short, while sheets of oil are washing up today on Pensacola Beach, he’s more concerned with BP’s profits than the livelihood of fishermen, restaurateurs, or those that depend on FL tourism...,\" Klein wrote about his opponent West. \"Barton called the Obama administration’s push for BP to set up a $20 billion account - a fund that would ultimately help pay for clean up and damages and wages for those who are losing their livelihood - a 'shakedown.' Most Republicans have made it very clear that Barton’s actions were unacceptable. Not Allen West. A continuing supporter of offshore drilling, West’s campaign is now aligned with those who would apparently give BP a pass. Thus far, the most radical Tea Partiers have taken a liking to West and what he stands for. They also haven’t been shy in contributing to his cause. West has raised $2 million from those that would leave our beaches in ruins, end Social Security and Medicare, and give corporations free reign.\" There are a lot of strong statements in Klein's letter that we could have chosen to fact-check. But we particularly thought that last sentence was a biting claim, and we don't mean the usual spelling of \"free rein.\" Note Klein didn't say that West would ruin Florida's beaches, end Social Security and Medicare, and give corporations free rein -- he said that $2 million in donations to West came from donors who held those views. For this Truth-O-Meter we wanted to explore whether \"West has raised $2 million from those that would leave our beaches in ruins, end Social Security and Medicare, and give corporations free reign.\"We contacted Klein's campaign and asked for documentation to support their claim. Campaign spokeswoman Sarah Rothschild sent us about two dozen citations for news articles and web sites that relate to West and his donors, but she declined to define what Klein meant by \"give corporations free reign.\" We looked at most of their citations, focusing on BP and Rep. Joe Barton since that was the point of Klein's e-mail, and we break the other donors down by topic below.First, we confirmed that West had raised $2,065,855 million, according to the Center for Responsive Politics. It's not logical to assume that every one those donors would ruin the beaches and end Medicare and Social Security. We found a few tenuous connections to those issues among a small handful of donors but not enough for a blanket statement.Congressman Joe BartonWest got $1,000 from Rep. Joe Barton's Texas Freedom Fund PAC on March 3, 2010, FEC reports show. On June 17 at a Congressional hearing on BP, Barton, the ranking member of the House Committee on Energy and Commerce, defended BP. The Wasington Post's Right Now blog reported that Barton said: \"It is a tragedy of the first proportion that a private corporation can be subjected to what I would characterize as a shakedown, in this case a $20 billion shakedown.\"Later the same day, Barton apologized for his apology after Republican leaders threatened to take away his committee leadership position.The Tampa Tribune reported June 25 that West about a week earlier had also raised concerns about the BP escrow account at a business luncheon in Palm Beach Gardens. \"West said that while he was 'angry with BP' for the spill, 'when you have an executive branch that goes to a private sector business and takes their private equity funds and demands that they put it into an escrow account, something is upside down in this country. That is a very dangerous precedent that we establish.'\" Even though West may not like the way the restitution happened, the Freedom Fund donation came about a month before the Gulf oil well blowout.So we moved on to the other citations Klein's camp sent us.Oil and gas, banks", "The PACsNext, we looked at political action committees, some of them set up by controversial public officials:", "Clearly, West has taken money from at least a few donors that have either been sympathetic to BP, in favor of massive cuts to Social Security and Medicare or affiliated with corporations that have been accused of wrongdoing. But that's not what Klein's campaign said.", "Klein's fundraising e-mail said: \"West has raised $2 million from those that would leave our beaches in ruins, end Social Security and Medicare and give corporations free reign.\" The donors the Klein campaign cited added up to about $25,000 -- only a sliver of his $2 million campaign. The West campaign could cherrypick too and likely find negative headlines about some of Klein's donors -- including BP in previous election cycles. But we don't think that we can draw conclusions about all of Klein's donors based on his BP donations. Similarily, there is no way Klein would know the viewpoints of all of West's donors unless he researched all of their views on these topics -- an impossible endeavor. We rate this claim False.", "Ron Klein campaign, Fundraising email, June 28Interview, Ron Klein campaign spokeswoman Sarah Rothschild, June 28-30Interview, Allen West campaign manager Josh Grodin, June 28-30, 2010ABC News, \"Caught on Tape: Bank Parties on After Bailout,\" Feb. 24, 2009The Tampa Tribune, \"Florida candidates will keep money from Texan who apologized to BP,\" June 25, 2010The Atlantic, \"Paul Ryan's Shocking Budget Proposal,\" Feb. 2, 2010The Washington Post, \"Rep. Paul Ryan's daring budget proposal,\" Feb. 1, 2010 The New York Times, \"Rerpublicans and Medicare,\" Feb. 11, 2010Politico, \"Dick Armey calls Medicare 'Tyranny,'\"Aug. 16, 2009Washington Post Right Now blog, \"Joe Barton's apology and a potential GOP trap,\"June 17, 2010 Fox News, \"Palin Addresses Obama's handling of oil spill crisis, her political influence ... and Yes that implant rumor,\" June 12, 2010 Sarah Palin, Tweet, June 20, 2010Center for Responsive Politics, Ron Klein/Allen West fundraising summary, June 30, 2010Center for Responsive Politics, BP donations 2006 cycle, June 30, 2010Center for Responsive Politics, BP donations 2008 cycle, June 30, 2010Federal Election Commission, Torchmark contributions, June 30, 2010Federal Election Commission, Texas Freedom Fund contributions, June 30, 2010Federal Election Commission, Prosperity PAC, June 30, 2010Federal Election Commission, Freedomworks PAC, June 30, 2010Federal Election Commission, Palin PAC, June 30, 2010American Association for Justice, \"The Ten Worst Insurance Companies in America,\" July 2008U.S. Congressman Paul Ryan, \"A Roadmap for America's Future,\" June 30, 2010Freedomworks website, June 30, 2010Freedomworks website, Allen West fundraiser, March 22, 2010Freedomworks press release, \"FreedomWorks PAC and Chairman Dick Armey Endorse Allen West, Candidate for U.S. House of Representatives in Florida's 22nd District,\"Feb. 8, 2010 Freedomworks, Position on Social Security, June 30, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]