["By Eugene Kiely", "Posted on January 25, 2018", "President Donald Trump and White House counselor Kellyanne Conway have been boasting lately about the increase in the number of women employees on the president’s watch as a sign of economic progress. But this is a misleading talking point.", "It’s true that 863,000 women joined the workforce during the president’s first 11 months in office, according to the Bureau of Labor Statistics. But that’s 34 percent less than the number of women workers that were added over the same period, from January to December, in each of the last two years.", "In fact, it’s the smallest increase since 2012 and below the historical norm for the past 54 years, dating to 1964.", "During a women’s event at the White House earlier this month, Trump said his administration is making “incredible progress.” The president said he is “very proud” that “on my watch” there are “more women in the workforce today than ever before.”", "Trump, Jan. 16: We’re making incredible progress. The women’s unemployment rate hit the lowest level that it’s been in 17 years. Well, that’s something. And women in the workforce reached a record high. More women in the workforce today than ever before. That’s really terrific, and especially since it’s on my watch. I feel very proud of that.", "Conway repeated those talking points during an interview with CNN’s Chris Cuomo on Jan. 22, a day after the Women’s March.", "Cuomo asked if the president had insulted the marchers and made “a joke out of their march” when he tweeted that women should march to “celebrate the historic milestones and unprecedented economic success and wealth creation that has taken place over the last 12 months.” Conway disagreed.", "“It’s no joke that the women’s unemployment rate is the lowest in 17 years,” Conway replied. “It is no joke that over a half a million new women entered the workforce on his watch.”", "Let’s put these claims into context, because there’s less here than meets the eye.", "First, the women’s unemployment rate — and the unemployment rate in general — has been trending down for several years. The women’s rate had reached a 10-year low of 4.5 percent under President Barack Obama in December 2016. That rate dropped under Trump to 4.0 percent in December, the lowest since November 2000. That’s a 17-year low, as Trump and Conway said.", "As for the number of women employees, there were nearly 73 million women workers as of December — which is indeed “more women in the workforce than ever before,” as Trump said. But, as the U.S. population grows, that statement can be made almost every year.", "In only five of the last 54 years has the number of women in the workforce declined from the previous year, and those were all during or following recessions (1982, 2001-2002, and 2008-2009). The chart below shows the nearly relentless climb in the number of women in the workforce at the end of each year since 1964.", "And, while the number of women workers increased under Trump, the labor participation rate for women remained unchanged after 11 months at 56.9 percent in December. (That’s the percentage of all women 16 years and older working or actively seeking work.)", "How many women joined the workforce under Trump?", "Conway said that “over a half a million new women entered the workforce on his watch.” That’s right, too, but entirely without context.", "Under Trump, the number of women employees grew by 863,000 — a 1.2 percent increase since January. (For Trump, we measure the change between January’s number and December’s number, because BLS conducts its monthly employment survey during the week that includes the 12th day. Trump took office Jan. 20, 2017, so Obama was president when the January survey was taken.)", "But that increase was the smallest 11-month gain since 2012, when the number of women workers increased by 816,000, or 1.2 percent. It was also 34 percent lower than the 1.3 million women workers that were added in each of the last 11 months in 2015 and 2016.", "The 863,000 increase in women workers in Trump’s first 11 months is also below the historical norm. The average increase over the last 54 years, from 1964 to 2017, was 936,000, when measured for the 11-month period of January to December. The median (midpoint) was an increase of 1,045,000.", "The chart above shows the change in the number of women employees from January to December of each year since 1964, based on BLS monthly data.", "The 863,000 increase under Trump ranked 33rd highest in the last 54 years.", "FactCheck.org Rating:", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]