["Several images are floating on social media as ‘first photographs of Earth take by Chandrayaan-2’. “चंद्रयान-2 ने खींची पृथ्वी माँ की पहली फ़ोटो। आप भी देखिए और निहाल हो जाइए कि हम ब्रम्हाण्ड के कितने अद्भुत स्थल पर रहते हैं। (First photographs of Earth clicked by Chandrayaan-2. You can also see that we live in such an incredible place in the universe.)” – wrote a user while posting the images on the Facebook group ‘Chirkut baba ke crazy vachan Group.’ Her post was liked 5,500 times and shared 3,300 times at the time of writing.", "Alt News found that all the images shared were either old and digitally created thus do not represent images transmitted by the Indian spacecraft.", "This image was uploaded by NASA in 2008 and is captioned as ‘animation’.", "In another related article, NASA described it as, “artist’s concept of a substorm.”", "The image below was found on a website that described it as – “Space wallpapers HD for Android.”", "The third image was found uploaded by a website in 2012 as ‘iPhone wallpapers’.", "This is a poster from the 2009 Nicolas Cage movie ‘KNOWING’.", "We found this image on a 2004 blog- 3D wallpapers for Windows phone.", "Similar misinformation was circulated when after Chandrayaan-2 was launched in July. Alt News’s earlier fact-check can be read here.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]