["About this rating", "A small number of swabs had to be destroyed after U.S. President Donald Trump visited a medical manufacturer in Maine in June 2020 during the coronavirus pandemic.", "However, the company said that it only destroyed products involved in a 15-minute demonstration, not a full days' worth of production, and that the swabs were destroyed due to the amount of people in the factory, not Trump's refusal to wear a mask. The company also said it had planned the destruction of the swabs prior to Trump's visit and moved that day's production to the weekend.", "In June 2020, U.S. President Donald Trump visited Maine medical supplies manufacturer Puritan Medical Products, which was producing swabs to deal with the coronavirus pandemic. When it was revealed that this company had destroyed swabs shortly after Trump's visit, many people laid the blame on the president's refusal to wear a mask during the visit:", "Some social media users also appeared to be under the impression that an \"entire day's worth\" of swabs had to be destroyed after Trump's visit. But that wasn't the case.", "During the visit, the company gave a 15-minute demonstration of the manufacturing process, after which the swabs involved in the demonstration were destroyed.", "Puritan Medical Products explained that the company had planned to destroy the supplies prior to Trump's visit, that the products were destroyed due to the number of people in the facility at the time — not Trump's refusal to wear a mask — and that the bulk of production had been moved to the weekend in order to maintain the company's schedule.", "On June 9, 2020, Puritan Medical Products released the following statement:", "For the past several months, the Puritan Medical Products team has been working relentlessly to produce the swabs necessary for COVID-19 testing. We were glad to have the opportunity for our role in addressing the global health pandemic be recognized by the resident and other senior government officials.", "Due to the number of individuals (officials, security personal, and media) participating in the visit, we made the decision in advance that we would not use any of the product manufactured during the visit. Production was limited on selected machines to a reduced 15-minute demonstration period during which the President was actively touring our manufacturing floor. In addition, after the visit we conducted the type of full facility cleaning tha twas necessary. It is also worth noting that all COVID-19 testing swabs are sterilized after production.", "In anticipation of the visit, we shifted Friday's daily production schedule to the weekend, which allowed for no production loss. We are grateful for the hard work of our team -they have been quiet heroes.", "Gregorian, Dareh.   \"Trump Wears Mask with Presidential Seal During Part of Ford Plant Tour.\"  \r\n  NBC News.   22 March 2020.", "WMTW.   \"Puritan Medical Products Clarifies Swab Disposal After President Trump's Visit to Maine.\"\r\n    10 June 2020.", "Fritze, John and Michael Collins.   \"As Trump Touts Increased Production, Coronavirus Swabs Made During His Maine Factory Tour Will be Tossed in the Trash.\"\r\n    USA Today.   5 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]