["“Beautiful scenes in Washington DC for the million MAGA march,” a Facebook user wrote, while another commented, “I’ve never seen this many people in one big crowd in DC to support OUR PRESIDENT Donald J Trump!” -- a reference to the pro-Trump rally organized in the city on November 14, 2020. The posts shared multiple aerial photos of densely packed crowds in an urban environment.", "Other examples of the claim can be found on Facebook here and here.", "After conducting a reverse image search, AFP Fact Check found the photos were not from Saturday’s march.", "The images have circulated online since June 2016 after more than one million fans gathered to celebrate the historic triumph of the Cleveland Cavaliers in the NBA Finals. Led by local hero LeBron James, fans in the US state of Ohio came out in force as the win ended a major title drought that had haunted Cleveland since 1964.", "One image (included top left in the example above) was shared on Twitter on June 22, 2016 by the Cavaliers’ verified account.", "Another 2016 image (bottom left) is credited to Tom Withers of the Associated Press, while a third (top right) is credited to Aaron Josefczyk of Reuters.", "But the images from Cleveland were not the only ones misused in posts about the “Million MAGA March.”", "A photo album posted by a Facebook user the day after the rally also included several out-of-context pictures.", "One is an image of the Toronto Raptors parade from June 2019 in Toronto, Canada. The post also included a screenshot of crowds celebrating the Kansas City Royals World Series win from 2015, which aired on local TV; two photos -- respectively taken in DC and in Los Angeles, California -- of the Women's March held the day after Trump's inauguration in January 2017; and a picture from the March for Our Lives rally to protest gun violence in America, from March 2018.", "In another example, the comparison below shows an exact match between an image shared on Facebook with the caption “Million MAGA March” and an original AFP photo, taken on October 16, 1995 by Richard Ellis from the US Capitol Building. Ellis photographed the \"Million Man March\" in Washington DC -- when hundreds of thousands of Black men gathered at the National Mall aiming to empower their community.", "This post used a screenshot of footage aired by British television news channel Sky News in October 2018, of people in London protesting Brexit. This is shown in the top photo below, and was similarly misused in these posts here, here, here and here.", "During the pro-Trump rally at least 10,000 die-hard Trump supporters -- few wearing masks -- massed on DC’s Freedom Plaza before marching to the Supreme Court in an atmosphere reminiscent of a Trump campaign event.", "The crowd size was once again a source of debate on social media. While most news organizations reported several thousand people attended the event, some in Trump’s team, including White House Press Secretary Kayleigh McEnany, claimed it attracted more than one million people.", "The city’s police department has not released any crowd estimates.", "The Republican incumbent is sticking to discredited claims of election fraud and repeatedly insists he defeated President-elect Joe Biden in the November 3 vote.", "AFP Fact Check has debunked numerous false claims of widespread election fraud and all fact-checks related to the 2020 US election are available in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]