["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Game show host-turned-conservative pundit Chuck Woolery appeared to rehash a nearly decade-old falsehood about House Speaker Nancy Pelosi, D-Calif., racking up outsize bar tabs on taxpayer dollars while shuttling between Washington and California.", "Pelosi’s air travel did make headlines recently — but not for the reason Woolery suggested.", "The House Speaker was planning to travel to Belgium and Afghanistan on military aircraft, when President Donald Trump canceled her trip, requesting she remain in Washington to negotiate an end to the government shutdown.", "Woolery posted his tweet the same day Trump denied Pelosi the use of military aircraft.", "\"Nancy Pelosi's bill for alcohol on her flights from Washington to San Fran every week? We pay for it,\" Woolery tweeted Jan. 17. \"1000 dollars. On average 52,000 Bucks, a year for BOOZE. Tax payer money.\"", "We found zero evidence to back up this claim. Furthermore, the congresswoman doesn’t drink, Pelosi’s office said.", "Woolery’s claim sounded strikingly similar to a previous statement we checked in 2010, in which onetime presidential candidate Michele Bachmann accused Pelosi of spending $100,000 on alcohol for flights — which we rated Pants on Fire.", "The original source of Bachmann's allegation was a large collection of documents obtained through the Freedom of Information Act by Judicial Watch, a conservative group that litigates on public corruption and other issues. A spokesman for Woolery sent us the same set of documents when we asked for evidence.", "But in neither case do they back up the speakers’ assertions.", "In a 2010 press release summarizing the findings, Judicial Watch wrote that \"the Speaker’s military travel cost the United States Air Force $2,100,744.59 over a two-year period — $101,429.14 of which was for in-flight expenses, including food and alcohol.\" (This covered both domestic and international travel.)", "In Bachmann's case, she cited a figure for alcohol expenditures that was close to a much larger number — $101,429 — for all non-plane costs of the trip. It’s unclear how Woolery came up with his $52,000 annual figure. Neither is correct.", "Pelosi’s office told us in 2010 — and reiterated for this check — that she \"does not drink alcohol.\" An aide added that she no longer takes weekly flights via military aircraft, a once-common practice that has since been phased out. She now travels commercial between Washington and California.", "Woolery said, \"Nancy Pelosi's bill for alcohol on her flights from Washington to San Fran every week? We pay for it. 1000 dollars. On average 52,000 Bucks, a year for BOOZE. Tax payer money.\"", "We couldn’t find any evidence to support Woolery’s claim, which was strikingly similar to a falsehood about Pelosi’s bar tab from 2010 that we rated Pants on Fire. Furthermore, her office says that she doesn’t drink.", "We rate this Pants on Fire.", "Update: This report was updated shortly after publication to include a response from Woolery's spokesperson.", "Tweet by Chuck Woolery, Jan. 17, 2019", "PolitiFact, \"Michele Bachmann accuses Nancy Pelosi of spending $100,000 on alcohol for flights,\" Sept. 21, 2010", "Email interview with Jill Farrell, spokesperson for Judicial Watch, Jan. 22, 2019", "Interview with Drew Hammill, an aide to Rep. Nancy Pelosi, D-Calif., Jan. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]