["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mississippi Gov. Tate Reeves has warned of unemployment fraud related to COVID-19 in the state. Federal authorities have said such fraud has spiked.", "We found no evidence that Mississippi has secured or executed 10,145 warrants of any kind related to that unemployment fraud.", "Widespread Facebook posts suggest that states are preparing to crack down on unemployment fraud. But the posts cite numbers that are more specific than what’s publicly available.", "\"Mississippi got 10,145 warrants for unemployment fraud!!\" said one Facebook post uploaded July 26 and since deleted. \"Y’all better make sure it ain’t you.\"", "The post and several others like it were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Nearly identical posts made related claims — and warned in some cases of the same exact number of issued warrants — about Georgia, Alabama and other places.", "Are the claims about Mississippi accurate? State officials have sounded the alarm about a rise in unemployment fraud as a lot more people seek unemployment assistance amid the ongoing coronavirus pandemic. But we did not find proof that the cited figure is accurate.", "Federal authorities have warned about fraud related to the flood of Americans filing for unemployment since the coronavirus outbreak. The FBI said in a July 6 statement that it had seen a \"spike\" in such cases \"involving the use of stolen personally identifiable information.\"", "\"Unemployment systems across the country are being attacked with false claims,\" said Mississippi Gov. Tate Reeves, a Republican, in a June press conference. \"Mississippi’s certainly has been.\"", "Reeves added: \"These are often sophisticated networks of criminal hackers who will take your information, apply for unemployment, and then reap your benefits.\"", "A U.S. Secret Service spokesperson confirmed that its divisions have identified criminal actors targeting state unemployment insurance program funds, and that they are working with financial institutions and state unemployment offices on leads.", "But we found no evidence that 10,145 arrest warrants are out for fraud in Mississippi. The Secret Service and FBI declined to comment on the specific Facebook posts, and we did not hear back from the Justice Department.", "We searched Google and the Nexis news database for reports mentioning 10,145 warrants in Mississippi. We found nothing to substantiate the widespread Facebook claim.", "Jackie Turner, executive director of the state Department of Employment Security, said at the June press conference that the department has \"heard numerous complaints and reports of fraud.\" Turner did not use a specific number.", "Dianne Bell, the department’s communications director, said the department is \"not aware of any Facebook posts on warrants for unemployment fraud for Mississippi.\" Bell did not say whether the state had issued any — or 10,145 — warrants of any kind.", "The department warns on its website of social media accounts, websites and online surveys seeking confidential information or offering assistance with filing for unemployment payments. It encourages Mississippians to report fraud. The department also built an online system that gives employers information on employees who have filed for unemployment benefits.", "\"We are doing everything in our power on our end to prevent any fraudulent claims,\" said Reeves spokesperson Renae Eze. \"But in the effort to get assistance to people quickly, we know that some have gotten through.\"", "Scammers targeting Mississippi residents could likely have stolen as much as $235 per week in state unemployment benefits, plus an additional $600 per week made available through July 31 by the federal coronavirus relief package that was signed into law in March.", "In a July 15 press conference, Turner said there had been nearly 400,000 unemployment claims filed in Mississippi between March 14 and July 4. Turner reiterated that unemployment fraud \"is very real for us right now, across the country and specifically in Mississippi.\"", "\"Warrants\" could also refer to warrants of payment, which are like state-issued checks, a spokesperson for the state attorney general noted. Those can be given to recipients of unemployment benefits. But we found no reports on Google or Nexis of 10,145 warrants being paid in that sense, either.", "We rate this Facebook post Mostly False.", "Facebook post, July 26, 2020", "Facebook post, July 28, 2020", "Facebook post, July 27, 2020", "Facebook post, July 26, 2020", "Facebook post, July 27, 2020", "Facebook post, July 27, 2020", "Facebook post, July 26, 2020", "Facebook post, July 24, 2020", "Facebook post, July 24, 2020", "Various searches on Google and Nexis, July 29, 2020", "Mississippi Department of Employment Security, \"Benefit Eligibility Requirements,\" accessed July 29, 2020", "Mississippi Department of Employment Security, \"Be Aware of Potential Fraud,\" accessed July 29, 2020", "Mississippi Department of Employment Security, \"Fraud and Integrity,\" accessed July 29, 2020", "Mississippi Public Broadcasting on YouTube, \"MPB LIVE: Governor Tate Reeves COVID-19 Update (7/15/2020),\" July 15, 2020", "FBI, \"FBI Sees Spike in Fraudulent Unemployment Insurance Claims Filed Using Stolen Identities,\" July 6, 2020", "U.S. Department of Justice, \"Federal Seizure Warrants Freeze Funds Tied To COVID-19 Unemployment Fraud Scheme,\" June 30, 2020", "CNBC, \"Coronavirus scams have cost Americans $68 million so far—here are the states hit hardest,\" June 16, 2020", "Clarion Ledger, \"Mississippi officials warn of surge in fraudsters attacking state's unemployment system,\" June 16, 2020", "Mississippi Public Broadcasting on YouTube, \"MPB LIVE: Governor Tate Reeves COVID-19 Update (6/15/2020),\" June 15, 2020", "Associated Press, \"Mississippi seeing rising cases of unemployment fraud,\" June 15, 2020", "The Washington Post, \"Unemployed workers face new delays and paused payments as states race to stamp out massive nationwide scam,\" June 12, 2020", "FBI, \"COVID-19 Fraud: Law Enforcement’s Response to Those Exploiting the Pandemic,\" June 9, 2020", "PolitiFact, \"Big boost in unemployment checks, but no pay hike for workers,\" April 6, 2020", "Statement from the U.S. Secret Service, July 29, 2020", "Email correspondence with Dianne Bell, director of communications for the Mississippi Department of Employment Security, July 29, 2020", "Email correspondence with Michelle Williams, spokesperson for Mississippi Attorney General Lynn Fitch, July 30, 2020", "Email interview with Renae Eze, spokesperson for Mississippi Gov. Tate Reeves, July 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]