["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential nominee Hillary Clinton greets supporters during a campaign rally at Broward College on Oct. 25, 2016, in Coconut Creek, Fla. (Getty)", "With two weeks until Election Day, Hillary Clinton used a rally in Florida to undermine Donald Trump’s reputation as a prospective commander-in-chief.", "Clinton said Trump in a tweet called efforts against terrorists in Mosul \"a total disaster\" and said the United States was \"looking dumb.\"", "\"He's proving once again he is unqualified to be commander in chief of our military,\" Clinton said Oct. 25 in Coconut Creek, Fla. \"Here's another example: He was asked if he would defend our allies. He said well, first he'd want to know if they made any payments to us to defend them.\"", "Has Trump said he would first check who’s making payments before defending them?", "In media interviews, he has said there’s no obligation to defend them if they don’t pay up. Trump’s campaign did not respond to requests for comment.", "NATO and unfulfilled ‘obligations’", "Clinton is talking about Trump’s comments about NATO during the campaign.", "NATO, founded after World War II by the United States and 11 other members, now has 28 members, all agreeing to use political and military means to safeguard members’ freedom and security.", "Article 5 of the Washington Treaty -- NATO’s founding treaty -- says parties agree that an attack against one shall be considered an attack against all, and agree to assist members who are attacked. NATO invoked Article 5 for the first time after the 9/11 terrorist attacks against the United States.", "To back Clinton’s claim, her campaign directed us to a July 2016 New York Times interview with Trump on foreign policy. Trump was asked about defending small Baltic States that have recently joined NATO against Russia, such as Estonia, Latvia and Lithuania.", "\"Mr. Trump said that if Russia attacked them, he would decide whether to come to their aid only after reviewing if those nations have 'fulfilled their obligations to us,' \" the New York Times reported.", "According to a transcript of the interview with the New York Times, Trump also said many NATO members \"aren’t paying their bills.\"", "Reporter David E. Sanger: \"That’s true, but we are treaty-obligated under NATO, forget the bills part.\"", "Trump: \"You can’t forget the bills. They have an obligation to make payments. Many NATO nations are not making payments, are not making what they’re supposed to make. That’s a big thing. You can’t say forget that.\"", "Sanger: \"My point here is, can the members of NATO, including the new members in the Baltics, count on the United States to come to their military aid if they were attacked by Russia? And count on us fulfilling our obligations —\"", "Trump: \"Have they fulfilled their obligations to us? If they fulfill their obligations to us, the answer is yes.\"", "Reporter Maggie Haberman: \"And if not?\"", "Trump: \"Well, I’m not saying if not. I’m saying, right now there are many countries that have not fulfilled their obligations to us.\"", "So in that interview, Trump argued other NATO countries had to \"fulfill their obligations\" to receive the United States’ military aid. Asked to clarify what would happen to countries who hadn’t paid, he demurred.", "In May 2016, Trump also told the Wall Street Journal that when other NATO nations \"don’t pay up, they’ve backed out of their obligations, then we no longer have an obligation to defend them.\"", "Trump said he did not want to get out of NATO, but wanted \"the countries of NATO to pay us.\"", "There’s a problem with the way Trump has talked about NATO country payments.", "\"No one in NATO actually ‘pays us’ to defend them, as Trump repeatedly claims, nor is there any obligation to do so,\" said Ivo H. Daalder, president of the Chicago Council on Global Affairs who previously served as ambassador to NATO under President Barack Obama.", "\"Our commitment to come to our allies' defense -- and theirs to ours -- isn't in return for any payment,\" Daalder said. \"It is an unconditional treaty obligation every ally entered into freely when they signed the North Atlantic Treaty.\"", "NATO allies pay into military and civilian budgets on the basis of agreed cost shares, said Jeff Rathke, senior fellow and deputy director of the Europe Program at Center for Strategic and International Studies. And to be clear, funds are paid to NATO, not to the United States.", "Beyond the common funding of certain capabilities, each NATO ally is also responsible for spending on its own defense, said Rathke, who served on NATO’s International Staff from 2009 to 2011. Allies are to spend at least 2 percent of their gross domestic product on defense, though many are not meeting the guideline.", "Jorge Benitez, director of NATOSource at the Atlantic Council, says if Trump were elected president and decided not to help defend a NATO ally under attack, \"it would be the end of NATO.\"", "\"This would be a very damaging blow to U.S. national security and would also hurt our alliances in other parts of the world,\" Benitez said.", "Our ruling", "Clinton said when Trump was asked if he would defend our allies, \"He said well, first he'd want to know if they made any payments to us to defend them.\"", "Trump has raised questions about other NATO nations not paying their fair share for defense. In a New York Times interview, Trump was asked if he would defend NATO members against an attack by Russia, and he said \"if they fulfill their obligations to us, the answer is yes.\"", "Trump also told the Wall Street Journal that if allies \"don’t pay up, they’ve backed out of their obligations, then we no longer have an obligation to defend them.\"", "We rate Clinton’s statement True.", "https://www.sharethefacts.co/share/cc782919-03c6-40c7-b854-2f9c766e1198", "Email exchange, Hillary Clinton campaign, Oct. 25, 2016", "Email interview, Jeff Rathke, senior fellow and deputy director of the Europe Program at Center for Strategic and International Studies, Oct. 26, 2016", "Email interview, Ivo H. Daalder, president of the Chicago Council on Global Affairs, Oct. 26, 2016", "Email interview, Jorge Benitez, director of NATOSource at the Atlantic Council, Oct. 26, 2016", "New York Times, Donald Trump Sets Conditions for Defending NATO Allies Against Attack, July 20, 2016", "New York Times, Transcript: Donald Trump on NATO, Turkey’s Coup Attempt and the World, July 21, 2016", "New York Times, Donald Trump Says NATO is ‘Obsolete,’ UN is ‘Political Game’, April 2, 2016", "Washington Post, The first Trump-Clinton presidential debate transcript, annotated, Sept. 26, 2016", "Wall Street Journal, Donald Trump Defends His National Security Positions as Hillary Clinton Attacks, May 23, 2016", "NATO, Defence Expenditures of NATO Countries (2009-2016), July 4, 2016", "NATO, member countries", "NATO, Wales Summit Declaration", "NATO, Collective defence - Article 5", "NATO, The North Atlantic Treaty", "USA Today, Trump's pay-or-else NATO comments send a chill through Europe, July 22, 2016", "Los Angeles Times, Editorial Trump to allies: Pay up or we might not defend you, July 21, 2016", "NBC News, Donald Trump Remarks on NATO Trigger Alarm Bells in Europe, July 21, 2016", "PolitiFact, Experts say Donald Trump's 'policies' dovetail with what Vladimir Putin would like for Russia, Sept. 22, 2016", "PolitiFact, Kaine wrongly says Trump backs end of NATO, Oct. 10, 2016", "PolitiFact, Sanders oversimplifies U.S. share of NATO, April 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]