["The foul media coverage and social media obsession with actor Sushant Singh Rajput’s death give birth to new conspiracy theories every passing day. The latest addition to this hubbub is the claim that Rajput’s manager Disha Salian was photographed with actor Sooraj Pancholi.", "Disha Salian had passed away days before Rajput’s death on June 14. Social media grapevine linked Salian’s death with Pancholi who has been surrounded by controversies ever since his girlfriend and actor Jiah Khan died by suicide in 2013.", "On August 5, Twitter account @KanganaOffical, a parody account with 25,000 followers, had posted an image claiming that Pancholi lied about never meeting Salian. Its tweet said, “Pancholi said he doesn’t knew [know] Disha. He Never Met Her In His Entire Life. #SCForSushant”. This has been retweeted over 1000 times (archived link). Other Twitter users also posted the image with an identical claim.", "Screenshot of this tweet and similar posts were spotted on Facebook.", "In the wee hours of August 5, Pancholi made a post on Instagram refuting social media claims. He wrote, “That girl in the picture which was clicked in 2016 is not “Disha Salian” that is my friend @agaur21 (Anushri Gaur) who doesn’t even live in India… I have said this before and I’m saying it again I have never met or spoken to Disha Salian in my life”. Pancholi is the man wearing a cap and the woman next to him is Gaur.", "Complete bullshit!! #FuckYouFakeMEDIA Is this the media we are supposed to trust?? That girl in the picture which was clicked in 2016 is not “Disha Salian” that is my friend @agaur21 (Anushri Gaur) who doesn’t even live in India .. Please stop brainwashing people and PLEASE stop harassing me and dragging me into this ! Start being responsible of your actions as it can ruin someone’s life ! I have said this before and I’m saying it again “I have never met or spoken to Disha Salian in my life” Seriously FUCK YOU AND FUCK YOUR FAKE NEWS! 🖕🏽 I’ve had enough.", "A post shared by  Sooraj Pancholi (@soorajpancholi) on Aug 5, 2020 at 10:09am PDT", "Gaur also replied to this post, thanking Pancholi for “posting the truth.” Alt News reached out to Gaur via Instagram and she confirmed that the one next to Pancholi is her. She added that the other woman in the photo is Athiya Shetty, daughter of actor Sunil Shetty. “The photograph was taken at Athiya’s birthday party in 2016,” she said.", "A fan account dedicated to Sooraj Pancholi had tweeted a picture of him with Gaur. Evidently, the woman in the viral image and the one in this photo are the same.", "Handsome😻 Sooraj baba with Beautiful Anushri Gaur 😍😊Keep Smiling hero ☺☺ We Love u ❤❤💚😍😘😘@soorajpancholi9 pic.twitter.com/Rcxo8gLFHh", "— Sooraj Pancholi Fanclub (@beingfanforever) November 8, 2016", "It is noteworthy that Gaur had blamed the media for misreporting that the woman in the picture is Disha Salian. He shared a screenshot of a Mirror Now broadcast where the picture was aired. However, Mirror Now did not claim that Pancholi was photographed with Salian. On August 5, during its daily show ‘The Urban Debate’, the channel said that the picture is being shared with the claim that the woman is Salian, which was denied by Sooraj Pancholi’s father Aditya Pancholi. Mirror Now then played Aditya Pancholi’s clarification.", "Thus a picture of Sooraj Pancholi with a friend was shared with the false claim that he was photographed with Sushant Singh Rajput’s former manager Disha Salian.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]