["Sen. Tom Cotton, R-Ark., speaks at the Conservative Political Action Conference Feb. 26, 2021, in Orlando, Fla. (AP)", "Cotton’s office said he misspoke  with respect to terrorists not being deported.", "Biden’s administration ordered a 100-day deportation pause, but it did not apply to criminals such as murderers, rapists, terrorists or gang members.", "Speaking at the annual Conservative Political Action Conference, Sen. Tom Cotton, R-Ark., criticized Democrats’ immigration proposals and claimed that President Joe Biden was giving terrorists and other criminals a pass to stay in the country even if they were here illegally.", "\"They have halted deportations for all illegal aliens — murderers, rapists, terrorists, MS-13 gang members are not being deported,\" Cotton told CPAC attendees Feb. 26 in Orlando.", "Is Cotton right about criminals being allowed to stay? No. His claim ignores the policies of the Department of Homeland Security.", "\"Sen. Cotton misspoke,\" with respect to terrorists not being deported, James Arnold, a spokesperson for Cotton, told PolitiFact.", "On Jan. 20, David Pekoske, then-acting secretary of homeland security, ordered a review of immigration enforcement practices and an immediate 100-day pause on the deportation of people with final orders of removal.", "\"Due to limited resources, DHS cannot respond to all immigration violations or remove all persons unlawfully in the United States,\" Pekoske said. \"Rather, DHS must implement civil immigration enforcement based on sensible priorities and changing circumstances.\"", "The deportation pause did not apply to people who had engaged or were suspected of engaging in terrorism or espionage, or posed a danger to national security and public safety.", "People were still eligible for deportation if they were in prison or jail and released on or after the date of Pekoske’s memo, and if they were convicted of an aggravated felony. An aggravated felony includes murder, rape or sexual abuse of a minor.", "Cotton also left out that a federal judge in Texas has since blocked the deportation moratorium indefinitely. Texas Attorney General Ken Paxton sued the Biden administration over the deportation pause.", "DHS told PolitiFact that Cotton’s claim was incorrect, noting that U.S. Immigration and Customs Enforcement on Feb. 18 issued interim operating guidance that said removal resources would focus on threats to national security, border security and public safety.", "\"Individuals are presumed to be a threat to public safety if, for example, they have been convicted of an aggravated felony or engaged in certain activity as part of a criminal gang or transnational criminal organization and there is reason to believe they currently pose a threat,\" ICE said.", "We don’t have data on how many murderers, rapists, gang members or terrorists have been deported during the Biden administration. But it is inaccurate to say that their deportations were halted.", "Cotton said, \"They have halted deportations for all illegal aliens, murderers, rapists, terrorists, MS-13 gang members are not being deported.\"", "Biden’s administration ordered a 100-day deportation pause, but it did not apply to criminals such as murderers, rapists, terrorists or gang members.", "We rate Cotton’s claim False.", "UPDATE, Feb. 26, 7:10 p.m.: We updated the story shortly after publication to clarify the response from Cotton's spokesman. It did not affect the rating.", "YouTube, Sen. Tom Cotton speech at CPAC, Feb. 26, 2021", "Email interview, James Arnold, a spokesperson for Sen. Tom Cotton, Feb. 26, 2021", "Email interview, Danielle Bennett, DHS spokesperson, Feb. 26, 2021", "USCIS.gov,  Chapter 4 - Permanent Bars to Good Moral Character", "DHS.gov, Memo from then-acting secretary of Homeland Security David Pekoske, Jan. 20, 2021", "ICE.gov, ICE announces temporary guidelines for its enforcement and removal operations, Feb. 18, 2021", "Texas Tribune, Federal judge indefinitely blocks enforcement of Biden administration’s 100-day deportation freeze, Feb. 24, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]