["Some social media users are reminiscing about their childhood and sharing a viral image that purportedly shows late zookeeper and TV personality Steve Irwin hanging out with late television host Fred Rogers in a Bob Ross T-shirt.", "\"You may be cool, but you will never be as cool as Mr. Rogers in a Bob Ross t-shirt hanging out with Steve Irwin,\" reads a March 18 Facebook post with over 600 shares and over 1,100 reactions.", "Below the text is the alleged photo of Irwin and Rogers, who are posing with a rainbow behind them and Rogers is seen wearing a white T-shirt that reads, \"good vibes only.\" In the bottom left corner of the photo is the phrase , \"made with mematic.\"", "Some users commented on the photo writing, \"legendary\" and \"goals,\" while others were quick to point out that the image is photoshopped.", "The photo also made its way to Twitter in a viral March 18 post with over 8,500 likes and 2,200 shares in which a user wrote, \"You want a positive picture? I present to you, Steve Irwin taking a picture with Mr. Rogers who is wearing a Bob Ross shirt while there is a rainbow in the background!\"", "USA TODAY reached out to the Facebook user who shared the image for comment.", "Fact check:No evidence Oprah Winfrey helped Harvey Weinstein abuse women", "The photo is not authentic, and it is actually a composite that was created by a digital artist using two separate pictures of Irwin and Roger, according to Snopes.", "The Instagram account @_Vemix_ first shared the image of Irwin and Rogers to Instagram on March 15 in a post with over 1,320 likes. In a follow-up post a few days later, the account wrote, \"Well, this one's out of control.\"", "In a message to USA TODAY, Vemix confirmed that he created the composite himself last Sunday and said, \"it's just what I do.\"", "The account's page features other composites of celebrities including Princess Diana and Tupac Shakur as well as Michael Jackson next to legendary rapper Notorious B.I.G.", "In July 2019, Vemix told Feature Shoot that he finds two pictures that line up perfectly with the right angles and picture quality and that \"if the light source is wrong, it’s just going to look weird.\" He added that he avoids black and white photos because \"It's just a telltale sign of Photoshop.\"", "A similar composite photo of former President Donald Trump hanging out with Tupac has been previously debunked by Snopes.", "Fact check: Video warning of a pandemic was created in 2020 as satire, not 1956", "The first image of Rogers included in the composite originates from a 2013 Facebook post by Davide's Tomato Sauce, which is owned by David Calamosca.", "Calamosca and Rogers \"held a strong friendship that was nurtured by the passion of promoting a kind and healthy living,\" according to the post.", "In the original photo, Rogers is wearing a white T-shirt with a logo that reads \"Davide Fresh Pasta and Sauce,\" and there is no rainbow in the background, which has been altered into the composite.", "The photo of Irwin was captured on Sept. 16, 2003, by the Australian Zoo and shows him posing with his father Bob Irwin in Beerwah, Australia, according to Getty Images.", "USA TODAY has previously debunked photos that are originally created as two images edited together.", "Fact check: Image claiming to show the first sunset captured on Mars is an illustration", "An image claiming to show Steve Irwin and Fred Rogers together is ALTERED, based on our research. The photo was created by a digital artist who specializes in creating composites of celebrities. A photo of Irwin is from 2003 and a photo of Rogers shared by Davide's Tomato Sauce were combined to make it appear as if the two were photographed hanging out together.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]