["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Five days after shootings in Newtown, Conn., left 28 people dead -- including 20 children at Sandy Hook Elementary -- leaders at two of Georgia’s higher education institutions weighed in on the gun safety debate.\n\nLeaders of Oglethorpe University and Agnes Scott College  -- both are in DeKalb County -- released an open letter pushing for stricter gun safety legislation. It was initially co-signed by more than 160 other college and university presidents nationwide, including Atlanta’s Morehouse and Spelman colleges and Clark Atlanta University. Oglethorpe President Lawrence M. Schall said he was moved to draft the letter after watching a televised memorial service for Newtown victims.\n\n\"For many years now, our nation’s leaders have engaged in fevered debates on higher education, yet lawmakers shy away from taking action on one issue that prevents thousands of young people from living lives of promise, let alone realizing their college dreams. That issue is gun safety,\" the letter reads. \" … In 2010, 2,694 young people were killed by gunfire. 1,773 were victims of homicide; 67 were elementary school-age children. If those children and teens were alive today, they would fill 108 classrooms of 25 each.\"\n\nSince the Connecticut shooting, the gun safety debate has come front and center at all levels of government. The White House has rolled out a $500 million gun safety package. State lawmakers are pushing for armed officers in schools. Metro Atlanta school districts have conducted \"active shooter\" lockdown drills for staff and students.\n\nA multitude of statistics has been tossed about by advocates on both sides of the issue to make their points. We wondered if the data used by higher education leaders was accurate. And we were curious how it was compiled.\n\nBy the time President Barack Obama unveiled his gun-violence reduction plan this week, the list of higher education co-signers of the gun safety letter had risen to more than 300. The letter has received national attention, with coverage on news outlets including CNN, The Huffington Post, NPR and The Wall Street Journal.\n\nA spokesman for Oglethorpe University said the gun death statistics used in the letter were taken directly from data also used by the Children’s Defense Fund, the Washington, D.C., child-advocacy organization led by Marian Wright Edelman. The data includes figures for children and youths through age 19. In one of her weekly \"Child Watch\" columns last month, Edelman used the same statistics to also implore action on gun violence.\n\nThe figures cited by the Children’s Defense Fund are actually data compiled by the Centers for Disease Control and Prevention and available in its WONDER (Wide-ranging Online Data for Epidemiologic Research) online database research system. For its various data, the CDC WONDER system uses information collected from its agency affiliates.\n\nThe mortality data used in the gun safety letter is compiled from death certificates issued in each state and recorded by the CDC’s National Center for Health Statistics. That information is then included in the WONDER database. Of note are the types of gun deaths included in the numbers cited. The list of 2,694 young people reportedly killed by gunfire includes those who died of suicide, as well as accidental discharge of a firearm and discharge of a firearm with an undetermined intent.\n\nThe CDC’s homicide figure varies slightly from the FBI’s Uniform Crime Reports for 2010. The FBI crime statistics are produced from data provided by 17,000 law enforcement agencies across the United States. For children and youths through age 19, 1,402 were victims of homicide (it does not include suicide) by gunfire in 2010, according to the FBI crime report. That is similar to the CDC’s figure of 1,773 homicide victims of the same age during the same year.\n\nThe FBI and CDC data sets are the two main sources of these types of statistics, said James Fox, a professor of criminology at Northeastern University in Boston. The CDC numbers can be slightly higher because the FBI figures do not include data from every police department in the country (about 92 percent of the departments submit information to the FBI). But the FBI data, which is published annually, is more up to date, Fox said. The lag time for reporting CDC data is about a year longer.\n\nSo, are the numbers of child gun deaths cited in the letter from the college and university presidents accurate?\n\nIt depends on who collects, compiles and publishes the data, as well as what is included in the numbers. In the case of the CDC data, it is virtually impossible to track down each death certificate from 2010 to verify the cause of death. Based on an examination of the WONDER data, the numbers appear accurate. It is important to note that the figure for the number of children and youths killed by guns three years ago includes causes such as suicides and unintentional discharges.\n\nWe rate the college and university presidents’ claim Mostly True.", "Open letter from 160+ College and University Presidents, College Presidents for Gun Safety, Dec. 19, 2012\n\nEmail from  J. Todd Bennett, executive director of communication, Oglethorpe University, Jan. 15, 2013\n\nBlog posting, Lawrence M. Schall, Oglethorpe University’s president\n\n\"Dear God! When Will It Stop?\" Child Watch Column, Marian Wright Edelman, Children’s Defense Fund, Dec. 14, 2012\n\nGun deaths: Centers for Disease Control and Prevention WONDER Online Database\n\nPhone conversation, WONDER database analyst, Jan. 16, 2013\n\nFBI uniform crime reports, Expanded Homicide Data Table 9, Murder victims by age, by weapon, 2010\n\nPhone interview, James Fox, professor of criminology, Northeastern University, Jan. 17, 2013\n\nNational Rifle Association, \"Wayne’s Commentary: NRA Press Conference,\" NRA Executive Vice President Wayne LaPierre, Dec. 21, 2012\n\nThe Atlanta Journal-Constitution, \"School safety, choice on agenda,\" Wayne Washington, Jan. 10, 2013\n\nThe Atlanta Journal-Constitution, \"NRA push for armed officers backed by state superintendent,\" Wayne Washington, Dec. 21, 2012\n\nThe Atlanta Journal-Constitution, Political Insider, \"Your Daily Jolt: Nathan Deal wants to stay out of gun debate,\" Jim Galloway, Jan. 10, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]