["A container ship awaits being unloaded in a cargo terminal at a port in Tokyo in November 2013.", "A new chain email warns that President Barack Obama is about to grab \"the powers of a king\" through a new trade agreement with Pacific Rim countries.", "The email begins, \"A leaked copy of Obama's top secret Trans Pacific Partnership (TPP) has been posted on our website and it is much, much worse than anyone anticipated. We can say goodbye to America's borders, our Constitution and the rule of law if Obama and Majority Leader Harry Reid, D-Nev., are able to ram this treaty through the Senate. And that's exactly what they're trying to do! Sen. Rand Paul, R-Ky., says this ‘free trade’ deal is a clear violation of the separation of powers. Only the Senate is allowed to negotiate trade agreements under the Constitution. Harry Reid wants to fast-track this treaty, which will essentially grant Obama the powers of a king to negotiate all future deals.\"", "The email goes on to say, \"If this treaty is fast-tracked through the Senate, it won't receive a committee assignment and it will be subjected to a straight up-or-down vote, with no debate.\"", "We learned of the email when a reader sent it to us, asking for a fact-check. The email originated with Pray For US, a Henderson, Nev.,\"online outreach Christian church and ministry.\"", "Most Americans probably haven’t heard of the Trans-Pacific Partnership, but if the trade agreement comes to fruition -- and that’s far from a certainty at this point -- it could be a very big deal.", "One thing it wouldn’t do, though, is give Obama king-like powers. The email is also wrong when it claims that the fast-track process in Congress rules out committee assignments and debate. That’s what we’ll be fact-checking here.", "Let’s start with the basics. The Trans-Pacific Partnership, if it’s enacted, would set the ground rules for trade between a dozen nations in the Pacific region. It’s been in negotiation for several years among the United States, Australia, Brunei, Canada, Chile, Japan, Malaysia, Mexico, New Zealand, Peru, Singapore and Vietnam. Combined, these countries account for roughly 40 percent of the world’s economy.", "The Obama administration has made the agreement a top priority for trade policy. Mireya Solís, a senior fellow at the Brookings Institution, has called it \"the most ambitious trade initiative pursued by the Obama Administration, one that will have large ramifications for overall trade policy and the direction of the world trading system.\"", "Trade deals often draw opposition from the left (due to such concerns as labor rights, environmental protection and an expansion of corporate power) and sometimes from the right (such as over a feared loss of national sovereignty). This has been true with the Trans-Pacific Partnership as well, with various proposed provisions drawing fire, including everything from pharmaceutical patent rules to rights for legal redress.", "The deal could be taken up under a process informally known as \"fast-track.\" That refers to a procedure outlined in the Trade Act of 1974. According to the Congressional Research Service, when Congress passed this law, it granted the president the authority to enter into trade agreements that reduced or eliminated tariffs. Congress would then enact changes related to the agreement through legislation, using a procedure that streamlined and sped up the legislation’s path through Congress. The streamlined rules were designed to keep lawmakers from making changes that would threaten the international agreement.", "Here are some of the key elements of the fast-track process, taken from a CRS summary:", "• The president sends a final text of the trade agreement and a draft implementing bill to Congress. Identical bills are required to be introduced in each chamber of Congress on the day they are received.", "• The bills are then referred to the House Ways and Means Committee and the Senate Finance Committee, as well as other committees, if jurisdiction warrants. Each committee has 45 in-session days to report the bill to the floor. If that deadline passes without committee action, the bill is automatically sent to the floor.", "• On the floor, debate is set at 20 hours, evenly divided between those for the agreement and against it.", "The chain email is correct that when the eventual vote is taken, it is on the original text, without any amendments. And the measure needs 50 percent plus one to pass -- not the common Senate supermajority of 60 votes.", "While these rules do curb lawmakers’ ability to shape the agreement’s terms, the email is simply wrong to claim that legislation stemming from a trade agreement \"won't receive a committee assignment\" and that the agreement will have \"no debate.\"", "We will note two other problems with the claim.", "First, whatever comes out of the Trans-Pacific Partnership negotiation won’t be a \"treaty,\" as the email claims. Under the Constitution, treaties require a two-thirds vote by the Senate.", "Second, fretting about how the Trans-Pacific Partnership could be passed under the fast-track process is putting the cart before the horse. Fast-track authority must be renewed periodically by Congress, and that authority lapsed on July 1, 2007. Since then, Congress -- under both Democratic and Republican majorities -- has not chosen to renew it. And with relations between the two parties, and between the House and the administration, thoroughly frayed, a renewal looks unlikely anytime soon.", "So it's possible that the agreement will be considered under fast-track, but it's far from certain.", "Our ruling", "The chain email said that \"if the treaty (the Trans-Pacific Partnership) is fast-tracked through the Senate, it won't receive a committee assignment\" and the agreement will have \"no debate.\" The procedures laid out in the Trade Act of 1974 are designed to streamline the process of enacting trade agreements, but the process does in fact include committee consideration and floor debate. We rate the claim False.", "Pray for US, \"Top Secret Trade Deal Destroys America's Borders & Jobs - Stop The Trans-Pacific Partnership!\" accessed Nov. 26, 2013", "Pray for US, \"Obama to be King – If We Let Him!\" accessed Nov. 26, 2013", "Congressional Research Service, \"Trade Promotion Authority (TPA) and the Role of Congress in Trade Policy,\" Aug. 2, 2013", "Mireya Solís, \"Would the Proposed Trans-Pacific Partnership be Good or Bad for America?\" Nov. 6, 2013", "The Guardian, \"The Trans-Pacific Partnership treaty is the complete opposite of 'free trade,'\" Nov. 19, 2013", "Office of the United States Trade Representative, \"The United States in the Trans-Pacific Partnership,\" accessed Nov. 25, 2013", "Email interview with Sarah Binder, congressional scholar at the Brookings Institution, Nov. 18, 2013", "Email interview with Kermit Roosevelt, law professor at the University of Pennsylvania, Nov. 18, 2013", "Email interview with Ilya Shapiro, senior fellow in constitutional studies at the Cato Institute, Nov. 18, 2013", "Email interview with Steven Smith, political scientist at Washington University in St. Louis, Nov. 18, 2013", "Email interview with Emily Blanchard, assistant professor at the Tuck School of Business at Dartmouth College, Nov. 18, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]