["U.S. Rep. Beto O’Rourke is officially running for president and that means he was just born to be featured in a Facebook post questioning whether he’s worthy of the White House.", "\"Remind everyone of this pic when this fool says he is gonna run for president,\" reads a Facebook post published on March 14. \"This is Robert O’Rourke (beto).\"", "Below the text is a photo of a nearly naked man with several words written on his body, including: pansexual, feminist, atheist, vegan, naturist, ecologist, queer and slut.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "So is it Beto?", "\"Definitely not,\" said Chris Evans, a spokesman for O’Rourke’s campaign.", "By searching for the image on TinEye, we found a full body shot of the cropped photo. We then searched for that picture and found what looks like the original, unaltered image. In this version, it looks like the person is standing in front of the Greek parliament in Athens.", "Digging through more photos on websites like Google Images and Flickr, among others, we discovered several more shots of the person on Getty Images. The caption of this photo, by photographer Dimitris Lampropoulos, notes that it’s taken at the Gay Pride Parade in Athens on June 11, 2016.", "We searched for news reports about O’Rourke attending the parade and found none. He did live-stream a sit-in organized by Democrats at the U.S. House of Representatives that month, speak at a conference on border competitiveness and, on June 12, attended a vigil in El Paso in the wake of a mass shooting of a gay nightclub in Florida.", "But that person in the photo isn't him. We rate this Facebook post Pants on Fire!", "Facebook post, March 14, 2019", "Email interview with Chris Evans, Beto O’Rourke spokesman, March 14, 2019", "TinEye reverse image search, March 14, 2019", "Getty Images, Gay Pride Parade 2016 in Athens, June 11, 2016", "Getty Images, photos from the Gay Pride Parade in Athens, June 11, 2016", "El Paso Times, \"Congressman O’Rourke live-streams House sit-in,\" June 22, 2016", "The Hill, \"Texas lawmaker: ‘The border is safe,’\" June 15, 2016", "El Paso Times, \"Area leaders, activists unite behind LGBTQI community,\" June 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]