["President Donald Trump delivers his State of the Union address to a joint session of Congress on Capitol Hill in Washington on Feb. 4, 2020. (AP)", "Civilian federal employees were scheduled to get pay raises of 2.5% in January 2021, but Trump reduced the raises to 1%.", "He cited a law that allows him to make the change based on “serious economic conditions.”", "In spite of how often President Donald Trump trumpets the strength of the U.S. economy, he’s being accused of reducing pay raises for federal employees and blaming the economy for it.", "\"Breaking: Trump just cut the scheduled federal pay raise, stating that he can’t do it now because of ‘serious economic conditions’ in America,\" claims the Feb. 13 post. It ends with: \"#ImpeachTrumpAgain.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s pretty much on target.", "On Feb. 10, 2020, six days after declaring in his State of the Union address \"that our economy is the best it has ever been,\" Trump announced he was reducing across-the-board pay increases for civilian federal employees that are scheduled to take effect in January 2021.", "Instead of being 2.5%, the raises will be 1%.", "A yearly adjustment of paychecks based on the region of the country where a worker is posted was also to take effect in January 2020, but Trump decided those salaries would remain at 2020 levels.", "Trump cited in his message to Congress his legal authority to make the changes \"because of ‘national emergency or serious economic conditions affecting the general welfare.’\"", "That phrasing is from the federal law that gives him the authority.", "He added this, however: \"We must maintain efforts to put our nation on a fiscally sustainable course; Federal agency budgets cannot sustain such increases.\"", "Trump’s order is not necessarily the final word, however. Congress could pass a spending bill that includes a federal pay raise.", "Such a bill would be subject to a possible veto from Trump.", "A Facebook post says: \"Trump just cut the scheduled federal pay raise, stating that he can’t do it now because of ‘serious economic conditions’ in America.\"", "Trump reduced to 1% from 2.5% across-the-board raises for civilian federal employees, citing his authority under a law that allows for such changes due to \"national emergency or serious economic conditions affecting the general welfare.\" More specifically, Trump cited spending concerns in reducing the raise.", "For a statement that is accurate but needs additional information, our rating is Mostly True.", "Facebook, post, Feb. 13, 2020", "The White House, \"Message to the Congress on the 2021 Alternative Plan for Pay Adjustments,\" Feb. 10, 2020", "CNN, \"Trump cites 'serious economic conditions' in proposing 1% pay raise for federal employees,\" Feb. 10, 2020", "Federal News Network, \"In break with tradition, Trump announces 1% federal pay raise intentions to Congress months early,\" Feb. 10, 2020", "New York Times, \"Trump’s $4.8 Trillion Budget Would Cut Safety Net Programs and Boost Defense,\" Feb. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]