["A video of an infant’s dead body washed ashore in Muzaffarpur district is doing the rounds on social media with several prominent Twitter handles claiming that the infant died in the ongoing Bihar floods.", "One Anurag Tiwari tweeted the video with a message, “याद है सीरिया में समुद्र तट पर बहकर आये एक मासूम शरणार्थी का शव देखकर पूरी दुनिया रो उठी थी, लेकिन शायद मिथिला की प्रलयंकारी बाढ़ में अपना जीवन खोने वाले बच्चे के लिए आंसू बहाने के लिए न तो सरकार है वे संवेदनशील हृदय (Remember when the world cried after seeing the dead body of an innocent refugee which came flowing to the shore of a beach in Syria. But perhaps there is neither government nor those sensitive hearts who will shed tears for this child who lost his life in the catastrophic floods in Mithila. -translated”). The tweet had garnered more than 1,800 retweets before it was deleted.", "इसे देखकर विचलित नहीं होना. इंसेफेलाइटिस से बिहार में हुई 150 से ज़्यादा बच्चों की मौत के बाद ये बच्चा भी आँकड़ा बनकर रह जाएगा या शायद वो भी नहीं बनेगा. सूबे के सीएम, देश के पीएम आंकडों का गला घोंटकर ही तो बाहर और अच्छे दिन के दावे करते हैं? लेकिन सवाल करना मना है! #BiharFloods pic.twitter.com/YpL5PtkEM2", "— Tarun Krishna (@krishnatarun03) July 18, 2019", "The official Twitter handle of Rashtriya Janata Dal quote-tweeted Tiwari’s tweet and attacked the ruling BJP dispensation in Bihar", "Indian rural media platform Gaon connection tweeted the image of the child with the claim that it depicts the tragedy in Bihar.", "Many other prominent individuals on Twitter also posted the image with a similar narrative taking potshots at the Bihar government.", "Alt News found that while the infant indeed lost his life in Muzaffarpur, however, it was not because of drowning in the ongoing floods in Bihar. The mother of the child attempted suicide by jumping into a river along with four of her children. The incident took place in Sital Patti village, which falls under the jurisdiction of Siwaipatti police station in Muzaffarpur.", "Muzaffarpur District Magistrate Alok Ranjan clarified that the viral image/video of the drowned infant washed ashore had nothing to do with the floods in the state. Addressing a press conference on July 18, Ranjan said that Reena Devi had pushed her four children into the water and herself jumped into the river after a quarrel with her husband who lives in Punjab. He further added, “It was purely man-made which can be dubbed as a criminal offence for the attempt to murder.” In the incident, three children – Karan Kumar, Jyoti Kumari, and Raj Kumar died while seven-year-old Radha and Reena Devi were rescued.", "Muzaffarpur DM on viral image of drowned infant washed ashore: Reena Devi,resident of Shitalpatti village, after fight with husband pushed her 4 children into river & herself jumped into river on July16. Woman along with 7-yr-old daughter survived. 3 of her children died #Bihar pic.twitter.com/WkzzUfjWMR", "— ANI (@ANI) July 18, 2019", "Speaking to The Quint, Alok Ranjan said that Devi’s husband Ram had filed an FIR against his wife after returning from Punjab. Ranjan added that there was no connection of the deaths with the Bihar floods since the woman’s house was at a distance from the closest river and not in danger of being affected by flooding.", "Alt News contacted Siwaipatti police station. We were informed that Reena Devi has been arrested and an FIR has been registered with the charge of attempt to murder.", "In conclusion, a photo of a child whose mother attempted to commit suicide along with the infant in a river in Muzaffarpur district was linked with the devastation caused by the ongoing Bihar floods.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]