["By Eugene Kiely", "Posted on October 29, 2019", "In explaining his decision to pull U.S. forces from northern Syria and allow Turkey to set up a “safe zone” in Syria, President Donald Trump falsely claimed that Turkey has lost “thousands and thousands of people from that safe zone.”", "“This is entirely fictional,” Asli Aydıntaşbaş, a senior policy fellow at the European Council on Foreign Relations, told us in an email.", "It’s true that Turkey has lost thousands of its people in battles over the years with the Kurdistan Workers’ Party, or PKK, inside Turkey. However, there have not been thousands of deaths in the “safe zone” inside Syria, she and other experts told us.", "“There has been a Kurdish insurgency in Turkey (inside Turkey, not in Syria) since 1984,” Aydıntaşbaş said. “But none of the fighting ever happened in Syria or Syrian terrain. There is no record of a fight between Turkey and the PKK in northern Syria.”", "Trump made his remarks in an Oct. 27 press conference announcing the death of Islamic State leader Abu Bakr al-Baghdadi. Specifically, Trump was asked if the successful U.S. raid that resulted in al-Baghdadi’s death gave any reason to reconsider his decision to withdraw U.S. forces from northern Syria, where Syrian Kurds backed by U.S. forces have been guarding 10,000 Islamic State prisoners.", "On Oct. 6, the White House announced it would withdraw U.S. forces in northern Syria and that Turkey would soon move “forward with its long-planned operation into Northern Syria.” Trump’s decision prompted bipartisan criticism, because the Turkish military operation was designed to forcibly remove the Syrian Kurds — known as the People’s Protection Units, or the YPG — from Turkey’s border in northern Syria. Even Trump’s Republican supporters, such as Sen. Lindsey Graham, criticized the president for abandoning the Syrian Kurds and opening the door to an Islamic State comeback.", "Although the YPG has been a U.S. ally in the fight against the Islamic State, Turkey views the Syrian Kurds as an “affiliate” of the PKK, which Turkey and the U.S. have designated as a terrorist group. Turkey believes the presence of the YPG on its border with Syria poses a threat to its country, as Fahrettin Altun, Turkey’s communications director, explained in a recent Washington Post op-ed. The U.S. does not consider YPG to be a terrorist group, but it has “acknowledged that ties exist between them and the PKK,” the nonpartisan Congressional Research Service said in a January report.", "Three days after Trump withdrew U.S. forces, Turkish President Recep Tayyip Erdogan started what he called “#OperationPeaceSpring against PKK/YPG and Daesh terrorists in northern Syria.” Daesh is another name for the Islamic State or ISIS.", "The Turkish operation in northern Syria resulted in dozens of deaths of civilians and Kurdish fighters, before a pause in the fighting allowed the YPG to leave the area. In his op-ed, Turkey’s communications director urged the world to support its creation of a “safe zone,” which he described as a “20-mile secure area spanning from the Euphrates River to the Syria-Iraq border.”", "In his press conference, Trump said he was “glad” he “was able to help” Turkey establish a “safe zone” — but, in doing so, he made his false claim about deaths “from that safe zone.”", "Trump, Oct. 27: Turkey has taken tremendous deaths from that part of the world. You know, we call it a safe zone. But it was anything but a safe zone. Turkey has lost thousands and thousands of people from that safe zone. So they’ve always wanted that safe zone, for many years. I’m glad I was able to help them get it.", "Three experts we interviewed said the president is wrong.", "“President Trump specifically said they have been fighting in the ‘safe zone’ area that he gave to Turkish control,” Aydıntaşbaş said. “Again, no recorded history of that ever. Turkey has not ‘lost thousands of people in that safe zone.'”", "Henri Barkey, a professor of international relations at Lehigh University and adjunct senior fellow for Middle East studies at the Council on Foreign Relations, was blunt: “This is complete nonsense. He is making things up,” Barkey said.", "Amanda Sloat, a senior fellow in the Center on the United States and Europe at the Brookings Institution, didn’t say Trump was “making things up,” but rather “conflating” Turkey’s ongoing fight against the PKK in Turkey with the perceived threat from the YPG across the border in Syria.", "“Turkey has long been fighting the PKK. Estimates that appear frequently in the press and reports are that 40,000 people have died as a result of the fighting between the Turkish state [and] the PKK,” Sloat said, referring us to a Sept. 13 story in Al-Jazeera about a roadside bombing that killed seven in southeast Turkey. “So the ‘thousands’ who have died are in Turkey as a result of fighting with the PKK, not in Syria as a result of fighting with the YPG there.”", "The CIA also reports that the conflict in Turkey has resulted in 40,000 deaths.", "But, Sloat said, “PKK (in Turkey) are linked to YPG (in Syria),” and “Turkey has long wanted a safe zone.” She said Erdogan since 2013 has been calling for a safe zone “in Syria to push the YPG off its border and to prevent them from connecting several cantons and creating an autonomous Kurdish region, which he believes would threaten Turkish security.”", "That threat, however, has not resulted in “thousands and thousands” of Turkish deaths in northern Syria, contrary to Trump’s claim. Those deaths occurred as a result of a decades-old conflict inside Turkey’s borders.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]