["About this rating", "A woman at a town hall event held by U.S. Rep. Alexandria Ocasio-Cortez abruptly stood up and suggested \"eating babies\" to combat climate change.", "However the woman wasn't an AOC supporter, nor was she actually suggesting eating babies to combat climate change. She apparently was working at the behest of a fringe conspiracy group with a history of such stunts. They stated their intent was to troll Ocasio-Cortez.", "An Oct. 3, 2019, town hall event in New York City hosted by Rep. Alexandria Ocasio-Cortez, D-N.Y., was going smoothly until a woman in a black jacket stood up and started rambling her fears about apocalyptic climate change. Then she took her jacket off, revealing a T-shirt that read, \"Save the planet. Eat the children.\"", "The woman said she was glad Ocasio-Cortez supported the Green New Deal but stated it was not enough. \"Your new campaign slogan has to be this,\" she stated, taking her jacket off and revealing the shirt. \"We got to start eating babies. We don't have enough time. ... Even if you would bomb Russia, we still have too many people, too much pollution!\"", "Words and images from the event shared online prompted reactions from many, including U.S. President Donald Trump and his eldest son, Donald Jr.", "Seems like a normal AOC supporter to me. https://t.co/NWVMRD0wsl", "— Donald Trump Jr. (@DonaldJTrumpJr) October 4, 2019", "During the town hall, Ocasio-Cortez responded to the woman by talking about the need for positive solutions to climate change and concluding, \"We are never beyond hope\" before quickly moving on to another question.", "Although some on the political right criticized her response, Ocasio-Cortez followed up on Twitter by explaining that she had been operating under the assumption that the woman was mentally ill and in crisis.", "This person may have been suffering from a mental condition and it’s not okay that the right-wing is mocking her and potentially make her condition or crisis worse. Be a decent human being and knock it off.", "— Alexandria Ocasio-Cortez (@AOC) October 4, 2019", "It turned out the woman in question was neither an Ocasio-Cortez supporter nor a person having a mental-health emergency but apparently acting at the behest of a group called Lyndon LaRouche PAC. The stunt was meant to troll Ocasio-Cortez.", "Historian Matthew Sweet described the group as a \"bizarre political cult\" in an interview with The Washington Post about the incident. Sweet, who has studied the group's history, told the Post that the woman's stunt fell in line with their standard operating procedures. \"The tactic,\" Sweet told the Post, \"is you go to a political meeting and you create a disturbance that disrupts the meeting, and more importantly, that creates a kind of chaos.\"", "The group, dubbed LaRouchians, has been around for decades, and was founded by conspiracy crank Lyndon LaRouche, who died in February 2019 at the age of 96 after building a \"worldwide following based on conspiracy theories, economic doom, anti-Semitism, homophobia and racism.\"", "LaRouche's conspiracy theories involve proffering claims that the Queen of England controls the international drug trade and that Adolf Hitler, whose forces bombed England in World War II, was a British agent.", "Chiu, Allyson. \"Conservatives Attacked Ocasio-Cortez Over a Bizarre Town Hall Speaker. Now a Pro-Trump Fringe Group Says It Planned the Stunt.\"\r\n  The Washington Post. 4 October 2019.", "Smith, Timothy R. \"Lyndon LaRouche Jr., Conspiracy Theorist and Presidential Candidate, Dies at 96.\"\r\n  The Washington Post. 13 February 2019.", "Kroeker, Jo. \"LaRouche Supporters Take Pro-Trump Stance in Sidewalk Stand in Greenwich.\"\r\n  Greenwich Time. 26 June 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]