["About this rating", "PLU codes used on produce stickers identify qualities such as how food products were grown.", "PLU codes aren't a reliable consumer guide found on all forms of produce.", "Those little round stickers with numbers that shoppers often see on produce items such as apples, bananas, and oranges (as shown in the image displayed above) are Price Look-Up (PLU) numbering codes for fresh, unprocessed produce items. These codes are administered by the International Federation for Produce Standards (IFPS), who maintain a list of five-digit codes (which are sometimes four digits, because leading zeroes are typically not displayed) that identify qualities associated with an particular item of produce, such as its type, its size, where it was grown, and how it was grown:", "PLU codes are 4 or 5 digit numbers which have been used by supermarkets since 1990 to make check-out and inventory control easier, faster, and more accurate. They ensure that the correct price is paid by consumers by removing the need for cashiers to identify the product; e.g., whether or not it is conventionally or organically grown. They are primarily assigned to identify individual bulk fresh produce (and related items such as nuts and herbs) and will appear on a small sticker applied to the individual piece of fresh produce. The PLU number identifies produce items based upon various attributes which can include the commodity, the variety, the growing methodology (e.g., organic) and the size group.", "The last four digits of all the PLU codes issued so far fall into the 3000-4000 range, with the first digit of each code currently assigned one of three values, which are defined as follows:", "0 — Applies to all non-qualified produce (and is generally presented without the leading \"zero\" digit).\n9 — Applies to organic produce", "In short, a five-digit code beginning with 9 identifies an organically grown product, and a five-digit code beginning with 0 (or a four-digit code) marks a non-qualified (i.e., conventionally grown) product. Thus, the PLU code 4318 is assigned to small cantaloupes or muskmelons grown conventionally in the Eastern United States, while the label 94011 would identify any organically grown standard yellow banana.", "However, it is not the case (as suggested by the above example) that consumers can depend upon PLU codes to reliably distinguish between different forms of produce. For starters, the use of PLU codes is optional, so many produce items don't bear them. Additionally, PLU codes were developed for the benefit of suppliers and retailers to assist them in sorting and pricing produce, not to provide reliable information to end buyers, and PLU codes are not the equivalent of USDA Organic certification. (If retailers don't expect to price organic corn differently than conventionally grown corn, for example, they can label the former with just four digits and omit the leading '9' that identifies it as an organically grown product.)", "At this point PLU codes are still more of an unrealized concept than a consistently and universally applied standard, and they were not created for the benefit of consumers, so shoppers concerned about the nature of the produce they buy should rely upon other sources of information.", "If you only want organic produce, look for items that are specifically labeled as \"Organic\"; if you want to ensure you avoid any GM produce, buy only items that are USDA certified as \"100% organic\" (which cannot by law be produced from GMOs). In the latter case consumers might also look for \"non-GMO\" or \"GMO-free\" indicators, but that option is still somewhat problematic as the U.S. government does not yet directly regulate the use of those terms:", "The United States has no government-sponsored food-labeling schemes that state whether or not food products contain GM material. Government regulations do, however, prohibit the presence of genetically engineered material in food that carries the government-approved label assuring that food is produced using organic production processes. Thus, consumers who wish to avoid GM material can buy organic food. Another option for consumers who do not want to buy food that may contain GMOs is to select foods labeled \"GMO-free.\" Such labeling is organized by civil society groups and food companies. To carry the label, foods must comply with standards set by the organizers. The government does not regulate the label but may intervene if there is evidence that the label is misleading.", "Curious consumers can use an application on the International Federation for Produce Standards (IFPS) web site to search PLU codes and find out what products they identify.", "04/10/2015: This article was updated and relisted.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]