["The claim was published on Facebook here on May 6, 2020.", "The text graphic reads: “Black and Decker leaving China and building 90 million dollar plant in Texas!!!”", "Other instances of the claim appear here and here on Facebook.", "The claim is misleading.", "A spokesperson for Stanley Black & Decker, the company’s parent company, told AFP in an email on May 19, 2020 that the firm “will continue to operate in China”.", "Annual corporate reports show that Stanley Black & Decker does have significant operations in China.", "“The Company sources many products from China and other low-cost countries for resale in other regions,\" the company’s 2019 report reads.", "In an earnings call with investors on April 30, 2020, James M. Loree, Stanley Black & Decker president and CEO, said that the company operates 10 factories in China and employs 8,000 workers.", "In May 2019, Stanley Black & Decker announced it would open a new 425,000-square-foot manufacturing plant in Fort Worth, Texas in late 2020. The company did not specify the price of the factory but said it will employ roughly 500 full-time employees and will produce Black + Decker’s CRAFTSMAN mechanics tools.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]