["About this rating", "A photograph supposedly showing the mouth of an adult suffering from hyperdontia (i.e., an excessive number of teeth) has been circulating online for several years. In February 2019, the Facebook page \"Pictures From History\" renewed interest in this image when they shared it on social media with the caption \"Inside the mouth of an adult suffering from Hyperdontia\":", "Hyperdontia is a genuine medical condition involving the growth of more teeth than is usual (also known as \"supernumerary teeth\"), as described by the Lurie Children's Hospital of Chicago:", "Extra teeth, also called supernumerary teeth or hyperdontia, is a condition in which the jaws contain more teeth – usually permanent teeth – than the usual number. These extra teeth are usually categorized in two ways, by their shape and by their position.", "They can be of normal shape but simply be extra (called “supplemental”). They can be barrel-shaped (“tuberculate”), peg-shaped or conical, multiple shapes (“compound odontoma”), or an undefined shape (“complex odontoma”).", "They can form in several places. They may be “mesiodens” (midline), “paramolar” (on either side of the molars), or “distomolar” (behind the molars). Most often occuring is the mesiodens, which is peg-shaped and grows between the top two center teeth.", "However, the viral photograph seen here does not offer a genuine look at the mouth of a person experiencing that condition.", "This image has been online since at least December 2010, when it was shared on the Blogspot blog Holyloly. The image reached a larger audience a few months later when it was included in a post from the SCP Foundation -- a fictional organization that purports to cover a wide range of highly classified materials -- in a blog post about SCP-478, an imaginary disease that causes a body to generate extra teeth:", "SPC-478 will enter a victim’s mouth while they sleep, and attach onto the soft palate in the upper nasal cavity, usually blocking one nostril. The body’s mucus production will increase, leading the victim, upon waking, to believe that they have developed a minor cold. From there, the victim’s palate will begin to generate teeth in addition to the gingiva's (gums) normal replacement of teeth. This growth process will begin at a rate several times faster than normal tooth growth, and quickly increases in speed and severity.", "It's clear that this image was created with the help of digital photo-editing software. It appears that someone took a genuine photograph of a mouth and then duplicated several of its teeth to make it appear as if the picture captured an extremely severe case of hyperdontia.", "Here we've circled a few of the teeth that were digitally repeated throughout this image:", "Interestingly, this isn't the only fake photograph purporting to show an extreme case of hyperdontia. Again, we found that these images were created with the same technique of duplicating existing teeth:", "While researching this article we came across one more example below of this sort of digitally doctored dentistry. This image on the left of the following graphic is often shared as if it showed a person suffering from hyperdontia, but again, this picture was created by digitally duplicated existing teeth. The image on the right of the graphic below, meanwhile, is unaltered and shows the mouth of a person who genuinely experienced a (less severe form of) this condition:", "Parolia, Abhishek.   \"Management of Supernumerary Teeth.\"\r\n    Journal of Conservative Dentistry.   July 2011.", "Lurie Children's Hospital.   \"Extra Teeth (Supernumerary Teeth, Hyperdontia).\"\r\n    Retrieved 4 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]