["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Two men with rifles appear to guard a building entrance in a dated image that is being shared on Facebook as an example of the good that can come from arming school personnel and students.", "Text above the image says, \"1973, a student and teacher guarding a Delaware high school after someone called in a shooting threat during a morning class. Juniors, seniors, and teachers went to their cars and trucks to grab their guns, and guard the doors between classes. No shooter ever arrived.\"", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post gets this much right: The photograph was indeed taken outside of a Delaware high school in 1973. But the rest of the description falls short.", "Best we could tell, the claim dates back to a 2016 reddit thread. The thread begins with the photograph and this description:", "\"A Student and Teacher Guarding The High School In My Hometown In 1973. There Was A Shooting Threat Called In The Morning. Students and Teachers Alike Pulled Their Shotguns From Their Trunks To Guard The Doors Between Classes.\"", "Caleb South, who runs the blog Christians Against School Violence, tracked down the high school in 2018 after the photo became popular on social media following the deadly school shooting in Parkland, Fla.", "The photograph depicts two students (neither was a teacher) sitting outside Caesar Rodney High School in Camden, Del., in 1973. But the young men, said to be seniors Kendall Cool and Carl Willoughby, were not guarding the school because a shooting threat was made that morning.", "An inquiry by South inspired  some Caesar Rodney alumni to explain the background of the photograph in a Facebook group post:", "\"... spring ‘73’ we had a series of bomb scares at the time and Kendall and Carl brought their hunting rifles to the door for a photo op. I believe it was exam week and seemed like everyone knew when the bomb scares were coming in, totally upset the exam schedule…\"", "\"One other funny thing about it was that it was the week of the Dover football game. We got bomb scares called in 2/3/4 times a day and by Wednesday or Thursday they decided to post 2 letterman at each door. Someone had a couple of shotguns out in the truck and (thought) it'd make for a funny (photo) op. This was it. Btw, guns were empty.\"", "It is accurate that the school experienced a spate of false bomb threats that academic year, but according to local news reports, it appears to have occurred in the fall semester.", "According to a November 9, 1972 article in the Wilmington News Journal, the school received a series of bomb threats over multiple days, each resulting in the evacuation of the school’s 1,600 students. The article said the Board of Education was offering a \"$100 reward for information leading to the arrest and conviction of the persons or person who have called in more than 10 bomb threats to the high school.\"", "About a week later, the newspaper reported that police arrested three juveniles, all students from the school, and charged them with making false bomb threats.", "As well, many of Caesar Rodney’s yearbook photos were uploaded online, and the photograph of the two young men can be found in the 1973 collection.", "A viral image post online claims it depicts a student and teacher guarding a high school in 1973 after a shooting threat was made that day, and that because they and others were armed, \"no shooter ever arrived.\"", "The image features two students (not a teacher) with guns outside of a Delaware high school in 1973, but there was no shooting threat. A series of bomb threats were reportedly made against the school that academic year, and alumni of the school say the picture of the young men was taken for a yearbook photo op.", "The post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, May 22, 2019", "Reddit thread, 2016", "Christians Against School Violence, Delaware High School 1973: What Actually Happened?! , April 10, 2018", "Caesar Rodney High School alumni Facebook page, Accessed May 22, 2019", "Wilmington News Journal Nov. 9, 1972, pg 3 ; Accessed May 22, 2019", "Wilmington News Journal Nov. 16, 1972, pg 38; Accessed May 22, 2019,", "Photobucket, Caesar Rodney High School 1973 yearbook, Accessed May 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]