["This Facebook post, shared more than 21,000 times since it was published April 18, 2019, contains a black-and-white image that shows DiCaprio standing beside a young man who looks like him.", "DiCaprio is a Hollywood actor. Here is his official website.", "The post’s caption is in English and Filipino. When translated, it says: “Leonardo DiCaprio's son. He is an exact copy of him”.", "Below is a screenshot of the post:", "The same image and claim have been shared elsewhere on Facebook, for example here.", "A reverse image search on Google traced the picture back to this colour photo of DiCaprio dated February 28, 1994, on the website of Getty Images.", "Below is a screenshot of the photo as it appears on the Getty Images site:", "The caption on the photo says: “Actress Gwyneth Paltrow and actor Leonardo DiCaprio attend the 65th Annual National Board of Review of Motion Pictures Awards on February 28, 1994 at the Equitable Center in New York”.", "Below is a comparison of screenshots of the misleading photo (L) and the original image (R):", "Another reverse image search using verification tool Tineye traced the photo of the older DiCaprio to this image taken in 2009, also on the Getty Images website.", "Below is a screenshot of that photo as it appears on the Getty Images site:", "The caption of the photo says: “Leonardo DiCaprio and Kate Winslet attend the UK premiere of ‘Revolutionary Road’ at Odeon Leicester Square on January 18, 2009 in London, England”.", "Below is a comparison of the misleading photo (L) with the original image (R):", "DiCaprio is not known to have any children.", "When asked whether he had time to start a family in this 2016 interview with Rolling Stone magazine, he was quoted as saying: \"Do you mean do I want to bring children into a world like this? If it happens, it happens.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]