["About this rating", "Editor's Note: The Associated Press reported that John Madden died at the age of 85 on Dec. 28, 2021. The fact check below pertains to a hoax that circulated online in 2014 and 2016.", "A rumor about Hall of Fame coach John Madden's alleged death started circulating online in April 2016:", "The rumor started after the web site LockerDome put up a link to a fake news article, which was published on 29 April 2014 by the entertainment web site Empire Sports:", "NFL fans cover your eyes, Super Bowl winning head coach John Madden was found this morning dead at his Pleasanton, California home.", "Paramedics responded to a call made early this morning and found the 78 year old Hall-of-Fame coach sitting upright on his couch with a microphone in his hand.  The Pleasantville Medical Examiner has not released the cause of death but no foul play is suspected.", "There was no truth to this story when it was initially published in 2014. There was still no truth to this fake news item when it recirculated two years later, at a time when John Madden was still alive and well at 80 years old (not 78).", "Empire Sports, like the related Empire News, is one of many \"satire and entertainment\" web sites that publishes only hoax stories:", "Empire Sports uses invented names in all its stories, except in cases when public figures are being satirized. Any other use of real names is accidental and coincidental.", "LockerDome is an interest-based social network that started as a place for sports fans to gather online but later expanded to include other interests.", "Update [Dec. 28, 2021: Update to report that John Madden died on Dec. 28, 2021.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]