["The images were published here on Facebook on July 24, 2020. The post has been shared more than 4,200 times.", "It shows a screenshot of a Facebook post that features two photos of a dirty toilet, geotagged to Kandy railway station. The dateline reads “yesterday”. The post states: “A toilet room on the Intercity express of Sri Lankan railways”.", "The post’s Sinhala-language caption translates to English as: “This is how a foreigner promoted the Colombo-Kandy Intercity express train, internationally.”", "The same screenshot was also shared here, here, here and here on Facebook, alongside a similar claim.", "The images, however, have been shared in a misleading context.", "The Facebook user named in the screenshots in the misleading posts published this statement refuting the claims on July 24, 2020, saying the photos were published online and subsequently deleted “two - three years ago”.", "It reads, in part: “My past timeline (uploaded two - three years ago) about toilet in the train is getting hot in SL today. About the timeline someone uploaded yesterday was copy, muster has been erased two - three years ago and I already apologized at that time.”", "In response to the posts, M J D Fernando, the general manager of Sri Lanka Railways, told AFP the image has circulated online “a few years back” and does not reflect the current state of the toilets.", "During a phone conversation on July 31, 2020, he said: “As soon as this claim was brought to my attention, we checked the sanitation facilities of not just the train in question - but all intercity and confirmed that the sanitation facilities were not in such a poor condition.", "“We also checked the passengers details on the date for the train in question and confirmed no foreigners travelled in the train on the date mentioned in the social media posts circulating the misleading claim.”", "In response to the misleading posts, Sri Lanka Railways’ administration officer for Galle district Wiraj Nanayakkara published this Facebook post on July 24, 2020. It states the photos are old and the train toilets have since been updated.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]