["About this rating", "Good Friday, the Friday preceding Easter, is the day on which Christians commemorate the crucifixion and death of Jesus Christ, and the occasion of Jesus' suffering and dying so that all humans, be they believers or unbelievers, could be redeemed by Christ's sacrifice.  That nomenclature has prompted many a person to ponder why Christians use the adjective 'good' to describe a day on which God's only son was cruelly tortured to a slow and painful death.", "One of the most common explanations offered regarding the origins of the name 'Good Friday' is that 'good' derives from 'God,' and thus this holy day is actually 'God's Friday':", "The word good may also relate in its etymology to the word God. Our term goodbye is apparently a contraction of the phrase God Be With You. Perhaps Good Friday hails from a medieval phrase meaning God's Friday.", "However, as University of Minnesota linguistics professor Anatoly Liberman has written at length, no linguistic relationship exists between the words 'good' and 'God':", "A reader commented on my recent statement that Engl. good and god are unrelated and noted that this statement, in addition to being counterintuitive and undemonstrable, can even lead to schisms. Being a peaceful man, I am very much against all kinds of hostilities. Nor do I think that the history of words should interfere with faith to such an extent as to result in religious wars. But good and god are indeed unrelated.", "Good has transparent etymology: gather and -gether are related to it. Their root means \"fit, suitable.\" This circumstance is borne out by numerous cognates in and outside Germanic. That is \"good\" which has been \"fixed,\" \"assembled,\" \"put together\" in a proper way. By contrast, the origin of god is debatable, which does not mean that we know nothing about its derivation.", "Whatever the etymology of god may be, god and good are not related. I should also say that reference to intuition, if intuition means an undisciplined emotion, should be avoided. Etymology is a study of word history and presupposes a professional look at the development of sounds, grammatical forms, and meaning in many languages. \"Intuitively,\" deus and theos are two variants of the same word, but they are not. The term folk etymology covers suggestions of the theos-deus and god-good type: the temptation to connect look-alikes is irrepressible, but, unless we choose to remain in pre-scientific etymology, it should be resisted.", "The Catholic Encyclopedia suggests that the name of Good Friday derives \"from the German Gute Freitag, and not specially English,\" but in the German language Good Friday is known as Karfreitag, which means \"Sorrowful Friday.\"", "Another theory holds that the day marking solemn occasion of Jesus' crucifixion is termed Good Friday because, ultimately, a great deal of good came from it:", "That terrible Friday has been called Good Friday because it led to the Resurrection of Jesus and his victory over death and sin and the celebration of Easter, the very pinnacle of Christian celebrations. Although Christians, from the very fundamental to the very liberal, vary in their interpretations of exactly how the death of Jesus on the cross frees man from his sins and gives him everlasting life, and exactly what everlasting life means, they all agree that it took the death and burial of Jesus on that Friday to make the victory of the Resurrection possible. John simply says: \"For God so loved the world that he gave his only Son, that whoever believes in him should not perish but have eternal life.\"", "This interpretation may aptly describe how many Christians regard Good Friday, but no linguistic evidence suggests that it provided the name for the day that marks Jesus' suffering and dying for all our sins.", "The generally accepted etymology of 'Good Friday' is that the 'good' stems from a very old use of that word, a Middle English meaning that was equivalent to \"holy\" (especially when used to designate holy days or seasons observed by the church):", "The one [theory] supported by both the Oxford English Dictionary and every language expert I contacted, is that the name comes from an antiquated meaning of good. \"The answer seems pretty clearly to be that it's from good [meaning] 'holy,'\" responded Jesse Sheidlower, the president of the American Dialect Society, when I put this question to him. Liberman agreed, noting that if you consider the other names for Good Friday — \"Sacred Friday\" in the Romance languages (Viernes Santo, e.g.), \"Passion Friday\" in Russian — \"the OED's explanation makes excellent sense.\" The OED also notes that there was once Good Wednesday, the Wednesday before Easter, which these days is more commonly known as Holy Wednesday.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]