["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If the promise of free money in social media posts seems too good to be true, it probably is. And the link to seek those payments will probably lead you to a web page with a picture of a gorilla giving the camera the finger.", "That’s what happens if you follow the link on recent posts claiming that \"if you have worked during the COVID-19 pandemic, the Department of Labor has finally authorized up to $4,800.00 in hazard pay for qualified essential workers.\" An image with the post shows the logo of the New York State Department of Labor, where residents can file unemployment claims.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ve already fact-checked several fake posts making claims about second stimulus checks, FEMA cash for essential workers and weekly payments for Americans hurt by the coronavirus. They are all hoaxes directing people to click on the link that opens the image of the gorilla.", "New York Gov. Andrew Cuomo has called on the federal government to provide hazard pay for \"essential public workers on the front lines.\"", "But the latest proposed coronavirus stimulus package from the U.S. Senate does not include hazard pay, drawing criticism from Democrats.", "We rate this Facebook post Pants on Fire.", "Facebook post, July 28, 2020", "Gov. Andrew Cuomo’s website, Amid ongoing COVID-19 pandemic, Governor Cuomo calls on federal government to provide hazard pay to essential public workers, April 20, 2020", "Newsweek, GOP stimulus bill criticized for denying hazard pay to essential workers, July 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]