["There were 8,244 full time equivalent health visitors in the NHS as of December 2017, the lowest number since August 2013.", "Correct, for the NHS in England.", "Health visitor numbers peaked in October 2015 at 10,309. Numbers have fallen by 2,065 or 20% since then.", "Correct, for the NHS in England.", "“There were 8,244 full time equivalent health visitors working in the NHS as of December 2017, which is the lowest number since August 2013. Numbers peaked at 10,309 in October 2015, meaning there has been a fall of more than 2,065 health visitors or 20% in just over two years”.", "Labour Party, 19 April 2018", "It’s correct there were the equivalent of over 8,200 health visitors working full-time in the NHS in England as of December 2017.", "It’s also correct that that’s a fall of more than 2,000 health visitors since October 2015.", "Since NHS workforce numbers tend to vary according to the season, we usually need to compare the same month in each year to see more clearly what the change has been. In this case though the figures are roughly the same when we compare to December 2015.", "In December 2009 there were just over 8,000 health visitors, and that level remained fairly constant until December 2013, when it started to rise. At around the peak in December 2015, there were about 10,200, meaning numbers have fallen by 19% since then.", "These numbers are all ‘full-time equivalent’. Full-time equivalent is the number of staff there would be if you added together all their hours to create only full-time jobs. So for example two people working half a week each would add up to one full-time equivalent job.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "Health visitors are specially qualified nurses and midwives who work with the community. They mainly work with very young children and their families. They also work with at-risk groups like homeless people, those with addictions and travellers. Responsibility for the commissioning of health visiting services was moved from NHS England to local authorities in 2015.", "The health think tank King’s Fund has commented on recent dips in the number of nurses and health visitors combined. It says that “The key factor in the fall” is the lower number of nurses from the EU joining the UK nursing register, and an increase in EU staff leaving the NHS. They also note more staff leaving as a result of ill-health and for reasons of work-life balance.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]