["By Saranac Hale Spencer", "Posted on April 30, 2019", "An unsubstantiated claim from last fall about sexual violence at the southern border has been repackaged in a Facebook meme. U.S. Customs and Border Protection has no record of the alleged incident, and the website that first reported it has retracted the story.", "Once fiction has been presented as fact, it’s hard to take back. Misinformation takes on a life of its own.", "That’s what happened with an unverified claim that was posted last year and, even though it was retracted, is now circulating on Facebook as though it’s true.", "Here’s what happened: On Nov. 6, 2018, a website called TheBlaze, founded by conservative commentator Glenn Beck, posted a story about a group of women who went to the border between Texas and Mexico “to get a first-hand look at the border and to witness for themselves the effects of illegal immigration on families who live there.” The story quoted one of the organizers of the trip, Kimberly Fletcher, talking about a young girl who had been repeatedly raped.", "TheBlaze, Nov. 6, 2018: A few months ago, border security agents found a 6-year-old girl who had been left for dead along a pipeline.", "The girl was flown to a military hospital where physicians found DNA from 30 men inside her young body.", "“She had been raped by 30 men!” Fletcher said, adding that this little girl’s life is worth building a wall to keep violent men from coming into the country.", "But there’s no evidence that happened. Roger Maier, spokesman for U.S. Customs and Border Protection confirmed to FactCheck.org that CBP has no record of such an incident.", "Fletcher, reached by phone, told us that she had heard the story from someone else and, after looking into the claim and thinking more about it, doesn’t actually believe it to be true. Fletcher regrets having repeated the claim before looking into it, she said, since the story could cast doubt on real tragedies that are happening at the border.", "“I should have checked into it,” she said. “Did it really happen? Is there any evidence that it happened?”", "Fletcher concluded, “I cannot believe that if it did happen, that it wouldn’t have been reported everywhere.”", "After posting the quote, TheBlaze corrected its story and removed the claim. It now has this editor’s note at the top of the story:", "Editor’s note: The original version of this story reported a claim made by Moms For America President Kimberly Fletcher concerning a girl who had allegedly been found by border security agents with “DNA from 30 men inside her young body.” This claim has been made by numerous individuals on social media but TheBlaze has been unable to independently verify the factual accuracy of the claim. Its publication does not meed [sic] our editorial standards and it has accordingly been removed, along with an embedded video in this story that made the claim. We regret having published it.", "However, the claim was still picked up and repeated by a notoriously unreliable website called NewsPunch in a story posted on Dec. 2, 2018.", "Although that site has now deleted the story, a screenshot of a tweet that promoted the NewsPunch headline has now started circulating on Facebook, where it is prompting angry comments from people who believe it’s true.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network. Our previous stories can be found here.", "Pruet, Jana. “‘Moms Caravan’ travels to the Texas-Mexico border for a look at the effects of illegal immigration.” TheBlaze.com. 6 Nov 2018.", "Maier, Roger. Spokesman, U.S. Customs and Border Protection. E-mail sent to FactCheck.org. 29 Apr 2019.", "Fletcher, Kimberly. President, Moms For America. Phone interview. 30 Apr 2019.", "Adl-Tabatabai, Sean. “Border Agents Discover Body Of 6-Year-Old Girl: ‘She Was Raped By 30 Men.’” NewsPunch.com. 2 Dec 2018.", "@suzy4peace. “6-yr old girl found dumped at the border, flown to a military hospital where doctors found DNA from 30 men who had raped her. This is your caravan.” Twitter. 4 Dec 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]