["About this rating", "In early July 2020, Goya Foods CEO Robert Unanue went to the White House's Rose Garden to discuss U.S. President Donald Trump's Hispanic Prosperity Initiative, an executive order that aimed to increase educational and economic opportunities for Hispanic Americans.", "Founded in 1936 by Spanish immigrants, the popular food and seasonings company has been a staple household item for many Hispanic Americans, but is now at the center of a political divide, since Trump has long been unpopular in the Hispanic community.", "At the White House event, Unanue announced that he would donate 1 million cans of chickpeas and 1 million pounds of other food items to food banks. In his remarks, he said:", "We’re all truly blessed...to have a leader like President Trump who is a builder. And that’s what my grandfather did, he came to this country to build, to grow, to prosper … and we pray, we pray for our leadership, our president, and we pray for our country.", "The backlash was swift, prompting a boycott of the company's products using the hashtag #Goyaway.", "Prominent Hispanic American Democrats like Rep. Alexandria Ocasio-Cortez and former presidential candidate Julián Castro suggested boycotting their products and #Goyaway began trending alongside #BoycottGoya.", "Meanwhile, Republicans spoke out in support of Unanue’s remarks, and Trump supporters reacted to the backlash with a \"buy-cott,\" calling on more people to buy Goya products.", "Only 32% of Hispanic American voters — a significant voting group — back Trump, according to a June report from the Pew Research Center. Much of his unpopularity can be boiled down to his past comments calling Mexican immigrants “rapists,” policies separating asylum seeking families along the U.S.-Mexico border, and his efforts to build a border wall.", "Unanue, in an interview with Fox News on July 10, said the criticism of his White House visit was \"suppression of speech.\" He said he had participated in an Obama administration event before, and perceived this reaction as a double standard. He also said he would not apologize for his remarks:", "So, you’re allowed to talk good or to praise one president, but you’re not allowed ... to aid in economic and educational prosperity? And you make a positive comment and all of a sudden, that's not acceptable.", "We should note that Unanue and his family have mostly donated to Republican causes and candidates in recent years.", "Snopes reached out to Goya Foods for comment, and will update this post if they respond. In previous statements, the company did not remark on the boycott, instead focusing on the purpose of Unanue’s White House visit, which was to support Trump’s initiative.", "Due to the overwhelming response from across the political divide, and Goya Foods’ CEO’s own defense of his comments, we rate this claim as a \"Correct Attribution.\"", "Fordham, Evie.   \"Goya 'Buy-cott' Begins as Customers Load Up on Product After Trump Backlash.\"\r\n   Fox News.   10 July 2020.", "Goldman, David.   \"Goya CEO Tells Fox He Won't Apologize After His Praise for Trump Sparks Boycott.\"\r\n   CNN.   10 July 2020.", "Goldman, David.   \"Goya Foods Boycott Takes Off After its CEO Praises Trump.\"\r\n   CNN.   10 July 2020.", "Nelson, Joshua.   \"Goya Foods CEO Won't Apologize in Face of Boycott, Backlash for Pro-Trump Remarks: 'Suppression of speech'.\"\r\n   Fox News.   10 July 2020.", "Pew Research Center.   \"Public’s Mood Turns Grim; Trump Trails Biden on Most Personal Traits, Major Issues.\"\r\n   30 June 2020.", "Romero, Dennis.   \"Goya Foods' CEO Said U.S. 'Blessed' to Have Trump as a Leader, and Calls For Boycott Quickly Followed.\"\r\n   NBC News.   9 July 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]