["The video features in numerous online posts, including this one on Facebook by popular Nigerian online news blogging platform Instablog9ja.", "“Drama as bride finds out that her groom has been sleeping with her chief bridesmaid on their wedding in PH, Rivers State,” reads the caption on the post that has racked up more than 1,600 shares since February 13, 2021.", "PH refers to Port-Harcourt, the capital city of Rivers state in southern Nigeria.", "Popular Nigerian entertainer Tunde Ednut, whose posts have previously been debunked by AFP Fact Check here and here, also published the footage on Instagram claiming the bride “stopped the car on the road and ended the wedding right there”.", "Elsewhere, the video has been viewed more than 180,000 times on Twitter while other Facebook posts claim it was filmed in Enugu state, in southeastern Nigeria.", "However, the claims are false.", "The footage was a publicity stunt called “Romeo and Juliet”, performed by a church group to raise awareness about their annual Valentine’s Day programme.", "Using the InVID WeVerify tool, AFP Fact Check ran several reverse image searches on keyframes of the video and traced the viral footage to a similar clip published on this Facebook page.", "The page is run by a branch of Gateway International Church (GIC) located in Choba, a university area in Port-Harcourt. GIC is one of the most popular Pentecostal churches in Rivers state with a large youth congregation.", "The GIC video features the same people seen in the viral footage, including the supposed bride and groom.", "“Romeo and Juliet rally/offline publicity was a blast, exceptional creativity!” reads the caption on the Facebook post published by the church on February 12, 2021.", "At the 1’ 15” mark, the crowd in the video clip can be seen dancing to a song while the hype man says “Romeo and Juliet”.", "The GIC in Choba confirmed its drama group had staged the street production.", "“‘Romeo and Juliet’ is an annual event in the church usually held around the Valentine season,” the church's pastor Chidi Courage told AFP Fact Check. “The drama was staged to create awareness on the year’s theme ‘Soulmates and Bedmates’.”", "Contacted by AFP Fact Check, a member of the church’s drama group explained that “Romeo and Juliet” has been performed for the past five years. For the 2021 edition, they acted out scenes of a dysfunctional relationship in public to highlight the consequences of infidelity.", "“It is not real,” Ella Agbo, the church’s drama coordinator told AFP Fact Check, explaining that the group had already clarified this on its Instagram page. “The viral video  was an excerpt of the drama filmed by an onlooker and shared online with a misleading context.”", "In one of their recent posts on Instagram, Agbo is seen alongside some of the actors on the social network dismissing the claim as false.", "“It was actually a street drama acted out by these actors here to create awareness for our church’s Valentine programme,” she said on Instagram.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]