["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "False information is spreading on Facebook via a meme that supposedly compares monthly  benefits for refugees with Social Security. The meme is a version of a false claim that’s circulated in Canada for years.", "\"Illegal refugees get $3,874/mo. Under the Federal Assistance Program. Our SS checks are approximately $1,200/mo.,\" said a meme posted on Facebook on Oct. 29 and so far shared more than 80,000 times.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Several elements of the claim about refugees are inaccurate or unsupported. The amount on Social Security checks is closer to the truth.", "One of the main things that’s off about the claim is its characterization of refugees as \"illegal.\" Refugees are not here illegally. They enter the country legally under a refugee status and must apply for permanent lawful status one year after their arrival. The implication that they don’t have a legal status is baseless.", "Refugees come to the United States because they are fleeing wars or persecution in their homelands. Upon arrival, many don’t speak English and are unfamiliar with U.S. culture and norms. The United States offers them assistance with the aim of making them socially and economically self-sufficient. That aid is time-limited.", "The U.S. Health and Human Services Department, which has an agency in charge of refugee resettlement, did not provide PolitiFact an estimate on how much refugees receive per month under U.S. programs. Refugee Cash Assistance (RCA) and Refugee Medical Assistance (RMA) are available for eligible refugees for up to eight months from their date of arrival in the United States.", "In September 2017, for a story on refugee resettlement costs, an HHS spokeswoman told PolitiFact that the amount and type of federal assistance provided to refugees during their eligibility period can vary greatly. Cash and medical assistance are handled at the state level, and the state cost-sharing amounts vary significantly from state to state, HHS spokeswoman Victoria A. Palmer then told us.", "A State Department spokesperson told PolitiFact that the department provides a Reception and Placement per capita grant to nine national resettlement agencies to cover a portion of the initial reception, basic services, and material goods that resettlement agencies are required to provide to arriving refugees during their first 30 to 90 days in the United States.", "In fiscal year 2018, each grant totals $2,125 per refugee, according to the State Department. That includes assistance with rent, furnishings, necessary clothing, and food, as well as funding for the resettlement agency affiliate to provide case management services, cultural orientation, and connect refugees with employment services and English language classes, among other services, the State Department said.", "The specific $3,874 figure mirrors a 2017 Facebook post falsely claiming that’s how much one \"illegal\" refugee in Canada received per month from the \"federal assistance program.\"", "Besides wrongfully labeling refugees as \"illegal,\" the post had several other shortcomings. For instance, the payment was not for one refugee, but for a family of five; and the $3,874 was not a recurring monthly payment. That amount did include some regular monthly benefits for housing, food, and transportation, but it also listed one-time \"start-up\" benefits and a loan, Snopes found in 2017.", "More than a decade ago, the Canadian government debunked a version of a false comparison of payments to refugees and pensioners. But that erroneous information persists and has transitioned from chain emails to social media posts.", "In December 2015, the public editor for Canada’s The Toronto Star wrote: \"Refugees to Canada do not get more financial help from the federal government than Canadian pensioners do. Unfortunately, the myth that they do is rooted in a mistake in a Toronto Star letter to the editor published in 2004.\" The editor wrote that the mistake had \"come full circle\" — because it was published again in 2015 in another letter to the editor.", "Social Security beneficiaries include retirees and people with disabilities.", "The average Social Security disability benefit in 2018 is $1,200 per month and the average Social Security retirement benefit in 2018 is $1,422 per month, said Darren Lutz, a spokesman for the Social Security Administration.", "A Facebook post claims, \"Illegal refugees get $3,874/mo. Under the Federal Assistance Program. Our SS checks are approximately $1,200/mo.\"", "Refugees are not in the United States illegally. The $3,874 figure traces back to a false claim circulating in Canada. The U.S. Health and Human Services department, which handles refugee resettlement, did not provide an estimate on how much refugees receive in assistance per month, but a department spokeswoman previously told us that the number can vary greatly. Social Security beneficiaries, such as retirees, on average receive more than $1,400 per month.", "The Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook meme, Oct. 29, 2018", "Email interview, State Department press office, Nov. 19-20, 2018", "Email interview, Social Security Administration spokesman Darren Lutz, Nov. 19, 2018", "Email interview, U.S. Health and Human Services press office, Nov. 19, 2018", "Thestart.com, A mistake that travelled around the world and back again: Public Editor, Dec. 11, 2015", "Snopes.com, Do ‘Illegal’ Refugees Receive $3,874 Per Month from the Government?,  Nov. 15, 2017", "PolitiFact, Estimating costs of refugee resettlement in the United States, assistance in home region, Sept. 21, 2017", "Internet Archive page: Canadian government - Financial assistance for refugees, date modified Nov. 11, 2006", "U.S. Health and Human Services Department, About Cash & Medical Assistance, last reviewed Nov. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]