["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker visited with welding students at Waukesha County Technical College in October 2013.", "In February 2012, one of the Democrats who aimed to unseat Gov. Scott Walker in Wisconsin’s historic recall election made an aggressive claim.", "Former Dane County Executive Kathleen Falk said Walker enacted \"the biggest cuts to education in our state’s history.\"", "We rated the statement True. Among the $1.1 billion in education cuts in Walker’s 2011-’13 state budget was a reduction of $71.6 million, or 30 percent, in general state aid for technical colleges.", "And the governor has since restored only a fraction of that funding.", "So, we wondered about Walker’s claiming in a new TV ad, which his campaign highlighted in an Aug. 13, 2014 news release, that he has \"invested over $100 million in worker training.\"", "The system", "The state's tech school system has a long history and a large clientele.", "In 1911, Wisconsin became the first state to establish a system of state aid and support for industrial education, according to the nonpartisan Wisconsin Legislative Council. Currently, the Wisconsin Technical College System has 16 schools that serve some 380,000 students each year.", "The tech schools’ primary mission is occupational education and training, although they also provide general education, career counseling and other services.", "As for financing, the largest share of the tech system's funding, slightly more than 50 percent, comes from property taxes.", "But given Walker’s claim, our focus here is on state spending.", "State funding", "General state aid to technical colleges remained virtually unchanged during the eight years under the previous governor, Democrat Jim Doyle. It ranged between $118 million and $119 million per year.", "Walker cut the allocation to $83.5 million for each year of his first budget, causing the $71.6 million reduction for 2011-’13 that we mentioned. He kept the funding at $83.5 million the following year, then bumped it up to $88.5 million in 2014-’15, still well below the Doyle levels.", "But when Walker first made the reductions, the tech system told us it estimated that 60 percent of the reductions were offset by savings the system was able to make as a result of Act 10, Walker’s collective bargaining reform law. That law required most public employees pay for a larger share of their pension and health benefits.", "Beyond that, the reductions were in general aid -- which can be used for many purposes, including general education and overhead, as well as worker training. They weren’t cuts in funding strictly for worker training.", "The claim", "As for Walker’s claim of investing more than $100 million in worker training, the governor in February 2013 said he would invest $132 million from various sources, including nearly $100 million in state money, to build a faster system to track jobs data, tie technical school and university funding to filling high-demand professions, and require nearly 76,000 people to train for work to collect food stamps.", "A key point here is that, although Walker has not restored all of the general state aid he had cut to the tech schools, he was adding money to other types of job training.", "Here are some of the larger worker training allocations:", "$35.4 million in increased workforce training grants in a March 2014 law. It requires the state Department of Workforce Development to fund initiatives such as reducing waiting lists for technical college programs in \"high-demand\" fields and collaborative efforts by school districts, tech schools and businesses to train high school students in high-demand fields.", "$31 million in the 2013-’15 state budget to carry out a new requirement that able-bodied adults who don't have dependent children work or get work training in order to receive food stamps.", "$22.5 million in the 2013-’15 state budget for new \"incentive grants\" to University of Wisconsin System institutions for economic development programs, programs that aim to develop the workforce and programs that make post secondary education more affordable for state residents.", "$20 million in a March 2013 law to the state Department of Workforce Development to provide grants to private and public organizations for training unemployed and underemployed workers. Of that amount, $15 million is for grants and the rest to run the program.", "$4.21 million in additional money for the state's vocational rehabilitation program through a December 2013 law.", "Those initiatives alone exceed $100 million. Walker's campaign provided us a spreadsheet listing those initiatives and others totaling nearly $178 million.", "However, whether the full $178 million could be considered worker training is debatable. For example, $12 million is allocated for \"WorkKeys,\" a job skills assessment that is intended \"to help high school pupils identify necessary coursework and provide another indicator for career readiness.\"", "Our rating", "Walker said he has \"invested over $100 million into worker training.\"", "The governor has directed more than $100 million into a variety of new worker training programs. But his statement needs clarification in that he also cut general aid to technical colleges, some of which is used for worker training.", "Our rating is Mostly True.", "YouTube, Gov. Scott Walker campaign \"It's Working\" ad, posted Aug. 13, 2014", "Wisconsin Legislative Fiscal Bureau, 2013-’15 state budget for University of Wisconsin System", "Wisconsin Legislative Fiscal Bureau, 2013-’15 state budget for Department of Health Services", "Wisconsin Legislative Council, workforce training grants memo, March 25, 2014", "Wisconsin Legislative Council, workforce training program memo, April 22, 2013", "PolitiFact Wisconsin, \"Recall candidate Kathleen Falk says Gov. Scott Walker enacted ‘the biggest cuts to education in our state’s history,’\" Feb. 19, 2012", "PolitiFact Wisconsin, \"Democratic state Rep. Fred Clark says Gov. Scott Walker cut technical college job training by $70 million,\" Feb. 5, 2012", "Wisconsin Legislative Council, \"Funding and Governance of the Wisconsin Technical College System,\" July 11, 2014", "Wisconsin Legislative Fiscal Bureau, memo to Study Committee on the Review of the Wisconsin Technical College System Funding and Governance, July 24, 2014", "Gov. Scott Walker campaign, spreadsheet listing $118 million in state expenditures, provided Aug. 12, 2014", "Milwaukee Journal Sentinel, \"Scott Walker seeks $100 million for job training, data tracking,\" Feb. 10, 2013", "Gov. Scott Walker, news release, Feb. 10, 2013", "Email interview, Gov. Scott Walker campaign spokesman Tom Evenson, Aug. 14, 2014", "Interview, Wisconsin Technical College System president Morna Foy, Aug. 14, 2014", "Email interview, Assembly Democratic Leader Peter Barca communications director Laura Smith, Aug. 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]