["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Both Hillary Clinton and Gov. Scott Walker have made Walker's defunding of Planned Parenthood in Wisconsin an issue in the 2016 presidential campaign.", "Well before the release of videos that ignited debate about the sale of fetal body parts, Republican Gov. Scott Walker boasted about defunding Planned Parenthood in Wisconsin.", "In a video of her own released Aug. 3, 2015, Hillary Clinton attacked Walker’s move.", "\"When politicians talk about defunding Planned Parenthood, they're talking about blocking millions of women, men and young people from life-saving, preventive care, cancer screenings, breast exams, birth control. They're talking about cutting people off from the health care provider they know and trust,\" Clinton said.", "\"Unfortunately, these attacks aren't new; they're more of the same. We've seen them in Wisconsin, where Governor Walker defunded Planned Parenthood and left women across the state stranded with nowhere else to turn.\"", "The claim by the leading Democratic contender for the White House runs counter to statements made by Walker, who has said during his presidential campaign that he simply transferred money from Planned Parenthood to other organizations.", "What we found is that when it comes to cancer screenings, breast exams and birth control, women in some parts of the state -- particularly those with lower incomes -- lost their local health care provider and might have to travel much farther for services. That’s because Planned Parenthood shut down five facilities after losing the state funding.", "At the same time, the closures were done in only certain parts of the state. And it goes too far to say the former Planned Parenthood patients have \"nowhere else to turn,\" given that they were referred to other providers -- albeit, in some cases, providers outside their home community.", "Defunding in Wisconsin", "Clinton’s campaign cited a number of news articles that detailed the defunding as well as the fallout. We went to a Planned Parenthood of Wisconsin leader to fill us in further.", "Nicole Safar told us the group was getting public funding for family planning services (but none for abortion services) from three sources: a direct federal grant and from Medicaid, both of which continue; and from the state, in the form of an annual grant.", "Walker \"defunded\" Planned Parenthood by taking aim at the only source he controlled.", "In his first state budget, for 2011-’13, Walker proposed eliminating $1.9 million per year in state grants for family planning activities such as contraceptive services and supplies, pregnancy testing and cervical cancer screening.", "About $1 million of that had been going to nine Planned Parenthood clinics, with the rest given primarily to other private organizations and county health departments.", "In analyzing Walker’s proposal, the Legislative Fiscal Bureau, the state’s nonpartisan budget scorekeeper, said the potential effects were unclear. The clinics losing the state funding would have to replace those dollars or change their operations. On the other hand, most of the revenues generated for the services that those clinics provided came from sources other than the state.", "Before adopting the 2011-’13 budget, the Legislature rejected Walker’s proposal to eliminate the $1.9 million in grants. Instead, it reduced the amount to $1.7 million.", "But it also changed state law so that any agency that provides abortion services could not receive the money.", "That meant Planned Parenthood lost its $1 million-per-year allocation.", "Over roughly the next three years, Planned Parenthood closed five of the nine clinics that had been receiving the state money -- in Fond du Lac, Beaver Dam, Johnson Creek, Chippewa Falls and Shawano. (Currently, Planned Parenthood has a total of 22 health facilities in Wisconsin.)", "Safar told us that some 3,000 patients who had used the clinics that were shut down were referred to other facilities, but those women typically had to travel farther to get services. For example, women using the Planned Parenthood clinic in Shawano, which had been open for 34 years, were referred to a facility in Green Bay -- nearly 40 miles away. Most of the patients received discounted services because of their income.", "\"There just aren’t providers on every corner willing to take low-income patients,\" Safar said.", "Kim Mueller, director of the Fond du Lac County Health Department, told us that lower-income women seeking birth control or treatment for sexually transmitted diseases were particularly affected by the closure of the Planned Parenthood clinic in Fond du Lac. \"Planned Parenthood was amazing -- you could walk in and get care right away,\" she said.", "Though there still are Planned Parenthood facilities in neighboring counties, and some local physicians accept low-income patients, some women are less likely to get birth control or STD treatment if they have to travel longer distances and start relationships with new providers, Mueller said.", "It’s important to note that the reduced amount of state funding for family planning services -- $1.7 million -- was still allocated for family planning and the other services Clinton cited. And Walker’s campaign pointed out that the state has continued to fund another program that pays for mammograms, Pap tests and other health screenings.", "Our rating", "Clinton said Walker's defunding of Planned Parenthood \"left women across the state stranded with nowhere else to turn\" for cancer screenings, breast exams and birth control.", "Walker in 2011 eliminated all state funding to Planned Parenthood, which in turn closed five clinics over the next three years. The loss of those clinics meant women were referred to other facilities, in some cases a considerable distance away, in order to continue getting services.", "But Clinton’s statement goes too far in that Walker’s move affected only some parts of the state and it’s wrong to say women in those areas have \"nowhere else to turn.\"", "For a statement that is partially accurate, we give Clinton a Half True.", "Twitter, HIllary Clinton campaign video, Aug. 3, 2015", "Interview, Planned Parenthood Advocates of Wisconsin director of government relations Nicole Safar, Aug. 4, 2015", "Email exchange, Hillary Clinton campaign spokesman Josh Schwerin, Aug. 3, 2015", "Email exchange, Gov. Scott Walker campaign spokeswoman Stacy Day, Aug. 3, 2015", "PolitiFact Wisconsin, \"Gov. Scott Walker ended Planned Parenthood contract for cancer screeings, Dem Rep. Gwen Moore says,\" (Pants on Fire) Jan. 6, 2012", "Milwaukee Journal Sentinel, \"Planned Parenthood, citing budget cut, to close four rural Wisconsin centers,\" Feb. 18, 2013", "Milwaukee Journal Sentinel, \"Planned Parenthood funding facing cuts,\" May 18, 2011", "Milwaukee Journal Sentinel, \"State budget to rein in aid for family planning,\" June 4, 2011", "Wisconsin Legislative Fiscal Bureau, family planning funding memo, May 18, 2011", "Milwaukee Journal Sentinel, \"Birth control program takes hit in budget,\" March 12, 2011", "Wisconsin Legislature, 2011-’13 state health services budget", "Interview, Fond du Lac County Health Department director Kim Mueller, Aug. 6, 2015", "Interview, Wisconsin Alliance for Women’s Health executive director Sara Finger, Aug. 6, 2015", "Email interview, Planned Parenthood of Wisconsin spokeswoman Iris Riis, Aug. 6, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]