["“This is Zanzibar today army is shooting,” reads a tweet from October 25, 2020, viewed more than 5,000 times.", "From above, the video in the tweet shows a large crowd converging on a dusty street before the people suddenly scatter in all directions after hearing what sound like gunshots.", "The clip appears to be speeded up and the action moves at a noticeably rapid pace.", "Four days later, another video was tweeted, this time with the logo of American news agency the Associated Press (AP).", "“Things not looking good in Zanzibar #ZanzibarLivesMatter,” the tweet claimed.", "In it, a 30-second clip shows armed security officers engaging in running battles with civilians and streets barricaded with burning tyres.", "However, neither video is recent and both are unrelated to the election in Zanzibar on October 28, 2020.", "Using the verification tool InVID-WeVerify, AFP Fact Check ran reverse image searches on keyframes from the first video and found that the clip has been used before to depict a traders’ protest in Uganda (here and here), a riot in Mali and a protest in Nigeria against a Supreme Court ruling that removed a state governor.", "AFP Fact Check had already debunked the same video here in January 2020, and established that it was posted online a day before a state election in Nigeria was nullified by the Supreme Court. While the precise location of the video remains unknown, its prior publications on social media mean it wasn’t shot during this week’s election in Zanzibar.", "The second video with the AP label was found in the American news agency’s archives on YouTube (here) and on its website (here). The agency's archives indicate that the clip was shot in 2005, capturing unrest in Zanzibar after a disputed election at the time.", "Zanzibar, which is Tanzania’s semi-autonomous archipelago, has a history of violence-plagued polls.", "Both Zanzibar and Tanzania held elections this week but opposition leaders have claimed that the twin polls were marred by fraud and called on their supporters to demonstrate peacefully.", "In Zanzibar, AFP reporters witnessed security forces fire teargas and live rounds, and assault civilians on the island.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]