["About this rating", "The URL theofficialproudboys.com did indeed redirect to the president's campaign site in late October 2020.", "However, it was unclear who was behind the website redirect or whether the person was at all associated with the candidate's campaign.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In front of millions of television viewers during a debate on Sept. 29, 2020, U.S. President Donald Trump did not outright condemn the Proud Boys, a far-right group with members who espouse white supremacism. Instead, he told the men-only group to \"stand back and stand by\" when dealing with leftist protesters, alarming scholars of white nationalism and extremist groups who interpreted the president's comment as an endorsement of neo-fasicsm.", "The moment took place during one of two presidential debates with Trump's Democratic rival, former Vice President Joe Biden, and ignited a flurry of news stories and social media posts about the Proud Boys — a group that previously operated on the fringes of America's political sphere with the designation of \"hate group\" from the Southern Poverty Law Center (SPLC), a nonprofit legal advocacy organization that monitors extremist organizations.(For a deep look into the Proud Boys' origin story and what they claim to believe, look here.)", "Trump attempted to walk back his comment about the Proud Boys in public appearances after the debate. Nonetheless, after Trump's \"stand back and stand by\" comment, critics associated his campaign with the Proud Boys' agenda (and vice versa), and members of the group celebrated what they considered a \"historic\" acknowledgement of their ideological push against leftists by the president.", "Weeks later, we learned about the peculiar website redirect. Snopes realized that someone had established a URL redirect — which essentially tells a search engine that a particular web page has moved and takes searchers to a different URL — involving both the Trump campaign and the Proud Boys name.", "While doing fact-checking in late October, Snopes noticed the URL theofficialproudboys.com automatically redirected to the official campaign site for Trump and Vice President Mike Pence. Here's a screen recording of a search by a Snopes reporter on Oct. 26:", "It was unknown as of this report who set up the website redirect — or why. Anyone who owns or has access to a domain can establish either a temporary or permanent URL redirect.", "Snopes reached out to the Trump team to ask if a campaign member had created the online pathway and, if so, why. We will update this report when, or if, we get a response.", "WHOXY.com, a search database that determines who is behind a URL web address, showed theofficialproudboys.com URL was registered in Panama, and a cross reference with WHOIS — another compilation of online domain registry records — confirmed that finding. (We should note here: WHOIS also showed someone in that country had also made the URL antifa.com automatically redirect to Biden's official campaign site during his 2020 presidential campaign.)", "A further analysis of data via WHOIS showed the ULR theofficialproudboys.com, however, was originally established on June 21, 2011, in Atlanta, Georgia. It was unclear when, exactly, the website redirect was created.", "All of that said, the Proud Boys used the URL proudboysusa.com to post its tenants, contact information, blog, and for-sale merchandise, among other online activities. As of this writing, the latest blog post titled, \"Proud Boys Michigan Chapter's Response To Kalamazoo DPS Press Conference,\" was published on Sept. 8.", "In sum, considering the search by Snopes that showed the URL theofficialproudboys.com went to the official campaign website for Trump, we rate this claim \"Mostly True\" — with the caveat that it was unclear who was behind the website redirect or whether they were at all associated with the candidate's campaign.", "Lemire, Jonathan.   \"Trump Proud Boys Remark Echoes Charlottesville.\"\r\n   Associated Press.   1 October 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]