["The photos were published on Twitter here on February 2, 2021. The post has been retweeted more than 7,000 times.", "“His wife passed away during Childbirth. But he has taken responsibility for taking the child and college classes together. The real-life Hero,” the tweet reads.", "Similar posts were shared on Facebook here, here, and here; and on Instagram here and here.", "However, the claim is misleading.", "A reverse image search on Google found the original photos published here in a Spanish-language article by CNN Español on July 13, 2016.", "The headline translates as: “Teacher holds his student's baby so she can take notes.\"", "\"A Mexican teacher uploaded a photograph to Facebook carrying the baby of one of his students so she could take notes,\" the article reads.", "It claims the man in the photo is Moisés Reyes Sandoval, a law professor at the Inter-American University for Development in the Mexican city of Acapulco.", "The article features a link to his Facebook page, where he posted the photo on July 6, 2016.", "“I have a student, who has not dropped out of school despite having different roles, so I decided to carry her son, without interrupting the class so she could take notes. #Acapulco,” he wrote.", "The post has since been shared more than 20,000 times.", "Several local Mexican news websites — for example here and here — also published reports on the viral photos.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]