["By Saranac Hale Spencer", "Posted on February 9, 2018", "Q: Was a Black Lives Matter activist sued after stealing millions of dollars in donations?", "A: No. That scandal was made up by a website that calls itself satirical.", "Black Lives Matter, a movement against systemic racism, began in 2013 after George Zimmerman, a neighborhood watch volunteer in Florida, was acquitted in the shooting death of 17-year-old Trayvon Martin.", "It has focused largely on the issue of police violence in the black community, and has drawn criticism from conservatives who claim that the movement is anti-police.", "What has not been part of the movement’s short history is the embezzlement of millions of dollars by an activist named “Marquesha Johnson.”", "That is a completely made-up scandal that originated on a website that calls its content satire.", "But the story has been posted on several other websites that don’t have a disclaimer explaining that the story isn’t true. Facebook users recently flagged a version as being potentially false. It is.", "The story claims that “Marquesha Johnson” is a “prominent” member of Black Lives Matter, but there is nobody by that name listed on the group’s website as a founder or staff member.", "The photo of a woman that ran with the story isn’t “Marquesha Johnson,” either. It is actually Temitope Adebamiro, a Delaware woman who pleaded guilty in 2016 to killing her abusive husband.", "The made-up story also says: “According to a class action lawsuit filed Wednesday, Johnson ‘solicited donations from vulnerable people to help others but instead used it to help herself.'”", "Although the link included in the story does go to the federal court system’s website, a search of the site shows that no such lawsuit has been filed.", "According to the story, documents filed in that fictional court case say that she bought a $1.2 million house, and a picture with the story shows a luxurious, palm-tree-shaded poolside lounge. But that photo is actually from a Mexican resort where a room can cost $5,000 per night.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Gambino, Lauren and Laughland, Oliver. “Three years after Trayvon Martin, a new civil rights movement grows in strength.” The Guardian. 27 Feb 2015.", "French, David. “The Numbers Are In: Black Lives Matter Is Wrong about Police.” National Review. 29 Dec 2015.", "“BREAKING: Black Lives Matter Leader Kept ‘Virtually All’ Donations.” ReaganWasRight.com. 14 Nov 2017.", "Masulli Reyes, Jessica. “Wife gets 4 years after murdered husband’s past unfolds.” The News Journal. 15 Dec 2016.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]