["A video of a large group of people mostly wearing a skull cap has gone viral on social media with the claim that these are scenes from Delhi’s Daryaganj locality where lockdown rules are being violated.", "दिल्ली के दरियागंज में सोशल डिस्टेंसिग, #लाॅकडाउन का पालन करते हुए जिम्मेदार नागरिक। pic.twitter.com/zlZNePJM3G", "— Jai Shri Ram (@bjplao) April 29, 2020", "Akali Dal leader Manjinder Sirsa too tweeted the video with the same claim and took a jibe at Delhi CM Arvind Kejriwal accusing him of “pushing the lives of Delhi resident towards death” by not enforcing the social distancing norms. The tweet had garnered close to 4,000 retweets before it was taken down. An archived version of the tweet can be accessed here.", "Several other individuals on Facebook and Twitter posted the video with the identical claim.", "Alt News found that the video tweeted Sirsa is from actually Surat, Gujarat. It shows a market in the Limbayat area where lockdown rules were allegedly flouted by the locals on April 26, 2020. The same video was posted by journalist Parul Mahadik on the same day with the caption, “The video is from Surat’s coronavirus hotspot Limbayat area.”", "Posted by Parul Mahadik on Sunday, 26 April 2020", "According to a report by media outlet One India, a video from the area went viral on social media following which policemen reached the spot in huge numbers. Seeing the police, the crowd went helter-skelter. The report stated that the police has registered three different cases and nabbed 25 people in the matter.", "In conclusion, a video of a crowd in Surat flouting the lockdown rules was shared with the false claim that the video depicted scenes from Delhi’s Daryaganj.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]