["About this rating", "As a heat wave engulfed parts of the United States in the summer of 2018, a photograph purportedly showing cars that had melted in Arizona due to the extreme weather started making the rounds on social media:", "A report from \"The Round,\" a publication based in the UK (which was experiencing its own heat wave at the time), also presented the image as if the pictured cars had melted due to extreme temperatures:", "The heatwave in the UK has got plenty of people talking as temperatures hit 30°C over the weekend.", "But in the state of Arizona in the US, the heat hit astonishing levels. This week weather forecasts suggest that the state will have temperatures of 44°C.", "It’s been so hot in fact, that cars have actually started melting!", "The same photograph was later circulated with claims that it pictured automobiles which had melted from extreme hot weather conditions in Saudi Arabia or Kuwait:", "On Saturday kuwait recorded the highest temperature in the world.", "Reaching 52.2 degrees Celsius in the shadows and 63 (145 F) degrees Celsius under direct sunlight, according to Al Qabas newspaper.", "In Saudi Arabia, the mercury rose to 55 degrees Celsius in Al Majmaah at noon.", "The photograph is real, but the pictured vehicles did not melt due to extremely hot weather in Arizona (or anywhere else). The damage was caused by a fire at a nearby construction site.", "Tuscon News Now reported that the fire broke out at a work site near the University Vista apartments at the University of Arizona on the morning of 19 June 2018. In addition to the two pictured vehicles, at least a dozen more cars were damaged by the blaze:", "A fire so hot and bright, it lit up the morning sky.", "That's what one student saw across the street from the construction site fire early Tuesday morning, June 19.", "Danny, a graduate student at the University of Arizona, lives at the University Vista apartments nearby. He saw the fire and raced to get his car.", "It was too late though, the fire was so hot and dangerous that he was not able to get to it in time.", "His car was one of a dozen cars that had damage from the fire. According to Danny, the back bumper and his car cover melted from the intense heat.", "This is his only car and right now and doesn’t know what he will do next.", "We have not yet been able to determine who took this viral photograph, although a series of images from Tucson's Kold News 13 appears to show the same melted vehicles. Here's a comparison of the vehicle in the background of the viral photo (right) with an image taken by the local news station (left):", "Levenson, Eric.   \"Heat Wave Builds in Western US After Leaving Dozens Dead in the East, Canada.\"\r\n    CNN.   6 July 2018.", "The Round.   \"Arizona Is So Hot That Actual Cars Are Melting.\"\r\n    26 June 2018.", "Adger, Kevin.   \"Owners Dealing With Melted Cars After Construction Fire.\"\r\n    Tuscon News Now.   20 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]