["The claim has been shared more than 1,000 times after being posted here on an Australia-based Facebook page with more than 200,000 followers on March 21, 2020.", "The post's caption reads, in part: “Hospital sent a message this morning that this virus seems to be spreading quickly via petrol pumps so have asked to tell everyone to wear gloves or use a paper towel when filling up and dispose of straight away”.", "A third of the world, including Australia, has gone into lockdown during the novel coronavirus pandemic. COVID-19 was first detected in the Chinese city of Wuhan in December 2019. It has since killed more than 21,031 people and infected more than 465,915 others worldwide, according to data from the World Health Organization (WHO) on March 27, 2020.", "Below is a screenshot of the misleading post:", "The claim was also shared hundreds of times here and here on Facebook.", "The claim is false; Australian health authorities have not issued any warning that using petrol pumps can enable the spread of COVID-19.", "In an email to AFP on March 24, a Department of Health spokesperson refuted the claim, adding that “all of our resources and fact sheets are on our website, including how people can prevent the spread etc.”", "A keyword search on the health department’s website, Facebook and Twitter accounts found no relevant results about a warning over petrol pumps during the pandemic.", "Petrol pumps are usually made of stainless steel, circuit boards, rubber and plastic, according to a website about “How Products are Made”.", "COVID-19 can live up to three days on plastic and stainless steel, according to this 2020 study titled “Study reveals how long COVID-19 remains infectious on cardboard, metal and plastic”.", "The Department of Health spokesperson further states: “The persistence of viruses in general varies slightly depending on the surface. There are experimental studies in artificial conditions which reveal differences between porous surfaces and more solid surfaces, so the virus survives slightly longer on solid impermeable surfaces like plastics and metals compared with paper and cardboard.", "“SARS-COV-2 is an enveloped RNA virus, which makes it susceptible to many household disinfectants. Cleaning and disinfecting surfaces, especially frequently touched surfaces, is required to reduce contact transmission.”", "Professor Nigel McMillan, an infectious diseases and immunology expert at Queensland’s Griffith University, added: \"Life on plastic surfaces has been reported to be on average 15 hours. Sunlight and lack of moisture kill the virus (most pumps would be outside), keyboards would be much worse. Avoid this by washing hands or sanitising after use. Don't use cash.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]