["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Indiana Gov. Mike Pence, the Republican nominee for vice president, introduced himself to the nation during a speech at the Republican convention in Cleveland by trying to show that he knows how to handle big budgets.", "A five-term member of Congress who assumed the governorship three and a half years ago. Pence contrasted the federal government's $19 trillion debt to his state's finances.", "\"We in Indiana have a $2 billion surplus, the highest credit rating in the nation, even though we've cut taxes every year since I became governor four years ago,\" he told the crowd.", "Measuring a governor by his state’s credit rating is something we hear often. People criticized New Jersey Gov. Chris Christie for his state’s credit rating while former Florida Gov. Jeb Bush tried (and failed) to use Florida’s credit rating to his benefit.", "A credit rating is an assessment of a state’s ability to repay its lenders, not just today but for years to come. The opinion, issued by ratings agencies, matters because the lower the rating, the higher the interest rate the state faces when it wants to borrow money. It’s kind of like a credit score for states.", "So what’s the story with Indiana and Pence?", "Pence is correct that Indiana has the highest credit rating a state can receive, though you can also say there a lot of states tied for first place.", "The three ratings agencies — Standard and Poor’s, Moody’s, and Fitch Ratings — have given Indiana its highest credit rating, AAA, since April 2010", "Not only Indiana", "The most recent long-term compilation of state-by-state credit ratings we found was compiled by the Pew Charitable Trusts. Pew tracked the ratings from Standard & Poor’s, from 2001 through May 2014.", "It shows that Indiana's rating is AAA, the highest. But several other states share that distinction as well.", "As of May 2014, 14 other states also had AAA ratings.", "Pew noted that three states — Missouri, North Carolina and Virginia — have held a AAA credit rating for at least 50 years.", "Pre-dated Pence", "Indiana maintained AAA status during Pence’s term. But it achieved that feat before Pence took office.", "Pence became governor in January 2013. State officials say Indiana had a top credit rating since 2010.", "A Dec. 4, 2012, report from the state's public finance director says the AAA Fitch rating was earned in April 2010, the same time Moody's Investor Services, the third major rating agency, upgraded Indiana's credit rating to Aaa from Aa1.", "The Northwest Indiana Times reported at the time of those credit upgrades that the Fitch and Moody’s ratings went up because both agencies had recalibrated their rating systems for states.", "Our ruling", "Pence said, \"We in Indiana have ... the highest credit rating in the nation.\"", "It actually shares that distinction with several other states and those top ratings predate Pence's governorship by a few years or more.", "Because the statement is accurate but needs clarification or additional information, we rate it Mostly True.", "https://www.sharethefacts.co/share/45b7ec67-5d4a-4ad0-bf5d-21983a4a7573", "The Pew Charitable Trusts, \"Infographic: S&P State Credit Ratings, 2001-2014, June 9, 2014,\" accessed July 20, 2016", "Fitch Ratings, \"Indiana, State of (IN),\" accessed July 20, 2016", "Indiana website, \"Indiana: Debt Overview,\" State Budget Committee report, Dec. 4, 2012", "Northwest Indiana Times, \"Indiana's credit is greAAAt,\" April 28, 2010", "The Tax Foundation, \"Monday Map: State Credit Ratings,\" Nov. 11, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]