["Was there a 64% drop in gender-based violence in 2020? Will half of grade 1 pupils never make it to their school-leaving exams? We check these and other claims made during the debate on the 2021 state of the nation address.", "On 16 February 2021 members of South Africa’s parliament started to debate president Cyril Ramaphosa’s state of the nation address, delivered five days before. We examine five claims made in the debate, covering gender-based violence, education, renewable energy, the economy and municipal functionality.", "A claim about a drop in gender-based violence during Covid-19 lockdown was unproven. A claim that half of grade 1 pupils will never write matric was incorrect.", "The two correct claims covered renewable energy procurement and economic recession before the coronavirus outbreak. A claim that most municipalities were dysfunctional was misleading.", "“Please keep your masks on and sit in your designated area,” Amos Masondo, chairperson of South Africa’s national council of provinces, told the scattered group of parliamentarians gathered for the annual debate on the state of the nation address, known as Sona.", "President Cyril Ramaphosa’s 2021 Sona speech was held on 11 February 2021, an event Covid-19 regulations stripped of its usual fanfare. In the debate that started five days later, government ministers and members of parliament lowered their masks to praise and criticise the president, his government and the state of the country.", "This fact-check examines five claims made in the debate. They cover gender-based violence, education, renewable energy, the economy and how well municipalities function.", "“In 2020, there was a 64% drop in cases of GBVF compared to the same period in 2019.”", "GBVF is gender-based violence and femicide, the latter meaning the killing of females. The claim was made by Hlengiwe Mkhize, the presidency’s deputy minister for women, youth and persons with disabilities, who suggested that the decrease in this violence was due to South Africa’s Covid-19 lockdown.", "Africa Check has contacted Mkhize’s office to find out what period she was referring to and what data set was used to support the statistic. Despite numerous requests, we have not received a response.", "The South African Police Service (SAPS) has previously told Africa Check that they consider all contact crime against women – including murder, rape and physical abuse – to be gender-based violence.", "Without confirmation from Mkhize about the time frame she was referring to it is difficult to verify the claim.", "The police’s latest crime statistics reveal that 171,070 contact crimes against women were reported between 1 April 2019 to 31 March 2020. But this includes just three months of 2020 and five days of the country’s hard Covid-19 lockdown, which started at midnight on 26 March 2020. The crime statistics for 2020/21 will be released later this year.", "The police recently started releasing crime statistics per quarter: April to June, July to September, October to December and January to March. But while the annual crime statistics provide a breakdown of crimes against women, the quarterly reports do not.", "Despite this, the quarterly report for the April to June 2020 indicates a significant decrease in reports of sexual offences (against all sexes) compared to the previous period. This period coincided with level 5 and level 4 of lockdown.", "It shows that sexual offences – a broad category including a number of crimes – decreased by 39.7% compared to the same three-month period in 2019.", "Rape decreased by 40.4%, sexual assault by 35.9%, attempted sexual assault by 40.3% and contact sexual crimes by 36.2%. There were also significant decreases in reported crimes across the board, including murder, common robbery and carjacking.", "Other statistics, released by police minister Bheki Cele for the first month of hard lockdown (27 March to 22 April 2020), showed more dramatic decreases in crime. Rape decreased by 87.2%, murder by 72%, and domestic violence by 69.4% compared to the same period in 2019.", "Based on a lack of data supporting or refuting the claim, we rate it unproven.", "It is not clear what period Mkhize was referring to or what statistic she was citing. But Chandre Gould, a senior research fellow for the justice and violence prevention programme at the Institute of Security Studies Africa, told Africa Check that using reported incidences as an indicator of a real decrease in gender-based violence was not recommended.", "In an article for the institute, she wrote that despite fears that gender-based violence would increase in South Africa during the hard lockdown, some rape reporting centres said calls had decreased by as much as 50%.", "She said the ban on alcohol may have contributed to this decrease as it may have “reduced the severity of domestic violence cases and the opportunity for rape (outside of the home)”.", "Women may have found it much more difficult to report domestic violence during this period because they could not get to a police station or make private calls away from their partner.", "“I think the important point is that we are talking about reported cases, so the actual violence may not have decreased,” she told Africa Check.", "“50% of grade 1 pupils will never write a matric examination.”", "South Africa’s 2020 matrics – final-year high school students – achieved a 76.5% pass rate. This was 5.1 percentage points lower than the previous year’s rate, which the department of basic education said may be attributed to the impact of the Covid-19 pandemic.", "The claim was made by Baxolile Nodada, the Democratic Alliance’s shadow minister of basic education. When Africa Check asked him for the source of the claim, he sent us an official party statement that calculated a “real” pass rate for public schools. This pegged the rate at 41% by comparing the number of students enrolled in grade 1 in 2009 to the number of students who passed the matric exams in 2020.", "According to data from the Department of Basic Education, 1,071,905 students were in grade 1 in 2009. Twelve years later, in 2020, 578,468 matric students wrote the school-leaving exams.", "A basic assessment of these figures (which experts don’t recommend – see below) does not support Nodada’s claim. It suggests that 53.97% of grade 1 students went on to write the final exam. (Note: This is based on public school data. Private school students write a separate set of final exams under the Independent Education Board.)", "But Martin Gustafsson, a researcher with the department of economics at Stellenbosch University, advises against this type of calculation.", "He told Africa Check that high repetition in schools meant it was inappropriate to compare the number of students in grade 1 with the number of matric students who subsequently wrote (or passed) the final exams 12 years later.", "“My warning would always be please don’t compare grade 1 to grade 12 because grade 1 has lots of repeaters,” Gustafsson explained. “So you’re double-counting people.”", "Statistics published in 2020 by the department of basic education indicate that 15% of grade one students repeat and 10% of grade 2 and grade 3 students repeat.", "“Repetition is like the fly in the soup. It makes all these calculations difficult.”", "Not every student will write matric after just 12 years of school – some will write and achieve their matric qualification after a number of attempts.", "According to South Africa’s 2019 general household survey, 24.3% of people aged 20 are still in secondary school.", "Gustafsson previously provided Africa Check with a graph that uses data from the 2014, 2015, and 2016 general household surveys as well as Independent Education Board data. He found that just over 40% of people obtained a matric pass by the age of 20.", "This number increased to just over 52% by the age of 24. The figure would be higher if students who wrote but failed the exam were included.", "We rate Nodada’s claim as incorrect.", "“Not a single megawatt of new generation has been procured in over five years from the Renewable Energy Independent Power Producer Procurement Programme.”", "This statement was by Kevin Mileham, the Democratic Alliance’s shadow minister of mineral resources and energy.", "The Renewable Energy Independent Power Producer Procurement Programme (REIPPP) was set up in 2010 to increase the country’s renewable energy supply and help achieve broader national development goals, such as job creation.", "The programme encourages investment in independent power producers (IPPs). These entities own or operate facilities that generate electric power for sale. To help the government reach its energy targets, IPPs are meant to generate 39,696 megawatts of energy to be added to the national grid by 2030.", "IPPs have been invited to bid to provide this energy during certain timeframes. There have been seven competitive bid windows so far, the last one in 2015.", "From these bid windows, the REIPPP has procured 6,422 megawatts of electricity from 112 IPPs. As at June 2020, 4,276 megawatts had been connected to the national grid. The remaining energy will become operational once the projects from the last bidding windows have been constructed.", "It is correct to say that no energy has been procured since the last bid window in 2015.", "According to the REIPPP, future bid windows are on hold while a new Integrated Resource Plan, an electricity infrastructure development strategy introduced in 2019, is implemented.", "The next bid window “should be launched soon”, Prof Anton Eberhard, director of the Power Futures Lab at the University of Cape Town’s Graduate School of Business, told Africa Check.", "There may also be some nuclear procurement, after a decision to procure 2,500 megawatts of nuclear power through the programme, he said. But this is pending approval from the National Energy Regulator of South Africa.", "“South Africa was already in a recession for three quarters before the outbreak of coronavirus.”", "Julius Malema, leader of the Economic Freedom Fighters (EFF), drew attention to the state of the economy before the pandemic.", "Africa Check has previously looked into the definition of a recession and most experts agree it refers to two or more consecutive quarters of negative economic growth.", "Statistics South Africa, the country’s data agency, also uses the same definition.", "The size of an economy is measured in gross domestic product (GDP). This represents the market value of all goods and services produced in a given period, usually a year.", "The first case of Covid-19 was recorded in South Africa on 5 March 2020, close to the end of the year’s first quarter. In January, February and March that year, South Africa’s GDP contracted by -1.8%.", "In the third and fourth quarters of 2019, South Africa’s GDP also contracted, by -0.8% and -1.4% respectively.", "“Our economy was in a decline, that’s not a secret,” Prof Jannie Rossouw, head of the school of economic and business sciences at Wits University, told Africa Check.", "“Today we have more dysfunctional municipalities than functional municipalities.”", "This claim was made by Andrew Arnolds, the EFF’s Western Cape provincial secretary.", "South Africa is divided into eight metropolitan municipalities, 205 local municipalities and 44 district municipalities. This gives a total of 257 municipalities.", "Andrews told Africa Check that his claim was based on information from the department of cooperative governance and traditional affairs (Cogta). The department is responsible for overseeing local governments.", "Cogta’s list of dysfunctional and distressed municipalities, published in 2018, includes “87 priority municipalities that were identified as distressed or dysfunctional requiring urgent intervention”. But what about the other municipalities?", "In 2018 then minister of Cogta, Zweli Mkhize, said: “Seven percent of the country’s municipalities are classified as well-functioning, 31% are reasonably functional, thirty one percent are almost dysfunctional while the remaining 31% is dysfunctional.” (Note: We asked the department how each status was defined. We have not received a response.)", "Status of South Africa’s municipalities", "Status", "Percentage", "Well-functioning", "7%", "Reasonably functional", "31%", "Almost dysfunctional", "31%", "Dysfunctional", "31%", "Source: Department of cooperative governance and traditional affairs", "In a 2019 update, the department said 24 of the dysfunctional municipalities had “significantly improved in terms of performance”.", "Africa Check asked Cogta spokesperson Lungi Mtshali for an updated list. At the time of publishing he had not provided it.", "EFF researcher Gumedi Tshimomola told Africa Check that the party only considered the “well-functioning” 7% of municipalities to be “functional”, with the rest all dysfunctional.", "South Africa’s Financial and Fiscal Commission has highlighted that “many stakeholders define functionality differently”. The independent institution was created to provide and make recommendations to government organisations on financial matters.", "In a 2020 review on municipal dysfunctionality it pointed to the absence of a “common, government-wide definition of a dysfunctional municipality”.", "The commission said that referring to “all municipalities that are not functioning normally or as expected” as dysfunctional was “conceptually flawed”. The organisation recommended that a definition should recognise that “many municipalities are neither functional nor dysfunctional, but somewhere in between”.", "Sabelo Mtantato, a senior researcher at the commission’s fiscal policy unit, told Africa Check “things must have changed significantly” since the 2018 list of dysfunctional municipalities were released.", "Arnold used the EFF’s own definition of “functionality”, and his data does not represent the current state of South Africa’s municipalities. We therefore rate the claim as misleading.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]