["About this rating", "On 19 January 2018, President Trump broadcast an address from the White House Rose Garden in conjunction with the pro-life group March for Life's 45th annual rally. Lending his support to that movement (even though he was once squarely on the opposite site of that issue), the president told the audience that he was committed to building \"a society where life is celebrated, protected and cherished.\"", "The president raised some eyebrows, however, when he proclaimed that “Right now, a number of state laws allow a baby to be born from his or her mother’s womb in the ninth month. It is wrong. It has to change:", "That remark quickly became the subject of mocking social media memes:", "Trump's statement was eyebrow-raising because the ninth month is when one typically expects a child to be born (the average human gestation period being 280 days).", "Of course, President Trump likely simply misspoke and said \"born\" rather than \"torn,\" intending for his statement to decry late-term abortions, as he did elsewhere in his address when he voiced support for the Pain-Capable Unborn Child Protection Act, saying: “I strongly supported the House of Representatives’ pain-capable bill, which would end painful late-term abortions nationwide, and I call upon the Senate to pass this important law and send it to my desk for signing.\"", "Trump similarly condemned \"rip[ping] the baby out of the womb of the mother just prior to the birth of the baby\" during the 2016 presidential debates:", "Lucas, Fred.   \"In March for Life Address, Trump Prods Senate to Pass Late-Term Abortion Ban.\"\r\n    The Daily Signal.   19 January 2018.", "Folley, Aris.   \"President Trump Appears to Accidentally Tell Pro-Life Rally It’s Wrong for Children to Be Born.\"\r\n    AOL.com.   19 January 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]