["About this rating", "In March 2018, the Trump administration announced that there will be questions about citizenship on the 2020 decennial census form, making it the first time in 70 years that every U.S. household will be asked to divulge the citizenship status of its members.", "Critics (mainly Democrats and civil rights groups) warned that the change will likely discourage non-citizens from participating in the census for fear they'll be targeted for heightened government scrutiny and/or deportation. Some drew a comparison to the experiences of Japanese Americans during World War II, when, despite peacetime laws prohibiting it, data collected by the Census Bureau on race and national origin was used by the Secret Service to target people of Japanese ancestry for internment.", "In February 1942, two months after Japan attacked Pearl Harbor, triggering the United States' entry into World War II, President Roosevelt signed Executive Order 9066, which authorized the Secretary of War to designate certain regions as \"military areas\" from which anyone deemed a risk to national security could be excluded for the duration of the war. As a result of the order, approximately 120,000 Americans of Japanese ancestry (two-thirds of whom were native-born U.S. citizens) were required to report to \"assembly centers\" along the West Coast, then relocated to internment camps further inland. They weren't released until the war ended in 1945.", "Although long rumored, allegations that the Census Bureau played a role in these relocations were regarded for the most part with skepticism (and denied by the bureau itself) due to a lack of evidence. That changed in 2000, however, when a pair of academic researchers, William Seltzer and Margo Anderson, uncovered proof of the Census Bureau's complicity.", "They found that in addition to releasing \"macrodata\" from the 1940 census detailing the distribution of Japanese populations by state, county, and city (information that wouldn't necessarily have violated the agency's confidentiality requirements), the Census Bureau complied with requests to share finer-grained \"mesodata\" (gathered, in some instances, at the city block level) with the Western Defense Command, which was in charge of carrying out the forced relocations.", "Although Seltzer and Anderson's 2000 report fell short of confirming that the worst sort of privacy violations occurred (sharing confidential information about individuals), it elicited an admission and apology from the Census Bureau's then-director, Kenneth Prewitt, who wrote:", "The historical record is clear that senior Census Bureau staff proactively cooperated with the internment, and that census tabulations were directly implicated in the denial of civil rights to citizens of the United States who happened also to be of Japanese ancestry.", "The record is less clear whether the then in effect legal prohibitions against revealing individual data records were violated. On this question, the judicial principle of innocent until proven otherwise should be honored. However, even were it to be conclusively documented that no such violation did occur, this would not and could not excuse the abuse of human rights that resulted from the rapid provision of tabulations designed to identify where Japanese Americans lived and therefore to facilitate and accelerate the forced relocation and denial of civil rights.", "In a 2007 follow-up paper, Seltzer and Anderson demonstrated that the Census Bureau had indeed turned over \"microdata\" consisting of the names and addresses of individual Japanese Americans residing in Washington, DC to the Secret Service. The Washington Post reported:", "While the Census Bureau had no such record, the pair found the information in records kept by the chief clerk of the Commerce Department. Under the Second War Powers Act, which suspended the confidentiality protections for census data, the chief clerk had the authority to release census data to other agencies. That meant while the information released was not illegal, it was ethically questionable, the researchers said.", "The August 4, 1943, request was made by Treasury Secretary Henry Morgenthau. He had asked for the names and addresses of all individuals of Japanese ancestry living in Washington. Morgenthau had requested the information to aid in a Secret Service investigation of threats made against President Franklin D. Roosevelt.", "[...]", "In all, information about 79 people in Washington was released, the researchers found. The records did not indicate that personal information was released on Japanese Americans living in other parts of the United States.", "The request was filled within seven days — remarkably quick for a government bureaucracy, researchers said at the time.", "Although this level of data sharing had been made legal under the emergency provisions of the Second War Powers Act of 1942, it would nevertheless have been illegal in peacetime and took place in direct contravention of the public promises made on the 1940 census form:", "Only sworn census employees will see your statements. Data collected will be used solely for preparing statistical information concerning the Nation's population, resources, and business activities. Your Census Reports Cannot Be Used for Purposes of Taxation, Regulation, or Investigation.", "Normal privacy protections were restored when the Second War Powers Act was repealed in 1947, and additional restrictions, including a \"72-Year Rule\" barring the release of \"personally identifiable information about an individual to any other individual or agency until 72 years after it was collected for the decennial census,\" were subsequently enacted by Congress.", "However, history has demonstrated that under circumstances deemed extraordinary and urgent enough to reverse such protections, they can be undone at the drop of a hat — a fact unlikely to be forgotten by groups asked to reveal sensitive information about themselves in future censuses.", "Aratani, Lori.  \"Secret Use of Census Info Helped Send Japanese Americans to Internment Camps in WWII.\"\r\n  The Washington Post.  6 April 2018.", "Holmes, Steven A.  \"Report Says Census Bureau Helped Relocate Japanese.\"\r\n  The New York Times.  17 March 2000.", "Mayer, Thomas S.  \"Privacy and Confidentiality Research and the U.S. Census Bureau.\"\r\n  U.S. Census Bureau.  2002.", "Seltzer, William and Anderson, Margo.  \"After Pearl Harbor: The Proper Role of Population Data Systems in Time of War.\"\r\n  American Statistical Association.  8 March 2000.", "Watanabe, Teresa.  \"In 1943, Census Released Japanese Americans' Data.\"\r\n  Los Angeles Times.  31 March 2007.", "Fordham University.  \"Study Finds Census Gave Names of Japanese Americans to Security Agencies During World War II.\"\r\n  4 May 2007.", "National Archives.  \"Japanese Relocation During World War II.\"\r\n  10 April 2017.", "U.S. Census Bureau.  \"Census Confidentiality and Privacy: 1790 - 2002.\"\r\n  2003.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]