["An earthquake of magnitude 4.3 struck parts of Bankastha district and adjoining districts of North Gujarat on June 5. According to the state control room, there were no reported human injuries or damage to property.", "On June 7, photographs purportedly of the earthquake that shook North Gujarat started circulating on WhatsApp. The message shared with photos read, “ઉત્તર ગુજરાતમાં ભૂકંપ. ગુજરાત સરકાર દ્વારા ઘાયલોને 5 હજાર અને મૃતકોને 5300 ની સહાય જાહેર. #TSS (Earthquake in North Gujarat. Gujarat government has announced aid for earthquake-struck victims, Rs 5000 to injured and Rs 5300 to the dead -translated)”. A screenshot of the message is given below.", "With the help of Google reverse image search, Alt News was able to establish that these images are old and unrelated to the recent earthquake. We have listed the images below with the respective contexts.", "This image is related to an earthquake that shook central Italy in August 2016. According to ABC’s report, the death toll had reached 267 till August 27, 2016.", "This photograph represents a building named Margalla Towers, which had collapsed in 2005 during an earthquake, in Islamabad, Pakistan. Alt News found a Getty Image shot by Asif Hasan.", "In a report titled, “Responding to Quake, Chile Uses Lessons of Past”, this image was published by The New York Times on April 2, 2014. According to the caption given below the image, firefighters were battling a blaze that started after an earthquake of magnitude 8.2 struck Iquique, Chile.", "The fourth image pertains to a 15th-century church that had collapsed after two temblors of magnitudes 5.4 and 6.1 hit central Italy on October 26, 2016. A screenshot of a video report by The Guardian is posted below.", "Alt News found that multiple media organizations like CNN en Español, CBS Los Angeles and several other media organizations had used this image to report considerable destruction due to an earthquake in San Marcos, Guatemala in June 2017.", "This sixth image is a Reuters photograph that was published by The Hindu in the corresponding report of a deadly earthquake that had struck the mountainous southwestern Sichuan province of China in August 2017. The caption of the image reads, “Fallen trees are seen blocking a road after an earthquake in Jiuzhaigou county, Ngawa prefecture, Sichuan province.”", "“Rescue personnel work at a damaged building after an earthquake in Tainan, southern Taiwan, February 6, 2016.”, reads the caption of a Reuters image published by CBS News three years ago, which is now viral as temblors in north Gujarat.", "Old and unrelated images of earthquakes that occurred around the world were circulated on WhatsApp to falsely depict the recent destruction in North Gujarat. A similar case was observed after the Balakot airstrike when photographs of temblors in Pakistan were falsely shared as destruction caused by the IAF’s retaliation.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]