["Most Americans don’t need to worry about Obamacare \"glitches and bumps\" that may come next year, President Barack Obama says.", "All the parts of the health care law that affect them are already in place, and it’s all been good, he told reporters at a White House news conference on April 30, 2013.", "\"For the average American out there, for the 85 to 90 percent of Americans who already have health insurance, this thing has already happened,\" he said. \"And their only impact is that their insurance is stronger, better and more secure than it was before. Full stop. That's it. They don't have to worry about anything else.\"", "The president’s unequivocal language caught our eye. More than 20 provisions of the Affordable Care Act have yet to take effect. Are most folks — those who already have health insurance — in the clear?", "Experts told us the reality is somewhat more complex.", "‘A huge train wreck’", "The president had been asked to respond to a recent comment from Sen. Max Baucus, a Democratic architect of the law, that rollout might be a \"a huge train wreck.\"", "Baucus said at an April hearing that he was \"very concerned\" that not enough had been done to educate people about changes on the way.", "Big shifts include new state- and federal-run health insurance exchanges, rules about what policies on the exchanges must offer and a requirement that everyone have insurance.", "And those are just three of more than 20 provisions to take effect between now and 2018, according to a time line from the Kaiser Family Foundation, an independent nonprofit group that’s closely followed the law.", "But Obama told reporters at his news conference that any \"implementation issues\" wouldn’t apply to the majority of Americans who already have health insurance. Instead, he clarified, they would affect only \"the small group of people … who don't have health insurance right now or are on the individual market and are paying exorbitant amounts for coverage that isn't that great.\"", "In other words, he was already correcting himself. But did he go far enough?", "The ‘85 to 90 percent’", "The president had offered blanket reassurance that \"the 85 to 90 percent of Americans who already have health insurance\" had nothing left to worry about.", "He’s right that about 85 percent of folks have some kind of health insurance, according to the most recent Census survey of health coverage. Nearly 16 percent said they didn’t have any coverage in 2011.", "Which means Obama was telling a fairly diverse group of people they had already experienced what the health care law had to offer them: Folks with health coverage through their employers (55 percent), through government programs such as Medicaid (17 percent) and Medicare (15 percent), through policies they buy themselves (10 percent) and through the military (4 percent).", "(Those numbers add up to more than 85 percent because the categories aren’t exclusive — some people have more than one kind of coverage.)", "‘Stronger, better and more secure’", "For all of those people, Obama said, the \"only impact is that their insurance is stronger, better and more secure than it was before. Full stop. That's it.\"", "There certainly have been helpful impacts: protection for people with pre-existing conditions, elimination of lifetime limits, coverage of 26-year-olds on their parents’ policies and no-fee preventive care.", "But those haven’t been the \"only\" impacts.", "\"I think there's quite a bit more,\" said Michael Tanner, a senior fellow at the libertarian Cato Institute who has been a critic of the law.", "Some people who have insurance now may face:", "• Higher taxes", "• More comprehensive, and thus more expensive, policies", "• Employers who opt out, self-insure or move toward part-time employees", "• Health care providers who no longer take Medicaid or Medicare", "But those possibilities apply to small, specific groups of people — or it’s not yet clear how widespread they may be.", "Higher taxes, for example, include new restrictions on tax-free health accounts, a higher threshold for deducting unreimbursed medical expenses and a higher Medicare Part A insurance tax for high-income families.", "Then there are higher taxes on pharmaceutical manufacturers, health insurers and employers — costs which may be passed on to consumers.", "\"People will feel those effects as well,\" said Gail Wilensky, a health care analyst who ran the Medicare program under President George H.W. Bush.", "But recent headlines about higher premiums — such as a request for a 25 percent hike by a Maryland insurer and a recent study showing underlying medical costs for individual policyholders may rise 32 percent — only apply to the individual market. That is, the less than 10 percent of people who buy their own insurance.", "Cheaper policies with fewer benefits — perhaps more than half of what’s offered on the individual market now — simply won’t be available on new insurance exchanges. But some people will qualify for new subsidies to offset higher premiums on their better, more expensive policies.", "Then there are anecdotal worries about employers opting out, self-insuring or moving toward part-time employees.", "But it’s hard to say how big the effect will be on currently insured workers, or which companies will follow through on their tests. Darden Restaurants, which infamously experimented with shifting more of its workers to part-time to avoid offering insurance, faced \"considerable backlash,\" according to NPR, and backed off.", "Meanwhile, the Wall Street Journal reported that unions are pushing for federal subsidies to keep offering plans jointly with employers to some 20 million people, warning that they may drop coverage.", "The nonpartisan Congressional Budget Office estimates that employers will drop coverage for about 8 million people in 2019 — less than 3 percent of Americans — while people insured through exchanges will leap by 27 million.", "Meanwhile, Medicare savings under the health care law include reductions in payments for hospitals and nursing homes, which Medicare’s actuary has warned may make it hard for about 15 percent of them to stay profitable. Doctors have also had to fight off scheduled payment reductions, and some have limited their number of Medicare and Medicaid patients.", "\"Medicare is in as much trouble as it ever was,\" said Mark Pauly, a professor of health care management, business economics and public policy at the University of Pennsylvania's Wharton School.", "In other words, at least some people with insurance now do face Obamacare implementation worries, as their employers and insurers grapple with how to adjust to changes under the law.", "But it’s not most people, Pauly and a few other experts told us.", "\"I think the story isn't over yet, and there will be surprises and disruptions for some people, even if the overall impact is stronger, better and more secure,\" said Tim Jost, a health care expert at Washington and Lee University School of Law.", "Employees who get insurance through large employers, in particular, face the least uncertainty.", "\"There isn't going to be a major financial impact on them,\" Jost said. \"And they'll have some benefit.\"", "But Obama got into trouble by punctuating his point with phrases like the \"only impact,\" \"full stop\" and \"that’s it.\"", "That’s just an exaggeration, Wilensky said.", "\"He really put an exclamation point on it, which, yeah, doesn't hold,\" Tanner said.", "Our ruling", "Obama attempted to reassure Americans that for most of them, Obamacare \"has already happened.\" He went on: \"And their only impact is that their insurance is stronger, better and more secure than it was before. Full stop. That's it. They don't have to worry about anything else.\" He glossed over other impacts of the law, including higher taxes and in some cases, higher premiums. Meanwhile, some people who have insurance now will have to deal with changes from their employers, insurers and health care providers. Most people who have large-group coverage through their employers now face little change, experts told us. So for many of those people, Obama was largely correct. We rate his statement Half True.", "White House, \"News Conference by the President,\" April 30, 2013", "Kaiser Health News, \"Obama Aims To Tamp Down Fears About Health Law Implementation,\" May 1, 2013", "Congressional Budget Office, \"CBO's February 2013 Estimate of the Effects of the Affordable Care Act on Health Insurance Coverage,\" February 2013", "U.S. Census, \"Income, Poverty, and Health Insurance Coverage in the United States: 2011,\" September 2012", "Congressional Budget Office, \"An Analysis of Health Insurance Premiums Under the Patient Protection and Affordable Care Act,\" Nov. 30, 2009", "Joint Committee on Taxation, \"Present Law And Background Relating To The Tax-Related Provisions In The Affordable Care Act,\" March 4, 2013", "Washington Post's Fact Checker, \"Obama’s claim that 90 percent of Americans ‘don’t have to worry’ about ‘Obamacare,'\" May 1, 2013", "Kaiser Family Foundation's Health Reform Source, \"Implementation Timeline,\" accessed May 1, 2013", "Kaiser Family Foundation, \"Summary of the Affordable Care Act,\" accessed May 1, 2013", "Kaiser Family Foundation, \"Why Premiums Will Change for People Who Now Have Nongroup Insurance,\" Feb. 6, 2013", "Kaiser Family Foundation, \"The Affordable Care Act Three Years Post-Enactment,\" March 2013", "Kaiser Family Foundation's Health Reform Source, \"Health Reform Subsidy Calculator,\" accessed May 1, 2013", "New York Times, \"Some Employers Could Opt Out of Insurance Market, Raising Others’ Costs,\" Feb. 17, 2013", "Washington Post's WonkBlog, \"With health law looming, one large insurer wants a 25 percent premium hike,\" April 24, 2013", "Wall Street Journal, \"Health Law Spurs Shift in Hours,\" Nov. 5, 2012", "NPR, \"As Health Law Changes Loom, A Shift To Part-Time Workers,\" April 29, 2013", "HealthReformGPS, \"Society of Actuaries estimate cost increases under the ACA,\" March 26, 2013", "Society of Actuaries, \"Cost of the Future Newly Insured under the Affordable Care Act (ACA),\" March 2013", "The Hill, \"Study predicts Obama healthcare law will raise premiums on young adults,\" Jan. 7, 2013", "Contingencies, \"Age Band Compression Under Health Care Reform,\" Jan-Feb 2013", "The Hill, \"ObamaCare takes friendly fire,\" April 6, 2013", "The Hill, \"Baucus warns of 'huge train wreck' enacting ObamaCare provisions,\" April 17, 2013", "The Hill, \"Sebelius takes new heat from Baucus 'train wreck' remark,\" April 24, 2013", "New York Post, \"Lies of ObamaCare: Three years after passage, the law’s promises are falling apart,\" April 13, 2013", "Email interview with Joshua Archambault, director of health care policy and middle cities, Pioneer Institute of Public Policy Research, April 30, 2013", "Email interview with Jonathan Gruber, economist at the Massachusetts Institute of Technology,  April 30, 2013", "Interview with Timothy Jost, professor at the Washington and Lee University School of Law,  April 30, 2013", "Email interview with Mark Pauly, professor of health care management, business economics and public policy at the University of Pennsylvania's Wharton School, April 30, 2013", "Interview with Michael Tanner, senior fellow at the Cato Institute, April 30, 2013", "Interview with Gail Wilensky, economist and senior fellow at Project Hope,  April 30, 2013", "PolitiFact, \"Everything you want to know about the health care law,\" March 23, 2012", "PolitiFact, \"Ex-Sen. Fred Thompson says Obamcare could raise premiums enough to pay for a new Ford Explorer,\" April 3, 2013 (False)", "PolitiFact, \"Pam Bondi said national studies show businesses are already raising prices and cutting jobs because of the health care law,\" Nov. 30, 2012 (False)", "PolitiFact, \"Obama said health premiums in the last two years went up slower than any time in the past five decades,\" Oct. 4, 2012 (False)", "PolitiFact Obameter, \"Cut the cost of a typical family's health insurance premium by up to $2,500 a year,\" updated Aug. 31, 2012 (Promise Broken)", "PolitiFact, \"Nancy Pelosi says 'everybody' will get more and pay less under the health care law,\" July 6, 2012 (False)", "PolitiFact Florida, \"Rick Scott says health insurance premiums will increase under health care law,\" July 6, 2012 (Mostly False)", "PolitiFact, \"Barack Obama says that under his health care law, those who have health insurance will keep it,\" June 29, 2012 (Half True)", "PolitiFact, \"Limbaugh, GOP have it wrong: Health care law is not the largest tax increase ever,\" June 28, 2012 (Pants on Fire)", "PolitiFact’s Obameter, \"If you don't have insurance, or don't like the insurance you have, you'll be able to choose a new plan on a health insurance exchange,\" updated March 28, 2012 (Promise Kept)", "PolitiFact, \"Reince Priebus says health care law could mean 'as many as 20 million Americans could lose their employer-based insurance,'\" March 23, 2012 (Half True)", "PolitiFact, \"Ted Cruz says health reform’s price tag has doubled,\" March 21, 2012 (False)", "PolitiFact, \"Film promoting Barack Obama claims new law ensures Americans will 'no longer will see their coverage dropped or capped when illness strikes,'\" March 19, 2012 (Mostly True)", "PolitiFact, \"Rep. Blake Farenthold says health care law will force 70 percent of workers to lose their current plan,\" Feb. 2, 2011 (False)", "PolitiFact, \"Ad against Barbara Boxer says hospitals might stop taking Medicare. We find that unlikely,\" Oct. 4, 2010 (Mostly False)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]