["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Joe Biden speaks about the coronavirus on March 12, 2020, in Wilmington, Del. (AP)", "The quote was first misattributed to President Donald Trump. Joe Biden didn’t say it either.", "First it was Trump, now supposedly it’s Biden.", "A Facebook post claims that Joe Biden said, \"People who have never died before are now dying from coronavirus.\" The post also displays a faded photo of Biden with the words \"confused & irritated.\"", "We fact-checked the same claim on March 19, 2020, except that one attributed the quote to President Donald Trump. He never said it, and neither did Biden.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Although it’s pretty clear this statement is fabricated and its social media misattribution has moved on from Trump to Biden, we checked out the Democratic presidential candidate’s recent comments to be sure.", "We reviewed Biden’s comments in tele-town halls, campaign ads and media interviews and found no evidence he said anything close to the statement. We also searched for it in Google and the Nexis database and found no mention of the quote \"people are dying who have never died before.\"", "According to multiple biographies, author Ernest Hemingway reportedly enjoyed using the phrase, but it isn’t clear whether he was the one who coined it.", "Either way, Trump didn’t say it and neither did Biden. Pants on Fire!", "Facebook post, March 21, 2020", "PolitiFact, Says President Donald Trump said, \"People are dying who have never died before.\", March 18, 2020", "Nexis search, March 24, 2020", "Reuters, False claim: Trump said \"people are dying who have never died before\", March 21, 2020", "FactCheck.org, Death Quote Wrongly Attributed to Trump, March 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]