["By Angelo Fichera", "Posted on December 18, 2018", "A popular meme suggests prosecutors are applying a double standard in a campaign finance case involving President Donald Trump, but it distorts the facts of the case against former Democratic Sen. John Edwards.", "In 2011, a grand jury indicted two-time Democratic presidential candidate John Edwards on allegations that money paid to hide his extramarital affair amounted to illegal campaign contributions.", "Totaling nearly $1 million, federal prosecutors said, the payments represented unlawful contributions to the former senator’s 2008 presidential bid because they violated the $2,300 limit that individuals could make to candidates during that primary election. They argued the payments should have been reported in campaign finance reports because they were part of an effort to limit damage to Edwards’ candidacy.", "That case has now garnered renewed attention for its similarities to a case involving President Donald Trump. The president’s former personal attorney, Michael Cohen, has admitted to breaking campaign finance law in the 2016 election by making payments to conceal the stories of two women who say they had affairs with Trump. Cohen was sentenced last week to three years in prison for those and other offenses.", "But a popular meme on Facebook that implicitly contrasts the two cases wrongly accuses the U.S. Department of Justice of “double standards” and misleads social media users by leaving out core details of the Edwards matter.", "“Remember when Democrat John Edwards diverted a million dollars in actual campaign funds to hush up his baby momma mistress – whom he was having an affair with while his wife was dying of cancer?” it reads. “The DOJ dropped the charges and Edwards was never hit with FEC violations. Double standards. That’s how the Deep State rolls.”", "Absent from that summary are some critical facts.", "For starters, the meme makes no mention of the fact that the Justice Department actually brought Edwards to trial. In 2012, a jury deadlocked on five of the six felony counts against Edwards; it acquitted him of one. It was only then that the department decided to not retry the case.", "Though the meme claims the money came from “actual campaign funds,” prosecutors said the money did not actually pass through campaign coffers. The money, the government argued, was spent by Edwards’ two wealthy donors, one of whom was his campaign finance chair, on things such as rent, living expenses, medical care and travel for Edwards’ pregnant mistress, Rielle Hunter.", "It’s accurate that the FEC — the Federal Election Commission — did not rule that those payments were campaign finance violations. Lora Haggard, chief financial officer of the Edwards campaign, testified during trial that even after the indictment was revealed, the FEC approved the campaign’s filings following an audit.", "“When the Federal Election Commission, which was well aware of the money and the indictment, approved her reports last month, she took it to mean her assessment was correct,” the New York Times reported on her testimony.", "A prosecutor in the case, Jeffrey Tsai, reportedly said at the time: “Whatever the F.E.C. determined is not relevant to the criminal charges.”", "It’s worth noting that the FEC hasn’t issued any decisions regarding complaints filed with the agency over the payments to the two women, Stormy Daniels and Karen McDougal, who allege they had affairs with Trump.", "In pleading guilty, Cohen admitted responsibility for his role in arranging a $150,000 payment by American Media Inc. (the parent company to the National Enquirer) to McDougal. He also admitted to paying $130,000 to Daniels through an LLC he set up for the payment. Trump later reimbursed Cohen for the latter in what prosecutors described as “monthly installments disguised as payments for legal services performed pursuant to a retainer, when in fact no such retainer existed.”", "The U.S. Attorney’s Office for the Southern District of New York, which oversaw the investigation into those payments, has said they were made to “ensure” the women “did not publicly disclose their alleged affairs with a presidential candidate in advance of the election.”", "Trump has rejected the notion that the payments were campaign contributions — and has said they were not crimes. Rudy Giuliani, now Trump’s personal attorney, recently cited the Edwards case to support that argument.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Gerstein, Josh. “Justice Dept. won’t retry Edwards.” Politico. 13 Jun 2012.", "“Giuliani: Hush money payments to Stormy Daniels and Karen McDougal ‘not a crime.’” YouTube. ABC News. 16 Dec 2018.", "“Michael Cohen Sentenced To 3 Years In Prison.” Press release, U.S. Attorney’s Office for the Southern District of New York. 12 Dec 2018.", "“Michael Cohen Pleads Guilty In Manhattan Federal Court To Eight Counts, Including Criminal Tax Evasion And Campaign Finance Violations.” Press release, U.S. Attorney’s Office for the Southern District of New York. 21 Aug 2018.", "Severson, Kim. “Judge Blocks Testimony for Edwards on Finance Law.” The New York Times. 15 May 2012.", "Trump, Donald (@realDonaldTrump). “Democrats can’t find a Smocking Gun tying the Trump campaign to Russia after James Comey’s testimony. No Smocking Gun…No Collusion.” @FoxNews That’s because there was NO COLLUSION. So now the Dems go to a simple private transaction, wrongly call it a campaign contribution,…” Twitter. 10 Dec 2018.", "Trump, Donald (@realDonaldTrump). “….which it was not (but even if it was, it is only a CIVIL CASE, like Obama’s – but it was done correctly by a lawyer and there would not even be a fine. Lawyer’s liability if he made a mistake, not me). Cohen just trying to get his sentence reduced. WITCH HUNT!“ Twitter. 10 Dec 2018.", "United States of America v. John Reid Edwards. 1:11-cr-00161-CCE. U.S. District Court, Middle District of North Carolina. Indictment. 3 Jun 2011.", "United States of America v. John Reid Edwards. 1:11-cr-00161-CCE. U.S. District Court, Middle District of North Carolina. Verdict. 31 May 2012.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]