["About this rating", "Among the topics covered by President-elect Donald Trump at his first formal press conference on 11 January 2017 was a plan to avoid any conflict of interest between his duties as president and his role as the owner of a multi-billion-dollar business by turning the management of his companies over to his sons, Eric and Donald.", "To that end, Trump invited an attorney, Sherri Dillon, to the podium and gestured at a nearby table stacked high with file folders, saying, \"these papers are just some of the many documents that I've signed turning over complete and total control to my sons\":", "After Dillon's presentation, reporters moved on to other topics, but just before the session ended, Trump once again drew attention to the conflict-of-interest documents:", "So this is all — just so you understand, these papers — because I'm not sure that was explained properly — but these papers are all just a piece of the many, many companies that are being put into trust to be run by my two sons that I hope at the end of eight years, I'll come back and say, oh, you did a good job. Otherwise, if they do a bad job, I'll say, \"You're fired.\"", "Despite their being so prominently displayed, however, reporters were not allowed to touch or examine the documents. According to CNN:", "Update: The Trump team did not allow the press to see the contents of the folders. Photo by Noah Gray/CNN pic.twitter.com/zKc9fv3Sba", "— CNN Politics (@CNNPolitics) January 11, 2017", "Many on social media pointed out that the displayed folders and documents appeared to be untouched, unlabeled, and, in some cases, empty. Filmmaker Amy Berg even claimed, based on her own experience, that the paper documents in some of the folders, to the extent they were visible, were blank:", "As someone who professionally outfits fictional universes, I can tell you with absolute certainly that these are blank pieces of paper. https://t.co/IVLOIqt7EE — Amy Berg (@bergopolis) January 12, 2017", "The Independent, a British online newspaper, made the same observation:", "While the majority of the sheets were hidden, some of them were visible – and there was no sign of page numbers or the sticky notes that lawyers tend to use to mark places in large documents.", "The paper itself also appeared to be the wrong size, printed on A4 rather than legal size sheets, and appears to have fallen like fresh sheets of paper. And the folders themselves were also entirely blank, despite Mr. Trump suggesting that each of them related to a different business that Mr. Trump was moving himself away from.", "It is possible that the documents had been printed precisely for the press conference, but the fact that reporters weren't allowed to check the details of the documents led to concern that they didn't include any information at all.", "The left-leaning BipartisanReport.com took the allegation one step further and declared the documents \"fake\":", "A dramatic stunt, meant to showcase how much work it is for Trump to transfer his businesses to his sons, turned out to be fake. The documents inside the folders were blank, and simply for show.", "In the end, however, all the chatter about \"empty files\" and \"blank\" or \"fake\" documents is mostly speculative. As we noted above, what gave rise to the suspicions in the first place was the fact that none of the reporters in the room was allowed to examine the file folders and documents. If no one examined them, we can't corroborate what was or was not in them.", "It's certainly possible that the mounds of paperwork displayed during the press conference were blank and just for show, but there is not enough evidence to prove it.", "On 12 January 2017, Associated Press reported making a follow-up query about the paperwork, which the Trump transition team again described as documents pertaining to the transfer of the businesses to his sons:", "A Trump spokeswoman on Thursday flatly denied there was anything misleading about the display.", "\"As Mr. Trump stated at the press conference, they were just some of the documents required to transition his assets into the trust and additional restructuring,\" said Hope Hicks.", "But Hicks did not respond to a second request for an inspection of the documents. And materials sent to reporters about the new Trump Organization structure in the hours after the news conference totaled only six pages.", "Bristow, Georgia.   \"Just In: Trump Busted Using Empty Folders As Conflict of Interest Documents.\"\r\n   Bipartisan Report.   11 January 2017.", "Dann, Carrie.   \"Trump Addresses Russia, Ethics Concerns in Wide-Ranging Press Conference.\"\r\n   NBC News.   11 January 2017.", "Griffin, Andrew.   \"Donald Trump Press Conference: Folders 'Containing His Business Plan' Appear to Be Blank.\"\r\n   The Independent.    11 January 2017.", "Lemire, Jonathan.   \"Contents of Trump's Folders Spark Speculation.\"\r\n   Associated Press.   12 January 2017.", "The New York Times.   \"Donald Trump's News Conference: Full Transcript and Video.\"\r\n   11 January 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]