["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Screenshot from Facebook)", "We’ve fact-checked a lot of misinformation about migrants on the U.S. southern border. And not all of it is new — or even completely made-up.", "On July 8, a Facebook page called The Rogue Patriot published a photo of people sitting on a curb looking at their cell phones. Text written over the image claims that the individuals pictured are migrants.", "\"The inescapable question is: How have all of you been able to pay your cell phone bills during your excruciating two month excursion across four separate countries?\" the post reads.", "The meme taps into the ongoing nationwide conversation about the surge of migrants at the U.S.-Mexico border. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Rogue Patriot’s post, which amassed more than 1,200 shares, doesn’t list a source either in the meme or caption. And nothing in the photo makes it immediately obvious that those pictured are actually migrants.", "PolitiFact reached out to The Rogue Patriot for more information regarding the source of the image, and it directed us to an Associated Press story published March 27, 2017. The photo in question appears embedded in the text with the following caption:", "\"Cubans check their cell phones inside the migrant shelter ‘Casa del Migrante’ in Nuevo Laredo, Tamaulipas state, Mexico, Saturday, March 25, 2017, across the border from Laredo, Texas. The shelter limits migrants to one hour of cell phone usage, for security reasons.\"", "The AP story addresses the so-called \"wet foot, dry foot\" policy, which former president Barack Obama ended Jan. 12, 2017. That policy, created by former president Bill Clinton in 1995, allowed most Cubans who reached U.S. soil to become legal permanent residents after one year. Once it ended, Cuban migrants were treated the same as those from other countries.", "According to the AP’s reporting, many migrants in the Casa del Migrante shelter were Cubans who had tried to travel to the United States under the assumption that they would be included in the \"privileged path\" laid out by the Clinton-era policy. Several had jobs in Mexico that required them to leave the shelter \"to work in restaurants or on construction sites.\"", "That’s a different context than that in which The Rogue Patriot posted its meme. The AP interviewed one migrant who had crossed several borders to get to Mexico, but based on the photo alone, it’s unclear which people pictured actually made a \"two-month excursion across four separate countries.\"", "Similar versions of this meme have cropped up during previous news stories about immigration.", "In December, Snopes fact-checked a meme that used the same AP photo with a text overlay similar to The Rogue Patriot’s post. It found that the post was miscaptioned because it purported to show asylum seekers that were part of a caravan of Central American migrants headed to the U.S. border.", "Finally, we should note that it’s not unusual for poor people or even the homeless to possess cell phones, both in the United States and worldwide. The Gates Foundation, for example, has promoted the acquisition of mobile phones in Africa, Asia and Latin America in order to give low-income people in developing countries access to financial services through online banking.", "Our ruling", "The Rogue Patriot claimed an image showed migrants are \"able to pay cell phone bills\" after a \"two-month excursion across four separate countries.\"", "The photo was taken by the AP in 2017 for a story about Cuban immigrants who had been excluded from a Clinton-era amnesty policy. That context is different than that in which The Rogue Patriot posted its meme, and other fact-checkers have debunked similar claims in the past.", "We rate this claim Mostly False.", "The Associated Press, \"Cubans, no longer preferred, are stuck at US-Mexico border,\" March 27, 2017", "Facebook post, July 8, 2019", "The New York Times, \"Cellphones for Women in Developing Nations Aid Ascent From Poverty,\" April 1, 2015", "The New York Times, \"Fighting Homelessness, One Smartphone at a Time,\" April 14, 2015", "PolitiFact, \"The facts behind the detention of immigrants,\" July 8, 2019", "Snopes, \"How Are These Migrants Paying for their Mobile Phones?,\" Dec. 5, 2018", "USA Today, \"Obama ends 'wet foot, dry foot' policy for Cubans,\" Jan. 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]