["About this rating", "Big-game hunting has repeatedly been proven to be one of the most rage-inducing topics on the internet. Although we could point to a number of examples of hunters facing the wrath of the Internet community after posing for photographs with their kills, perhaps the most infamous incident was in July 2015, when Cecil — a well-known Southern African lion living in Zimbabwe's Hwange National Park — was killed by an American dentist named Walter Palmer.", "The online outrage over Cecil the lion's death was widespread. In fact, when netizens grew tired of directing their anger at a single person, Palmer's daughter Natalie Palmer Botes was dragged into the controversy.", "A photograph purportedly showing Botes in the back of a pickup truck with three dead wolves has been making its way around inboxes and social media for several years:", "This image has been shared with a wide variety of captions over the years. When it first surfaced on Twitter, it was accompanied by a message which merely claimed that the woman was Palmer's daughter. Later iterations included an emotionally manipulative claim that one of the wolves was a mother and that her death left four cubs orphaned:", "Her name is Natalie Palmer and she killed these wolves for no reason. One of the wolves was a mother, leaving four orphan pups behind. Natalie is the daughter of Walter Palmer, the dentist who killed Cecil the lion.", "The detail about the mother wolf and her abandoned pups is surprising (and almost certainly fictitious) for two reasons: First, this claim was not included in the earliest versions of this rumor. Second, it's an oddly specific detail for a rumor that contains almost no other verifiable information.", "For instance, we've encountered  this post on a number of web sites but have yet to see any information about where and when this photograph was taken. Furthermore, no outlets have provided any source information for this photograph. Was it taken from Palmer's Facebook page? A hunting web site? The earliest postings of this image that we could uncover were accompanied by little more than insults, baseless claims, and a request for followers to \"Name and Shame\" the alleged hunter at her place of business:", "The timing of this rumor is also suspicious. By September 2015, the story of Cecil the Lion's death was moving out of the national spotlight, and Walter Palmer was returning to his dental practice. In fact, one of the earliest postings of this rumor that we could find was shared by a Twitter user who was on her way to a protest against Palmer.", "It seems that Natalie Palmer Botes' name was attached to this photograph simply to drum up controversy, just as the apparently manufactured \"mother wolf\" claim appeared when Palmer's daughter was no longer enough to drive Internet traffic.", "This rumor escaped scrutiny when it first appeared at the end of 2015, and in the ensuing years it has spread with abandon. When we reached out to Natalie Palmer Botes at her place of business, however, we were informed that the woman in the photograph is not Walter Palmer's daughter:", "The picture of the woman with the wolves is NOT Natalie. Go to our website at www.acballroom.com, look at her pictures and compare. It will be abundantly clear to anyone who takes the time to do so.", "We compared an image of Palmer Botes and the woman in the viral photograph and found that the two women do bear a passing resemblance, but also possess notable differences. Botes, for instance, has a slight widow's peak, whereas the woman in the viral photograph has a straight hairline:", "This wouldn't be the first time that social media directed collective outrage at a misidentified hunter. In February 2018, an image of a hunter next to a bear was circulated as if it showed Metallica frontman James Hetfield (it wasn't) and in November 2017, a photograph of a man with a recently killed elephant was shared as if it showed U.S. Interior Secretary Ryan Zinke (it wasn't.)", "There is no evidence that the woman in this photograph is Walter Palmer's daughter, or that the hunt in which she apparently participated resulted in a dead mother wolf and four abandoned clubs. This rumor appears to have been manufactured for the sole purpose of stirring up controversy.", "While many may disagree with killing animals in general, hunting wolves is legal in a number of states.", "Sassoon, Louise.   \"Shocking Photo Shows Cecil the Lion Killer's DAUGHTER Posing Next to Pile of Dead WOLVES, Angry Conservationists Claim.\"\r\n    The Mirror.   23 October 2015.", "Moyer, Amanda.   \"Wolf Hunting Now Legal But Still Controversial.\"\r\n    CNN.   3 September 2009.", "BBC News.   \"Fury as Cecil the Lion's Killer Walter Palmer Returns to Work.\"\r\n    8 September 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]