["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Some supporters of gun rights on social media are sharing a striking post with a quotation attributed to Thomas Jefferson, a founding father who became the third U.S. president.", "The post displays a photo of a snake wrapped around a handgun with the words \"Don’t Tread On Me.\" Along the bottom, the alleged statement by Jefferson reads:", "\"When governments fear the people, there is liberty. When the people fear the government, there is tyranny. The strongest reason for the people to retain the right to keep and bear arms is, as a last resort, to protect themselves against tyranny in government.\"", "But did he say it? The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Like many statements attributed to Jefferson on the internet, there is no credible evidence to support that Jefferson said or wrote these words.", "According to Monticello.org, the Thomas Jefferson Foundation's website, the statement cannot be found in any of the former president’s writings. Both parts of the quote appear in the website’s list of \"Spurious Quotations.\"", "Researchers at Monticello found that the first sentence: \"When governments fear the people, there is liberty. When the people fear the government, there is tyranny,\" most likely comes from a series of debates on socialism published in 1914. At one point, a man named John Basil Barnhill said, \"Where the people fear the government you have tyranny. Where the government fears the people you have liberty.\"", "Some variations of the quote begin with, \"No free man shall ever be debarred the use of arms,\" as the first sentence, which comes from the first of Jefferson's three drafts of the Virginia Constitution in 1776, although in the second and third drafts, the sentence was amended to read, \"No free man shall ever be debarred the use of arms (within his own lands or tenements).\"", "Again, the latter sentence about using guns for protection against tyranny in government, Monticello officials say, \"does not appear in the Virginia Constitution drafts or text as adopted, nor in any other known Jefferson writings.\"", "With no evidence for the quote’s authenticity, we rate this False.", "Facebook post, Aug. 15, 2019", "Snopes, Thomas Jefferson on Gun Rights, June 22, 2016", "CNN, Did Jefferson really say that? Why bogus quotations matter in gun debate, Jan. 11, 2013", "Monticello.org, When government fears the people, there is liberty... (Spurious Quotation), Accessed Aug. 19, 2019", "Monticello.org, Strongest reason for the people to retain the right to keep and bear arms (Spurious Quotation), Accessed Aug. 19, 2019", "Monticello.org, No freeman shall be debarred the use of arms, Accessed Aug. 19, 2019", "Debates on Socialism, 1914; Accessed Aug. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]