["A 27-year-old female veterinary doctor was gang raped then killed in Hyderabad on November 27, in a case the prompted nationwide outrage in India, according to this AFP report.", "The 45-second long video was shared repeatedly on Facebook, Twitter and WhatsApp, for example here on Facebook on November 30, 2019, where it has been viewed more than 6,000 times.", "The Bengali-language caption names the rape victim. In accordance with an Indian Supreme Court ruling barring the naming of rape victims, AFP has redacted the woman's name.", "The caption says: \"This is [victim's name] rapist Pasha. He is an animal. Cannot understand what the Hyderabad police are doing with him. Are they beating him at all or giving him a massage.”", "Below is a screenshot of the misleading post, with the victim's name redacted from the caption:", "Police said in a televised press briefing December 6, 2019, available on the YouTube channel of Indian news agency ANI here, that they had arrested four men over the attack.", "Cyberabad Police Commissioner VC Sajjanar names the four suspects from the 57 second mark.", "\"All these four accused are Mohammed Arif, Jollu Shiva, Jollu Naveen and Chintakunta Chennakeshavulu,\" he said.", "A copy of the police remand report obtained by AFP shows the same names for the four suspects.  Below is a screenshot of the relevant section of the report, with the names highlighted. AFP has redacted all identifying details about the victim, complainant and witnesses:", "Police said the four suspects were later killed in crossfire while trying to escape from a reenactment of the crime organised by detectives, according to this AFP report.", "One of the four suspects, Mohammed Arif, was originally identifed in media reports, for example here and here, as \"Mohammed Pasha alias Arif\".", "Many of the misleading posts, for example this post on Facebook which shows the same police beating incident from a different angle, also refer to \"Pasha.\"", "\"Listen to the screams of [victim's name] rapist and bastard Muhammad Pasha. It will not reduce your anger but your mind will be a bit relaxed,\" the post said.", "All the claims are false -- the video had circulated online for at least 24 hours prior to the Hyderabad attack and shows police and local residents beating a man accused of raping a 10-year-old girl on November 23 in Chittoor, a district in the southern Indian state of Andhra Pradesh.", "Very similar video to that used in the misleading posts was published here on YouTube in local Telugu language report uploaded November 26 -- one day before the rape-murder in Hyderabad.", "“Exclusive Visuals: Police beat an accused of raping a ten-year-old girl| Chittoor| NTV,” the video’s Telugu-language caption says.", "Below are comparison screenshots of the video shared the misleading Facebook post (L) and the video seen in the news report (R):", "Reverse image searches on Google using keyframes from the misleading video obtained with InVID, a digital verification tool, led to this report published on November 27 by The Hindu, a daily newspaper in India.", "“Accused in rape case thrashed by cops, public in Chittoor,” reads the headline, above a screenshot taken from the footage of the incident.", "Below is a screenshot of the report:", "AFP also obtained a copy of the police complaint from a local journalist in Chittoor, Hrudaya Vihari, on December 5.", "Below is a screenshot of the complaint with details that the identity of the victim redacted:", "The police complaint states that the alleged perpetrator “committed sexual assault” on a 10-year-old girl in the village of Kotala and was charged with rape.", "Local police chief, E. Ramanjneyulu, confirmed that the man seen in the misleading video was the man accused of rape in Chittoor.", "“We have arrested the accused and sent him to Madanapalle sub-jail after bringing him before the local court,” Ramanjneyulu told AFP in a phone interview with AFP on December 5.", "“He is still behind bars.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]