["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Donald Trump was being rebuked for saying women who get an abortion should be punished, a pro-Trump political action committee attacked Ted Cruz on Syrian refugees and illegal immigration.", "Great America PAC aired its TV ad in Wisconsin and other markets on March 31, 2016, a day after Trump’s abortion comments in Green Bay and six days before Wisconsin’s primary election.", "Refugee center in Hoxter, Germany, that primarily serves refugees from Syria. (Mark Hoffman photo)", "The 30-second spot shows a woman in her kitchen with two children. She starts by talking about Trump and terrorist attacks in Europe and California.", "\"Sure, I get some grief when I say I'm voting for Donald Trump. But you know what? I want to protect my family. Paris, San Bernardino and now Brussels? I want a president that will keep us safe.", "\"We need to control our borders and stop letting in dangerous people. Trump will do that. And Ted Cruz? He wanted to let in more Syrian refugees and give amnesty to illegal immigrants. That won't protect my family. Donald Trump will.\"", "Cruz -- who handily won Wisconsin, but has almost no chance to win the Republican presidential nomination on the first ballot at the party’s convention -- has cast himself as tough on terrorism and border control.", "We found that the ad’s clever use of the past tense -- in saying the Texas senator wanted to let in more Syrian refugees and give amnesty to illegal immigrants -- has some foundation.", "But the foundation isn’t entirely solid. And when the woman in the ad returns to speaking in the present tense -- \"That won’t protect my family\" -- the ad leaves a misleading impression of Cruz’s current positions.", "Setting the table", "A few notes up front:", "Great America PAC, founded in February 2016 and formerly known as TrumPAC, didn’t respond to our requests for information to support the ad’s claim.", "A Cruz campaign spokesman told us that on immigration, the senator never backed amnesty and that on Syrian refugees, he never backed an increase in the numbers.", "The Washington Post Fact Checker gave the ad two Pinocchios -- its rating for a claim that has \"significant omissions and/or exaggerations.\" Our evaluation was similar.", "‘Wanted to let in more Syrian refugees’", "As reported during the presidential campaign by the Huffington Post, Cruz in 2014 expressed support for allowing Syrian refugees into the United States. He said in a Fox News report on Syrian refugees (as shown in a video is on Cruz’s own Senate web page):", "\"We have welcomed refugees — the tired, huddled masses — for centuries. That’s been the history of the United States. We should continue to do so.\" He added: \"We have to continue to be vigilant to make sure those coming are not affiliated with the terrorists, but we can do that.\"", "The Fact Checker found in reviewing other Cruz statements in 2014 that he was not a particularly vocal advocate for accepting more refugees, but he supported the idea.", "After the terrorist attacks in Paris in November 2015, Cruz changed course, seeking to ban Syrian refugees who are Muslim from entering the United States.", "Wanted to ‘give amnesty to illegal immigrants’", "Some consider amnesty to be anything less than deporting all illegal immigrants, while others think of amnesty as letting immigrants stay with no punishment or additional requirements.", "Both the Fact Checker and FactCheck.org found it impossible to sort out Cruz’s position on the 2013 comprehensive immigration reform bill from the so-called Gang of Eight.", "FactCheck.org noted that one Cruz amendment to the bill would have stripped out a proposal for a path to citizenship for those currently in the country illegally -- but, purposefully, also left intact provisions to provide legal status for them.", "And the Fact Checker pointed out that Cruz introduced five amendments to the bill, including one that expanded legal immigration, and gave passionate speeches in support of his amendments. Cruz now contends his amendments were meant as a \"poison pill\" to kill the bill, which ultimately fell apart.", "But as the Fact Checker observed, \"there’s no way to prove which version of the story is the truth; what we can say is that Cruz was being disingenuous then or disingenuous now.\"", "As for now, Cruz is adamantly against amnesty.", "Our rating", "Great America PAC says Cruz \"wanted to let in more Syrian refugees and give amnesty to illegal immigrants.\"", "Cruz in 2014 supported continuing to allow Syrian refugees into the United States and in 2013, he appeared to back measures to give legal status to illegal immigrants. At the same time, the political action committee’s ad suggests those positions are current ones, when they aren’t.", "For a statement that is partially accurate but takes things out of context, our rating is Half True.", "Political TV Ad Archive, Great America PAC \"Concerened\" ad first aired March 31, 2016", "Interview, Ted Cruz campaign director of rapid response Brian Phillips, April 1, 2016", "PolitiFact National, \"Cruz repeats False attack about immigration bill letting Syrians in without background checks,\" Feb. 3, 2016", "PolitiFact National, \"Ted Cruz: most GOP candidates ‘have supported amnesty,’\" Aug. 7, 2015", "Washington Post Fact Checker, \"Pro-Trump group misleads viewers about Ted Cruz’s stance on refugees and immigration,\" April 4, 2016", "Dallas Morning News, \"Pro-Trump PAC ad calls Cruz weak on ISIS and border security,\" April 4, 2016", "Huffington Post, \"Ted Cruz last year: We should welcome Syrian refugees, and we can do it safely,\" Nov. 19, 2015", "FactCheck.org, \"Did Cruz support legalization?,\" Dec. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]