["About this rating", "A picture supposedly showing a shark jumping out of the water to attack a person parasailing is occasionally mistaken as genuine as it circulates on social media:", "This is not a genuine photograph of a parasailer nearly being bitten by a large shark. This is a composite image of at least two separate photographs.", "The image of the shark was taken from a photograph by David Jenkins for the Cater News Agency in 2013. The original photograph came from a series of images documenting a great white shark's attempt to catch a seal off the coast of South Africa. The image of the shark was then inserted into a second, unrelated photograph of a person parasailing.", "Here's a look at the original photograph (left) and the doctored image (right):", "Jenkins' photographs received some media attention when they were first published in 2013. One of the images was even featured on the cover of Time magazine's \"The Year in Pictures\" issue.", "Here's a look at the Time magazine cover and an excerpt from a CNN report about the photographs:", "Wildlife photographer David \"Baz\" Jenkins seems to have a knack for photographing great white sharks.", "His website is filled with pictures of the fearsome predators leaping from the sea and devouring seals.", "But a photo Jenkins took during a July shark-watching cruise in South Africa is garnering the Irish photographer so much attention that his website was having trouble keeping up Wednesday after numerous media outlets published his shots.", "One photo shows a seal seemingly balanced on the tip of the rising shark's mouth, moments away from becoming a meal. Later photos in the series show the seal twisting away and escaping as the giant shark's jaws snap shut.", "\"This seal was one lucky pup,\" Jenkins told Caters News Agency.", "No parasailers (or apparently seals) were harmed in the making of this photograph.", "CNN.   \"Seal Gives Shark the Slip in Great White Photo.\"\r\n    10 October 2013.", "Caters News Agency.   \"Seal Dodges Jaws Of Shark.\"\r\n    Retrieved 19 September 2019.", "Obozrevatel.   \"На грани смерти.\"\r\n    13 October 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]