["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Gov. Scott Walker’s first term was marked by a flood of pro-business legislation.", "With Walker poised to start a second term in January 2015, the state’s leading business lobby -- Wisconsin Manufacturers and Commerce -- wants Walker and Republicans to press further in the name of creating a better business climate.", "Tops on the legislative agenda for the group, at least based on a Dec. 8, 2014 opinion piece by its president and CEO Kurt Bauer, is so-called right-to-work legislation.", "\"Should joining a private-sector union be voluntary as it is in 24 states or should it be mandatory?\" Bauer wrote.", "He added: \"Beyond the personal freedom component to this debate is the economic development argument. It is well-known that site selectors who decide where businesses expand or relocate shun closed shop states like Wisconsin in favor of Right to Work states like Iowa, Indiana and Michigan.\"", "Iowa’s right to work law dates to 1947. Indiana and Michigan approved the change in 2012.", "One four-letter word caught our attention in Bauer’s piece: \"shun.\"", "Is Wisconsin getting shut out of business expansion because it allows private employers to sign contracts with unions that require all covered employees to join the union?", "A closer look", "We started by asking Bauer about the term \"site selectors.\" Bauer told us it refers to CEOs and consulting firms who help companies search for new locations.", "He pointed to a 2012 survey of U.S. corporate executives regarding factors they consider when choosing sites for expansion or relocation. In that survey by Area Development magazine, 72 percent said it was important or very important that a state has passed \"right-to-work\" legislation.", "Bauer noted that in a November 2012 article in the magazine, one consultant estimated that three-fourths of his firm’s clients want only locations that are in right-to-work states.", "That kind of anecdotal evidence was mentioned repeatedly by site-search consultants quoted in the magazine, as well as in another publication, Site Selection.", "Estimates vary on the strength of the preference.", "States will be eliminated at the first stage in \"about half\" of projects, one consultant told Site Selection. After Michigan passed right to work, another consultant told the publication that \"it will get Michigan a few more looks on site searches, mostly industrial ones. It’s hard to know what percentage.\"", "Some consultants say manufacturing companies are more likely to steer clear of unions when compared to firms in other sectors. Wisconsin is a manufacturing-rich state.", "Area Development magazine framed the right to work debate this way: Businesses tend to support right-to-work because it makes unionization less likely and in turn often means lower labor costs. Unions oppose them because right to work weakens union membership and wages.", "\"In a right-to-work state, any worker choosing not to join the union or pay for the services still gets the benefits,\" the magazine noted. \"Unions often refer to those workers as ‘free riders,’ and because wages tend to be lower in right-to-work states, unions famously refer to the concept as ‘right-to-work for less.’", "While \"shun\" suggests Wisconsin simply loses out when businesses are deciding where to build, even a quick peek at the state jobs agency’s website yields examples to the contrary. Global food ingredients company Kerry expanded here as did Seneca Foods; Plexus Corp. built a global headquarters in Neenah; Amazon is opening a new facility in Kenosha.", "The Wisconsin Economic Development Corporation \"does not track whether unionization or Right to Work Laws are a factor in a company’s decision to relocate or expand in Wisconsin,\" jobs agency spokesman Mark Maley said.", "The same 2010 article Bauer cited noted that \"choosing a state with a low-union profile or locating in a (right to work) state only ranked 10th and 12th respectively among a list of 26 different site selection factors,\" according to Area Development’s 26th Annual Corporate Survey.", "In the most recent Area Development survey, published in 2013, these factors were ahead of union issues: taxes, availability of buildings, energy costs, building costs, telecommunications infrastructure, skilled workforce, highway connections, government investment in workforce development.", "Bauer acknowledged many factors can come into play when businesses make such decisions.", "Responses from his group’s own survey of members show that some executives are concerned about the lack of a right to work law. But the number (15 percent) was well short of a majority.", "In past years, the WMC did not ask specifically about attitudes toward unionization. But that changed in 2014, the group said. Some 260 executives participated in the survey.", "\"When asked what one thing state government can do to improve Wisconsin’s business climate, 35 percent said reduce taxes, 15 percent said become a Right to Work state and 14 percent said reform employment laws, like harmonizing the state and federal versions of family medical leave,\" a WMC news release noted.", "Our rating", "Wisconsin Manufacturers & Commerce said: \"Site selectors who decide where businesses expand or relocate shun closed shop states like Wisconsin in favor of Right to Work states like Iowa, Indiana and Michigan.\"", "There’s anecdotal evidence that some firms screen out states without right to work laws when seeking to expand, and surveys of site selectors say this issue is important.", "But its far down the list of top concerns for many site selectors, suggesting that \"shun\" is too strong a term.", "We rate the claim Half True.", "Wisconsin Manufacturers and Commerce, \"Continuing Wisconsin’s era of reform,\" by Kurt Bauer, Dec. 8, 2014", "Phone interview with Kurt Bauer, president/CEO, Wisconsin Manufacturers and Commerce, Dec. 10, 2014", "Emails with Mark Maley, spokesman, Wisconsin Economic Development Corporation, Dec. 12, 2014", "Emails with Karen Hickey, spokeswoman, state AFL-CIO, Dec. 10, 2014", "Area Development magazine, \"Right to Work/Low union-profile states: Making or Breaking a Deal,\" November 2012", "Area Development magazine, \"Critical Location Factor #10: Union Activity Can Be a Deal Breaker,\" Fall 2013", "Wisconsin Manufacturers and Commerce, press release about July 2014 survey, July 21, 2014", "Site Selection magazine, \"What Makes a Business Climate Good?\" January 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]