["The internet was briefly captivated by the idea of parallel universes and other cosmic oddities after reports circulated that NASA had detected “evidence of parallel universe where time runs backward.”", "Memes and banter spread on Twitter and Facebook in the wake of several news articles making the claim. The stories largely attributed the claim to a report in the magazine New Scientist titled “We may have spotted a parallel universe going backwards in time.”", "“so nasa just discovered evidence of a parallel universe ......................... brb while i go scream,” one tweet with several hundred thousand likes and retweets reads.", "“SO NO ONE IS GONNA TALK ABOUT HOW NASA DISCOVERED EVIDENCE OF A PARALLEL UNIVERSE TO OURS WHERE TIME RUNS BACKWARDS AND ITS LAWS OF PHYSICS ARE OPPOSITE TO OURS??? okay.,” another Facebook post with over 450 shares reads.", "The New Scientist article references research published at the beginning of the year and outlines some of the explanations scientists have for their findings. The conclusions drawn by other outlets from the headline are inaccurate.", "The many headlines claiming NASA had discovered a parallel universe can largely be traced back to an April 8 report in New Scientist, which outlines research at the Antarctic Impulsive Transient Antenna, or ANITA.", "ANITA is a radio research site meant to study neutrinos — subatomic particles that don’t usually interact with normal matter. The station is funded through grants from various government agencies, including NASA, though not all the researchers in question were affiliated.", "The New Scientist article documents debates between physicists about what explained ANITA’s abnormal detection of neutrinos. High-energy neutrinos are normally detected coming from space when they are passing through the Antarctic ice.", "Some of the high-energy neutrinos seem to come from out of the Antarctic ice, though, which would be an incredibly unlikely phenomenon, since particles would've had to have traveled through the entire planet to reach ANITA's sensors.", "The abnormal results have led to a discussion between physicists looking to explain the phenomenon, with possibly radical implications for the entire field.", "The New Scientist article documents the latest research on the topic, published in April, which argues that the Standard Model of particle physics can’t explain the phenomena.", "“Explaining this signal requires the existence of a topsy-turvy universe created in the same big bang as our own and existing in parallel with it. In this mirror world, positive is negative, left is right and time runs backwards,” the New Scientist article reads.", "That interpretation is one of several hypotheses that scientists in the piece and elsewhere online have said is possible, though it is far from the only scenario. Furthermore, the April study did not argue for the existence of an alternate world, instead only making clear that physicists’ current models weren’t enough to explain the case of abnormal Antarctic neutrinos.", "The first studies of the abnormal neutrinos were published in 2016, shortly after ANITA’s launch. Researchers have since ruled out all explanations for the neutrinos that would comply with the Standard Model.", "“Other explanations for the anomalous signals — possibly involving exotic physics — need to be considered,” the research laboratory that published the research wrote in January. Scientists have previously posited several “exotic” scenarios, including the idea in a 2018 study that the abnormal neutrinos are coming from a dark matter “quasi-stable relic, itself gravitationally trapped inside the Earth.”", "This would only be possible only if the contentious idea that the universe has a twin mirror “antiverse” were true. That possibility is dubious at best right now.", "The recent ANITA study does not have any findings that support the “antiverse” idea, known to physicists as the CPT Symmetry Universe. Researchers affiliated with the project have offered scenarios ranging from scientists needing to update their models about the Antarctic ice to decaying super heavy dark matter in the Milky Way.", "Given the large number of alternative possibilities, including many that are more likely than a parallel universe with anti-physics, more research is needed before any concrete conclusions can be made.", "We rate this claim PARTLY FALSE because it is mostly unsupported by our research. It is misleading to say that NASA has found a parallel universe. While it is true that the ANITA observations may prompt a revision of the Standard Model, it is false to claim that the existence of a parallel universe is the explanation for those observations. The studies referenced in several viral articles do not claim that a parallel universe with reverse physics was discovered either. While it is possible that our universe has a parallel “antiverse,” that is far from the clear explanation for the abnormal neutrinos.", "Our fact check work is supported in part by a grant from Facebook."]