["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In May 2020, a video supposedly showing Vice President Mike Pence delivering empty boxes that were supposed to be filled with personal protective equipment (PPE) to the Woodbine Rehabilitation and Healthcare Center in Alexandria, Virginia, was featured on the show \"Jimmy Kimmel Live.\" A clip of this segment was later shared on social media along with the caption: \"Mike Pence caught on hot mic delivering empty boxes of PPE for a PR stunt.\"", "This is genuine footage of Pence. However, it does not show him \"caught on hot mic\" admitting that he just delivered a bunch of empty boxes to a health care facility. This video actually shows Pence making a humorous quip after delivering boxes that were truly filled with PPE.", "The full video from C-Span shows Pence transporting several boxes from a truck to the door of the health care center. After unloading the boxes from his dolly, Pence returns to the truck to grab another round of boxes but is informed by someone that the remaining boxes are empty. Pence then jokes that he should carry one of the empty boxes for the cameras. The man replies with a quip of his own, saying that the empty ones are much easier to carry than the full ones, which draws laughter from the crowd. Pence then closes the van door.", "You can see this exchange around the 9-minute mark of the following video from C-Span:", "https://www.c-span.org/video/?471876-1/vice-president-pence-delivers-ppe-woodbine-rehabilitation-center", "We reached out to the Woodbine Rehabilitation Center to confirm that it had received PPE from the vice president. While we have yet to receive a response, the facility did post a message on Facebook to thank  Pence and his team:", "Jon Thompson, a spokesperson for the vice president, called the claim that Pence was delivering empty boxes \"absolute garbage\" in a tweet:", "Coleman, Justine.   \"Pence Delivers PPE to Alexandria Nursing Home.\"\r\n    The Hill.   7 May 2020.", "C-Span.   \"Vice President Pence Delivers PPE to Woodbine Rehabilitation Center.\"\r\n    7 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]