["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New Hampshire voters made history this month, electing the nation’s first all-female delegation to Congress. And they weren’t the only ones to break down barriers.\n\nAcross the country, voters broke records, electing the most diverse class ever to enter Congress, according to U.S. Rep.-elect Ann McLane Kuster, who will be sworn in in New Hampshire’s 2nd Congressional District in January.\n\n\"I’m … entering in the most diverse class ever,\" Kuster told MSNBC’s Melissa Harris-Perry, Sunday, Nov. 11 -- five days after the election. \"The Democratic caucus in the U.S. House of Representatives will be (a) majority of women and minorities. So, that is a wonderful experience. … I take great pride in that, as well.\"\n\nAs Kuster notes, the incoming Democratic caucus includes a majority of women and minorities for the first time in history, according to news reports. Despite the gains, however, white men still hold a two-thirds majority in the 113th Congress.\n\nBloomberg News pointed out that the House floor didn’t even have women’s restrooms until 2011, when Speaker John Boehner had them installed.\n\nBut, does that make this House of Representatives the most diverse ever? We decided to check the books.\n\nAccording to preliminary counts, the incoming class in the House of Representatives, to be sworn in in January, features 78 women, 42 African Americans and 28 Latinos, among the 435 total representatives.\n\nVoters initially elected 43 African American representatives across the country, but that number fell to 42 after U.S. Rep. Jesse Jackson Jr. resigned his seat Wednesday. If that number stands, the Congressional Black Caucus will have lost two members from the 2012 count, falling from 44.\n\nOverall, since other minority groups will have added to their numbers, new records for diversity are poised to be set.\n\nThe class of 78 women elected to the House this month marks an increase of five over the record 73, who served in each of the last three sessions of Congress, according to the Center for Women and Politics at Rutgers University.\n\nFederal counts show a total of 277 women have served in the House since 1917, when Rep. Jeannette Rankin of Montana became the first elected to Congress.\n\nAs for Latinos, the 28 members represent an increase of four over the 2012 count -- the previous high, according to the National Association of Latino Elected and Appointed Officials Educational Fund.\n\nIn total, 91 Hispanic representatives have served since Joseph Marion Hernandez, of Florida, became the first in 1822. The current Congress’ class of 24 had been the largest until this month’s election.\n\n\"We are seeing greater geographic representation,\" said Rosalind Gold, senior director of policy research and advocacy for the California-based Education Fund. \"We’re seeing more and more that candidates can both win in districts that are traditional centers of Latino population, but they can also appeal to very diverse constituencies. … There were a lot of milestones in this election.\"\n\nLooking forward, the next Congress also will see more Asian American and Pacific Islander members in Congress than ever before-- 13 in the House-- while Arab Americans retained at least four of their five House seats, as U.S. Rep. Charles Boustany of Louisiana, faces a December runoff election.\n\nOur ruling:\n\nThe 113th Congress, like the ones before it, will go down as the most diverse class in history. The African Americans caucus have lost one seat, but voters elected more women than ever before (78), more Latinos (28) and more Asian Americans and Pacific Islanders (13). We rate Kuster’s claim True.", "MSNBC.msn.com, Ann Kuster with Melissa Harris-Perry, Nov. 11, 2012.\n\nEmail exchange with Garrick Delzell, Rep.-elect Ann McLane Kuster spokesman, Nov. 12, 2012.\n\nBloomberg News, \"White Guys Running the U.S. House Face Diverse Democrats,\" Nov. 8, 2012.\n\nCNN, \"New U.S. House: Women and minorities to the left; white men to the right,\" Nov. 14, 2012.\n\nCenter for American Women and Politics, Record Number of Women Will Serve in Congress; \nNew Hampshire Elects Women to All Top Posts,\" Nov. 7, 2012.\n\nCenter for American Women and Politics, \"Women in the U.S. Congress 2012,\" accessed Nov. 21, 2012.\n\nU.S. House of Representatives’ Office of the Clerk, Women in Congress, accessed Nov. 21, 2012.\n\nRoll Call, \"New Democrats, Hispanic Caucus See Gains for 113th,\" Nov. 12, 2012.\n\nNational Association of Latino Elected and Appointed Officials Educational Fund, \"Latino Candidates Make History on Election Night,\" Nov. 7, 2012.\n\nLibrary of Congress, Hispanic Americans in Congress, accessed Nov. 21, 2012\n\nU.S. House of Representatives’ Office of the Clerk, Black Americans in Congress, accessed Nov. 21, 2012\n\nCongressional Asian Pacific American Caucus, \"CAPAC Welcomes Newly Elected Asian Americans and Pacific Islanders to Congress,\" Nov. 7, 2012.\n\nExaminer, \"Asian Pacific American Gains Another House Seat,\" Nov. 20, 2012.\n\nArab American Institute, \"Arab American Candidate Results,\" Nov. 7, 2012.\n\nEmail interview with Kathy Kleeman, spokeswoman for the Center for American Women and Politics, November 21, 2012\n\nInterview with Rosalind Gold, senior director of policy research and advocacy at the National Association of Latino Elected and Appointed Officials Education Fund, November 21, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]