["After months of discounting Russian involvement in the election, President-elect Donald Trump admitted that Russia was behind the campaign hacks and document leaks.", "\"As far as hacking, I think it was Russia,\" he said at a Jan. 11 press conference from Trump Tower in New York, his first press conference in several months.", "Government intelligence agents have concluded that Russia tried to influence the presidential election in a way that favored Trump over Hillary Clinton. A leading reason for this conclusion is that Russian actors tried to access accounts belonging to both Democrats and Republicans through cyber intrusion, but they only widely disseminated significant information stolen from the Democrats.", "At his press conference, Trump said the Democrats could have done a better job protecting themselves, like the Republicans did.", "The Russians \"tried to hack the Republican National Committee, and they were unable to break through,\" Trump said.", "Over the past few weeks, there has been some confusion about whether the RNC had been infiltrated in a manner similar to the DNC. So we decided to put Trump’s claim on the Truth-O-Meter.", "In a Kremlin-directed campaign, online con artists stole, then leaked, emails from Clinton campaign Chair John Podesta and the Democratic National Committee. The emails ended up being posted on WikiLeaks and other online sources. The leaks caused many headaches for the Clinton campaign and led to DNC Chair Debbie Wasserman Schultz’s resignation.", "It’s clear that Russian hackers did infiltrate some Republicans and affiliated groups. The website DC Leaks published about 200 emails related to Republican Party business, as well as the emails of former Secretary of State Colin Powell. Sen. Lindsey Graham, R-S.C., said on CNN that Russian actors compromised his campaign emails.", "But the claim that the RNC specifically was not hacked is significant because the organization is the core of the national Republican Party structure.", "The New York Times reported Dec. 9 that the Russians did hack the RNC’s computer systems. But the Wall Street Journal reported Dec. 16 that the RNC hacking attempt was unsuccessful. Both reports were based on anonymous sources.", "Two government reports about the Russian election interference — published Dec. 29 and Jan. 6 — don’t provide any clarity. The more extensive Jan. 6 report says only: \"Russia collected on some Republican-affiliated targets but did not conduct a comparable disclosure campaign.\"", "FBI Director James Comey offered the most definitive statements recently, in a Jan. 10 hearing before the Senate Intelligence Committee.", "He explained that the Russian hackers had accessed state-level Republican organizations and candidates, as well as outdated email domains associated with the RNC, but not the active RNC or the Trump campaign.", "\"There was evidence that there was hacking directed at state level organizations, state level campaigns and the RNC, but old domains of the RNC,\" Comey said. \"That is, email domains that they were no longer using, and the information was harvested from there, but it was old stuff. None of that was released. We did not develop any evidence that the Trump campaign or the current RNC was successfully hacked.\"", "He added that the methods used to attack the RNC and DNC systems were similar. The Russian actors used a technique called phishing, meaning the cyber intruders sent emails designed to trick the recipient into clicking a link and giving over his or her email password.", "But Comey said the Russian attackers \"got far deeper and wider into\" the DNC, though he couldn’t say why they didn’t get into the current RNC system.", "Trump and other Republican leaders say that the hackers were unable to get into the RNC because of the organization’s superior cyber defenses. While this is a plausible claim, we are unable to independently corroborate it.", "The RNC pointed us to the December Wall Street Journal article mentioned previously, which reported that \"intruders failed to get past security defenses on the RNC’s computer networks.\" Additionally, the cyber intruders were much less aggressive in their attempts to penetrate the RNC than they were in their attacks against the DNC. This article is based on unnamed sources said to be close to the RNC and the intelligence investigation.", "The DNC, in contrast, did not have the most-advanced programs for detecting suspicious email traffic installed, and the organization was slow to respond to the FBI’s warning that it had been hacked, reported the New York Times, in an article based on interviews with several on-the-record sources.", "Our ruling", "Trump said the Russians \"tried to hack the Republican National Committee, and they were unable to break through.\"", "While Russians were able to get into the email accounts of some Republican individuals and state-level Republican organizations, they did not break into the Republican National Committee’s current system, according to the director of the FBI.", "Russians did access email domains associated with the RNC that were no longer in use, but the information was outdated and wasn’t released. Additionally, it’s not completely clear why hackers were unable to get into the current RNC.", "The gist of Trump’s claim is correct, but it’s important to keep in mind that Russian hackers did access some Republican data, including the outdated RNC account. So we rate his claim Mostly True.", "NPR, Trump press conference transcript, Jan. 11, 2017", "CQ, Transcript of Senate Select Intelligence Committee Hearing on Russian Intelligence Activities, Jan. 10, 2017", "Homeland Security and FBI, \"Grizzly Steppe -  Russian Malicious Cyber Activity,\" Dec. 29, 2016", "ODNI, \"Background to ‘Assessing Russian Activities and Intentions in Recent US Elections’: The Analytic Process and Cyber Incident Attribution,\" Jan. 6, 2017", "Wall Street Journal, \"Republican National Committee Security Foiled Russian Hackers,\" Dec. 16, 2016", "New York Times, \"Russian Hackers Acted to Aid Trump in Election, U.S. Says,\" Dec. 9, 2016", "New York Times, \"The Perfect Weapon: How Russian Cyberpower Invaded the U.S.,\" Dec. 13, 2016", "Washington Post, \"U.S. intelligence officials say Russian hacks ‘prioritized’ Democrats,\" Dec. 12, 2016", "CNN, \"Graham: Russians hacked my campaign email account,\" Dec. 14, 2016", "DC leaks, Republican Party emails, accessed Jan. 10, 2017", "NBC, \"Russia Hack of U.S. Politics Bigger Than Disclosed, Includes GOP,\" Oct. 8, 2016", "Emails, RNC spokesman Ryan Mahoney, Jan. 10, 2017", "Emails, FBI spokeswoman Jillian Stickels, Jan. 10, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]