["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the wake of a shooting that wounded two children, ages 10 and 11, Milwaukee Police Chief Edward Flynn held a news conference and denounced the shooters as cowards.", "\"We have remorseless, reckless criminals in possession of high-quality firearms shooting at each other, and they don't care who they hit,\" Flynn said of the July 23, 2014 shooting in the 2800 block of N. 37th St.", "As of that date, there had been 13 kids wounded in such shootings in 2014. One of those, Sierra Guyton, who was wounded in a playground shooting, later died.", "Flynn said getting firearms off the streets is a focus of his department’s efforts and then offered a statement that you don’t hear often when it comes to crime -- how efforts in Milwaukee compare favorably to New York City.", "\"As of July 6th, the New York City Police Department had confiscated approximately 1,350 firearms from the streets of a city of 9 million,\" the chief said. \"So far this year, the Milwaukee Police Department in a city of 600,000 -- 15 times smaller than New York -- has seized 1,340 firearms from the streets of this city.\"", "Are Milwaukee cops keeping pace with the NYPD when it comes to gun seizures?", "Let’s take a closer look.", "A visit from NYC brass", "When Flynn made the claim, New York’s numbers were top-of-mind.", "\"Several NYPD executive level commanders were sent to Milwaukee by Commissioner (William) Bratton to study a variety of topics, including our methods of crime control, community relations, and accountability systems,\" said Lt. Mark Stanmeyer, Milwaukee Police Department spokesman.", "Indeed, the visit coincided with the day of the shooting and Flynn’s next-day news conference.", "When the topic of gun seizures was discussed at the get-together, New York officials said they had seized 1,350 firearms as of July 6, 2014, according to Stanmeyer.", "MPD officials saw that figure nearly matched theirs -- 1,347 seizures as of July 24, 2014.", "To be sure, the MIlwaukee figure included an extra two-plus weeks.", "But Flynn had a talking point.", "When we asked New York Police Department officials about guns seized, they were not able to provide the number for July 6, 2014 that was used by Flynn.", "But their data tracked with the figure Flynn used  -- 1,289 firearms had been seized as of June 8, 2014 and 1,881 had been seized as of Aug. 10, 2014, according to department spokeswoman Sophia Mason.", "To get the comparison on the same time frame, the Milwaukee figure was 1,460 as of Aug. 10, 2014. In 2013, the department seized 1,921 guns.", "\"I don’t believe the point the Chief was making about the population/gun recovery ratio is lost,\" Stanmeyer said in an email. \"Even using the August 10 data, they only have 421 more guns with 7.7 million more people.\"", "He also noted that the Milwaukee figure does not include 353 firearms turned in during a  gun buyback program last spring that was led by faith leaders.", "So what’s the explanation for the similar numbers?", "First, in New York the number of guns seized is down compared with last year.", "Bratton said in a June 10, 2014 report on Capitalnewyork.com that the number \"in some respects is reflective of the fact that crime is continuing to go down.\" The numbers of murders, rapes and robberies also are lower than a year ago.", "\"We’ve had an increase, a temporary increase, in shootings. ... Crime goes up, it goes down,\" Bratton said in the article. \"It’s always going to go up at some point in time. We’ll always have the ability to push it down.\"", "Another factor could be at work in New York.", "New Mayor Bill de Blasio promised to reform the department’s long-standing and controversial stop-and-frisk policy where cops can detain, question and search people suspected of crimes.", "Even before de Blasio took office in January 2014, the number of stop and frisk stops had dropped sharply in the past two years. Law enforcement officials told the New York Post that such stops can be effective in obtaining illegal firearms.", "Our rating", "Flynn said his department’s gun seizures, through a mid-year point, were about to those of  much-larger New York City.", "New York’s numbers may be down a bit this year, so other factors may be at work. But Flynn’s claim didn’t get into the reasons why. It was a straightforward numerical claim.", "We rate it True.", "Milwaukee Journal Sentinel, \"Another ‘insane’ gunfight injures two kids,\" July 24, 2014", "WTMJ-TV (Channel 4), \"Chief Flynn, Mayor Barrett call out ‘remorseless, reckless criminals’ after shooting,\" July 24, 2014", "Milwaukee Journal Sentinel, \"Milwaukee gun buyback brings in steady flow of firearms,\" May 17, 2014", "Capitalnewyork.com, \"How low will de Blasio go on stop and frisk,\" Jan. 17, 2014", "New York Post, \"NYC sees 33% spike in murders, fewer guns seized,\" Jan. 28, 2014", "New York Times, \"Mayor says New York City will settle suits on stop-and-frisk tactics,\" Jan. 30, 2014", "Bigapplewonk/Capitalnewyork.com NYPD Police stops", "Emails, Lt. Mark Stanmeyer, spokesman, Milwaukee Police Department, Aug. 12, 13, 2014", "Emails, Sophia Mason, New York Police Department, Aug. 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]