["About this rating", "As California dealt with the deadliest wildfire in the state's history in November 2018, a number of social media users encountered an image that supposedly showed a \"fawn and bobcat cub found under a desk in office build after California forest fire rolled through\":", "Although this photograph was often presented as if it were taken during the deadly Camp Fire in November 2018, it was actually several years old by that time. Furthermore, the claim that the fawn and bobcat were \"found\" under a desk during a fire isn't exactly accurate.", "This photograph was taken in May 2009 at a facility run by the non-profit Animal Rescue Team during the Jesusita wildfire near Santa Barbara, California. Julia Di Sieno, the co-founder and Director of Animal Rescue Team, said that the bobcat and the fawn were rescued at different times and locations. In other words, they were not \"found\" huddled together under a desk during the fire.", "Discovery.com reported that while animals of different species are typically kept in separate areas, rescue workers were swamped in the aftermath of the fire and didn't have many options for housing these animals:", "Di Sieno helped rescue the bobcat kitten in the photo a week before, near Arnold Schwarzenegger’s Ranch, where it was dehydrated and near death. Di Sieno nurtured it back to health. They rescued the fawn during last week's wildfire. Although wild animals, especially of separate species, are never placed together due to regulations, in this emergency situation, they had no choice. During the mayhem of the fire, they were forced to put animals anywhere they could, since they had run out of crates large enough for the fawn. The kitten ran to the fawn, and it was instant bonding.", "Most wildlife knows instinctively to flee fires - to fly away, burrow, or run - but some don’t make it out in time. Rescue workers walk near the fire line with nets, searching for any injured animals or young separated from their parents. “Burn victims go to the local care hospital,” says Di Sieno. “We rescued bunnies, squirrels, two fawns. We’ve rescued I don’t know how many geese, chickens ducks, cats, birds, turkeys, and a baby owl and a baby raptor.”", "Discovery.com.   \"Jesusita Wildfire Animal Rescue.\"\r\n    18 May 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]