["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You've probably heard of \"pre-existing conditions,\" which provide an escape clause for health insurance companies. If you have a pre-existing condition, an insurance company typically won't pay for treatment.\n\n\nJ. James Rohack, president of the American Medical Association, cited them when he was asked during an appearance on\n\nFox News Sunday\n\non Aug. 16, 2009, whether the Democratic health plan would lead to rationing for older patients.", "\"Well, there's a myth that rationing doesn't occur right now,\" Rohack said. \"In the United States, if a woman's pregnant and on the individual market (and) tries to get health insurance, that's called a pre-existing condition and it's not paid for. That's why this bill's important. It gets rid of some of the rationing that's occurring right now.\" The AMA endorsed the House version of health care reform legislation in July.\n\n\nFirst, we should emphasize that he's only talking about the relatively small number of women who buy their coverage through what insurers call the individual market. About two-thirds of women have health insurance through their employer or their spouse's employer, and about 13 percent have public coverage such as Medicaid or military health care.\n\n\nSo the people affected by these limitations include the 19 percent now uninsured and the 6 percent that have coverage purchased on the individual market. These policies are sold directly to an individual by a private insurer, and the purchaser doesn't get the same consumer protections routinely given to those who have coverage through an employer. For example, people in employer-based health plans have benefited from requirements for maternity coverage that date back to the federal Pregnancy Discrimination Act of 1978. But individual plans are not included under that umbrella and are regulated state by state.\n\n\nIn 39 states, listed\n\nhere\n\n, insurers can turn down anyone for virtually any reason. It can be because you have a pre-existing condition, like cancer or diabetes. And pregnancy almost always counts too, according to the National Association of Insurance Commissioners, which represents the state government officials who regulate insurance sold within their borders. So if you're pregnant and living in one of these 39 states, you're very likely out of luck in securing individual health coverage. You'll have to pay for your care out of your own pocket or seek out charitable assistance.\n\n\nAnd the coverage isn't much better in the remaining 11 states. These states have \"guaranteed issue\" laws that say insurers cannot turn applicants down based on their health or risk status. But there's a caveat: Even if an insurer must offer you a plan, it can place exclusions on what the plan covers. Typically, the NAIC says, these exclusions last from six to 12 months, which rules out most or all maternity coverage. (After the exclusion expires, the insurer does have to cover those conditions, meaning that a subsequent pregnancy could be covered.)\n\n\nOne category of individual policyholders has it slightly better ? those who leave an employer's plan that had given them uninterrupted coverage for the pre-existing condition in question. Under the Health Insurance Portability and Accountability Act of 1996, or HIPAA, people in this category can obtain a plan that covers their pre-existing condition once they have exhausted their old employer's coverage under the law known as COBRA. However, a state only has to provide a minimum of one \"HIPAA plan\" within its borders, rather than requiring that every insurer operating in the state offer one. Such plans may have unfavorable terms and high premiums.\n\n\nSo back to Rohack's claim. Health care reform\n\nlegislation\n\nnow under consideration in Congress would, if enacted, improve the situation for pregnant women seeking health insurance by prohibiting restrictions based on pre-existing conditions. But for now, Rohack is correct that pregnancy is considered a pre-existing condition and prevents many women from getting coverage if they seek insurance on the individual market. We find his statement True.", "Fox News Channel, \"\n\nFox News Sunday\n\n,\" Aug. 16, 2009\n\n\nKaiser Family Foundation, \"Women's Health Insurance Coverage\"\n\nfactsheet\n\n, February 2007\n\n\nKaiser Family Foundation, \"Individual Market Guaranteed Issue (Not Applicable to HIPAA Eligible Individuals)\"\n\nfactsheet\n\n, 2008\n\n\nNational Women's Law Center, \"\n\nNowhere to Turn: How the Individual Health Insurance Market Fails Women\n\n,\" December 2008\n\n\nThe March of Dimes, \"\n\nPolicy Brief on Tax Credits for the Uninsured and Maternity Care\n\n,\" January 2004", "American Medical Association, \"AMA backs House health system reform bill that includes Medicare pay overhaul,\"\n\nnews release\n\n, July 27, 2009", "Interview with Brian Webb, manager of health policy and legislation at the National Association of Insurance Commissioners, Aug. 18, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]