["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Communities around the country have tightened coronavirus restrictions as COVID-19 cases surge. But recent claims on social media that Pennsylvania is banning alcohol sales leave out some important details.", "\"Pennsylvania just banned alcohol sales,\" one post says. \"What does that have to do with the virus? It’s about control.\"", "This overstates a recent rule the state imposed to slow the spread of COVID-19, and leads readers to believe that Pennsylvania has banned all alcohol sales. That’s wrong. People can’t drink at bars or restaurants on the day before Thanksgiving, but they can buy alcohol to take home and drink all they want.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Pennsylvania Gov. Tom Wolf and Health Secretary Rachel Levine announced new coronavirus restrictions on Nov. 23, including banning the sale of some (but not all) alcohol on the day before Thanksgiving.", "Starting at 5 p.m. on Nov. 25 until 8 a.m. on Nov. 26, bars, restaurants and private catered events cannot sell alcohol for people to drink on site.", "Businesses can still sell alcohol, including cocktails, to go. Liquor stores can also sell alcohol during normal business hours.", "The day before Thanksgiving is one of the busiest nights of the year for the service industry, the Philadelphia Inquirer reported, and many bar and restaurant owners were upset by this new mandate.", "Wolf warned about a heightened risk of infection through close contact as people drink together the night before a holiday.", "We rate this Facebook post Mostly False.", "Facebook post, Nov. 24, 2020", "CBS Philly, ‘Very dangerous situation’: Pennsylvania banning alcohol sales for on-site consumption at bars, restaurants on Thanksgiving Eve in effort to stop COVID surge, Nov. 23, 2020", "The Philadelphia Inquirer, Pennsylvania bans on-premise wine, beer, and liquor sales at restaurants and bars on Thanksgiving Eve, Nov. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]