["About this rating", "A portion of $3.7 million in grants awarded between 2014 and 2019 by the National Institutes of Health (NIH) to EcoHealth Alliance, a global environmental health nonprofit organization, helped fund research at the Wuhan Institute of Virology in China.", "However, not all of that $3.7 million went to the Wuhan Institute of Virology, and not all of the funding took place under the Obama administration. Approximately $700,000 of the $3.7 million total was approved under Donald Trump.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, reports started to circulate that the National Institutes of Health (NIH) had provided the Wuhan Institute of Virology a $3.7 million grant in 2015, while former U.S. President Obama was still in office. These reports were often accompanied by the evidence-free suggestion that the novel coronavirus that causes COVID-19 had \"escaped\" from this lab and the insinuation that, since this lab reportedly received funding from the Obama administration, the pandemic was therefore Obama's fault.", "This claim received widespread attention on April 17 when a reporter from the conservative outlet Newsmax asked President Donald Trump about it during a White House press briefing.", "Newsmax reporter Emerald Robinson asked: \"Thank you, Mr. President. U.S. Intelligence is saying this week that the coronavirus likely came from a level 4 lab in Wuhan. There's also another report that the NIH under the Obama administration in 2015 gave that lab $3.7 million in a grant. Why would the U.S. give a grant like that to China?\"", "Trump responded: \"The Obama administration gave them a grant of $3.7 million. I've been hearing about that. And we've instructed that if any grants are going to that area we're looking at it, literally about an hour ago, also early in the morning, we will end that grant very quickly. But it was granted quite awhile ago. They were granted a substantial amount of money.\"", "There's a lot to unpack there, so let's start with the basic claim:", "Did the Obama administration grant $3.7 million to the Wuhan Institute of Virology?", "Between 2014 and 2019, the EcoHealth Alliance was awarded a series of grants totaling approximately $3.7 million by the National Institute of Allergy and Infectious Diseases (a division of the National Institutes of Health) to study the \"risk of future coronavirus (CoV) emergence from wildlife using in-depth field investigations across the human-wildlife interface in China.\" Only a portion of this money has been used to fund research at the Wuhan Institute of Virology, however, and approximately $700,000 of this grant money was awarded under the Trump administration.", "Despite having a grain of truth at its core, the claim that the Obama administration gave a $3.7 million grant to the Wuhan Institute of Virology is therefore misleading at best. It first gained prominence on April 11, 2020, on the heels of an article published in the Daily Mail. The British tabloid claimed that it had obtained documents showing that coronavirus research at the Wuhan Institute of Virology had been funded by a $3.7 million grant from the U.S. government:", "\"Documents obtained by The Mail on Sunday show the Wuhan Institute of Virology undertook coronavirus experiments on mammals captured more than 1,000 miles away in Yunnan – funded by a $3.7 million grant from the US government.\"", "The Daily Mail did not provide links or screenshots to these documents. They did, however, write that this money funded a research paper published in November 2017 entitled: \"Discovery of a rich gene pool of bat SARS-related coronaviruses provides new insights into the origin of SARS coronavirus.\"", "This is the title of a genuine paper published by researchers from the Wuhan Institute of Virology. It's also true that this paper was partially funded by money granted by the National Institutes of Health. However, when we followed up using the grant number listed in the funding section of the paper (NIAID R01AI110964), we found that the NIH did not directly issue this series of grants to the Wuhan Institute of Virology.", "The Department of Health and Human Services' Tracking Accountability in Government Grants System (TAGGS) shows that NIAID R01AI110964 was awarded to the EcoHealth Alliance for \"understanding the risk of bat coronavirus emergence.\" Between 2014 and 2019, this global environmental health nonprofit organization received a total of $3.7 million from NIH:", "While a portion of these grants funded research at the Wuhan Institute of Virology, this lab did not receive all $3.7 million. Under award number NIAID R01AI110964, NIH also funded studies produced by institutions in the United States, Australia, and Singapore, and the work involving the Wuhan Institute of Virology was an international collaboration with the New York-based EcoHealth Alliance.", "Furthermore, while these funds were originally appropriated by the NIH in 2014 during the Obama administration, the most recent payment, in 2019, was authorized by the Trump administration. The payments record in the above-displayed image from the Department of Health and Human Services show that the EcoHealth Alliance filed \"Noncompeting Continuation\" applications in 2015, 2016, 2017, and 2018. In 2019, however, the organization filed a renewal application (previously called a \"competing continuation\"). This renewal application was awarded by the NIH under Trump's administration.", "Here's how NIH defines these two different types of grant applications:", "Renewal: Initial request for additional funding for a period subsequent to that provided by a current award. Renewal applications compete for funding with all other peer reviewed applications and must be developed as fully as though the applicant is applying for the first time. (Previously referred to as \"competing continuation.\")", "Noncompeting Continuation: Request or award for a subsequent budget period within a previously approved project for which a recipient does not have to compete with other applications.", "Although the initial grant was approved under the Obama administration in 2014, EcoHealth Alliance's renewal application was approved by the Trump administration in 2019.", "It should also be noted that these grants were not awarded to fund a laboratory. They were awarded to fund research into how bat coronavirus could emerge and spread to human populations. The purpose of this kind of research, spurred into action by the 2002 SARS outbreak, is to understand the process of how coronaviruses become transmissible to humans. That earlier outbreak was also caused by a coronavirus linked to bats.", "Is it unusual for the United States to fund research in other countries?", "In short, no. While this claim is often circulated as if the Obama administration did something unusual, or even nefarious, by awarding a series of grants that would subsequently fund research at the Wuhan Institute of Virology, the United States routinely provides funding to international research organizations. In fact, records show that the NIH has provided approximately $2.5 million in additional funding to various organizations in China (including Wuhan University) in 2018 and 2019, under the Trump administration. In 2007, while George W. Bush was president, NIH provided more than $2 million to various research centers across China.", "Furthermore, international organizations often come together to solve problems that could impact the global population, such as pandemic. In 2003, for instance, the World Health Organization (WHO) called on countries around the world to develop a diagnostic test for SARS.", "On 17 March 2003, WHO called upon 11 laboratories in 9 countries to join a collaborative multi-center research project on SARS diagnosis. This network takes advantage of modern communication technologies (e-mail; secure web site) to share outcomes of investigation of clinical samples from SARS cases in real time. Daily assessment of research results supports immediate refinement of investigative strategies and permits instant validation of laboratory findings. Network members share on the secure WHO web site electron microscopic pictures of viruses, sequences of genetic material for virus identification and characterization, virus isolates, various samples from patients and post-mortem tissues. Samples from one and the same patient can be analysed in parallel in several laboratories and results shared in real time. This network joins the intellectual resources of leading laboratories worldwide for a common goal: the detection of the SARS agent and the development of a diagnostic test.", "The COVID-19 pandemic has spurred a similar call to action:", "While political leaders have locked their borders, scientists have been shattering theirs, creating a global collaboration unlike any in history. Never before, researchers say, have so many experts in so many countries focused simultaneously on a single topic and with such urgency. Nearly all other research has ground to a halt", "Lloyd-Smith, James.   \"Predictions of Virus Spillover Across Species.\"\r\n   Nature.   29 June 2017.", "Owen, Glen.   \"Wuhan Lab Was Performing Coronavirus Experiments on Bats From the Caves Where the Disease is Believed to Have Originated - With a £3m Grant From the US.\"\r\n    Daily Mail.   11 April 2020.", "Dilanian, Ken and Courtney Kube.   \"U.S. Intel Community Examining Whether Coronavirus Emerged Accidentally From a Chinese Lab.\"\r\n    NBC News.   16 April 2020.", "Baier, Bret and Gregg Re.   \"Sources Believe Coronavirus Outbreak Originated in Wuhan Lab as Part of China's Efforts to Compete with US.\"\r\n    Fox News.   15 April 2020.", "Apuzza, Matt and David Kirkpatrick.   \"Covid-19 Changed How the World Does Science, Together.\"\r\n    The New York Times.   14 April 2020.", "Barclay, Eliza.   \"Why These Scientists Still Doubt the Coronavirus Leaked From a Chinese Lab.\"\r\n    Vox.   23 April 2020.", "United Nations.     \"UN Mobilizes Global Cooperation in Science-Based COVID-19 Responses.\"  \r\n  Retrieved 23 April 2020.", "McNeil, Donald.   \"Scientists Were Hunting for the Next Ebola. Now the U.S. Has Cut Off Their Funding.\"\r\n    The New York Times.   25 October 2019.", "Dan Evon is a former writer for Snopes.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]