["About this rating", "In early 2020, amid a global health crisis caused by the spread of a new coronavirus, readers asked us to fact-check rumors that Pope Francis had been caught up in an outbreak in Italy.", "In late February, the Malaysian website Making Comments Meaningful (MCM) published an article with the headline \"Vatican Confirms Pope Francis and Two Aides Test Positive for Coronavirus.\" That post reported that:", "The Vatican has confirmed in a statement that Pope Francis and two of his aides have tested positive for the novel Coronavirus. The three new cases add up to the over 400 cases confirmed in Italy under a week.", "Pope Francis missed a planned Mass with clergy in Rome yesterday after showing Coronavirus-like symptoms. The Vatican had earlier said the pontiff, 83, had a slight indisposition and could proceed with the rest of his planned work today.", "The pope and his aides have been quarantined and receiving medical attention near Santa Marta, the Vatican hotel where he lives. The pope was seen coughing and blowing his nose during the Asha [sic] Wednesday Mass.", "The MCM article was shared widely on social media and formed the basis of a video by YouTube user Chadd Sinclair, who repeated the article's claims.", "Those claims were false. As of late February, when MCM published its report, and March 3, when this fact check was published, the Vatican had not \"confirmed\" that Francis or any of his aides had tested positive for the coronavirus. Moreover, according to one unconfirmed news report in Italy, the pope had actually tested negative for the disease.", "At an Ash Wednesday service in the Vatican on Feb. 26, Francis was seen coughing and blowing his nose, causing some observers to speculate that the 83-year-old may have been among hundreds affected by a widespread coronavirus outbreak in Italy:", "However, on the following day Vatican spokesperson Matteo Bruni clarified that Francis was suffering only from a \"slight indisposition,\" and on Feb. 28 Bruni explicitly rejected suggestions that Francis had contracted coronavirus, telling reporters, \"There is no evidence that would lead to diagnosing anything but a mild indisposition.\"", "On March 1, the pope himself told followers at St. Peter's Square that he had a cold (\"il raffreddore\") and would not be attending a Lenten retreat in the nearby town of Arricia.", "Not only had the Vatican not \"confirmed\" suspicions that Francis had tested positive for the coronavirus, but the Holy See had also explicitly rejected such claims, saying that Francis was only suffering from a cold. Much of MCM's article was actually plagiarized from an earlier Press Association report.", "On March 3, the Italian newspaper Il Messagero reported that Francis had been tested for coronavirus and the result was negative. The article did not specify when he was tested and did not cite a source. As of March 3 the Vatican had not officially confirmed or corroborated the claim of a negative test result.", "Giuffrida, Angela.  \"Italy's Coronavirus Death Toll Rises to 52.\"\r\n    The Guardian.  2 March 2020.", "Making Comments Meaningful (MCM).  \"Vatican Confirms Pope Francis and Two Aides Test Positive for Coronavirus.\"\r\n    February 2020.", "Vatican News.  \"Pope Postpones Official Audiences But Continues Meetings at Santa Marta.\"\r\n    28 February 2020.", "Holy See Press Office.  \"The Pope's Words at the Angelus Prayer, 3 March 2020.\"\r\n    3 March 2020.", "Pullella, Philip.  \"Pope, Blaming a Cold, Skips Lent Retreat for First Time in His Papacy.\"\r\n    Reuters.  1 March 2020.", "Press Association/Yahoo! News.  \"Pope Cancels Visit With Rome Priests Due to 'Slight' Illness.\"\r\n    27 February 2020.", "Giansoldati, Franca.  \"Coronavirus, Tampone Negativo per Papa Francesco: e il Vaticano si Blinda.\"\r\n    Il Messagero.  3 March 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]