["About this rating", "In September 2018, excerpts from an upcoming book on the Trump White House by veteran investigative journalist Bob Woodward portrayed the Trump administration as having a \"nervous breakdown of executive power,\" with senior aides quoted as calling the president an \"idiot\" and a \"liar\" and declaring that they hid policy documents to prevent Trump from signing them.", "President Trump quickly took to Twitter to dismiss the book, Fear: Trump in the White House, as a \"discredited\" work of \"totally [made] up stories\" that was \"full of lies and phony sources\" that constituted a \"con on the public\":", "The Woodward book has already been refuted and discredited by General (Secretary of Defense) James Mattis and General (Chief of Staff) John Kelly. Their quotes were made up frauds, a con on the public. Likewise other stories and quotes. Woodward is a Dem operative? Notice timing?", "— Donald J. Trump (@realDonaldTrump) September 4, 2018", "Isn’t it a shame that someone can write an article or book, totally make up stories and form a picture of a person that is literally the exact opposite of the fact, and get away with it without retribution or cost. Don’t know why Washington politicians don’t change libel laws?", "— Donald J. Trump (@realDonaldTrump) September 5, 2018", "The already discredited Woodward book, so many lies and phony sources, has me calling Jeff Sessions “mentally retarded” and “a dumb southerner.” I said NEITHER, never used those terms on anyone, including Jeff, and being a southerner is a GREAT thing. He made this up to divide!", "— Donald J. Trump (@realDonaldTrump) September 5, 2018", "Woodward, best known for his work with the Washington Post in uncovering elements of the Watergate scandal, simply stated that he stood by his work, which was based on hundreds of hours of interviews with firsthand sources conducted on deep background.", "Given President Trump's subsequent efforts to discredit Woodward and his reporting, some critics found an amusing irony in the release of a recorded phone call between Woodward and Trump that had taken place about a month earlier, in which the president told the reporter that \"I would’ve loved to have spoken to you [for the book] ... I think you’ve always been fair.\"", "Those critics found even more irony in a five-year-old tweet from Trump that referenced a February 2013 Woodward opinion piece which blamed President Obama for a failure to compromise on the federal budget. Woodward's piece prompted \"a shouting match between Woodward and Gene Sperling,\" Obama’s economic adviser, \"followed by an e-mail in which Sperling said that Woodward 'will regret staking out that claim'\" -- words perceived at the time as a veiled threat.", "That political contretemps spurred Trump to tweet that \"only the Obama [White House] can get away with attacking Bob Woodward\":", "Only the Obama WH can get away with attacking Bob Woodward.", "— Donald J. Trump (@realDonaldTrump) March 1, 2013", "It remains to be seen whether those words will hold true, or whether another presidential administration will indeed \"get away with attacking Bob Woodward.\"", "BBC News.   \"Donald Trump Condemns Bob Woodward Book as 'Con.'\"\r\n    5 September 2018", "Rucker, Philip and Robert Costa.   \"Bob Woodward’s New Book Reveals a ‘Nervous Breakdown’ of Trump’s Presidency.\"\r\n    The Washington Post.   4 September 2018.", "Blake, Aaron.   \"Transcript: Phone Call Between President Trump and Journalist Bob Woodward.\"\r\n    The Washington Post.   4 September 2018.", "Heavey, Susan.   \"Journalist Bob Woodward Blasts Obama 'Madness' in Handling Cuts.\"\r\n    Reuters.   27 February 2013.", "Parker, Kathleen.   \"The Obama White House ‘Threat’ to Bob Woodward Matters.\"\r\n    The Washington Post.   1 March 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]