["In the aftermath of the storming of the U.S. Capitol on Jan. 6 by a violent mob of Trump supporters, federal authorities have started to round up and arrest those involved in the insurrection.", "Five people died in the riot, including one police officer, and at least 55 criminal cases tied to the riot have been filed by the Justice Department. That number is expected to grow in the coming weeks.", "Some have speculated that President Donald Trump could use his remaining days in office to pardon the insurrectionists. One Parler account claiming to be the official page of the \"WH Office of Pardon Attorney\" states Trump is \"strongly considering\" it.", "The parley — a post on Parler — which has been shared as a screenshot to Facebook, asks those who are seeking a pardon to send their name, city and list of crimes they committed.", "\"The President needs this list by TUESDAY before the House can vote to impeach again,\" the post reads. It is signed \"Rosalind,\" as in Acting Pardon Attorney Rosalind Sargent-Burns.", "USA TODAY reached out to the Facebook user for comment.", "The post claiming to come from a Justice Department official is fake, and no pardons have been given to those involved in the riot.", "Fact check:Video shows Trump family in tent before Jan. 6 rally", "Justice Department says claims are false", "While Sargent-Burns is a pardon attorney for the Justice Department, the Parler post did not come from her.", "“Please be advised that the information circulating on social media claiming to be from Acting Pardon Attorney Rosalind Sargent-Burns is inauthentic and should not be taken seriously,\" the Justice Department said in a statement Jan. 9.", "The statement added that the Justice Department's Office of the Pardon Attorney is not on social media and it \"is not involved in any efforts to pardon individuals or groups involved with the heinous acts that took place this week in and around the U.S. Capitol.\"", "During his presidency, Trump has announced 94 acts of clemency, USA TODAY reported. Those pardoned include Trump's former campaign chairman Paul Manafort, political ally Roger Stone, and Charles Kushner – the father of Jared Kushner, Trump's son-in-law and senior adviser – who was convicted of preparing false tax returns.", "Fact check: False claim of facial recognition of antifa members during U.S. Capitol riot", "Rioters who breached the U.S. Capitol have been arrested and the Department of Justice announced it was investigating the death of Capitol Police Officer Brian Sicknick as a homicide.", "A West Virginia state lawmaker who livestreamed himself with rioters was charged with entering a restricted area of the U.S. Capitol, the Justice Department said on Jan. 8, according to USA TODAY.", "Richard Barnett of Gravette, Arkansas, who was pictured sitting at House Speaker Nancy Pelosi's desk, has also been arrested and charged, the department said in a statement.", "The U.S. Attorney's Office for the District of Columbia had filed 17 cases in federal court and at least 40 others in the Superior Court by Jan. 9, the Associated Press reported. Cases in Superior Court have to do with curfew violations and gun crimes, while those in federal court involve violent entry, disorderly conduct and assaulting a federal law enforcement officer.", "Fact check:Face-painted Capitol Building trespasser in horns is a known QAnon supporter", "The claim that the \"WH Office of Pardon Attorney'' is assisting President Donald Trump in preparing pardons for the rioters involved with violence at the U.S. Capitol on Jan. 6 is FALSE, based on our research. The Department of Justice confirmed that the post is fake and that the Department's Office of the Pardon Attorney does not have a social media presence.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more."]