["About this rating", "A July 2019 social media meme presented a transcript of a brief excerpt from a radio interview with U.S. Rep. Alexandria Ocasio-Cortez (D-N.Y.) in a way seemingly calculated to make the Congresswoman seem as inarticulate as possible:", "In a literal sense, this meme does reflect the words actually spoken by Ocasio-Cortez during the course of an hour-long interview for the The New Yorker Radio Hour on July 5, 2019. But the meme transcribes those words in a way that makes the speaker seem almost incoherent, through a number of techniques:", "The context of the quoted passage was Ocasio-Cortez's answer, in response to an interview question, about why she had declined an offered seat on the House Select Committee on the Climate Crisis. She said she had wanted the committee to agree to adhere to certain standards (e.g., commit to a mission of drafting climate change legislation by 2020, having subpoena powers, seating only members who did not take fossil fuel money). Because those standards were not met, she explained, she felt the committee was \"compromised\" and therefore was not one she wished to sit on.", "Below we have transcribed the portion of the interview included in the meme, but we have punctuated it to better reflect Ocasio-Cortez's actual speech pattern, and we have added brief bits of contextual references in brackets that would have been understood by persons who had been listening to the full interview up to that point:", "Because given that none of those standards [that I advocated for] were met, sitting on that committee, I would have to own anything — I would [have to] take responsibility for anything that comes out of that committee. And when the actual, in my opinion, structure of [the committee] is compromised in very deep ways, you know it’s not ... I don’t think it was like, \"I’m going to take my ball and go home\" -- it’s, \"We have a select committee whose mission I was uncertain on, [and] whose members take fossil fuel money.\" You know [my decision was] beyond just a mere disagreement [with the committee's mission]. I think there’s a structural problem with [the committee] ...\"", "Remnick, David.   \"Presidential Race and Why We Should Break up Homeland Security.\"\r\n    The New Yorker Radio Hour.   9 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]