["By D'Angelo Gore", "Posted on April 3, 2019", "President Donald Trump got his facts wrong when he said Rep. Jerrold Nadler “thought the concept of giving the Starr report” about President Bill Clinton “was absolutely something you could never do” in 1998.", "Nadler wasn’t against releasing any of the details from the Starr report to either Congress or the public, as Trump claimed. In fact, after completing his four-year investigation of Clinton, including Clinton’s affair with White House intern Monica Lewinsky, independent counsel Kenneth Starr turned over the full 445-page report, along with an additional 2,000-plus pages of supporting materials, directly to the House of Representatives on Sept. 9, 1998. After that, House members debated when and how much of the report should be made public.", "In an interview later that day, Nadler, who was a member of the House Judiciary Committee at the time, did say that much of the report’s supporting documentation, including grand jury testimony, was “material that by law … must be kept secret,” and that the documents included “statements that may or may not be true by various witnesses, salacious material, all kinds of material that it would be unfair to release.”", "However, Nadler also said judiciary committee leaders would have to go through the report and its accompanying documents to determine “what is fit for release and … what must not be released at all.” He also favored Congress giving Clinton the opportunity to see the report and prepare a response before any of it was released to the public.", "Nadler, who is now chairman of the House Judiciary Committee, is currently demanding that Attorney General William Barr provide members of Congress with an unredacted copy of special counsel Robert Mueller’s report on his almost two-year probe into Russian interference in the 2016 election. The committee approved a resolution along party lines authorizing subpoenas to get Mueller’s full report on April 3.", "On March 24, Barr released a four-page memo summarizing the principal conclusions of a confidential report from Mueller on the investigation. Barr has since said he will make a copy of Mueller’s full report, with legally required redactions, available to Congress by “mid-April, if not sooner.”", "Trump made his claim about Nadler during a joint press conference with NATO Secretary General Jens Stoltenberg on April 2. He was responding to a reporter who asked, “What about the fact that Congressman Nadler opposed the release of the Starr report in 1998?”", "“So, Jerry Nadler thought the concept of giving the Starr report was absolutely something you could never do,” Trump went on to say. “But when it comes to the Mueller report, which is different on our side, that would be something that he should get. It’s hypocrisy and it’s a disgrace.”", "Trump made a similar claim about Nadler on Twitter earlier that day. “In 1998, Rep. Jerry Nadler strongly opposed the release of the Starr Report on Bill Clinton. No information whatsoever would or could be legally released,” Trump tweeted.", "In 1998, Rep.Jerry Nadler strongly opposed the release of the Starr Report on Bill Clinton. No information whatsoever would or could be legally released. But with the NO COLLUSION Mueller Report, which the Dems hate, he wants it all. NOTHING WILL EVER SATISFY THEM! @foxandfriends", "— Donald J. Trump (@realDonaldTrump) April 2, 2019", "Trump got his information from the April 2 episode of “Fox & Friends.” The show’s three co-hosts compared Nadler’s current position on the Mueller report with his position on the Starr report in 1998, and showed an edited version of Nadler’s interview on the “Charlie Rose” show the day the report was released.", "The video clip gives the impression that Nadler was against making any of the Starr report public, which wasn’t the case.", "The fuller video and transcript show that Nadler said the report and other documents would have to be reviewed by members of Congress to determine what could be released or not.", "Nadler, Sept. 9, 1998: We did get the report, which is now in the hands of the sergeant at arms under armed guard. It’s 36 boxes. We’re told it’s two copies, so it means 18 boxes per copy. There is, I gather, a 4[00]- or 500-page report and the balance is appendices and supporting materials. Now, Mr. Starr, in his transmitting — transmittal letter to the speaker and the minority leader, made it clear that much of this material is federal rule 6(e) material, that is material that by law — unless contravened by a vote of the House — must be kept secret. It’s grand jury material. It represents statements which may or may not be true by various witnesses, salacious material, all kinds of material that it would be unfair to release. So, I assume what’s going to have to happen before anything else happens is that somebody — the staff of the judiciary committee, perhaps the chairman and ranking minority members of the judiciary committee — is going to have to go over this material, at least the 4[00] or 500 pages of the report, to determine what is fit for release and what is — as a matter of decency, and protecting people’s privacy rights, people who may be totally innocent third parties — what must not be released at all.", "That suggests that Nadler was open to making public at least some of the report that had already been given to Congress.", "Now, it’s true that Nadler voted against a resolution proposed by House Republicans that, in part, authorized the immediate release of Starr’s 445-page report to the public. The other 2,600 pages of supporting materials were to be reviewed and released by Sept. 28, 1998 under the resolution.", "However, Nadler said he opposed it because he believed Clinton, as his lawyer requested, should have been given time to review Starr’s report and prepare a response before any of it was released publicly. (Neither Clinton, members of Congress, nor their staffs were allowed to read the report before the vote to make it public took place.)", "“What is at issue here this morning is not his [Clinton’s] conduct but the fairness of the resolution before us, which is manifestly and grossly unfair,” Nadler said in remarks from the House floor on the day of the vote. “It is manifestly unfair because it denies the president the privilege we have given to every other person accused, as the gentleman from Michigan stated, the ability to see the accusation before it is released publicly so he can prepare a response.”", "The resolution passed Sept. 11, 1998, in a 363-63 vote, and the Starr report was published on a House website hours later. (The Clinton White House ended up posting a response the same day, anyway.)", "This week, in an April 2 interview on CNN’s “The Situation Room,” the show’s host, Wolf Blitzer, played for Nadler Trump’s remarks from the joint press conference and reminded Nadler of what he himself said in the Charlie Rose interview.", "When Blitzer asked Nadler if he was treating the Mueller report differently than the Starr report, Nadler said he wasn’t.", "Blitzer, April 2: Are you holding President Trump to a different standard?", "Nadler: Not at all. The president, as you can see, is a bully. The Mueller investigation looked into very serious allegations and very serious matters that we have a responsibility as the oversight body to look into. And we are asking that the entire Mueller report and all the underlying documentations be given to Congress so we can examine it and fulfill our responsibility of looking in — of protecting the rule of law and looking into questions of obstruction of justice and personal enrichment and abuses of power.", "The president apparently forgets that Ken Starr’s report, all 400 and some odd pages of it, was — had already been given to the entire Congress, which is what we’re asking now, and the Congress already had it. The question was, should that report, with all the salacious personal sexual material in it, be given to the public after Congress already had it?", "Blitzer: Because this is what you said back in 1998. We went back and checked. ‘It’s grand jury material’ — you’re referring to the Starr report — ‘it represents statements which may or may not be true by various witnesses, salacious material, all kinds of material that it would be unfair to release.’ That’s what you said then. And I just want to give you a chance to explain what you’re saying now.", "Nadler: Well, then, remember, Congress already had that material and Congress could evaluate it. We were talking about giving out that private material to the public. Here, we are asking for Congress to get the material so that we can have it. And we can make judgments as to what privacy has to be protected and what can be given out. But, again, Congress already had that material. We’re talking about Congress getting the material now. It’s two completely separate questions.", "Trump was wrong when he said Nadler “thought the concept of giving the Starr report was absolutely something you could never do,” and that “no information whatsoever would or could be legally released.”", "As Nadler points out, Congress was given the full Starr report and all its supporting materials in 1998. On the other hand, Congress has not received the full Mueller report and its supporting materials, and Barr is not proposing to do so.", "Nadler did say that not all of the Starr report could be released to the public in 1998, but he also acknowledged that probably won’t happen with the Mueller report, either.", "In an April 2 statement, Nadler said: “Congress urgently needs his [Mueller’s] full, unredacted report and its underlying evidence in order to fulfill its constitutional role, including its legislative, appropriations, and oversight responsibilities. Congress can and has historically been provided with sensitive, unredacted, and classified material that cannot be provided to the general public. In addition, the American people deserve to be fully informed about these issues of extraordinary public interest, and therefore need to see the report and findings in Special Counsel Mueller’s own words to the fullest extent possible.”", "The House already passed a resolution, 420-0, that calls for the “full release” of the report and its findings to Congress. It also “calls for the public release of any report, including findings, Special Counsel Mueller provides to the Attorney General, except to the extent the public disclosure of any portion thereof is expressly prohibited by law.”", "Nadler was one of the “yea” votes.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]