["The photos were published on Facebook here on October 28, 2020. The post has been shared more than 3,500 times.", "Translated to English, the post’s Thai-language caption reads: “As per the appointment, Molave. The photo was taken in Srisaket”.", "The post circulated as Typhoon Molave slammed parts of Southeast Asia, as AFP reported here and here.", "The photos were shared alongside a similar claim here, here and here on Facebook.", "The claim, however, is false.", "A reverse image search found that the same set of photos were published on Twitter here by Thai TV Channel 8 News on October 27, 2016.", "มันคือเมฆฝนใช่หรือไม่? หรือว่าจะเกิดอะไรขึ้นกับท้องฟ้า โดยผู้โพสต์ระบุว่าถ่ายแถว ปั้ม ปตท.บ้านเพียนาม จ.ศรีสะเกษ\n\t\tcr.จริยา อินทนู pic.twitter.com/fU9lqwGogN", "The tweet reads in English: “Is this a rain cloud? Or something is happening in the sky? The post user indicated that it was at the PTT petrol station, Ban Pia Nam, Srisaket. Credit: Jariya Inthanu”", "Below is the screenshot of the photos in the misleading post (L) and the photos from Channel 8 News (R):", "The Channel 8 News report credits the photos to the Facebook account of Jariya Inthanu.", "“These are old photos. At that time, it looked like it was going to rain. The sky looked very strange so I took photos of it,” Jariya confirmed to AFP via Facebook Messenger on October 30. 2020.", "The exact location of the photographs can be seen on Google Maps here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]