["“Shivu Uppar, a 19Yr old boy was murdered &hanged in Bagewadi Bus stand in Belagavi. He was hacked to death just for protecting cows from the cow smugglers, that was the only mistake he did. I demand CM to deal this sternly & arrest the culprits.”", "The above message has been tweeted by BJP MP from Karnataka, Shobha Karandlaje, along with disturbing images of a young boy hanging from his neck.", "Karandlaje’s tweet has been retweeted over 2000 times since it was posted on May 26. It has now been deleted. Several individual users have shared this message on Twitter, that Shivu Uppar was hacked to death because he was protecting cows from cow smugglers, in effect giving a communal turn to the incident. The tweet below, posted by a user has been retweeted over 2000 times so far.", "19 year old young Gau Rakshak Shivu Uppar ( Karnataka)was hacked to death and hanged in bhagewadi bus stand his only crime was to prevent cattle robbery by cattle smugglers we will not sit quite until action will be not taken..@Tejasvi_Surya pic.twitter.com/GH2YUAjrnV", "— Meera Singh (@meeraremi11) May 26, 2019", "The message has also been shared on Facebook by a page Justice For Hindus. The fake news website Dainik Bharat has also published an article stating that Uppar was killed by cow smugglers.", "The claim that 19 year old Shivu Uppar was murdered by cow smugglers is false. This has been confirmed by Commissioner of Police, Belgaum. In a conversation with Alt News, B S Lokesh Kumar, Commissioner of Police, Belagavi (Belgaum) said, “It is a case of suicide. We have received the post mortem report. It clearly says ‘suicide by hanging”. Moreover there are no injury marks on the body of the deceased, according to the report“. He added, “The deceased had a quarrel with his family. The family members have given a complaint saying the boy committed suicide. Unnecessarily, people are spreading false news for which SP Belgavi has taken action.”", "Alt News also spoke to Sudheer Kumar Reddy, SP Belgaum, who confirmed that two persons have been arrested on the charge of spreading fake news that the youth was killed by cow smugglers. The same has been reported by News18.", "19 year old Shivu Uppar, according to the post-mortem report, had committed suicide. The BJP MP from Karnataka had earlier indulged in misinformation when the death of a youngster in December 2017 had been falsely portrayed as ‘murder by jihadi elements’.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]