["Prime Minister Narendra Modi is on a seven-day visit to the United States where he will be participating in two round tables with CEOs of American companies. On Septemeber 20, Tulsi Gabbard, a member of the Democratic Party of the United States, extended a warm welcome to PM Modi on his visit to the country.", "“Indian-origin presidential candidate Tulsi Gabbard welcomes Narendra Modi on a visit to the US, apologises for not being able to join ‘Howdy Modi’ event”, read the headline of an article published by Firstpost which credited the story to news agency Asian News International (ANI).", "Several other media outlets including NDTV, The Statesman, The Fress Press Journal, and Moneycontrol have also published articles where it is being claimed that Gabbard is the first Indian-origin woman candidate for the US presidential elections. NDTV and The Fress Press Journal have credited their stories to ANI.", "In the past as well, mainstream media outlets such as Republic TV, Zee Business and India Today have reported Gabbard as a woman of Indian-origin.", "Alt News found that the 37-year-old Congresswoman Tulsi Gabbard is not of Indian-origin. She has herself publically clarified the same on Twitter in October 2012. It was also reiterated by her in 2014.", "@ronejoq @amisri I am not of Indian origin.", "— Tulsi Gabbard (@TulsiGabbard) October 17, 2012", "Moreover, according to an explainer published by The Indian Express, Gabbard was born into a family of American Samoan ancestry, which is native to the US State of Hawaii. “Her father was a Catholic and her mother a convert to Hinduism. Gabbard herself became a Hindu when she was a teenager.”", "In conclusion, many mainstream outlets led by ANI misreported that democratic presidential candidate representative Tulsi Gabbard is a woman of India-origin while she has herself publically denied to have Indian ancestry. While ANI later has updated it article (sans clarification), other media outlets that published syndicated ANI feed are yet to do the same.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]