["Many words and phrases are known to have different meanings in other languages, and much of the English vocabulary is derived from Latin roots.", "Some social media users are claiming that the word \"homework\" spelled backward has a meaning in the Latin language.", "A  Feb. 27 Instagram post with almost 18,000 likes features a screenshot of the Google search, \"what is homework backwards.\" The result purportedly reads, \"So basically 'Homework' spelled backwards is 'krowemoh' which in Latin translates to child abuse.\"", "The same screenshot included in the Instagram meme also appears in several viral TikToks, and the hashtag #Krowemoh has more than 246,000 views on the platform.", "The Google search screenshot that users have used to make the claim is taken from a March 7, 2013, viral post that has recently resurfaced on Twitter, where many users have shared similar versions of the claim.", "\"I knew that this homework was just a way to abuse children,\" one Twitter user wrote along with the claim on Jan. 24.", "USA TODAY reached out to the Instagram user for comment.", "Fact check:Altered image shows rhino horns, elephant tusks dyed pink to deter poaching", "The word \"krowemoh\" does not exist in Latin. According to Google translate, child abuse in Latin is actually \"puer abusus.\"", "A search of \"krowemoh\" on onlineLatin-to-English dictionaries results in no matches.", "The classical Latin alphabet consists of 23 characters, and the letter W is not one of them. In Latin, the letter U represented a W sound which could only occur only before a vowel, according to Dictionary.com.", "European languages that use the Latin alphabet do not use the letters K and W, and they add letters with diacritical marks or pairs of letters that read as one sound, according to Britannica.", "Get these in your inbox: We're fact-checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "The claim that \"krowemoh\" translates to \"child abuse\" in Latin was added in January to Urbandictionary.com, a crowdsourced online dictionary of slang words and phrases.", "The Urban Dictionary definition of \"krowemoh\" makes a joke of the word and children having loads of homework assignments.", "Fact check: Israel launching 'Green Pass' for COVID-19 vaccinated", "The claim that \"homework\" spelled backward translates to \"child abuse\" in Latin is FALSE, based on our research. \"Krowemoh\" does not exist in the Latin language and the letter W is not part of the Latin alphabet.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]