["About this rating", "In February 2021, a supposed screenshot of a tweet sent by New York mayoral candidate Andrew Yang in which he argued that New York should just be called York because there isn't an 'Old York' started to circulate on social media:", "A spokesperson for Yang confirmed to us that the \"'Old York' tweet is a fake tweet.\"", "This tweet does not currently appear on Yang's timeline. Although some doubters claimed that Yang may have deleted this message, that did not appear to be the case, as we have not been able to find any of the supposed 653 retweets, archived links, or any other contemporaneous messages commenting on his supposed tweet.", "What we did find, however, was a somewhat similar message from Yang that inspired some online ridicule and a few jokes about renaming New York. On Feb. 1, 2021, Yang suggested on Twitter that New York City's flag, which borrows its colors from the Dutch flag, should be redesigned:", "This was the first tweet in a four-tweet thread in which Yang discussed the color schemes used by the New York Mets and Knicks professional sports teams, called on his fans to submit new flag designs, and informed his followers that the Dutch are not the first people he thinks of when he thinks of New York:", "The last comment inspired some social media users to mock Yang for not knowing his New York history. The city, after all, was founded by colonists from the Dutch Republic in 1624. As social media users piled on Yang's remarks, the fake tweet stating that New York should be renamed York because Old York doesn't exist started to circulate on social media.", "The earliest version of this fake tweet that we could find was shared by Twitter user @torriangray on Feb. 2, the day after Yang made his genuine comments about New York's flag. When the fake tweet went viral a few days later, @torriangray appeared to admit that the fake tweet was created as a joke:", "·", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]