["About this rating", "On July 4, 2020, rapper and entrepreneur Kanye West announced that he was running for president in 2020. The news came as a bit of a shock to some, since the controversial rapper and entrepreneur has little political experience, and his announcement came after many of the presidential filing deadlines had expired. But even more surprising was the fact that West seemingly secured big money backer Elon Musk within hours of his announcement:", "A few days later, an image started circulating on social media that supposedly showed a follow-up tweet sent by Musk in response to a news article about West's 2020 platform. The news article, a rehash of an interview West gave to Forbes, stated in its headline that West would be running on an anti-abortion and anti-vaccination platform in 2020, which prompted Musk to write: \"We May Have More Differences of Opinion Than I Anticipated.\"", "These are both genuine tweets sent from Elon Musk's account.", "Many social media users were skeptical of the authenticity of the second tweet — \"We May Have More Differences of Opinion Than I Anticipated.\" — as it can no longer be found on Musk's timeline. Some surmised that this was because the tweet was doctored, or sent from an impostor account, but it looks like Musk simply deleted this message shortly after it was posted. An archived version of Musk's tweet can be found here.", "The archived version reveals that Musk posted this tweet below a message sent by Twitter user John Crowley, which included a link to the aforementioned news article, and the message: \"Cmon Elon - you're way to intelligent for this BS.\"", "Lane, Randall.   \"Kanye West Says He’s Done With Trump—Opens Up About White House Bid, Damaging Biden And Everything In Between.\"\r\n    Forbes.   8 July 2020.", "BreakingNews.ie.   \"Kanye West Says He is Anti-Abortion and anti-Vaccination in Presidential Bid.\"\r\n    7 July 2020.", "Young, Alex.   \"Elon Musk is Already Reconsidering His Endorsement of Kanye West.\"\r\n    Consequence of Sound.   9 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]