["The claim was published here on Facebook on July 20, 2020. It has been shared more than 150 times.", "A purported screenshot included in the Facebook post reads: “TOP Medical Officials and Organizations Issue Warning Against Wearing a Mask (Video) /  The CDC, World Health Organization and The New England Journal of Medicine now Admit that wearing a mask can lead to severe health issues.”", "The New England Journal of Medicine (NEJM) is a peer-reviewed US medical journal.", "The purported screenshot also includes a web link, which leads to this July 13, 2020 video published on the video hosting site BitChute.", "The video, titled “TOP 'MEDICAL OFFICIALS' ISSUE WARNING AGAINST WEARING A MASK”, features US-based physician Dr. Kelly Victory. Many of the claims she makes in the video were debunked by US-based fact check site Lead Stories here on July 13, 2020.", "The Facebook post’s caption states: “Who’s going to have the balls to sue the Victorian Governerment for attempting murder on its own population?”", "This refers to the decision by the government in the Australian state of Victoria to mandate the wearing of face masks in public in an attempt to curb the spread of COVID-19, as reported by AFP here.", "A similar claim was also shared here on Facebook, here on Instagram, as well as here and here on other websites.", "The claim, however, is false.", "As of July 2020, the WHO and CDC both advocate wearing face masks during the COVID-19 pandemic in order to protect both the mask wearers and those around them.", "In response to the misleading claim, a statement from a WHO spokesperson dated July 30 states: “The claim is untrue. The basic measures needed to suppress transmission and save lives remain the same. Find, isolate, test and care for cases; and trace and quarantine their contacts. Keep your distance from others, clean your hands, avoid crowded and enclosed areas, and wear a mask where recommended.”", "Before June 2020, the WHO and the CDC said it was only necessary for people infected with COVID-19 and those caring for them to wear masks. Neither authority, however, has ever warned against the use of face masks.", "Face masks could be problematic for children under the age of two to wear, the CDC states here. They could also present difficulties for people who have trouble breathing or who are unconscious, incapacitated or unable to remove the mask without assistance, it states.", "The WHO said here that people should not wear masks while exercising as sweat may make the mask too wet, promoting the growth of microorganisms.", "In response to the misleading posts, a NEJM spokesperson said this April 1 NEJM article titled “Universal Masking in Hospitals in the Covid-19 Era” may have been misinterpreted by some members of the public.", "The essay discusses the use of face masks among medical personnel and members of the public, adding that “universal masking alone is not a panacea. A mask will not protect providers caring for a patient with active Covid-19 if it’s not accompanied by meticulous hand hygiene, eye protection, gloves, and a gown. A mask alone will not prevent health care workers with early Covid-19 from contaminating their hands and spreading the virus to patients and colleagues. Focusing on universal masking alone may, paradoxically, lead to more transmission of Covid-19 if it diverts attention from implementing more fundamental infection-control measures.”", "The NEJM spokesperson told AFP in a July 31 email: “Since then, the authors have published a follow up letter in NEJM. In this June 3 letter, they write that ‘the intent of our article was to push for more masking, not less,’ and that ‘universal masking helps to prevent such people from spreading virus-laden secretions, whether they recognize that they are infected or not,’ and conclude that they ‘strongly support the calls of public health agencies for all people to wear masks when circumstances compel them to be within 6 ft of others for sustained periods’.”", "AFP previously debunked misleading claims linking face masks to various alleged health issues here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]