["About this rating", "During a February 2018 interview with Al Jazeera English, Omar said \"Our country should be more fearful of white men\" as part of a broader statement about U.S. domestic terrorism.", "Omar was not suggesting the wholesale fear of white men as a group. Instead, she was making the point that the Muslim community is targeted by anti-terror policies even though white, right-wing extremist men have committed the vast majority of acts of deadly domestic terrorism in recent years.", "An edited video of comments made by U.S. Rep. Ilhan Omar, D-Minn., spread across the right-leaning media ecosystem in late July 2019 and made it appear Omar, one of the first two Muslim women elected to serve in Congress, called for wholesale fear and surveillance of white men.", "Omar's comment was both edited and taken out of context. In a February 2018 interview with Al Jazeera English, Omar said right-wing extremists have been responsible for most of the deadly domestic terrorism in the U.S. in recent years, but nevertheless most of the focus of policies and law enforcement is directed at the Muslim community.", "Editing out key phrases from her statement gave the false impression that Omar said white men as a whole should be feared and monitored.", "The edited video clip follows a recent pattern of either taking snippets out of previous interviews given by Omar and presenting them anew with inflammatory framing, or simply inventing incendiary comments and attributing them to her. In this case, the original interview took place on the Al Jazeera English news talk show \"UpFront,\" hosted by journalist Mehdi Hasan.\nIn the interview, Hasan asked Omar about her views on being an immigrant from Somalia serving in Congress at the same time President Donald Trump is in office. Hasan also asked about Trump's travel ban targeting mostly Muslim-majority countries, which Omar called ineffective from a national security standpoint and a \"political football\" playing to Trump's base.\nThey then talked about racism and the rise in hate crimes, specifically those targeting Muslim people, in the U.S. On this topic, Hasan asked, \"A lot of conservatives in particular would say that the rise in Islamophobia is the result not of hate, but of fear. And legitimate fear, they say, of quote-unquote 'jihadist terrorism' — whether it’s Fort Hood, or San Bernardino, or the recent truck attack in New York. What do you say to them?\"\nOmar replied, \"I would say our country should be more fearful of white men across our country, because they are actually causing most of the deaths within this country. And so if fear was the driving force of policies to keep America safe, Americans safe inside of this country, we should be profiling, monitoring, and creating policies to fight the radicalization of white men.\"\nThe phrase \"if fear was the driving force of policies to keep America safe, Americans safe inside of this country,\" which was removed from the edited video, is key because it makes clear her comment is rhetorical and not an assertion that white man as a general group should be the targets of fear and monitoring.\nThe full interview can be viewed below:\n\nThe edited video resurfaced on July 24, 2019, when a writer for the right-leaning Daily Caller News Foundation posted a clip of the interview from the Christian Broadcasting Network (CBN), to her Twitter page. That tweet was then picked up and given legs by U.S. Sen. Marco Rubio, R-Florida, who retweeted with the comment, \"I am sure the media will now hound every Democrat to denounce this statement as racist. Right?\"\n\nI am sure the media will now hound every Democrat to denounce this statement as racist. Right? https://t.co/UewkblF8Oo\n— Marco Rubio (@marcorubio) July 25, 2019\n\nWe sent questions to Rubio's office about the tweet and received no response. The tweet remained live even as Hasan called on Rubio to delete it for being misleading.\n\nSenator @marcorubio will you delete this tweet and apologize? You’re sharing a selectively-edited video from my show @AJUpFront to make @IlhanMN look bad and increase the number of death threats she already gets. Shame on you. Here’s the un-edited clip:https://t.co/1xX5KMns8N https://t.co/9lOAr67iCX\n— Mehdi Hasan (@mehdirhasan) July 25, 2019\n\nAccording to research from the Anti-Defamation League, \"The extremist-related murders in 2018 were overwhelmingly linked to right-wing extremists. Every one of the perpetrators had ties to at least one right-wing extremist movement, although one had recently switched to supporting Islamist extremism. White supremacists were responsible for the great majority of the killings, which is typically the case.\"\nIn summary, Omar's comment about fearing white men was manipulated and taken out of context, therefore we rate this claim \"mixed.\"", "The edited video clip follows a recent pattern of either taking snippets out of previous interviews given by Omar and presenting them anew with inflammatory framing, or simply inventing incendiary comments and attributing them to her. In this case, the original interview took place on the Al Jazeera English news talk show \"UpFront,\" hosted by journalist Mehdi Hasan.", "In the interview, Hasan asked Omar about her views on being an immigrant from Somalia serving in Congress at the same time President Donald Trump is in office. Hasan also asked about Trump's travel ban targeting mostly Muslim-majority countries, which Omar called ineffective from a national security standpoint and a \"political football\" playing to Trump's base.", "They then talked about racism and the rise in hate crimes, specifically those targeting Muslim people, in the U.S. On this topic, Hasan asked, \"A lot of conservatives in particular would say that the rise in Islamophobia is the result not of hate, but of fear. And legitimate fear, they say, of quote-unquote 'jihadist terrorism' — whether it’s Fort Hood, or San Bernardino, or the recent truck attack in New York. What do you say to them?\"", "Omar replied, \"I would say our country should be more fearful of white men across our country, because they are actually causing most of the deaths within this country. And so if fear was the driving force of policies to keep America safe, Americans safe inside of this country, we should be profiling, monitoring, and creating policies to fight the radicalization of white men.\"", "The phrase \"if fear was the driving force of policies to keep America safe, Americans safe inside of this country,\" which was removed from the edited video, is key because it makes clear her comment is rhetorical and not an assertion that white man as a general group should be the targets of fear and monitoring.", "The full interview can be viewed below:", "The edited video resurfaced on July 24, 2019, when a writer for the right-leaning Daily Caller News Foundation posted a clip of the interview from the Christian Broadcasting Network (CBN), to her Twitter page. That tweet was then picked up and given legs by U.S. Sen. Marco Rubio, R-Florida, who retweeted with the comment, \"I am sure the media will now hound every Democrat to denounce this statement as racist. Right?\"", "I am sure the media will now hound every Democrat to denounce this statement as racist. Right? https://t.co/UewkblF8Oo", "— Marco Rubio (@marcorubio) July 25, 2019", "We sent questions to Rubio's office about the tweet and received no response. The tweet remained live even as Hasan called on Rubio to delete it for being misleading.", "Senator @marcorubio will you delete this tweet and apologize? You’re sharing a selectively-edited video from my show @AJUpFront to make @IlhanMN look bad and increase the number of death threats she already gets. Shame on you. Here’s the un-edited clip:https://t.co/1xX5KMns8N https://t.co/9lOAr67iCX", "— Mehdi Hasan (@mehdirhasan) July 25, 2019", "According to research from the Anti-Defamation League, \"The extremist-related murders in 2018 were overwhelmingly linked to right-wing extremists. Every one of the perpetrators had ties to at least one right-wing extremist movement, although one had recently switched to supporting Islamist extremism. White supremacists were responsible for the great majority of the killings, which is typically the case.\"", "In summary, Omar's comment about fearing white men was manipulated and taken out of context, therefore we rate this claim \"mixed.\"", "Hasan, Mehdi. \"Ilhan Omar: No Debate on 'Whether Trump Is a Racist.'\"\r\n  Al Jazeera English. 10 February 2018.", "Anti-Defamation League. \"Murder and Extremism in the United States in 2018.\"\r\n  January 2019.", "Beauchamp, Zack. \"How Marco Rubio Ended Up Broadcasting a Lie About Ilhan Omar.\"\r\n  Vox. 25 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]