["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump returned to a topic he’s been citing often in recent months -- rising crime.", "\"We have a very divided nation,\" he said. \"You look at Charlotte. You look at Baltimore. You look at the violence that's taking place in the inner cities. Chicago. You take a look at Washington, D.C. We have an increase in murder within our cities, the biggest in 45 years.\"", "Trump is largely on target that \"we have an increase in murder within our cities, the biggest in 45 years.\"", "His staff didn’t respond to an inquiry, but Trump seems to be referring to a set of annual statistics released by the FBI. The most recent report came out in September.", "Those statistics showed that the number of murders and non-negligent homicides rose nationally between 2014 and 2015 by 10.8 percent. When we checked the numbers, we confirmed that this increase does rank as the biggest year-to-year jump in murders since 1970-71, when the number rose by 11.1 percent. That was exactly 45 years ago.", "In fact, Trump’s debate comment was stated more accurately than what one of his key surrogates -- former New York City Mayor Rudy Giuliani -- said earlier in the day on Meet the Press. Giuliani stated that \"last year, crime went up more than in the last 41 years.\"", "Not only did Giuliani get the number of years wrong, but he also referred to \"crime\" generally, not to murders specifically. And that makes a difference. Violent crime did go up between 2014 and 2015, but by a significantly smaller percentage than murders did -- 3.9 percent. That rate of increase was smaller than several year-to-year increases since 1971, most recently an increase between 1989 and 1990 of 10.6 percent. In addition, between 2014 and 2015, property crime actually dropped by 2.6 percent.", "So Trump has a fair point. Still, we’ll note two caveats.", "First, his terminology was imperfect. The 10.8 percent increase represents an overall national figure -- not the figure for murders \"within our cities,\" as Trump phrased it. That said, murder rates within cities tend to be higher than for the country at large, as this chart shows. (The red line is the rate for cities over 250,000 population, while the blue line is the rate for the country as a whole.) So this flaw in Trump’s phrasing doesn’t strike us as especially problematic.", "A bigger problem for Trump is that he leaves out some important context -- that, as we have noted previously, crime rates were heading downward for a quarter-century before the most recent uptick, and that the recent increase is nowhere near big enough to erase those gains.", "Sticking to murder statistics for the moment, the following chart shows a zig-zagging rise in murders between 1970 and the early 1990s, followed by a fairly steady decline since then. To be precise, the number of murders declined by 42 percent between 1993 and 2014, even as the U.S. population rose by 25 percent over the same period.", "The same 25-year decline also shows up in the statistics for violent crimes more generally …", "… and for property crimes, too.", "After the newest FBI statistics came out, we asked several criminologists how much concern they place in the recent murder spike. They said it was definitely worth noting -- but that it also needs to be understood within a broader context.", "\"Violent crime rates are up compared with historic lows, and they are still very, very low compared with just five or 10 years ago,\" said Raymond Paternoster, a University of Maryland criminologist.", "Alan Lizotte, a University at Albany criminologist, agreed. \"A small increase between two time points is not an increase when the 20 year trend is downward,\" he said. \"If it went on for several years, it might indicate an increase.\"", "And James Alan Fox, a Northeastern University criminologist said that while \"crime rose, it is far from certain that it will continue. Such a large jump in homicide, the most volatile of crime figures, can easily be followed by a turn in the other direction. One year does not make a trend.\"", "For a past example, look no further than an October 2006 report by the Police Executive Research Forum that cited an upward spike around 2005 that’s visible in our graphs above. The group warned of \"a gathering storm of violent crime that threatens to erode the considerable crime reductions of the past.\"", "But starting in 2006, crime began falling again, and it stayed that way for most of the next decade.", "As Jeffrey Butts of the John Jay College of Criminal Justice recently told the Guardian, \"You lost 50 pounds. You gained back a couple. You’re not fat. That doesn’t mean you shouldn’t look at your behavior, because the trend is not good.\"", "Our ruling", "Trump said, \"We have an increase in murder within our cities, the biggest in 45 years.\"", "The number of murders nationally did rise by the biggest amount in 45 years, and criminologists agree that this is a development worth paying attention to. But they add that it comes after a steep, quarter-century decline, which suggests that it is not yet a cause for panic.", "The statement is accurate but needs clarification and additional information. We rate it Mostly True.", "Donald Trump, remarks at the second presidential debate, Oct. 9, 2016", "FBI, \"Table 1: Crime in the United States by Volume and Rate per 100,000 Inhabitants, 1996–2015,\" September 2016", "NBC, Meet the Press transcript, Oct. 9, 2016", "The Guardian, \"Murders up 10.8% in biggest percentage increase since 1971, FBI data shows,\" Sept. 26, 2016", "PolitiFact, \"Donald Trump is wrong that 'inner-city crime is reaching record levels,' \" Aug. 30, 2016", "Email interview with Alan Lizotte, University at Albany criminologist, Sept. 26, 2016", "Email interview with James Alan Fox, Northeastern University criminologist, Sept. 26, 2016", "Email interview with Raymond Paternoster, University of Maryland criminologist, Sept. 26, 2016", "Email interview with Thomas Abt, Harvard University’s Kennedy School of Government, Sept. 26, 2016", "Email interview with Richard Rosenfeld, criminologist at the University of Missouri-St. Louis, Sept. 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]