["A claim viral on social media suggests that the Congress has announced the names of 230 candidates for the 2019 Lok Sabha elections, while the SP and the BSP have declared the names of 37 candidates each. It further claimed that the RJD candidate list includes 20 leaders and the TMC has decided to contest 42 seats.", "“भाजपा को छोड़ कर कोई भी पार्टी पूर्ण बहुमत के लिए लड़ ही नही रही। (No party other than the BJP is fighting for a complete majority),” the claim asserts. A party needs 272 seats in the Lok Sabha to form a government. If a single party fails to achieve a complete majority on its own, a coalition government can be formed to bring the number up to 272.", "Facebook user Rajesh Jindal was among those who shared the message.", "Jindal is the same person who was behind the fake news website hindutva.info. He was also found buying and selling inauthentic facebook pages through a closed group on the social networking platform.", "A Facebook page We Support Amit Shah shared an infographic asserting the identical claim that out of all party only the BJP is contesting the Lok Sabha polls for a majority. The infographic carried the emblem of fake news website Postcard news.", "Posted by We Support Amit Shah on Wednesday, 17 April 2019", "The claim has been circulated on Twitter as well.", "Several social media users have also messaged Alt News inquiring about the same.", "The candidate list of most parties is available on their websites. The BJP has so far released 19 lists that provide the names of 400+ candidates. The Lok Sabha has a total of 543 (+2 nominated) seats.", "Contrastingly, the Congress has declared the names of 379 candidates; and not 230, as claimed in the viral message.", "Furthermore, while the BSP will contest 38 seats, the SP will field 37 candidates in Uttar Pradesh.", "The Trinamool Congress has provided the names of 42 candidates who will contest from varied constituencies in West Bengal. The RJD will contest from 20 seats in Bihar.", "The TMC and the BSP are recognised as ‘national parties’ while the SP and the RJD are regional parties. All the four, however, have a regionally-concentrated presence and are mostly contesting from their own states. Due to this limited potentiality, these parties have a low candidate count.", "The Congress and the BJP have fielded candidates from different states as they are both strong national parties. That the Congress has announced the names of only 230 candidates is completely false. The party has, in fact, fielded 379 candidates so far, surpassing the 272 majority mark.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]