["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "A few days before the 2020 U.S. general election, the famed Madame Tussauds wax museum in Berlin allegedly displayed a wax figure of U.S. President Donald Trump in a dumpster with a sign that read, “Dump Trump.”", "This claim is true. But although Madame Tussauds in Berlin placed the Trump wax figure in a dumpster as part of its exhibit revamp in advance of the election, the figure was not \"thrown away\" in the trash, as some news publications made it seem.", "The museum posted a photo of the revamped display on its Instagram account on Oct. 30, 2020, with a caption that read (translated from the German), “the US elections are imminent and we are making room for the next president.\"", "Reuters was the first to report on the exhibit and speculated that the move was “apparently intended to reflect its expectations” of the Nov. 3 election.", "“Today’s activity is rather of a symbolic character ahead of the elections in the United States,” Madame Tussauds' marketing manager Orkide Yalcindag told Reuters. “We here at Madame Tussauds Berlin removed Donald Trump’s waxwork as a preparatory measure.”", "Snopes contacted the museum, but did not hear back at the time of publication. If we do, we will update this article accordingly.", "Signs placed within the dumpster alluded to some of Trump’s more well-known sayings, including his repeated and public jabs at media organizations using the phrase “fake news,” and his \"The Apprentice\" TV show slogan, “You’re fired!”", "It’s not the first time the museum updated the Trump exhibit to reflect current events.", "On Oct. 6, the Trump figurine was placed behind “quarantine” barriers marked with hazard sides reminding visitors to keep their distance, with the (translated) caption, “the safety of our visitors is taken care of.” (Other political pokes made on the Instagram account can be seen here and here.)", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]