["A photograph of Rashtriya Swayamsevak Sangh (RSS) workers carrying sacks on their backs is circulating online. It is being claimed that they are carrying out relief work after the Uttarakhand glacier break. Facebook page ‘Rss’ shared the picture and wrote, “RSS men have doing relief work for three days so that no one dies of hunger or disease”. The post drew 1200 shares as of this writing (Archive link).", "चमोली… तपोवन !! लगभग 13 गांवो के तो अवशेष ही बचे हैं… सैकड़ों स्त्री-पुरुष-बच्चे खुले में पड़े हैं… दिन जैसे तैसे कट…", "Posted by Rss on Wednesday, 10 February 2021", "BJP national spokesperson RP Singh also tweeted this picture with the same claim. (Archive link)", "चमोली तपोवन के लगभग 13 गांवो के तो अवशेष ही बचे है पुल बह चुका है सड़कों का नामोनिशां नहीं ऐसे में खाद्यों से भरी बोरियां कंधे पर उठाए @RSSorg के स्वयंसेवको ने मोर्चा संभाल रक्खा है ताकि कोई भूखा न सोये न ही कोई बीमारी से मरे। #UttarakhandGlacierBurst pic.twitter.com/Pnh4162l64", "— R.P. Singh: ਆਰ ਪੀ ਸਿੰਘ National Spokesperson BJP (@rpsinghkhalsa) February 11, 2021", "BJP leader and actor Paresh Rawal shared the photo too. (Archive link)", "Any calamity Anywhere In India . #RSS is the first one to reach there and Last one to leave . Always.Respect. https://t.co/52sY4hS3fO", "— Paresh Rawal (@SirPareshRawal) February 11, 2021", "The image is widespread on Facebook and Twitter. Alt News has also received verification requests on its official mobile application.", "This slideshow requires JavaScript.", "A simple Google reverse image search led us to the photograph uploaded on July 1, 2013, on Samvada. The article is about the RSS running a relief camp after heavy rains in Uttarakhand eight years ago. It says that 15 relief camps and about 5000 volunteers were working in the flood-affected areas.", "We also found this picture in a blog post dated July 1, 2013.", "According to a June 9, 2013 article published on the website of the Hindutva organisation, the RSS and VHP along with the army participated in rescue work in Uttarakhand. The Hindu also reported about this on June 26, 2013.", "RSS worker Rajesh Padmar tweeted a press release dated June 20, 2013, which said that volunteers delivered essential food items to the flood-affected areas in Uttarakhand during the floods.", "RSS Press Release (in Hindi) from Ground Zero: Uttarakhand Calamity Relief Committee. pic.twitter.com/QFohtV84a9", "— Rajesh Padmar (@rajeshpadmar) June 20, 2013", "An eight-year-old picture was therefore shared with the false claim that it shows RSS carrying out relief work recently in Uttarakhand.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]