["The video was published on September 14, 2020, here on Facebook, where it has been viewed more than 12,000 times.", "The four-minute 49-second video shows the view from the window of a train departing a station. A speedometer and a map of the track can be seen on the left-hand side of the video. A timer can be seen on the right-hand side of the video. On the top left-hand corner of the video, there is a watermark which reads “Fermata Studio”.", "Its caption, written in a mixture of English and Malaysian, reads: “Phew 4.800km/h. really fast.. when will we reach again", "“The new Japanese bullet train reaches unimaginable 4.800 km / h, completing the route from Shin Osaka station to Tokyo (502.3 km) in just 10 minutes.”", "Shin-Osaka Station is a train station for the shinkansen, or bullet train, lines in the Japanese city of Osaka.", "The same video has been viewed more than 6,500 times after it was posted on Facebook with a similar claim here, here and here; on Twitter here; and on YouTube here.", "The claim, however, is false; the footage is actually a timelapse video of a 150-minute bullet train journey from Osaka and Tokyo.", "A reverse image search and a subsequent keyword search on Google found this video posted on August 2, 2020, on YouTube channel Fermata Studio, which lists its location as Japan.", "The 10-minute 12-second video is titled: “[High Speed Simulation] Operating Shinkansen Bullet Train, Osaka to Tokyo (515km) in 10 min”.", "The caption reads in part: “This movie is a fiction. Normally it takes 2.5 hours from Shin-Osaka to Tokyo. Made by a method called ‘Time variant hyper-lapse/time-lapse’.", "“Copy videos with altered titles and descriptions are circulating on Facebook, especially in Brazil and Malaysia. Three fact-checking sites have examined one of them and concluded that the video is fake and the description is false. They have published their findings along with screenshots of the fake video (in Portuguese). Moreover, one fact-checking site is currently investigating the copy videos.”", "Below is a screenshot comparison of the video in the misleading post (L) and the YouTube video (R):", "The person behind the YouTube channel Fermata Studio told AFP that they filmed the footage for the channel.", "“I elaborately described words ‘simulation’, ‘fiction’, ‘hyper-lapse/time-lapse’ in the title and description of my original video to avoid misleading,” they said in an email on September 19, 2020.", "“I have been filming window views from trains and aircrafts for the last seven years. Using those videos, I wanted to create a science fiction video that would allow people to experience an extreme speed that is impossible in reality.”", "Fermata Studio also posted another video earlier on January 6, 2019. The two-hour 36-minute video is titled: “2h30min Quiet Window View from Japan's Shinkansen Bullet Train at night”, and the caption reads in part: “Tokaido Shinkansen (Tokyo - Shin-Osaka) Nozomi 407, N700 Series”.", "According to the Japan Rail Pass website, “Tokyo and Osaka are connected by the Tokaido Shinkansen line” and “The Nozomi is the fastest train as it completes the journey in just 2 hours and 30 minutes.”", "The same website also says here that the top speed of the Japan Rail (JR) trains is 320 km/h (199 mph).", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]