["Tim Canova, who is in a Democratic primary battle with U.S. Rep. Debbie Wasserman Schultz, says he pushed to crack down on the financial services industry even before the financial collapse. And, he says he played a role in the 2010 financial reform bill.", "Canova, a law professor and first-time candidate, said in a June 1 Medium post he \"helped to draft parts of the Dodd-Frank Wall Street reform bill, one of President Obama’s signature accomplishments.\"", "Former U.S. Rep. Barney Frank, D-Mass., co-author of the reform bill, expressed some skepticism that Canova played a role.", "\"He does seem to be denigrating the financial reform bill, of which I was a co-sponsor, while simultaneously claiming credit for having written it,\" Frank said at a press conference for Wasserman Schultz in Broward May 31.", "We decided to fact-check Canova’s role in helping to draft part of Dodd-Frank.", "Effort to audit the Federal Reserve", "The Dodd-Frank Wall Street Reform and Consumer Protection Act was a sweeping law with multiple components intended to avert another financial meltdown. (Canova has some criticisms of the law which he details in his book, The Bottom-Up Recovery.)", "The part of the law Canova said he helped draft related to auditing the Federal Reserve, including its emergency lending in the aftermath of the economic collapse.  At the time, Canova was a professor of international economic law at Chapman University in California.", "U.S. Rep. Ron Paul, R-Texas, sought for two decades  to pass a bill to audit the fed. Bipartisan interest in Paul’s pet project grew after the financial collapse.", "The House Financial Services Committee passed an amendment 43-26 to audit the Fed on Nov. 19, 2009. U.S. Rep. Alan Grayson, D-Orlando, whipped Democratic votes. The amendment required government audits of the Federal Reserve including how much the central bank lent to banks. Critics felt it could lead the auditors to interfere with monetary policy.", "\"It was a major legislative achievement, the first time the Federal Reserve was subject to audit, and again over the objections of Barney Frank,\" Canova told PolitiFact Florida.", "The concern about monetary policy drew objections from Frank, Senate Banking Chairman Christopher Dodd, the Fed and the Obama administration. So the Senate author, Bernie Sanders, I-Vermont, scaled back audit powers to exclude monetary policy but include disclosing information about the emergency loans. The limited audit was included in the final Dodd-Frank bill that was signed by Obama in July 2010.", "Canova’s role was behind the scenes, serving as a resource to at least a couple of House and Senate staffers at the time.", "Canova said he was contacted by staffers on Capitol Hill after he published articles on the Federal Reserve. (One of his articles, \"Financial Market Failure as a Crisis in the Rule of Law,\" was published in the Harvard Law Policy and Review in 2009.) He was also quoted in many news articles about the financial crisis.", "One of those staffers was Matt Stoller, a senior policy adviser to Grayson who worked on the amendment.", "Canova \"was an adviser as we worked on the Federal Reserve emergency lending disclosure provisions of Dodd-Frank,\" Stoller told PolitiFact Florida. (In 2011, Stoller wrote an op-ed about the Federal Reserve and quoted Canova.)", "Another staffer was Warren Gunnels, an aide to Sanders. Canova also told Rolling Stone that he worked with some of Sanders' staff on the bill. (Gunnels now works on Sanders’ presidential campaign and did not respond to emails from PolitiFact Florida.) Sanders named Canova to a committee to advise him on Federal Reserve reform in 2011. Sanders backs Canova in his congressional race.", "Canova forwarded to PolitiFact Florida a few emails he exchanged with Stoller and Gunnels in July 2010 shortly before the Senate passed Dodd-Frank.", "For example, in an email July 13, 2010, Canova wrote to Gunnels: \"I have continued working through the provisions of the Dodd-Frank conference committee bill.\" Canova suggested that Sanders insert into the record some clarifying language that the audit would apply to financial assistance from the Federal Reserve starting Dec. 1, 2007, through the enactment of the bill.", "\"I am happy to claim a small bit of credit for a supporting role in helping the drafters of one of the very best provisions of the act,\" Canova told PolitiFact Florida.", "In an interview, Frank -- who is backing Wasserman Schultz -- told PolitiFact Florida he had never heard of Canova while working on the bill. As for the audit portion of the law, Frank argued Canova shouldn’t get credit because the final version didn’t include auditing monetary policy. Frank said he opposed that portion because he saw it as \"political interference.\"", "Frank said he didn’t want the members of the Federal Reserve Open Market Committee \"being called before an auditor and asked about votes on interest rates.\"", "Our ruling", "Canova says he \"helped to draft parts of the Dodd-Frank Wall Street reform bill.\"", "The Dodd-Frank bill was a sweeping piece of legislation with many components. Canova was involved in one piece of the bill.", "Canova played a behind-the-scenes role advising a House staff member and a Senate staff member about amendments to allow the government to audit the Federal Reserve. A scaled-back version was included in the final law.", "Canova didn’t contribute to the drafting of the overall bill, and he wasn't the main driver of the audit portion that stemmed from decades of advocacy by Paul. However, he did play a role.", "We rate this claim Half True.", "Medium, \"Another brazen attack from our opponent,\" June 1, 2016", "Tim Canova, Emails sent to Matt Stoller and Warren Gunnels, July 2010", "Rolling Stone, \"Meet the Bernie-Endorsed Law Professor Trying to Unseat the DNC Chair,\" May 26, 2016", "Dodd-Frank law sections 1102, 1103, and 1109 Signed by President Obama July 21, 2010", "RonPaul.com, Audit the Federal Reserve, Accessed June 6, 2016", "U.S. Sen. Bernie Sanders press release, \"Top Economists to Advise Sanders on Fed Reform,\" Oct. 20, 2011", "Huffington Post, \"Fed Beaten: Bill To Audit Federal Reserve Passes Key Hurdle,\" March 18, 2010", "Politico, \"House panel approves Paul's Fed audit,\" Nov. 19, 2009", "MarketWatch, \"Panel votes to audit the Fed; cap its spending at $4 trillion,\" Nov. 19, 2009", "Tim Canova, \"The Bottom-Up Recovery: A new Deal in Banking and Public Finance (Chapter 3),\" Oct. 27, 2014", "Congressional Quarterly, \"Provision on Auditing Fed Adopted for Systemic-Risk Bil\" (Accessed in Nexis), Nov. 19, 2009", "Philadelphia Tribune, \"Liberals question Obama's economic advisers choices,\" (Accessed in Nexis) Dec. 8, 2008", "Dallas Morning News, \"New council of regulators clears House committee,\" (Accessed in Nexis) Dec. 3, 2009", "Washington Post, \"Financial regulatory package heads to House; Frank gets measures through committee despite boycott of vote,\" Dec. 3, 2009", "Los Angeles Times, \"Dodd unveils slimmed-down financial reform proposal,\" March 16, 2010", "Washington Post, \"Effort to expand audits of Fed gains support,\" May 5, 2010", "Congressional Quarterly, \"Senate Negotiators Soften Bid to Audit Federal Reserve,\" (Accessed in Nexis) May 6", "Washington Post, \"Senators are set to vote on amendment to audit Federal Reserve,\" May 11, 2010", "Los Angeles Times, \"Senate votes unanimously to audit Fed,\" (Accessed in Nexis) May 11, 2010", "Washington Post, \"Lawmakers agree to place Fed under more scrutiny; Compromise expands audit of central bank's lending during crisis,\" (Accessed in Nexis) June 17, 2010", "Huffington Post, \"Reg Reform Bill Slammed By Dem Insiders, Economic Experts In Reid Letter,\" June 20, 2010", "New York Times, \"Note to Banks: It’s Not 2006 Anymore,\" March 26, 2011", "Politico op-ed by Matt Stoller, \"Federal Reserve must be held accountable,\" May 2, 2011", "The New Republic, \"Debbie Wasserman Schultz’s challenger has a chance,\" Jan. 13, 2016", "Huffington Post, \"You’ve probably missed this key struggle among Democrats,\" Jan. 29, 2016", "Interview, Tim Canova, candidate for Congress, June 1, 2016", "Interview, Matt Stoller, former staff member for Alan Grayson, June 7, 2016", "Interview, former U.S. Rep. Barney Frank, June 7, 2016", "Interview, David Damron, campaign spokesman for U.S. Rep. Alan Grayson, June 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]