["The video was published in this Facebook post on November 4, 2019, alongside the caption: “Must watch video, the real situation concerning Andre Gomes injury”. It has since been viewed 2.4 million times and shared nearly 40,000 times.", "Below is a screenshot of the post:", "The Arabic script superimposed on the video translates to English as: “Resetting foot joint without surgery.”", "André Gomes is a footballer for the English Premier League team Everton. He is also a midfielder for the Portuguese national side.", "On November 4, 2019, the midfielder fractured his right ankle during a Premier League when he collided with Tottenham’s Son Heung-min, as this AFP article reports.", "The footage has since been shared on Facebook here, here, here, here and here; on Twitter here and here; and on YouTube here alongside a similar claim.", "The claim is false; the footage predates the footballer’s injury by at least three months. It also shows a left foot rather than a right foot.", "A reverse image search on Yandex found an earlier version of the footage published on Instagram here on July 18, 2019.", "LUXAÇÃO DE TORNOZELO - A luxação é o deslocamento de um ou mais ossos de uma articulação e acontece quando uma força atua direta ou indiretamente sobre o nosso corpo. Em termos médicos, é definida como perda do contato articular, isto é, a separação de dois ossos que costumam estar interligados através da cartilagem, Quando o deslocamento entre os ossos é parcial e alguma parte de cada superfície está em contato com a outra, é chamada de sub-luxação. A luxação pode, algumas vezes, estar relacionada com uma fratura de um osso, o que a confunde com entorse ou contusão. Luxação: deslocamento do osso; Entorse: lesão ocasionada pelo excesso de movimento de uma articulação; Contusão: lesão em alguma região do corpo (ex: músculos). #fisio #fisios #fisioterapia #fisioterapiaporamor #fisioterapeuta #fisiologiahumana #fisioterapiaesportiva #fisioterapeutas #fisioterapiarespiratoria #fisioporamor #fisiocomamor #fisioloucos #fisioteraloucos #fisiodesportiva #fisioterapiadesportiva #esportes #atleta #corrida #lesao #traumatoortopedia #traumatologia #luxação #ortopedia #ortopediaetraumatologia #riodejaneiro #rj #errejota021 #esportesradicais", "A post shared by  Diego Magalhães (@diegomagalhafisio) on Jul 17, 2019 at 1:17pm PDT", "The Portuguese-language caption translates to English as: “ANKLE LUXATION – The luxation is the dislocation of one or more bones of a joint and it occurs when a force acts directly or indirectly over our body. In medical terms, it is defined as a loss of joint contact, in other words, the separation of two bones that are usually interconnected by cartilage. When the dislocation between the bones is partial and a part of each surface is in contact with the other, it is called a subluxation. The luxation can, sometimes, be related to a bone fracture, which can make it be mistaken for a sprain or a contusion. Luxation: dislocation of a bone. Sprain: injury caused by excessive movement of a joint. Contusion: injury in a part of the body (e.g., muscles).”", "The Instagram account belongs to Diego Magalhães, who according to the bio is a 26-year-old physiotherapy student in Rio de Janeiro.", "“Yes, the video is mine,” he told AFP via Instagram’s direct message on Friday, November 8, 2019. “It’s not André Gomes, someone made a fake news. I didn’t know the video was being shared as if it showed André Gomes’ injury”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]