["About this rating", "On Dec. 12, 2020, Twitter users noticed some unusual lack of activity surrounding U.S. President Donald Trump’s latest tweets. That’s because Twitter briefly prevented users from liking, replying, or retweeting a series of tweets posted by Trump that were disputing the results of the 2020 presidential election.", "Users were still allowed to retweet the tweet with a comment, as shown in screenshots of banners explaining the restriction: “We try to prevent a Tweet like this that otherwise breaks the Twitter Rules from reaching more people, so we’ve disabled most of the ways to engage with it. If you want to talk about it, you can still Retweet with comment.”", "The restrictions came as Trump tweeted about the Supreme Court’s rejection of Texas’ bid to overturn the presidential election. He called this “a great and disgraceful miscarriage of justice.” His tweet, that “he won the election in a landslide,” was also briefly restricted by Twitter.", "In a statement to the media, Twitter admitted that it had briefly limited engagement with certain tweets, saying, “We inadvertently took action to limit engagements on the labeled Tweet. This action has been reversed, and you can now engage with the Tweet, but in line with our Civic Integrity Policy it will continue to be labeled in order to give more context for anyone who might see the Tweet.”", "The Civic Integrity Policy states:", "You may not use Twitter’s services for the purpose of manipulating or interfering in elections or other civic processes. This includes posting or sharing content that may suppress participation or mislead people about when, where, or how to participate in a civic process. In addition, we may label and reduce the visibility of Tweets containing false or misleading information about civic processes in order to provide additional context.", "Indeed, the social media platform still has warning labels attached to a number of Trump’s tweets because of the \"disputed\" accuracy of his claims.", "Given that Twitter did briefly limit interactions with Trump’s tweets, but reversed the action shortly after, we rate this claim as “Outdated.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]