["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California health officials have warned that beaches pose a health threat during the pandemic because they draw large crowds of people who cluster together, according to the Los Angeles Times.", "In March, Los Angeles County closed all of its beaches to try to slow the spread of coronavirus. But an image being shared on social media suggests authorities are taking this directive to an extreme.", "\"A California surfer was arrested for violating the state’s stay-at-home order,\" reads the text over an image of what looks like two sheriff deputies walking a man in handcuffs down a beach. \"He was alone, in the ocean, when police violated social distancing protocols to arrest him, and potentially expose him to infection. This isn’t about safety, it’s about control!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is authentic. On April 2, Los Angeles County sheriff’s deputies arrested a paddle boarder — not a surfer — on grounds he ignored lifeguards’ orders to get out of the ocean near Malibu Pier for at least 30 minutes, the Times reports. Lifeguards contacted the deputies who responded by boat, according to the sheriff’s department.", "In video taken by bystanders and posted to Instagram it appears that the man was paddle boarding alone.", "\"The man, who was not identified by authorities, eventually made his way to the beach, where he was arrested on suspicion of disobeying a lifeguard and violating Gov. Gavin Newsom’s stay-at-home order, a misdemeanor,\" the story says.", "The Los Angeles County Sheriff’s Department confirmed to PolitiFact that the man was arrested for violating a lifeguard’s orders.", "But Newsom’s order says that it \"shall be enforceable pursuant to California law, including, but not limited to, Government Code section 8665.\" That law says that anyone who \"refuses or willfully neglects to obey any lawful order or regulation promulgated or issued as provided in this chapter, shall be guilty of a misdemeanor and, upon conviction thereof, shall be punishable by a fine of not to exceed one thousand dollars ($1,000) or by imprisonment for not to exceed six months or by both such fine and imprisonment.\"", "The paddle boarder was booked at a sheriff’s station and released on a promise to appear in court, according to the Times.", "On its website, the California Department of Public Health advises that public health officials recommend social distancing — including maintaining approximately six feet away from other people — to slow the spread of infectious diseases like COVID-19.", "Our ruling", "The Facebook post says a lone surfer in California was arrested for flouting the state’s stay-at-home order. That’s mostly right — it was a paddle boarder, not a surfer, out on the water at a beach that was closed to slow the spread of COVID-19. Authorities say he was arrested for disobeying a lifeguard and violating the state’s restrictions.", "We rate this Facebook post Mostly True.", "Facebook post, April 7, 2020", "Los Angeles Times, Coronavirus at beaches? Surfers, swimmers should stay away, scientist says, April 2, 2020", "Los Angeles Times, Coronavirus: L.A. County closes all beaches and adjacent trails and facilities to deter crowds flouting restrictions, March 22, 2020", "Los Angeles Times, Paddle boarder chased by boat, arrested in Malibu after flouting coronavirus closures, April 3, 2020", "Instagram post, April 2, 2020", "California Executive Order N-33-20, March 19, 2020", "California government code section 8665, visited April 8, 2020", "California Department of Public Health, COVID-19, visited April 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]