["Multiple posts shared by thousands of people in Nigeria claim a man sentenced to death is set to be released after surviving three lethal injections. This is false; AFP traced the article to a news parody website.", "'Death Sentenced Prisoner Survives Lethal Injection 3 Times Set Free' claims the headline of an article from November 2019 by Face of Malawi news website. The article claims that Igor Hamilton is to be set free 'at the end of the month' and 'awarded $250,000' after surviving three lethal injections.", "‘Hamilton, who was sentenced to death in 1997 for killing his neighbor’s cats, said the needle wasn’t even painful,’ the article says.", "‘While incarcerated he claims to have found God and spoked to him in prayers, God assured him he would survive “Because cats have no soul.” he never really committed a crime.’", "The same article was published by Opera News, a major news app in Nigeria, and has been shared nearly 20,000 times on Facebook. The same story and accompanying image have also been shared thousands of times in Zimbabwe, Nigeria and the United States.", "AFP used Google’s Timestamp feature, which gives the exact time content was published, to track the earliest article connecting the photo of the convict to the lethal injection story. The earliest such article was published on July 12, 2019 by Chicago-based Huzlers.com, with the headline 'Death Row Inmate Survives Lethal Injection 3 Times Set Free; Imprisoned For Killing Cats'.", "However, the website’s 'About us' section claims it is a news parody website, blogging on 'a combination of satirical and fictional content created in such a complex way that it could not conveniently be presented or represented anywhere else but Huzlers!'.", "Most other versions of the article have lifted the story word-for-word, with some alterations to the headline across the various countries where the post has been shared.", "AFP ran another search using Yandex image search tool, and found the photograph claiming to show Igor Hamilton in another entirely different article about police in Texas using 'a Taser gun to subdue a mentally ill man in a flooded area of Houston'.", "This article was published on September 11, 2017 by World News Daily Report which, like Huzlers, describes itself as a parody news site and features a disclaimer on its website, ‘World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content’.", "Comparing the articles by Huzlers and the World Daily News Report, we can see that the image featured in the latter has been edited to include a mugshot-style background with numbers to measure the convict's height.", "The original post may be fictional, but many other websites have reshared it as a genuine news story.", "Reverse image searches of the photograph of the man on Google and Yandex reveal multiple posts. The earliest one we can find dates back to a Facebook post in Arabic on September 15, 2009, which features a slightly different photograph of the man, looking more haggard than in other versions of the photograph. However, the photo was nowhere to be found when AFP searched the Facebook page.", "If you know who the man in the photo is, please contact us here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]