["By Robert Farley, Eugene Kiely and D'Angelo Gore", "Posted on March 16, 2017 | Corrected on October 27, 2017", "President Donald Trump says his agenda is all about “jobs, jobs, jobs.” But at a rally in Nashville, and a speech earlier the same day in Detroit, Trump made several misleading claims about jobs, and the effect he has had on them since taking office.", "Trump made a few other misleading claims in Nashville that we have heard before: on the size of a proposed defense spending increase, the number of refugees under federal investigation for terrorism, and the track record of an appeals court that blocked the president’s travel order.", "You can see our annotated transcript of Trump’s Nashville speech here.", "We’ll start with a comment Trump made about jobs in general. Boasting about job gains since he took office, Trump touted January gains that occurred before his inauguration.", "Trump, March 15: Already, because of this new business climate, we are creating jobs that are starting to pour back into our country like we haven’t seen in many, many decades. In the first two job reports since I took the oath of office, we’ve already added nearly half a million new jobs. And believe me, it’s just beginning.", "It’s true that the U.S. economy has added 473,000 jobs this year, according to the Bureau of Labor Statistics. But Trump wrongly takes credit for the 238,000 jobs added in January to make the claim that “nearly half a million” jobs have been created “since I took the oath of office.”", "The BLS measures payrolls as of the week containing the 12th day of the month. Trump wasn’t sworn in until Jan. 20. So the January numbers were based on a survey that was concluded before Trump took office.", "We also note that this positive jobs trend is not something that began in January, or even since the election. As we have noted previously, the economy added more than 250,000 new jobs a month in 20 of the 96 months under President Obama. Overall, the nation’s economy added 11.5 million jobs under Obama, including a record 76 straight months of job growth — which was extended to 77 months in February.", "We would also be remiss if we did not point out that in the past, Trump has repeatedly derided the monthly jobs data put out by the Bureau of Labor Statistics — particularly its unemployment rate data — as “phony.” White House Press Secretary Sean Spicer made light of the president’s newfound respect for the BLS figures when he joked during a March 10 press briefing, “Yeah, I talked to the president prior to this, and he said to quote him very clearly — ‘They may have been phony in the past, but it’s very real now.'”", "Correction, Oct. 27: There were 76 straight months of job growth under Obama — not 75 as we originally wrote — and 77 straight months of growth through February.", "In Nashville, Trump also made this curious promise: “We’re going to put our auto industry back to work.”", "It’s true that automobile manufacturing jobs are down from a peak in early 2000, and so perhaps Trump meant that he intends to restore the number of auto manufacturing jobs to that level.", "But since plummeting in the Great Recession, auto manufacturing jobs have been on a fairly steady incline for more than six years, as the chart below from the Bureau of Labor Statistics shows. The number of jobs in motor vehicle and parts manufacturing has risen by 37.5 percent since Obama took office in January 2009, and by just over 50 percent since its lowest point in the recession in July 2009.", "U.S. vehicle sales hit an all-time high of 17.5 million in 2016, the seventh consecutive year of sales gains, said Michelle Krebs, a senior analyst for Autotrader.", "At a rally earlier on March 15 in Detroit, Trump said that because of his election, “plenty” of overseas auto manufacturing plants were “stopped in their tracks.”", "Trump, March 15, Detroit: Before NAFTA went into effect – by the way, NAFTA, a total disaster — there were 280,000 auto workers in Michigan. Today, that number is roughly 165,000 and would have been heading down big league if I didn’t get elected, I will tell you that right now. That I can tell you. Plenty of things were stopped in their tracks. They were stopped in their tracks. A lot of bad things were going to happen, a lot of places were going to get built that aren’t going to get built right now in other locations.", "It remains to be seen whether auto manufacturing jobs will continue to rise or, as many believe, have plateaued. Krebs thinks sales will dip slightly to 17.3 million in 2017, and other automotive industry forecasters have projected sales may dip even lower than that.", "But auto industry experts we spoke to were hard-pressed to name any overseas plants that have been scrapped due to Trump’s influence.", "In the past, Trump has cited Ford as an example. But as we have written, Trump is claiming undue credit. Ford announced on Jan. 3 that it had canceled its planned $1.6 billion plant in Mexico, and that it would invest $4.5 billion over the next five years to ramp up production of electric cars, including an investment of $700 million at its plant in Flat Rock, Michigan.", "The planned Mexico plant, where Ford had planned to build the next generation Ford Focus, was scrapped because “we’ve seen decreasing demand here in North America for small cars, and we simply don’t need the capacity anymore,” Ford CEO Mark Fields said on Fox Business News. Instead, he said, Ford will build the Focus in an existing facility in Mexico.", "As for the investment in electric vehicles, Fields said in announcing the plan that it was a reaction to the reality that “the era of electric vehicles is dawning,” adding that he expected to see production of electric cars exceed traditional gas-powered ones in the next 15 years.", "Host Neil Cavuto asked if Ford would have announced the moves if Trump were not elected president. “Yes, absolutely,” Fields said.", "Another example frequently cited by Trump has been Fiat Chrysler, which announced on Jan. 8 a $1 billion investment in plants in Michigan and Ohio, and the addition of 2,000 new American jobs. The company announced that expansion would enable the company to build Ram heavy duty trucks, currently produced in Mexico, in Michigan.", "In comments the day after the announcement, Fiat Chrysler CEO Sergio Marchionne told reporters the announced investments were in the works for more than a year and had nothing to do with Trump or his policy ideas, USA Today reported.", "Rather, he said, “It has been part of the discussion going back to 2015″ negotiations with the United Auto Workers.", "Both company CEOs praised Trump’s plan to slash regulations and cut corporate taxes — which they said would allow them to grow in the future. But both also noted that their U.S. expansion plans were part of a years-long investment strategy.", "The Center for Automotive Research found that automakers have announced investments of $116.5 billion since January 2009, said Kristin Dziczek, an analyst at the Center for Automotive Research in Ann Arbor, Michigan. And 73 percent of that investment has come to the U.S., while Mexico has gotten 21 percent and Canada, 6 percent.", "Aside from Ford’s decision — which Dziczek said was a market-driven decision due to sluggish sales of small cars — “I’m not aware of anything else that has been cancelled or pulled back from offshore in this time frame,” she told us.", "Trump also boasted in Nashville that he approved the Keystone XL and Dakota Access pipelines, adding that all “new pipelines must be constructed with American steel.” But only about half of the steel for those projects will come from the U.S., despite Trump’s directive.", "Trump, March 15: I’ve already authorized the construction of the long-stalled and delayed Keystone and Dakota Access pipelines. A lot of jobs. I’ve also directed that new pipelines must be constructed with American steel. They want to build them here, they use our steel. We believe in two simple rules: Buy American and Hire American.", "It’s true that Trump issued a memorandum on Jan. 24 directing the commerce secretary to “develop a plan under which all new pipelines, as well as retrofitted, repaired, or expanded pipelines, inside the borders of the United States, including portions of pipelines, use materials and equipment produced in the United States, to the maximum extent possible and to the extent permitted by law.”", "But for the Keystone XL project and the Dakota Access Pipeline, no more than 57 percent of the steel will be from the U.S. That’s because both projects were already far along in the planning and construction process, even though sections of them have been delayed, as Trump said.", "Let’s look first at Keystone XL, which would be built by TransCanada Corp. That pipeline would run 1,179 miles from Hardisty, Alberta, to Steele City, Nebraska, where it would connect with existing pipelines to refineries on the Gulf Coast. The U.S. segment would run through Montana, South Dakota and Nebraska. The 36-inch diameter line could carry up to 830,000 barrels (nearly 35 million gallons) of oil per day, according to a company brochure.", "The Obama administration rejected the project — a decision that was reversed by Trump. As we have written before, the U.S. State Department estimates that about 42,000 temporary jobs would be added during construction, but that only 50 permanent jobs would be needed to operate the pipeline.", "In a 2012 press release, the company said that it would use “660,000 tons of steel for the U.S. portion of the Keystone XL pipeline” — about half of which would come from the United States, specifically from the Welspun Group in Little Rock, Arkansas. The rest would come from Canada (24 percent), Italy (16 percent) and India (10 percent).", "We provided TransCanada with a link to its press release and asked if the information is still current. We were told that it is. So, nothing has changed, despite Trump’s order.", "In a statement to the media earlier this month, Trump spokeswoman Sarah Huckabee Sanders explained why Keystone XL was exempt from the executive order: “The way that executive order is written. It’s specific to new pipelines or those that are being repaired. Since this one is already currently under construction, the steel is already literally sitting there; it would be hard to go back.”", "That is also true for the Dakota Access Pipeline, which is even further along.", "Once complete, the 1,172-mile pipeline will extend from the Bakken formation in North Dakota through South Dakota and Iowa and into Illinois.", "In early February, two months after the Obama administration halted construction, Trump’s Army Corps of Engineers reversed course and gave an Energy Transfer Partners subsidiary, Dakota Access LLC, the go-ahead to finish building the pipeline. In court documents, the company said that part of the pipeline could be ready to use as early as March 20, depending on testing, according to a March 14 Forum News Service report.", "In an August 2016 fact sheet on the project, Dakota Access said that “57 percent of the pipeline will be manufactured in the United States.”", "The same fact sheet said that the pipeline project was expected to create between 8,000 and 12,000 temporary construction jobs, but only as many as 40 permanent operating jobs beyond that.", "Defense: Trump boasted that his budget “calls for one of the single largest increases in defense spending history in this country.” As we have written, Trump’s proposed FY2018 budget will include $603 billion in base defense spending, an increase of 9.4 percent from the current $551 billion. But Presidents Jimmy Carter and Ronald Reagan enacted double-digit increases in base defense spending five times in the 1980s — including increases of nearly 25 percent in fiscal 1981 and more than 20 percent in fiscal 1982. President George W. Bush’s base defense budget increases also were larger in 2002, 2003 and 2008, according to the Committee for a Responsible Federal Budget.", "Refugees: Trump said, “Hundreds of refugees are under federal investigation for terrorism and related reasons.” As we have written, the administration has said 300 refugees are subjects of “counterterrorism investigations” without defining what that means. There are three levels of investigations, beginning with “assessments” — which do not require “any particular factual predication,” as explained in a 2014 inspectors general report. The New York Times last year reported that in recent years “the F.B.I. has averaged 10,000 assessments annually, and 7,000 to 10,000 preliminary or full investigations involving international terrorism.” What we do know is that no refugees were involved in the Sept. 11, 2001, terrorist attacks, and no refugees have been responsible for any terrorism-related deaths in the U.S. since 9/11.", "Courts: Trump criticized the U.S. Circuit Court of Appeals for the 9th District, which ruled against Trump’s first executive order on foreign travel and would hear a challenge to a Hawaii federal judge’s order blocking the revised one. “Take a look at how many times they have been overturned with their terrible decisions,” Trump said of the 9th Circuit. In the 2015 term, the 9th Circuit had a reversal rate of 80 percent, while the average reversal rate for all 13 appellate courts was 67 percent. But a 2010 American Bar Association report noted that the Supreme Court reviews less than 1 percent of all circuit court rulings. “Reversal rates for each court of appeals would be very small, in the range of a tenth of a percent, if calculated as the total number of cases reversed over the total number of appeals terminated by that court,” the report said.", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]