["About this rating", "As the 2016 school year and the election primary cycles wound to a close in California, they inevitably congealed into political brouhahas that entangled even young students. One such controversy involved the case of third-grader Logan Autry and his \"Make America Great Again\" hat:", "Third-grader Logan Autry, 9, said officials at Powers-Ginsburg Elementary School in Fresno told him to remove his “Make America Great Again” hat because it could stir “negative emotions” in other children.", "The red baseball cap with the phrase printed in white capital letters has become almost synonymous with the campaign of presumptive Republican presidential nominee Donald Trump.", "“The principal told me to take it off, and I still didn’t take it off,” Autry [said]. “And she said it was against the dress code to wear the hat, but I looked in the dress code and it was not against it.”", "The Fresno Unified School District's dress codes for the 2015-2016 school year are fairly easy to track down online, and they haven't changed much (if at all) from those of previous years:", "Any apparel, hair style, cosmetic or jewelry, even if not specifically mentioned below, which creates a safety concern, draws undue attention to the wearer, or tends to distract from the educational process is prohibited unless addressed elsewhere in this regulation.", "Additionally, the following items are specifically prohibited:", "What many stories didn't mention was that Logan Autry wore the hat for several days before the school, seeing it as a potential distraction, intervened and told him to remove it:", "Our job as educators is to facilitate a safe learning environment where we encourage robust conversations of diverse and thoughts. We are proud that in this case, our school achieved that goal by allowing the student to wear his hat for several days. However, it is also our responsibility to take precautions when the discourse begins to impact our school climate and interrupt school operations.", "Logan told reporters that wearing the hat at school is his First Amendment right. However, the right to free speech is interpreted (by courts and others) somewhat differently in public schools than outside them. The National Coalition Against Censorship has a rundown of how the First Amendment is interpreted within the classroom:", "Recent Supreme Court decisions have made it clear that the right to free speech and expression can sometimes be subordinated to achieve legitimate educational goals. (See discussions of Hazelwood School District v. Kuhlmeier, Bethel School District v. Fraser.) A school is not comparable to a public park where anyone can stand on a soapbox, or a bulletin board on which anyone can post a notice. While students and teachers do not \"shed their constitutional rights to freedom of speech or expression at the schoolhouse gate\" (Tinker v. Des Moines), speech is not quite as free inside educational institutions as outside.", "This does not mean that students and teachers have no First Amendment rights at school. Quite the contrary. But within the educational setting, the right to free speech is implemented in ways that do not interfere with schools’ educational mission. Students cannot claim, for instance, that they have the right to have incorrect answers to an algebra quiz accepted as correct, nor can teachers claim a right to teach anything they choose.", "Other quotes from Logan present a fuller picture of the third-grader's political views:", "He already has the shirt and tie down, and practices speeches about Trump on the playground.", "\"I've told them his policies on illegal immigration, and our second amendment, and our first amendment and all of our amendments that need to be protected which are not going to be an amendment at all if Hillary Clinton or Bernie Sanders gets elected,\" said Autry.", "The debate was made moot not long after the controversy began when the Autry family's dog tore the controversial hat to pieces.", "FoxNews.com.    \"9-Year-Old Boy Said Principal Told Him to Remove Trump Cap.\"\r\n    5 June 2016.", "\"The First Amendment in Schools: A Resource Guide.\"\r\n  National Coalition Against Censorship.", "YourCentralValley.com.   \"School Says No to Student's Trump Hat.\"\r\n     2 June 2016.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]