["New York Gov. Andrew Cuomo greeted news that President Donald Trump had filed residency paperwork in Florida with a tweet saying, \"Good riddance.\" But Cuomo’s anti-Trump sentiment hasn’t made its way into an ad campaign from the New York City Sanitation Department, despite the claim of a viral Facebook post.", "The post shows a photo of an outdoor trash can. On its side is an illustration of a woman holding a Bible and wearing a \"Make America Great Again\" hat. A red circle with a line across it is stamped over her head and above her are the words \"Keep NYC Trash Free.\"", "A Nov. 5 Facebook post featuring the image says: \"These are real ads running in New York City calling for the removal of ‘trash’ which includes white people, Trump supporters, and Christians. This is an all out assault on western society. Rise up gamers. #MAGA.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because, as Gothamist reported last year, these aren’t NYC Sanitation Department ads but the work of graphic artist Winston Tseng.", "On Oct. 26, 2018, NYC Sanitation tweeted: \"Unauthorized posters illegally affixed to some litter baskets are being removed.\"", "Other images Tseng created as part of the \"Trash Free\" campaign showed a man in a MAGA hat holding a Chick-fil-A hat and a New England Patriots fan holding a beer.", "Those weren’t \"real ads\" either, as the Facebook post claims.", "We rate it False.", "Facebook post, Nov. 5, 2019", "Andrew Cuomo tweet, Oct. 31, 2019", "Gothamist, Fake anti-MAGA sanitation posters want to ‘Keep NYC Trash Free,’ Oct. 24, 2018", "Winston Tseng’s website, visited Nov. 5, 2019", "NYC Sanitation tweet, Oct. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]