["About this rating", "King Salman bin Abdulaziz Al Sau of Saudi Arabia reportedly issued an order in April 2017 that would allow greater freedom for women in his country, while retaining codified examples of its \"guardianship\" policies.", "According to local media, Saudi women would be allowed to access education and healthcare services from government agencies without needing permission from, or accompaniment by, a male guardian.", "However, the decree will not apply to areas where \"there is a regulatory obligation for this request,\" meaning companies or services that already have regulations mandating the approval of a male relative are not affected. The country's \"guardianship\" system mandates that a woman's husband, father, brother, or son grant permission to her if she wishes to study internationally, rent an apartment, apply for a passport, or marry, among other actions.", "Women were also subject to an informal ban on driving, in that it is heavily discouraged by traditional mores. In November 2016 the Shura Council, which advises the king but has no legislative power, refused to consider a petition calling for a study of the issue that reportedly would have included the question, \"What is required to allow them to drive?\" However, the country's foreign ministry announced on 26 September 2017 that by royal decree, Saudi women would be allowed to take driving lessons without a man's permission and be allowed to drive.", "The civil rights advocacy group Human Rights Watch said in an online post that they had \"reviewed\" the two-page order, which provides government agencies a three-month period during which they must compile a list of services requiring male approval. However, the group said they could not provide us with a version of the order translated into English.", "Sarah Leah Whitson, Human Rights Watch's Middle East director, said:", "Saudi Arabia has a tremendous opportunity to root out all vestiges of the guardianship system, and should use the three-month review period King Salman ordered to immediately declare all guardian consent requirements null and void. The king should also require state agencies to actively prevent discrimination by private individuals and businesses.", "Maha Akeel, a spokesperson for the Saudi Arabia-based Organization of Islamic Cooperation, noted that the easing of guardianship rules could allow women more chances to pursue employment or represent themselves in court, saying: \"Male guardianship is un-Islamic and humiliating for women. Some [men] take advantage of this male guardianship for their own benefit and abuse it.", "The World Economic Forum ranked Saudi Arabia 141st out of 144 countries in their October 2016 \"Global Gap report,\" which measures discrepancies between men and women \"across four key areas: health, education, economy and politics.\"", "Batrawy, Aya.   \"Saudi King's New Order Loosens Guardianship Rules on Women.\" \r\n      Associated Press.    4 May 2017.", "Human Rights Watch.    \"Saudi Arabia: ‘Unofficial’ Guardianship Rules Banned.\" \r\n      9 May 2017.", "Kanso, Heba.   \"Saudi Step to Relax Male Guardianship Welcomed by Women's Advocates.\" \r\n    Reuters.   5 May 2017.", "World Economic Forum.   \"The Global Gender Gap Report 2016.\" \r\n    25 October 2016.", "Agence France-Presse.  \"Saudi advisory council rejects study of women driving.\"  Accessed via www.al-monitor.com.  2 November 2016.", "Gaouette, Nicole and Labott, Elise.  \"Saudi Arabia to Let Women Drive At Last.\"\r\nCNN.  26 September 2017.", "Updated [30 May 2017]: Updated with clarification of the nature of the Saudi Arabian ban against women driving.", "Updated [26 September 2017]: Updated with note on the Saudi royal family lifting the ban against women driving.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]