["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lawmakers claim these huge fermentation tanks were manufactured in China using taxpayer money. (Courtesy: Genesee Brew Company)", "A dozen massive fermentation tanks slowly traveled on barges along a 225-mile stretch of the Erie Canal before reaching Rochester last week.", "It was an eye-catching site for the thousands who flocked to the canal to watch the tanks float by.", "The 2,000-barrel tanks were hauled from Saratoga County to Rochester as part of Genesee Brewery’s $49 million upgrade.", "But their arrival also drew criticism from Assemblyman Anthony Brindisi, a Democrat from Utica, because the state offered economic incentives to the brewery even though the tanks were made in China.", "\"It disgusts me to know that state economic development dollars were used to support a project where goods were manufactured in China, when we have companies like Feldmeier Equipment that produce products like this right in the Mohawk Valley,\" Brindisi said in a statement. \"New York should put its money where its mouth is and support our state workers and state companies first, before they ship taxpayers' money right out the door to China.\"", "Is Brindisi right? Were tax dollars used to pay a manufacturer in China for the new fermentation tanks at Genesee Brewery?", "State money", "In September 2016, New York state officials announced a $9.5 million investment to support the expansion at Genesee Brewery.", "The state promised help from two programs: $4.5 million in tax credits from the Excelsior Jobs Program and up to $5 million from the governor’s Upstate Revitalization Initiative.", "But Genesee Brewery has not yet received any of that money from the state. The company must first meet criteria from the Empire State Development.", "The brewery must create 128 full-time positions by 2020 to qualify for the $4.5 million in tax credits. Half of those jobs have to go to local residents in poverty based on criteria from the Rochester-Monroe Anti-Poverty Initiative. The tax credits are spread out over ten years.", "The $5 million from the Upstate Revitalization Initiative has strings attached, too. The brewery must invest $34 million in private money and create 13 full-time positions to receive the first $2 million of the grant. The other $3 million would be paid in four installments if the brewery maintains its hiring goals and consistently pays its property taxes.", "Private money", "The tanks are part of a three-phase upgrade at Genesee Brewery. The state incentives could reach $9.5 million. Genesee Brewery’s corporate parent, North American Breweries, is spending $40 million.", "The approximate cost of the tanks accounts for about 5 percent of the company's $40 million investment, the company said.", "The brewery says its parent company paid for the tanks. The state also confirmed no state money was used.", "\"The bottom line is that while Feldmeier bid on a larger equipment package, the company declined (twice) to bid on the tanks in question and not one penny of State funds were spent on the equipment purchased by NAB, from China or elsewhere,\" Jason Conwall, an Empire State Development spokesman, said in a statement.", "A request for bids on the tanks went out in December 2015, the same month the Finger Lakes region was awarded $500 million in economic development money from the governor’s Upstate Revitalization Initiative competition. The brewery’s expansion was included in the region’s pitch for the award but no dollar amount was announced until September 2016.", "Genesee Brewery signed a contract with Chinese manufacturer Lehui in June 2016 to begin the first phase of the project, a modernization of the brewery’s equipment.", "Genesee Brewery has worked with Feldmeier Equipment since at least 2006 to manufacture equipment for the plant, including seven tanks in the last three years. When the bid for new fermentation tanks went out, Feldmeier put in a bid for a large part of the project instead of the whole project.", "\"Based on the timing for the project at the time, we placed a bid on the majority of it but not the entire project, just because of the timing,\" said Dave Pollock, vice president of sales for Feldmeier Equipment.", "North American Breweries said in its funding application to Empire State Development that no state money would be used to fund the first phase. The plan called for public funding in the second and third phases of the project, which include the construction of a business incubator, event space, solar panels and a learning center for tourists and brewers.", "The brewery is still in the first phase of the project.", "Our ruling", "Brindisi said \"state economic development dollars were used to support a project where goods were manufactured in China.\"", "That may eventually be true. But it's not true now. The company has not received any state money yet.", "Brindisi also said New York state should support \"our state workers and state companies first, before they ship taxpayers' money right out the door to China.\"", "No state money was used or will be used to buy twelve fermentation tanks from a Chinese manufacturer for Genesee Brewery. The brewery stands to eventually receive state money for other phases of the upgrade, but it must first meet investment and job creation targets.", "We rate the claim False.", "Press release from Assemblymembers Anthony Brindisi, Marc Butler, and Brian Miller, May 26, 2017", "Phone conversation with press staff from Assemblyman Anthony Brindisi’s office", "Phone and email conversation with Jason Conwall, spokesperson for Empire State Development", "Phone and email conversation with Mary Beth Popp, Director of Corporate Relations for North American Breweries", "Phone conversation with Dave Pollock, Vice President of Sales for Feldmeier Equipment", "Governor Cuomo Announces Genesee Brewery Expansion to Create 128 Jobs in Rochester, Sept. 7, 2016", "Finger Lakes 2015 Final Plan for the Upstate Revitalization Initiative, Oct. 2015, Finger Lakes Regional Economic Development Council", "Governor Cuomo Announces Feldmeier Equipment Breaks Ground on New Manufacturing Facility in Herkimer County and Creates 80 Jobs, Aug. 16, 2013", "\"Beer tanks barrel along canal as lawmakers trade barbs\", May 26, 2017, Utica Observer-Dispatch", "\"Genesee Brewery unveils $49.1M expansion plan\", Sept. 7, 2016, Rochester Democrat & Chronicle", "Governor Cuomo Announces North American Breweries Breaks Ground on Genesee Eco-Brewery District in Rochester, Feb. 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]