["About this rating", "One oft-repeated internet rumor holds that Ewan McGregor, the actor who played Obi-Wan Kenobi in the \"Star Wars\" prequel trilogy, has a brother named Colin who used the call sign \"Obi-Two\" while a pilot in the United Kingdom's Royal Air Force (RAF).", "This tidbit has been repeatedly shared on social media sites, is included in IMDB's trivia section, and has even made it into a few tabloids. Most commonly, perhaps, it's shared in the form of a meme:", "Ewan truly has a brother named Colin, and Colin was truly a pilot in the RAF. However, we have not been able to find any evidence to support the claim that Colin used the call sign \"Obi-Two\" in an official capacity while serving in the RAF. In fact, it appears that this rumor started as a punny joke before it was mistaken for a genuine factoid about the actor and his brother.", "The earliest posting of this joke that we could find was posted in 2013 by Kevin Rubio, a filmmaker best known for making \"Star Wars\" parodies. From there, it was shared to the Aviation Humor website.", "When this tidbit is shared in earnest, it is typically accompanied by one of two pieces of \"evidence.\" One posting on the \"Today I Learned\" section of Reddit, for instance, was attached to a link to a Wikipedia article of \"famous aviator nicknames.\" As of this writing, however, that article makes no mention of Colin McGregor or his supposed \"Obi-Two\" call sign.", "The other piece of suggested \"evidence\" points to a BBC program entitled \"The Battle of Britain\" that featured both Colin and Ewan discussing the history of the RAF, Colin's experience as a pilot, and, of course, the various British pilots that fought during World War II. That program, however, makes no mention of \"Obi-Two\":", "While we have yet to uncover any evidence that Colin used the \"Obi-Two\" call sign in earnest during his time in the RAF, there is some anecdotal evidence that this may be the case. In 2016, for instance, Colin referred to himself as \"Obi-Two\" in a tweet directed at his brother:", "While Colin has used Obi-Two in an informal humorous manner, we've yet to see any evidence that this was his actual call sign in the RAF. We reached out to the Royal Air Force for comment and will update this article if more information becomes available.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]