["About this rating", "President Trump rescinded a rule that would have provided a new way to enforce existing background check restrictions on gun sales by allowing a transfer of information from one agency to another.", "President Trump's action did not completely eliminate background checks for gun purchases (by the mentally ill or anyone else).", "In the wake of a horrific school shooting in Parkland, Florida, that left 17 dead in February 2018, media renewed focus on an Obama-era regulation repealed in the early months of the Trump administration. That rule would have given the National Instant Criminal Background Check System, which is used for gun sales, access to Social Security Administration data including the names of individuals receiving certain federal mental health benefits.", "As we explained in a 17 February 2017 article, this rule — which never went into effect before being rescinded — did not change any existing laws regulating who is allowed to purchase guns. It merely would have provided a new way to enforce existing restrictions on gun sales by allowing a transfer of information from one agency to another. There are now, and have been for some time, laws that seek to limit gun sales to anyone “who has been adjudicated as a mental defective or who has been committed to a mental institution” per Title 18 section 922(g) of the United States Code. However, according to the Associated Press:\n\nThe Obama rule would have prevented an estimated 75,000 people with mental disorders from being able to purchase a firearm. It was crafted as part of Obama’s efforts to strengthen the federal background check system in the wake of the 2012 massacre of 20 young students and six staff at Sandy Hook Elementary School in Newtown, Connecticut.\n\nThe rule was rescinded using a legal procedure called the the Congressional Review Act, which, prior to the Trump Administration, was obscure and little-used. It allows regulations passed in the final days of one administration to be rescinded with a simple majority vote in both chambers of Congress during the first 60 days of a new administration. The Senate sent their repeal of the Obama-era measure for Trump’s signature on 15 February 2017 — almost a year before the Parkland shooting to the day — and Trump signed it the next week, on 28 February 2017.\nWhile the law did not change who is required to be the subject of background checks, it is true that Trump signed the repeal of a measure that would have plausibly prevented certain classes of mentally ill people from purchasing firearms by allowing a new data source to be included the system that runs those background checks. As such we rank the claim mostly true.", "As we explained in a 17 February 2017 article, this rule — which never went into effect before being rescinded — did not change any existing laws regulating who is allowed to purchase guns. It merely would have provided a new way to enforce existing restrictions on gun sales by allowing a transfer of information from one agency to another. There are now, and have been for some time, laws that seek to limit gun sales to anyone “who has been adjudicated as a mental defective or who has been committed to a mental institution” per Title 18 section 922(g) of the United States Code. However, according to the Associated Press:", "The Obama rule would have prevented an estimated 75,000 people with mental disorders from being able to purchase a firearm. It was crafted as part of Obama’s efforts to strengthen the federal background check system in the wake of the 2012 massacre of 20 young students and six staff at Sandy Hook Elementary School in Newtown, Connecticut.", "The rule was rescinded using a legal procedure called the the Congressional Review Act, which, prior to the Trump Administration, was obscure and little-used. It allows regulations passed in the final days of one administration to be rescinded with a simple majority vote in both chambers of Congress during the first 60 days of a new administration. The Senate sent their repeal of the Obama-era measure for Trump’s signature on 15 February 2017 — almost a year before the Parkland shooting to the day — and Trump signed it the next week, on 28 February 2017.", "While the law did not change who is required to be the subject of background checks, it is true that Trump signed the repeal of a measure that would have plausibly prevented certain classes of mentally ill people from purchasing firearms by allowing a new data source to be included the system that runs those background checks. As such we rank the claim mostly true.", "Birch, Audra D.S. and Patricia Mazzei.   “U.S. Death Toll Is at 17 and Could Rise in Shooting.” \r\n    The New York Times.   14 February 2018.", "Oh, Inae.   “Trump, Who Made It Easier for Mentally Ill People to Buy Guns, Blames Mental Health Issues for Florida Shooting.”  \r\n    Mother Jones.   15 February 2018.", "Federal Register.   \"Implementation of the NICS Improvement Amendments Act of 2007.\"  \r\n    19 December 2016.", "United States Code.   \"18 U.S.C. Chapter 44 Sec. 922\"  \r\n    Accessed 15 February 2018.", "Freking, Kevin.   “Congress Blocks Rule Barring Mentally Impaired from Guns.”  \r\n    Associated Press.   15 February 2017.", "Vitali, Ali.   “Trump Signs Bill Revoking Obama-Era Gun Checks for People With Mental Illnesses.”  \r\n    NBC News.   28 February 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]