["A couple of different versions of the meme have been doing the rounds on Facebook, including here and here.", "But how true are the three claims made in the meme?", "We asked Switzerland’s national statistics bureau how many guns there are in the country, but were told there are no such statistics on a national level due to the nation’s federal structure. Each of Switzerland’s 26 cantons (states) are responsible for issuing weapons permits and they independently keep tabs on these numbers.", "But the Small Arms Survey, a research centre, estimated in 2017 that there were around 2.3 million firearms in circulation in Switzerland, a country of 8.4 million people.", "While that means the country has one of the higher rates of gun ownership in the world, clearly not every citizen possesses a firearm.", "However, combined with low crime levels, these high rates of gun possession -- the 12th highest among the countries ranked by the Small Arms Survey -- means the country is often held up by pro-gun groups such as the US National Rifle Association as an example of why gun regulation doesn’t need to be stringent.", "All Swiss men over the age of 18 undergo basic military training, after which they remain part of a national \"militia\" until they are around 30. They keep their unloaded service weapons at home during this time, and when their service has ended they have the choice of keeping their personal weapon, as long as they first acquire a permit. Women can also volunteer for national service.", "Others who would like to purchase a gun in Switzerland need a permit issued by authorities in their canton. Such permits can be obtained by people aged over 18 if they’re Swiss or a permanent resident, so long as they have no history of violent or repeated crime and are not suffering from a mental illness that makes then a danger to themselves or others. The rules can be found here in English on this Swiss government website.", "No. As mentioned above, military service is compulsory for men and voluntary for women in Switzerland, which includes mandatory firing practice. However, if you are unable to carry out military service due to a conflict of conscience, you can carry out your service in a civilian role instead, which would not involve gun use.", "Those considered unfit for military service due to physical or mental health problems can carry out a “civil defence” role instead -- spending 368 days over a period of 12 years working in a public service role or on an agricultural project.", "Applications to carry a weapon are only granted if the person can prove that a weapon must be carried as well as if they pass an exam on how to use weapons.", "It’s difficult to find statistics that allow us to compare countries directly with each other. But an academic study published in August 2018 estimated Switzerland’s rate at 2.8 gun deaths per 100,000 people, compared to the US's rate of 10.6. Germany records a rate of 0.9 and Japan a rate of 0.2 on the report. So, Switzerland has one of the lowest rates of death by gun in the world -- but not the lowest.", "The Swiss Federal Statistics Bureau records state that in 2016, 229 deaths were a result of firearms -- all but 17 of them suicides. The latest statistics available (in French, German and Italian) showed that only 1.2 percent of serious injuries in Switzerland are caused by firearms.", "Switzerland is set to hold a popular vote in May 2019 on whether or not the country should tighten its gun control laws in line with the decision undertaken by the European Union to do so.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]