["Jack Kingston and David Perdue must hope voters remain angry about the tepid economy and Congressional  inaction.", "Perdue has tried to tap into the latter, going after his opponent in the tight GOP runoff race for U.S. Senate as an ineffective Washington insider.", "Kingston has responded with a populist theme, attacking Perdue’s time as CEO of Pillowtex, a troubled North Carolina textile firm that went under shortly after he left in 2003.", "\"Perdue mismanaged Pillowtex and nearly 8,000 people got laid off,\" a Kingston ad says, noting Perdue got \"rich\" from the job.", "With Perdue making much of his business background, his tenure at a firm in the state next door seems prime Truth-O-Meter material.", "The timeline that details that tenure dates back to 1887, when Cannon Mills began operations in North Carolina that would gradually become the world’s largest producer of textiles such as sheets and towels.", "In 1997, Dallas-based Pillowtex bought the firm, which had become Fieldcrest Cannon, according to a 2004 University of North Carolina study about the plant closing.", "At the time, Pillowtex was in a leading market position for five textile categories: bed pillows, down comforters, mattress pads, blankets and throws.", "Pillowtex could not avoid technology changes that resulted in a loss to domestic textile manufacturing. The UNC study found mismanagement, such as excessive debt, contributed to the company and the  industry.", "In November 2000, Pillowtex filed for bankruptcy after defaulting on a $650 million bank loan.", "The firm emerged from bankruptcy in May 2002. Perdue arrived in July on the heels of sneaker success, having revived Reebok’s finances as CEO.", "Perdue told Pillowtex top leaders his plan was to improve sales through aggressive marketing and moving more work overseas, according to a Charlotte Observer investigation. A similar game plan catapulted his career at Sara Lee, which closed dozens of plants (including four in Georgia) while adding work in Asia.", "But the company lost $27 million in the seven months after coming out of bankruptcy. Shortly after arriving, Perdue and top managers also found between $40-$50 million in pension liabilities missed in bankruptcy proceedings.", "In March, 2003, Perdue left Pillowtex to become chief at Dollar General. Pillowtex shut down four months later. About 7,650 people lost their jobs nationwide, including 300 people who had been laid off in the first bankruptcy.", "\"I wouldn’t call that turning things around the way most Georgians would want this country turned around,\" said Kingston spokesman Chris Crawford. \"If those are the kinds of results an outsider is going to deliver, let’s keep him on the outside.\"", "But is Perdue to blame for the closure? He served as Pillowtex’s third leader in two years, as it was emerging from bankruptcy brought on by overwhelming debt and a changing industry.", "Perdue told The Atlanta Journal-Constitution that the missed liabilities killed his plans for a turnaround   – and any need for his leadership.", "\"I was not given the opportunity to turn it around as I had planned,\" Perdue said. \"There were factors beyond my control.\"", "The experience didn’t hurt Perdue’s career, given his jump to Dollar General. It also didn’t hurt his bottom line: records show he made $1.7 million for his brief leadership stint at Pillowtex at a time when people were losing their jobs.", "And that is the point Kingston misses in his claim. Pillowtex had laid off hundreds of workers and sought bankruptcy protection before Perdue ever arrived. It was a firm in bad shape that hired a business leaders known for rejuvenating industries – often through job losses.", "Investors don’t view that strategy as mismanagement, even if populists would object to it. Kingston would have been on firmer ground to make the populist point and let voters decide the merits.", "But the claim of mismanagement is an overreach. Even the loss of jobs after Perdue left – closer to 7,000 – is overstated from what is sure a massive number.", "We rate Kingston’s statement as Mostly False.", "Jack Kingston ad, What I Do, July 1, 2014.", "Community Response to the Pillowtex Textile Kannapolis Closing, University of North Carolina, 2004", "Atlanta Journal-Constitution, \"David Perdue business record mixed,\" May 4, 2014", "The Charlotte Observer, \"Perdue touts business record in Georgia Senate bid,\" July 12, 2014", "Los Angeles Times, \"Pillowtex to Liquidate; 6,450 Workers Fired,\" July 31, 2003", "USA Today, \"Former Cannon Mills owner wins auction for Pillowtex,\" Dec. 10, 2004", "The Charlotte Observer, \"Ex-Pillowtex runs for U.S. Senate,\" July 15, 2013", "Interview with David Perdue, July 11, 2014", "Interview with Chris Crawford, spokesman for Jack Kingston, July 9, 2014", "The Charlotte Observer four-part investigative series on Pillowtex", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]