["By Robert Farley", "Posted on August 9, 2018", "In a recent tweet, President Donald Trump said the Trump Tower meeting between his son, other campaign officials and a Russian attorney connected to the Kremlin, which Trump acknowledged was “to get information on an opponent,” was “totally legal and done all the time in politics.”", "Or, as his attorney Jay Sekulow put it on ABC’s “This Week” on Aug. 5: “The question is, ‘What law, statute or rule or regulation’s been violated?’ Nobody’s pointed to one.”", "But some legal experts disagree. They argue the meeting may have violated election laws or could have amounted to conspiracy to defraud the government.", "Trump’s tweet on Aug. 5 pushed back against a Washington Post story that said the president was privately fretting that his son, Donald Trump Jr., “inadvertently may have wandered into legal ­jeopardy.”", "Fake News reporting, a complete fabrication, that I am concerned about the meeting my wonderful son, Donald, had in Trump Tower. This was a meeting to get information on an opponent, totally legal and done all the time in politics – and it went nowhere. I did not know about it!", "— Donald J. Trump (@realDonaldTrump) August 5, 2018", "Here we explore the possible legal ramifications for the president and his son.", "At issue is a June 9, 2016, meeting in which Donald Trump Jr.; Paul Manafort, then Trump’s campaign chairman; and Jared Kushner, Donald Trump Sr.’s son-in-law, met at Trump Tower with Russian lawyer Natalia Veselnitskaya, who, the New York Times said, “has connections to the Kremlin.”", "In emails exchanged with Trump Jr. to arrange the meeting, music publicist Rob Goldstone said the meeting was to “provide the Trump campaign with some official documents and information that would incriminate Hillary [Clinton] and her dealings with Russia and would be very useful to your father [Trump Sr.]. This is obviously very high level and sensitive information but is part of Russia and its government’s support for Mr. Trump.” The younger Trump responded, saying, “[I]f it’s what you say I love it especially later in the summer.”", "The following year, on July 8, 2017, when the New York Times broke the story of Donald Trump Jr. arranging the Trump Tower meeting, the younger Trump released a statement saying it was a “short introductory meeting.” He said, “We primarily discussed a program about the adoption of Russian children that was active and popular with American families years ago and was since ended by the Russian government, but it was not a campaign issue at the time and there was no follow up.”", "The following day, when the Goldstone emails came to light, Donald Trump Jr. said, “[T]he woman [Veselnitskaya] stated that she had information that individuals connected to Russia were funding the Democratic National Committee and supporting Mrs. Clinton. Her statements were vague, ambiguous and made no sense. No details or supporting information was provided or even offered. It quickly became clear that she had no meaningful information.”", "On ABC’s “This Week” on Aug. 5, Jay Sekulow, one of the president’s attorneys, was asked about Trump’s tweet that the meeting was legal.", "“Well, the question is, how would it be illegal? I mean, the real question here is, would a meeting of that nature constitute a violation — the meeting itself constitute a violation of the law?” Sekulow asked. “The question is what law, statute or rule or regulation’s been violated? Nobody’s pointed to one.”", "The Federal Election Campaign Act, enshrined in the federal code, prohibits foreign nationals, either “directly or indirectly” from making “a contribution or donation of money or other thing of value” to a campaign. It also makes it illegal for a person to “solicit, accept, or receive a contribution or donation” from a foreign national.", "The key part regarding the Trump Tower meeting may hinge on the phrase “other thing of value.”", "“Yes, there could be crimes here,” David Sklansky, who teaches criminal law at Stanford, told us. “Soliciting campaign assistance from a foreign agent is illegal, although it is unclear whether opposition research counts as assistance for this purpose.”", "Bob Bauer, a former White House counsel under President Barack Obama who now teaches at New York University Law School, argued in the Washington Post that it does, in this case, count as a “thing of value.”", "“The statute’s written very, very broadly. It applies to promises of support — promises express or implied,” Bauer said. “It applies to independent expenditures, meaning those with express advocacy. It applies to any expenditure, meaning those that may not be express advocacy expenditures but are for the purpose of influencing the federal election. It applies to disbursements. It is extremely broad.”", "But not all legal experts agree that damaging information on Clinton would be deemed a “thing of value” for legal purposes. In a blog post for the Washington Post, Eugene Volokh, a law professor at UCLA, argues that if “politically useful information about a candidate’s opponent is in general a thing of value” then the law is legally “substantially overbroad” and unconstitutional. And if, he argues, a “thing of value” does not include information, “then Donald Trump Jr.’s expression of willingness to accept such information from foreigners (including ones linked to foreign governments) wouldn’t be covered by the statute.”", "“The phrase ‘contribution or donation’ sounds like a gift to help fund the campaign or give them something they otherwise would buy,” Orin Kerr, a University of Southern California professor and former federal prosecutor, told the New York Times.", "Even if it were determined that the opposition research offered by the Russians did not amount to a “thing of value,” it doesn’t mean Trump Jr. and others are in the clear, Sklansky told us.", "“Conspiring to hide campaign activity from the FEC [Federal Election Commission], or conspiring to hide the activities of a foreign agent from the DOJ [Department of Justice], could be a conspiracy to defraud the United States, depending on the details,” he said.", "The special counsel’s office charged three Russian organizations and 13 Russian nationals in February with violating U.S. criminal laws to interfere in the 2016 U.S. elections, which included spending “millions of dollars” on a pro-Trump social media campaign. The indictment specifically alleged the defendants conspired to defraud the United States “by impairing, obstructing, and defeating the lawful functions of the Federal Election Commission, the U.S. Department of Justice, and the U.S. Department of State in administering federal requirements for disclosure of foreign involvement in certain domestic activities.”", "With regard to the FEC, the “lawful functions” the conspirators were alleged to have interfered with, the indictment states, were its “statutory duties of providing the American public with accurate data about the financial activities of individuals and entities supporting federal candidates, and enforcing FECA’s limits and prohibitions, including the ban on foreign expenditures.”", "And then there is the question of obstruction, and whether Trump Jr.’s initial, misleading response to the media about the purpose of the meeting — which Trump’s legal team later acknowledged the president “dictated” — could be construed as part of a pattern of obstruction.", "“It’s a crime to corruptly attempt to obstruct a lawful criminal investigation,” Sklansky said. “It’s very clear that President Trump has tried repeatedly to derail the investigation into ties between his campaign and Russia; the question has been why — was it because he honestly believed there was nothing there, or because he knew there was something there? The fact that the meeting was really an effort to get dirt from the Russians on Clinton, and that Trump had his son to lie about it, is strong evidence that it’s the latter–which is to say, it’s strong that President Trump is guilty of obstruction of justice.”", "That’s a legal opinion, and as we said, there are other legal experts who disagree. But suffice to say Trump’s proclamation that the meeting was “totally legal” is a matter of dispute among legal scholars.", "Almost all legal scholars, however, warn not to put much stock in the recent claims by Trump and his attorneys that “collusion is not a crime.”", "“I have been sitting here looking in the federal code trying to find collusion as a crime,” Trump’s personal attorney Rudy Giuliani said in a July 30 “Fox & Friends” interview. “Collusion is not a crime.” The same day, on CNN’s “New Day,” Giuliani said, “You start analyzing the crime — the hacking is the crime.”", "(Giuliani was referring to the July 13 indictment that charged 12 Russian military intelligence officers with hacking into “the computer networks of the Democratic Congressional Campaign Committee, the Democratic National Committee, and the presidential campaign of Hillary Clinton.”)", "In a tweet, the president repeated Giuliani’s claim that “collusion is not a crime.”", "Collusion is not a crime, but that doesn’t matter because there was No Collusion (except by Crooked Hillary and the Democrats)!", "— Donald J. Trump (@realDonaldTrump) July 31, 2018", "“Don’t be fooled by word games,” Victoria Nourse, a professor at Georgetown Law, told us via email. “There is no legal term ‘collusion.’ The legal term for collusion is the crime of conspiracy. If you agree to kill someone and take a step toward that (hired the killer, or encouraged the killer, met with the killer) you are guilty of conspiracy to commit murder.", "“So, if you agree to defraud the U.S. or disrupt the elections (even if it’s not with the Russians) and you take a step forward (any step….meetings, payments etc.), that’s conspiracy,” Nourse said.", "Stephen Schulhofer, a law professor at New York University, said the act of collusion can be either benign or criminal, depending on the circumstance.", "“One of the most commonly used provisions of the U.S. Code, 18 USC §371, makes it a federal crime for two or more people to conspire ‘to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose,'” Schulhofer told us via email. “Agreeing (colluding) with someone for a perfectly lawful purpose, like arranging a game of golf or tennis, is not a crime. But colluding with the Russians, i.e. agreeing to cooperate, encourage or assist them in any way in pursuing anything they were doing that was illegal, is most certainly a crime.”", "Or, as Sklansky told us, “Whether it is a crime depends on what you are colluding about.”", "Sklansky also challenged Giuliani’s assertion that the only real crime was the hacking of the DNC servers.", "“It’s a red herring to suggest that hacking is the only crime that could have been committed here,” Sklansky said.", "Hacking is one crime, he said, but you don’t have to be guilty of hacking to be guilty of obstruction of justice or criminal conspiracy or soliciting a foreign agent in a campaign.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]