["About this rating", "A July 2010 guest post on a Scientific American blog incorrectly reported the results of a Swedish study that, in turn, made the largely speculative hypothesis that some forms of cancer are more frequent on the left side of the body because the right side (which is most people’s preference for a side to sleep on) gets protection from the myriad electromagnetic FM and TV radio waves already present in the environment due to the dampening influence of the metal coils in a mattress. As described in the study’s abstract:", "Here we show that a high prevalence of breast cancer and melanoma on the left side of the body may be a logical consequence of sleeping in beds having mattresses containing wave-reflecting metal springs. We found that people tend to sleep for longer periods on their right side, apparently to avoid disturbance by the heartbeat. This puts the left side farther away from the field-attenuating influence of the metal springs in the mattress; thus the left side will spend, on average, more time exposed to stronger combined fields from incident and reflected waves.", "For reasons that remain unclear, the Scientific American blog post (which remains uncorrected), came to the opposite conclusion of what the study was trying to argue, holding that coil-spring mattresses amplified, rather than attenuated, waves of electromagnetic radiation:", "Thus, as we sleep on our coil-spring mattresses, we are in effect sleeping on an antenna that amplifies the intensity of the broadcast FM/TV radiation. Asleep on these antennas, our bodies are exposed to the amplified electromagnetic radiation for a third of our life spans. As we slumber on a metal coil-spring mattress, a wave of electromagnetic radiation envelops our bodies so that the maximum strength of the field develops 75 centimeters above the mattress in the middle of our bodies. When sleeping on the right side, the body's left side will thereby be exposed to field strength about twice as strong as what the right side absorbs.", "The original study came up with their explanation by 1) compiling data from the Swedish Cancer Registry on the incidence of left versus right breast cancer for the period of 1970–2006; 2) performing a literature review to see if there was a common preference for what side of the body people like to sleep on; 3) plotting cancer incidence and FM transmitters together; and 4) looking at the incidence of left versus right breast cancer in a country—Japan—without metal springs in their beds for comparison.", "Their review found a slight preference for both genders to sleep on the right side, a slightly higher probability that breast cancer and melanomas develop on the left side, and higher cancer rates in places with more than one transmitter. They also found no preference for either side with respect to cancer in Japanese individuals.", "Even though the World Health Organization (WHO) does not consider radio wave transmissions a risk factor for cancer in the first place, the paper presented speculation based on deeply imperfect data with equally imperfect conclusions. It made no direct investigation into the mechanisms its authors proposed.", "More to the point, however, the claim presented in the Scientific American blog post was not even an accurate portrayal of the authors’ speculative hypothesis. No scientist is actually suggesting that a passive, unelectrified network of coils could somehow amplify a signal without the input of power.", "But peddlers of pseudoscience and misinformation frequently cite this erroneous analysis (and not the study itself) as evidence for the harms of electromagnetism. Dr. Mercola, prolific purveyor of misinformation and supplements, had this to say about the study (which he clearly did not read): \"[Y]our box spring mattress actually acts like an antenna; attracting and amplifying whatever radiation might be zipping through your bedroom.\"", "You may want to lose sleep over a doctor misrepresenting health risks to millions of followers, but you certainly shouldn’t lose any sleep over the radiation-amplifying coils in your unpowered mattress.", "Fields, Douglas, R.   \"Left-sided Cancer: Blame Your Bed and TV?\"\r\n    Scientific American Guest Blog.   2 July 2010.", "Hallberg, Örgan, and Johansson, Olle.   \"Sleep on the right side—Get cancer on the left?\"\r\n    Pathophysiology.   3 August 2009.", "Mercola, Joseph.   \"What's Hiding in Your Mattress?\"\r\n    mercola.com.   30 December 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]