["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Getty Images", "Children do contract the coronavirus. Hundreds of cases in people 17 and under have been reported in Wisconsin, and tens of thousands in the U.S.", "But early evidence shows that children are not at higher risk for the virus, and in most cases, experience milder symptoms than adults.", "There are several diseases that are especially tough on kids.", "Measles, chickenpox and even this year’s most common strain of influenza in Wisconsin target children and can cause serious, even life-threatening complications.", "So the world breathed a sigh of relief when the first reports about children and COVID-19 seemed to show that this novel coronavirus wouldn’t be one of those diseases.", "A preliminary report from the U.S. Centers for Disease Control and Prevention published April 6, 2020, found that children make up only a small portion of U.S. coronavirus cases thus far and are less likely to become seriously ill.", "As the debate continues about how quickly to relax restrictions and reopen the country, that information has become a key part of the reopen-now argument.", "State Rep. Janel Brandtjen, R-Menomonee Falls, dove into the issue in the comments section of an April 28, 2020 post on her Facebook page that criticized Gov. Tony Evers, a Democrat, for not opening playgrounds and restrooms at parks.", "Replying to a commenter, she wrote, \"In fact, New York is considering opening schools because children don’t seem to be getting this virus.\"", "A few days later, though, New York Gov. Andrew Cuomo declared that all schools in the state would be closed for the remainder of the academic year. (Evers made the call weeks earlier that Wisconsin schools would be closed through June.)", "But is Brandtjen right about the rest of her claim — that \"children don’t seem to be getting this virus\"?", "As of May 21, 2020, the CDC reported that 40,457 of the country’s more than 1 million coronavirus cases occurred in patients 17 and under.", "To be sure, that is a tiny fraction of overall cases, clocking in at just 3% of the 1.2 million cases listed by the CDC. But it’s still more than 40,000 children who have gotten sick with COVID-19, in the official count. Others, of course, may have gotten sick and never been tested.", "In Wisconsin, the same pattern holds: 257 cases have been reported in patients 9 and under, and 695 in patients ages 10-19 (the state Department of Health Services uses different age breakdowns than the CDC).", "The two age groups account for just 7% of the state’s total coronavirus cases, and even less for whom the disease turned more serious. Just 32 people under the age of 20 have been hospitalized by the virus, according to the DHS website.", "Although the numbers are small, they’re there — and there, too, are the rare cases that have turned fatal. Wisconsin has avoided the death of a child from the virus so far, but nationally, a handful of deaths have occurred in pediatric cases.", "So, children do seem to be getting this virus.", "But what early data and the raw numbers show is that they seem to be contracting it far less, and less seriously, too.", "That’s what Brandtjen pointed to when asked to back up her claim. In a phone call with PolitiFact Wisconsin she said her choice of words in saying that children don’t \"seem\" to be getting the virus acknowledged that nuance.", "Brandtjen cited a CDC webpage on kids and coronavirus which notes that children don’t appear to be at higher risk, and most U.S. cases appear in adults.", "She also quoted a Children’s Hospital of Wisconsin news release stating that \"one of the main understandings was that (COVID-19) didn’t affect healthy kids as seriously as adults.\" In the release, the hospital wrote that only a handful of children there tested positive for the virus, and all went home after brief hospitalizations.", "The Children’s release, however, brings up another distinction in the conversation about kids and COVID-19: a new, more serious disease known as Pediatric Multisystem Inflammatory Syndrome, or PIMS.", "No kids at Children’s have presented with PIMS symptoms, the release says, and research on the link between PIMS and the coronavirus is still limited. But doctors in New York, which as of May 12 was investigating 102 cases of the syndrome and three deaths, suspect COVID is involved. Though rare and treatable, it’s likely another way the virus is affecting kids.", "And one more bit of nuance: As schools across the country mull over opening their doors this fall, research is still being done on whether and how much children can spread the virus. The answer could be critical to the discussion of what reopening schools, day care centers and other places where kids gather should look like moving forward.", "Brandtjen claimed \"Children don’t seem to be getting this virus.\"", "Hundreds of kids in Wisconsin, and tens of thousands in the U.S., have fallen ill with COVID-19.", "That said, children do not seem to be contracting the virus as much, or as seriously, as the rest of the population. That’s an important nuance, particularly amid such a contentious debate.", "We rate Brandtjen’s claim Mostly False.", "Email exchange and phone conversation with Rep. Janel Brandtjen, May 21, 2020", "World Health Organization, \"Measles,\" Dec. 5, 2019", "Johns Hopkins Medicine, \"Chickenpox in Children,\" accessed May 21, 2020", "Appleton Post Crescent, \"Wisconsin's serious flu cases are very high for this time of year, and the most common type is tough on children,\" Jan. 6, 2020", "Centers for Disease Control, \"Coronavirus Disease 2019 in Children — United States, February 12-April 2, 2020,\" April 6, 2020", "New York Times, \"New York closes schools through end of academic year,\" May 1, 2020", "Milwaukee Journal Sentinel, 'Teachers are pretty broken-hearted': COVID-19 closes schools but learning to continue,\" April 16, 2020", "Centers for Disease Control, \"Cases in the U.S.,\" accessed May 21, 2020", "Wisconsin Department of Health Services, \"COVID-19: Wisconsin cases,\" accessed May 21, 2020", "Washington Post, \"‘The numbers are low until it’s your child’: The coronavirus can be deadly for children, too,\" April 21, 2020", "Centers for Disease Control, \"Keep children healthy during the COVID-19 outbreak,\" accessed May 21, 2020", "Children’s Wisconsin, \"The new way COVID-19 might be affecting kids,\" accessed May 21, 2020", "New York Times, \"What we know about the Covid-related syndrome affecting children,\" May 19, 2020\nNew York Times, \"New studies add to evidence that children may transmit the coronavirus. May 5, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]