["“Hundreds of thousands Kashmiris took street yesterday in Indian occupied Kashmir to liberate their land from India… One of Kashmiris requested to spread this video all over the world as Indian media did not cover such a huge rally. So, please share as much as possible.”", "The above message has been shared along with a video clip showing hundreds of women in hijab, marching down a street. The duration of the video clip is 39 seconds.", "Hundreds of thousands Kashmiris took street yesterday in Indian occupied Kashmir to liberate their land from India… One of Kashmiris requested to spread this video all over the world as Indian media did not cover such a huge rally. So, please share as much as possible. pic.twitter.com/NTetXeW6gc", "— میری پروفائل میرا پاکستان (@farrukh56251314) August 7, 2019", "The video with the accompanying narrative has gone viral on Twitter and Facebook, with several individuals posting it on their timelines.", "Alt News has received requests for verification of this claim on the Alt News app.", "The march by women, shown in the video, is not related to the recent developments in Kashmir after article 370 was revoked by the Union Government in August this year. Alt News broke up the video into several key frames, and reverse searched one of the frames. We found that this video had been posted on YouTube in December 2018 on the channel PMLN Videos. Pakistan Muslim League (Nawaz) (PMLN) is a political party based in Pakistan, founded by Nawaz Sharif.", "We also found this video posted in tweets from March 2019. In the video, at 0:38 minutes, we found a banner which said ‘Baramulla Central Cooperative Bank Ltd Branch, Hajin’. This suggests that the video is from Baramulla district in J&K.", "On further scrutiny based on this information, Alt News found that this gathering was a funeral procession which took place in Hajin area of North Kashmir. According to a News18 report of December 9, 2018, “Three militants were gunned down by the forces in Mujgund, on the outskirts of Srinagar, after an 18-hour long gun battle on Sunday. Among the slain militants was 14-year-old Mudasir Rashid Parray of Bandipora district, whose photo holding an AK-47 surfaced a week ago…The other two militants were identified as Saquib Bilal (17), also a resident of Bandipora district, and a Pakistani militant, Ali Bhai. “", "Alt News also found a photograph of the funeral procession posted on the stock photo site, Alamy.", "It may be noted that the video is NOT with regard to the recent developments in Kashmir. It has been available on the internet since at least December 2018.", "Update: The article has been updated to include more information about the video.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]