["On April 13, several media outlets carried reports on a CCTV footage of a group of women spitting in front of houses in Rajasthan’s Kota. Mainstream media reported it as a ‘conspiracy of spitting’. It is noteworthy that the government has imposed a complete ban on public spitting and public urination in the wake of the coronavirus pandemic.", "#Breaking-राजस्थान के कोटा में कुछ मकानों के सामने महिलाओं के थूकने से मचा हड़कम्प. CCTV में कैद हुई पूरी वारदात@nehapant19 pic.twitter.com/rrE0H2D4E4", "— News18 India (@News18India) April 13, 2020", "Soon after the video was aired by leading channel, several prominent social media users picked it up and shared it with an anti-Muslim angle. Twitter user Deepak Sharma, who is followed by BJP Delhi spokesperson Tajinder Pal Singh Bagga, tweeted the clip with the following caption: “#थूकलमानो का नया कारनामा सुनो पॉलिथीन में थूककर लोगों के घरों में फेंक रही बुरकेवालियाँ हद है जाहिलों – क्या ये सब देखकर तुम लोगों का ज़मीर न थूकता तुमपर कि कैसे थुकैले मज़हब में जन्म हो गया तुम्हारा.” This translates to: “Listen to the new deed of #Thukalmano (a wordplay on ‘Musalmano’) burqa-clad women are collecting their spittle in polyethene bags and throwing them inside houses. The uncivilised has crossed limits…”", "लो अब #थूकलमानो का नया कारनामा सुनो", "पॉलिथीन में थूककर लोगों के घरों में फेंक रही बुरकेवालियाँ", "हद है जाहिलों – क्या ये सब देखकर तुम लोगों का ज़मीर न थूकता तुमपर कि कैसे थुकैले मज़हब में जन्म हो गया तुम्हारा@AjazkhanActor@_sayema@khanumarfa pic.twitter.com/Wr5lQi3ayS", "— Deepak Sharma (@TheDeepak2020) April 13, 2020", "Another user named Sudhir Mishra shared the clip. He is followed by Bagga and the Office of Defence Minister Nirmala Sitharaman. Ankur Singh shared the video and wrote, “Women being used to throw spit inside houses in Kota, Rajasthan. Who’s making them do this?”", "Women being used to throw spit inside houses in Kota, Rajasthan.", "Who’s making them do this? pic.twitter.com/D8dQ7v8IZH", "— Ankur Singh (@iAnkurSingh) April 13, 2020", "One Ridhima Pandey tweeted the video and claimed that COVID-19 was intentionally spread by those who are supported by anti-social elements.", "According to a report in The Times of India the incident indeed took place in Rajasthan’s Kota. Five women were held for throwing spit bags into houses in Vallabhvadi area under Gumanpura police station. “During preliminary investigation, the women admitted that they had thrown spit filled polythene bags into the houses over being denied alms. However, they denied spreading coronavirus infection,” says the report.", "“The five women, identified as Mala Bawari (30), Anariya Bawari (65), Dulari Bawari (35), Asha Bawari (35) and Chanda Bawari (20), residents of Bapu Kacchi Basti in Kunhari, were on Tuesday produced before the court that ordered to send them to jail under 14-day judicial custody,” SHO Gumanpura Manoj Sikarwar has been quoted in the report.", "TV9 Bharatvasrh aired a video report on the incident which carries a statement by SP Gaurav Yadav: “We traced the women within 24 hours and rounded them up for investigation. The women are residents of Kunhari area and hail from the Bawari community. They beg for alms in the area. They spat after being denied alms. Till now we haven’t found any link with corona, the reason being that no positive cases have been reported in the area. The area where positive cases were reported is quite far.”", "A local channel ‘Kota News’ also carried a video report along similar lines. The channel spoke with SHO Sikarwar who said that the investigation has not found that the act was carried out to spread coronavirus.", "Therefore, the CCTV footage was first sensationalised by the media and subsequently communalised on social media.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]