["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida Sen. Marco Rubio delivered the Republicans’ response to the State of the Union address, criticizing President Barack Obama on policy but also style.\n\n\"Any time anyone opposes the president’s agenda, he and his allies usually respond by falsely attacking their motives,\" Rubio said. He named several examples, including the sweeping cuts to military and other spending set to take effect unless Congress and the president agree on deficit-reduction package.\n\n\"Tonight, he even criticized us for refusing to raise taxes to delay military cuts – cuts that were his idea in the first place,\" Rubio said.\n\nFor the record, Obama didn’t make that specific criticism in his speech, but here we’re focusing on the second half of Rubio’s statement about where the idea of the cuts originated.\n\nWe have examined claims similar to this before, when Mitt Romney made the charge during the presidential campaign, and when Obama turned the tables and blamed the sequester on Congress. Let’s review.\n\nIn search of a budget deal\n\nIn 2011, the federal government was nearing its legal debt limit, which meant Congress had to authorize a higher level for borrowing. Raising the debt limit (also called the debt ceiling) was in some ways symbolic: Congress has the power of the purse, and the decisions to spend the money had already been made.\n   \nBut that didn’t stop a showdown in the summer of 2011. House Republicans insisted that actual spending cuts go along with an increase to the debt limit. House Speaker John Boehner led negotiations with the White House, and at first the sides seemed to be moving toward a wide-ranging overhaul of the federal budget, dubbed the \"grand bargain.\"\n   \nThe closed-door negotiations fell apart, though, and a flurry of finger pointing ensued. Some observers blamed Boehner for being unable to deliver his own Republicans on a deal, thanks to tea party opposition to any new taxes. Others blamed Obama for his inexperience, for not cultivating relationships with Republicans and for tactical mistakes at negotiating. Some blamed both.  \n   \nAt any rate, Republicans and Democrats came to a less ambitious agreement to raise the debt limit through the Budget Control Act of 2011. The law found approximately $1.2 trillion in budget cuts spread over 10 years. But it also directed Congress to find another $1.2 trillion through a Joint Select Committee on Deficit Reduction. This 12-member committee became known as \"the super-committee.\"\n   \nThe super-committee was supposed to meet and agree on a deficit reduction package by Nov. 23, 2011. Their proposal -- which could include tax increases, spending reductions or both -- would then get a filibuster-proof, up-or-down vote in Congress.\n   \nAs an incentive to action, the law included an unusual kind of budget threat: If the super-committee couldn’t agree on a package, or if Congress voted it down, then automatic, across-the-board cuts would go into effect, with half of those cuts hitting defense. These automatic cuts are referred to as \"sequestration.\"\n   \nLo and behold, the super-committee didn’t agree on a deficit reduction package, so Congress never voted on it. More deadlines have come and gone, and smaller budget patches have been passed. But the sequester is looming again, with big cuts set to hit March 1.\n\nWhose idea?\n\nSome of the most detailed reporting on sequestration is from Washington Post reporter Bob Woodward and his book The Price of Politics. Woodward’s reporting shows clearly that defense sequestration was an idea that came out of Obama’s White House.\n   \nThe intention, however, was to force Republicans to negotiate, not to actually put the cuts into effect.\n\nWoodward summarizes the thoughts of the Obama team: \"There would be no chance the Republicans would want to pull the trigger and allow the sequester to force massive cuts to Defense.\" Democrats, meanwhile, didn’t want to see their favorite domestic programs cut.\n   \nAs the negotiations proceeded, Republicans seemed to think the same thing.\n   \n\"Boehner told the House Republican leadership and other key members not to worry about the sequester … ‘Guys, this would be devastating to Defense,’ he said. ‘This would be devastating, from their perspective, on their domestic priorities. This is never going to happen.’\"\n   \nYet even as the deadline nears (again), it’s clear neither side wants federal spending to plummet.\n\nIn August 2012, the White House Office of Management and Budget (OMB) released a report detailing how sequestration will affect different departments. In its introduction, the OMB repeats the Obama administration’s opposition to the process.\n   \n\"The specter of harmful across-the-board cuts to defense and nondefense programs was intended to drive both sides to compromise. Congress can and should take action to avoid it by passing a comprehensive and balanced deficit reduction package.\n   \n\"As the administration has made clear, no amount of planning can mitigate the effect of these cuts. Sequestration is a blunt and indiscriminate instrument. It is not the responsible way for our nation to achieve deficit reduction.\"\n   \nStill, some people we say that the Obama White House proposed sequestration, so that means Obama owns it.", "Here's what experts told us last fall.", "\"While both parties are culpable for sequestration because the Budget Control Act passed Congress, the president proposed it originally and ultimately owns its outcome,\" said Mackenzie Eaglen, an expert on defense with the conservative American Enterprise Institute who advised the Romney campaign. \"That is because he alone can lead by calling the party leaders together for a resolution today if he wanted as president.\"\n   \nOther see the two parties as co-owners of sequestration, especially since Republicans in Congress voted for the law that set up its possibility. In the House, 174 Republicans and 95 Democrats voted for the law, while 66 Republicans and 95 Democrats opposed it. (Final tally: Passed 269-161.) In the Senate, 28 Republicans and 45 Democrats voted for it, while 19 Republicans and 6 Democrats opposed it. (Final tally: Passed 74-26)\n   \n\"The logic that lays the blame for sequestration at Obama's feet, because he negotiated the BCA with GOP leaders in Congress, could just as easily apply to those other negotiators, or, indeed, any member of Congress who voted for the BCA in August 2011,\" said Christopher Preble, vice president for defense and foreign policy studies at the libertarian Cato Institute. Preble favors reductions to the defense budget.\n   \nLaura Peterson of Taxpayers for Common Sense also noted that sequestration results from a law passed in the usual manner. \"I think the fact that Congress passed it means it is not a presidential mandate. It was a law that originated in Congress and was sent to the president’s desk,\" she said.\n\nOur ruling\n\nRubio said the defense cuts known that are part of sequestration were Obama’s \"idea in the first place.\"\n\nThat doesn’t tell the whole story -- particularly the fact that Obama does not favor these cuts. The White House proposed them as a means of driving the two sides to a compromise over the deficit, not as a real-world spending plan.\n\nStill, the idea did originate with Obama’s team. We rate Rubio’s statement Half True.", "PolitiFact Florida, \"Obama to blame for defense sequestration, says Romney ad,\" Sept. 21, 2012\n\nPolitiFact, \"Barack Obama says Congress owns sequestration cuts,\" Oct. 22, 2012\n\nCNN, \"CNN Explains: Sequestration,\" Feb. 7, 2013\n\nMitt Romney campaign, A Better Future: Florida - Defense, Sept. 7, 2012\n   \nMitt Romney campaign, Obama’s devastating defense cuts detailed, Sept. 15, 2012\n   \nTHOMAS, the Budget Control Act of 2011, accessed Sept. 20, 2012\n   \nThe White House, OMB Report Pursuant to the Sequestration Transparency Act of 2012 (P. L. 112–155), Sept. 14, 2012\n   \nThe Price of Politics, by Bob Woodward, 2012\n   \nPOLITICO, White House: Sequester 'deeply destructive' to defense, Sept. 14, 2012\n   \nPOLITICO, Bob Woodward book could bolster Republican attack on W.H., Sept. 7, 2012\n   \nThe U.S. Economic Impact of Approved and Projected DOD Spending Reductions on Equipment in 2013, by Dr. Stephen S. Fuller of George Mason University, Oct. 24, 2011\n   \nWashington Post, Inside story of Obama’s struggle to keep Congress from controlling outcome of debt ceiling crisis (excerpt of The Price of Politics), Sept. 8, 2012\n   \nNew York Times, Obama vs. Boehner: Who Killed the Debt Deal?, March 28, 2012\n   \nWashington Post, Obama’s evolution: Behind the failed ‘grand bargain’ on the debt, March 17, 2012\n   \nABC News, Woodward: 'Gaps' in Obama's Leadership Contributed to Debt Deal Collapse, Sept. 10, 2012\n   \nInterview with Laura Peterson, Taxpayers for Common Sense, Sept. 20, 2012\n   \nEmail interview with Mackenzie Eaglen of the American Enterprise Institute, Sept. 20, 2012\n   \nEmail interview with Christopher Preble of the Cato Institute, Sept. 20, 2012\n   \nEmail interview with Todd Harrison of the Center for Strategic and Budgetary Assessments, Sept. 20, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]