["About this rating", "In late April 2019, several social media users started sharing a quote ostensibly uttered by U.S. President Donald Trump concerning his alleged belief that suicide bombers should get the death penalty:", "The joke here, of course, is that sentencing someone to death who is already dead is a bit redundant, and that if this quote were real, Trump didn't realize the statement is illogical.", "But this is not a genuine quote from the president.", "The idea that he said suicide bombers deserve the death penalty comes from a satirical article published by the website Breaking Burgh in May 2017.", "That article, entitled \"Trump Fires Up Base With Call For Death Penalty For Suicide Bombers,\" contained several fictitious quotes from Trump expressing this illogical viewpoint:", "“Anyone who terrorizes and kills good people by suicide bombing deserves nothing less than the highest penalty, which is to pay with their life.”", "“If you detonate yourself with high explosives in the United States, I will make you regret it. Believe me.”", "“Our vengeance will be swift against those extremists who blow themselves up.”", "Breaking Burgh is a satirical publication. A disclaimer on the website reads: \"Welcome to Breaking Burgh, a satirical blog serving Western Pennsylvania and beyond. In case you read that too quickly, it’s SATIRE, so put that lawyer back in your pocket.\"", "We've encountered a number of such false rumors aimed at mocking Trump's intelligence.", "Breaking Burgh.   \"Trump Fires Up Base With Call For Death Penalty For Suicide Bombers.\"\r\n    27 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]