["“‘Environmentalists’ Say Fracking is Evil. This is where the lithium for their electric cars comes from,” reads the caption on a photo montage shared in multiple Facebook posts, including here here, here and here. The accompanying images show a fracking site surrounded by greenery and an open-pit mine amid a scarred landscape.", "The image has been circulating online since at least 2016, a Facebook search showed, when a post on a page called Oilfield America was shared more than 20,000 times. The montage has gained traction, shared thousands more times, in the last days of the 2020 US presidential election race where energy and the environment have become an issue.", "Environmentalists worry about the level of methane that fracking produces, contributing to global warming, and other dangers.", "US President Donald Trump has positioned himself as a champion of the hydraulic fracturing and fossil fuels industry while former vice president Joe Biden says he wants to limit new fracking projects on federal land and move towards cleaner forms of energy if he were elected.", "The comparison shared on Facebook is, however, misleading.", "The bottom photo in the montage does not show a lithium mine. In fact, it shows Escondida, the world’s largest copper mine located in the Atacama Desert in northern Chile.", "The top photo in the meme can be found on a stock photo website with a caption that reads: “Southwestern Washington County, PA - October 13, 2012: Beautiful autumn aerial view of natural gas drilling rig located in rural Southwestern PA.”", "The extraction of natural gas and oil from deep underground rock using an injection of water and chemicals boomed in the early-2000s leading the US to become the globe’s top oil and gas producer.", "Experts told AFP that lithium and copper production use different methods. Fracking, copper and lithium production all produce negative effects on the environment, although it was difficult to say that one particular industry was more harmful than another, the experts said.", "“It takes as much as half a million gallons of water to produce one ton of lithium using evaporation ponds. The impacts are mostly local, but they cannot be ignored,” Hallie Eakin and Datu Buyung Agusdinata, professor and assistant professor at the School of Sustainability, Arizona State University, told AFP in an email.", "“Although the demand of production and storage of green energy emerged as one answer to avoid the emission of greenhouse gas, the exploitation of natural ecosystems as salt flats for lithium production is not sustainable, clearly,” Carolina F. Cubillos León, co-author of a study on microbiology in lithium brines, said to AFP by email.", "Fracking, however, not only emits carbon emissions responsible for climate change, it also leads to additional negative impact on the environment like potential contamination of drinking water, local air quality degradation, greenhouse gas emissions and ecosystem fragmentation, Eakin and Agusdinata said.", "Alexandru Sonoc, co-author of a study on the recycling capacity of lithium ion batteries, told AFP that production isn’t the only factor that matters when considering the environmental impact of a product.", "“It is important to look at its full life cycle, not just production. Oil and gas are not recyclable. Yes, oil is used to make plastics but their recycling rate is abysmal. Lithium, from lithium ion batteries on the other hand is recycled,” he said via email.", "Lithium can also be extracted from mines but more rarely. A 2018 study said that two thirds of the world’s lithium production is extracted from brine in evaporation pools.", "“In Chile and other countries in South America, lithium is exploited via liquid brines extracted from saline lakes, not from rock. In fact, most of the lithium reserves in the world are in South America,” Cristina Dorador, microbial ecologist at the Biotechnology Department of Antofagasta University in Chile, told AFP in an email.", "Commercialized in 1991, lithium-ion batteries have reduced the transportation industry’s reliance on fossil fuels, especially in electric cars. They’re also used in a wide range of electronics, from smartphones to pacemakers.", "AFP Fact Check previously debunked a similar photo comparison circulating on social media in Canada.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]