["Did President Barack Obama really change Mt. McKinley to \"Denali\" because it's the Kenyan word for \"black power\"? No, no and no.", "Critics of President Barack Obama’s decision to drop President William McKinley as the namesake of America’s tallest mountain say the move is insulting to a great president from Ohio.", "Anonymous social media critics point to a more hidden motive in the mountain’s new name, Denali.", "One image circulating on Facebook accused the president of reaching back to his Kenyan roots for inspiration, claiming that \" ‘Denali’ is the Kenyan word for ‘black power.’ \"", "The meme’s claim is so ridiculous that you wonder if it’s just a bad joke.", "To start, \"Kenyan\" is not a language. The two official languages of Kenya are English and Swahili. Neither of those languages are exclusive to one country, as Swahili is also spoken in a number of different African nations.", "A search of multiple Swahili dictionaries turned up no results for the word \"Denali.\"", "As our fact-checker friends at Snopes found, the Swahili word for \"black\" is \"mweusi,\" and the Swahili word for power is \"nguvu.\"", "That doesn’t amount to \"Denali,\" which has roots in the word \"Deenaalee\" in Koyukon, a native language of Alaska currently spoken by just 300 people. Koyukon is part of the Athabaskan language family, which also includes Navajo and several Apache languages native to the American Southwest.", "\"Deenaalee\" approximately translates to \"the High One,\" according to James Fall, an official at Alaska’s Department of Fish and Game, and James Kari, a linguist at the University of Alaska Fairbanks’ Native Language Center.", "Obama called the name change \"a step to reflect the heritage of Alaska Natives.\"", "While the meme’s claim is ridiculous, we were able to verify that the viral image does depict the real Denali.", "Our ruling", "The meme claims \" ‘Denali’ is the Kenyan word for ‘black power.’ \"", "Nope.", "The word \"Denali\" doesn’t show up in Swahili, one of Kenya’s two national languages. Instead, it’s Koyukon Athabaskan for \"high\" or \"tall.\"", "We rate the meme’s claim Pants on Fire!", "https://www.sharethefacts.co/share/a7790d84-e8d8-45e2-8a6d-303a57f6d11b", "Bab.la Swahili-English Dictionary, accessed Sept. 2, 2015", "The Kamusi Project, Global Online Living Dictionary, accessed Sept. 2, 2015", "Alaska Dispatch News, \"McKinley no more: North America's tallest peak to be renamed Denali,\" Aug. 30, 2015", "Snopes.com, \"Denali Power,\" Aug. 30, 2015", "University of Alaska Fairbanks Alaska Native Language Center, \"Koyukon\"", "University of Alaska Fairbanks Alaska Native Language Center, \"Indigenous Peoples and Languages of Alaska\"", "Alaska Department of Fish & Game, \"Original Alaska Names by the Original People,\" October 2004", "President Barack Obama, tweet Aug. 31, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]