["Sanjay Shinde, taluka unit vice president of NCP, was burnt alive in his car due to a short circuit on October 15. According to news reports, the police said that the incident happened near the Baswant toll plaza on the Mumbai-Agra highway. Since then, social media users have been sharing a video of the incident claiming that Shinde was one of the accused in the Palghar lynching case. Facebook user Narender Singh wrote, “NCP leader Sanjay Shinde, the main murderer of the Palghar Sadhus, burned to death in a car accident.”", "भगवान के यहां देर है अंधेर नहीं पालघर साधुओं की हत्या के आरोपी NCP नेता संजय शिंदे अपनी कार में जिं ज", "भगवान के यहां देर है अंधेर नहीं पालघर साधुओं की हत्या के आरोपी NCP नेता संजय शिंदे अपनी कार में जिंदा जल कर मर गया ।", "प्रकृति अपना उधार ब्याज सहित वसूल करती हैं। आज नही तो कल।", "Posted by Manoj Tiwari For Delhi CM on Thursday, 15 October 2020", "Several Facebook pages, including ‘Manoj Tiwari for Delhi CM‘, ‘Kings of Rajput‘, ‘Raghavacharya Ji Maharaj Ayodhya‘, and users Chhagan Prajapat and Pankaj Mehra shared the video.", "The clip and accompanying claims have since spread to Twitter as well. A number of users, including @nandaji1958, @TheDeepak2020In, @AchAnkurArya, @MandirGuy, @Hiranyareta, @OfficeOfDGP, @bhaiyaji_kahin, @sukhdevgogamedi, and @thakurbjpdelhi promoted the claim.", "जलती हुई कार जो आप देख रहे है वास्तव में अंदर एनसीपी के संजय शिंदे नाम के एक राक्षस की चिता जल रही है जो पालघर में मारे गए साधुओं की हत्याओं का आरोपी था जब कल्पवृक्षगिरी जी चोट खाते हुए भी मुस्कुरा रहे थे तो उनका भाव यही था कि ईश्वर के घर देर है पर अंधेर नहीं न्याय अवश्य होगा.. pic.twitter.com/MsVVmvOyNj", "— अंबालिका भारद्वाज 🇮🇳 (@AKrisnapriya) October 15, 2020", "Deepak Sharma (@TheDeepak2020In) is the man who had thrown black ink at Sanjay Singh, Rajya Sabha MP affiliated to the Aam Aadmi Party. Singh has also been in the news for allegedly fanning communal tensions. His tweet received 3,600 retweets and over 10,000 likes at the time of writing.", "महाराष्ट्र पालघर साधुओं के मुख्य हत्यारे NCP नेता संजय शिंदे की कार एक्सीडेंट में जिंदा जलकर हुई मौत ! भगवान के घर देर है अंधेर नही !", "— Deepak Sharma (@TheDeepak2020In) October 15, 2020", "On April 16, 2020, three people were beaten to death by a mob in the Gadchinchale village of Maharashtra’s Palghar district. Two of them were Hindu sadhus and the third individual was their driver. An attempt was made to give the matter a communal colour on social media. However, Alt News found that both the victim and the accused hailed from the same religious background.", "We did not find any reports which mentioned that Shinde was named as an accused in the Palghar lynching case. The reports also did not carry any controversial statement that Shinde might have given related to the murders.", "Alt News spoke to the Investigating Officer in the Palghar case. “NCP leader Sanjay Shinde has never been named in the Palghar case. This is a rumour,” he said.", "What have been the updates on the case since April 16?", "Maharashtra Home Minister Anil Deshmukh had tweeted the list of 101 people detained in the Palghar case on April 22. It did not contain Shinde’s name.", "The list of the 101 arrested in the #Palghar incident. Especially sharing for those who were trying to make this a communal issue.. pic.twitter.com/pfZnuMCd3x", "— ANIL DESHMUKH (@AnilDeshmukhNCP) April 22, 2020", "We also went through a list of people who had been taken in police remand in this case. This list is from the month of May. There is no mention of Sanjay Shinde in this either.", "Initial investigation by the local police and CID revealed that the violence was sparked by rumours circulating on WhatsApp. It warned people about child kidnappers who sell organs of children. Villagers mistook the sadhus for members of the child kidnapping gang.", "The case was handed over to CID in April itself. A total of three charge sheets were filed. According to reports, the first two charge sheets were filed on July 15 against 126 accused. The same report mentioned that more than 808 suspects had been investigated by the CID, with 156 adults and 11 minors detained.", "The third charge sheet was filed on August 7. A case was registered against two out of 11 minors who were said to be directly involved in the lynching. Apart from this, 47 people were charged for direct involvement in rioting and murder. They were arrested in May.", "Amrit Adhikari, lawyer representing some of the accused, said that stones were pelted at policemen when they arrived to make the arrests.", "Alt News reached out to Adhikari who informed that the claims on social media are completely false. “NCP leader Sanjay Shinde’s name has never appeared in the list of the accused. I have read the entire chargesheet,” he said adding that all the accused are locals and no outsiders have been named.", "Shinde was a resident of Sakor, Maharashtra which is situated at a distance of more than 200 kilometres from Palghar.", "Therefore, online claims that NCP leader Sanjay Shinde who died in a recent car accident was the main accused in the Palghar case are false.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]