["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Solar panels dot the rooftops of homes in Groveland, Fla. (AP photo)", "When it comes to solar, the Sunshine State is, well, in the dark, say advocates.", "A coalition of folks across the political spectrum ranging from tea party activists to environmentalists have united to launch a campaign to allow the direct sale of solar energy to consumers. Currently, state law only allows utilities to sell power, but a new political action committee, Floridians for Solar Choice, wants to change that.", "The PAC seeks to get a referendum on the ballot for the 2016 election. They will need 683,149 signatures by Feb. 1, 2016 -- an effort that could cost millions of dollars.", "The PAC argues that Florida is out of touch with the majority of states on solar.", "\"Currently, Florida is one of only five states in the nation that prohibit citizens from buying electricity from companies that will put solar panels on your home or business,\" according to the group’s website.", "We decided to shed a little light on how Florida stacks up on solar energy.", "While solar has been expanding nationally, Florida isn’t a solar leader: it ranks third in solar capacity but 13th in installations, according to the Solar Energy Industries Association. Solar represents less than 1 percent of Florida's energy generation, and the state projects only a tiny fraction of percentage growth over the next decade.", "In November, the Public Service Commission approved allowing utilities to end solar rebates in 2015 and gut energy efficiency goals by 90 percent, because the utilities claimed neither is \"cost-effective.\"", "The source of the data on the 5-state ban", "Florida law only allows a few utilities such as Florida Power & Light, Duke Energy and Tampa Electric to sell power directly to consumers. If a solar power generator wants to get into the state market, it must first sell to one of those utilities.", "Floridians for Solar Choice want to make it cheaper for residents to buy solar power directly from a provider.", "The evidence that only five states forbid that kind of direct sale comes from a map from the Database of State Incentives for Renewable Energy (DSIRE), a project based at North Carolina State University funded in part by the U.S. Department of Energy.", "The map shows the states that allow third-party solar power agreements. Under power purchase agreements (PPAs), an installer/developer builds a solar system on a customer’s property for free and then the developer sells the power to the customer.", "The map, dated November 2014, shows that at least 24 states allow these third-party solar agreements - though in some states there are certain restrictions, such as only allowing them of a certain size or on a type of property. The five states that don’t allow any such agreements are Florida, Georgia, Kentucky, North Carolina and Oklahoma. The map shows the status as unclear or unknown in 21 states.", "The states that are unclear or are unknown are \"because the statutory law is silent about the issue and from what we can gather, no solar companies in these states have attempted to sell electricity directly to a customer,\" said Brian Lips, DSIRE Project Manager.", "That means those 21 states are in a legal gray area, said Ken Johnson, a spokesman for the Solar Energy Industries Association.", "\"It isn’t specifically allowed or disallowed, but given the laws in place, it’s not hard to imagine that a court would uphold the utility’s exclusivity,\" Johnson said. \"Most states don’t go so far to protect monopoly utilities, but Florida is one of them.\"", "Another way to compare states on solar", "We sent the group’s claim to spokespersons for Florida’s Public Service Commission and utilities including Duke Energy to ask if they had any information to refute or support the claim.", "A spokesman for Duke Energy directed us to Solar Power Rocks,  a research and advocacy organization which ranks the states on solar policies. On this ranking, Florida landed in the middle of the pack with a  \"C\" and 24th among the states. But this website doesn’t take into account the third-party PPAs -- it considers other factors such as whether states offer tax exemptions or rebates for solar.", "A spokeswoman for the Public Service Commission, Cindy Muir, questioned characterizing Florida as one of only five states with such a ban, since 21 states are classified as unknown.", "Muir also said that Florida law does allow leases for solar. Under that scenario, a developer installs the solar energy system and the customer pays for it over years rather than paying for the power  produced. The advantage of the PPA is that the customer doesn’t hold the production risk. Under a lease, the customer can end up paying the same whether the system ends up producing 100 percent of expected electricity or a lesser amount, according to the Solar Energy Industries Association.", "Our ruling", "\"Currently, Florida is one of only five states in the nation that prohibit citizens from buying electricity from companies that will put solar panels on your home or business,\" says Floridians for Solar Choice website.", "That statistic comes from a respected academic source that published its findings in 2014. However, the statement doesn’t mean that 45 states allow sales. Currently, 24 states specifically allow an entity to build a solar system on a customer’s property and then sell the power to the customer. In 21 states, the status is unclear or unknown, and pro-solar advocates say few if any sales are happening there. Still, the claim is accurate that only five states specifically prohibit these types of sales. We rate this claim Mostly True.", "Floridians for Solar Choice, Website and petition, Accessed Jan. 14, 2015", "Database of State Incentives for Renewables and Efficiency, 3rd party solar PV power purchase agreements map, November 2014", "Solar Power Rocks,  2015 United States solar power rankings, Accessed Jan. 15, 2015", "Des Moines Register, \"Ruling is a victory for solar energy,\" July 11, 2014", "Tampa Bay Times, \"State dumps energy goals,\" Nov. 26, 2014", "Tampa Bay Times, \"Solar generates smiles,\" Dec. 28, 2014", "Tampa Bay Times, \"Coalition of liberals, conservatives fight for more solar,\" Jan. 13, 2015", "Tampa Bay Times The Buzz blog, \"PAC launches to push solar power amendment,\" Jan. 14, 2015", "PolitiFact, \"Obama says every four minutes another home or business goes solar,\" Jan. 29, 2014", "PolitiFact Florida, \"Charlie Crist says Florida is the Sunshine State and we’re hardly doing any solar energy production,\" Dec. 3, 2013", "PolitiFact Florida Scott-O-Meter, \"Scott approved nuclear power plants, but not much focus on other alternatives,\" Sept. 4, 2014", "Interview, Jennifer S. Rennicks, Director of Policy & Communications, Southern Alliance for Clean Energy, Jan. 14, 2015", "Interview, Charlie Coggeshall, Renewable Energy Manager, Southern Alliance for Clean Energy", "Interview, George Cavros, treasurer for Floridians for Solar Choice and attorney for Southern Alliance for Clean Energy, Jan. 14, 2015", "Interview, Dan Hahn, co-founder of Solar Power Rocks, Jan. 15, 2015", "Interview, Randy Wheeless, Duke Energy spokesman, Jan. 14, 2015", "Interview, Cindy Muir, Florida Public Service Commission spokeswoman, Jan. 14, 2015", "Interview, Bob Gibson,  Solar Electric Power Association spokesman, Jan. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]