["The graphic, which includes a logo for ABS-CBN, purportedly quoting Philippine President Duterte was published here on Facebook on May 3, 2020.", "Below is a screenshot of the misleading post:", "The quote overlaid on the graphic, written in a mix of Tagalog and English, reads: \"The recent increase in the contribution rate of Philhealth is JUST and FAIR. You OFWs especially my supporters, do not ever complain, just obey. If you do not want to obey, come back to the Philippines so you pay less. / PRESIDENT RODRIGO DUTERTE / On the implemented increase of rate of contribution for PhilHealth coverage / May 2, 2020”.", "The post’s caption translates to English as: “Just OBEY YOU DDS OFWs”.", "PhilHealth is the name of the national health insurance program in the Philippines.", "“DDS” and “OFW” are acronyms for “diehard Duterte supporters” and “Overseas Filipino Workers”, a term used to refer to Filipino migrant workers abroad.", "The posts were published shortly after PhilHealth announced here on April 22, 2020 that mandatory health insurance contributions from migrant workers overseas would increase to 3% of their monthly salary. The announcement was met with much criticism from migrant groups, labour unions and politicians, as well as this online petition calling for a recall of the order.", "The graphic was also shared here and here on Facebook alongside a similar claim.", "The claim is false. “ABS-CBN News did not publish a graphic on this supposed ‘statement’ of President Rodrigo Duterte,” the news outlet said in this tweet published on its official Twitter account on May 3, 2020.", "Below is a screenshot of the ABS-CBN tweet, which shows the graphic in the misleading posts overlaid with a “FAKE” stamp:", "AFP located the original ABS-CBN graphic here on its Twitter page, which quotes Duterte saying in a mix of English and Tagalog: “To my brothers and sisters, especially those who have more in life,  maybe you can help in extending financial assistance. If you don't really need it and you know that there is someone who is hungry, just help.”", "President Rodrigo Duterte appealed to those \"who have more in life\" to financially help people affected by the #COVID19 crisis in the country. pic.twitter.com/dFfir9Lz1F", "Below is a screenshot of the original ABS-CBN graphic:", "The Philippine Presidential Communications Operations Office (PCOO) also refuted the claim here on its Facebook page on May 3, 2020, labelling the graphic “FAKE NEWS”.", "Below is a screenshot of the Facebook post:", "The Philippine government has since announced a suspension of mandatory PhilHealth contributions during the COVID-19 pandemic. In this statement issued on the PCOO website on May 4, 2020, the presidential palace says Duterte has ruled “payment for PhilHealth premiums voluntary for OFWs”, so that migrant workers “no longer have to worry” about paying contributions \"at this time of health crisis brought by the coronavirus disease 2019”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]