["The image appears in this article published on an entertainment website called Spoonfeedz on May 4, 2018, alongside two images of fly larvae and a video of patients having worms removed from their body.", "On its site, Spoonfeedz describes itself as “the place to be for everything from sports fails to funny videos and captivating content”.", "Below is a screenshot of the article:", "The headline of the article states: “VIDEO: WORMS THAT BELONG IN NIGHTMARES COULD BE FEEDING ON YOUR FLESH!”", "There is no caption on the photo of the hand, but the text of the article is about mango worms. These are laid by the mango fly, which is found in sub-Saharan Africa and whose scientific name is cordylobia anthropophaga.", "Here is a Centers for Disease Control and Prevention information page about ‘mango worm’ infections in humans and here is a scientific report about one such case published in the journal Annals of African Surgery.", "The same image has also been shared hundreds of times on Facebook, for example in this post dated June 19, 2019.", "The Facebook post does not claim the image shows a worm-infested hand, but it also does not explain that the photo does not show a real disease. Its caption says: “80 years of bad luck if you ignore”.", "But the image is being used in a misleading context. The image shows prosthetics created by a Texas-based make-up artist.", "Reverse image searches on Google found the same image published in this September 12, 2017, report in British newspaper the Daily Mirror. The image is credited to UK media agency Mercury Press and Media Ltd.", "The report says the make-up was applied on the hand by artist Bridgette Trevino, who told the newspaper: “A lot of people have claimed to have had panic attacks because of my work. I sympathise but it also only encourages me more. If it's not scary or doesn't get that response I'm not doing my job properly.”", "Below is a screenshot of the Daily Mirror report:", "Trevino, whose Twitter profile says she is a Texas-based special effects artist, also posted similar imagery of her work on social media, such as here on Facebook and here on Instagram.", "The Instagram post, embedded below, contains a video of the make-up being scraped off with a scalpel:", "Trypophobia removal #notreal", "A post shared by  This Is My Art N Stuff ?‍? (@alterswitchsfx) on Aug 30, 2017 at 6:44pm PDT", "AFP Philippines previously debunked similar claims related to other images showing special effects make-up here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]