["The 30-second video was published here in a Facebook post on January 29, 2021.", "“Revolt in Delhi Police. 200 policemen became rebels, tendered mass resignation. Hail the soldier, Hail the farmer. #i_support_rakesh_tikait_challenge,” reads the post’s caption in Hindi.", "Rakesh Tikait is the leader and spokesman of the umbrella alliance of  more than 20 farmers’ groups leading the ongoing protest against new agricultural laws.", "The video was shared online following clashes between police and protesting farmers in the Indian capital Delhi on January 26, 2021. AFP reported on the clashes here.", "At the video's 10-second mark, a senior police officer can be heard asking the policemen to chant \"Jai Jawan, Jai Kisan\" (\"Hail the Soldier, Hail the Farmer\"). This slogan was coined by former Indian prime minister Lal Bahadur Shastri to praise the contribution of soldiers and farmers in nation building, as reported here by the BBC.", "At the clip's 22-second mark, a male voice can be heard saying in Hindi that the policemen are scared.", "The video was also shared alongside a similar claim on Facebook here, here, here; and on Twitter here, here and here.", "The video, however, has been shared in a misleading context.", "A reverse image search on Google found a longer version of the footage published by Bombay-based English-language daily newspaper Times of India in an article on January 27, 2021. It reports that Delhi Police officers chanted a slogan in a bid “to urge farmers to get back on the designated route”.", "The report features a 46-second video.", "“Request them politely otherwise they [protesters] will run over us,” a senior police official can be heard saying to other police officers between the 15 and 22 second mark of the clip.", "Indian state-run broadcaster Prasar Bharti also tweeted the video alongside a similar description. The tweet similarly states the clip shows the the Joint Commissioner of Delhi Police urging his colleagues to keep the protesters calm.", "Joint Commissioner asked Delhi Police to remain calm and peaceful while trying to ease the situation on Republic Day, chanted 'Jai Jawan, Jai Kisan.'\n\n\t\tVideo- @SriSubodhKmr pic.twitter.com/y7B5SPVD8a", "“Joint Commissioner asked Delhi Police to remain calm and peaceful while trying to ease the situation on Republic Day, chanted 'Jai Jawan, Jai Kisan,” the tweet reads.", "Thousands of farmers congregated in Delhi on January 26, 2021 driving tractors from border camps where they have been holding sit-ins since November, AFP reported. The rally turned violent, leaving one person dead and hundreds of police injured. Prime Minister Narendra Modi lambasted the assault and pledged to push on with new deregulation laws.", "The Indian government’s Press Information Bureau (PIB) refuted the claim that 200 Delhi Police personnel resigned during the protest.", "“There has been a claim on social media that 200 Delhi Police personnel have tendered mass resignation. #PIBFactCheck: This is a fake claim,” it tweeted on January 30, 2021.", "The Cyber Crime unit of the Delhi Police also said to have arrested a person for spreading “fake news about resignation of police personnel” and “propagating false rumours regarding disaffection in police ranks” in a tweet on February 1, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]