["“I agree entirely with Judy… if they use a tissue to make the influenza vaccine, and that tissue comes from a dog or from a monkey, they intrinsically have coronaviruses,” Dublin professor Dolores Cahill says in a YouTube video posted in May 2020.", "Cahill has been asked to resign from a leading European Union scientific committee over her online claims about the COVID-19 pandemic. A European Commission spokesperson told The Irish Times that Cahill’s expressed views were “incompatible” with the scientific foundations of the committee.", "The claim about coronaviruses in flu vaccines also appears on Facebook here.", "Mikovits made the claim during a video interview that circulated widely online, and which contained a number of false or misleading claims about the novel coronavirus.", "“Coronaviruses are in every animal, so if you’ve ever had a flu vaccine, you were injected with coronaviruses,” she said in the video, titled “Plandemic.”", "Mikovits gained widespread attention in 2009 with a seemingly break-through study, but the paper was later retracted when the findings could not be replicated. Researchers theorized that the original findings were likely due to laboratory contamination.", "Her fall from grace continued when she was briefly jailed on charges of theft from the laboratory that performed the ill-fated study.", "There are seven known human coronaviruses, including SARS-CoV-2, the virus that causes COVID-19, which has killed more than 555,000 people worldwide.", "But the claim that flu vaccines contain them is false.", "While it is true that animals have coronaviruses, “it has no relationship to vaccines,” Dr. Jacco Boon, an infectious disease professor at Washington University School of Medicine in St Louis, said in an email.", "Coronavirus expert Dr. Julian Leibowitz of Texas A&M College of Medicine explained in an email: “Although coronaviruses do infect many species, they do generally not persist long term in the infected animal.", "“The flu vaccine is commonly prepared from influenza virus grown in eggs laid by virus-free chickens, and these eggs are sterile prior to their being infected with influenza virus for vaccine preparation,” he said.", "If the claim was true, people vaccinated for the flu would likely “have some level of immunity to coronavirus infections, and they do not,” Leibowitz added.", "Information about approved flu vaccines for the US 2019-2020 flu season is available on the Centers for Disease Control and Prevention website here and here, and information about common flu shot ingredients are available on the Food and Drug Administration’s website here.", "Coronaviruses are not listed as an ingredient in any of these resources.", "AFP Fact Check has addressed previous claims about flu vaccines here, here and here, and more than 550 claims about the novel coronavirus, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]