["About this rating", "On 15 April 2019, a story claiming that XXXTentacion had staged his own death was published to the website Trend-News.com:", "XXXtentacion Found Alive.", "Xxxtentacion found alive after turning himself into the authorities. the formerly dead rapper claimed he did it to punk his fans for a new concept albums hes releasing called the dangers of fake news. This new album will be discussing the dangers of lying, fake news and slander and it'll be coming out this year at record stores and streaming services. Make sure to get your copy soon or listen to it on xxx's spotify.", "This is not a genuine news article. Trend-News.com is an entertainment website that allows users to create their own fake news stories in order to \"prank\" their friends on social media.", "A disclaimer at the bottom of the website reads: \"This website is an entertainment website, jokes are created by users. These are humourous jokes, fantasy, fictional, that should not be seriously taken or as a source of information.\"\nMusician Jahseh Onfroy, better known as XXXTentacion, was shot and killed in Deerfield Beach, Florida, in June 2018:\nRapper XXXTentacion was shot and killed during an apparent robbery Monday in Broward County, Florida, police said.\nThe 20-year-old rapper, whose real name was Jahseh Onfroy, was leaving a motorsports store shortly before 4 p.m. when two men in a dark colored SUV shot and killed him in an apparent robbery, said Keyla Concepción, Broward County sheriff department public information officer.", "A disclaimer at the bottom of the website reads: \"This website is an entertainment website, jokes are created by users. These are humourous jokes, fantasy, fictional, that should not be seriously taken or as a source of information.\"", "Musician Jahseh Onfroy, better known as XXXTentacion, was shot and killed in Deerfield Beach, Florida, in June 2018:", "Rapper XXXTentacion was shot and killed during an apparent robbery Monday in Broward County, Florida, police said.", "The 20-year-old rapper, whose real name was Jahseh Onfroy, was leaving a motorsports store shortly before 4 p.m. when two men in a dark colored SUV shot and killed him in an apparent robbery, said Keyla Concepción, Broward County sheriff department public information officer.", "This isn't the first time that conspiracy theorists have claimed the 20-year-old musician staged his own death. While we won't address all of these rumors individually, it should be noted that XXXTentacion's family held a public memorial, including an open casket, shortly after his death. This, of course, would have been difficult if the musician were still alive:", "Hordes of eager young fans burst into spontaneous songs of grief and celebration on Wednesday afternoon at an arena here in South Florida, where they had gathered to honor the life of the controversial 20-year-old rapper and singer XXXTentacion, who was shot and killed in an apparent robbery last week.", "The public memorial, organized by the rapper’s family, included an open-coffin viewing onstage at the BB&T Center — capacity 20,000 — in Sunrise, Fla., about 25 miles from where XXXTentacion (born Jahseh Onfroy) was killed in his BMW sports car on June 18, halting what had been a meteoric 18-month rise and raising knotty questions about his legacy.", "Vera, Amir.   \"Rapper XXXTentacion Shot Dead in Florida, Police Say.\"\r\n    CNN.   19 June 2018.", "Landry Laviolette, Julie; Coscarelli, Joe.   \"XXXTentacion Is Mourned by Thousands at a Memorial in Florida.\"\r\n    New York Times.   27 June 2018.", "NME.   \"Is XXXTentacion Still Alive? All the Conspiracy Theories Surrounding the Rapper’s Death.\"\r\n    28 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]