["As early voting got underway across the country, people spread statements on social media warning voters to watch to see whether poll workers write on their ballots or make any marks on them. They claimed this would invalidate their ballots and advised people to request a replacement.", "One of the statements on Facebook claims to show a text message from a poll worker who said, “Your ballot could be DISQUALIFIED if it is WRITTEN ON. Please be on the lookout for this type of behavior FROM THE POLL WORKER.”", "Comments like this were spreading so much that on Oct. 15, the North Carolina Board of Elections put out a statement: “In North Carolina, this is false.”", "Fact check:Pennsylvania mail-in votes need 2 envelopes to be counted", "Poll workers in some places, such as North Carolina, put notes on ballots if there is a chance that the voter isn’t eligible to vote or isn’t eligible to use the ballot they have in hand.", "North Carolina poll workers write an identifying number on all mail-in absentee ballots and all early voting ballots, the Board of Election said in its Oct. 15 statement.", "“This number allows the ballot to be retrieved if necessary based on a voter challenge, such as if the voter dies before Election Day or double votes,” the office said.", "There was a notable example of this policy in April 2014. That is when the father of a U.S. Senate candidate died shortly after he put his absentee ballot in the mail for the May primary. North Carolina law says voters must be alive on Election Day to have their votes counted. Because the voter was dead on the May primary’s Election Day, reported television station WRAL in Raleigh, the elections staff removed the voter’s ballot and it was not counted.", "Fact check:False claim that photo of discarded mail shows ballots cast for Trump", "Poll workers may make marks on ballots cast by in-person voters on Election Day, the North Carolina the elections board said.", "Sometimes, the board said in its announcement and on its website, there are questions as to whether a voter is eligible to vote. For example, the voter’s registration can’t be immediately confirmed, or the voter went to the wrong precinct and insisted on voting there instead of going to the correct precinct and getting the correct ballot for where their home is.", "When this happens, the voter is allowed to provisionally vote. And a “P” is written on the voter’s ballot.", "The Board of Elections says on its website that it will later review their situation and decide whether the voter was eligible and had an appropriate ballot. If so, his ballot would be counted.", "Election procedures and laws vary from state to state.", "Outside of North Carolina, the Lead Stories fact-checking website reviewed the claim when it surfaced in South Carolina and quoted South Carolina election officials saying the claim is untrue.", "The Snopes fact-check website talked to election officials from other states who said it's rare in their states that a poll worker would write on a ballot and regardless, that would not invalidate the ballot.", "We rate the claim that if poll workers make notations on ballots it could prevent them from being counted as FALSE. Poll workers make notes on ballots as required to ensure the integrity of the election. Those notations do not automatically cause your ballot to be rejected or disqualified.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]