["President Joe Biden allegedly tried to clarify a statement implying minorities are not \"able to use the internet\" on Twitter, according to a Feb. 20 Facebook post.", "The post features a screenshot of what appears to be a rambling tweet filled with grammatical errors sent by the president at 3:53 p.m. Feb. 18.", "\"My comment regarding minorities not being able to use the internet was taken out of context,\" the tweet states. \"It's not they don't know how to use it it's just that they don't know any better.\"", "It does not mention to which comment the president is referring, but Biden spoke about internet accessibility during a CNN Town Hall on Feb. 16.", "The tweet also accuses minorities of not liking \"to do anything.\"", "\"Hope this clears that up,\" it ends. The tweet was sent via Twitter for iPhone, according to the screenshot.", "\"Our truly racist so-called president... strikes again,\" reads the post caption. \"Stupidity at it's finest.\"", "USA TODAY reached out to the poster for comment.", "Biden made several remarks about access to online resources during the town hall. But there are clues that indicate the apologetic tweet is fabricated.", "More:Fact check: Image claiming to show 2016 Ted Cruz tweet on climate change and Texas is fabricated", "The question-and-answer session of Biden's his first town hall meeting as president covered a host of issues. Audience member Dr. Dessie Levy's question about racial disparities in health care prompted his comments on minority access to online health resources.", "Levy asked whether lessening the impact of COVID-19 on Black and Hispanic communities was a priority for the Biden administration on a local and national level, according to a transcript.", "The president said his administration planned to send 1 million COVID-19 vaccine doses a week to community health centers in the \"toughest neighborhoods in terms of illness\" as well as over 6,700 pharmacies.", "Biden also committed to mobile vaccination units and a $1 billion investment in public education to help people access information online.", "\"The other thing we found is, and I’m sorry to go on, but this is really important to me. The other portion is a lot of people don’t know how to register,\" Biden said of the vaccination process. \"Not everybody in the community, in the Hispanic and the African-American community, particularly in rural areas that are distant and/or inner city districts, know how to use … Know how to get online to determine how to get in line for that COVID vaccination at the Walgreens or at the particular store.\"", "Anderson Cooper, town hall moderator and host of \"Anderson Cooper 360,\" asked Biden if the roll-out process for vaccine registration concerned him. The president acknowledged that standards needed to change.", "\"You can go online and every single state now has a ... slightly different mechanism by which they say who’s qualified, where you can get the vaccines and so on. So it’s all about trying to more rationalize in detail so ordinary people like me can understand, I mean that sincerely,\" he said.", "A clip of the president's comments on how online vaccine registration may be inaccessible to some members of minority groups was shown during a Feb. 17 interview with Rep. Byron Donalds, R-Fla., on Fox News Channel. The question Biden was responding to was not included.", "Donalds called Biden's statements \"ridiculous\" and \"disgusting.\"", "\"Once again, this is the president putting his foot in his mouth again when it comes to people of color,\" Donalds told \"Fox & Friends First\" hosts Todd Piro and Jillian Mele.", "\"To insinuate or to say that because somebody is Black or somebody's Hispanic that they have less of an ability than somebody who's white is just ridiculous. It's disgusting; the president should have never said it,\" he added.", "The image in the Feb. 20 Facebook post is not its first appearance online. The \"tweet\" was posted to another account two days earlier with the caption, \"See y’all judged The PeePaw wayyyyyy too quickly.\" USA TODAY reached out to the poster for comment.", "Biden never said minorities weren't able to use the internet, as the claim stated. An advanced Twitter search for the phrase \"my comment regarding minorities\" from account @JoeBiden generated no results.", "Moreover, the president uses the official United States government @POTUS Twitter account now, per his profile page. All tweets from the account include the header \"United States government official.\" The image in the claim does not.", "The date in the image is also incorrectly formatted as day/month/year. Twitter uses a month/day/year format in its time stamps.", "Finally, and perhaps most glaringly, the tweet in the claim was sent using an iPhone. All tweets from an official government account contain \"The White House\" in the footer.", "We rate this claim FALSE, based on our research. A claim featuring an apparent apology tweeted by President Joe Biden is a fake. Biden never said minorities are not able to use the internet nor did he accuse Black and Hispanic Americans of not knowing \"any better.\" An official government header and standardized time stamps are also missing from the image in the claim.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]