["About this rating", "On 16 June 2017, Reddit user u/GoblinsStoleMyHouse published a lengthy story of revenge involving trees to r/trees (a marijuana-themed subreddit). His claim was later posted to revenge-themed subreddits (and copied by blogs).", "In the original post, the Redditor wrote:", "Hi, I'm an arborist. This means I am a professional in the cultivation, management, and study of trees. I love trees. I think they're some of the most beautiful, majestic, ancient living beings on our planet.", "Today I am here to tell you a story of death, new life, and revenge. Three years ago today, the city council of Redondo Beach California ordered the death of my 30 year old pepper tree. It's roots had begun to penetrate the pavement in front of my house. The city noticed and issued the death warrant of my tree. They furthermore made me pay for the damages to the sidewalk and for the tree removal.", "I loved Clyde. I'm beginning to get older, and planting something that I knew would live well beyond my lifetime was something very special. I took very good care of him. I drained his soil, I gave him a crutch to lean on when he was a young lad, and I watched him grow. Just as Clyde was becoming a strong healthy individual, expanding his root system, developing a canopy, and making his own way in life, the mayor took it upon himself to uproot my beautiful child.", "Mayor Steve Aspel. You killed my child.", "For this, you will pay. Two years and seven months ago, I secretly planted 45 California Redwoods and 82 Giant Sequoias in various parks, yards, and state properties around your city.", "Today, each of their root systems will be at least 30 feet in diameter, and deeply embedded in the soil. You may have noticed the trees growing in front of city council, or that new one that sprouted up in your backyard. That's a Giant Sequoia, and its growth will begin accelerating rapidly in the coming months.", "You killed Clyde, but I have replaced him with over 100 living giants. And giant they will become. In a few years, they'll begin breaking heights of 100-300 feet and live well beyond 2,500 years. That's way longer ago than Jesus was born. To remove even one of them at this point will cost well over $1500... And I'm stiffing you with the bill, just like you did to me 3 years ago today.", "Good day to you, sir. May your city be overrun by trees. And may Clyde rest in peace.", "In addition to claiming that he had planted dozens of redwood and sequoia trees around Redondo Beach, California, GoblinsStoleMyHouse also maintained that he was \"beginning to get older\" and that the vengeful planting had occurred roughly three years prior after he was engaged in a homeowner's dispute with the city. However, four months previously, he had described himself as a biology major (i.e., someone still in college), not an aging homeowner:", "Four months before that, the same user had mentioned living in a dormitory room \"on a college campus\" (not a residence maintained by a homeowner) in a separate thread.", "The user also freely discussed \"trolling\" fellow Redditors in mid-2017:", "Although the claims made in the original post about \"Clyde,\" sequoia/redwood trees, Redondo Beach, and petty revenge are not impossible, they are highly implausible. An arborist would know, for one thing, that giant sequoias and redwoods would not be able to grow at the rate described in Redondo Beach — or likely at all, given the historic drought that overtook southern California from 2012 through 2016. Those trees, which once thickly carpeted all of North America, need quite a lot of groundwater (and, in the case of coastal redwoods, fog) to survive.", "Mike Garcia, a state-licensed tree services and landscaping contractor who has lived and worked in Redondo Beach for half a century, told us that this story is impossible for a number of reasons. \"Southern California is pretty much a desert. Where are all the sequoias located? North, in San Francisco where we get a lot of rain,\" he said, adding that:", "You could actually plant a sequoia and you could water them a lot, but I think at last count there's over 100 million trees in Southern California that have died from drought-related causes.", "The only time that those [deep] roots get watered at a really deep level is when it rains because rain pushes water down for hours or days, so we are getting 5 or 6 feet deep. And that's what they need. So in L.A., you can grow a baby sequoia for a while, a few years, but it won't get water at the deepest roots.", "Coastal redwoods, Garcia told us, only grow in Northern California because of its higher coastal rainfall, a contrast with Southern California's relatively arid Mediterranean climate: \"I was born and raised in Redondo, I've worked in this town every single day, and I haven't seen any sequoias or redwoods growing around here.\"", "He noted that if a tree were encroaching on a public sidewalk but growing on private property, the city would not uproot the tree but would instead perform what they call root pruning or root trimming: \"They will cut the sidewalk out and they will cut the root out and lay the sidewalk again. Otherwise everybody's trees would be torn out!\"", "We also called the city of Redondo Beach, who told us that the story was completely untrue. Ted Semaan, Redondo Beach's public works director, said that the story initially caused some concern, but they soon realized that what it described would have been impossible: \"If somebody had planted 127 trees without our knowledge, we would have picked up some of them — there aren't 127 trees that were mysteriously planted on city property.\"", "Furthermore, a giant sequoia or coastal redwood does not have a marked growth spurt after two or three years, under even optimum conditions, and there is no way that the root system would be so involved as to cost taxpayers more than a thousand dollars each to remove all 127 saplings.", "These facts, combined with u/GoblinsStoleMyHouse's posting history and description as a college student with an affinity for chess and trolling fellow Redditors (an individual who would almost certainly know r/trees was not a subreddit for literal trees), make it clear that the tale of the vengeful arborist was nothing more (or less) than a clever leg-pull.", "In other words, anyone who thinks that this story is true is barking up the wrong tree.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]