["About this rating", "An informal study commissioned by a movie rental service found that watching certain horror movies increased viewers' heart rates and burned more calories in a small sample of adults than simply sitting quietly did.", "The study was neither peer-reviewed nor published (nor, apparently, meant to be taken seriously). No follow-up studies replicating its findings, and people who wish to lose weight are probably better advised to get some exercise.", "For several years running, the internet was abuzz over a 2012 medical study supposedly showing that the average adult burns as many calories while watching a scary movie as he or she would during a 30-minute walk — and the scarier the movie, the more calories burned. Some even go so far as to say that watching horror movies reduces one's risk of obesity. Is there anything to these claims? Is watching horror movies a good weight-loss strategy?", "The timing of the release of the findings offers a clue: Halloween. According to a 28 October 2012 report in The Telegraph, the study was commissioned by the UK movie rental service LoveFilm (since acquired by Amazon) and was publicized just before the spooky holiday with the clear aim of beefing up video sales. It doesn't appear that the study was ever peer-reviewed, or published, or even meant to be published.", "That having been said, the research was conducted at an actual medical institution, the University of Westminster in London, and supervised by an actual specialist in cell metabolism and physiology, Dr. Richard Mackenzie. The Telegraph summarized its methodology and findings as follows:", "The University of Westminster study measured the total energy expenditure of ten different people as they watched a selection of frightening movies.", "Scientists recorded their heart rate, oxygen intake and carbon dioxide output — and discovered the number of calories used increased by an average a third during the films.", "The research also revealed films featuring moments designed to make viewers jump in terror are the best calorie-burners, as they cause heart rates to soar.", "Dr. Richard Mackenzie, senior lecturer and specialist in cell metabolism and physiology at the University of Westminster, said: \"Each of the ten films tested set pulses racing, sparking an increase in the heart rate of the case studies.", "\"As the pulse quickens and blood pumps around the body faster, the body experiences a surge in adrenaline.", "\"It is this release of fast acting adrenaline, produced during short bursts of intense stress (or in this case, brought on by fear), which is known to lower the appetite, increase the Basal Metabolic Rate and ultimately burn a higher level of calories.\"", "Two things to note are the very small sample size (just 10 people) and the narrow scope of the study, which only measured participants' metabolism in real time and did not track actual weight loss over an extended period or compare the efficacy of weight loss methods. Moreover, the number of calories allegedly burned while viewing horror films simply isn't that large or impressive.", "\"The movie top of the list of calorie-burners was found to be the 1980 psychological thriller The Shining, with the average viewer using up a whopping 184 calories,\" The Telegraph reported. \"Jaws took the runner-up spot, with viewers burning on average 161 calories, and The Exorcist came third, with 158 calories.\" But some of the other films shown to participants — The Texas Chainsaw Massacre, to name one — burned as few as 107. According to a popular fitness and weight-loss website, a 150-pound person burns that many calories just sitting still for 90 minutes (the average length of a feature film).", "So, while the 2012 study does suggest, based on very slight evidence, that some people might burn a few more calories passively watching a horror film than sitting still for 90 minutes, the research was conducted for publicity purposes and ought not to be taken terribly seriously. People with a sincere interest in losing weight are better advised to consult a physician and develop an appropriate weight-loss plan.", "Child, Ben.   \"Scare Yourself Thin: Horror Movies Help Burn Calories, Study Finds.\"     The Guardian.   29 October 2012.", "Rainey, Sarah.   \"Here's Johnny, Come to Kill Your Calories.\"     The Telegraph.   29 October 2012.", "The Telegraph.   \"Watching Horror Films Burns Nearly 200 Calories a Time.\"     28 October 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]