["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Videos showing Planned Parenthood officials discussing how they sometimes procure tissue from aborted fetuses for medical research led to calls, including at this rally in Austin, Texas in July 2015, to stop federal funding for the group. (AP photo)", "When U.S. Rep. Gwen Moore said, \"I don’t think we do children a favor by forcing women to give birth,\" she drew criticism from The Daily Caller, a conservative-leaning website.", "The Milwaukee Democrat was speaking at a Washington, D.C., news conference in favor of continuing federal funding for Planned Parenthood.", "Moore made similar remarks the next day, Sept. 29, 2015, during a speech on the House floor about a Republican-backed bill to defund the organization. And she made a claim we thought we’d check.", "\"The reality is,\" Moore said, \"is that 60 percent of all Americans do not want to see Planned Parenthood defunded.\"", "Given the recent publicity over secretly recorded videos of Planned Parenthood officials, we wondered where support stands for federal funding of the group.", "Defunding Planned Parenthood", "The series of videos, first released in July 2015, were recorded by the anti-abortion Center for Medical Progress. They show Planned Parenthood officials offhandedly discussing how they sometimes procure tissue from aborted fetuses for medical research.", "The center alleges Planned Parenthood is illegally profiting from fetal organ sales. But Planned Parenthood says it has done nothing illegal and that the videos were edited in a misleading way.", "The videos led to the defunding effort. Earlier this month, we checked a claim by Republican U.S. Rep. Sean Duffy of Wisconsin. Speaking on the House floor in favor of the defunding bill, Duffy said millions of dollars are spent by Planned Parenthood to elect Democrats to the House of Representatives.", "We rated his claim Mostly True. The organization itself has not made the expenditures, but Planned Parenthood affiliates have.", "Polls on defunding", "To check Moore's claim, we examined results of national polls conducted in September 2015, earlier in the same month in which she made the claim.", "Three surveys back Moore:", "A NBC News/Wall Street Journal poll of adults asked: \"Would you favor or oppose totally eliminating federal funding to Planned Parenthood for family planning and preventative health services?\" The result: 61 percent opposed.", "A USA Today/Suffolk University poll of likely voters asked: \"Do you think all federal funding for Planned Parenthood should be cut off: yes or no?\" The result: 65 percent said no.", "A Pew Research Center poll used a more complex question -- tying funding to a possible government shutdown-- but got a similar result: 60 percent of adults said any federal budget agreement to avert a government shutdown would have to maintain funding for Planned Parenthood.", "In two other surveys, a majority supported continued federal funding of Planned Parenthood, though the levels were less than 60 percent:", "Quinnipiac University asked registered voters: \"Do you support or oppose cutting off federal government funding to Planned Parenthood?\" The result: 52 percent opposed.", "The New York Times/CBS poll asked adults: \"Do you think Planned Parenthood should or should not receive funding from the federal government?\"\nThe result: 55 percent said should.", "We consulted three polling experts, including Charles Franklin, the Marquette Law School Poll director and co-founder of Pollster.com. He noted that, on average, support for funding was 58.6 percent in the five polls.", "Karlyn Bowman, senior fellow and research coordinator at the American Enterprise Institute, said critics argue the polls didn't ask respondents if they preferred the federal funding go to other organizations rather than to Planned Parenthood. She said although it isn't clear how much attention Americans are paying to the videos controversy, the available polling data suggests most support continued funding.", "Our rating", "Moore said: \"60 percent of all Americans do not want to see Planned Parenthood defunded.\"", "Three national polls put the support at 60 percent or higher. Two others show support of less than 60 percent, but taken together, the average support among the five polls is nearly 59 percent.", "We rate Moore's statement True.", "C-SPAN, video of U.S. Rep. Gwen Moore remarks (quote at 2:29:25), Sept. 29, 2015", "Yahoo! Politics, \"Most Americans oppose defunding Planned Parenthood,\" Sept. 30, 2015", "NBC News, \"6 in 10 oppose defunding Planned Parenthood,\" Sept. 28, 2015", "The Hill, \"Poll: 63 percent oppose defunding Planned Parenthood,\" July 28, 2015", "PolitiFact Wisconsin, \"Planned Parenthood spends millions to elect Democrats to Congress, GOP U.S. Rep. Sean Duffy says (Mostly True),\" Oct. 8, 2015", "PollingReport.com, \"Abortion and birth control,\" accessed Oct. 12, 2015", "Wall Street Journal, result of Planned Parenthood poll question, poll ended Sept. 24, 2015", "USA Today, \"Poll: By 2-1, funding for Planned Parenthood supported,\" Sept. 29, 2015", "Quinnipiac University, poll results, Sept. 28, 2015", "New York Times, \"Most Americans say Planned Parenthood fight isn't worth a shutdown, poll finds,\" Sept. 28, 2015", "Pew Research Center, \"Majority Says Any Budget Deal Must Include Planned Parenthood Funding,\" Sept. 28, 2015", "Email interview, Marquette Law School Poll director and Pollster.com co-founder Charles Franklin, Oct. 12, 2015", "Email interview, Stanford University social psychologist Jon Krosnick, Oct. 12, 2015", "Email interview, American Enterprise Institute senior fellow and research coordinator Karlyn Bowman, Oct. 12, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]