["About this rating", "On 27 August 2017, as the full damage to Texas from a storm of historic proportions was not yet fully known, a number of social media posts began to spread, alerting readers to a change in Texas law around insurance claims in the event of weather damage.", "One Facebook user posted the following:", "EFFECTIVE FRIDAY, the laws governing insurance claims in Texas will change to your detriment. To take advantage of current law, YOU MUST FILE YOUR CLAIM, IN WRITING, BY THURSDAY, AUGUST 31, regardless of whether your damage occurred before that date. That is, it does not matter if your DAMAGE occurred before the effective date. To take advantage of current law you must actually file a claim by Thursday. It must be (1) IN WRITING, and (2) SPECIFIC ABOUT WHAT DAMAGE YOU ARE CLAIMING OCCURRED.", "The changes were made by H.B. 1774. The provisions in that bill hamper your ability to challenge your insurance company if they slow pay, low pay, or deny your claim. (Among other things, It lessens the penalties for their failure to pay your claims or their slow-paying them, and it limits your ability to collect attorneys fees, so you'd have to pay to sue out of your own pocket.) Again, this law makes it harder for you to get the insurance companies to pay what they are supposed to pay when they are supposed to pay it.", "Former Texas state representative Glen Maxey wrote:", "In the 2017 Legislative Session, a majority of your state lawmakers changed the laws which help property owners recover losses after a storm like Harvey and hampered your ability to hold your insurance company accountable if they slow pay, low pay, or no pay.", "Well, the new law goes into effect SEPTEMBER 1!! This law will make it harder for you to get the insurance companies to pay what they are supposed to pay when they are supposed to pay it.", "And on 29 August, Rep. Joaquín Castro encouraged Texans affected by Tropical Storm Harvey to file their claims before 1 September:", "Texans: be sure to file for #Harvey relief before Sept 1. #TXlege passed a bill making it harder to dispute weather-related property claims.", "— Joaquin Castro (@JoaquinCastrotx) August 28, 2017", "Texas House Bill 1774 does indeed introduce changes to the way property damage insurance claims are dealt with in the state, but only in the event of a litigated dispute over a claim. Most insurance claims are settled out of court, and so the potential benefit in filing a claim before 1 September 2017 (which is itself marginal) will likely not apply in most cases.", "The real benefit would be in filing a lawsuit before 1 September, but for obvious practical reasons, it is extremely unlikely that someone whose home has been destroyed or extensively damaged days earlier, would be in a position to do this.", "The law was signed by Governor Greg Abbott on 26 May 2017.", "What the law changes", "The first major provision in the law is that an individual or business filing a lawsuit in relation to a weather-related property damage insurance claim (including flood damage) will have to give their insurance company 61 days' notice before initiating litigation.", "According to an analysis published by the independent House Research Organization in the Texas House of Representatives:", "[The law] would require an insured [person] making a claim against an insurer or agent relating to damage to real property caused by an earthquake, earth tremor, wildfire, flood, tornado, lightning, hurricane, hail, wind, snowstorm, or rainstorm to provide written notice to the insurer at least 61 days before filing the claim. This pre-suit notice would have to provide a statement of the acts giving rise to the claim, the specific amount alleged to be owed, and amount of reasonable and necessary attorney's fees already incurred by the claimant. This notice would be admissible as evidence in a civil action or alternative dispute resolution.", "The second major provision in HB 1774 is that it imposes a claim recovery threshold in order for individuals to recover the full amount of their attorney's fees, if they decide to go to court. If, in the event of a lawsuit, a jury decides to award a plaintiff 80 percent or more of the amount they are claiming, then all that individual's attorney's fees will be covered. If a jury decides to award 20 percent or less, none of their attorney's fees are covered:", "The bill would require the court to award the full amount of reasonable and necessary attorney's fees if the amount to be awarded in the judgment divided by the amount alleged to be owed was at least 0.8, not limited by statute, and recoverable. The court would be prohibited from awarding attorney's fees if this fraction was less than 0.2, or if the claimant failed to provide pre-suit notice.", "We consulted two experts on insurance: Etti Baranoff, an associate professor of finance at Virginia Commonwealth University and a former regulator at the Texas Department of Insurance, and Dalit Baranoff, a historian of insurance policy who runs the Risks and Consequences blog.", "They told us the bill is designed to discourage consumers from taking a claim to court and filing exaggerated claims, but otherwise doesn't change the process of settling claims out of court.", "HB 1774 should not have any effect on homeowners’ ability to recover claims from insurers. The law has nothing to do with payment of insurance claims. It only applies if a lawsuit is involved. The vast majority of insurance claims will be settled without any dispute. Where it does come into play, is if a policyholder disagrees with an insurance settlement, in which case litigation is still an option.", "This is where the 61-day waiting period comes into play, which the Baranoffs say is \"meant to encourage mediation and out-of-court settlement\", and the 80/20 rule in the new law will make it harder for people to recoup their legal costs if they decide to sue. The reasoning behind this, according to the Baranoffs, is to discourage inflated or exaggerated claims, since claimants will be less likely to be awarded 80 percent or more of a relatively large claim and are therefore more likely to have to pay some attorney's fees if they do.", "Indeed, the stated purpose of HB 1774 was to stop a historic increase in the number of hailstorm-related property damage insurance claims, something the bill's sponsor State Representative Greg Bonnen called \"the worst lawsuit abuse we have in the state\" (Relevant portion begins at 3:50).", "Tanya Pierce, Associate Professor of Law at Texas A&M University, previously practiced in the area of complex litigation and insurance coverage. She told us there is only one potential benefit to homeowners in filing a written claim before 1 September 2017:", "[Filing a written claim with the insurance company before 1 September] protects them from a small provision of the act that limits the insurance company's liability on the interest that they would have had to pay as additional damages.", "Again, however, this benefit only accrues if the homeowner later decides to sue the insurance company.", "Under current law, Pierce says, an insurance company would have to pay 18 percent interest on whatever they owed in the event that a consumer successfully sues them for a delayed payment. Under the new law, she points out, companies would have to pay a lower rate of interest arrived at by adding 5 percent to the interest rate determined under Sec. 304.003, Financial Code (Sec. 2c).", "So there is a potential benefit in filing a claim before 1 September 2017, but only if you then later file a successful lawsuit in the event of a dispute over your payment.", "Conclusion", "The new law will not have a direct effect on insurance claims that are settled out of court, and most insurance claims are settled out of court. However, the law could make it slower and more difficult for homeowners to get paid what they believe they are owed if they start litigation after 1 September 2017. It will also make suing insurance companies more financially risky.", "If a consumer were to file a lawsuit against their insurance company before 1 September, they could experience a significant benefit from having done so. However, if their home has been extensively damaged just before 1 September 2017 (by historically catastrophic flooding, for example), it is extremely unlikely they would be able, practically speaking, to find and hire an attorney and file a suit before 1 September.", "They would also have to have a reasonable basis to sue — a dispute over their claim, or an insurance company's refusal to pay, for example — a process that there simply wasn't time for between the arrival of Tropical Storm Harvey on 26 August and the enactment of the new law on 1 September.", "The only potential benefit from filing a claim before 1 September is that if someone later decides to sue the insurance company and wins, the company will be obliged to pay them the higher, pre-September rate of interest on what they owe.", "The claims contained in viral Facebook posts on 27 August 2017 are a largely accurate description of the provisions of HB 1774, but they do lack important context and do not make it clear to readers that the law only affects how claims are dealt with in the event that someone decides to sue an insurance company. These posts do not include that most insurance claims are settled out of court, and will therefore not be directly affected by the change in the law.", "Bonnen, Rep. Greg.  \"H.B. 1774.\"\r\n  Texas House of Representatives.  26 May 2017", "House Research Organization.  \"Bill Analysis - H.B. 1774.\"\r\n  Texas House of Representatives.  4 May 2017", "Texas Department of Insurance.  \"Interim Charges: the Cost of Weather-Related Property Claims and Related Litigation.\"\r\n  Texas Department of Insurance.  1 February 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]