["About this rating", "Maher maintained the joint (or blunt) was real.", "Maher was fined by the FCC.", "During 12 February 2016's episode of Real Time with Bill Maher, host Bill Maher produced and lit what appeared to be a joint as he launched into a talking point about the legality of marijuana.", "The segment focused on the possibility of a repeal of medical or recreational marijuana laws. The light-up occurred at roughly the 5:58 mark (portions of the video contained profanity and drug references):", "Social media users wondered whether Maher (who immediately began coughing before passing the joint to rapper and guest Killer Mike) legitimately smoked pot during his show. Maher addressed the questions via his Twitter account, stating that a 2010 segment involving Zach Galifianakis was staged, but this was legitimate:", "Yup, that was real last night. And, I think, a first. (Zach's was fake but he paved the way!) America, fuck yeah!", "— Bill Maher (@billmaher) February 13, 2016", "On 13 February 2016, the web site Satira Tribune claimed that Maher faced Federal Communications Commission fines of $1.7 million:", "Friday night’s episode of Real Time with Bill Maher ended with Maher lighting up a joint after a pro-marijuana statement. The FCC immediately fined him $1.7 million, the largest fine since Janet Jackson’s wardrobe malfunction during the Super Bowl halftime in 2004.", "There was no truth to the second part of the rumor.  If the name Satira Tribune didn't tip readers off to its status as a fake news site, its tagline (\"satirical news for satirical folks\") provided all necessary information to dismiss the claim.", "As to whether Maher truly lit up during Real Time, the item he lit and inhaled created a distinctly marijuana-like puff of smoke, and Maher himself stood by a claim that the joint was real. On several occasions the comic referenced possessing and using a medical marijuana card, often with the running joke that it was for a \"trick knee,\" \"bad back\" or \"whatever.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]