["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. John McCain speaking with Tom Brokaw, host of “Meet the Press,” in Waterloo, Iowa, in 2008. (Getty Images)", "Sen. John McCain, R-Ariz., has a few pointers for Chuck Todd, who takes the helm of NBC’s Meet the Press on Sept. 7.", "On Aug. 27, McCain appeared on MSNBC’s the Daily Rundown as part of Todd’s weeklong send-off.", "\"I called to congratulate you and as the person who has the most appearances on Meet the Press, I’d be glad to give you a lot of advice and counseling, including the best gotcha questions of the week,\" McCain said. \"And I have one other suggestion, we should change the name from Meet the Press to Meet the World’s Foremost Political Junkie, And Guests. How ‘bout that?\"", "\"69 times,\" Todd quantified. He then rolled a montage of McCain on the show, including a 2008 interview with Tim Russert, who said that Republican Bob Dole had clocked the most appearances but \"there’s still time for (McCain) to catch up.\"", "We wondered, has McCain caught up, meeting the press more times than any other guest?", "We’ve met before", "We reached out to McCain’s office and a spokesperson told us they don’t keep track of those numbers but said McCain surpassed Dole in 2012.", "Meet the Press’ fact page, which needs an update, still lists Dole as the most frequent guest, with 63 appearances. McCain is next with 53 appearances, and Vice President Joe Biden trails McCain by 10 appearances.", "McCain’s 54th appearance came on March 29, 2009, according to recently ousted host David Gregory. Dole still had the record among guests, but Gregory had encouraging words for McCain.", "\"We've been doing the calculations here. We think we can make this up, maybe within a year's time,\" he said.", "Three years later, McCain broke Dole’s record on March 18, 2012, his 64th appearance.", "\"You've been on this show more than I have,\" Gregory joked.", "Based on Meet the Press transcripts, McCain appeared on the show twice more in 2012. He hasn’t made an appearance this year, but went on three times in 2013, which brings his grand total to 69, according to our count.", "For the record, McCain has appeared on the Sunday shows 11 times so far in 2014, but not on Meet the Press.", "It's worth noting that NBC and McCain are using a slightly non-traditional definition of guest. Namely, it excludes journalists who appear on the show to debate the week's big stories. Again, according to NBC's out-dated fact page, the Washington Post’s David Broder clocked 401 Meet appearances, while Chicago Sun Times’  Robert Novak appeared on the show 248 times. Novak and Broder are both deceased.", "Our ruling", "McCain said that he’s \"the person who has the most appearances on Meet the Press.\"", "Technically, multiple people who represent the press side of the meet have McCain beat. Of officeholders, we count McCain as the current leader -- with 69 appearances.", "With that caveat, we rate McCain’s claim Mostly True.", "Email interview with Brian Rogers, spokesperson for John McCain, Aug. 27, 2014", "NBC, Fast facts about the longest-running program in television history, 2014", "NBC, 'Meet the Press' transcript for March 29, 2014, Mar. 29, 2014", "Washington Post, Chuck Todd to replace David Gregory as moderator of Meet the Press, Aug. 14, 2014", "NBC, John McCain surpasses Bob Dole’s record with 64 MTP appearances, Mar. 18, 2014", "NBC, Meet the Press Transcripts, 2014", "NBC, February 17: Denis McDonough, John McCain, Mark Kelly, Gavin Newsom, Carly Fiorina, Alex Castellanos, Feb. 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]