["In the view of the rising coronavirus cases in Maharashtra, the state government has issued fresh restrictions that place a ban on religious, social and political gatherings. The government has also asked people to strictly follow COVID norms, including wearing masks and maintaining social distancing. Among the districts where tight regulations have been imposed is Amravati.", "A video is now circulating on social media with the claim that policemen are thrashing people with lathis in Amravati for violating norms.", "अमरावती शहर के नए रुझान नए लोक डॉन के परिणाम ,महाराष्ट्र, pic.twitter.com/P8v4faEocp", "— S̶e̶w̶a̶K̶ (@Sewak_Iove) February 24, 2021", "Several people have shared both a 45-second video and a longer 2-minute clip of the police action.", "अमरावती में लंगर शुरू", "Posted by Mujahid Siddiqui on Tuesday, 23 February 2021", "A keyword search on YouTube took us to the same video uploaded on March 24, 2020. Its description says, “Lockdown /Curfew in Rajkamal Chowk, Amravati || Police beating people one by one.”", "This video is 2 minutes and 44 seconds long. At the 22nd second, one can spot the board of ‘Assam Tea Center’. We searched the shop at Rajkamal Chowk on Google Earth and confirmed the video was indeed shot in Amravati.", "A report in Lokmat from March 23, 2020 reported about lockdown in Amravati. A public curfew was announced across the country by Prime Minister Narendra Modi on March 22 last year.", "A video of police beating people during lockdown in Amravati last year has been shared as recent after fresh norms were imposed in Maharashtra.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]