["Families will be £1,250 a year worse off in 2020 than they were in 2016, and that's because of Brexit.", "Incorrect.", "The OBR expects real household disposable incomes to be 2.8% higher in 2020/21 than they are at the moment.", "Incorrect.", "“Ordinary families right across the country, by 2020, will be £1,250 a year worse off than they are now. And the reason, without a shadow of a doubt, is Brexit and us heading for a hard Brexit”", "Tim Farron MP, 24 November 2016", "This is wrong. Ordinary families aren’t forecast to be £1,250 a year worse off than they are now by 2020/21.", "The Office for Budget Responsibility (OBR) expects national income in 2020/21 to be about £50 billion lower than it would have been, had the UK voted to remain in the EU. The OBR doesn’t think that the UK’s national income per household will decline between now and 2020, it just expects it to grow more slowly than it did before the referendum.", "That does work out at about £1,250 lower per household. But confusingly, the change in “national income per household” isn’t the same as the change in “household income”.", "National income, or Gross Domestic Product (GDP), measures the size of the economy. In the long term you’d expect a smaller economy to mean lower material living standards for ordinary people, but simply dividing national income by the number of households in the UK won’t tell you how real incomes will change for individual families. That’s affected by other things like taxes, benefits, prices and wages.", "There’s also an unusual amount of uncertainty in this month’s forecast, so it would be wrong to assert the OBR’s expectations like they’re hard facts about the future.", "That said, the Bank of England has actually produced a more pessimistic outlook.", "“In terms of the next few years what the Office for Budget Responsibility said yesterday is that they anticipate real household disposable income - a fair judge for living standards - actually to be 2.8% higher in 2020/21 than it is at the moment”.", "David Gauke MP, 24 November 2016", "This is wrong. The OBR expects real household disposable income (or, what households can buy with their money once they’ve paid certain taxes and taken benefits) to rise by a little over 6% between 2016 and 2021.", "But we’d expect that to happen, because in recent generations household incomes have tended to rise over time. There’s a concern that they’ve risen slowly or not at all since the financial crisis in 2007 and 2008, and there’s a question about whether Brexit will make them rise faster or slower in the future (most economists think slower).", "Since March, the OBR has lowered its expectations for household income growth in 2017, 2018 and 2019, and increased them for household income growth in 2020.", "It’s worth saying that there are a few ways to measure living standards other than household incomes.", "We’re trying to contact David Gauke to see if he’s referring to another source.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]