["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump has made a string of comments lately that have given Republicans heartburn.", "His racially charged attack on a federal judge of Mexican descent, rambling speech following the Orlando shooting and conspiratorial suggestions of President Obama’s terrorist sympathies all have his fellow party members talking about organizing against him at this summer’s Republican National Convention.", "But given his clear win in the primary and nabbing the majority of delegates, such a move would violate party rules and election law, Trump said on NBC’s Meet the Press when asked about whether delegates at the convention could stop him.", "\"I don’t believe that. I think that’s the press. No. 1, they can’t do it legally. No. 2, I worked for one year, and we won all those delegates,\" Trump said. \"So I win 37 states and somebody else won none, and they’re going to be the nominee? I don’t think so.\"", "Trump has a point that this would be against the current rules, but those rules won’t necessarily govern this year’s Republican National Convention. If the delegates decide to change the rules in July and thwart his nomination, it may seem anti-democratic. But it’s within their authority to do so.", "At the heart of the matter are the 112 members of the rules committee — a man and a woman from each state and the District of Columbia. They determine convention guidelines and have the power to change the rules when they convene in Cleveland.", "The committee has the power to make various moves, such as passing a \"conscience clause,\" imposing a supermajority rather than a majority threshold, or releasing all the delegates to support whomever they want rather than the candidate who won their state’s primary or caucus. The Trump campaign actually seemed aware of this in March 2016.", "\"They can throw out the chairman. You can throw out the RNC members. You can do anything,\" Barry Bennett, Trump’s convention strategist, said in March.", "So should the rules committee adopt the wishes of the \"Anybody but Trump\" movement, then the nomination \"is still up to the delegates,\" said Joshua Putnam, a government professor at the University of Georgia.", "In fact, National Review staff writer David French pointed out the only time the delegates were truly bound, according to the rules, was in the party’s only contested convention in 1976.", "Still, having the delegates vote how they wish from the start of the convention would be controversial. Putnam noted that Trump could certainly sue if the conscience clause is adopted. Trump did, after all, secure the majority of delegates and some state party rules and state laws do commit their delegates.", "But Putnam and others say it’s unlikely the courts will decide in Trump’s favor, given how they’ve ruled in the past.", "Here’s how Eric O’Keefe of the Wisconsin Club for Growth and David Rivkin Jr., a constitutional litigator who served in the Reagan and George H.W. Bush administrations, put it in a Wall Street Journal op-ed:", "\"State laws that purport to bind delegates can’t be enforced without violating the First Amendment. A political party is a private association whose members join together to further their shared beliefs through electoral politics, and they have a right to choose their representatives. The government has no business telling parties how to select their candidates or leaders: That would be a serious infringement of the rights to free association and speech.\"", "O’Keefe and Rivkin pointed to two Supreme Court cases — Cousins vs. Wigoda (1975) and Democratic Party vs. Wisconsin ex rel. LaFollette (1980) — that both held states don’t have the authority to override a party’s nominating process. In other words, the parties are in control of themselves.", "In Trump’s case, that means the rules committee’s decision to release the delegates would effectively override a state’s law binding its delegates.", "\"Any time the issue of intraparty politics come up, the court sides with the party,\" said Putnam.", "Our ruling", "Trump said delegates seeking to change the convention rules to prevent his nomination \"can’t do it legally.\"", "Under current rules, the delegates are bound to vote for whomever won their state’s primary or caucus (in most cases, Trump). But if this year’s rules committee votes to change the rules to thwart Trump, it’s well within its authority to do so. And intervention by the courts would be unlikely. Because political parties are private organizations, courts have said they can set their own rules.", "We rate Trump’s claim Mostly False.", "https://www.sharethefacts.co/share/fec8deb7-1f35-4b1d-88c8-76cb4e5954a9", "Correction: A previous version of this story misstated the co-author of the Wall Street Journal op-ed.", "PolitiFact, \"5 questions you have about delegates, answered,\" March 29, 2016", "Politico, \"How an obscure committee could decide the GOP nomination,\" March 14, 2016", "National Review, \"Not a Single Republican Delegate Is ‘Bound’ to Donald Trump,\" June 9, 2016", "Wall Street Journal, \"Release the GOP Delegates,\" June 13, 2016", "Interview with Josh Putnam, government professor at the University of Georgia, June 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]