["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Tammy Baldwin, D-Wis., addresses supporters and workers at the Democratic Party of Rock County office in downtown Janesville, Wis. (File photo)", "Witnesses have been a key point of debate in the lead up to President Donald Trump’s impeachment trial before the U.S. Senate.", "House Speaker Nancy Pelosi, D-Calif., delayed sending the Senate the articles of impeachment while seeking —among other things — a commitment to call witnesses from Republicans who control the Senate. Senate Minority Leader Chuck Schumer, D-N.Y., has vowed to force votes on witnesses and documents in the Republican-controlled chamber.", "Democrats say avoiding witnesses would be tantamount to a cover-up.", "And Wisconsin’s Democratic senator, Tammy Baldwin, said it would also be breaking with centuries of tradition.", "\"Every other impeachment trial the Senate has ever had, including those for other federal officials aside from the two presidential impeachments … has included witnesses,\" Baldwin said in a Jan. 19, 2020, appearance on WISN-TV’s ‘UpFront’ program.", "Have witnesses really been called in every other Senate impeachment?", "Let’s break out the history books.", "The Senate has held just two prior impeachment trials against presidents — Bill Clinton in 1999 and Andrew Johnson in 1868. Both included witnesses.", "The Senate heard testimony from 41 witnesses in the Johnson proceeding, and three for Clinton, including Monica Lewinsky. In the Clinton case, House managers obtained depositions from the witnesses and excerpts of that testimony were shown to the Senate, the Washington Post reported.", "But those aren’t the only impeachments the Senate has heard. The U.S. Senate website lists 19 people prior to Trump who were impeached by the House, including 14 judges, a senator, a Supreme Court justice and the secretary of war.", "Cases against three of the judges were halted before a trial when the judges resigned, and the case against Sen. William Blount in 1799 — the first impeachment in U.S. history — stopped before trial when the Senate determined it didn’t have such jurisdiction over one of its own.", "That leaves 13 impeachment trials against other federal officials dating back to 1804. Eight of those yielded a guilty verdict, and five a not-guilty finding.", "But all of them involved witnesses, said Noah Bookbinder, executive director of the Citizens for Responsibility and Ethics in Washington.", "\"I think there was a little bit of a sense — as there often is with things like Senate procedure — that the precedent is ambiguous and can be used however you want it,\" Bookbinder told PolitiFact Wisconsin. \"We found that it’s not ambiguous in this case. … Every Senate impeachment trial that has been completed has involved witnesses.\"", "Lawyers and researchers from the organization dug through Congressional archives and historical records for every impeachment for Bookbinder’s Jan. 9, 2020, op-ed in the Washington Post. His group is a nonpartisan, nonprofit watchdog that seeks to promote ethics in government and reduce the influence of money in politics.", "Asked for evidence of Baldwin’s claim, her staff simply pointed to the Washington Post rundown.", "Bookbinder’s piece also noted three recent trials have involved witnesses not called during the House phase of the impeachment proceedings: Judge Walter Nixon in 1989, Clinton and Judge Thomas Porteous in 2010.", "The piece said in part:", "\"Although at least one senator has suggested that the Senate has no duty to go beyond testimony obtained by the House, that has happened on multiple occasions. The Senate heard from seven witnesses at Walter Nixon’s trial who had not testified before the House; three at Clinton’s trial who also had not testified before the House; and 17 at Porteous’s trial who had not testified before the House.\"", "Baldwin said every impeachment trial in Senate history has included witnesses.", "The research backs up her claim, though there are a few things to note. The Clinton impeachment involved video depositions, not live witnesses. And four people impeached by the House didn’t have a full trial in the Senate.", "But the 15 people who faced a full trial in the Senate all saw witnesses called.", "We rate this claim True.", "WISN-TV, 'UPFRONT' recap: Baldwin hopes for fair, honest impeachment trial, Jan. 19, 2020", "The Washington Post, The Senate has conducted 15 impeachment trials. It heard witnesses in every one, Jan. 9, 2020", "Interview with Noah Bookbinder, executive director, Citizens for Responsibility and Ethics in Washington, Jan. 21, 2020", "U.S. Senate, Impeachment, accessed Jan. 20, 2020", "U.S. Senate, The Impeachment of Andrew Johnson (1868) President of the United States, accessed Jan. 21, 2020", "Email exchange with Kasey Hampton, press secretary for U.S. Sen. Tammy Baldwin, Jan. 20-21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]