["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A West Virginia State Police Officer near Philip Barbour High School in Philippi, W.Va., after a \"hostage-like\" situation occurred in the cafeteria of the school. No injuries were reported. (AP)", "Former state Sen. Richard Ojeda, D-W.Va., recently lamented the toll of gun-related violence in the United States.", "\"I’m loving watching these GOP Senators and members of Congress saying the same old stuff concerning gun violence and listening to them get their asses handed to them by citizens that are tired of seeing 75-100 folks killed a month and over 200 wounded by senseless gun violence,\" Ojeda tweeted on Aug. 20.", "I’m loving watching these GOP Senators and members of Congress saying the same old stuff concerning gun violence and listening to them get their asses handed to them by citizens that are tired of seeing 75-100 folks killed a month and over 200 wounded by senseless gun violence.", "Is the number that large? When we reached out to Ojeda, he said we should look at the federal statistics and \"just do the research.\"", "We did, and we found that his numbers were actually an understatement.", "The official data from the Centers for Disease Control and Prevention provides the number of gun-related deaths nationally. The most recent year for which data is available is 2017. Here are the figures:", "Homicides: 14,542 deaths by guns", "Suicides: 23,854 deaths by guns", "Other: 1,377 deaths by guns", "Total deaths by guns: 39,773", "That works out to 3,314 total gun-related deaths nationally per month, and 1,212 gun-related homicides per month. Both figures are much higher than Ojeda’s estimate of 75 to 100 per month.", "However, Ojeda’s figures would have been in the ballpark if he had been talking about gun-related deaths per day. There are about 109 gun-related deaths per day, about 40 of which are homicides and 65 of which are suicides.", "We also checked to see if the numbers work for firearm deaths in West Virginia alone. They don’t -- in this case, the number is too small. West Virginia saw 348 total deaths from guns in 2017, which works out to 29 per month, or close to one a day.", "What about injuries? The CDC has data on that as well.", "In 2015, the most recent year available, there were 84,997 non-fatal injuries by guns nationally. That works out to 7,083 per month, a number well above the 200 Ojeda cited.", "Here, too, the data fits better if it’s calculated on a per-day basis. There were about 233 non-fatal injuries per day. That’s not far off from the number Ojeda offered.", "All told, though, his numbers are far off from what he said in the tweet.", "Our ruling", "Ojeda tweeted that \"75-100 folks (are) killed a month and over 200 wounded by senseless gun violence.\"", "In fact, Ojeda understated the number of deaths and injuries from guns. His numbers are roughly right for gun deaths and injuries per day, rather than per month.", "We rate his statement Mostly False.", "Richard Ojeda, tweet, Aug. 20, 2019", "Centers for Disease Control and Prevention, WISQARS--Fatal Injury Reports, National, Regional and State, 1981 - 2017, accessed Oct. 16, 2019", "Centers for Disease Control and Prevention, WISQARS--Nonfatal Injury Reports, 2000-2017, accessed Oct. 16, 2019", "Text interview with Richard Ojeda, Sept. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]