["About this rating", "The U.S. House Intelligence Committee impeachment hearing into the activities of President Donald Trump held on Nov. 15, 2019, involved hours of testimony from former U.S. Ambassador to Ukraine Marie Yovanovitch, who was questioned by both Democratic and Republican members of the House.", "When the committee's activities resumed after a break that day, the committee’s ranking minority member, Republican Rep. Devin Nunes of California, attempted to yield a portion of his time to Rep. Elise Stefanik, a junior Republican colleague from New York, for a \"few quick questions.\"", "Stefanik's attempts to pose questions to Yovanovitch were repeatedly interrupted and cut off by committee Chairman Adam Schiff, D-California, who suspended her questioning and declined to recognize her on the grounds that Nunes' yielding his time to her was contrary to the rules established for the committee:", "“You’re gagging the young lady from New York?” Nunes declared, as Stefanik testily asked, “What is the interruption for this time?” and complained that it was the \"fifth time\" that Schiff had \"interrupted duly elected members of Congress.\" When Nunes attempted to intercede on Stefanik's behalf by asserting that \"whoever controls the time can yield to whoever they wish,\" Schiff calmly stated that Nunes was \"not accurate\" and that the Republicans' actions were contrary to House Resolution 660:", "Nunes: I know Ms. Stefanik you had a few quick questions for the ambassador. I yield to you Ms. Stefanik.", "Stefanik: Thank you, Mr. Nunes. Ambassador Yovanovitch ...", "Schiff: The gentlewoman will suspend. The gentlewoman will suspend.", "Stefanik: What is the interruption for this time? It is our time.", "Schiff: The gentlewoman will suspend, you’re not recognized. Mr. Nunes ...", "Nunes: I just recognized Ms. Stefanik.", "Schiff: Under the House Res. 660 you are not allowed to yield time except to minority counsel.", "Stefanik: The ranking member yielded time to another member of Congress.", "Schiff: Nope, nope. That is not accurate.", "Nunes: You’re gagging the gentlewoman from New York?", "Stefanik: Ambassador Yovanovitch, I want to thank you for being here today ...", "Schiff: The gentlewoman will suspend, you’re not recognized.", "Stefanik: This is the fifth time that you have interrupted elected members of Congress, duly-elected members of Congress ...", "Schiff: The gentlewoman will suspend.", "Nunes: Mr. Chair, we control the time and customary to this committee, whoever controls the time can yield to whoever they wish. If we have members of Congress that have a few questions, it seems appropriate that we would be able to let Ms. Stefanik ask her questions.", "Schiff: Mr. Nunes, you or minority counsel are recognized.", "Those events led to claims by Republicans and right-leaning news media that Schiff had unfairly barred Republicans from asking questions during the hearing:", "But Schiff was correct, and the Republicans were wrong. Under the resolution passed by the House two weeks earlier, at that point in the proceedings the chair and the ranking minority member of the committee (i.e., Schiff and Nunes) could use their allotted 45 minutes to either yield to staff counsel or pose questions themselves, but not yield time to \"whoever they wish[ed].\" By attempting to give up some of his time to Stefanik, Nunes was violating the committee's established rules:", "Only the chair and ranking minority member, or a Permanent Select Committee employee if yielded to by the chair or ranking minority member, may question witnesses during such periods of questioning. At the conclusion of questioning pursuant to this paragraph, the committee shall proceed with questioning under the five-minute rule ...", "Stefanik was able to pose her inquiries later in the proceedings that day, when committee members were allotted time to question Yovanovitch:", "In a transparent stunt, Trump and Republicans claimed today that Rep. Stefanik “wasn’t allowed to talk”—the numbers say different: pic.twitter.com/pfPFcCaHos", "— Will Ragland (@citizenwillis) November 15, 2019", "Jim Newell opined in Slate that the controversy over Schiff's refusal to recognize Stefanik was \"manufactured,\" as everyone on the committee was familiar with the established rules and had conducted a hearing under those same rules just two days earlier:", "The episode was entirely a stunt, and the incredulity on Nunes and Stefanik’s faces manufactured.", "Both Nunes and Stefanik knew what the impeachment resolution said about the rules of the hearing. The entire committee knows what they are. I heard them complain about this particular rule -- that the ranking member would only be able to yield time to counsel during these 45-minute periods, ahead of the usual five-minute rounds for each member that would come immediately afterward -- when the resolution was released, and I watched them debate it in the Rules Committee. [The previous] hearing had already proceeded under precisely the same rules, with Nunes obediently sharing his time with his committee counsel, Steve Castor, and no one else. But, hey, they produced their content: Cult leader Adam Schiff shuts up a Republican woman. Coming soon to five hours of prime-time Fox News coverage.", "Later in the hearing, when each member was allotted five minutes for questioning, Stefanik would spend her share submitting into the record a bunch of HuffPost and Vox articles about Adam Schiff, reciting each headline out loud, before yielding back the remainder.", "Newell, Jim.   “How Republicans Tried to Manufacture Outrage During Friday’s Impeachment Hearing.”\r\n       Slate.   15 November 2019.", "U.S. House of Representatives.   “H. Res. 660.”\r\n       31 October 2019.", "Muñoz, Gabriella.   “Procedural Clash Kicks off Republican Questions of Marie Yovanovitch.”\r\n       The Washington Times.   15 November 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]