["The video was shared in this blog post on January 7, 2021.", "Its caption states: \"Suspect Jonel Nuezca who killed a mother and her son in Tarlac was released past 8 last night. Watch the video for more details.\"", "The embedded video shows a two-second clip of a news report in which the anchor states: “Because of lack of evidence...”", "The post circulated online after Filipino police officer Jonel Nuezca was charged with murder after the fatal shooting of a mother and son in the northern Philippines in December 2020. He has pleaded not guilty to the charges, CNN reported here on January 10, 2021.", "The same video was also shared alongside a similar claim in blogs here, here and here; and on Facebook here and here.", "The claim is false.", "Keyword searches on Google found the video clip was taken from this broadcast by local television channel GMA News. It was posted on YouTube on January 6, 2021. The clip in the misleading blog posts corresponds to the GMA News video’s three-minute 40-second mark.", "In the GMA News video, the anchor is in fact speaking about the death of a Filipino flight attendant, not reporting on the Nuezca case.", "“Because of lack of evidence, three suspects in the death of flight attendant Christine Dacera have been released,” the anchor states.", "Below is a screenshot comparison of the video in the misleading posts (L) and the GMA News video (R):", "In response to the misleading posts, a spokesperson for Tarlac police told AFP that Nuezca had not been released.", "\"His offence is non-bailable,\" the spokesperson said by phone on January 8, 2021.", "Multiple keyword searches found no reliable media or government reports to support the claim in the misleading blog posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]