["Conspiracy theorists who claimed former President Donald Trump would reveal a cabal of deep-state pedophiles have been searching for new explanations that align with that belief after his term officially concluded Jan. 20.", "One proposes that the U.S. military picked up the baton from Trump, making the baseless claim that President Joe Biden’s inauguration was faked and that the military is in control of Washington.", "The conspiracy theory QAnon predicts the mass arrest of a “satanic cult” of pedophiles and cannibals during an event called “The Storm.” Some Democratic politicians and left-leaning celebrities are believed to be elite cult members, USA TODAY has reported.", "More:What is QAnon?", "In a Facebook post that has been shared hundreds of times, a user wrote that Trump “stepped away for a short time to let the military run the show.”", "“The ‘go’ decision, when it comes, will be made by our trusted generals and not by President Trump or his cabinet,” the poster wrote Feb. 1 in a message that draws from a 3-year-old post on the 4chan imageboard.", "The post also claims that Trump sent a message to followers via a photo of the former president staring at a picture of former President Abraham Lincoln, who he wrote “used the military to save the Republic.”", "The user did not respond to a request for comment.", "While the post claims that the U.S. military is “in control,” the U.S. Constitution names the president as commander in chief over the military.", "Two scholars selected by the National Constitution Center wrote that “all agree” the commander in chief clause has two purposes: “it ensures civilian superintendence over the military – and, as such, the subordination of the military to civilian (and democratically accountable) control ... (and) it places such civilian superintendence in the hands of a single person.”", "That means President Joe Biden controls the military.", "Congress certified Biden as the winner of the 2020 election on Jan. 6 after a pro-Trump mob broke into the U.S. Capitol in a riot that initially disrupted the counting of Electoral College votes. Biden then was sworn in during a public inauguration outside the Capitol on Jan. 20.", "The post, along with other QAnon conspiracy theorists, have claimed that Biden’s inauguration was faked, but USA TODAY has debunked those claims.", "Although the post accurately alludes to Lincoln’s use of the military during the Civil War, Lincoln was commander in chief at that time. Lincoln first called in a state militia after a Confederate attack on Fort Sumter, according to Smithsonian magazine, and was commander in chief of an army that grew from 16,400 men as the war began to 637,000 a year later.", "As a former president, Trump does not control the U.S. military.", "The image of Trump staring at a picture of Lincoln was shot in August 2020 by a photographer with Agence France-Presse, an independent news organization.", "Fact check:Viral photo shows 2011 Wisconsin protests, not 2018 Kavanaugh protests at U.S. Capitol", "After the Jan. 6 riot at the U.S. Capitol, the National Guard mobilized about 26,000 troops in Washington for Biden’s inauguration, according to the guard.", "U.S. Marshals deputized about 2,000 of those troops, as the post pointed out. A spokesman for the U.S. Marshals said National Guard troops were given temporary law enforcement power to provide additional aid during the inauguration.", "Spokesman Dave Oney said the troops needed federal law enforcement power because Washington is federal jurisdiction, as enumerated by the U.S. Constitution. It is not a “foreign state” as the post claims.", "After the inauguration, the National Guard began to draw down troops in the District. As of Feb. 2, about 7,800 National Guard troops remained to aid the U.S. Secret Service, the U.S. Capitol Police, the Metropolitan Police Department and the U.S. Department of Energy, said Maj. Matt Murphy, a guard spokesman, in an email.", "The National Guard expects to draw down to between 5,000 and 7,000 troops by mid-March, Murphy said.", "During a Jan. 25 media briefing, acting Army Secretary John E. Whitley said National Guard troops deployed in Washington report to the commander of the D.C. National Guard. That commander reports to Whitley, who answers to the secretary of Defense, who reports to the president.", "D.C. Mayor Muriel Bowser is not part of that chain of command, as the post claims. While National Guard troops did operate out of a parking garage in Washington, according to Snopes, Army Maj. Gen. William J. Walker said during the Jan. 25 briefing that each also had access to a hotel room when they were off duty.", "The post also claims that the Pentagon has sent more than 100,000 troops who are not part of the National Guard to Washington. About 2,750 troops from other branches of the military were present for the inauguration, said Lt. Col. Chris Mitchell, spokesman for the Department of Defense.", "About 2,000 of those were \"ceremonial,\" used for formation marches and bands, he said. The remaining 750 were stationed for \"clean up\" in the event of an emergency.", "All 2,750 have \"gone home,\" Mitchell said.", "A post suggesting that the U.S. military is in control of the federal government is FALSE. The conspiracy-laden post ignores that President Joe Biden is commander in chief of the military, as outlined in the U.S. Constitution, and baselessly claims that Biden’s inauguration was “fake.” While the National Guard maintains about 7,800 troops in Washington, D.C., military personnel have outlined a chain of command that ends with Biden and a plan to draw down to between 5,000 and 7,000 troops in response to requests for aid. Another 2,750 troops from other service branches already have left Washington following the inauguration.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook"]