["President Donald Trump speaks with reporters as he departs the White House, Friday, May 1, 2020, in Washington. Trump was en route to Camp David, Md. (AP)", "Michigan Secretary of State Jocelyn Benson announced May 19 that all registered voters in Michigan will be sent an application to vote by mail in the August and November elections — not a ballot.", "About 1.3 million of Michigan’s 7.7 million registered voters are already signed up to receive absentee ballot applications automatically. Additionally, some jurisdictions are mailing applications to all local registered voters.", "Nationwide, many elections officials have said they will mail applications for an absentee ballot to reduce crowds at the polls amid the pandemic.", "President Donald Trump’s crusade against voting by mail has put him at odds with the truth again.", "This time, he took aim at Michigan’s latest effort to expand access to absentee ballots.", "\"Breaking: Michigan sends absentee ballots to 7.7 million people ahead of Primaries and the General Election,\" Trump tweeted May 20. \"This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path!\"", "Trump is wrong. Michigan’s Secretary of State Jocelyn Benson announced May 19 that her office was mailing all registered voters an application to vote by mail in the August and November elections, not a ballot.", "People who complete, sign and return the application would receive a ballot about six weeks before the election.", "The action follows a constitutional amendment to expand access to absentee ballots, which Michiganders supported overwhelmingly in a 2018 ballot issue.", "We emailed the White House and the Trump campaign to ask for the basis of his claim  and did not get a reply. Trump deleted his tweet about Michigan on the same day and then wrote a new tweet  with mostly the same wording, referring to \"absentee ballot applications\" but still alleging an illegal\" action by Benson.", "Trump won Michigan narrowly in 2016 and has criticized efforts to expand voting by mail this year, falsely linking it to ballot fraud and arguing that it disfavors Republicans.", "Benson, a Democrat elected in 2018, responded to Trump on Twitter and in a written statement.", "\"Hi I also have a name, it’s Jocelyn Benson. And we sent applications, not ballots. Just like my GOP colleagues in Iowa, Georgia, Nebraska and West Virginia,\" Benson tweeted.", "Hi! 👋🏼 I also have a name, it’s Jocelyn Benson. And we sent applications, not ballots. Just like my GOP colleagues in Iowa, Georgia, Nebraska and West Virginia. https://t.co/kBsu4nHvOy", "All four of those states indeed sent voters applications to receive absentee ballots for their primaries.", "Amid the pandemic, some state governments have already changed laws and policies to expand the option of voting by mail.", "At the local level, some elections officials in heavily Democratic and Republican counties around the country are mailing voters information on how to apply for an absentee ballot. Election officials say voting by mail can help reduce crowds at the polls and enforce social distancing to reduce the spread of COVID-19.", "A recent amendment to Michigan's state constitution guarantees all registered voters the option to vote by absentee ballot for any reason. Michigan voters backed the amendment overwhelmingly in a 2018 ballot issue, along with several other measures to expand voter participation.", "That means all voters have the right to vote by mail, \"so it is within the Secretary’s authority, as the chief elections administrator in the state, to mail applications,\" Benson’s spokeswoman, Tracy Wimmer, told PolitiFact.", "Various entities, including both major parties and advocacy organizations, routinely send absentee-ballot applications in Michigan.", "Nothing in state law prohibits the secretary of state from mailing out absentee-ballot applications, said Sharon Dolente, a voting rights strategist for the ACLU of Michigan.", "\"The Secretary of State in Michigan has broad responsibilities for managing elections and it fits within her authority,\" she said.", "Election officials in Michigan have faced legal challenges to their authority to mail out absentee ballot applications automatically. But Benson’s office said those cases involved actions by local clerks, not the secretary of state, who is the state’s chief election officer. And those challenges were decided more than a decade before the constitutional amendment guaranteeing access to an absentee ballot.", "The absentee ballot voter application allows voters to check a box to receive absentee ballots for all future elections and has spaces for voters to provide their addresses for receiving the August and November election ballots.", "Of Michigan’s 7.7 million registered voters, about 1.3 million are on a \"permanent absentee voter\" list, which means their local election clerk automatically mails them applications ahead of every election, Benson wrote in her May 19 press release.", "It will cost the state about $4.5 million to mail out the applications to every voter, and the state is paying for that through the federal CARES Act.", "In the May 5 local elections in Michigan, the majority of voters cast ballots by mail.", "RELATED: How battleground states are preparing for the pandemic election’s massive increase in voting by mail", "It’s unclear what authority Trump thinks he has to \"hold up funding to Michigan.\" The CARES Act and 2020 Help America Vote Act funds made clear federal money could be used to handle increased voting by mail, said Myrna Perez, director of voting rights and elections at the Brennan Center at New York University School of Law.", "Trump tweeted that Michigan’s \"rogue\" secretary of state sent absentee ballots to 7.7 million people \"illegally and without authorization\" ahead of the primaries and the general election.", "Trump is wrong. The day before his tweet, the Michigan secretary of state announced that she was sending an application for absentee ballots to registered voters, not an actual ballot.", "The state constitution guarantees registered voters access to an absentee ballot.", "We rate this statement Pants on Fire.", "President Donald Trump, Tweet, May 20, 2020", "Michigan Secretary of State Jocelyn Benson, Tweet, May 20, 2020", "Michigan Secretary of State, Benson: All voters receiving applications to vote by mail, May 19, 2020", "The Courier (Iowa), Iowa election officials pushing vote by mail for June primary, April 8, 2020", "West Virginia Secretary of State Mac Warner, Warner says Absentee Ballot Application Postcards are now being sent to all 1.2 million registered voters, April 8, 2020", "Iowa Secretary of State Paul Pate, MEDIA RELEASE: Secretary Pate to mail absentee ballot request form to every registered voter, March 31, 2020", "11Alive, Secretary of State's office mails absentee ballot applications, April 6, 2020", "Nebraska Secretary of State Robert Evnen, The Nebraska 2020 Statewide Primary Election is May 12, March 26, 2020", "Brennan Center, Bipartisan Support for Expanded Mail Voting for 2020 Elections, April 15, 2020", "Click on Detroit, Fact-check: Michigan is not sending absentee ballots to every registered voter, May 20, 2020", "Detroit Free Press, Trump threatens to stop funding for Michigan if absentee ballots sent to all voters, May 20, 2020", "Detroit Free Press, Secretary of State: All Michigan voters will get absentee ballot applications at home, May 19, 2020", "Detroit Free Press, Voters approve Proposal 3, bringing sweeping changes to Michigan's election law, Nov. 6, 2018", "New York Times, Trump Steps Up Attacks on Mail Vote, Making False Claims About Fraud, May 20, 2020", "Brennan Center’s Wendy Weiser, Twitter thread, May 20, 2020", "State of Michigan Court of Appeals, Greg Fleming vs Macomb County Clerk, June 26, 2008", "State of Michigan Court of Appeals, Maureen D Taylor vs Jack Currie, Oct. 25, 2007", "Telephone interview, Cindi Allen, spokeswoman for Nebraska Secretary of State Robert Evnen, May 20, 2020", "Email interview, Ari Schaffer, spokesman for Georgia Secretary of State Brad Raffensberger, May 20, 2020", "Telephone interview, Myrna Perez, director of voting rights and elections at the Brennan Center at New York University School of Law, May 20, 2020", "Email interview, Tracy Wimmer, spokeswoman for Michigan Secretary of State Jocelyn Benson, May 20, 2020", "Telephone interview, Jake Rollow, spokesman for Michigan Secretary of State Jocelyn Benson, May 20, 2020", "Telephone interview, Sharon Dolente, ACLU of Michigan voting rights strategist, May 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]