["About this rating", "A photograph of a dog sleeping on a tombstone is frequently shared on social media along with a brief caption explaining the image's alleged backstory.", "According to the viral message, the dog's name is Captain, the grave belongs to his master, and the animal has been sleeping in that spot every night for several years:", "It has been 7 years. The cemetery does not close the gates until he arrives every night. His name is Captain. He sleeps by his master's grave every night. ?? Semper Fi!", "This photograph is genuine, and the caption corresponds to a published news story, but these two items are not related. In fact, this same story has also been inaccurately attached to at least one other photograph featuring a completely different dog lying on a completely different grave:", "Neither of these images features a dog named Captain (or Capitán) who had slept on his owner's grave for several years. However, the caption refers to an article published in the Spanish-language newspaper La Voz in September 2012 (translated via Google):", "Captain is a mongrel dog, a mixture of German shepherd and another breed. He arrived at the house of Damián Guzmán (13), in Villa Carlos Paz, in mid-2005 as a surprise gift from his father, Miguel. The gift did not please Veronica Moreno (52), Damian's mother, as much, because it meant more housework. A common story, but another one very special, began on March 24, 2006, when Miguel died.", "Days passed and nobody noticed the absence of Captain. He had left the house, like Miguel.", "When the dog returned, he sniffed every corner and left. \"He stayed for a while living outside, a few meters away, half a block from the house,\" says Verónica.", "Then the dog disappeared. They thought him dead or adopted by another family. \"Until one day, when we went with my son to the cemetery, we found him there. Damien started shouting that he was Captain and the dog approached us barking, as if he were crying,\" says Verónica with emotion.", "But when Damien and his mother returned home, Captain did not follow them, although they called him. He stayed in the cemetery, he stayed with Miguel.", "What surprises those who know the story is that Miguel died in the Carlos Paz hospital, and his body was transferred from there to a house of worship, far from his home. According to the family, neither that day nor any other day had the dog followed them to the cemetery where Miguel was buried.", "We are skeptical about some aspects of Captain's story. For instance, the notion that the dog was able to locate his owner's grave several days after he had been buried despite never having previously been there seems, to say the least, a bit far-fetched. However, Héctor Baccega, the director of the Municipal Cemetery of Villa Carlos Paz, insists that the story is true:", "\"Thats not all\". Héctor Baccega is the director of the Municipal Cemetery of Villa Carlos Paz. He knows and confirms every detail of this story, but adds an element that creates another point of amazement: \"The dog appeared here alone and went around the cemetery, until he also found the grave of his owner. Nobody took him there. And that's not all: every day, at six o'clock in the afternoon, he goes and lies down in front of that grave, \"he says.", "\"Captain goes through the cemetery with me every day. But when that time comes he goes to the bottom, where the grave of his master is, \"says Baccega, before stopping to reflect: \"It teaches us a lesson. I think that we humans should appreciate more the memories of those that are leaving us. Animals teach us such fidelity. \"", "Captain's captivating story reached a bitter-sweet conclusion in February 2018, more than five years after La Voz' initial report, when the dog passed away. According to the Spanish newspaper, Captain's cremated remains were scattered near the entrance of the cemetery and a monument will be erected in his memory:", "This viral Facebook post refers to a dog in Argentina who reportedly lived his life in a graveyard after the death of his owner in 2006. The photograph included in this message, however, shows a different dog at another location.", "Kindelan, Katie.   \"Loyal Dog Spends Six Years at Master's Grave.\"\r\n    ABC News.    14 September 2012.", "La Voz.   \"Carlos Paz: El Perro Fiel Capitán Tendrá un Monumento en El Cementerio Donde Descansa Su Dueño.\"\r\n    20 March 2018.", "La Voz.   \"Adiós, Capitán, El Perro de Carlos Paz Que Fue Leyenda y Conmovió Al Mundo.\"\r\n    20 February 2018.", "La Voz.   \"Capitán y su Historia de gran Fidelidad.\"\r\n    12 September 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]