["“Washington DC’s mayor is exempting members of Congress who attended John Lewis’ funeral in Georgia from her mandatory 14-day quarantine. Let that sink in,” said an August 2, 2020 post shared 14,000 times on the Facebook page of Conservative News Today.", "The owner of the page is BizPac Review, which posted the same claim on its own page.", "Both pages include links to the BizPac Review website, which says it provides “news and analysis unfiltered by the liberal bias that has eroded the media’s credibility.” Among the “top conservatives” who have touted it are Donald Trump Jr, the president’s son, according to the site.", "House Speaker Nancy Pelosi and around 50 other members of Congress attended the funeral of Lewis at Ebenezer Baptist Church in Atlanta, Georgia on July 30. Republican Representatives Barry Loudermilk of Georgia and Kevin Brady of Texas were among those present.", "Lewis’s body had earlier lain in state at the US Capitol, a rarely-bestowed honor.", "He represented a Georgia district in the House of Representatives for 33 years until his death from cancer on July 17.", "His funeral was held three days after an order took effect from DC Mayor Muriel Bowser “that persons self-quarantine for 14 days after traveling for non-essential purposes from high-risk areas to the District,” in order to curb the spread of COVID-19.", "“Essential travel” -- exempt from self-quarantine -- is defined under an earlier order from the mayor as including that related to “essential government activities” as well as travel “required to visit a house of worship.”", "“Government activity is essential, and the Capitol of the United States is exempt from the Mayor’s Order,” Bowser’s press secretary Susana Castillo told AFP by email.", "Washington DC’s government lists Georgia as one of 27 high-risk states “where the seven-day moving average of daily new COVID-19 cases is 10 or more per 100,000 persons.”", "The mayor’s order states that those who return to the US capital after essential travel to a high-risk state must still monitor themselves for symptoms of COVID-19 for two weeks, even though they do not have to self-quarantine.", "AFP Fact Check has debunked more than 570 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]