["About this rating", "Rep. Ocasio-Cortez was a vocal opponent of Amazon's opening a second headquarters in Queens, New York City.", "Ocasio-Cortez was not the sole force behind Amazon's withdrawing their plan to open a site in New York City, and many other public officials and residents opposed the plan as well. Long Island City, where HQ2 was slated to be located, is also not in her district.", "In mid-February 2019, social media users shared a meme containing a fabricated quote seemingly attributed to newly elected U.S. Rep. Alexandria Ocasio-Cortez of New York:", "We found no record U.S. Rep. Ocasio-Cortez made that remark or said anything that could reasonably be paraphrased as such. The faux quote also encapsulated the mistaken belief that the Democrat representing New York's 14th Congressional District was solely responsible for \"chasing\" Amazon out and driving them to cancel their plans to establish a second headquarters in that area.", "In late 2018, reports emerged that New York state and city officials, including Gov. Andrew Cuomo and Mayor Bill de Blasio, were aggressively lobbying the Seattle-based, retail-and-delivery giant to open a second headquarters (\"HQ2\") in New York. But that news also spurred public backlash over New York's proposal to offer $3 billion in publicly funded incentives and subsidies to Amazon.", "Although Ocasio-Cortez was a vocal opponent of the HQ2 project, many other local and state legislators and residents were also opposed to the plan. For example, speaking to the crowd at a 14 November 2018 protest, New York City Councilman Jimmy van Bramer criticized the proposal, saying: \"When Jeff Bezos needed $3 billion, the governor and the mayor found it sure damn quick. The governor and the mayor conspired secretly to cut a deal with Jeff Bezos to the exclusion of everyone else.\"", "Furthermore Long Island City falls into the 12th Congressional district and is represented by Rep. Carolyn Maloney, not Ocasio-Cortez.", "Criticism of the Amazon deal continued to grow in New York, and after a 30 January 2019 City Council meeting, Curbed New York reported the proverbial welcome mat was gone: \"Council members blasted the officials with a laundry list of concerns including Amazon’s union opposition, its investment in the city, and accusations that city and state officials failed to accurately calculate the costs of bringing the conglomerate to Long Island City.\"", "Residents and activists began sharing critical social media posts using the hashtag #noAmazonNYC:", "Dozens of people here in Queensbridge Houses this morning. People are joining a canvassing blitz against Amazon all across Queens — from Flushing to LIC. Our neighbors are here to let Amazon, our city + state governments know that, “QUEENS IS NOT FOR SALE!” #noAmazonNYC pic.twitter.com/EPMd6toZeW", "— PrimedOut NYC (@PrimedOutNYC) February 9, 2019", "On 14 February 2019, Amazon announced they were no longer planning to build HQ2 in Queens, blaming the decision on \"a number of state and local politicians [who] have made it clear that they oppose our presence and will not work with us to build the type of relationships that are required to go forward with the project we and many others envisioned in Long Island City.\"", "In an op-ed column published a few days later, de Blasio reversed his previous support for the retail giant, slamming their decision to suddenly back out of New York:", "There was a clear path forward. Put simply: If you don’t like a small but vocal group of New Yorkers questioning your company’s intentions or integrity, prove them wrong.", "Instead, Amazon proved them right. Just two hours after a meeting with residents and community leaders to move the project forward, the company abruptly canceled it all.", "Although Ocasio-Cortez made no secret of her opposition to Amazon's opening a location in her district, she was not the only such critic, and it is difficult to imagine such a complex deal would have been scrapped solely because of her opinion. Ultimately, it was a groundswell of opposition from residents and other legislators that \"chased\" Amazon out of New York.", "Hess, Abigail.   \"Alexandria Ocasio-Cortez: Amazon Abandoning Its Plans for a New York Headquarters Proves 'Anything Is Possible.'\"\r\n    CNBC.   14 February 2019.", "Giridharadas, Anand.   \"The New York Hustle of Amazon’s Second Headquarters.\"\r\n    The New Yorker.   17 November 2018.", "Amazon.   \"Update on Plans for New York City Headquarters.\"\r\n    14 February 2019.", "Plitt, Amy.   \"Amazon HQ2 and NYC: A Timeline of the Botched Deal.\"\r\n    Curbed New York.   18 February 2019.", "De Blasio, Bill.   \"The Path Amazon Rejected.\"\r\n    The New York Times.   16 February 2019.", "Soper, Spencer.   \"Amazon Scraps Plan to Build a Headquarters in New York City.\"\r\n    Bloomberg.   14 February 2019.", "Updated to note that Long Island City is in the 12th congressional district, which Ocasio-Cortez does not represent.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]