["The story of actor Jussie Smollett allegedly faking his own attack has stirred national discussion and details continue to emerge.", "Now, a post on social media claims that former President Barack Obama has involved himself in the case by \"urging\" Chicago’s mayor to pressure prosecutors into not charging Smollett.", "The full Facebook post says: \"According to sources former President Barack Obama has personally urged Rahm Emanuel to pressure prosecutors in Chicago to not charge Jussie Smollett. Stating that ‘the sooner we bury this the better’ …. Developing.\"", "The post was published on Feb. 20 and has since been shared nearly 3,000 times. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Katie Hill, Obama’s spokesperson, told us the claim was bogus.", "\"This internet rumor is completely absurd,\" she wrote in an email.", "The rumor also showed up in a tweet on Feb. 19, with two pictures of Obama and Smollett side by side.", "Niether post provides any evidence beyond crediting it to \"sources say.\" There have been no credible media reports regarding Obama having talks with anyone involved in the Smollett case. While the Facebook post includes an image of Chicago Mayor Rahm Emanuel, Obama’s former White House chief of staff, leaning over to speak to Obama, we know that image to be at least 10 years old, according to a reverse image search on TinEye.com. Emanuel has publicly criticized Smollet’s actions.", "Smollet has been charged with one felony count of disorderly conduct for filing a false police report. Chicago Police Superintendent Eddie Johnson recently said there’s more evidence \"that hasn’t been presented yet that does not support his innocence.\" The producers of Empire announced Smollett will no longer appear on the show.", "Clearly, it would be national news if a former president inserted himself in a high-profile case such as this one. There is no evidence that this has happened.", "This claim is Pants on Fire!", "Facebook post, Feb. 20, 2019", "CBS, Jussie Smollett arrested, accused of faking attack, Feb. 21, 2019", "Tweet, Feb. 19, 2019", "Reverse image search, Feb. 25, 2019", "The Hill, Rahm Emanuel to Jussie Smollett: ‘If you want to get paid more, get an agent’, Feb. 22, 2019", "Vox, Jussie Smollett charged with filing false report of a hate crime,  Accessed Feb. 25, 2019", "ABC Action News, Jussie Smollett's character to be removed from 'Empire', producers say; actor charged with felony out on bond, Feb. 22, 2019", "PEOPLE, 'There's a Lot More Evidence' Jussie Smollett Staged Bias Attack: Superintendent, Feb. 25, 2019", "Email interview, Katie Hill, spokesperson for Barack Obama, Feb. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]