["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hasbro introduces Nerf Modulus on Saturday, Feb 14, 2015 at its showroom during the North American International Toy Fair in New York (Photo by Matt Peyton/Invision for Hasbro/AP Images)", "Democratic presidential candidate Cory Booker wants more regulations on guns, an industry he said is even less regulated than their toy imitations.", "Booker, a U.S. senator from New Jersey, laid out his plan for tougher gun control on Medium on May 6.", "In his multi-pronged plan, Booker made a case for more oversight of gun manufacturers. \"Nowadays, there is more regulation over toy guns than real ones,\" he wrote.", "Booker repeated this talking point in a CNN interview, saying that firearms are currently exempt from oversight from the Consumer Product Safety Commission: \"We have different regulations for toy guns and no regulations for weapons on our streets that are killing so many people.\"", "Are there more regulations on the actual weapons than on their toy replicas? We decided to look at the regulations for both.", "We found Booker’s statement misleading. He oversimplified regulations to manufacturing standards only, while regulations on guns, real ones or imitations, don’t stop at that stage.", "Toy guns and real guns are regulated very differently, said Timothy Lytton, law professor at Georgia State University.", "Booker was on point citing federal consumer safety standards for toy guns and a lack thereof for firearms, which were exempted from Consumer Product Safety Commission oversight under a 1972 law.", "Toy guns must abide by general mandatory safety standards set by the commission for all toys, including labeling, preventing choking hazards and toxic substance testing. On top of that, toy gun manufacturers also need to meet federal requirements, so as to prevent the toys from being mixed up with lethal lookalikes.", "Toy guns need to either display a predominant color chosen from an approved list, or a blaze orange plug or a blaze orange band around the muzzle.", "Non-powder guns, including air, pellet and BB guns, are separate from toy guns. They are subject to general rules by the commission, which hasn’t adopted specific mandatory design standards.", "Booker has a point that unlike most consumer products, these federal consumer product safety standards are lacking for real firearms. No federal law in place regulates the safety design standards for firearms, and the commission also cannot recall defective firearms.", "Manufacturers can follow voluntary standards set by the Sporting Arms and Ammunition Manufacturers’ Institute on a voluntary basis. Those standards are not incorporated into U.S. federal law.", "But all of this doesn’t mean that firearms are unregulated.", "Seven states and the District of Columbia have set their own rules about safety standards and design related to firearms, for example, drop testing to ensure a gun doesn’t misfire when it is dropped.", "When it comes to defects of products, both toy guns and real guns manufacturers are subject to tort liabilities, said Eugene Volokh, law professor at the University of California at Los Angeles. That means people can sue manufacturers if they are injured by defective products.", "But the debate about gun policy today is hardly about defective products, Volokh said. Instead, the issue is criminal misuse, suicide as well as accidental shootings.", "The laws aimed at preventing harm, regulating sales and the distribution of firearms are much more extensive than for toy guns.", "\"It’s just wrong to say that there is more regulation over toy guns than real ones,\" said Volokh.", "Booker’s comparison leaves out laws for the distribution and sales of firearms and failed to mention the various legislations at the federal, state and local level.", "Federal laws have imposed restrictions on firearms licensing and ownership including background checks, banning certain types of guns (mostly assault weapons), and barring certain people from purchasing guns.", "The Bureau of Alcohol, Tobacco, Firearms and Explosives is the primary agency to enforce federal firearm laws, including the Gun Control Act, the National Firearms Act, and the Arms Export Control Act. They generally cover rules about importation of firearms, provisions regarding people banned from acquiring guns, taxing duties, etc.", "State laws have more detailed regulations concerning a range of topics including concealed carrying of firearms, owners’ responsibilities, and dealer regulations.", "Such restrictions generally don’t apply to toy guns.", "Alan Kaufman, the senior vice president of technical affairs at The Toy Association, told PolitiFact in an email, \"We are not aware of any restrictions on sale, distribution, or ownership of toy guns which comply with 15CFR 272,\" referencing the federal product safety requirements.", "One other key difference about toy and real gun regulations: federal funding for research. The Centers for Disease Control was explicitly barred from funding research to promote gun control due to the Dickey amendment. Only until recently a spending bill approved research on the cause of gun violence after the Parkland, Fla., school shooting, but no such restriction on public funding for research exists for toy guns.", "\"We spend a lot more government money on research in toy safety than we do government money in gun safety,\" said Lytton. \"And that's probably a more useful comparison.\"", "Booker said, \"Nowadays, there is more regulation over toy guns than real ones.\"", "His claim only factors in consumer safety standards and discounted a volume of federal, state and local laws and rules regulating the sales and distribution of firearms, which are more restrictive than and outnumber those regulating toy guns.", "Since Booker’s claim mischaracterized the scope of regulations for toy guns and firearms, and overlooked a body of key legislations, we rate this claim Mostly False.", "Booker’s Medium post, Cory’s Plan to End the Gun Violence Epidemic, May 6, 2019", "CNN Replay, Cory Booker's 'sweeping' but 'simple' gun violence prevention plan, May 6, 2019", "Electronic Code of Federal Regulations (e-CFR), Accessed May 7, 2019", "PolitiFact, Hillary Clinton says Bernie Sanders wants higher standards for toy guns than real guns, April 8, 2016", "The Toy Association, Guidance on Toy Gun Marking Requirements, Accessed May 9, 2019", "Congress, PUBLIC LAW 104–208—SEPT. 30, 1996, Accessed May 8, 2019", "PolitiFact, Spending bill's gun research line: Does it nullify Dickey amendment? March 27, 2018", "SAAMI, American National Standards Published by SAAMI, Accessed May 7, 2019", "Giffords Law Center to Prevent Gun Violence, Design Safety Standards, Accessed May 7, 2019", "Bureau of Alcohol, Tobacco, Firearms and Explosives, Federal Firearms Regulation Reference Guide, Updated 2014", "Bureau of Alcohol, Tobacco, Firearms and Explosives, Identify Prohibited Persons, Accessed May 7, 2019", "Bureau of Alcohol, Tobacco, Firearms and Explosives, Gun Control Act, Accessed May 7, 2019", "Bureau of Alcohol, Tobacco, Firearms and Explosives, National Firearms Act, Accessed May 7, 2019", "U.S. Department of State, Arms Export Control Act (AECA), Accessed May 7, 2019", "Jon S. Vernick and Stephen P. Teret, A Public Health Approach To Regulating Firearms As Consumer Products, Accessed May 8, 2019", "The Trace, Cars, Toys, and Aspirin Have to Meet Mandatory Safety Standards. Guns Don’t. Here’s Why, Jan. 19, 2016", "Maine Policy Review, Gun Control: State Versus Federal Regulation of Firearms, 2002, Accessed May 8, 2019", "NPR, Spending Bill Lets CDC Study Gun Violence; But Researchers Are Skeptical It Will Help, March 23, 2018", "Email interview with Eugene Volokh, professor of law at University of California - Los Angeles, May 6, 2019", "Email interview with Mark Oliva, Director Of Public Affairs at National Shooting Sports Foundation, May 7, 2019", "Phone interview with Timothy Lytton, professor of law at Georgia State University, May 7, 2019", "Email interview with Booker spokesperson Sabrina Singh, May 6, 2019", "Email interview with Alan Kaufman, senior vice president of technical affairs at The Toy Association, May 7, 2019", "Email interview with Alan Korwin, author of Gun Laws of America, May 8, 2019", "Giffords Law Center to Prevent Gun Violence, Non-powder & Toy Guns, Accessed May 6, 2019", "Giffords Law Center to Prevent Gun Violence, Key Federal Acts Regulating Firearms, Accessed May 8, 2019", "The Toy Association, Guidance on Toy Gun Marking Requirements, Accessed May 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]