["Vermont Sen. Bernie Sanders has been searching for high-profile newspaper endorsements in the New Hampshire primary.", "His main rival, Hillary Clinton, has been officially backed by the Concord Monitor, Portsmouth Herald, Keene Sentinel and the Boston Globe.", "But a campaign ad titled \"Endorsed,\" might have given people a different impression.", "The ad, which was first posted online Wednesday Feb. 3, touts endorsements from unions, an environmental group and The Nation magazine.", "\"From postal workers to nurses, he’s been endorsed for real change,\" a narrator says in the ad.", "The narrator goes on to quote editorials from two New Hampshire newspapers, The Telegraph, of Nashua, and the Valley News, which covers both Vermont and New Hampshire from West Lebanon, N.H.", "Up to that point in the 30-second ad, every logo for an organization or publication has been accompanied by the words \"endorsed by.\" Those words disappear when the Telegraph’s logo appears, along with the quote: \"He’s not beholden to Wall Street Money.\"", "The words \"endorsed by\" then reappear next to the logo of the Valley News, which appears along with the quote: \"Sanders has been genuinely outraged about the treatment of ordinary Americans for as long as we can remember.\"", "So did the Valley News or the Telegraph endorse Sanders?", "According to their editors, no.", "Telegraph executive editor Roger Carroll posted on Twitter the afternoon of Feb. 3 that \"For the record, despite @BernieSanders deceptive ad to the contrary, @NashuaTelegraph has not endorsed any Dem prez candidate #nhpolitics\"", "And Valley News editor Martin Frank said Feb. 4 that his newspaper had likewise not endorsed a Democrat in the primary.", "As news of the spot’s issues spread, the Sanders campaign ended up revising the ad. It removed the word \"endorsed\" by the Valley News logo, although it left the quotes from both New Hampshire newspapers untouched. That’s the version of the ad now on the campaign’s official YouTube channel, which is still titled \"Endorsed.\".", "The Sanders campaign did not respond to a request for comment.", "It’s worth noting that the editorials cited in the ad -- from each newspaper -- were indeed laudatory. The Telegraph editorial, which is behind a paywall but accessible through a Google cache, includes this passage:", "\"He is not tainted by scandal.", "\"He hasn’t erased a cache of emails.", "\"Nobody questions whether Sanders has sold his political soul in exchange for donations to his family foundation. He doesn’t have a foundation.", "But that piece was published in May, far before the traditional season for newspaper endorsements. It gave Sanders little chance of winning the primary, also noting that the independent senator was \"not even a real Democrat.\"", "As for the Valley News, the paper’s Dec. 31, 2014, editorial simply encouraged Sanders to enter the presidential race. \"A presidential candidate who vigorously espoused populism from a progressive point of view could help restore much-needed balance to American political life, which has tilted sharply to the right in recent decades,\" the paper noted.", "Our ruling", "A Bernie Sanders political ad said he had been endorsed by the Valley News newspaper and implied he had been endorsed by The Telegraph of Nashua. While each paper published laudatory editorials about the Vermont senator, neither one has so far offered him an official endorsement.", "In the context of an ad titled \"Endorsed,\" full of unions and other organizations that have in fact endorsed Sanders, the spotlighting of quotes from New Hampshire newspapers would suggest that the papers had made the same decision. The campaign’s decision to alter the ad improves its technical accuracy, but the misleading impression remains.", "We rate the ad’s claim False.", "\"Editorial: Clinton is Democrats’ best choice,\" Concord Monitor, Jan. 24, 2016", "\"Portsmouth Herald, Foster's endorse Hillary Clinton in NH Democratic primary,\" Portsmouth Herald, Jan. 15, 2016", "\"We endorse Hillary Clinton for the Democratic nomination for president,\" Keene Sentinel, Jan. 28, 2016", "\"Hillary Clinton deserves Democratic nomination,\" Boston Globe, Jan. 24, 2016", "\"Endorsed\" first version, Bernie Sanders 2016 campaign ad, Feb. 3, 2016", "\"Bernie Sanders for president,\" The Nation, Jan. 14, 2016", "Roger Carroll Twitter message, Feb. 3, 2016", "Correspondence with Martin Frank, Feb. 4, 2016", "\"Sanders campaign revises ad ripped as 'deceptive,’\" Politico, Feb. 4, 2016", "\"Endorsed,\" second version, Bernie Sanders 2016, Feb. 4, 2016", "\"Bernie Sanders and Hillary Clinton,\" The Telegraph, May 1, 2015", "\"Editorial: What America Needs to Hear From Bernie Sanders,\" Valley News, Dec. 31, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]