["About this rating", "An Advanced Placement high school history textbook contains a chapter about how supporters of the 2016 U.S. presidential candidates, Hillary Clinton and Donald Trump, perceived each other and their candidates.", "Although the book describes how Clinton supporters viewed Trump, and how Trump supporters viewed Clinton, it does not present those views as an objective assessment of the candidates. Also, the book was not \"new\" when the supposed controversy was rehashed in 2019.", "On 23 April 2019, Fox News commentator Todd Starnes took to his personal blog to revive a 2018 manufactured controversy over a history textbook that contained a chapter covering the 2016 presidential election. The story went viral but also failed to accurately describe the book's contents.", "Despite the story's headline, \"New High School Textbook Describes Trump as Mentally Ill, Supporters as Racist,\" the book is not new. The second edition of the Advanced Placement history book entitled By the People A History of the United States initially appeared in early 2018. At that time, a high school student from Minnesota sent images of pages from the chapter entitled \"The Angry Election of 2016\" to Fox News, claiming to be \"appalled.\"", "Phrases from the book that contained negative characterizations of President Donald Trump were swept up in a fracas in which some media commentators claimed the book represented \"an effort going on in public schools to indoctrinate kids with an anti-conservative agenda.\"", "But articles shared then, as well as Starnes' April 2019 story, leave out key context in an effort to play up partisan animosity. The book doesn't offer its own description of Trump. Instead, it reports how Trump's supporters and those of his opponent Hillary Clinton viewed each other and the two candidates.", "As Pennsylvania University history Professor Jonathan Zimmerman stated in 2018, \"For the record, the book did not claim that Trump supporters were racist or that Trump was unstable; it said that some of his opponents believed that.\"", "Starnes' take on the book, although a year late, employed many of the tactics trotted out during the 2018 outburst over the issue. He took out of context passages that described how Clinton supporters viewed Trump while misinforming his readers that the assertions were those of the book's author, rather than a historical recording of the actual national discourse during the 2016 election cycle.", "For example, Starnes quoted a passage in the book that states, \"Clinton’s supporters feared that the election had been determined by people who were afraid of a rapidly developing ethnic diversity of the country, discomfort with their candidate’s gender and nostalgia for an earlier time in the nation’s history. They also worried about the mental stability of the president-elect and the anger that he and his supporters brought to the nation.”", "Starnes failed to note that immediately preceding that phrase, the book states, \"Trump’s supporters saw the vote as a victory for the people who, like themselves, had been forgotten in a fast-changing America — a mostly older, often rural or suburban, and overwhelmingly white group.\" (The characterization of Trump voters as \"mostly older, often rural or suburban and overwhelmingly white\" is a matter of statistical fact, not a point of controversy.)", "In another example, Starnes quotes the book as saying that, \"Most thought that Trump was too extreme a candidate to win the nomination, but his extremism, his anti-establishment rhetoric, and, some said, his not very hidden racism connected with a significant number of primary voters.\"", "But he failed to report that it also describes criticism of Clinton levied by Trump supporters, who \"chanted 'lock her up' at political rallies, believing that Clinton’s use of her private e-mail account was not only a serious mistake — which many believed it was — but also a crime. Many within Trump’s base saw Clinton and the Democratic Party as elite snobs out of touch with many Americans’ economic pain or, perhaps even more, many Americans’ anger at being dismissed as not worthy of serious consideration.\"", "The book's author, New York University history and education Professor James Fraser, expressed frustration at the stories from both 2018 and 2019. The stories focused on certain phrases that reinforced confirmation bias, he said, without considering the sum total of his effort to fairly characterize the historic levels of animosity roiling the nation in the lead-up and aftermath of the 2016 election.", "\"The Trump people did say that and the Clinton people did say that [about each other] — I didn't say either side was right or wrong,\" Fraser told us. \"That was the hardest [chapter] of the book to write, but I really tried to provide a balanced view. As the author of a textbook, it’s not my role to tell students what to think. It’s my role to tell students that they ought to be thinking,\"", "In a 2018 statement on the same controversy, Fraser had stated, \"Keeping facts from students rightly makes them distrust all textbooks. Laying out the facts as clearly as I know how and doing so in comparison to other information or facts is the best way to encourage the kind of thoughtful engagement with history that every historian should work for.\"", "The book's publishing company, Pearson Education, also released a statement voicing its continued support for the book, noting that it was \"developed by an expert author and underwent rigorous peer review to ensure academic integrity.\" The statement reads:", "This work is designed to convey college-level information to high school students and meet specific Advanced Placement standards. It aims to promote debate and critical thinking by presenting multiple sides of historical issues and offering a broad survey of arguments from the 2016 presidential election and other recent topics. We have reviewed the passages in question independently and in the context of the rest of the book. This review has confirmed that the text offers a broad view of critical arguments from both sides of the 2016 presidential election.", "We sent questions to Starnes by email about his article and left a voice message at the phone number listed on his website, but got no response by the time of publication.", "Starnes, Todd. \"New High School Textbook Describes Trump as Mentally Ill, Supporters as Racist.\"\r\n  ToddStarnes.com. 23 April 2019.", "Parke, Caleb. \"Anti-Trump American History Textbook 'Blatantly Biased,' Critics Say.\"\r\n  Fox News. 16 April 2018.", "Morin, Rich. \"Behind Trump’s Win in Rural White America: Women Joined Men in Backing Him.\"\r\n  Pew Research Center. 17 November 2016.", "Zimmerman, Jonathan. \"‘By the People’ Critiqued: a Textbook Case of Toxic Politics.\"\r\n  The San Francisco Chronicle. 27 April 2018.", "Tyson, Alec, and Maniam, Shiva. \"Behind Trump’s Victory: Divisions by Race, Gender, Education.\"\r\n  Pew Research Center. 9 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]