["“डरावनी खबर – हिन्दू का कतल कर उनका मास खा रहे रोहिंग्या, मेवात का मामला, खबर विचलित कर सकती है (Horrfying News – Rohingyas are killing Hindus and eating their flesh, a case from Mewat, this news may send shivers down your spine -translated),” read the headline of an article published by fake news website Dainik Bharat on December 18, 2018. The article carried photographs depicting people dismembering dead bodies.", "The report is introduced with a claim that mainstream media is suppressing this news but one local newspaper from Haryana has reported on the issue.", "The Dainik Bharat article also includes a Facebook post by an individual user who has shared a newspaper clip of Aaj Tak Gurgaon. According to this clip, Rohingya refugees in Mewat, a Muslim dominated area of Haryana, are ‘eating Hindus’.", "Alt News found the online version of the same report which stated, “हिंदुओं का मांस खाने वालों को मिली मेवात में पनाह (Those who eat the flesh of Hindus have found refuge in Mewat -translated)”. It must be noted that Aaj Tak Gurgaon is not a part of India Today’s Aaj Tak.", "Delhi High Court lawyer Prashant Patel Umrao also tweeted a similar claim, terming Mewat ‘Mini Pakistan of Haryana’. On numerous occasions, Umrao has been caught spreading misinformation. A compilation of such instances can be read here.", "https://twitter.com/ippatel/status/1074725443306106880?s=19", "Using Google’s reverse image search, A blog post written in October 2009 was one of the earliest instances of the image appearing on the internet. According to the blog, this image is representative of a funeral ritual of the Tibetan people who believe in donating their dead bodies to wild birds.", "Moreover, we also found the same image posted by a Facebook page พระมหาไพรวัลย์ วรวณฺโณ(Phramaha Paiwan) on August 14, 2014 with the identical narrative. Another handle @damnitbennnnnn_ also tweeted the same image saying, “this is tibetan people’s ‘sky burial’.”", "Several YouTube videos of funeral rites held by the Tibetan people show dead bodies being chopped into pieces and fed to scavengers.", "At 1:16 minutes in this video, vultures can be seen decomposing corpses. In the collage below, the two images on the left are cropped from the viral pictures, while the one on the right is from the video. These are juxtaposed together to depict the presence of vultures in the ritual. This further corroborates that the viral images portray Tibetan funeral rites and NOT ‘Rohingyas eating Hindus’.", "Tibetan Sky Burial is a traditional funeral custom to bid farewell to the dead. It is a type of an excarnation practice in Tibetan Buddhism. According to the custom, a human corpse is placed on a mountain, exposed to scavenging birds. An article published by Australian Broadcasting Corporation stated, “Tibetans see it as a last gift to the universe — a way to show the insignificance and the impermanence of our earthly lives.”", "Aaj Tak Gurgaon has published an unrelated image of a Tibetan funeral rite to suggest Rohingyas were eating the flesh of Hindus. In the past as well, a gory staged video was shared as Rohingya Muslims slaughtering and eating Hindus.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]