["A video has been doing rounds on social media where, in the first frame, fish are shown to be falling from the sky like rain. The next frames show fish scattered on the road with people trying to collect them. The video is viral with the claim that it rained fish in Mumbai.", "*FISH RAIN!* It rained fish in Mumbai this morning, according to BBC news. Instead of a rain of water or snow, it was a shower of fish. God is powerful!!! Scientists are still confused by this mysterious event. Of course, where the knowledge of man ends, that is where the power of God begins. The explanation for this phenomenon is known as waterwheel, a tornado hits the sea and sucks everything in its path, unloading it in the place where the tornado dissolves. Here is the video 👇", "Posted by Irfan alam on Thursday, 4 July 2019", "“It rained fish in Mumbai this morning, according to BBC news. Instead of rain of water or snow, it was a shower of fish. God is powerful!!! Scientists are still confused by this mysterious event. Of course, where the knowledge of man ends, that is where the power of God begins. The explanation for this phenomenon is known as a waterwheel, a tornado hits the sea and sucks everything in its path, unloading it in the place where the tornado dissolves. Here is the video,” reads the message.", "The video was also shared last year.", "Alt News did a simple keyword search, “fish rain”, on Google and found videos with the same frames as in the viral video. As it turns out, the viral video has been developed by merging bits and pieces from existing clips available online.", "1. First few seconds lifted from at least a decade old video.", "The first few seconds of the viral video show fish falling from the sky. This has been lifted from a 1999 BBC Supernatural: The Unseen Powers of Animals series 2008. A YouTuber posted a part of one of the episodes in 2008, titled – “BBC Supernatural (raining fish!!!!).” This video has simulated imagery to show fish falling from the sky.", "In the juxtaposition below, the image on the left is from the viral video and the one on the right is from the YouTube video, appearing at 1:09 minutes. Both the frames match.", "2. The second part of the video was taken from a 2013 clip.", "This video was uploaded by a YouTube channel named Yo Man Bukka, which said that the incident took place in Nashik. A car that appears in the 22nd second has Nashik’s vehicle registration code – MH 15. However, it could not be conclusively established that the incident indeed occurred in Nashik as no media reports were found.", "At about 1:10 minutes, a person can be heard saying “tyre puncture”, which hints that an accident might have scattered the fish on the road. A closer look at the video shows that the fish are accumulated only on one side of the road, which means that they could not have rained.", "Given below is a frame-by-frame comparison of the viral video (left) and the 2013 YouTube video (right). The scene depicted in the viral video appears at 1:29 minutes in the YouTube video.", "3. The third section of the video was found in a 2017 video.", "The last few seconds of the viral video shown fish scattered on the road. The scene which was incorporated into the viral video appears at 0:37 seconds into the YouTube video. In the juxtaposition below, the viral video is on the left and the YouTube video is on the right.", "The video was uploaded on YouTube in 2017 and has the description – “Fish rain in india…truck palat gaya (Fish rain in India…truck was overturned.)” While we were unable to conclusively establish the origin and location of the video, a truck that appears at 1:47 minutes has Jharkhand’s number plate.", "A 2004 report in BBC had talked about the strange phenomenon after it rained fish in a village in Wales. The report said, “The phenomenon can be explained simply: given strong enough winds, in thunderstorms, for example, small whirlwinds and mini-tornadoes may form. When these travel over water any small items of debris in their path, such as fish or frogs, may be picked up and carried for up to several miles. Sooner or later, the clouds carrying them will open and drop their strange cargo – resulting in a hail of fish, frogs or whatever the winds happened to pick up.”", "In 2017, The New York Times reported about a small community in the periphery of Yoro, Honduras where it rains fish at least once every year. But it happens “only under specific conditions: a torrential downpour, thunder and lightning, conditions so intense that nobody dares to go outside.”", "When fish had fallen from the sky in an Andhra Pradesh village in 2015, a Met official had given a similar explanation – “Sea tornados occur in the Bay of Bengal and, along with seawater, they also carry aquatic life as well. It is possible that they can suck up a school of fish or frogs and ‘rain’ them elsewhere,” said K. Nagaratna, a scientist with the Hyderabad Meteorology Department.”", "Therefore, it is possible that fish or other small animals and vegetables or fruits fall from the sky. But they don’t literally rain as there is no evaporation and condensation taking place. These living creatures or other objects are carried by strong winds and subsequently dropped from the sky.", "Nevertheless, the viral video has nothing to do with the above-mentioned phenomenon as it was entirely manufactured.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]