["About this rating", "In July 2017, a photograph of boxer Muhammad Ali surrounded by piles of cash in a bank vault, frequently shared with inaccurate information, resurfaced. On 8 July 2017, for instance, the \"Historical Pics\" Twitter account shared the image along with the caption \"Muhammad Ali showing off his wealth, 1963\":", "This image has also been shared with similar claims, such as \"Muhammad Ali with his winnings in 1964\", \"Muhammad Ali with his winnings in 1974\", and \"Muhammad Ali showing off his money\".", "The photograph was originally taken for the cover of Sports Illustrated in February 1964. In the cover story, titled \"My $1,000,000 Getaway,\" Ali, who was going by the name Cassius Clay at the time, wrote that he was looking at \"$1 million in cold cash\" in the photograph:", "If I were like a lot of guys—a lot of heavyweight boxers, I mean—I'll bet you a dozen doughnuts you wouldn't be reading this story right now. If you wonder what the difference between them and me is, I'll break the news: you never heard of them. I'm not saying they are not good boxers. Most of them—people like Doug Jones and Ernie Terrell—can fight almost as good as I can. I'm just saying you never heard of them. And the reason for that is because they cannot throw the jive. Cassius Clay is a boxer who can throw the jive better than anybody you will probably ever meet anywhere. And right there is why I will meet Sonny Liston for the heavyweight championship of the world next week in Miami Beach. And jive is the reason also why they took my picture looking at $1 million in cold cash [see cover]. That's how much money my fists and my mouth will have earned by the time my fight with Liston is over. Think about that. A southern colored boy has made $1 million just as he turns 22. I don't think it's bragging to say I'm something a little special.", "Although the image was clearly staged, the money is likely real. However, we are doubtful that it actually belonged to the famous boxer, for two reasons: Clay wrote in the article accompanying the photograph that he \"will have earned\" $1 million, not that he already had earned it. Also, a man can be seen on the opposite side of the vault. This is most likely a bank manager keeping on eye on the cash.", "The Guardian identified this person as a \"security guard\" when they published a different photograph of Ali in the bank vault:", "The version of this photograph which made the cover of Sports Illustrated was shot by Richard Meek. But I prefer this picture taken shortly beforehand by Ali’s friend Howard Bingham. It’s just a little more fun. And I like how the security guard is there in the background keeping tabs.", "Although Cassius Clay did make a fortune early on in his boxing career and went on to earn $1 million and more and gain worldwide fame, and although the picture likely shows real cash inside of a bank vault, this photograph doesn't show the boxer's specific earnings at any time.", "Weeks, Jonny.   \"Muhammad Ali – 25 of the Best Photographs of the Legendary Boxer.\"\r\n    The Guardian.   4 June 2016.", "Clay, Cassius.   \"I'm a Little Special.\"\r\n    Sports Illustrated.   24 February 1964.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]