["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Every so often, a new theory pops up on social media about the meaning of \"COVID-19,\" the name given to the disease caused by the coronavirus strain that began spreading in late 2019 and continued into 2021.", "Invariably, those theories are pretty outlandish. The latest one emerged in a series of tweets that claimed that “COVID” stands for “Certificate of Vaccination ID,” and that “19” corresponds to the letters “AI,” which stands for “Artificial Intelligence.”", "We covered the meaning of COVID-19 in March 2020, when the disease was spreading globally.", "We learned:", "The International Committee on Taxonomy of Viruses (ICTV) announced “severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2)” as the name of the newly discovered virus on Feb. 11, 2020. As the WHO observed, “This name was chosen because the virus is genetically related to the coronavirus responsible for the SARS outbreak of 2003. While related, the two viruses are different.”", "On the same day, the WHO announced “COVID-19” as the name of the new disease caused by that virus. The first part of that name is a shortening of the phrase “coronavirus disease,” and the latter part reflects that the disease was first reported in the year 2019.", "Since COVID-19 does not stand for “Certificate of Vaccination ID” and “Artificial Intelligence,” we rate the above claims as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]