["This image has been shared more than 100 times since it was published on Facebook on May 30.", "The purported tweet reads: “Watching with concern the developments in the US. I’m so glad we don’t have any racism here in Australia.”", "The image circulated in late May 2020 as protests against police brutality and systemic racism erupted in the US following the police killing of unarmed black man George Floyd in Minneapolis on May 25, AFP reported here.", "The purported tweet was also shared on Facebook here, here, here, here, and here.", "However, the claim is false.", "A keyword search found that the tweet was originally published here by a parody Twitter account under the handle @ScottyFromMktg.", "The tweet has been viewed nearly 1,500 times since it was published on May 30.", "The name of the @ScottyFromMktg account reads “Scott Morrison PM of Australia (parody)” and its description states that its content is “satire”. The account was created in December 2019.", "Meanwhile, Morrison's verified Twitter account is under the handle @ScottMorrisonMP and was registered in April 2009.", "Below is a screenshot comparison of the parody account (L) and the verified account (R) for Scott Morrison:", "Twitter’s record shows Morrison did not tweet about the US protests between May 25, when Floyd’s death caught media attention, and June 10, at the time of publishing.", "Similarly, none of his deleted tweets between May and June 2020 were about the anti-racism movement in the US, according to Politwoops, a website that tracks deleted tweets by politicians.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]