["We found some factual distortions in the first debate round of the two-night affair.", "By Eugene Kiely, Lori Robertson, Brooks Jackson, Robert Farley, Angelo Fichera, Jessica McDonald and D'Angelo Gore", "Posted on June 27, 2019", "The debate season for the 2020 presidential election kicked off with 10 Democratic candidates taking the stage in Miami and exaggerating or garbling the facts on Iran, wages, Medicare, the opioid crisis and guns.", "The first debate was hosted by NBC, MSNBC and Telemundo on June 26, with another 10 candidates set to debate the following night.", "Moderator Lester Holt asked all 10 candidates if they would, as president, “sign on to the 2015 nuclear deal as it was originally negotiated.” Only Sen. Cory Booker said no.", "Booker said he would renegotiate the agreement, but he criticized President Donald Trump for announcing on May 8, 2018, that the U.S. would withdraw from the agreement.", "In criticizing Trump, Booker garbled the facts about the impact of the agreement on the “breakout time,” which is how long it would take Iran to produce enough highly enriched uranium for one nuclear weapon.", "Booker: Literally, he took us out of a deal that gave us transparency into their nuclear program and pushed back a nuclear breakout 10, 20 years.", "The Iran agreement pushed the breakout time from roughly two or three months to one year for at least 10 years, according to the Obama White House.", "In years 11 to 15 of the agreement, the breakout time would be reduced to less than one year because Iran would be “permitted to replace its first-generation centrifuges with limited numbers of advanced models, although the restrictions on enriched ura­nium stocks and enrichment level continue through year 15,” as explained in an August 2015 report issued by the Belfer Center for Science and International Affairs at Harvard University a month after the U.S. and other nations announced the agreement.", "The point of extending the breakout period is to give the international community enough time to react — if Iran moves ahead with production of a nuclear weapon.", "“Some contributors to this report believe that breakout time by year 15 could be comparable to what it is today — a few months — while others believe it could be reduced to a few weeks,” the Harvard report said. “In any event, Iran is unlikely to attempt breakout at Natanz during this period because detection would be swift and the risk of provoking a military attack would be high. Since all enrichment will be limited to Natanz for 15 years under the JCPOA, Iran’s nuclear program would be vulnerable to military attack.”", "“After 15 years, all physical constraints on enrichment imposed by the agreement will be lifted,” the Harvard report said.", "Rep. Tim Ryan of Ohio falsely said: “The bottom 60 percent haven’t seen a raise since 1980.” Analyses of Census data by the nonpartisan Congressional Research Service and the Economic Policy Institute, a think tank that advocates for low- and middle-income workers, show there has been a rise in inflation-adjusted wages over that time period, even if the percentage increase was relatively small, especially compared with the 90th percentile of workers.", "Ryan, however, didn’t comment on the magnitude of the wage increase. He said there hasn’t been an increase at all.", "In a 2019 report, EPI showed that every percentile had seen a cumulative percentage increase in real (inflation-adjusted) hourly wages from 1979 to 2018, with considerably higher increases for high-income earners. The 50th percentile experienced a 14% increase, and the 70th percentile saw a 17.1% increase. The 10th percentile saw just a 4.1% increase, while the 95th percentile saw its wages grow by 56.1%. (See Appendix Figure B.) “Rising wage inequality and sluggish hourly wage growth for the vast majority of workers have been defining features of the American labor market for nearly four decades, despite steady productivity growth,” the report began. It continued: “What also stands out in this last year of data is that, while wages are growing for most workers, wage growth continues to be slower than would be expected in an economy with relatively low unemployment.”", "Another EPI report (see Figure A) shows the real wage change for the 60th percentile from 2000 to 2018 (4.9 percent) and from 2007 to 2018 (2.1 percent). The upper-percentiles did considerably better. “Because of the recent uptick in wages for the 20th through 40th percentiles over the last year on top of steady increases over the last few years at the 10th percentile, wage growth is in the rough shape of a checkmark with stronger growth at the bottom attributed to several consecutive years of state-level minimum wage increases and a growing economy, while the fastest growth at and near the top is a continuation of the trends in growing inequality since the 1970s,” EPI wrote in a report that noted “a steadily improving economy should eventually translate into stronger wage growth.”", "The Congressional Research Service used the same Census dataset to analyze the wage trends from 1979 to 2017. The report found that the 50th percentile experienced a cumulative 6.1% growth over that time period, with men in that percentile actually seeing a decrease of 6% while women saw a 25.5% increase. “In summary, analysis of the data shows that overall wages rose in real terms over the 1979 to 2017 period at the top of the wage distribution, increased slightly at the middle of the wage distribution, and rose to an even lesser degree at the bottom of the distribution.”", "We reached out to Ryan’s campaign to ask for the source of his claim, but we did not receive a response.", "Booker used a common but disputed comparison to justify his support for “Medicare for All.”", "Booker: There are too many people profiteering off of the pain of people in America, from pharmaceutical companies to insurers. Literally, the overhead for insurance that they charge is 15 percent, while Medicare’s overhead is only at 2 percent.", "It’s true that the most recent Trustees Report of the Medicare system puts total “administrative expenses” at $9.9 billion last year. That’s actually 1.3 percent of total Medicare expenditures for the year — even less than the 2 percent figure Booker cited. So far, so good.", "But is Medicare really as economically efficient as that small number suggests? Hardly. The U.S. Government Accountability Office (a nonpartisan arm of Congress) estimates that in fiscal year 2017 Medicare made $52 billion in “improper payments,” including those that were fraudulent or erroneous. Spending more on administration might cut losses from waste and fraud.", "It’s also true that the health insurance industry says that in 2014 through 2016 an average of 18.2 cents of every private premium dollar went for things other than doctors, hospitals and other health-care services. But by no means can all of that be called “overhead.” An average of 4.7 cents went for federal, state and local taxes, for example.", "Most of the remaining 13.5 cents clearly falls under the heading of “overhead,” including 3.3 cents for “fees and business expenses”; 2.3 cents for “profit”; 1.8 cents for “customer engagement”; 1.6 cents for “finance, claims and special investigations; 0.7 cent for “administrative.”", "But the 13.5 cents also includes 1.6 cents for “care management,” a category that includes health coaching and wellness programs aimed at improving customer health and thus reducing claims. If those expenses are considered to be benefits, then the “overhead” total shrinks to 11.9 cents.", "And there’s another problem with Booker’s comparison: Medicare beneficiaries are all age 65 or over, or disabled, and on average have much larger medical bills than the mostly under-65 population served by private health insurance. A 2006 study estimated that in 2003, the average medical cost for Medicare was $6,600 per person per year while the average medical cost for private health insurance (excluding out-of-pocket costs) was less than half that — $2,700 per person per year.", "So $1 spent on overhead for Medicare automatically becomes a smaller percentage of total spending than does $1 spent on overhead for private insurance. And that also means that if Medicare were extended to “all” the percentage spent on overhead would rise.", "Our conclusion: Booker and others using this and similar claims have a point — Medicare does spend less on administration than private insurers. But it’s not so simple as they would have you believe.", "In discussing the nation’s opioid crisis, former Texas Rep. Beto O’Rourke offered a misleading take on a pharmaceutical company linked to the epidemic.", "“Despite what Purdue Pharma has done — their connection to the opioid crisis and the overdose deaths that we’re seeing throughout this country — they’ve been able to act with complete impunity and pay no consequences,” he said. “Not a single night in jail.”", "It’s accurate that no one from the company, the manufacturer of the addictive painkiller Oxycontin, spent time in jail. But it’s inaccurate to say “they’ve been able to act with complete impunity and pay no consequences.”", "In 2007, the company and three executives pleaded guilty in federal court to charges relating to “misbranding” OxyContin. Collectively, they agreed to pay more than $634 million in fines and other payments — what was described by the New York Times as “one of the largest amounts ever paid by a drug company in such a case.”", "States also have recently taken action against the company: In March, the Oklahoma Attorney General’s Office reached a $270 million settlement with Purdue after alleging the company and others were to blame for the state’s opioid epidemic.", "Booker cited studies that showed that when Connecticut enacted a permit-to-purchase gun law, “they saw 40 percent drops in gun violence and 15 percent drops in suicides.” Two studies did find an association with such drops in gun violence and suicides, but they stopped short of claiming the decline was caused by that law in Connecticut. And there’s also some evidence states with similar laws have seen less dramatic results.", "Booker: If you need a license to drive a car, you should need a license to buy and own a firearm. And not everybody in this field agrees with that. But in states like Connecticut that did that, they saw 40 percent drops in gun violence and 15 percent drops in suicides. We need to start having bold agendas on guns.", "Currently, 10 states have enacted permit-to-purchase laws that require gun purchasers to obtain a permit or license, and three states require a license to own firearms, according to the Giffords Law Center.", "Booker’s claims about the effect of the permit-to-purchase law passed in Connecticut in 1995 come from two studies. The first, published in the American Journal of Public Health in 2015 concluded that “the law was associated with a 40% reduction in Connecticut’s firearm homicide rates during the first 10 years that the law was in place.” The second, published in Preventive Medicine in 2015, found a 15.4% reduction in suicide rates associated with Connecticut’s law (and a rise in suicide rates in Missouri after it repealed its permit-to-purchase law).", "So Booker’s statement is accurate. But both studies cited an association, and stopped short of concluding that the decline was caused by those laws.", "In addition, researchers caution not to put too much stock in the results in any one state or city, as it is notoriously difficult to tease out the effects of various gun policies in states that often have a combination of policies. Results are further complicated because some states with strong gun policies are bordered by states that may or may not have similar policies. In other words, results in Connecticut may not be representative of how the law might affect gun crimes in other areas.", "Another study, one that looked at licensing laws in large, urban counties around the U.S., found that permit-to-purchase laws “were associated with a 14% reduction in firearm homicide.” And a study published in the Journal of General Internal Medicine in March found that universal background checks — either at the point of purchase or through a license/permit application — were associated with about a 15 percent reduction in homicide.", "In the course of demonstrating his support for the LGBT community, Booker said, “We don’t talk enough about how many children, about 30 percent of LGBTQ kids, who do not go to school because of fear.”", "There’s a valid source for the statistic, but it could use some context. We asked Booker’s campaign for a source for the number and were directed to an NBC News story about the 2017 GLSEN National School Climate Survey, which found that 35% of LGBTQ students missed one day of school or more in the prior month because of feeling unsafe at school.", "GLSEN is a national advocacy group for LGBTQ rights in schools, and every other year releases a survey given to students identifying as lesbian, gay, bisexual, trans and queer or questioning in American schools. The 2017 survey included 23,001 students from across the country between the ages of 13 and 21.", "The 35% of students who missed school at least one day in the past month “because of feeling unsafe” included 10.3% of students who said they missed one day, 14.1% who missed two or three days, 4% who missed four or five days and 6.5% who missed six or more days.", "The Centers for Disease Control and Prevention also has similar data that suggest the number could be lower, although the survey populations differ. In the agency’s first nationally representative study of the health risks of LGB high school students, which was released in 2016 based on a 2015 survey, the CDC found that more than 1 in 10 LGB students missed at least one day of school in the past 30 days “due to safety concerns.” The survey did not ask about transgender identity, so it lacks that information.", "More specifically, the CDC survey found that 12.5% of LGB students missed one day of school or more because they felt they would be unsafe at school or on their way to or from school, compared with 5.6% of all students, 4.6% of heterosexual students and 10.8% of students who weren’t sure.", "Fact Sheet. “President Donald J. Trump is Ending United States Participation in an Unacceptable Iran Deal.” White House. 8 May 2018.", "Fact Sheet. “The Iran Nuclear Deal: What You Need To Know About The JCPOA.” White House. Undated. Accessed 27 June 2019.", "“The Iran Nuclear Deal: A Definitive Guide.” Belfer Center for Science and International Affairs at Harvard University. Aug 2015.", "Press release. “The Iran Deal.” White House. 14 Jul 2015.", "Gould, Elise. “State of Working America Wages 2018.” Economic Policy Institute. 20 Feb 2019.", "Gould, Elise and Heidi Shierholz. “Average wage growth continues to flatline in 2018, while low-wage workers and those with relatively lower levels of educational attainment see stronger gains.” Economic Policy Institute. 18 Jul 2018.", "Donovan, Sarah A. and David H. Bradley. “Real Wage Trends, 1979 to 2017.” Congressional Research Service. 15 Mar 2018.", "Giffords Law Center to Prevent Gun Violence. “Licensing.” Accessed 27 Jun 2019.", "Rudolph, Kara E., et. al. “Association Between Connecticut’s Permit-to-Purchase Handgun Law and Homicides.” American Journal of Public Health 105, no. 8: pp. e49-e54. 1 Aug 2015.", "Crifasi, Cassandra K. et. al. “Effects of changes in permit-to-purchase handgun laws in Connecticut and Missouri on suicide rates.” Preventive Medicine. Volume 79, Pages 43-49. Oct 2015.", "Farley, Robert. “O’Rourke Wrong on Gun Control Stat.” FactCheck.org. 10 May 2019.", "Crifasi, Cassandra K. et. al. “Association between Firearm Laws and Homicide in Urban Counties.” J Urban Health. 2018 Jun; 95(3): 383–390. 21 May 2018.", "Siegel, M., Pahn, M., Xuan, Z. et al. “The Impact of State Firearm Laws on Homicide and Suicide Deaths in the USA, 1991–2016: a Panel Study.” Journal of General Internal Medicine. 28 Mar 2019.", "Kosciw, Joseph G. et. al. The 2017 National School Climate Survey: The experiences of lesbian, gay, bisexual, transgender, and queer youth in our nation’s schools. GLSEN, 2018.", "Kann, Laura et. al. Sexual Identity, Sex of Sexual Contacts, and Health-Related Behaviors Among Students in Grades 9–12 — United States and Selected Sites, 2015. MMWR Surveillance Summaries 65(No. SS-9), 2016.", "Singh, Sabrina. National Press Secretary for Cory Booker. E-mail sent to FactCheck.org. 26 Jun 2019.", "“The Purdue Frederick Company, Inc. and Top Executives Plead Guilty to Misbranding Oxycontin; Will Pay Over $600 Million.” Press release, U.S. Attorney’s Office, Western District of Virginia. 10 May 2007.", "“Attorney General Hunter Announces Historic $270 Million Settlement with Purdue Pharma, $200 Million to Establish Endowment for OSU Center for Wellness.” Press release, Oklahoma Attorney General’s Office. 26 Mar 2019.", "Strickler, Laura. “Five more states sue OxyContin maker Purdue Pharma for opioid epidemic.” NBC News. 16 May 2019.", "U.S. Department of Health and Human Services, Centers for Medicare and Medicaid Services. “2019 Annual Report of the Boards of Trustees of the Federal Hospital Insurance and Federal Supplementary Medical Insurance Trust Funds.” 22 Apr 2019.", "U.S. Government Accountability Office. “Medicare: Actions Needed to Better Manage Fraud Risks.” 17 Jul 2018.", "America’s Health Insurance Plans. “Where Does Your Health Care Dollar Go?: undated infographic. Accessed 26 Jun 2019.", "Litow, Mark. “Medicare versus Private Health Insurance: The Cost of Administration.” Health Watch Newsletter, Society of Actuaries. May 2006.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]