["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Sept. 23, an Instagram account called @jimcarreyhere posted an illustration of a man with this quote attributed to the Roman emperor Marcus Aurelius: \"Everything we hear is an opinion, not a fact. Everything we see is a perspective, not a truth.\"", "We have a few opinions of our own about this one. And others had questions — this post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which also owns Instagram.)", "First, there’s the Instagram account. It has 361,000 followers and the bio suggests that the account belongs to the actor Jim Carrey — it has an illustration of his face and says, \"Alrighty then.\"", "But the account isn’t verified with a blue checkmark, unlike the real @JimCarrey Twitter account. That account’s bio says: \"The ONLY official social media account for Actor Jim Carrey!\"and has 18.5 million followers.", "Second, the illustration of the man in the Instagram post doesn’t look like Marcus Aurelius. He looks like Caracalla, another Roman Emperor who was given the name Septimius Bassianus at birth and renamed Marcus Aurelius Antoninus.", "But Caracalla a.k.a. Marcus Aurelius Antoninus is not the same Marcus Aurelius who wrote philosophical musings in \"Meditations\" and to whom this quote is often attributed.", "We didn’t find the quote searching an online version of the book and we couldn’t find a credible citation showing that Marcus Aurelius said it.", "Dirk Baltzly, a philosophy and gender studies professor at the University of Tasmania in Australia, told us it’s \"just vaguely possible\" that the quote in the Instagram post \"is a highly creative\" translation or paraphrase from a passage in Meditations. One edition translates the original Greek this way:", "\"But among the principles readiest to thine hand, upon which thou shalt pore, let there be these two. One, that objective things do not lay hold of the soul, but stand quiescent without; while disturbances are but the outcome of that opinion which is within us. A second, that all this visible world changes in a moment, and will be no more; and continually bethink thee to the changes of how many things thou hast already been a witness. ‘The Universe—mutation: Life—opinion.’ \"", "But, Baltzly said, this is an old-fashioned and poor translation. Marcus Aurelius’s view wasn’t that there are no facts. Rather, he believed there are facts but that properly understood, none of the facts of the external world should disturb us.", "\"What disturbs us is the (allegedly false) opinion that, for instance, death is a bad thing or that losing your money really harms you,\" Baltzly told us in an email. \"In truth, the only thing that should disturb you is the realization of your own moral feelings and — unlike all the crap in the world — that’s something you yourself can fix.\"", "Because the universe is constantly changing and each person plays a relatively small part in the world and then dies, Baltzly said, \"everyone has a limited perspective on it.\" But that doesn’t mean that people don’t know anything or that there are no objective facts and only perspectives.", "\"The emperor was a stoic — not a skeptic,\" Baltzly said. \"So I’d call BS on that quote.\"", "We rate this post Fase.", "Instagram post, Sept. 23, 2019", "Britannica, Marcus Aurelius, visited Sept. 24, 2019", "Jim Carrey Twitter account, visited Sept. 24, 2019", "@jimcarreyhere Twitter account, visited Sept. 24, 2019", "Yahoo, 15 celebrities you must follow on Instagram, Feb. 14, 2013", "Britannica, Caracalla, visited Sept. 25, 2019", "\"Meditations,\" by Marcus Aurelius", "Modern Stoicism, Did the Stoics really say that? By Thomas Colligan, Aug. 18, 2018", "Email interview with Margaret Graver, chair, department of classics, Dartmouth College, Sept. 25, 2019", "Email interview with Dirk Baltzly, philosophy and gender studies professor, University of Tasmania, Sept. 26, 2019", "Email interview with Rachana Kamtekar, profesor, Sage School of Philosophy, Cornell University, Sept. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]