["On August 4, 2020, two massive explosions ravaged Beirut's port, leaving more than 100 people dead and thousands injured.", "As reported by AFP, Prime Minister Hassan Diab said that 2,750 tonnes of the agricultural fertiliser ammonium nitrate -- stored for years in a portside warehouse -- had blown up, sparking \"a disaster in every sense of the word\".", "A Facebook post shared on a Kenyan Facebook page published multiple photographs purportedly showing the aftermath of the incident with the caption: \"A moment of silence for the Lebanese Nationals... so sad\".", "However, reverse image searches revealed that while some of the pictures were indeed taken following Tuesday's explosions, others were old photos of attacks in Beirut.", "The image showing a man carrying a little boy across rubble was actually taken in 2012 following the explosion of a car bomb in Beirut.", "We located the picture in several reports including here and here. It was snapped by an Associated Press (AP) photographer and is featured on the news agency’s website here.", "The picture showing rescuers wheeling away an injured person is not recent either. It was captured in 2007 during another explosion in Beirut targeting Christian lawmaker Antoine Ghanem.", "The photo was used in a report here and can be found on AP’s website here.", "The photo showing two men running away from a burning car was taken in 2013 during a double explosion at the Iranian Embassy compound in Beirut. The picture can be found on AP’s site here.", "Recent images", "Nine of the images shared in the post showed actual scenes from the August 4, 2020  blast taken by AFP (here, here, here, here, here and here) and AP (here, here and here).", "The last image in the post is a montage that includes two screengrabs from an interview that Beirut governor Marwan Abboud gave shortly after the blast, in which he can be seen crying, as well as a photo of the rubble from the European Press Agency.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]