["The one-minute and seven-second video was published here on Facebook on August 10, 2020. It has been viewed more than 5,500 times.", "The post’s caption reads: “Imran Khan copied PM Shri Modi’s ‘Tree Plantation Drive’ in Pakistan but his followers uprooted all trees because they feel 'Planting trees is against Islam'.\"", "The second part of the caption in Hindi translates to English as: “Thank you Jinnah uncle for taking all the buffoons with you to the other side.”", "Imran Khan is the prime minister of Pakistan. On August 8, 2020, Khan tweeted that as many trees as possible should be planted across the country.", "PM Shri Modi refers to Indian Prime Minister Narendra Modi.", "Muhammed Ali Jinnah is the founder of Pakistan.", "The video was also shared here and here on Facebook; and here and here on Twitter with a similar claim.", "The claim, however, is false.", "A reverse image search on Yandex found a similar video was published here on Facebook on August 9, 2020. The caption reads: “Khyber agency people angry planted trees on their land without permission.\"", "Below is a screenshot comparison of the video in the misleading posts (L) and the Facebook video from Khyber agency (R):", "The incident in Pakistan’s Khyber Pakhtunkhwa region was reported by several local media outlets: for example here by Pakistani news site Khabar Naamaa; here by Pakistani newspaper The News International; and here by Pakistani news channel Saama TV.", "Dawn, an English-language daily newspaper in Pakistan, published a similar report here on August 10, 2020.", "The report reads in part: “Speaking to Dawn.com, a district administration official said that there was a dispute between two powerful tribes over the ownership of the land. 'One of the parties was present when the campaign was inaugurated, while the other was unaware about the drive and uprooted the saplings,' he said.”", "In Islam, planting trees is considered an act of charity.", "In the book Sahih al-Bukhari, regarded as one of the most trusted collections of Prophet Muhammad’s quotes and verses, a verse attributed to Muhammad reads: \"There is none amongst the Muslims who plants a tree or sows seeds, and then a bird, or a person or an animal eats from it, but is regarded as a charitable gift for him.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]