["About this rating", "As often happens, an item about a tiger's nursing piglets appears to be a case in which someone came across some unusual photographs with no explanatory context and decided to make up his own background story. The pictures are real, but the accompanying explanation about a mother tiger in California being given piglets to ease her through a depression stemming from the loss of her own cubs is nothing but fiction:", "In a zoo in California, a mother tiger gave birth to a rare set of triplet tiger cubs. Unfortunately, due to complications in the pregnancy, the cubs were born prematurely and due to their tiny size, they died shortly after birth. The mother tiger after recovering from the delivery, suddenly started to decline in health, although physically she was fine.", "The veterinarians felt that the loss of her litter had caused the tigress to fall into a depression. The doctors decided that if the tigress could surrogate another mother's cubs, perhaps she would improve. After checking with many other zoos across the country, The depressing news was that there were no tiger cubs of the right age to introduce to the mourning mother.", "The veterinarians decided to try something that had never been tried in a zoo environment. Sometimes a mother of one species will take on the care of a different species. The only \"orphans\" that could be found quickly, were a litter of wiener pigs. The zoo keepers and vets wrapped the piglets in tiger skin and placed the babies around the mother tiger.", "Would they become cubs or pork chops?", "Take a look ...", "These pictures were actually taken in 2004 not in California, but at the Sriracha Tiger Zoo in Chonburi, Thailand. Although the Sriracha Tiger Zoo hosted one of the world's most successful tiger breeding programs, unlike most western zoos it also offered circus- and carnival-like shows, exhibits, and interactions, including (as evidenced here) the mixture of adults and young of quite different species in the same enclosures, as described by the AWI Quarterly, a publication of the Animal Welfare Institute:", "The Sriracha Tiger Zoo, an hour outside of Bangkok, Thailand, is truly an amazing place. Boasting more than 400 tigers, a handful of Asian elephants, piles of crocodiles, camels, snakes and other exotic animals, the zoo has some intriguing, yet troubling exhibits.", "In one glass room, a farrowing crate entombed a pig who, lying on her side, nourished both her piglets and tiger cubs. Across the hall, another glass room housed a female tiger, who fed piglets adorned in tiger-print costumes. This incongruous display was replicated elsewhere, where enclosures housed tigers, pigs, and dogs together.", "In another area, a visitor could feed milk to a young tiger resting on his or her lap — a young tiger still in possession of his claws ... There was a tiger circus, not dissimilar from a circus anywhere else: tigers leaping through rings of fire, walking across a double tightrope, parading around the ring on hind legs, and riding around on the back of the horse.", "The mixture of tiger and piglets depicted in these images therefore was not something undertaken for functional reasons, but rather as a common form of visual entertainment provided by the zoo for the amusement of its visitors. According to the Pattaya Mail, these tiger-pig nursing relationships have also been reciprocated to the extent that the mother tiger shown suckling piglets was herself nursed by a sow:", "Visitors recently witnessed some bizarre feeding habits of the zoo's most famous inhabitants. A two-year-old female pig named Benjamaj is a blended pedigree of parents, Land-Less and Las-White, that were imported from Norway. Benjamaj is a kind and maternal porky. She has taken 4 baby tigers under her care and along with 3 tiny piglets is nursing the tigers as though she were their mum. She loves those cats and they love her back.", "Unbelieving, wide-eyed tourists pressed their noses up to the cage to get a better look. As they moved on to the next cage they were in for another surprise, as there, a great Royal Bengal tigress was lolling on her side and suckling 6 tiny piglets.", "'Momma' tiger Saimai is two years old and as a baby was suckled by a pig until she was 4 months old. This democratic start in life allowed her to form a loving relationship with other pigs and even a dog. Food in the wild, maybe — but at the zoo, tourists who witness these amazing scenes come away with food for thought.", "Although these pictures might appear charming and innocent, the AWI noted back in 2004 that there may be a darker side to the Sriracha Tiger Zoo, as press reports stated that Sriracha was under investigation for illegally breeding protected wildlife for commercial export and had been implicated in the sale of a hundred tigers to China (where there is strong demand for tiger body parts for use in traditional Chinese medicines). The AWI also noted that in late 2004 the zoo was closed for a month when between 80 and 100 tigers died or were euthanized due to an avian influenza (probably spread via the raw chicken carcasses fed to the tigers) that swept through the facility.", "Roberts, Adam M.   \"Too Close for Comfort.\"\r\n    AWI Quarterly.   Winter 2005.", "Battaya Mail.   \"Unseen Thailand — Amazing Sites at Sriracha Tiger Zoo.\"\r\n    9 May 2003.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]