["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump, in a speech about the brutality of MS-13 gang members and his administration’s resolve to deport criminal immigrants, claimed it wasn’t until he came along that border crossings went down.", "\"You know, the border is down 78 percent. Under past administrations, the border didn’t go down, it went up. But if it went down 1 percent, it was like this was a great thing. Down 78 percent,\" Trump said in New York on July 28. \"And, in fact, the southern border of Mexico, we did them a big favor -- believe me. They get very little traffic in there anymore, because they know they're not going to get through the border to the United States. So that whole group has been incredible, led by General (John) Kelly.\"", "Trump congratulated Kelly for doing \"an incredible job\" as secretary of Homeland Security, and at a July 31 Cabinet meeting — the first for Kelly as Trump's new chief of staff — reiterated his pride for reductions in illegal immigration.", "\"As you know, the border was a tremendous problem, and they’re close to 80 percent stoppage.  And even the president of Mexico called me — they said their southern border, very few people are coming because they know they’re not going to get through our border, which is the ultimate compliment,\" Trump said.", "Based on past statements Trump has made, his remarks that \"the border is down 78 percent\" refer to apprehensions of immigrants trying to enter the country illegally. But calculations of different time periods do not show a 78 percent decline.", "The claim that under past administrations apprehensions did not go down is not accurate.", "Trump uses different timeframes to make a case that illegal immigration is down. He has looked at year-over-year March border apprehension data to say there’s been a 64 percent decline; compared February 2017 numbers to the election month, November 2016, to say it’s gone down 61 percent; and said there was a 40 percent decline from January, the month he was inaugurated, to February.", "Where does the 78 percent come from? We asked the White House but did not get a response.", "From June 2016 to June 2017, apprehensions at the southwest border went down 53 percent.", "U.S. Customs and Border Protection data also show that from November to June (latest available figures), apprehensions by border patrol agents declined about 66 percent. From January to June, it declined 49 percent. From Trump’s first full month in office, February, to June, it went down 14 percent.", "And though they remain low,  the number of apprehensions actually picked up in May and in June.", "As the Washington Post’s Fact Checker noted, Trump’s claim of apprehensions nearing 80 percent is clearer when comparing cherry-picked figures: the highest point in fiscal year 2017 (November) to the lowest point (April). That yields a 76.4 percent decline.", "Trump also claimed, \"Under past administrations, the border didn’t go down, it went up. But if it went down 1 percent, it was like this was a great thing.\"", "In fact, apprehensions have gone down under past administrations.", "Unauthorized immigration also fell dramatically during the George W. Bush and Barack Obama administrations, said Christopher Wilson, deputy director of the Mexico Institute at the Wilson Center.", "Analyses of monthly and annual apprehension statistics show declines for both Bush and Obama’s administrations.", "\"No matter how you look at it, Trump is far from the first U.S. president to preside over big drops in unauthorized immigration,\" Wilson said.", "Apprehension rates at the southern border have plummeted since the 1980s. In 1986 there were 1.6 million apprehensions – about 1.2 million more than in 2016.", "The decline hasn’t been as steady, however, as there have been increases and decreases over the years.", "During the 1980s, there was an annual average of 1 million border patrol apprehensions at the southwest border. During the Obama administration, the average was below 500,000.", "FactCheck.org also pointed out that apprehensions declined 75 percent from fiscal years 2000 to 2016.", "Referring to border apprehensions, Trump said, \"The border is down 78 percent. Under past administrations, the border didn’t go down, it went up.\"", "Calculations of the latest figures available from U.S. Customs and Border Protection do not show a 78 percent decline in apprehensions. The closest number to that would be based on cherry-picked numbers of the highest number of apprehensions in November to the lowest number, in April.", "Though there have been fluctuations over the years in the number of apprehensions, they certainly have gone down under past administrations.", "We rate Trump’s claim False.", "White House, Remarks by President Trump to Law Enforcement Officials on MS-13, July 28, 2017", "White House, Remarks by President Trump in Cabinet Meeting, July 31, 2017", "United States Border Patrol, Southwest border apprehension data from fiscal years 1960 to 2016", "Department of Homeland Security, Archived Content: Statement by Secretary Jeh C. Johnson on Southwest Border Security and Immigration Enforcement Priorities, July 7, 2016", "U.S. Customs and Border Protection, Southwest Border Migration, last published July 7, 2017", "Washington Post Fact Checker, President Trump’s claim that illegal immigration went up under past administrations, Aug. 1, 2017", "FactCheck.org, Trump’s Border Boast, July 31, 2017", "PolitiFact, Mostly True: Rep. Conyers' claim about border apprehensions down since 1980s, April 3, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]