["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A lengthy Facebook post about viruses skips from chickenpox to herpes to HIV and, finally to the coronavirus. It’s attributed to Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, and ends with an uncharacteristic scolding.", "\"For those in our society who suggest that people being cautious are cowards, for people who refuse to take even the simplest of precautions to protect themselves and those around them, I want to ask, without hyperbole and in all sincerity: How dare you?\" the statement says. It goes on to encourage doing everything we can to mitigate the risk of exposure to the coronavirus, to flatten the curve and avoid unnecessary suffering and death.", "\"I reject the notion that it’s ‘just a virus’ and we’ll all get it eventually,\" the post concludes. \"What a careless, lazy heartless stance.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) The words themselves are an opinion and not something we at PolitiFact fact-check.", "But the attribution to Fauci is wrong and worth correcting. In a statement, the National Institute of Allergy and Infectious Diseases told PolitiFact that Fauci wasn’t the author of the post.", "In the comments of another Facebook post with virtually the same words published July 14 — several days before the one we’re fact-checking — a user named Amy Wright takes credit for the statement.", "\"I just saw your words credited to Dr. Fauci,\" another user wrote. \"How about that! People are still sharing your post and learning. Thank you.\"", "\"Oh dear,\" Wright replied. The internet is like the wild west sometimes, isn’t it? At least no one attributed it to Abraham Lincoln.\"", "We rate the claim that Fauci wrote this Facebook post False.", "Facebook post, July 17, 2020", "Facebook post, July 14, 2020", "Statement from the National Institute of Allergy and Infectious Diseases, July 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]