["About this rating", "On Feb. 3, 2021, a tweet by @ialhusseini appeared to share heartwarming news about nine parents who were deported during former U.S. President Donald Trump's administration. The tweet claimed the adults had landed back in the U.S. the same day the tweet was posted and had been reunited with their children:", "However, the photograph used in this tweet was miscaptioned. It's true that nine parents who were deported from the U.S. were later reunited with their children, but that occurrence took place a year before the tweet shown above was posted.", "Pictured in the Feb. 3, 2021, tweet were David Xol and his son, Byron. The Associated Press had reported their story in a Jan. 23, 2020, article headlined \"9 parents separated from families return to children in US,\" along with the photograph shown in the tweet.  The picture was credited to Ringo HW Chiu/AP, and its original caption read: \"David Xol-Cholom, of Guatemala, hugs his son Byron at Los Angeles international airport as they reunite after being separated by the Trump administration.\"", "Both Xol and his son were featured in that AP story:", "LOS ANGELES (AP) — As his long-lost son walked toward him in an airport terminal, a sobbing David Xol stretched out his arms, fell to one knee, and embraced the boy for about three minutes, crying into his shoulder.", "He had not held the child since May 2018, when border agents pulled then-7-year-old Byron away inside a detention facility. They were separated under President Donald Trump’s zero-tolerance policy — the father deported to Guatemala, the son placed in a series of government facilities before ending up with a host family in Texas.", "Xol was one of nine parents who won the exceedingly rare chance to return to the U.S. after being deported under family separation. They arrived Wednesday at Los Angeles International Airport to be reunited with children they hadn’t seen in a year and a half or longer under the order of a federal judge who found the U.S. government had unlawfully prevented them from seeking asylum.", "A video was also included with the AP story showing the moment that Xol and his son embraced for the first time in more than a year and a half:", "https://youtu.be/r_QFc8bIIww", "The tweet from @ialhusseini received thousands of retweets and likes, with one viewing replying,  \"Grateful for the Biden Administration for this beautiful pix.\" Others thanked both U.S. President Joe Biden and first lady Jill Biden. However, these families were reunited a year before Biden was sworn in as president.", "After taking office on Jan. 20, 2021, Biden did move forward on plans to reunite children who were deported and separated from their parents under the Trump administration. On Feb. 2, 2021, The Associated Press reported that the wheels for those unifications were in motion:", "Alejandro Mayorkas, who was sworn in as Homeland Security secretary after his nomination was confirmed by the Senate, will lead a task force on family separation, focused largely on reuniting parents and children who remain apart. It is unclear exactly how many, but about 5,500 children have been identified in court documents as having been separated during Trump's presidency, including about 600 whose parents have yet to be found by a court-appointed committee.", "\"We're going to work to undo the moral and national shame of the previous administration,\" Biden said.", "The review will address the possibility of legal status in the United States for separated families and providing mental health services.", "The American Civil Liberties Union, which sued to reunite families, has asked the administration for legal status in the United States for all of the thousands of families that have been separated, as well as financial compensation for those families and attorneys at government expense.", "In sum, a tweet from Feb. 3, 2021, reported a news story as if it had just taken place. However, although the story was true, it was a report from more than a year earlier. Twitter users shared the tweet and its accompanying picture as if it were new and current, and for this reason we have rated this story as being \"Miscaptioned.\"", "Featured photograph caption (top): \"A Honduran asylum seeker, recently released from federal detention with fellow migrants, holds the hand of her six-year-old daughter at a bus depot on June 11, 2019, in McAllen, Texas.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]