["About this rating", "Back in December 2016, the America's Last Line of Defense junk news website published an article falsely reporting that First Daughter Malia Obama had been indicted on food stamp fraud charges (emphasis ours):", "A member of the First Family will face fraud charges early in 2017, but it isn’t who you might think. President Obama is certainly guilty of fraud for his use of a fake birth certificate and for pretending he’s a Christian and Michelle Obama is certainly guilty for the $180 million in lavish vacations and 200 staffers she keeps to walk her dog and weed her garden on the taxpayer’s dime, but they seem to be impervious to any kind of action against them.", "Malia, however, isn’t going to be so lucky. It seems that while putting in her paperwork to go to school at Harvard, the oldest Obama daughter, who recently turned 18, lied on her financials and failed to disclose the $9 million she has ion the bank. That’s not an issue with the school, as she’s going on a full scholarship for being the daughter of a president, but it didn’t bode well with the Commonwealth of Massachusetts.", "That’s because Malia decided that she would fail to disclose her assets when she applied for food stamps. Yes, you heard that right. Obama has trained the youth of America to be so dependent on the government that even his own daughter thought she was entitled to free stuff just because she’s not technically working.", "This item was a fabricated report that originated solely with America's Last Line of Defense (LLOD), a junk news website that frequently publishes political misinformation as \"satire.\" A number of clues on the site indicate the satirical nature of its content, such as the \"you're an idiot\" tag at the top of the article, the disclaimer in the site's \"About Page,\" and a special note beneath the article mocking its conservative targets:", "DISCLAIMER: The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "While this story is ridiculous and can in no way be verified, conservatives tend to not reads below the pictures of Patriotic pets. It is here that we can gather to point at them and laugh as they head back to the Facebook page to make an immediate connection between Malia, food stamps and black people.", "Yes, it really is that predictable.", "Although the rumor that Malia Obama was indicted on food stamp-related fraud charges originated with a 2016 junk news article, several social media users have continued to spread the false rumor in the ensuing years. In April 2019, nearly two-and-a-half years after this fake article was originally published, we encountered a meme asking, \"What happened to Malia Obama's Food Stamp Fraud Charge?\":", "The answer to the question posed in this meme can be answered quite simply: Nothing, because those charges never existed to begin with.", "America's Last Line of Defense has published a number of articles offering false claims about Malia Obama. We've previously covered items asserting that Malia once said white people will be \"blended out,\" that she was expelled from Harvard, that she was busted for streaking at college, that she founded an anti-Trump website, that she attacked an old woman, and that she was arrested for purchasing marijuana. None of the aforementioned stories was true.", "America's Last Line of Defense.   \"An Obama Was Just Indicted for Fraud -- But It’s Not Who You Think.\"\r\n    December 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]