["In the aftermath of the impressive victory of Begum Tabassum Hasan, candidate of the Rashtriya Lok Dal (RLD) from Kairana, UP in the recent bypoll, a quote ascribed to Hasan has spread like wild fire on social media and WhatsApp. According to this quotation, Hasan has said, “ये अल्लाह की जीत है और राम की हार” (This is the victory of Allah and defeat of Ram- translated).", "The quote has been posted on a number of pro-BJP pages on Facebook among which Yogi Adityanath- True Indian posted it on June 1, and has been shared more than 3700 times at the time of writing.", "आज वाकई बड़ा खुश हूँ कैराना की हार पर सुबह दुख था लेकिन जैसे ही कैराना से सांसद चुनी गई तसव्वुर बेगम ने कहा “यह…", "Posted by Yogi Adityanath – True Indian on Thursday, May 31, 2018", "On another page Kamal Tyagi BJP, the same quote has been posted and so far, it has been shared close to 1000 times.", "आज वाकई बड़ा खुश हूँ…", "कैराना की हार पर सुबह दुख था…", "लेकिन जैसे ही कैराना से सांसद चुनी गई तसव्वुर बेगम ने कहा “…", "Posted by Kamal Tyagi BJP on Thursday, May 31, 2018", "There is another version of the quote as well which is circulating widely. According to this version, Hasan has allegedly said, “ये इस्लाम की जीत है और हिन्दुओ की हार है” (This is the victory of Islam and defeat of Hindus- translated). This version of the quote was posted on the Facebook page We Support Yogi Adityanath which has a huge following of over 1 million. It has been shared almost 24000 times since it was posted on the morning of June 1.", "ऊपर लाइक बटन दबाकर पेज से जुड़ें !", "Posted by We Support Yogi Adityanath on Thursday, May 31, 2018", "This alleged quote is also massively viral on WhatsApp where it has likely been shared in hundreds of groups by now.", "The quotation has been shared widely on Twitter as well, where at least three people followed by PM Modi on the platform have tweeted it.", "Alt News contacted Tabassum Hasan who clarified that she has not made any such statement in any capacity whatsoever. She said, “हम तो सब धर्मों का सम्मान करते हैं, हमारा ऐसा कुछ अलग नहीं है। हमेशा जो है हम ये चाहते हैं कि भाई सब इंसानियत में रहे हर इंसान एक-दूसरे से प्यार मोहब्बत से रहे। इनलोगों को जब कोई रास्ता नहीं मिला तो ये फेक मेसेज चला चला के 2019 के लिए रास्ता बनाना चाहते हैं। आपको कहीं से पता चले अगर जिसने यह सब किया है तो मुझे भी जरूर इन्फॉर्म करियेगा। हम ऐसे लोग नहीं है ना हमने ऐसा कुछ कहा है कभी। अल्लाह और राम में फर्क ही क्या है, मानने वालों की बात है आस्था की बात है जो मानता है दिल से मानता है। दिल से मानने की बात है।” (We respect all religions, ours is no different. What we always want is that everyone live with humanity and live in love with each other. When these people do not find any other way they have spread this fake quote with an eye on 2019. Kindly inform me if you find out who has done this. I am not such a person, nor have I said anything like this. What is the difference between Allah and Ram. It is about personal faith- translated)", "BJP had performed poorly in the recent bypolls, and the fake news machinery sympathetic to the party immediately swung into action. Alt News has on numerous occasions observed continuous attempts to disturb communal harmony and further communal hatred by pages and groups supportive of the BJP. This phenomenon of fake news is closely related to the election cycle and recurs incessantly, used in order to set a particular agenda prior to elections and/or as a cover-up in the event of electoral failure.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]