["John Oliver poked fun at the Kentucky Senate race during his new show \"Last Week Tonight\" on May 11, 2014.", "Comedian John Oliver says Kentuckians aren’t getting the Senate campaign they deserve — nor one they can even follow.", "On his new HBO show Last Week Tonight, Oliver quipped that the race between Sen. Mitch McConnell, R-Ky., and Kentucky’s Democratic Secretary of State Alison Lundergan Grimes has devolved into a battle of silly Internet memes.", "That’s ironic, The Daily Show alum said, because a good chunk of Kentuckians can’t even get online.", "\"The people of Kentucky deserve everyone’s sympathy, or at least the one’s with Internet access,\" Oliver said. \"Here’s an interesting fact: 28 percent of Kentuckians don’t have any online access, a commodity the U.N. had deemed a basic human right. Even Alaska has that number down to 18 percent and they had to lay cable through 1,300 miles of narwhal.\"", "We’re sticking to the fact-check about Kentucky’s connected population (but for what it’s worth, narwhals are not indigenous to Alaska.)", "Defining Internet access", "We reached out to a producer for Last Week Tonight for the source of the claim. She pointed us to U.S. Census Bureau data from the 2012 current population survey.", "The survey found that 71.9 percent of Kentuckians reported accessing the Internet either from within their home or outside the home (school, local library, etc.). That ranks 39th in the country.", "The inverse, then, would mean 28.1 percent in the state don’t have access to the Internet, right?", "Not exactly. Just because someone doesn’t have Internet, doesn’t mean they don’t have access to it.", "Typically, Internet \"access\" as a noun is discussed in terms of whether those services would be available if people wanted them. Oliver was measuring it a different way: by the percentage of people who say they actually use the Internet (as in access the verb).", "Each state collects data every six months on broadband availability to residents in every part of the state and sends it to the National Telecommunications and Information Administration, a part of the Commerce Department. That information is put together to create the National Broadband Map, which shows how connected each community is to the Internet.", "According to the data, 94.4 percent of people in Kentucky have access to at least Internet speeds of 3 megabits per second (we know that’s not very fast, but we’ll get to that shortly).", "What Oliver forgets to factor in is some people choose not to connect to the Internet, even though it is available.", "Why would someone make that choice? According to Census data, about half of people nationwide said they don’t have Internet because they don’t want it or don’t think they need it.", "Another 28 percent of people said the cost is too prohibitive, while 13 percent said they don’t have a computer at all.", "So, clearly for some people, access to affordable Internet is as problematic as access to Internet as a whole. But it’s hard to know for how many Kentuckians that was a factor.", "Need for speed", "Let’s get back to speed for a second, though, because this is where Oliver’s point is well taken, even if the numbers are off.", "Internet speed of 3 megabits per second is considered \"basic.\" But as University of Kentucky professor Michael Childress notes, \"basic level of broadband speed is no longer sufficient for many important applications,\" such as distance learning.", "In this realm, Kentuckians are at a disadvantage compared to other states, and the disparity between Kentucky and more connected states increases the faster speeds get.", "For starters, while getting Internet at speeds 3 mbps to 94 percent of the state seems like an accomplishment, Kentucky actually ranks 47th in the country, ahead of only Montana, Vermont and Alaska. (Side note: Given Oliver’s comments, it’s interesting to see Alaska here. Even though Oliver was right that a higher percentage of Alaskans are hooked up to the Internet at home, a smaller percentage of residents have access to the broadband grid, and that doesn’t change at higher Internet speeds.)", "Smaller, urban states have an easier time getting their residents access to higher speeds. In New Jersey, for example, 97 percent of the population can access download speeds greater than 50 mbps. Only 58.4 percent of Kentuckians have that luxury.", "Here’s a chart looking at the percentage of Kentuckians with access to the Internet at varying speeds compared to the rest of the country.", "Speed", "% of population with access", "Rank (50 states)", "3 mbps", "94.4", "47", "6 mbps", "90.3", "46", "10 mbps", "88.0", "47", "25 mbps", "60.8", "43", "50 mbps", "58.4", "42", "100 mbps", "7.5", "44", "Kentucky is near the very bottom at every speed. How far behind is Kentucky at the highest speeds? The median state at 100 mbps, Missouri, still has 60 percent of its population in areas with access to Internet speeds at that level. Kentucky has just 7.5 percent.", "Why such a discrepancy? Childers says it’s about location. \"Some households are located in rural areas where traditional broadband is simply not provided — such as many sparsely populated areas in the mountains of Eastern Kentucky.\"", "The state is working on it, though. Kentucky has received $5.3 million in grants, including from the 2009 federal economic stimulus, to help bring high-speed broadband Internet to all corners of the state.", "Our ruling", "Oliver said, \"28 percent of Kentuckians don’t have any online access.\"", "When it comes to Internet speak, \"access\" as a noun refers to whether someone has the ability to acquire Internet. By that definition Oliver is wrong — as only less than 6 percent of Kentucky residents don’t have access to Internet at what’s considered a basic speed.", "What Oliver would have been better off saying is that 28 percent of Kentucky’s residents don’t access (as a verb) the Internet, which is supported by Census Bureau data.", "That said, Oliver is largely right in making his broader point — that when it comes to Internet access or use, Kentuckians tend to lag behind the rest of the country. The state ranks near the bottom in both percentage of people who live on a broadband grid and the number of people with Internet in their homes.", "While this is sad news for the prospects of a PolitiFact Kentucky branch, it helps save Oliver’s less-than-perfectly worded claim. We rate it Half True.", "John Oliver on \"Last Week Tonight,\" aired May 11, 2014", "Email interview with Tobe Becker, vice president of media relations for HBO, May 14, 2014", "Email interview with Michael Childress, research associate at the Center for Business and Economic Research at the University of Kentucky, May 14, 2014", "Wildlife.org, Overview of the narwhal, accessed May 14, 2014", "U.S. Census, \"Computer and Internet Use in the United States,\" May 2013", "U.S. Census, Computer and Internet Access in the United States: 2012; Table 2. Reported Internet Usage for Individuals 3 Years and Older, by State: 2012, accessed May 14, 2014", "University of Kentucky Center for Business and Economic Research, \"The Internet in Kentucky: Life in the Slow Lane,\" Sept. 2013", "National Broadband Map, State speed rankings, accessed May 13, 2014", "National Broadband Map, State profile: Kentucky, accessed May 13, 2014", "Email interview with Juliana Gruenwald, spokeswoman for the National Telecommunications and Information Administration, May 13, 2014", "National Telecommunications and Information Administration, Working to Provide a Better National Broadband Map, Feb. 20, 2014", "National Telecommunications and Information Administration, Exploring the Digital Nation, June 2013", "Kentucky Finance and Administration Cabinet, Broadband KY, accessed May 13, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]