["The farmers’ protest in Delhi took a violent turn on January 26 after a group of protestors entered the Red Fort. Farmer groups have been protesting against three farm laws, demanding a repeal for months now.", "A video of a rally with chants of “Modiji lath bajao hum tumhare saath hai, Delhi police lath bajao hum tumhare saath hai” (Strike them down Modiji, we are with you. Strike them down Delhi police, we are with you) has been linked to the Republic Day clashes. It is being suggested that a rally was taken out in support of the Delhi police.", "Twitter user @Ritutyagi30 shared the video and wrote, “Delhi citizens are no more in a mood to see fake farmers at the border who tainted the honour of this country.”", "26 जनवरी को इन #नकली किसानों ने जो देश की इज्जत को दाग लगाया अब दिल्ली की जनता इनको बॉर्डर पर और देखने के मूड में नही है ।।#हमारा_बॉर्डर_खाली_करो #योगी_जी_अब_लठ_बजाओ pic.twitter.com/RIgOr4bmng", "— 𝗥𝗶𝘁𝘂 𝗧𝘆𝗮𝗴𝗶 🇮🇳 (@Ritutyagi30) January 28, 2021", "BJP IT cell member (@anandkalra69) also tweeted the video and wrote, “People of north Delhi in support of Delhi police are chanting…’Delhi Police, strike them down. We are with you.’”", "@DelhiPolice के समर्थन में उतरे दिल्ली वाले….. दिल्ली पुलिस लठ बजाओ, हम तुम्हारे साथ हैं के नारे लगाये।#WelldoneDelhi pic.twitter.com/ze5y9tt5tP", "— आनन्द कालरा (@anandkalra69) January 27, 2021", "The video received more than 47,000 views and over 1,100 shares from the account of Facebook user Anil Parmar. He claimed that the Delhi police received the support of the general public.", "दिल्ली पुलिस लठ बजाओ हम तुम्हारे साथ है🔥🇮🇳", "दिल्ली पुलिस को मिला आम जनता का समर्थन दिल्ली पुलिस लठ बजाओ हम तुम्हारे साथ है", "Posted by Anil parmar on Wednesday, January 27, 2021", "BJP supporter Shefali Vaidya tweeted, “Where is this? Can anyone confirm?”. It got more than 48,000 views and 1,000 retweets.", "Where is this? Can anyone confirm? pic.twitter.com/RScSFlHdji", "— Shefali Vaidya. (@ShefVaidya) January 27, 2021", "Alt News performed a simple keyword search on Google and came across an article by Loknat News which dates back to December 27, 2019.", "The article states that the video was tweeted by BJP politician Jawahar Yadav on December 27, 2019 in the backdrop of the CAA protests. The video shows pro-CAA mob chanting slogans against protestors.", "हरियाणा की रैली देश की रैलियों से थोड़ी अलग होती है। 😂", "“मोदी जी तुम लठ बजाओ, हम तुम्हारे साथ हैं ।” pic.twitter.com/SJ79hu72Nw", "— Jawahar Yadav (@jawaharyadavbjp) December 26, 2019", "A keyword search on Twitter revealed that @iSinghVikash was one of the firsts to tweet the video on December 24, 2019.", "We also found this video posted on the Facebook account Shri Rajput Karni Sena on the same day.", "An old video from a 2019 rally against CAA-NRC protests is widespread with the false claim that people came out against the farmers’ movement, demanding that the Delhi police and Prime Minister Modi come down heavily upon the demonstrators. While this video is not related to farmers’ protest, it is noteworthy that a crowd had indeed gathered at Singhu border to demand that protesting farmers vacate the area. The counter-protest saw BJP workers posing as ‘locals’ and chanting ‘humara border khali karo’ (clear our border).", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]