["About this rating", "A photograph purportedly showing Anna Mae Dickinson, dubbed \"the luckiest woman to ever live,\" has been making the rounds for several years along with a story about all of the deadly incidents that she was purportedly lucky enough to survive during her lifetime:", "Anna Mae Dickinson is quite possibly the luckiest woman ever. She survived the sinking of both the Titanic and Lusitania, the Hindenburg explosion, the bombing of Pearl Harbor, and, when she was 97, the destruction of her apartment during the 9/11 terror attack.", "Whether Anna Mae Dickinson was supremely lucky for surviving all those historic disasters or supremely unlucky for being present at so many disasters is a matter of debate — or rather, it would be if she had ever truly existed.", "Anna Mae Dickinson's story can't be traced all the way back to the Titanic disaster. Rather, it can be dated back to an unsourced 2006 article posted to a web site called InstaPunk.", "The article was published shortly after the release of director Oliver Stone's 2006 movie World Trade Center. The article seemingly poked fun at New Yorkers who felt that it was \"too soon\" to release a film about the 9/11 terrorist attack, which claimed the lives of nearly 3,000 people and used a fictional interview with a nonexistent Anna Mae Dickinson published in a nonexistent newspaper to underscore its point:", "As Oliver Stone's World Trade Center rolls out into theaters across the country, New Yorkers are clearly struggling with their emotions about the picture and its all-too-real premise.", "[...]", "As sad as all this is, it pales in comparison to the trauma experienced by Anna Mae Dickinson, resident of Lower Manhattan and, at 102, the oldest and last surviving victim of the 1912 sinking of the Titanic. Her story is told in a moving piece in the New York Intelligencer:", "She was eight when she lost her father and narrowly escaped death herself on the Titanic. She was 11 when she lost her Aunt Olivia in the torpedoing of the Lusitania. She was 31 when she lost her first cousin Alfred in the Hindenberg explosion. She was 37 when she lost her nephew Thomas in the bombing of Pearl Harbor. And she was 97 when her tiny apartment was shaken and battered by the collapse of the twin towers on September 11, 2001.", "[...]", "Then, finally, the bitterly hard question of the day: How does she feel about them making a movie of that devastating day?", "This time, Anna Mae answers loud and clear, with no need for assistance from her nurse: \"Too soon,\" she cries. \"Too soon. The wounds are all still too fresh. They had no right to make that disgusting movie about our poor ship when some of us were still alive to feel the pain.\" And then she commences to sob like an eight-year-old girl.", "[...]", "So if New Yorkers think they're exquisitely sensitive, maybe they should take a minute to think about the titanic example set by Anna Mae. For many of the 9/11 survivors, it will be a long, hard, distracting road to the age of 102, and the truth is, too many of them aren't dwelling nearly enough in the past to make their grief last so long and so monotholically.", "The article contained details that offered clues that the story was intended as satire. For instance, it reported that all of the clocks in Dickinson's home were permanently frozen at 2:20, the time that the Titanic sank into the ocean. It also claimed that the interview with Anna Mae Dickinson was originally published in a publication called the New York Intelligencer, but we found no record of a publication by that name. A column called \"The Daily Intelligencer\" is published in New York magazine, but we found no mention of Mrs. Dickinson in their pages.", "Furthermore, a list of passengers aboard the Titanic does not include anyone named Anna Mae Dickinson.", "The final nail in this claim's coffin, however, comes from a simple reverse image search of the included photograph. The woman in this picture is not Titanic/Hindenburg/Lusitania/Pearl Harbor/September 11th terrorist attack survivor Anna Mae Dickinson. This is actually a photograph of American folk artist Anna Mary Robertson Moses (better known as Grandma Moses).", "The story about the Anna Mae Dickinson, or \"luckiest woman to ever live,\" was invented for a 2006 article chiding New Yorkers who felt that it was \"too soon\" to make a movie about the 11 September 2001 terrorist attacks in New York and Washington, D.C. This article, which featured a fictional interview in a non-existent publication, was later boiled down into a meme which used an image of non-Titanic survivor Grandma Moses.", "History.com.   \"This Day in History: The Titanic Sinks.\"\r\n    Retrieved 12 April 2018.", "Instapunk.   \"The Oldest Victim.\"\r\n    5 August 2006.", "Salt Lake Telegram.   \"Titanic Passenger Lists, First and Second Class.\"\r\n    16 April 1912.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]