["A claim that initially appeared in several posts shared widely on Facebook and Twitter, and then in articles published in several blogs and two major Nigerian newspapers, states that a significant LGBT rights organisation had backed Nigeria's main opposition presidential candidate Atiku Abubakar ahead of elections next February. But there is no evidence to support this claim or evidence that the LGBT organisation actually exists.", "The claim first appeared in a Twitter post on October 14, where a fake account purporting to be Abubakar, thanked the “Association of Nigerian Gay Men (ANGAM)” for endorsing his campaign.", "In the post, the unverified account pledged to abolish the “anti-gay law”, referring to Nigeria's controversial Same-Sex Marriage Prohibition Act, passed in 2014. The act criminalised gay relationships and individual and groups \"promoting\" homosexuality.", "There are no such known groups explicitly made up of LGBT people within Nigeria, largely as a consequence of arbitrary arrests of LGBT people that is widespread according to human rights groups.", "On the same day of the claim by the fake Atiku account, it appeared in numerous articles, such as on a website called Naija Centre News. Many articles quoted anonymous representatives of ANGAM.", "But there is no evidence of the group's existence. Before October 14, there is no record of any statements or activities by or attributed to them.", "In the days afterwards, scores of pictures were posted on Facebook, with hundreds of shares, featuring the statement “The Lesbian, Gay, Bisexual, and Transgender (LGBT) Rights Movement in Nigeria endorses Atiku for president.”", "Then on October 26, articles in the Vanguard and The Nation, two widely circulated Nigerian newspapers, reported that a second group, allegedly called Diverse and representing the LGBT community in Nigeria, had officially supported Atiku Abubakar’s campaign.", "Both newspapers quoted an official called Spinky Victor Lee, who was said to be the group's “Community President of Nigeria.” In both reports, “Spinky Victor Lee” described Abubakar as a liberal who could end the Same-Sex Marriage Prohibition Act.", "There is no evidence that either Spinky Victor Lee or Diverse exists. Before the alleged statements of support for Atiku’s campaign, there is no record of any statements or activities attributed to the group.", "According to The Initiative for Equal Rights (TIERS) which advocates for the rights of sexual minorities, following enquiries with non-governmental advocates, no evidence could be found that either “Diverse” or “Spinky Victor Lee” exists.", "Many apparent support groups based on ethnicity, gender or religion are often fabricated in Nigeria to attack rival positions. LGBT support for a politician would likely be frowned upon in Nigeria, where same-sex relationships are banned and religious conservatives are hostile to the rights of sexual minorities.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]