["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Attorney General Bill McCollum, who is running as a Republican gubernatorial candidate, recently launched his first statewide TV campaign ad with a helping hand from former Gov. Jeb Bush.During the 30-second commercial, Bush speaks about McCollum's accomplishments:", "\"Tough times require proven leadership.\"Bill McCollum is a principled conservative with a record of doing what is right for Florida.\"Bill’s recovered nearly $200 million in Medicaid fraud.\"He’s leading the charge to stop President Obama’s health care takeover.\"And, he has a plan to create 500,000 new jobs, reform government and cut wasteful spending.\"Support my friend Bill McCollum, the kind of solid leader Florida needs.\"", "We decided to focus on this claim: \"Bill's recovered nearly $200 million in Medicaid fraud.\"", "Increasingly Medicaid accounts for a huge chunk of the state budget, with Florida spending roughly $19 billion for the program that serves 2.7 million people, or 14 percent of Florida's population. And fraud is a big problem. Annually, some $3.2 billion in Medicaid fraud is bilked from the state and federal governments.", "To check whether McCollum has made a dent in curbing that fraud, we asked McCollum campaign spokesman Kristy Campbell for documentation. She gave us a March 9 press release from the Attorney General's office. \"I am proud of the record-breaking recoveries my Medicaid Fraud Control Unit has made over the last three years, including $198 million last year,\" McCollum says in the release.Next, the Attorney General's office provided us with a list of recoveries from the Medicaid Control Unit for 2009. The list of 153 cases includes settlements that reach into the millions, like $32 million to be paid by pharmeceutical giant Eli Lilly, and smaller sums like $50,000 to be paid by Hialeah physician Ausberto B. Hidalgo.", "Adding up the itemized list, the sum is actually $203 million. So Bush is almost on the money.We should note that the Medicaid Fraud Control Unit has been around since way before McCollum became attorney general. The unit started under the auditor general's office, but in July 1994 it was moved under the Attorney General's Office as a way to police the state's burgeoning Medicaid program. And McCollum has come under attack from state officials in both the Republican and Democratic parties for not doing enough.As for Bush's claim that McCollum \"recovered nearly $200 million in Medicaid Fraud,\" we rate it True.", "St. Petersburg Times, The Buzz political Blog, \"Jeb stars in Bill McCollum's first TV spot.\" , May 20, 2010YouTube, Video: \"Jeb Bush Endorsement of Bill McCollum\", May 20, 2010State Attorney General's website, Medical Fraud Control Unit explanation, May 24, 2010State Attorney General's Office, \"Medicaid Fraud Control Unit Total Recoveries 2009,\" May 26, 2010, acquired through a public records requestState Attorney General's Office, Press Release, \"Attorney General, Senate President Unveil Legislation Targeting Medicaid Fraud,\" March 9, 2010Miami Herald, \"Sink Hits Medicaid Fraud\", March 5, 2010Miami Herald, \"Senate Pushes Medicaid Reform,\" April 1, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]