["About this rating", "An image of a majestic looking feline is often circulated on social media along with the claim that it shows the first photograph ever taken of a cat:", "While we have not been able to definitively determine the source of this image, we can say with confidence that this is not the oldest photograph of a cat.", "For starters, this image is often circulated with the claim that it was taken in the 1880s, but the first cat photographs date to at least the 1840s. When we examine these earlier photos of cats, it's clear that the above-displayed image was not created with the same methods used in the 1840s.", "The internet's propensity for taking and sharing cat photos may seem like a modern-day tradition, but long before we had Maru, Lil Bub, or Grumpy Cat, we had photographer Harry Pointer and the \"Brighton Cats.\"", "Pointer, who lived in Brighton, England, became well-known for a series of photographs he took in the 1870s of the \"Brighton Cats.\" Pointer took photographs of cats doing regular cat things, like resting, drinking milk, and sleeping in baskets, but his photographs became more popular when he started to position his cats in humorous or unusual positions. One photograph, for instance, showed a cat on a tricycle; another showed cat next to a few tea cups.", "A review of Pointer's large body of animal photographs published in the 1879 issue of The Art Journal of London noted that the images were certainly amusing, but that they also spoke to the humanity of our pets:", "Mr Pointer, of Brighton, continues to be the artist who devotes his skill, experience, and ability to the service of his special sitters - cats. He is a valuable ally of the society for extending \"humanity to animals,\" his portraits conveying conviction that the latter things as well as act: Not only the cats, but the dogs he pictures, gives assurances of the higher attributes of humanity - memory, compassion, gratitude, affection, devoted and self-sacrificing friendship. They manifest the passions also - the good and the bad - and are obviously endowed with those that elevate or degrade men and women. An examination of Mr. Point's singularly large collection supplies material for thought: it greatly amuses, it is true, but it appeals to a much higher sentiment than mere amusement.", "How devoutly would all artists pray that his human sitters would be as docile, patient, and yielding as Mr. Pointer's dogs and cats! The collection is one of singular interest: Mr. Pointer will give joy not only to those who love art, but to those who worship nature.", "Here are a few photographs from the Brighton Cats series, the earliest of which (cat on water can) was taken circa 1870:", "David Sinkin, a photography historian who runs the Sussex-Photohistory, a website dedicated to England's early photographers that hosts several additional images from the Brighton Cats series, told us that Pointer was not the first person to photograph a cat. William Henry Mason Jr., for instance, took the following photograph circa 1860. Sinkin explained that this image was created with a \"daguerreotype process,\" which involves \"fixing a photographic image on a silvered copper plate\":", "While this daguerreotype process was likely used to create the first photograph of a cat, Rev. Calvert Richard Jones used a different method — the calotype process which involves making a salted print from a paper negative — to create the following image circa 1854:", "None of these image, however, can claim the title of world's oldest cat photograph. While we do not have a definitive answer for this question, the likeliest contender appears to be this daguerreotype of a cat drinking from a bowl that was taken circa 1845:", "So what about the image at the top of this article, the one that is frequently shared with the claim that it is the oldest cat photograph in the world?", "Sinkin told us that he couldn't say for sure without examining the physical image, but said that the image did not appear to be made with the daguerreotype or salted negative processes shown above, and therefore was clearly not the \"oldest\" cat photograph in the world:", "I have never seen this cat photograph before, but can confidently state that it is not \"the oldest known photograph of a cat ...", "Judging by the image alone, I would suggest that the photograph was produced at the start of the 20th century at the earliest -- unless the original was originally in monochrome and 'colourized' at a later date ...", "Any picture that claims to be 'the oldest known photograph of a cat' would have to be in the form of a daguerreotype or perhaps a salted print from a paper negative.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]