["About this rating", "A 2018 lawsuit brought by a member of The Satanic Temple (TST) against a Missouri abortion law spurred a debate about religious liberty and abortion rights.", "Judy Doe, the name given to the plaintiff in the suit, claimed that the state of Missouri’s law requiring that a woman seeking an abortion receive a pamphlet informing her that human life began at conception violated Doe's religious beliefs as a member of the temple.", "TST, as a recognized religious organization, can file lawsuits citing religious discrimination. And one of its members, Doe, did indeed file a lawsuit against a particular abortion law in Missouri. But the suit was dismissed in June 2020. This is not the first time the group or its members have filed similar cases on religious-liberty grounds.", "Doe’s lawsuit, filed in February 2018, focused on a state law that required a woman seeking an abortion to receive an “informed consent” booklet. The booklet, in accordance with the law, says: “The life of each human being begins at conception. Abortion will terminate the life of a separate, unique, living human being.”", "In the court document, Doe argued that such a statement violated her beliefs as a member of TST. Founded in 2013, TST is a nontheistic religion with roots in political activism and seeks to encourage “benevolence and empathy” and “reject tyrannical authority.” The temple’s tenets state that access to safe abortions free from state interference is a religious right. The \"Satanic Tenets\" include the following:", "The temple argues that the First Amendment of the Constitution’s establishment clause prevents the government from making any law “respecting an establishment of religion,” meaning the government is forbidden from actions that unduly favor one religion over another.", "According to the temple, such state laws interfere with their religious belief and practices:", "In her 2018 court filing, the plaintiff argued:", "The creation, distribution and enforcement of the Missouri Lectionary promotes the Missouri Tenets in violation of the Establishment Clause of the First Amendment because the State of Missouri is using its power to regulate abortion to promote some, but not all, religious beliefs that Human Tissue is, from conception, a separate and unique human being whose destruction is morally wrong.\n[...]\nSpecifically, but not by way of limitation, the Missouri Tenets and Missouri Lectionary do not mention the Satanic Tenets or the scientific fact that an umbilical cord makes Human Tissue part of a woman’s body.", "The Missouri Tenets and Missouri Lectionary substantially burden Plaintiff’s ability to act in accordance with The Satanic Tenets. That burden includes, without limitation, forcing Plaintiff to act and forgo acting in a manner that violates her belief in The Satanic Tenets as a condition for getting an abortion in Missouri.", "The lawsuit was dismissed in June 2020 in a federal appeals court, where a judge agreed with a lower court's ruling against Doe in 2019 on the grounds that, based on the plaintiff’s arguments, Missouri could not avoid legislating on the issue. The appeals court said: \"Some religions, including Catholicism, embrace the view that life begins at conception. Others, like Doe’s Satanism, do not. Any theory of when life begins necessarily aligns with some religious beliefs and not others. So under Doe’s theory, Missouri’s only option would be to avoid legislating in this area altogether.\"", "TST told Snopes that it would appeal the case to the U.S. Supreme Court. The organization believes the case was valid, as the court’s decision refused to consider Doe’s undue-burden argument, which is the legal standard courts use to determine whether an abortion restriction violates the Constitution. This refusal suggested to TST that \"the court recognizes the validity of that claim and is avoiding having to consider its applicability so that they will not have to rule in our favor.\"", "TST's petition responding to the June ruling, which the group provided to Snopes, said: \"The Missouri Tenet explicitly communicates the religious doctrine of the Catholic Church on when a human being comes into existence, regardless of whether it also communicates the State’s secular value judgment of promoting fetal life. It therefore violates the Establishment Clause.\"", "Based on court documents, media coverage surrounding the lawsuit, and the statement from TST itself, we therefore rate this claim about The Satanic Temple suing Missouri over abortion as “True.”", "The Associated Press.   \"Federal Appeals Court Axes Satanic Temple Abortion Lawsuit.\"\r\n    9 June 2020.", "Center for Reproductive Rights.   \"The Undue Burden Standard After Whole Woman's Health v. Hellerstedt.\"\r\n    26 July 2018.", "Cornell Law School: Legal Information Institute.   \"Establishment Clause.\"\r\n    Accessed 10 August 2020.", "Health.mo.gov.   \"Missouri's Informed Consent Booklet.\"\r\n    August 2019.", "Heller, Susanna.   \"Everything You Need to Know About the Satanic Temple, Which the US Government Just Officially Recognized as an Organized Religion.\"\r\n    Insider.  10 May 2019.", "MacGuill, Dan.   \"Did Planned Parenthood ‘Team Up’ with Satanists to Promote Abortion Rights in Missouri?\"\r\n    Snopes.com.   14 September 2017.", "The Satanic Temple.  \"About Us.\"\r\n    Accessed 10 August 2020.", "The Satanic Temple.  \"Religious Abortion Exemption Letter.\"\r\n    Accessed 10 August 2020.", "United States Court of Appeals for the Eighth Circuit.   \"No. 19-1578: Judy Doe v. Michael L. Parson, Governor of the State of Missouri et al: Appeal from United States District Court for the Eastern District of MIssouri - St. Louis.\"\r\n    9 June 2020.", "United States Court of Appeals for the Eighth Circuit.  \"No. 19-1578: Judy Doe v. Michael L. Parson, Governor of the State of Missouri et al: Petition for Rehearing En Banc.\"\r\n    Accessed 10 August 2020.", "United States District Court Eastern District of Missouri Eastern Division.   \"Judy Doe v. Eric R. Greitens, Governor of the State of Missouri et al.\"\r\n    28 February 2018.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]