["About this rating", "On 7 March 2018, a Facebook user shared a screenshot of Samuel L. Jackson's purported Twitter bio:", "Versions of the same sentiment were shared in May 2018 by The Other 98% and Occupy Democrats, and yet another version also formatted as a tweet (in which Jackson's handle was misspelled) appeared on Quora and Reddit:", "As of 3 May 2018, Jackson's verified Twitter page featured no biography information:", "Also, when users populate their Twitter biography fields, the text in that area does not appear in boldface, nor is it formatted in the manner seen in the purported screenshot of Jackson's Twitter page:", "Formatting wasn't the only aspect inconsistent with Jackson's use of Twitter. One of the two versions of the \"rapper\" lament attributed to him employed random capitalization, a habit not present in legitimate tweets from the actor. The creator of the screenshot also used asterisks to \"censor\" a profanity, but Jackson occasionally employs uncensored, whimsically-spelled swear words:", "Today’s mood. Might have to cap a muphukaa today, channeling Jules, attitude just right!!… https://t.co/WMMEvb5VzP", "— Samuel L. Jackson (@SamuelLJackson) April 12, 2018", "Morning after Premiere mood. I never get enuf of these muthafukkyn snakes!!… https://t.co/gAoqchY5Jo", "— Samuel L. Jackson (@SamuelLJackson) April 24, 2018", "The statement also appeared to have been simply attributed to Jackson on Twitter without being framed as an actual tweet:", "“Maybe if we underpaid these modern mumble rappers and overpaid teachers there would be smarter people in the future and less shitty music.” - Samuel L. Jackson", "— Hum (@drohum) February 4, 2018", "Twitter's advanced search function reveals no legitimate retweets of the tweet attributed to Jackson; instead, users have been sharing an image of it. Given the popularity of that image, it is unlikely the remarks purportedly issued by Jackson would have gone unnoticed — had he actually made them.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]