["By Ilana Nathans", "Posted on September 10, 2020", "A Facebook post falsely claims that Washington, D.C., Mayor Muriel Bowser “proposed using her power to remove” the Washington Monument and Lincoln Memorial in the wake of protests against racism. Bowser asked an advisory panel to review possible changes to D.C.-owned assets; she did not propose removing any federal monuments.", "Protests against racism and police violence in cities across the U.S. have ignited debates over whether monuments to Confederate generals and other historical figures should be relocated or taken down.", "In response to the protests, Washington, D.C., Mayor Muriel Bowser formed a working group — the District of Columbia Facilities and Commemorative Expressions, or DCFACES — in July. The group was asked to review D.C.-owned facilities and recommend whether they should be “removed, renamed or contextualized” if their namesake has a “key disqualifying history,” such as participation in slavery, systemic racism, or mistreatment of minority groups.", "After DCFACES released its report on Sept. 1, a viral Facebook post falsely claimed that Bowser proposed removing two of the nation’s iconic landmarks. The post includes an image of the sites and reads: “BREAKING: DC Mayor Muriel Bowser has just proposed using her power to REMOVE the Washington Monument and the Lincoln Memorial in the wake of George Floyd’s death to push for ‘inclusion, equality, and justice.’”", "But Bowser never recommended removing the Washington Monument, and the Lincoln Memorial was not even mentioned in the report.", "President Donald Trump echoed the false claim at a campaign rally in Winston-Salem, North Carolina, on Sept. 8. Referring to the protests and the movement to relocate or remove statues, Trump said, “You want to knock them down? That’s fine. But you go to jail for 10 years. It was amazing. It was amazing how that stopped. … But the DC committee, did you see about that? They want to change the name of the Washington Monument. They want to get rid of the Lincoln Monument, Jefferson Monument. Now, we’re talking the big stuff.”", "An initial, 24-page version of the DCFACES report did include a list of federal statues and memorials. Its recommendation was, “Using the Mayor’s position on the National Capital Memorial Advisory Commission, recommend the Federal government remove, relocate, or contextualize” a list of eight assets, including the Washington Monument and Jefferson Memorial. This was a recommendation of the working group and did not clarify which option — “remove, relocate, or contextualize” — it was suggesting for the Washington Monument or Jefferson Memorial. And, again, it did not mention the Lincoln Memorial.", "Following a backlash to the suggestion that federal monuments could be affected, Bowser deleted the page of federal sites from the report on the day it was released, Sept. 1.", "At a Sept. 3 press conference, when asked for her reaction on the DCFACES report and why the recommendations on federal monuments were taken out, Bowser said her “expectation of the report was that it would not include any recommendations on federal buildings.” When she saw the report, Bowser said, “I could see immediately how its recommendations could be easily misconstrued.” She removed the recommendations on federal assets, and asked the working group “to stay focused on local D.C.”", "The group’s amended report recommends renaming 49 assets owned or managed by the district, including public schools, residential buildings and campuses, parks, fields and playgrounds, and government buildings.", "Although the D.C. mayor is a member of the National Capital Memorial Advisory Commission — which advises federal agencies “on policy and procedures” of “commemorative works in the District of Columbia” — the commission does not have the jurisdiction to rename, relocate, or remove a national monument or memorial. Those are under the jurisdiction of the federal government, and are managed by federal agencies such as the National Park Service, U.S. Forest Service, U.S. Fish and Wildlife Service, and the Bureau of Land Management.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Bowser task force targets Washington Monument, Jefferson Memorial, dozens more.” Associated Press. 2 Sep 2020.", "Donald Trump Winston-Salem, North Carolina, Rally Speech Transcript. 8 Sep 2020.", "Holcombe, Madeline. “Charleston removes a statue of slavery defender and former Vice President John C. Calhoun.” CNN. 24 Jun 2020.", "Mansoor, Sanya. “93% of Black Lives Matter Protests Have Been Peaceful, New Report Finds.” Time. 5 Sep 2020.", "Massimo, Rick. “Panel will examine histories of the namesakes of DC’s public places.” WTOP. 23 Jul 2020.", "Mayor Muriel Bowser. DC Facilities and Commemorative Expressions (DC FACES) Working Group. Accessed 4 Sep 2020.", "Mayor Muriel Bowser. DC Faces Working Group Report. Accessed 4 Sep 2020.  (revised version)", "Mayor Muriel Bowser. DC Faces Working Group Report. Accessed 4 Sep 2020.", "Mayor’s Office. Mayor Bowser Holds Media Availability, 9/3/20. 3 Sep 2020.", "National Park Service. National Capital Memorial Advisory Commission. Accessed 4 Sep 2020.", "Morris, Phillip. “As monuments fall, how does the world reckon with a racist past?” National Geographic. 29 Jun 2020.", "Pereira, Ivan. “Here’s where Confederate statues and memorials have been removed in the US.” ABC News. 19 Jun 2020.", "“Stonewall Jackson statue removed from pedestal following order from Mayor Stoney.” NBC12. 1 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]