["Member of parliament in South Africa's second-largest opposition party, tweeted that South Africa is not ready to ease covid-19 lockdown.", "Echoing an earlier statement from the party, EFF MP Mbuyiseni Ndlozi tweeted that South Africa was easing its national Covid-19 lockdown despite the WHO saying the country wasn’t ready.", "No such statement from the WHO exists. Spokespeople say the international agency makes recommendations but governments have to make their own decisions.", "The health department has cited the WHO guidelines, but the degree to which the country is following them remains unclear.", "South Africa’s nationwide Covid-19 lockdown was eased in April 2020. It was replaced with a risk adjusted strategy, where regulations are lifted or reimplemented as the risk of transmission changes.", "While welcomed by some, others saw the lockdown relaxation as coming too soon.", "One of them was Dr Mbuyiseni Ndlozi, a member of parliament for the Economic Freedom Fighters (EFF), South Africa’s second-largest opposition party.", "He tweeted on 30 June that South Africa was easing its national lockdown “despite [the World Health Organization] unequivocally declaring that [South Africa] was not ready”. A similar statement had been made by the EFF in a press statement on 28 May.", "Did the World Health Organization, or WHO, declare South Africa was not ready to lift its lockdown? And did it say so “unequivocally”?", "Africa Check could not find any statements from the WHO saying that South Africa was “not ready” to ease its lockdown. Ndlozi did not respond to requests for evidence supporting his claim.", "Multiple spokespeople for the WHO said that they were not aware of any statement like this being issued.", "The organisation did, however, publish guidelines for “transitioning to and maintaining a steady state” of low-level or no transmission of Covid-19 on 14 April.", "These included, for example, that transmission be “controlled”, public health services be “sufficient” and “workplace preventive measures” be in place. Exact details of how to measure these are not provided.", "Dr Owen Kaluwa, WHO representative to South Africa, commented on the transition guidelines in an interview with news channel eNCA on 20 May.", "“These are global guidelines that countries have to use or apply according to their local contexts, and local situations,” he said.", "The video was originally shared online by eNCA with a banner saying that South Africa did not meet WHO criteria to ease the lockdown. The news channel later deleted the video and republished it without the banner, saying it had been “incorrectly titled”.", "The WHO did release a statement urging “caution as countries in Africa ease lockdowns” on 28 May.", "It noted concerns that “Covid-19 cases could start increasing rapidly” if lockdown measures were relaxed too quickly. The statement mentioned South Africa, saying that the time taken for the number of cases to double had remained stable since the lockdown measures started being relaxed.", "“Ending a lockdown is not an event, but a process, and it’s important to have a clear view of local conditions so informed decisions can be made about how to relax these measures,” said Dr Matshidiso Moeti, the WHO’s regional director for Africa.", "But the final decision of when and how to lift lockdowns lies with governments, Collins Boakye-Agyemang, communications officer for the WHO regional office for Africa, told Africa Check.", "He said: “We don’t get involved in the decision of whether a government should lock down or not. Our role is to provide the best possible evidence and recommendation to countries. Then they have to make their own decisions.”", "These decisions, he said, should be based on countries’ “local context, the epidemiological situation and the health system’s capacity”.", "South Africa’s health minister, Dr Zweli Mkhize, referred to the “sound guidelines” from the WHO in an article on 15 May.", "Four days later, during a closed media briefing, he reportedly suggested the rate of new infections had to slow before the lockdown could be lifted “in line with World Health Organization guidelines”.", "His presentation included the guidelines for easing public health measures and indicators used to monitor them.", "For example, the “weekly rate of change in the number of positive cases per district” was presented as an indicator for the WHO’s guideline that “evidence should show that the Covid-19 transmission is controlled”.", "But the presentation did not say if the guideline was being met or the rate that would need to be achieved in order to do so.", "Africa Check asked the health department if it considered South Africa to meet the guidelines. At the time of publication we had not received a response.", "Mbuyiseni Ndlozi, a member of parliament for the EFF, claimed the WHO “unequivocally” said South Africa was not ready to ease its national Covid-19 lockdown.", "We could find no evidence of the WHO making this statement. The organisation told Africa Check that it is not involved in how and when governments lift restrictions. It aims to give authorities the best evidence available to guide their decisions.", "The WHO has however urged African countries to exercise caution when lifting lockdowns. We rate the claim incorrect.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]