["“It’s hard to trust pollsters when your own eyes see this each day,” says text accompanying the photos in a post from October 26, 2020.", "The claim can also be found on Facebook here, here and here.", "Although both photos are authentic, the comparison is misleading.", "The top photo is of a Trump rally in Des Moines, Iowa, on October 14.", "The US president has continued campaigning and hosting rallies across the country, despite the novel coronavirus crisis that has killed more than 230,000 people in the US since the beginning of the pandemic and caused Trump himself to be hospitalized after testing positive.", "As shown in the photo, there was no social distancing during the Trump rally in Des Moines that gathered “thousands” of supporters, according to the president.", "The bottom photo is of a Biden-Harris event that took place in Yuma, Arizona on October 9. Democratic leader of the Arizona House of Representatives, Charlene Fernandez, originally posted the photo on her social media accounts here and here.", "Victor Calderon, a KAWC News journalist based in Yuma county, confirmed to AFP that neither Harris nor Biden were present. The event was organized by the Biden campaign and the Democratic party in Yuma. “It was a bus tour that traveled around Arizona, to the smaller cities where neither Biden nor Harris visited.”", "Campaign signs were handed to local Biden supporters, the journalist reported. “I didn't get a head count but I would say about 100” people were present, Calderon told AFP via email. He also said everyone wore face masks and hand sanitizer was available.", "Drive-in rallies and town halls via Zoom and broadcast on television have become a staple of the Democrat's mostly low-key and mostly virtual campaign, as he scrupulously adhered to social distancing and mask-wearing guidelines to guard against the coronavirus.", "Biden has repeatedly slammed Trump's determination to rally huge crowds during the pandemic, but the president has brushed the concerns aside.", "“There is no excuse for President Trump's reckless behavior,” Biden tweeted on October 11.", "In 2016, Trump won Arizona and Iowa relatively easily but the latest polls seem to show close races in both states, and were Biden to win either it would be an upset.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]