["Katty Kay with Chuck Todd on NBC's \"Meet the Press,\" Feb. 8, 2015.", "Sunday show talking heads continued to debate vaccinations of children -- specifically, how there should be no debate -- as they analyzed political missteps from the past week.", "BBC World News America anchor Katherine \"Katty\" Kay made a startling comparison to highlight how Americans have been less diligent in making sure their children are properly immunized.", "\"There are countries in Africa where they have higher vaccination rates than here in the United States,\" Kay said on NBC’s Meet the Press. \"Because when people really need it, and they see the effects that measles can have on their communities, they will make sure that their children vaccinate.\"", "Rhetoric about the measles outbreak stemming from Disneyland in California, home to a significant measles-resistant population, is keeping PunditFact and PolitiFact busy. We wanted to continue our look at this re-emerging viral threat by examining the accuracy of Kay’s claim.", "While we did not hear back from her by our deadline, we have a pretty good idea of Kay’s source.", "The World Health Organization, which recommends infants be vaccinated with at least one dose of the MMR vaccine before their first birthday, maintains immunization rates for the measles vaccine among 1-year-olds by country. The most recent data is for 2013.", "There were 16 African countries that beat the U.S. rate of 91 percent for the measles-mumps-rubella vaccine in 2013, according to the WHO data. (The Centers for Disease Control and Prevention puts the measles immunization rate in the United States is 91.9 percent. But the WHO and CDC measure the statistic in different ways, and as you'll see, it doesn't make a difference.)", "The countries besting the United States are Algeria, Botswana, Burundi, Egypt, Eritrea, Gambia, Kenya, Lesotho, Libya, Mauritius, Morocco, Rwanda, Seychelles, Tanzania, Tunisia and Zimbabwe.", "United States", "91 percent *", "Algeria", "95 percent", "Botswana", "94 percent", "Burundi", "98 percent", "Egypt", "96 percent", "Eritrea", "96 percent", "Gambia", "96 percent", "Kenya", "93 percent", "Lesotho", "92 percent", "Libya", "98 percent", "Mauritius", "99 percent", "Morocco", "99 percent", "Rwanda", "97 percent", "Seychelles", "97 percent", "Tanzania", "99 percent", "Tunisia", "94 percent", "Zimbabwe", "93 percent", "Of course, many African countries facing steep impoverished conditions have lower and substantially lower rates, such as Central African Republic (25 percent), Chad (59 percent), Equatorial Guinea (42 percent), Ethiopia (62 percent), Nigeria (59 percent), South Sudan (30 percent) and South Africa (66 percent).", "More broadly, it’s not just African countries beating the United States. Latin American countries with rates about the same as or exceeding the United States’ include El Salvador, Guatemala, Honduras and Mexico.", "South Africa-based think tank Good Governance Africa spurred news about the United States trailing some African countries in a Feb. 5 press release highlighting the WHO data. Researcher Kate van Niekerk hailed the improved availability and widespread usage of the vaccine as a \"major public health success\" that has reduced child deaths even though the disease continues to kill about 400 children every day.", "Still, Dr. Cathy Troisi, infectious disease epidemiologist at the University of Texas Health Science Center at Houston School of Public Health, said the nearly universal use of the measles vaccine in some parts of Africa is the result of a large international effort to reduce child mortality. Reducing by two-thirds the under-five mortality rate between 1990 and 2015 was one target of the United Nations millenium goals.", "Unlike in some regions of Africa, where measles remains a leading cause of child death, some American parents are strangers to scary, eradicated diseases that afflicted prior generations, she said. Americans also generally value individual rights over community needs, she added.", "\"I’m old enough that I was born before the polio vaccine became available,\" Troisi said, \"and you can bet when it came out, my mom was first in line to get me vaccinated. Part of the reason we’re seeing this refusal is because parents haven’t seen what these diseases can do.\"", "Because we were curious, we wondered how the U.S. vaccination rate stacked up against its more populous companions. The U.S. population is about 319 million, making it the third-most populated country.", "China, with 1.36 billion people, is at 99 percent. India, with 1.24 billion people, has a rate of 74 percent. Indonesia, at 253 million residents, had a rate of 84 percent. Brazil and its population of more than 200 million residents had a measles vaccination rate of 99 percent.", "Our ruling", "Kay said, \"There are countries in Africa where they have higher vaccination rates than here in the United States.\"", "We found ample evidence to back up her point, with several African countries boasting better vaccination rates than the United States. Mauritius, Tanzania and Morocco have nearly complete vaccination of 1-year-olds, according to World Health Organization data.", "We rate her claim True.", "Good Governance Africa press release, \"Africa overtaking America in the race against measles,\" Feb. 5, 2015", "PunditFact, \"Rush Limbaugh blames measles outbreak on immigrant children,\" Feb. 5, 2015", "World Bank, Immunizations - Measles", "World Health Organization, Measles - country data", "Interview with Cathy Troisi, infectious disease epidemiologist at the University of Texas Health Science Center at Houston School of Public Health, Feb. 8, 2015", "The Washington Post, \"Map: 113 countries have higher measles immunization rates than the U.S. for 1-year-olds,\" Feb. 3, 2015", "NPR, \"Measles vaccination rates: Tanzania does better than U.S.,\" Feb. 6, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]