["The image was posted on the Mardan News Facebook page, which has more than 300,000 followers, on January 30, 2019.", "The image shows two similar-looking medicine bottles. The prices listed at the bottom of the bottles have been circled.", "The price listed on the left bottle is 305.28 Pakistan Rupees ($2:20 USD) and the price on the right bottle is 170.00 Pakistan Rupees.", "The translated caption of the post says: “Keep medicine out of reach of the poor” with three crying face emoji. The Urdu-language hashtag underneath translates as: “#nayapakistan”.", "“Naya Pakistan” is the slogan of Pakistan Tehreek-e-Insaf, Pakistan's current ruling party, which came to power in national elections in July, 2018.", "The country’s new Prime Minister Imran Khan was sworn in on August 18, 2018. Here is his party’s official announcement on Twitter of the handover of power.", "In the misleading post's photograph, the manufacturing date of the bottle on the left is 08/18 or August 2018 and the bottle on the right is 02/18 or February 2018.", "A cost increase from 170.00 Pakistan Rupees to 305.28 Pakistan Rupees would represent a price hike of 79.6 percent.", "The misleading Facebook post has been shared nearly 800 times since it was published January 30, 2018.", "AFP found and photographed Cefaclor medicine bottles on sale in pharmacies in Islamabad in January 2019.", "After examining the products, AFP found that there are two different amounts of Cefaclor on sale in very similar bottles.", "One bottle contains 250mg and one contains 125mg of Cefaclor.", "The bottle containing 250mg Cefaclor costs 305.28 Pakistan Rupees, while the one which contains 125mg Cefaclor is priced at 175.19 Pakistan Rupees, according to the packaging of the bottles examined by AFP.", "The manufacturing date on both bottles checked by AFP was 11/18.", "Below is a comparison of the two bottles. AFP has circled the price information and manufacturing date:", "According to AFP’s calculations, the price of the small 125mg bottle of Cefaclor has increased three percent -- from 170 Pakistan Rupees for the bottle manufactured in February 2018 to 175.19 Pakistan Rupees for the bottle manufactured in November 2018.", "According to a press release on January 11, 2019 by Pakistan’s Drug Regulatory Authority, medicine prices have risen slightly over the last year but not due to the change of government.", "“According to spokesman of Drug Regulatory Authority of Pakistan prices of different medicines has been increased by 9 to 15 percent. This price increase in medicine was inevitable due to different reasons,” the press release says.", "The press release says that the depreciation of the Pakistani Rupee against the US dollar had raised the cost of raw materials.", "“Similarly there have been additional burden on pharmaceutical industry due to price increase in utility prices (which include gas and electricity). Moreover, additional duties have also increased. There have been increases in salaries of employees. Most of Pakistan's pharmaceuticals are imported from China. Due to closure of more than half of industry in China due to environmental reasons, raw material prices have increased two-fold,” the press release said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]