["Kerala assembly elections are scheduled to be held from April 6, 2021. Congress leader Salman Nizami tweeted a Hindustan Times article on March 4 which said that the BJP’s candidate has promised good quality beef to voters if elected.", "BJP candidate in Kerala promises clean, good quality beef to voters. Hypocrisy thy name is BJP. Bhakt log bajav tali 👏🏻 https://t.co/27qb9qUWub", "— Salman Nizami (@SalmanNizami_) March 4, 2021", "Congress national media panellist Szarita Laitphlang also shared the article.", "Wah re wah….. Gau Mata ki Jai Aap karo toh prachaar Hum karein toh atyachar", "Look at the hypocrisy of @BJP4India & the filthy game they play it’s called #BeefPolitics. Earlier during #Meghalaya elections @BJP4India reduced the price of beef. https://t.co/d0tfKNsPF1", "— Szarita Laitphlang (ज़रिता लैतफलांग) زریتا لیتفلانگ (@szarita) March 4, 2021", "Furthermore, a 22-second video of India TV has been circulated on Facebook and Twitter with the same claim. Twitter Handel ‘@nadera_anjum’ tweeted the India TV video and wrote, “Anything for the chair… BJP’s promise in Kerala is – give us vote, we will arrange good beef”. The video was viewed more than 12,000 times as of this writing.", "कुर्सी के लिए कुछ भी… केरल मे भाजपा का वादा हमें वोट दो हम अच्छे बीफ का इंतजाम करेंगे pic.twitter.com/AH91KoZXPR", "— ❤⃝🇳aⷶdͩeͤrͬaⷶ ❤⃝ 🇦nᷡjᷯuͧmͫ (@nadera_anjum) March 3, 2021", "The broadcast has also been shared with captions in English.", "BJP is full of Hypocrisy.. BJP Leader in KERALA announced to provide best BEEF to his Voters.", "BJP kisi ki sagi nhi#लाल_टोपी_वाला_गुंडा #ReleaseRanjitSingh pic.twitter.com/R3bpx8HwDy", "— ਭੋਲਾ ਲੰਕੇਸਪਤੀ(Rofl Lankesh) (@Aman01632) March 2, 2021", "Several users have shared screenshots of the India TV broadcast.", "गाये के नाम पर लोगों का कत्लेआम करने वालें आज इलेक्शन में बीफ का वादा दे रहे है केरला मे BJP का वादा हम सरकार मे आए तो अच्छा गौ मांस खीलाऐ गे भक्तो अब तो सुधर जाओ गाये के नाम पर लोगो को मारने वाले गाये सिर्फ वोट बैंक के लिए इस्तमाल कराती है अब केरल में गाये माता नहीं है,, 🤷 pic.twitter.com/fHBrd2XBln", "— 🌹Rayaan🌹 (@Rayaan41) March 2, 2021", "Congress leaders shared a four-year-old report by Hindustan Times. It was published on April 30, 2017. “A BJP candidate for the by-election to Kerala’s Muslim-dominated Malappuram parliamentary constituency has promised quality beef for the people if they elect him. Sreeprakash’s poll pledge counterbalances a growing effort in BJP-ruled states to enforce a ban on eating beef and slaughter of cows, considered sacred in Hinduism,” read the report.", "The India TV broadcast is also from 2017. The part currently viral is aired at the beginning of the broadcast. According to the channel, BJP candidate N Sriprakash in Kerala had promised to supply good beef to people after victory. The report said that on the one hand, BJP is making stringent laws to ban beef, while in Kerala BJP candidates are promising quality beef supply. Screenshots of this broadcast have also been recently revived.", "According to NDTV, N Sreeprakash, BJP candidate for Mallapuram by-poll, said, “Within limits of law I will ensure clean slaughterhouses and ensure beef,” when asked about beef ban and closure of slaughterhouses in UP and other states. “Do Muslim brothers eat non-halal meat? They don’t eat…I will make sure halal meat is served. I will make sure that abattoirs are good, hygienic and serve halal meat,” he told reporters.", "BJP candidate’s promise of good quality beef during 2017 Kerala byelections has been recently circulated and linked with the upcoming assembly polls in the state.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]