["About this rating", "Biden's Press Secretary Jen Psaki said someone at the White House approached Major, the family's youngest dog, on March 8, 2021, and the dog \"reacted in a way that resulted in a minor injury.\" Additionally, it is true that as of this writing, both dogs are staying at the family's home in Delaware, not Washington, D.C.", "However, Psaki said the dogs' trip to Delaware was scheduled before the above-referenced outburst by Major, that it was a result of Jill Biden's work schedule, not the dogs' behavior, and that they would be returning to the White House.", "It is unclear in what way, precisely, Major injured someone — whether by biting, scratching, or some other action — based on the press secretary's account. Also, the victim's relationship to, or status within, the White House remains unknown.", "In March 2021, reports surfaced claiming U.S. President Joe Biden and first lady Jill Biden's two German shepherds, Major and Champ, were no longer living at the presidential mansion and instead staying at the family's home in the Wilmington suburbs because one of the dogs supposedly bit a White House security officer.", "The rumor stemmed from two anonymous sources who claimed to have firsthand experience of the dogs' demeanor at the White House and spoke to CNN for a news story that published March 8. The article alleged:", "Major, who was adopted by Biden in November 2018 from a Delaware animal shelter, had what one of the people described as a 'biting incident' with a member of White House security. The exact condition of the victim is unknown, however, the episode was serious enough that the dogs were subsequently moved to Wilmington, Delaware, where they remain. [...]", "Major, who is 3 years old, is the younger of the two Biden dogs, and has been known to display agitated behavior on multiple occasions, including jumping, barking, and 'charging' at staff and security.", "Over the course of hours, other reputable news outlets, including The Guardian and Business Insider, recirculated CNN's reporting based on unnamed sources. It was unclear why or under what circumstances no one spoke on the record about the dog's alleged behavior and trip.", "Social media lit up. Interpreted by Twitter users as proof of the alleged ordeal, a  photo by a Bloomberg reporter showed a dog bed resting outside the White House. No evidence existed to doubt the authenticity of the image, though it was unclear if, or to what extent, it was related to the purported aggression.", "During an afternoon news conference on March 9, however, White House Press Secretary Jen Psaki provided some clarity on the matter.", "She said Major indeed behaved \"in a way that resulted in a minor injury\" to someone the previous day, and White House medical staff treated the person's wounds. Here was her quote, according to C-SPAN video:", "Champ and Major, the president and first lady's dogs, members of the family, are still getting acclimated and accustomed to their new surroundings and new people. And on Monday, the first family's younger dog, Major, was surprised by an unfamiliar person and reacted in a way that resulted in a minor injury to the individual, which was handled by the White House medical unit with no further treatment needed.", "In other words, the White House did not explicitly confirm CNN's reporting that Major bit someone (as opposed to scratching or tripping them), or that the victim supposedly held the job of White House security officer.", "Additionally, Psaki said the dogs indeed traveled to Delaware this week, though she made it seem like the trip was unrelated to the above-described incident that injured someone. Rather, she claimed, prior to Major's outburst, the Bidens were planning to drop off the dogs in Delaware temporarily so the politicians could travel and work.", "\"It had been previously planned already for the dogs to be cared for by family and friends in Delaware during Dr. Biden's travels to military bases this week -- she has a three-day trip this week -- and the dogs will return to the White House soon,\" Psaki said.", "A Twitter account dedicated to the whereabouts of \"The First Dogs of the United States\" posted:", "Snopes reached out to the White House for a more detailed explanation of what happened between Major and the stranger on March 8, as well as for a specific date for when the dogs would return to the White House. We have not received a response, but we will update this report when, or if, we do.", "Here's the dogs' backstory: Major was dropped off at the Delaware Humane Association (DHA) as a puppy after the rescue organization said something “toxic” in his previous home put his health in danger.", "While walking with the dogs on Valentine's Day, the president told reporters the family decided to adopt the young dog (the first White House shelter dog) so their older German shepherd — 13-year-old Champ — would have a companion and remain active in his senior years, according to a C-SPAN recording of the exchange.  \"They're buddies,\" Joe Biden said.", "Furthermore, one person told CNN for the March 2021 report, titled \"Biden's German Shepherd has aggressive incident and is sent back to Delaware,\" that the two dogs like to remain together, which would explain why they traveled as a pair.", "The bite rumor was not the first to broadcast the famous dogs' antics, whether alleged or confirmed.", "The previous fall, for example, Biden suffered a hairline fracture in his right foot while playing with Major, requiring him to temporarily wear an orthopedic boot. Then, in the days before Joe Biden's inauguration, the DHA celebrated Major’s ascension in American politics with a virtual “Indoguration” party and fundraiser.", "Weeks later, in February, Jill Biden said in an interview for \"The Kelly Clarkson Show\" that she was obsessed with making sure the dogs felt settled in their new home.", "\"They have to take the elevator, they're not used to that, and they have to go out on the South Lawn with lots of people watching them,\" the first lady said. \"So that's what I've been obsessed with, getting everybody settled and calm.\"", "In sum, while a Biden official said one of the family's dogs injured someone at the White House on March 8, no evidence besides the CNN report citing anonymous sources confirmed the injury was a result of a bite. Additionally, the official claimed the dogs' trip to Delaware was a result of Jill Biden's work schedule -- not a consequence of the dogs' actions.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]