["About this rating", "With more and more states in the U.S. legalizing the use of marijuana, it was only a matter of time before a cannabis-based cartoon character was introduced on a children's show. At least that's the conceit of a viral piece from the satirical website Babylon Bee.", "On 9 August 2018, the site published an article about the upcoming debut of a character named \"Cannabis Carl\" on the animated children's show VeggieTales:", "VeggieTales creators are celebrating the legalization of recreational cannabis use with a new character, Cannabis Carl. The character is a sign of the progress the United States has made on its views on the controversial plant. “Kids are ready for this,” said Dreamworks executive Brian Jones, who is overseeing production on the current series.", "“Mike and I have had this character in our back pockets since college,” Phil Vischer said at a press conference. “America wasn’t ready for Cannabis Carl then, but they’ve finally come around.” Mike Nawrocki, the voice of Larry the Cucumber also commented with a long, drawn-out, high-pitched giggle. His eyes appeared red.", "An image purportedly showing Cannabis Carl with the rest of the VeggieTales characters was also shared by the satirical web site. This picture was a digital fabrication created by taking a genuine image featuring various characters from VeggieTales (left) and adding in a cannabis cartoon character (right):", "The  Babylon Bee is a satirical web site whose disclaimer states that \"The Babylon Bee Is Your Trusted Source for Christian News Satire.\"", "The Babylon Bee.   \"Thanks to New Laws, VeggieTales Finally Introduces New Cannabis Character.\"\r\n    9 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]