["About this rating", "U.S. winners at the Olympic Games are required to pay taxes on their prize money and medals.", "All such winners are obligated to pay thousands of dollars in taxes.", "One aspect of the Olympic Games many U.S. viewers remain unaware of is the fact that U.S. medalists (like those from many other countries) receive cash prizes along with their medals: $25,000 for gold, $15,000 for silver, and $10,000 for bronze. These rewards are not paid by the International Olympic Committee (which furnishes the medals), but by the U.S. Olympic Committee. Similarly, participants from some other countries receive monetary prizes put up by their home countries' Olympic committees.", "Forbes reported on the issue of medal bonuses in July 2012, noting that:", "The biggest medal bonus is offered by Italy, which will pay more than $182,000 for a gold medal. Russia’s medal rewards are also quite rich, and the nation’s gold medal winners will collect $135,000. Even Russian bronze medalists will take home $54,400, more than double the payout for American gold. Neighboring Ukraine has been considering an increase to its already rich payout scale: $100,000 for gold, $75,000 for silver and $50,000 for bronze.", "Even Ghana promised its gold medal winners a payout of $20,000, not far behind the American reward.", "Perhaps surprisingly, the worst medal bonus is paid by Great Britain. Or rather, not paid. The host nation does not pay a performance bonus to medal-winning athletes.", "In July 2012, a blog post alerted many American readers to these prize winnings, noting that the monies earned by Olympic athletes (along with the value of their medals) were considered taxable income and could require gold medal winners to shell out up to $9,000 to the IRS.", "While it is true that prize winnings (including cash awards obtained through the attainment of Olympic medals) are considered taxable income in the U.S., it's unlikely any U.S. gold medal winner would incur a tax liability of anything close $9,000 per gold medal. For starters, that estimation was based upon the assumption that the winner would be paying a 35% tax rate, which (in 2012) only applied to persons earning more than $388,350 per year.", "While some athletes may end up realizing incomes that put them into the higher tax brackets through endorsement deals or participation in professional versions of their sports, many athletes earn their medals in lower-profile events that don't afford them such lucrative money-making opportunities. Additionally, many athletes could probably write off their Olympic prize winnings against the cost of their training and other related expenses, to the point that their tax liability for those winnings would be significantly lowered (if not completely eliminated).", "That $9,000 figure was also based on the assumption that medal-winning athletes would be paying taxes on the monetary value of the medals themselves (based on the types and amounts of metal the medals contain), which as CBS News calculated ranged from about $5 to $644:", "The gold medal consists of just over 1 percent actual gold. The rest is made up of 92.5 percent silver and 6.16 percent copper — and is only worth about $644.", "The silver medal is a modification of the gold medal. The gold is replaced with more copper, making the medal worth around $330.", "The bronze medal is made of 97 percent copper, 2.5 percent zinc and 0.5 percent tin — and is only worth about $4.70.", "The question of whether the value of Olympic medals is a form of taxable income in the U.S. is still somewhat open. The Financial Post tackled the issue of whether Canadian athletes were responsible for paying taxes on their winnings from the 2010 Winter Olympics, stating that:", "As for an Olympics prize, the CRA [Canada Revenue Agency] responded that although winning an Olympic medal may be an internationally recognized achievement and could \"indirectly promote a sense of nationalism,\" the prize is not awarded in recognition of public service and therefore cannot be considered a prescribed prize that would be tax exempt.", "This is consistent with the tax treatment of Olympic prizes in the United States. There is even some precedent in the U.S. for taxing the actual value of the medal itself.", "The U.S. case involved legendary shortstop Maury Wills, who played for the L.A. Dodgers. In January 1963, Wills received the S. Rae Hickok belt, awarded annually to the outstanding professional athlete of the prior year.", "The value of the alligator-skin belt with a solid gold buckle and an encrusted four-carat diamond, worth more than $6,000 at the time, was found to be fully taxable. The judge, concluding that this was an inequitable result, predicted that absent a change in the U.S. tax law, \"the next step would be for the Internal Revenue Service to tax the gold and silver in the medals awarded to Olympic Games' winners.\"", "Even if the IRS did consider the value of Olympic medals to be a form of taxable income in the U.S., it's probably unlikely that agency would come after any athletes who didn't declare that income on their returns, as Reuters observed in an article on that topic:", "Even the medals themselves could be seen as something of value, a gift of a commodity metal, and therefore taxable by the U.S. government, says [Alex Knight, a tax partner at Atlanta’s Habif, Arogeti & Wynne]. Still, Knight doesn’t expect to see the IRS chasing after athletes for a slice of their gold. \"I have to imagine that would be a public relations nightmare,\" says Knight.", "Over the years, members of Congress have offered various proposals to exempt U.S. Olympic medalists from being required to pay taxes on their winnings, without success so far.  But they're still trying, and on 12 July 2016 the U.S. Senate passed a bill (SB 2650) sponsored by Senator John Thune of South Dakota titled \"United States Appreciation for Olympians and Paralympians Act\" that seeks to exclude as taxable income prize money and medals won through competition in the Olympic Games or Paralympic Games:", "Gross income shall not include the value of any medal awarded in, or any prize money received from the United States Olympic Committee on account of, competition in the Olympic Games or Paralympic Games.", "This bill still has to be passed by the U.S. House of Representatives and signed by the President before becoming law.", "Bell, Kay.   \"Senate OKs Tax Break for Olympic Medalists.\"\r\n    Bankrate.   2 August 2016.", "Byrnes, Nanette.   \"Olympic Medals: Gold to the IRS Too?\"\r\n    Reuters.   30 July 2012.", "Camia, Catalina.   \"Sen. Rubio Tries to Lift Tax on Olympic Medals.\"\r\n    USA Today.   1 August 2012.", "Golombek, Jamie.   \"Taxman Will Take Share of Olympic Prize Money.\"\r\n    National Post.   19 February 2010.", "Smith, Chris.   \"London Olympics' Unpaid Athletes Fight for Rich Medal Bonuses.\"\r\n    Forbes.   31 July 2012.", "CBSNews.com.   \"How Much Are Olympic Medals Actually Worth?\"\r\n    1 August 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]