["In the open race for U.S. Senate in Tennessee, Republican candidate Rep. Marsha Blackburn has repeatedly tied Democrat Phil Bredesen, former Tennessee governor, to loose immigration policies.", "A recent Blackburn campaign ad told voters that Bredesen \"won’t stop illegal immigration, because he lured it.\"", "The ad flashes black and white images of Bredesen’s face against a backdrop of a highway packed with cars.", "\"It was Phil Bredesen who, quote, lured illegal immigrants to Tennessee,\" a man’s voice says in the Oct. 11 ad. \"Bredesen lured illegal immigrants hundreds of miles by offering them driver certificates.", "\"Now, Bredesen opposes President Trump’s immigration ban. And Bredesen admits, ‘I don’t believe the wall is the right answer.’", "\"Phil Bredesen. He won’t stop illegal immigration, because he lured it.\"", "The voiceover closes with shadowy images of young men ascending a ladder or a wall, presumably an illegal border crossing.", "We took a closer look at whether Bredesen \"lured illegal immigrants to Tennessee.\"", "• Between 2001 and 2006, Tennessee went from giving immigrants in the country illegally full driver's licenses, to giving them driver's certificates, to giving them nothing.", "•  Under a 2004 law, illegal immigrants came from as far away as New Jersey to get certificates — before returning to their home states.", "•  In the face of abuses, Bredesen ended the certificate program in 2006.", "The arc of the state's laws on driving privileges for the undocumented goes from granting them regular driver's licenses to granting them nothing. Blackburn's issue with Bredesen deals with a policy adjustment in the middle.", "In 2001, Tennessee passed a law that allowed a person without a Social Security number to get a typical driver’s license. The bill had support from most Democratic lawmakers and a bit under half of the Republican ones. Republican Gov. Don Sundquist signed it. Blackburn was a state senator and voted against it.", "Bredesen took office in 2003. In 2004, in the middle of a growing demand for tighter identification standards in the wake of the 9-11 terrorist attacks, Bredesen proposed creating a driver’s certificate. Anyone without a Social Security number who met the ordinary requirements for a license, such as passing a driver's test and proof of Tennessee residence, could get one.", "It was billed as a compromise between traffic safety and national security needs.", "\"Its purpose is to make sure people understand the law and the rules of the road,\" said Melissa McDonald, the spokeswoman for the Department of Safety in a 2005 New York Times article. \"You can't buy beer with it. You shouldn't be able to board a plane with it.\"", "The driver’s certificate card bore the words, \"For driving purposes only — not valid for identification.\" Unlike a regular driver’s license, a certificate expired after one year.", "The 2004 bill passed muster overwhelmingly with both Republicans and Democrats. The vote in the state Senate was 32-0, including 15 Republican senators, and in the House, with 45 Republicans, the vote was 96-2. (By then, Blackburn was in the U.S. Congress.)", "The law took effect in June 2004. By October, people began gaming the system.", "In one case, according to court papers, a woman in Tennessee \"transported illegal aliens from New Jersey to Tennessee in order to procure certificates for driving.\"", "She provided them with \"hotel rooms while in Tennessee, and documents purporting to show that the aliens had addresses in the state.\" The judge in the case wrote that the aliens said \"they wanted the licenses so that they could drive to their jobs in New Jersey.\"", "Where the immigrants went after they had their certificates has some bearing here. Watching Blackburn’s ad, you might think that the program attracted them to Tennessee to live. That doesn’t seem to be what happened.", "Attorney Mike Whalen represented the women who brought in immigrants from New Jersey.", "\"To the best of my understanding, none of these folks stayed in Tennessee,\" Whalen said. \"I speak Spanish, so I represent lots of folks who are undocumented. Never saw it.\"", "A larger scam operated out of a private driving school in Winchester, Tenn. Investigators discovered a scheme where people at the driving school bribed state workers to provide both licenses and certificates for undocumented immigrants. Officials said hundreds of illegal immigrants were directed to the school.", "The word \"lure\" comes from an Associated Press headline about the investigation.", "As federal and state law enforcement began arresting and charging people in late 2005 and early 2006, Bredesen shut down the certificate program.", "\"It’s clear from talks with law enforcement authorities that there are issues with this program that need to be addressed,\" Bredesen said in March 2006. \"The only responsible course of action is to suspend the program while we determine the next steps.\"", "Stephen Fotopulos was policy director with the Tennessee Immigrant and Refugee Rights Coalition in 2006. Fotopulos said his advocacy group tried to preserve the program by making it more rigorous.", "\"For months we worked with Department of Safety to change the process of getting a driver's certificate to make sure that only people in Tennessee would get it,\" Fotopulos told us.", "But in 2007, the Legislature passed and Bredesen signed the full termination of the program. With about 10 Democrats dissenting, the measure passed by wide majorities in both the House and Senate.", "Blackburn said that Bredesen \"lured illegal immigrants to Tennessee\" by offering a driver’s certificate for the undocumented. The one accurate part of the claim is that people came from out of state and fraudulently applied for both certificates and full driver's licenses.", "After that, the claim begins to break down.", "Bredesen swapped a more lenient licensing law signed by his Republican predecessor for a less useful certificate that could not serve as official identification and lasted for only a year.", "To pin the law to Bredesen ignores that nearly every Republican lawmaker approved that change.", "When problems surfaced, Bredesen preempted the Legislature and ended the program by executive action. The next year, Republicans and most Democrats voted to affirm that move.", "Lastly, the ad strongly implies that Bredesent sought to have illegal immigrants stay in Tennessee. There is no evidence for that.", "We rate this claim Mostly False.", "Marsha Blackburn, Luring, Oct. 11, 2018", "Tennessee General Assembly, HB 0983 Authorizes person without social security number to receive driver license, May 15, 2001", "Tennessee General Assembly, SB 3430 Establishing certificate of driving, June 4, 2004", "Book of the States, State legislatures 2000, 2000", "University of Tennessee County Technical Assistance Service, Certificate for driving, May 28, 2004", "University of Tennessee County Technical Assistance Service, Issuance of Driver Licenses, May 21, 2007", "United States Court of Appeals for the 6th Circuit, United States of America v. Zeneida Rivera, Feb. 20, 2008", "Los Angeles Times, Tennessee Ends Cards for Immigrant Drivers, Feb. 25, 2006", "New York Times, Immigrants in Tennessee Issued Certificates to Drive, May 9, 2005", "Los Angeles Times, Tennessee limits who is eligible for a driver's license, July 29, 2004", "Herald Newspapers, Safety officials uncover corruption, Jan. 31, 2006", "Associated Press, Tennessee's driver certificates lure illegal immigrants from other states, Jan. 29, 2006", "Herald Newspapers, Tenn. halts driving permits to illegal immigrants, March 1, 2006", "Tennessean, Six indicted in driver's license fraud, Jan. 26, 2006", "Johnson City Press, Bredesen campaign fires back at Blackburn over 'driver licenses to illegal aliens' claim, May 12, 2018", "Email interview, Mike Whalen, attorney, Oct 24, 2018", "Interview, Stephen Fotopulos, former executive director, Tennessee Immigrant and Refugee Rights Coalition, Oct. 24, 2018", "Email interview, Alyssa Hansen, spokeswoman, Bredesen for Senate, Oct. 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]