["About this rating", "Known as a famous Hollywood actor and one of the original men to portray the iconic character James Bond, Sean Connery died on Oct. 31, 2020. According to TMZ, he died at 1:30 a.m. \"at his home in the Bahamas.\"", "Sean Connery died in his sleep from pneumonia, heart failure and old age ... according to his death certificate.", "TMZ obtained Connery's death cert and it shows he died from respiratory failure as a result of pneumonia, old age and atrial fibrillation ... an irregular heart rate that can increase the risk of strokes, heart failure and other heart-related complications.", "Entertainment Tonight made contact with the family, reporting that \"Connery's wife, Micheline Roquebrune, and his two sons, Jason and Stephane, told ET that he died peacefully in his sleep, surrounded by family.\"", "Following his death, at least one advertiser bought ad space on the social media platform Reddit, or on a mobile app that displays Reddit content. The ad read: \"sean connery's Net Worth Left His Family In Tears.\" Connery's name was lowercase, likely because the \"Net Worth Left His Family In Tears\" part is a template.", "It's not true. It's fabricated and completely baseless. Sean Connery's family was not left \"in tears\" because of his net worth. We previously reported on the \"net worth left his family in tears\" advertising ploy with \"Jeopardy\" host Alex Trebek. The late Kenny Rogers also appeared to be a victim of the ploy.", "The advertisement in question appeared to lead to Life Exact, a viral content website. It was first documented by Reddit user JezCon. It's unclear if the advertisement is still active on the website. We were unable to locate the ad, but it likely lead to a slideshow with multiple pages, where the idea was to make more money on the advertisements displayed during the slideshow than it cost to run the original ad alongside Reddit content. This is known as advertising \"arbitrage.\"", "Business and technology blog Margins is managed by Ranjan Roy and Can Duruk, and Roy defined \"arbitrage\" as \"leveraging an inefficient set of systems to make a riskless profit, usually by buying and selling the same asset.\" He also called it \"the mythical free lunch that economics tells us does not exist.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]