["About this rating", "In early March 2018, stories about disgraced Democratic California state senator Leland Yee began circulating on social media —even though Lee was arrested in 2014 and sentenced for arms trafficking in 2016.", "For example, the web site MinutemanMilitia.com aggregated a 2016 story by the Washington Post about Yee's sentencing:", "Yee also discussed buying weapons overseas and bringing them to the U.S. with two associates and an undercover agent. He accepted $6,800 and a list of arms for purchase in the Philippines.", "The maneuvers were not only illegal, but also in stark contrast to what he had long purported to stand for.", "Yee told CBS two years before he was arrested: “It is extremely important that individuals in the state of California do not own assault weapons. I mean that is just so crystal clear — there is no debate, no discussion.”", "It is true (and was widely reported) that Yee was arrested in 2014, pleaded guilty in 2015, and was sentenced to five years in prison on arms trafficking charges in 2016. Just weeks before the story made the rounds again, a gunman opened fire on teachers and students at Marjory Stoneman Douglas High School in Parkland, Florida in a massacre that took seventeen lives.", "Many of the students who survived have become vocal advocates for stricter gun laws that allowed the 19-year-old attacker to purchase the AR-15 he used in the massacre. The students and their families have criticized Republican lawmakers and the National Rifle Association, a nonprofit pro-Second Amendment lobbying organization.", "The reappearance of the article in 2018 appears to be an attempt to recast the story to paint those calling for stepped-up gun control as dissemblers:", "Looks like another hypocrite caught up in their own drama. Guess guns are bad for everyone unless he is making the money", "Wang, Yanan.    \"Ex-Calif. State Sen. Leland Yee, Gun Control Champion, Heading to Prison for Weapons Trafficking.\"\r\n      The Washington Post.    25 February 2016.", "Shesgreen, Deirdre.    \"Congressional Republicans Reject Calls for Tighter Gun Restrictions in Wake of Florida Shooting.\"\r\n      USA Today.    27 February 2018.", "CNN.    \"Transcript: Stoneman Students' Questions to Lawmakers and the NRA at the CNN Town Hall.\"\r\n      22 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]