["About this rating", "Wendy's added self-serve kiosks at around thirty restaurants in 2016.", "It was not due to a minimum wage hike.", "On 20 July 2017, a meme featuring a photograph of self-serve kiosks at a Wendy's restaurant was posted to the Facebook page of Turning Point USA, a conservative nonprofit group, along with a claim that the kiosks were the direct result of an increase to the minimum wage:", "A number of cities, like Seattle, San Francisco, and Los Angeles, as well as a some states, such as New York and California, have passed laws that will gradually raise the minimum wage to $15 an hour. For most of these locations, the minimum wage won't hit $15 for several years from the time that they were passed (2022 for California, but 2020 for Los Angeles), which means that the increase has not yet had a significant impact on national restaurants such as Wendy's.", "It is true that Wendy's has started implementing self-serve kiosks at some of its locations. We talked to a representative for the fast food chain and were told that these kiosks could be found at around thirty (nowhere near 6,000) locations by the end of 2016:", "This is not accurate. The meme appears to be a parody.", "At the end of 2016, around 30 restaurants featured kiosks. It's still early in the roll-out, but we’ve been encouraged by throughput inefficiencies and the improvement of the overall customer experience through this technology.", "Although these kiosks could find their way into as many as 1,000 restaurants by the end of 2017, this is still a long way from the 6,000 claimed in the meme.", "We reached out to Turning Point USA to see where they got the numbers for this meme but have yet to receive a response. As there are currently a little over 6,500 Wendy's restaurants worldwide, it appears that this meme is based on the assumption that a minimum wage hike to $15 would prompt the restaurant to replace workers at nearly all of its facilities with machines. Although this is somewhat of a hypothetical prediction, and therefore difficult to fact-check, it is based on the false narrative that Wendy's is developing self-serve kiosks for the sole purpose of \"replacing\" minimum wage workers.", "A spokesperson for Wendy's told us that the intent of these kiosks is to \"shift\" human labor, not to eliminate it, and to improve the customer experience:", "The intent is to shift labor, not take it away. Kiosks give the customer more control over their experience, and allow team members to engage with the customer to ensure a seamless experience from the moment they walk in the door.", "When a similar rumor circulated in 2015 about Wendy's competitor McDonald's replacing workers with machines, we received a similar statement from that chain:", "Self-order kiosks are not designed to replace front-counter service. Front counters remain a focal point of service where we have installed self-order kiosks, and customers can decide whether they wish to place their order at the counter or through kiosks. Staff are on hand in the dining area to assist customers using the kiosks.", "In addition to spreading a misleading claim about the effects of a minimum wage hike, the meme also featured a photograph that doesn't even show self-serve kiosks at a Wendy's restaurant. It is an extremely cropped version of a photograph showing Wendy's in-house tech lab \"90º Labs” that was originally published by DigiDay in 27 May 2015 article about how Wendy's works to improve the customer's experience using technology:", "“In the last three to four years, a lot of brands have realized that they have to make the experience easier for customers,” said Brandon Rhoten, vp of digital experience for Wendy’s. “But this requires programmers, developers and UX designers, people that not only build but also iterate on and maintain technologies.”", "Wendy’s has been investing heavily in digital in the past few years. It rolled out mobile payment last year and has also been testing mobile ordering, beacon-based ordering, self-order kiosks, a loyalty program and even voice-ordering while customers are in their cars. The company projects spending $40 million on tech-related initiatives in 2015.", "Here's a comparison of the two images:", "Self-serve kiosks may help mitigate rising labor costs, but Wendy's said that it has not replaced workers with machines — nor does it have any plans to do so.", "Dignan, Larry.   \"Wendy's Cooks Up Digital Transformation Plans with Kiosks, Mobile Apps, Customer Experience Lab.\"\r\n    Zdnet.   7 July 2017.", "Davidson, Paul.   \"California Reaches Deal on $15 Minimum Wage.\"\r\n    USA Today.   18 March 2016.", "Scheiber, Noam.   \"How a Rising Minimum Wage Affects Jobs in Seattle.\"\r\n    New York Times.   26 June 2017.", "Scheiber, Noam.   \"How a Rising Minimum Wage Affects Jobs in Seattle.\"\r\n    New York Times.   26 June 2017.", "Rooney, Ben.   \"San Francisco Votes in $15 Minimum Wage.\"\r\n    CNN.   5 November 2014.", "Wattles, Jackie.   \"Los Angeles is Now Largest City in America with $15 Minimum Wage.\"\r\n    CNN.   14 June 2015.", "Dua, Tanya.   \"Inside Wendy’s In-House Tech Innovation Lab.\"\r\n    DigiDay.   27 May 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]