["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "David Pepper, the Democratic candidate for state auditor, has consistently characterized his Republican opponent Dave Yost as an out-of-control spender whose budget skyrocketed in his eight years as a county prosecutor.\n\nPepper says Yost, the Delaware County prosecutor and a Republican with some Tea Party support, increased his office’s spending by 150 percent. The claim also was made by the liberal group ProgressOhio in an online video posted in March.\n\n\"In 2009, Yost spent 2.5 times more money than it took to run the office before he got there,\" according to the ProgressOhio video.\n\nThe charge is based on a comparison between the Delaware County prosecutor's general fund budgets in 2002, the year before Yost was appointed prosecutor, and 2009. While the prosecutor’s office has access to other funds, such as an account stocked with a portion of the county’s delinquent tax collections, general fund spending is widely regarded as a barometer of an elected official’s fiscal restraint because it is typically used to pay for day-to-day operations.\n\nPepper, currently a Hamilton County commissioner, has been especially eager to point out Yost’s spending habits because they seem to defy his stance against bloated government spending. The ProgressOhio video shows Yost railing against the increasing cost of government at a 2009 Tea Party event in Columbus.\n\n\"I’m concerned about the way we are spending money in the state of Ohio,\" Yost said to the crowd.\n\nThe video juxtaposes Yost's speech against shots of budget documents from his office. They are the same documents the county provided us for Yost's general fund budgets. And records show the budget in fact was higher in 2009 than it was in 2002, his predecessor’s last full year in office.\n\nIn 2002, the office had a budget of $591,798, according to county records. In 2009, the budget was $1.54 million — 2.6 times the amount budged in 2002.\n\nThe county also keeps track of actual spending from the general fund. Spending totaled $577,887 in 2002 and $1.49 million last year. The 2009 figure for actual spending also is about 2.6 times the amount spent in 2002.\n\nBut Yost said those documents don’t tell the whole story, and offers these explanations.", "While the ProgressOhio video is correct that the amount of spending in the Delaware County prosecutor’s office jumped during Yost’s tenure, it leaves out the caveat that bookkeeping changes within the county finances helped explain part of those increases. Yost’s argument to mitigate the degree to which his budgets increased is well taken.", "We find ProgressOhio’s statement Mostly True.", "Comment on this item.", "ProgressOhio posting by Brian Rothenberg, \"Shadows on High: The Tea Party Litmus Tests: Coming to Haunt a Politician Near You,\" March 12, 2010\n\nInterviews with the Dave Yost campaign\n\nInterviews with the David Pepper campaign\n\nDelaware County budget records", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]