["NC Rep. Deb Butler", "One of the biggest political stories of the year in 2019 occurred on Sept. 11.", "Democratic Gov. Roy Cooper had vetoed the GOP-controlled legislature’s budget proposal. On most days, Republicans in the legislature have enough votes for a simple majority — but not the supermajority needed to override a veto.", "But on the morning of Sept. 11, many Democrats were absent. So House Speaker Tim Moore called a vote and the veto override passed.", "This is where Rep. Deb Butler comes in. The Wilmington Democrat gained recognition for trying to stop the vote, which she considered improper. (She famously yelled \"I will not yield\" and \"shame on you, Mr. Speaker\" while on the vote was happening.)", "Fast forward to January, when the legislature was scheduled to reconvene.", "In a Jan. 5 tweet, Butler said she’s calling on Senate leader Phil Berger \"who expressed disdain for the ambush vote in the House\" to negotiate with Cooper rather than try to override his veto.", "Berger, like Speaker Moore, is a Republican. It’s uncommon for the two Republican leaders to publicly criticize each other.", "So we wondered whether Butler was right. Did Berger \"express disdain\" for how Moore executed the veto override?", "Lack of evidence", "We asked Butler where she saw or heard Berger’s supposed disdain.", "\"I can’t remember exactly where I read it, but it was in the context of the Senate rules requiring 24 hours notice of a veto override vote and then he said something to the effect that, besides he didn’t like the approach used by the Speaker,\" Butler said. \"I’m sorry I can’t remember precisely where.\"", "We also reached out to Berger’s office and asked whether Berger holds disdain for how the House overrode Cooper’s veto, or whether he ever expressed negative feelings about how it happened.", "\"I'm not aware of him ever saying anything like that,\" Berger spokesman Pat Ryan said.", "PolitiFact and WRAL reporters could find no specific examples of Berger saying anything negative about the House budget override.", "A press conference", "The closest Berger came to criticizing Moore and the House was during an Oct. 1 press conference. Even then, he didn’t mention Moore specifically or say the House did anything wrong.", "WRAL recorded the press conference. Around the 2:30 mark of the video, Berger talked about his preference for finding a budget solution.", "\"I’d rather have a broad, bipartisan vote — just like you saw on redistricting — than a veto override that squeaks through,\" Berger said.", "Then, around the 3:40 mark of the video, Berger explains the logistics of how the Senate must conduct a veto override vote.", "\"Before I take your questions, I’ll answer what’s probably at least one of the questions, maybe the top question: Senate rules require 24 hours’ notice before calendaring a veto override. We will adhere to the rules,\" Berger said. \"I’ll be glad to take your questions.\"", "Berger also said he’d seize an opportunity to pass the budget. If could be argued that promise alone proves he didn’t show disdain for the House vote.", "To disdain something means to feel like it’s \"not good enough to deserve your respect or attention,\" according to the Oxford dictionary. Merriam-Webster says it means to treat something as \"beneath one’s notice or dignity.\"", "Our ruling", "Butler said Berger \"expressed disdain\" for how fellow Republicans in the NC House voted to override Cooper’s budget veto. She presented no evidence for her claim and PolitiFact could find no evidence of Berger making any overtly negative comments about the House vote.", "We rate her claim False.", "A tweet by NC Rep. Deb Butler.", "Email correspondence with NC Rep. Deb Butler.", "Email correspondence with Pat Ryan, spokesman for NC Senate leader Phil Berger.", "Story by WRAL, \"'How dare you do this, Mr. Speaker:' In surprise move, House overrides budget veto,\" posted Sept. 11, 2019.", "Video by WRAL, \"Senate leader discusses budget veto override,\" posted Oct. 1, 2019.", "Definition of \"disdain\" on Oxford Learner's Dictionary website.", "Definition of \"disdain\" on merriam-webster.com.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]