["The image was published here on Facebook on September 12, 2020.", "The post, which has been shared more than 1,100 times, shows a screenshot of a 7 News report. It is headlined: “Victoria records 37 new coronavirus cases on Sunday and 6 deaths”.", "The post reads: “BUT ITS NOT SUNDAY YET! It looks like CH7 has just posted TOMORROWS magical numbers a little to [sic] early already this morning. Whoops, today is only Saturday morning. \n\t\"That’s not a Typo \n\t\"That’s rather strange”.", "The same screenshot was also shared here, here, here, here, here and here on Facebook alongside a similar claim. The screenshot also appeared in Instagram posts here and here with a similar claim.", "The claim is false.", "Corrected report", "The original 7 News article was published here on Saturday, September 12. The headline reads: “Victoria records 37 new coronavirus cases on Saturday and 6 deaths”.", "A correction at the end of the article indicates that there was a typographical error in the article’s earlier headline: “Editorial note: A previous headline on this article stated these were Sunday’s cases. This was a typo and they are, in fact, Saturday’s.”", "Covid-19 cases in Victoria", "According to the Victorian Department of Health and Human Services (DHHS), there were 37 new cases of Covid-19 and six deaths in Victoria on Saturday, September 12, 2020, matching the detail in the amended 7 News article.", "In a Sunday, September 13, 2020 media release, the state of Victoria announced that it had recorded 41 new cases and seven deaths that day.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]