["A picture of a field packed with a massive crowd carrying flags of different colours has gone viral on social media. India’s national flag can also be seen raised by the crowd. This photo is being circulated with a Hindi caption that reads, “For 70 years we were teased by people waving the flag of Pakistan here. Yesterday, the Indian flag was waved in Karachi.” A number of online users shared the picture with the accompanying caption.", "Twitter user Jyoti Dwivedi posted the image and wrote, “#Arrest_Deepika_Rajawat”. Dwivedi describes herself as an RSS supporter, as seen in her Twitter bio. It is noteworthy that Deepika Rajawat was the lawyer defending the Kathua rape victim. She recently posted a satirical cartoon on Twitter which many found objectionable towards the Hindu community. People were so outraged that a mob gathered outside her home and chanted slogans. The hashtag posted by Dwivedi was also seen in other tweets that featured this photo. At the time of writing, it had received over 600 retweets. (archived link to the post)", "70 सालो तक हमे पाकिस्तान का झंडा लहरा कर चिढ़ाया जाता था । कल करांची की रैली में हिंदुस्तान के झंडे लहराये गए ।#Arrest_Deepika_Rajawat pic.twitter.com/aSXVdJeHfV", "— ज्योति द्विवेदी 🇮🇳 (@jyoti_dwived) October 20, 2020", "@sri9011, a Twitter user followed by Prime Minister Narendra Modi, also tweeted the viral image and wrote, “Tricolour being waved in protests against Pak Army in #Karachi.” (archived link)", "Apart from this, Twitter users @Shubhamrajbjym (archive link), @Real18ashutosh (archive link), @Ani_Chakravarty (archive link), @Zoya_nafidi (archive link) and @dixit_purva (archive link) also shared this picture. Their posts racked up a combined total of close to 1000 retweets. Apart from them, dozens of other Twitter users also circulated the photo and accompanying claim.", "This slideshow requires JavaScript.", "The image has since caused quite a frenzy on Facebook as well. A post about the viral image by a man named Vidyarthi Shivam was shared by more than 2000 people. (archived link) Another Facebook user named Awadh Bihari Verma posted the photo to a group called ‘Sudhir Chaudhary’, where it was shared by more than 450 people. Several others also shared the picture with the same caption.", "Alt News received requests to verify the image on our WhatsApp number (+917600011160).", "We performed a reverse image search and found a Facebook post by Pakistani political party Jamiat Ulama-e-Islam containing this exact picture. However, the Indian national flag was not visible in this one.", "پاکستان ڈیموکریٹک موومنٹ کراچی کے جلسہ عام کے مناظر ۔", "‎#MaulanaLeadsPDMInKhi", "Posted by Jamiat Ulama-e-Islam Pakistan on Sunday, 18 October 2020", "Based on this, we performed a keyword search ‘PDM Karachi rally”. This led us to an October 19 report by Pakistani news outlet Pakistan Today. The picture published in this article closely resembles the viral image. According to the report, the photo is from a rally by the Pakistan Democratic Movement (PDM), a coalition of 11 parties in Pakistan. This was meant to be a show of solidarity by the parties that were coming together against the government.", "Daily Times, another Pakistani media outlet, also published the same picture in its coverage of the rally.", "Below, Alt news has shown a side-by-side comparison of the viral image and the photo as it was seen in reports by the local media.", "However, a closer look at the picture shows that many flags in it resemble the Indian tricolour. But this is in fact the flag of Pakistani party PukhtoonKhwa Milli Awami Party (PMAP). It can also be seen on the party’s Facebook page.", "Indian social media users claimed that the Indian flag was waved in Karachi during a Pakistani Army protest rally. However, this is completely false. The Indian flag was edited into this image to replace the flags of a Pakistani political party.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]