["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida voters passed Amendment 4 in 2018 with the intention of restoring voting rights to most felons who served their time. But how it will work remains uncertain due to litigation, and a waiting list for felons who want to restore their rights the traditional route continues to swell.", "State Agriculture Commissioner Nikki Fried said officials don’t have to wait on the legal battle to make the process easier for felons. The four-person state Cabinet could make the changes through the clemency board, she said, referring to the body that already has the power to grant restoration of civil rights.", "Fried, the only Democrat on the Cabinet, asked her Republican colleagues on the board to adopt new rules for clemency. But that hasn’t happened, she said, and the result has been far fewer rights restored under Gov. Ron DeSantis’ administration than under previous governors Charlie Crist, Jeb Bush and Rick Scott.", "\"Under Governor Crist, over 155,000 Floridians had their rights restored,\" Fried said. \"Under Governor Bush, over 76,000. Even under Governor Scott, more than 3,000 of our fellow citizens earned back their right to participate in society.\"", "Fried then pivoted to lower numbers under the current Cabinet.", "\"But so far this year, under this clemency board, four have gotten their rights back,\" Fried told reporters at a pre-session gathering in Tallahassee. \"That is not a typo. Four. Four people.\"", "We hadn’t heard that number, so we decided to look into it. Verifying the number since she made the remarks on Oct. 29 required a public record request and weeks of dialogue with state officials.", "We found that Fried has a point that very few people have gotten their rights restored by the new clemency board in its first year. But there are ways to count restorations that add up to a little more than four.", "Fried joins three Republicans on the clemency board: Gov. DeSantis, Attorney General Ashley Moody and Chief Financial Officer Jimmy Patronis.", "The board reviews cases for eligible applicants at a public meeting about four times a year. The backlog of cases approached 11,000 as of Oct. 1.", "Amendment 4 was intended to largely get rid of this process for many felons seeking to only regain their right to vote. Amendment 4 restored the voting rights of Floridians with felony convictions after they complete their sentences. It does not apply to those convicted of murder or sexual offenses.", "The four Floridians Fried referenced were granted restoration of civil rights through the clemency board on Sept. 25, according to a video of the meeting. Each of the four  had their civil rights restored, but none were granted pardons. That means they were not forgiven by the state.", "That opens up another possibility, state officials told us: Other felons could have had their rights restored through pardons.", "Florida’s clemency rules state that a full pardon \"restores to an applicant all of the rights of citizenship possessed by the person before his or her conviction.\" In other words, a full pardon also restores civil rights including the right to vote.", "We submitted a public record request with the Florida Commission on Offender Review seeking records to show how many got pardons and their rights restored at the same time. The agency handles decisions related to clemency and parole.", "A review of the records showed 20 people have gotten their rights restored through the board so far this year. That includes the four who were granted clemency but did not get a pardon.", "Because Amendment 4 was supposed to become the main vehicle for felons to regain their voting rights (rather than the clemency board), the clemency board doesn’t appear to have taken up many cases since its passage.", "Meredith Beatrice, a spokeswoman for DeSantis, said that Amendment 4’s automatic restoration of voting rights has significant implications for the clemency process. The clemency board has prioritized requests for other forms of clemency during its meetings this year. DeSantis also said that Amendment 4 didn’t address other rights such as the right to serve on a jury or hold public office. He said he is considering restoring those rights for non-violent offenders.", "Litigation has created confusion about which felons can register.", "\"It’s anyone’s best guess how many individuals have registered who have a former felony conviction,\" University of Florida political scientist Daniel A. Smith said. \"The state is not tracking it, nor do I think there is any way for them to track it.\"", "Fried said that while previous clemency boards granted restoration of civil rights to thousands of Floridians, \"so far this year, under this clemency board, four (felons) have gotten their rights back.\"", "Fried was counting one group of people who got their rights restored without a pardon. And we confirmed four people had their rights restored by the clemency board in 2019. They sought pardons and did not get them.", "But we found an additional 16 people who did receive pardons and simultaneously had their rights restored.", "Fried’s overall point is correct: Very few people in Florida have had their rights restored by the clemency board this year, significantly lower than the thousands or tens of thousands under previous governors.", "We rate this statement Mostly True.", "Florida Commissioner of Agriculture and Consumer Services Nikki Fried, Letter about clemency rules, Sept. 27, 2019", "Florida Rules of Executive Clemency, 2011", "Florida Channel, Executive Clemency Board meeting, Sept. 25, 2019", "News Service of Florida, Nikki Fried seeks meeting on rules for restoring rights, Sept. 28, 2019", "News Service of Florida, Challenge to Florida’s clemency system could be moot, Sept. 30, 2019", "Tampa Bay Times, DeSantis: Expand rights of felons, Oct. 23, 2019", "Tampa Bay Times, After judge’s ‘spanking,’ lawmakers will tweak Amendment 4 bill next session, Oct. 17, 2019", "Sun Sentinel editorial, Florida's clemency system a big mess that needs immediate fixing, Oct. 16, 2019", "Vox, A controversial Florida law stops some former felons from voting. A judge just blocked part of it. Oct. 19, 2019", "Politico, Florida panel says bureaucracies should be reworked to verify ex-felon voting rights, Oct. 30, 2019", "Tampa Bay Times, Gov. DeSantis appeals judge’s order in Amendment 4 lawsuit, Nov. 15, 2019", "PolitiFact, More felons regained right to vote in Florida than population of many states, Nov. 8, 2018", "Email interview, Franco Ripple, Florida Commissioner of Agriculture and Consumer Services Nikki Fried spokesman, Oct. 30, 2019", "Email interview, Nancy Abudu, Deputy Legal Director for the Southern Poverty Law Center, Oct. 30, 2019", "Email interview, Daniel A Smith, University of Florida professor & chair department of political science, Nov. 4, 2019", "Email interview, Alec Yarger, Florida Commission on Offender Review legislative affairs, Oct. 31-Nov. 13, 2019", "Email interview, Meredith Beatrice, Gov. Ron DeSantis spokeswoman, Nov. 5, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]