["The video has been shared more than 67,000 times after being posted here to Facebook on July 31, 2019.", "The caption of the video states: “Happen at sengkang..please look after your kids”.", "Sengkang is a town in northeast Singapore.", "The clip shows a child hanging from the ledge of a balcony, prompting passersby to extend a large blanket underneath.", "The toddler eventually fell onto the blanket, as seen at the 57 second mark of the video.", "Below is a screenshot of the misleading Facebook post:", "The video has also been viewed thousands of times here and here on Facebook with a similar claim: “Due to the residence quick thinking, the kid is safe now. Negligence of the maid. Never hear the child's cry, was very bz on her phone…”", "But the incident did not take place in Singapore -- it happened in the Chinese city of Chongqing.", "AFP conducted a reverse image search on Google and found the same video published in several Chinese language news reports, such as here by Shanghai-based news website The Paper and here by British broadcaster BBC.", "Chinese state broadcaster CCTV included parts of the clip, as well as videos of the same incident shot from different angles and interviews of witnesses, in this July 31, 2019, YouTube video.", "The caption of the CCTV video reads: “A 3-year-old boy was saved by a group of people who used a blanket to break his fall from a 6th-floor apartment balcony in southwest China's Chongqing Municipality on Monday.”", "CCTV reported, as seen in the on-screen text, that the incident happened when the boy was left alone at home by his grandmother, who went out for grocery shopping.", "Chongqing Public Security shared parts of the video in this July 30, 2019 Weibo post, which says the incident occurred on July 29. Authorities said the child was uninjured.", "Below is a side-by-side comparison of screenshots from the video in the misleading post (L) and the CCTV video (R):", "A screenshot of the video was also included in this Chinese news report, which states the incident happened at a housing complex in Chongqing’s Jiulongpo District.", "The same building can be seen in photographs of the complex here on a property website and here on Chinese search engine Baidu.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]