["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama is one of the worst negotiators Donald Trump has ever seen, the real estate magnate and presidential candidate said.", "Take, for example, Obama’s controversial decision to exchange five Guantanamo detainees for Taliban prisoner Army Sgt. Bowe Bergdahl in May 2014, Trump said to NBC Meet The Press host Chuck Todd.", "\"You look at these deals,\" Trump said Jan. 10 in Ottumwa, Iowa. \"I always bring up Bergdahl. We get a traitor, they get five people that they've wanted for nine years, and they're back on the battlefield, trying to kill everybody, including us. And we get a dirty, rotten traitor.\"", "Trump’s statement that the five former detainees -- who were senior Taliban operatives -- are now \"back on the battlefield\" is one we rated False in July 2015. We decided to revisit the claim to see if anything had changed in the past six months.", "We looked into whether there were any new developments around the detainees, sometimes called the Taliban Five. The new information shows they’re still where they were last -- in the Persian Gulf nation of Qatar under government supervision. So Trump is still wrong.", "The five detainees were released to Qatar in 2014. Qatar is understood to be a neutral state, as opposed to a \"battlefield\" for insurgent activity. Under the agreement, the five released detainees are not allowed to leave the country.", "This travel ban was initially supposed to last one year, ending June 1, 2015, but it has been extended.", "Multiple administration officials told us the detainees haven’t left Qatar. We looked for any evidence to contradict that and found nothing.", "In fact, in December 2015, the Republican-controlled House Armed Services Committee produced a report in which it expressed concern that the Taliban Five pose a security risk. But the report noted that the security arrangements first made in 2015 had been extended so that the five would remain in Qatar.", "The State Department told us on Jan. 9, 2016, that the men were still in Qatar.", "\"None of the five individuals has returned to the battlefield,\" said State Department spokeswoman Liz Trudeau. \"All five men are subject to a travel ban, and none have left Qatar.\"", "\"They’re still in Qatar,\" added Myles Caggins, a spokesman for the National Security Council.", "Another barrier to the ex-detainees’ return to the battlefield is an additional travel ban beyond the U.S.-Qatar agreement. Four of the five are restricted from leaving the country due to a travel ban imposed by a 1998 United Nations Security Council Resolution, said Barnett Rubin, associate director of the Center on International Cooperation at New York University.", "Of course, this doesn’t necessarily mean the former detainees aren’t trying to reconnect with the Taliban or other insurgent groups.", "At least one of the Taliban Five is suspected by the United States of having attempted to contact Taliban associates. And Afghan intelligence officers arrested two suspected insurgents who tried to visit former detainee Mohammad Nabi Omari in Qatar, according to the New York Times.", "It’s also possible that some or all of the Taliban Five have had more contact with the Taliban or other jihadist networks without the public (or even the government) knowing, said Daveed Gartenstein-Ross, senior fellow at the Foundation for Defense of Democracies. But mere communications, or even giving orders from a distance, is not the same thing as literally being \"back on the battlefield.\"", "\"There are indications that they would like to return to the battlefield,\" Gartenstein-Ross said. \"There’s reason for concern, but there’s not evidence to support (Trump’s) particular claim.\"", "Even if the Taliban Five has re-engaged in insurgent activities electronically -- a contention that, we reiterate, is not confirmed by any publicly available information -- it would be a stretch to conclude that this counts as returning to the battlefield.", "\"At least one of them called some of his relatives. I don't know what he said on the phone. If making a phone call now constitutes returning to the battlefield, we are in 1984 territory,\" Rubin said, referring to the George Orwell novel.", "Our ruling", "Trump said the five Guantanamo detainees swapped for Bowe Bergdahl are \"back on the battlefield.\"", "The Taliban Five are known to be in Qatar, where they have been since their release over a year ago. Qatar is considered neutral ground -- not a battlefield -- and they are not allowed to leave the country. At least one of the five has been in contact with suspected insurgents, but experts said there is not enough information available to know the extent of these communications. And even if they had communicated with insurgents from afar, that would not the same as literally going back to the battlefield and, as Trump said, \"trying to kill everybody.\".", "Because there is no evidence to support Trump’s claim, we rate it False.", "NBC, Meet the Press, Jan. 10, 2016", "PolitiFact, \"Donald Trump: Guantanamo prisoners swapped for Bowe Bergdahl are 'back on the battlefield,'\" July 23, 2015", "House Armed Services, Report on the Transfer of Five Senior Taliban Detainees to Qatar, Dec. 9, 2015", "Email interview, State Department spokeswoman Liz Trudeau, Jan. 9, 2016", "Email interview, NSC spokesman Myles Caggins, Jan. 9, 2016", "PolitiFact, \"Are three detainees swapped for Bowe Bergdahl now ISIS leaders?\" Sept. 18, 2014", "CNN, \"Officials: Detainee swapped for Bergdahl suspected of militant activities,\" Jan. 30, 2015", "New York Times, \"For Swapped Taliban Prisoners From Guantánamo Bay, Few Doors to Exit Qatar,\" May 31, 2015", "Washington Post, \"Qatar to maintain travel ban on Taliban Five,\" May 31, 2015", "Interview, NSC spokesman Myles Caggins, July 22, 2015", "Interview, Daveed Gartenstein-Ross, senior fellow at the Foundation for Defense of Democracies, July 22, 2015", "Email interview, Barnett Rubin, associate director of NYU’s Center on International Cooperation, July 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]