["About this rating", "A photograph supposedly showing England's Queen Elizabeth II working as a mechanic during World War II is often circulated on social media:", "While some viewers may have a difficult time picturing the queen as a young woman working on an automobile (as of this writing she is 93 years old), this is a genuine photograph of her during World War II.", "Princess Elizabeth joined the Auxiliary Territorial Service in 1945, where she was commissioned with the honorary rank of second subaltern and trained as an officer driver. Here's a newspaper clipping from the Edmonton Journal about Princess Elizabeth's service:", "Mon, Mar 5, 1945 – 15 · Edmonton Journal (Edmonton, Alberta, Canada) · Newspapers.com", "The viral photograph was taken by William Horton and is available via the National Portrait Gallery of London. A number of additional images of Princess Elizabeth training as a mechanic during World War II can also be found at Getty Images.", "UNITED KINGDOM - CIRCA 1945: Princess Elizabeth (born in 1926), future queen Elizabeth II of England, learning how to change a car wheel as an auxiliary-officer of the English Army, 1945. (Photo by Roger Viollet via Getty Images)", "“To me it’s a really interesting example of women’s roles in the war. Women wanted to be part of what was going on. They were a part of what was going on. It fits in with the statement made by Elizabeth’s mother, Queen Elizabeth, that when Buckingham Palace was bombed she felt she could look the East Enders in the eye.\"", "Wulff, Louis.   \"Princess Elizabeth Joines A.T.S., 'No Privileges,' King's Orders.\" \r\n    Edmonton Journal.   5 March 1945.", "Brockell, Gillian.   \"Was Queen Elizabeth Really a Mechanic During World War II?\" \r\n    Stars and Stripes.   4 June 2019.", "Rothman, Lily.   \"The World War II Auto Mechanic in This Photo Is Queen Elizabeth II. Here's the Story Behind the Picture.\"\r\n    Time.   25 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]