["About this rating", "In early February 2017, various web sites began posting stories regarding a piece of legislation recently passed in the state of Arkansas. Those stories were typically published under misleading headlines such as \"New Arkansas Law Allows Rapists to Sue Victims Seeking Abortion\" and \"Arkansas passes law allowing rapists to prevent victims who want an abortion\":", "A pregnant woman’s husband will be able to sue to prevent his wife from having an abortion, even in cases of rape and incest, under a new law that could come into effect as early as spring.", "The new law, Act 45 — the Unborn Child Protection From Dismemberment Abortion Act, will also allow husbands to sue doctors who carry out abortions for civil damages, as well as block terminations using injunctions.", "Parents and legal guardians would also be able to sue to prevent minors from having abortions, raising concerns for victims of sexual abuse and incest.", "The law in question, titled the Arkansas Unborn Child Protection from Dismemberment Abortion Act, essentially bans what lawmakers term \"dismemberment abortions\" (which the medical community refers to as \"dilation and evacuation,\" or D&E) by making the provision of such a procedure a felony crime. Although the law precludes family members or rapists from suing pregnant women, it does grant spouses, parents, or legal guardians the ability to sue physicians who perform the procedure for damages and obtain injunctions preventing those physicians from performing additional such procedures.", "JR Davis, spokesman for Arkansas Governor Asa Hutchinson, pointed to a section of the law that prevents damages from being awarded when a terminated pregnancy was the result of a criminal act: \"Civil damages shall not be awarded to a plaintiff if the pregnancy resulted from the criminal conduct of the plaintiff.\" Thus, a rapist cannot sue his victim and reap any benefits from doing so. Furthermore, the law excludes a woman \"who receives or attempts to receive a dismemberment abortion\" from civil liability.", "Davis also pointed out that the language in the law doesn't enable a woman's relatives to halt an abortion; rather, it allows them to seek an injunction that prevents \"the abortion provider from performing or attempting to perform further dismemberment abortions ...\" The law, Davis said, was geared toward prosecuting physicians who perform the procedure rather than targeting pregnant women.", "The thrust of the law is that it makes it a felony for doctors to perform dilation and evacuation abortion procedures, except in cases where such a procedure is necessary to prevent death or physical maiming of the mother. Critics note that the law doesn't allow an exception for patients to obtain the specified procedure even in cases of rape or incest. According to Davis, the law is \"not a prohibition on abortion in the second trimester,\" but rather a restriction on a specific abortion method.", "The ACLU, which plans to challenge the law in court, called it \"blatantly unconstitutional\" because it bans the most common — and advocates say the safest — method of abortion in the second trimester of pregnancy.", "Bettina Brownstein, ACLU Arkansas co-counsel on the matter, noted in a statement that:", "The law effectively bans abortions after 14 weeks by making the safest, medically approved procedure a felony.  It interferes with best medical practices by substituting safe, evidence-based practices with political ideology ...", "The law imposes an undue burden by placing a substantial obstacle in the way of a woman’s constitutional right to an abortion. It is clearly unconstitutional.", "According to the Associated Press, the new Arkansas law is similar to legislative actions taken by West Virginia and Mississippi, while related bans in Alabama, Kansas, Louisiana, and Oklahoma are on hold due to ongoing legal challenges.", "The bill passed the Republican-led Arkansas state Senate on 26 January 2017 with a 25-6 vote divided largely along party lines, and it was signed by Governor Hutchinson the next day. The law was slated to go into effect later in 2017, but a federal judge judge blocked its implementation via preliminary injunction at the end of July.", "RT.    \"New Arkansas Law Allows Rapists to Sue Victims Seeking Abortion.\"\r\n    4 February 2017.", "Associated Press.    \"Arkansas Bans Second-Trimester Abortion Procedure; ACLU Calls Ban Unconstitutional.\"\r\n    27 January 2017.", "Harwood, Bryna et al.    \"Options for Second-Trimester Termination.\"\r\n    Contemporary OB/GYN.    1 November 2013.", "State of Arkansas.   House Bill 1032.\r\n    2017.", "Cauterucci, Christina.   \"Judge Blocks Arkansas Law That Could Have Forced Women to Notify Their Rapists of Abortions.\"\r\n    Slate.   31 July 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]