["Central American migrants moving towards the United States in hopes of a better life, queue for pizza Nov. 15, 2018, near the U.S.-Mexico border fence in Playas de Tijuana, Mexico (Getty Images).", "Editor’s note: This item was updated on Nov. 16, 2018, to note the range of estimates of caravan participants at the time of Sen. Ron Johnson’s claims.", "In recent weeks, there has been much attention focused on migrant caravans -- thousands of Central Americans traveling toward the United States border, in hopes of seeking political asylum.", "President Donald Trump has ordered the Pentagon to deploy troops to prevent illegal entry by the migrants. The Pentagon has said more than 7,000 active-duty troops are being sent to the southern border, with more possible.", "U.S. Sen. Ron Johnson, R-Wisconsin, supports the president’s action to secure the border.", "\"Every couple days we have a caravan size group of people apprehended trying to come into the country illegally, or coming to the ports of entry without documentation,\" Johnson said in a Nov. 1, 2018, interview on WTAQ’s \"John Muir Show\" in Green Bay.", "\"About 1,400 illegally, between the ports of entry, about 500 at ports of entry. That’s close to 2,000 a day. It’s overwhelming our system.\"", "Is Johnson right?", "The background", "The migrants, mainly from Honduras, El Salvador, Guatemala and Nicaragua, say they joined the caravan to escape unemployment, poverty, gangs and violence in their homelands. They began traveling toward the border more than a month ago.", "Opponents have portrayed the caravans as a major threat; a tweet by Trump referred to it as an \"invasion.\"", "Meanwhile, in a \"Myth vs. Facts\" statement, the U.S. Department of Homeland Security says \"over 270 individuals along the caravan route have criminal histories, including known gang membership.\"", "When PolitiFact National asked the department how it identified those with criminal histories, an official said only that it was \"law enforcement sensitive.\"", "How many people are in the caravans?", "According to the Associated Press, the government of the central Mexico city of Queretaro, said 6,531 migrants had moved through the state between Nov. 9, 2018,  and Nov. 10, 2018. It said that 5,771 of those departed the morning of Nov. 11, 2018, after staying in three shelters, the largest of which was a soccer stadium in the state capital.", "On Nov. 13, 2018, Reuters reported that about 400 migrants who broke away from the main caravan in Mexico City had already arrived in the border city of Tijuana. On Nov. 15, 2018, in Tijuana, the Desert Sun-USA TODAY NETWORK reported that clashes erupted between migrants and about 300 local residents who gathered to demand the migrants leave the upscale Playas de Tijuana neighborhood.", "Reports have estimated that there are more than 6,000 people in the caravans, perhaps even more than 6,500.", "At the time Johnson made his statement, estimates were generally lower -- typically in the range of 4,000 to 5,000. However, a United Nations estimate on Oct. 22, 2018, had put the figure at 7,200.", "The evidence", "When asked to provide backup for Johnson’s claim, the senator’s staff pointed us to U.S. Customs and Border Protection and its numbers on apprehensions. Statistics for October 2018 show:", "50,975 people were apprehended between ports of entry at the southwest border.", "9,770 people who presented themselves at ports of entry on the southwest border were deemed inadmissible.", "Those statistics were released Nov. 9, 2018 -- more than a week after Johnson made his claim.", "The numbers that were available at the time Johnson spoke -- for September 2018 -- showed a smaller number apprehended between ports of entry -- 41,486 people. A similar number -- 9,082 -- were deemed inadmissible at ports of entry.\n\nLet’s do the math:", "With 31 days in October, that means 1,644 people apprehended per day between ports of entry, and 315 people per day deemed inadmissable at the ports of entry. That equals 1,959 -- the 2,000 Johnson noted.", "With 30 days in September, that means 1,383 apprehended per day between ports of entry, and 303 deemed inadmissable to the ports of entry. That equals 1,686.", "\"With the size of the ‘caravan’ … 2,000 people per day would, over a couple of days, approximate that caravan figure,\" said Patrick McIlheran, Johnson’s senior communications and policy adviser.", "So, Johnson has a valid point about the number of people turned away, or apprehended but -- as is clear from the September and October numbers -- the figure can vary widely month to month.", "At the same time, in making his point, Johnson is doing some mixing of apples and oranges.", "That is, he is using numbers of illegal entries or inadmissable attempts as a comparison for people who say they want to apply for asylum, a legal process.", "What is asylum?", "Seeking asylum has three basic requirements.", "First, an applicant must establish that he or she fears persecution in their home country. Second, the applicant must prove that he or she would be persecuted on account of one of five protected grounds: race, religion, nationality, political opinion or belonging to a particular social group. Third, an applicant must establish that the government is either involved in the persecution, or unable to control the conduct of private actors.", "Lindsay M. Harris, an assistant professor of law at the University of the District of Columbia and the vice chair of the American Immigration Lawyers Association’s National Asylum and Refugee Committee, explained the challenges asylum seekers face in a June 2018 Washington Post essay:", "The first challenge for asylum seekers is just being able to apply. They must either be at the border or within the United States to claim protection — they cannot seek asylum from outside. Some enter the country with a tourist, study or work visa, but these are difficult to obtain. Others approach the U.S. border and ask for protection, or cross the border without permission and are detained by immigration officials before filing their asylum applications.", "Applying for asylum does not guarantee acceptance. Indeed, denials of asylum by immigration judges have been rising, according to the latest statistics.", "The total rate of asylum denials from fiscal year 2011 to fiscal year 2016 was 49.8 percent, according to records kept by Syracuse University. At of the end of September 2016, asylum denial rates for that fiscal year were 57 percent.", "The study covering fiscal years 2011 to 2016 showed that some of the home countries of the caravan participants have very high denial rates. Mexico had a denial rate of 89.6 percent, while El Salvador had a denial rate of 82.9 percent and Honduras had a denial rate of 80.3 percent.", "That underscores the idea that most will not be allowed into the country via asylum.", "Our rating", "Johnson said, \"Every couple days we have a caravan size group of people apprehended trying to come into the country illegally, or coming to the ports of entry without documentation.\"", "The numbers can vary month to month, and the estimates of those participating in the caravan have risen and fallen. So, Johnson has a point.", "But the larger issue is that, in making the comparison, Johnson is mixing numbers for illegal entries with caravan participants aiming at a legal process -- asylum.", "For a statement that is partially accurate but leaves out important details or takes things out of context, our rating is Half True.", "The Associated Press, \"Migrant caravan moves on to central Mexico city of Irapuato,\" Nov. 11, 2018.", "USA Today, \"Migrant caravan: Weary, frustrated participant face long, dangerous road ahead,\" Nov. 4, 2018.", "The Washington Post, \"U.S. militia groups head to border, stirred by Trump’s call to arms,\" Nov. 3, 2018.", "WTAQ 1340AM, \"The John Muir Show,\" Nov. 1, 2018, at Segment 7, 1:38 mark.", "Twitter, @realDonaldTrump, \"This is an invasion of our Country…,\"Oct. 29, 2018.", "U.S. Department of Homeland Security, \"Myth vs. Fact: Caravan,\" Nov. 1, 2018.", "CNN, \"Pentagon no longer calling border mission ‘Operation Faithful Patriot,’ Nov. 7, 2018.", "PolitiFact National, \"Here’s the latest on the migrant caravans,\" Nov. 2, 2018.", "U.S. Customs and Border Protection, \"Snapshot: A SUMMARY OF CBP FACTS AND FIGURES,\" August 2018.", "U.S. Customs and Border Protection, \"Southwest Border Migration FY 2019,\" Nov. 9, 2018.", "AllLaw.com \"Asylee vs. Refugee: Application & Procedural DIfferences.\"", "American Immigration Council  \"Asylum in the United States.\"", "TracImmigration \"Immigration Court Backlog Tool,\" September 2018.", "Associated Press, \"Migrant caravan moving to western Mexico city of Guadalajara,\" Nov. 12, 2018.", "Reuters, \"U.S. lays barbed wire at border as migrant caravan draws closer,\" Nov. 13, 2018.", "Wikipedia \"Asylum in the United States.\"", "Washington Post,\"Seeking asylum isn’t a crime. Why do Trump and Sessions act like it is?\" June 29, 2018.", "Email exchange Patrick McIlheran, Ron Johnson senior communications and policy adviser, Nov. 13.", "U.S. Citizenship and Immigration Services, \" Questions & Answers: Credible Fear Screening.\"", "TRACImmigration \"Continued Rise in Asylum Denial Rates: Impact of Representation and Nationality.\"", "Reuters \"They fled danger at home to make a high-stakes bet on U.S. immigration courts,\" Oct. 17, 2017.", "U.S. Customs and Border Protection \"On a Typical Day in Fiscal Year 2017.\"", "The White House, \"Presidential Proclamation addressing mass migration through the southern border of the United States.\" Nov. 9, 2018.", "The Desert Sun-USA TODAY NETWORK, \"Violence breaks out at Tijuana border as migrant caravan arrives to already crowded city,\" Nov. 15, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]