["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In one of his first ads since winning the Democratic nomination for president, Sen. Barack Obama speaks directly to the camera about his life story and his legislative accomplishments.", "\"America is a country of strong families and strong values,\" the ad begins. \"My life's been blessed by both. I was raised by a single mom and my grandparents. We didn't have much money, but they taught me values straight from the Kansas heartland where they grew up.\"", "Later in the ad, Obama says, \"I passed laws moving people from welfare to work, cut taxes for working families and extended health care for wounded troops who'd been neglected.\"", "The tax cuts Obama is referring to are from his time as a state senator in the Illinois Legislature. In 2000, the Legislature created a state earned income tax credit, based on the federal earned income tax program, which is a tax credit for low-income working individuals and families. The program is meant \"to offset the burden of Social Security taxes and to provide an incentive to work,\" according to the Internal Revenue Service.", "In the federal version, when the tax credit exceeds the amount of taxes owed, it results in a tax refund to those who qualify. In the Illinois bill that Obama co-sponsored, state taxes can go to zero, but there is no additional refund.", "In the 2000 legislation, the legislative record shows that Obama was one of more than 40 senators that co-sponsored the bill, with most of them signing up for it on the same day.", "But the bill had a sunset clause, and when it came time to renew it in 2003, Obama filed the bill and was its chief sponsor. Another 20 senators signed on to co-sponsor it. Rather than renewing it for another few years, the Obama bill made the state earned income tax credit permanent.", "The record shows Obama was a minor co-sponsor in cutting taxes in 2000 and was the leader in the state Senate in 2003 in making the tax credits permanent. It takes more than one person to pass a bill, and although he played a significant role in making the tax credits permanent, the record on Obama's statement supports only a Mostly True.", "Illinois Legislature,\n\nBill Status of SB0004; 93rd General Assembly\n\n, became public law Aug. 18, 2003", "Chicago Tribune, \"Obama's record a plus, a minus; Votes in Senate defy easy labels,\" Oct. 8, 2004", "Internal Revenue Service,\n\nThe Earned Income Tax Credit", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]