["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic Congressional candidate Jack Trammell says David Brat, his GOP opponent, is proposing to cut Social Security benefits.", "\"David said the best way to fix Social Security would be to give seniors back what they paid in and no more,\" Trammell says in a TV ad.", "Trammell and Brat are facing off for the 7th Congressional District seat, previously held by Eric Cantor. Libertarian James Carr is also in the race.", "With the election looming, we thought Trammell’s statement was worth reviewing.", "When we asked for proof that Brat made the statement, Liz Flowers, a spokeswoman for Trammell, pointed us to a May video of Brat addressing the Mechanicsville Tea Party.", "Brat said Social Security and other programs need big cuts:", "\"And it’s not just little marginal changes, right, in order to avoid those insolvency issues with Medicare and Social Security, you’re going to have to do some major cuts,\" Brat told the crowd. \"And so that’s what politicians aren’t willing to say, right? We’re going to have to take some bad medicine coming up. And so we’re going to at least have to just balance the budget.\"", "Brat went on to say people will have to work longer before receiving benefits from the major federal entitlement programs.", "\"And then you’re going to have to increase the working age, right? Social Security and Medicare and these weren’t intended to be retirement programs. These were intended to be disaster prevention for seniors, and I’m all for that. Right? But it’s in the worst case scenario. It’s not been 65, get to retirement – the average death age back then was 65, so it broke even. Now the average death age is 80. Right? So can you pay everyone in the country a huge chunk of money for 15 additional years? No. That’s why it’s insolvent. That’s the beginning.\"", "We also found a video of Brat answering questions after a speech at Life Church in Mechanicsville in April. A man in the audience noted the Social Security Disability Trust Fund is expected to be depleted in 2016 if Congress doesn’t take steps to foster it, and he asked Brat what his response would be if benefits were cut.", "Brat: My general answer is we have to do what’s fair. Right? And so, you put together a graph or a chart and you go out to the American people and you go to the podium and you say, ‘This is what you put in, on average. This is what you get out, on average.’ Currently, seniors are getting about $3 out of all of the programs for every $1 they put in. So, in general, I think you’ve got to go to the American people and just be honest with them and say, \"Here’s what fairness would look like.\"", "So maybe in the next 10 years, we have to grandfather some folks in, but basically we’re going to move in a direct line toward fairness and we have to live within our means.", "Questioner: Fairness in that sense is defined as you get what is coming in and no more?", "Brat: Right. That’s what I’m aiming at.", "The questioner noted that would lead to benefits cuts in the disability program he cited.", "Brat: Right and I wouldn’t want that to impact people without it being announced. But that’s the downside of -- it’s not my fault that we’re there, right? It’s the current folks’ fault that we’re there, so my answer is I would never have let us get into that place in the first place. So that’s – what would you do – when Congress is about to hit a brick wall, what would you do? I mean, hit the brakes or something.", "On Brat’s basic point, the 2014 Social Security trustees’ report says that the retirement piece of the program now uses more than just the designated tax income and will run out of reserves to redeem and pay for the entire entitlement in 2033.", "Flowers, Trammell’s spokeswoman, said Brat’s position has changed over time as he moderated his message for the general election. But he certainly showed support for grandfathering in the April talk and reiterated it in a June interview with the Richmond Times-Dispatch.", "\"We must keep our promise to seniors who are near retirement or are already receiving benefits,\" Brat told the Times-Dispatch Editorial Board. \"Virginians who entrusted their hard-earned money to the Social Security trust fund must receive the benefits to which they are entitled. For younger Virginians, entitlement reform is critical in order to ensure the solvency of Medicare and Social Security.\"", "In a recent article, Brat said he supported raising the retirement age by five years. Trammell said he would be willing to raise it by two years.", "Here’s what Gottstein told us Brat supports:", "A grandfather clause for those 10 years or less from retirement;", "A gradual increase in the eligibility age for receiving benefits for those farther than 10 years from retirement;", "Emphasis on stopping and punishing fraud;", "Reduced federal spending across the board.", "\"When Dr. Brat talks about fairness, he's talking about being fair to existing generations AND to future generations,\" Gottstein said in an email. \"’Grandfathering’ is one way to be fair to our seniors and the nearly-retired. But he also talks about how we have to fairly treat current workers who are contributing to the system by ensuring that the money THEY invest is there for their retirement.\"", "Our ruling", "Trammell says Brat said \"the best way to fix Social Security would be to give seniors back what they paid in and no more.\"", "Trammell tries a typical scare tactic -- attacking a Republican as threatening to cut seniors’ benefits. But his campaign didn’t provide examples of Brat making that actual claim, and Brat’s support of the idea of grandfathering today’s seniors -- and those retiring within 10 years -- would protect them.", "Brat opened the door to some speculation about his views by making open-ended statements about reforming Social Security during the GOP primary this spring. But Trammell has gone overboard in interpreting them and putting words in Brat’s mouth.", "We rate Trammell’s statement Mostly False.", "Jack Trammell, \"Difference,\" Oct. 20, 2014.", "Mother Jones, \"David Brat, the Libertarian Who Beat Eric Cantor, Doesn’t Believe in the ‘Common’ Good,\" June 11, 2014.", "Social Security Administration, 2014 Trustees Report, accessed Oct. 24, 2014.", "Mechanicsville Tea Party, \"Dave Brat at Life Church Part II,\" answer begins at 10:00, April 18, 2014.", "Mechanicsville Tea Party, \"Dave Brat at Mechanicsville Tea Party,\" answer begins at 15:20, May 7, 2014.", "Richmond Times-Dispatch, \"Cantor and Brat on the issues,\" June 7, 2014.", "Richmond Times-Dispatch, \"Brat, Trammell support raising the retirement age to preserve Social Security,\" Oct. 9, 2014.", "Wall Street Journal, \"Medicare, Social Security disability fund headed in different directions,\" July 28, 2014.", "Social Security Administration, Trustees Report, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]