["By Angelo Fichera", "Posted on August 26, 2020", "The prime-time programming for the Democratic National Convention every night on TV included a recital of the Pledge of Allegiance, including the phrase “under God.” Two individual Democratic caucuses omitted those words during daytime meetings — prompting claims that misleadingly suggested they were dropped throughout the convention.", "The Democrats wrapped their 2020 national convention on Aug. 20, but in the days that followed a misleading claim about their use of the Pledge of Allegiance swirled online — with the help of President Donald Trump.", "One Facebook post shared 35,000 times claimed, “Dems recited our beautiful pledge of allegiance tonight and took out ‘UNDER GOD’ ! What say you!”", "Two days later, Trump tweeted: “The Democrats took the word GOD out of the Pledge of Allegiance at the Democrat National Convention. At first I thought they made a mistake, but it wasn’t. It was done on purpose. Remember Evangelical Christians, and ALL, this is where they are coming from-it’s done. Vote Nov 3!”", "In reality, the pledge was recited in full during the prime-time convention programming events every night, beginning at 9 p.m.", "C-SPAN videos of each of the four nights all show the pledge said in full: See night one (clip begins at 3:10), night two (11:15), night three (4:40), and night four (24:38).", "The claim is instead based on the fact that two DNC caucuses omitted the words “under God” during daytime meetings — a point that Trump correctly conveyed in a subsequent tweet and while speaking during the first day of the Republican National Convention.", "The fact was first raised on Twitter by David Brody of the Christian Broadcasting Network and then reported in outlets such as the Washington Times.", "A video of the Muslim Delegates and Allies Assembly’s virtual meeting Aug. 18 shows that the words were left out during the pledge (clip begins at 1:10:48).", "The same day, the LGBTQ caucus meeting’s recitation included a pause in place of the words “under God” (clip begins at 1:55). Another LGBT caucus meeting on Aug. 20 also omitted the words (at 1:30).", "The meetings were among 30 caucus and council meetings that took place during the convention.", "The words “under God” were not officially added to the pledge until 1954, the National Constitution Center notes.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“08.18 Muslim Delegates Assembly.” Democratic National Convention. 18 Aug 2020.", "“08.18 LGBTQ Caucus.” Democratic National Convention. 18 Aug 2020.", "“08.20 LGBTQ Caucus.” Democratic National Convention. 20 Aug 2020.", "Bomboy, Scott. “The history of legal challenges to the Pledge of Allegiance.” National Constitution Center. 14 Jun 2020.", "“Democratic National Convention, Day 1.” C-SPAN. 17 Aug 2020.", "“Democratic National Convention, Day 2.” C-SPAN. 18 Aug 2020.", "“Democratic National Convention, Day 3.” C-SPAN. 19 Aug 2020.", "“Democratic National Convention, Day 4.” C-SPAN. 20 Aug 2020.", "“Democratic National Convention Schedule.” Democratic National Convention. Accessed 25 Aug 2020.", "“DNC Announces Caucuses and Councils for the Democratic National Convention.” Press release, Democratic National Committee. 16 Aug 2020.", "“Speech: Donald Trump Addresses the Republican National Convention in Charlotte – August 24, 2020.” Factbase Videos. YouTube. 24 Aug 2020.", "Trump, Donald (@realDonaldTrump). “The Democrats took the word GOD out of the Pledge of Allegiance at the Democrat National Convention. At first I thought they made a mistake, but it wasn’t. It was done on purpose. Remember Evangelical Christians, and ALL, this is where they are coming from-it’s done. Vote Nov 3!” Twitter. 22 Aug 2020.", "Trump, Donald (@realDonaldTrump). “Two Democrat Caucus Meetings removed ‘UNDER GOD’ from the Pledge of Allegiance. It sounded not only strange, but terrible. That’s where they’re coming from!” Twitter. 23 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]