["About this rating", "At the end of June 2019, a video supposedly showing a large cloud of pollen dropping from a fallen tree went viral on social media, with one iteration posted by the Facebook page BigDawgsTv racking up several million views within a week of its upload date:", "https://youtu.be/u7JHwplUAnE\n\nSome viewers were so shocked to see so much pollen emitted by a single tree that they were skeptical of the clip and questioned whether or not it had been doctored.", "With our sympathies to those who suffer from allergies, we note that this video is authentic.", "This video was first posted to the Facebook page of the Washington-based company Matts Tree & Landscape in May 2019, along with a message announcing the start of \"allergy season\":", "A small portion of a company sign can be seen at the start of the video displaying the first three digits of a phone number (425, a Seattle area code), a logo, and the first two letters of the company name (\"MA\"). The same sign can also be seen in a photograph posted to the company's Facebook page:", "While this video may have been shocking to some viewers, this wasn't the first time that an online video captured a large pollen cloud falling from a tree. In May 2018, a Kentucky Facebook user posted a similar video showing a machine shaking the pollen off of a tree, and that clip was picked up and shared by several local and national news outlets:", "Sheila McCormick, an adjunct professor of plant and microbial biology at the University of California, Berkeley, talked to Live Science shortly after the latter video went viral in 2018 and explained that while the scene may have been unsettling to some viewers, such pollen clouds aren't unusual:", "Pollen is a grainy, plant-produced substance that carries the tools that seed-plants need to create male gametes — aka, sperm. While pollen is not actually sperm itself, pollen grains do contain the cells necessary to transfer the male half of the plant's DNA to a compatible plant's female counterparts (like the pistil and female cones). You could say, as Live Science writer Natalie Wolchover once did, that pollen is plant sperm powder ...", "\"This [scene] is not unusual,\" Sheila McCormick, an adjunct professor of plant and microbial biology at the University of California, Berkeley, told Live Science. \"In general, most plants produce much more pollen than is needed. For example, a single corn plant produces 2 [million] to 5 million pollen grains, and an ear of corn has a few hundred seeds. This is especially true for plants that are wind-pollinated.\"", "Pine trees, like the ones in the video above, are no exception. Some species of pine can produce up to 5 lbs. (2.2 kilograms) of pollen in just a few weeks, according to Robert Bardon, associate dean for extension in the department of forestry and environmental resources at North Carolina State University. Why make so much pollen? Call it offspring insurance.", "Specktor, Brandon.   \"Watch a Massive 'Pollen Cloud' Explode from Late-Blooming Tree.\"\r\n    Live Science.   9 May 2018.", "Katz, Brigit.   \"Watch This Pine Tree Unleash a Huge, Fluffy Pollen Cloud.\"\r\n    Smithsonian.   10 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]