["About this rating", "In the United States, an executive order is a presidential policy directive that implements or interprets a federal statute, a constitutional provision, or a treaty without the requirement of congressional approval. As described by TheFreeDictionary:", "The president can use [executive orders] to set policy while avoiding public debate and opposition. Presidents have used executive orders to direct a range of activities, including establishing migratory bird refuges; putting Japanese-Americans in internment camps during World War II; discharging civilian government employees who had been disloyal, following World War II; enlarging national forests; prohibiting racial discrimination in housing; pardoning Vietnam War draft evaders; giving federal workers the right to bargain collectively; keeping the federal workplace drug free; and sending U.S. troops to Bosnia.", "Historically, executive orders [are] related to routine administrative matters and to the internal operations of federal agencies, such as amending Civil Service Rules and overseeing the administration of public lands. More recently, presidents have used executive orders to carry out legislative policies and programs. As a result, the executive order has become a critical tool in presidential policy making. For example, President John F. Kennedy used an executive order to eliminate racial discrimination in federally funded housing, President Lyndon B. Johnson acted through an executive order to prohibit discrimination in government contractors' hiring practices, and President Richard M. Nixon used an executive order to set a ninety-day freeze on all prices, rents, wages, and salaries in reaction to rising inflation and unemployment.", "The item reproduced above purports that President Obama issued a whopping 923 executive orders in his first term (compared to about thirty each for previous presidents) and offers supposedly alarming provisions of some of those orders. However, the entirety of this item is erroneous.", "First of all, the number of executive orders issued by President Obama is grossly exaggerated here. Through his first term (i.e., the first four years of his presidency), Barack Obama issued 147 executive orders, not 923. (Barack Obama signed a total of 275 executive orders during his two terms, averaging 35 a year; the lowest number signed since Grover Cleveland.) Moreover, compared to President Obama's predecessors in the White House, this is not an unusually large number of orders for a modern president: President George W. Bush issued 291 executive orders during his eight years in office, while President Bill Clinton issued 364 such orders over the same span of time.", "The listing of numbers of executive orders issued during the terms of modern presidents included in one of the examples above also bears no resemblance to reality. This chart compares the claimed number of orders issued by each president on the list with the actual number issued, as documented by The American Presidency Project:", "The attribution to President Obama of fourteen executive orders (numbered between 10990 to 11921) in the example text reproduced above is way off base as well: not a single one of those orders was issued by President Obama. The first twelve orders in the list date to the administration of President John F. Kennedy in 1962, one dates to the administration of President Lyndon B. Johnson in 1966, and one dates to the administration of President Gerald R. Ford in 1976.", "The text of these orders can be viewed in full through the following links:", "• Executive Order 10990: John F. Kennedy, Feb. 2, 1962\n• Executive Order 10995: John F. Kennedy, Feb. 16, 1962\n• Executive Order 10997: John F. Kennedy, Feb. 16, 1962\n• Executive Order 10998: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11000: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11001: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11002: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11003: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11004: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11005: John F. Kennedy, Feb. 16, 1962\n• Executive Order 11049: John F. Kennedy, Sep. 14, 1962\n• Executive Order 11051: John F. Kennedy, Sep. 27, 1962\n• Executive Order 11310: Lyndon B. Johnson, Oct. 11, 1966\n• Executive Order 11921: Gerald R. Ford, June 11, 1976", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]