["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a video that’s being shared on social media, Democratic presidential nominee Joe Biden stands in front of an American flag wearing a face mask.", "\"I pledge allegiance to the United States one nation, indivisible, under God, for real,\" he says.", "Steve Guest, rapid response director for the Republican National Committee, tweeted the clip and said, \"Joe Biden completely botches the Pledge of Allegiance.\"", "But Biden wasn’t reciting the pledge, and the tweet was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The clip of Biden comes from remarks he gave in Manitowoc, Wis., on Sept. 21. He says that line around the 23-minute 45-second mark of this video posted on YouTube by NBC News.", "Leading up to that moment, Biden is criticizing President Donald Trump for what Biden calls a \"deeply flawed and divisive view of the United States\" and for favoring Republican states over Democratic ones.", "\"He’s saying, if you live in a state like Wisconsin, Michigan, Pennsylvania, states with Democratic governors, you’re not his problem,\" Biden said. \"He has no obligation to you. He’s not responsible for you as president, your family or your wellbeing. I don’t see the presidency that way. I don’t pledge allegiance to red states of America or blue states of America, I pledge allegiance to the United States of America. One nation, indivisible, under God. For real. I’m running as a proud Democrat, but I’m not going to govern as a Democratic president. I’m going to govern as president.\"", "We rate this tweet False.", "Tweet, Sept. 21, 2020", "NBC News, Joe Biden delivers remarks in Wisconsin, Sept. 21, 2020", "Rev, Joe Biden campaign speech transcript Manitowoc, Wisconsin September 21, Sept. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]