["About this rating", "On 23 October 2016, the disreputable web site Conservative Daily Post published a factually inaccurate, fear-mongering article reporting that Russian leader Vladimir Putin had just given U.S. President Barack Obama and Democratic presidential nominee Hillary Clinton 24 hours to stop smearing Russia, or else risk starting World War III:", "Russia and the United States have never been allies. One easily remembers how tense and long-lasting the Cold War was, and it left Russia very angry that they suffered such a demoralizing defeat as a world power.", "While the United States should not become Vladimir Putin’s best friend, we also have to realize that Russia is a super power in this world and we must take them seriously.", "[...]", "On Friday, October 21, Putin issued a global message that if Hillary Clinton and Barrack Obama continue to slander Russia, he was going to shoot down U.S. jets in the Middle East and begin to prepare for World War III.", "But now, As of Sunday, October 23, Putin has ordered the Russian Defense Ministry to begin training and managing all local authorities, law enforcement, and state security as they are preparing for a nuclear war with the United States.", "The article is rife with factual inaccuracies and baseless claims (not to mention misspellings). In fact, the credibility of this article is in question from the first sentence, when it states that the two countries were \"never allies.\"  In actuality, the United States and the Soviet Union worked together during World War II.  The article also claimed that Russia was stationing \"dozens of large aircraft carriers\" near Syria; Russia only has a single aircraft carrier.", "While Conservative Daily Post linked to several legitimate news articles about the rising tensions between Russia and the United States, none of them provided any evidence that Putin had given Obama and Clinton an ultimatum to stop \"smearing\" Russia, gave any information about where and when Putin issued the threat, or explained how the United States could possibly comply.", "It's worth noting that the original article has been up longer than 24 hours, and so far as we can tell, WWIII has not yet started.", "Beckhusen, Robert.   \"Why Russia's Only Aircraft Carrier Swaggered Through the English Channel.'\"\r\n    The Week.   24 October 2016.", "Seidel, Jamie.   \"Vladimir Putin Sends Carrier Battlegroup to Syria as Spy Ship Surveys Internet Cables.'\"\r\n    NZ Herald.   19 October 2016.", "Corrected 27 June 2017: The source article for this rumor was published by \"Conservative Daily Post,\" not the \"Conservative Daily News\" as originally stated.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]