["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 12, 2020, as U.S. President Donald Trump was desperately attempting to mount legal challenges to the validity of the Nov. 3 election that saw him lose reelection to Democratic challenger Joe Biden, U.S. Sen. John Cornyn of Texas tweeted a link to a New York Times article headlined \"Thousands of Uncounted Votes Found a Week After Election in Puerto Rico\" and offered it as \"another example of why it is prudent to let the process run its course\":", "However, that New York Times article was about uncounted votes cast for governor, legislators, and mayors across the island of Puerto Rico (a U.S. territory), not the U.S. presidential election. Although residents of Puerto Rico are considered citizens of the United States, they do not have voting representation in the United States Congress and thus are not entitled to cast votes for president (or, more specifically, to cast votes for presidential elections).", "Plenty of Twitter critics jumped in to take Cornyn to task for seemingly not knowing that Puerto Rican citizens are ineligible to vote in presidential elections:", "However, although the Texas senator was quite obviously drawing a parallel between the discovery of some 200 boxes of uncounted ballots in Puerto Rico and contention over the counting of votes in states with very close margins in the U.S. presidential race (such as Arizona and Georgia), Cornyn didn't actually write (incorrectly) that Biden's apparent victory over Trump needed to wait on results from Puerto Rico.", "One straightforward interpretation of Cornyn's tweet was that if thousands of uncounted ballots could turn up in Puerto Rico, then the same thing could happen in one or more states (with much larger populations), so it's prudent to wait a reasonable amount of time after a national election to ensure that all legally submitted ballots have been counted. Indeed, some social media users defended the senator by offering that interpretation of his tweet:", "And later, Cornyn himself followed up to state to his critics that \"neither the [New York Times] story or my comments are limited to presidential elections\":", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]