["By Jessica McDonald", "Posted on October 16, 2020", "During a campaign rally, President Donald Trump said that once he came down with COVID-19, people for partisan reasons shifted from saying immunity was lifelong to saying it lasted only a few months. Experts, however, haven’t changed their estimates for immunity duration, which remains unknown — but unlikely to be lifelong.", "The president also has repeatedly declared himself “immune” to COVID-19 following his illness. That’s a reasonable assumption — at least for now — but whether he’s actually resistant to a second infection isn’t known. And his unique treatment regimen could mean his potential immunity is more fleeting than that of most other people who have recovered from the coronavirus.", "Trump first alleged that COVID-19 immunity estimates changed in an Oct. 13 rally in Johnstown, Pennsylvania, after asking the crowd who else had caught the coronavirus.", "Trump, Oct. 13: Who has had it? Who has had it here? Who’s had it? Yeah. A lot of people, a lot of people. Well, you’re the people I want to say hello to because you’re right now immune. You’re right now immune. Or they say that. You know, they hate to admit it because I had it. So in the old days they said, “Well, if you have it, you’re immune for life,” right? Once I got it, they give you four months. … It’s anybody else but me, you’re immune for life.", "In subsequent news interviews, the president repeated the claim.", "“All I know is I got better very quickly, and I feel very good. I mean, really good. Totally negative, and, uh, you know, I guess you have immunity for a certain period of time, too,” Trump told Newsmax’s Greg Kelly in an Oct. 14 phone interview. “Uh, it used to be for life, until I got it. Now, when I get it, they say it’s only four months, you know. In other words, it was somebody else’s that was for life, but, uh, but I have immunity, I guess.”", "Trump stuck with that story the next day, in an interview with Fox Business’ Stuart Varney.", "“And we’re going to have — there’s — like I have immunity now, and I don’t know, they — I hear from anywhere from four months to a lifetime,” he said. “It’s sort of interesting, as soon as I beat it they said, no, he’s only immune for four months. I said, well, I always heard for a lifetime, but that’s OK, you know. If it was anybody else — hey, Stuart, if it was you, they’d say, yes, he’s immune for his lifetime. But with me, they say four months. You know, they want to make it look as bad as possible.”", "It’s not clear who “they” are when Trump is speaking, but scientists don’t know with any certainty how long any possible immunity to the coronavirus lasts because the virus, SARS-CoV-2, is so new.", "“There is not enough information currently available to say if or for how long after infection someone is protected from getting COVID-19 again; this is called natural immunity,” explains a Centers for Disease Control and Prevention webpage updated on Oct. 14. “Early evidence suggests natural immunity from COVID-19 may not last very long, but more studies are needed to better understand this.”", "Even from the beginning, experts did not expect immunity to be lifelong. As we explained back in April, based on what is known about other human coronaviruses, immunity to SARS-CoV-2 was estimated to last only a few years at most.", "“Reasonable guesses are that on the short end there might be partial protection for about a year or close to a year. And on the long end it might be longer — it might be several years of good protection,” said Marc Lipsitch, an epidemiologist and director of Harvard’s Center for Communicable Disease Dynamics, in a call with reporters earlier this spring.", "A standard proxy for immunity is the presence of Y-shaped immune proteins known as antibodies, especially so-called neutralizing antibodies that can glom on and clear invading viral particles even before the virus can enter cells.", "Lab tests, for example, can evaluate whether antibodies demonstrate neutralizing activity in a test tube. But as we’ve explained before, those tests aren’t routinely done — and even if they are, there’s still no guarantee that those antibodies will be functional and prevent an infection. That’s why scientists remain cautious about saying someone with antibodies is even temporarily immune — even though it’s likely.", "So far, data suggest that most people generate antibodies in response to SARS-CoV-2 infection, and that those molecules persist for at least a few months, although some studies have reported more limited durations.", "An unpublished study in New York City, for example, found that 95% or more of people with confirmed coronavirus infections developed antibodies — and that neutralizing antibodies stuck around for at least three months. Similarly, a study in Iceland found that 91% of recovered COVID-19 patients developed detectable antibodies, with levels remaining steady for four months.", "How much longer the antibodies might last is unknown, and only time will tell.", "Antibodies aren’t the only consideration for immunity, as we’ve noted before. Other immune cells known as T cells also contribute, so even if someone doesn’t have antibodies anymore, they could have some degree of protection. And the B cells that make antibodies also typically stick around, ready to pump out antibodies more quickly if they encounter the pathogen again. Initial data indicate that these cells are also present for at least three months after SARS-CoV-2 infection.", "While the evidence suggests that most people who have come down with COVID-19 will be protected against contracting the virus again for at least several months, there are several case reports of individuals becoming reinfected.", "Immunologists do not think this phenomenon is common, as there are fewer than five confirmed reports out of nearly 40 million infections worldwide. But it does show that individual responses to the virus can vary — and that even temporary immunity is not a given.", "Because there is no way to know for certain whether a person is immune — short of trying to purposely reinfect someone — it’s impossible to know whether Trump is right when he says he has immunity.", "The president has claimed to be immune on multiple occasions following his Oct. 5 release from Walter Reed National Military Medical Center, where he stayed for three nights to treat COVID-19.", "In an Oct. 11 tweet, which Twitter flagged for spreading misinformation, Trump claimed to have received a “total and complete sign off from White House Doctors yesterday,” adding, “That means I can’t get it (immune), and can’t give it. Very nice to know!!!”", "At his Johnstown rally two days later, Trump said, “And now I’m immune, they tell me I’m immune. I could come down and start kissing everybody. I’ll kiss every guy, man and woman, man and woman.”", "Trump very likely is protected for now, but the fact that he received Regeneron’s experimental antibody cocktail as a treatment for his disease could mean that in the future, he could become susceptible again more quickly than most other COVID-19 patients.", "As the New York Times reported, it’s possible that the antibody infusion prevented him from mounting his own antibody response — and that when the synthetic proteins clear from his body, he may be no longer protected.", "Trump also received the steroid dexamethasone, which might also mute the body’s natural immune response.", "According to information released by the White House, Trump probably did not start to make antibodies on his own prior to the Regeneron infusion. An Oct. 7 memo from Dr. Sean P. Conley, the president’s physician, states that the president had “detectable levels” of SARS-CoV-2 antibodies on Oct. 5, but not on the night of Oct. 1. Trump received the Regeneron antibodies the following day.", "Regeneron told us in an email that antibody levels remain high one month after infusion — so protection would be expected to last at least that long — but declined to speculate further.", "A company document shows that at the 8 gram dosage the president took, it takes 18 days for one of the antibodies in the cocktail to decline by half, and 25 days for the second antibody, which suggests the drug could be given once a month. More data on the length of protection, a spokesperson said, would be forthcoming in the ongoing clinical trials.", "We cannot know if Trump’s natural immune response was hampered by the drugs he took or not. But regardless of his immune status, the same public health recommendations still apply.", "The CDC recommends that all people, “whether or not they have had COVID-19, take steps to prevent getting and spreading COVID-19,” including washing hands, practicing physical distancing and wearing a mask.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]