["Within five hours, the Facebook post reading: “well, then stop blaming the white man for your miseries. You get what you vote for”, had more than 790 shares and 218 reactions on the Front National South Africa page.", "The post has since been removed from the page but a similar claim can be seen here and here on Twitter.", "The Facebook page, with over 80 000 followers, purports to be the the official page of the fringe National Party, which says its focus is on the Afrikaans people's right to self-determination.", "Comments on the misleading post and similar posts led AFP to a YouTube video of a mansion based in Las Vegas, Nevada in the United States.", "Multiple videos and pictures have been taken of the $30 million Echo Park (SkySide) estate in Las Vegas, but there is no evidence to suggest it belongs to President Cyril Ramaphosa.", "Ramaphosa’s official living residences as South African president are Mahlamba Ndlopfu in Pretoria, Genadendal in Cape Town and Dr John L Dube House in Durban.", "In July 2015, the presidency confirmed reports about Ramaphosa’s ownership of a plot bought in 2010, based in Cape Town.", "When asked if President Ramaphosa resides or owns a home in Las Vegas, presidency spokeswoman Khusela Diko told AFP: “No, I don’t believe he does”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]