["About this rating", "Entomologists in Washington state successfully eradicated dozens of “murder hornets” from a nest in October 2020 — the first nest discovered in the U.S. since the invasive insects were found on the continent in 2019.", "Entomologists at the Washington State Department of Agriculture (WSDA) eradicated nearly 100 individual hornets from that first nest, according to an agency news release.", "Common in the mountainous regions of Asia, the Asian giant hornet (whose scientific name is Vespa mandarinia), is the world’s largest hornet measuring in at 2 inches with a 3-inch wingspan. Though their painful sting has killed people, the “murder hornets” nickname comes from their status as a “highly efficient killing machine” when it comes to honeybees, an insect vital to U.S. crop pollination that has been in steady decline from a mysterious condition known as colony collapse disorder since the early 2000s.", "Asian giant hornets were first confirmed in British Columbia, Canada, and in Washington in late 2019, with the first hornet having been trapped in July 2020. The first nest to be discovered on American soil came in October in Blaine, Washington, located just over 100 miles north of Seattle near the Canadian border.", "Entomologists with WSDA said that the nest was spotted by a member of the public in September after the agency had previously equipped radio tags on captured Asian giant hornets found in Washington so that scientists could trace the insects back to their nest.", "Over the course of more than three hours, researchers donned in protective suits set up scaffolding around the tree to reach the opening of the nest located 10 feet high. Foam padding was stuffed into a crevice above the nest while the entire tree was wrapped in cellophane, leaving just one entrance to the nest open. A specially designed vacuum hose with a cylinder collected 85 hornets while another 13 live insects were captured with a net.", "Once the majority of the hornets were out of the nest, the team pumped carbon dioxide into the tree to kill any remaining hornets before sealing it with spray foam, wrapping it in cellophane, and then placing traps nearby to catch any survivors.", "https://www.youtube.com/watch?v=JbIfOtpY5p8&feature=youtu.be", "WSDA scientists cut down the tree to view the extent of the nest and determined that it had produced two queens. It is unclear whether they are two virgin queens, females who will leave the nest to produce their own, or if one is a virgin and the other is the old queen.", "Though the eradicated nest is no longer a threat to honeybees in the area, WSDA said it will continue to set traps in the state through November to catch any other insects.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]