["Presidential candidate Beto O'Rourke during an interview with Oprah Winfrey. (Kathy Willens/Associated Press)", "Editor’s note: This is one of four fact-checks featuring a claim made in Club for Growth’s TV ad about Beto O’Rourke. To read the others, click here.", "El Paso Democrat Beto O’Rourke, who announced Thursday that he is running for president, had been teasing a presidential bid for weeks.", "Speculation about his intentions prompted the conservative Club for Growth to release a television ad looking to weaken enthusiasm for O’Rourke among Democratic primary voters.", "The ad argues that O’Rourke has coasted through life due to \"white male privilege\" and that he is a far cry from former President Barack Obama, as many have drawn comparisons between the two Democrats.", "\"Obama went on to become the first African American editor of the Harvard Law Review, breaking barriers,\" the ad says. \"Beto crashed into them, causing a collision while driving drunk, then fleeing the scene to avoid accountability.\"", "Club for Growth provided a fact sheet detailing the source for each statement in the advertisement. Sources include newspaper articles and other sources online. O’Rourke did not return a request for comment.", "OUR PROCESS: Read how PolitiFact checks everyone.", "Police report details accident", "We looked at this incident in September last year and earlier, after allegations about his 1998 arrest were made during his 2018 Senate campaign and his 2012 congressional campaign.", "Here are the facts: O’Rourke was arrested in 1998 for driving while intoxicated in Anthony, a small town in El Paso County.", "A witness told police officers that they saw O’Rourke driving at a high speed on I-10 before losing control of his car and striking a truck traveling in the same direction, according to a police report of the incident published by the Houston Chronicle. The truck was sent across the center median and into the lane moving in the opposite direction.", "O’Rourke then attempted to drive away, but the witness stopped him. Law enforcement arrived at the scene and arrested O’Rourke. Police reported that O’Rourke recorded a 0.136 and 0.134 on police breathalyzers, above a blood-alcohol level of 0.10, the state legal limit at the time.", "Our ruling", "Club for Growth said O’Rourke crashed into barriers, \"causing a collision while driving drunk, then fleeing the scene to avoid accountability.\"", "A police report of the incident states that O’Rourke crashed into another car while driving under the influence of alcohol. A witness said he attempted to flee the scene, but was unsuccessful.", "We rate this claim Mostly True.", "Editor’s note: This is one of four fact-checks featuring a claim made in Club for Growth’s TV ad about Beto O’Rourke. To read the others, click here.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Politico, GOP meddles in Democratic nomination with takedown of O'Rourke, March 10, 2019", "Dallas Morning News, Beto O'Rourke heads to Iowa on Saturday, still undeclared for 2020 but anticipation building, March 11, 2019", "Club for Growth, ‘Pedigree’ Fact Box, accessed March 12, 2019", "Politifact, Beto O'Rourke arrested in 1990s for burglary and DWI, Aug. 22, 2018", "Politifact, Beto O'Rourke says he didn't try to leave DWI accident scene. Police cited witness saying otherwise., Sept. 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]