["Simon Cheng disappeared after visiting the city of Shenzhen from Hong Kong on August 8, and the Foreign Office in London said both British officials and relatives have been unable to speak to him since. Here is an AFP report on the incident.", "The misleading posts, for example this tweet on August 23, 2019, contain a photo of a man wearing square, black glasses and a woman in a low cut top, squatting on the ground, pointing to what appears to be a condom wrapper in a nearby garbage bin.", "A \"寂寞嫦娥舒广袖\" Weibo watermark can be seen at the bottom right of the image.", "The caption of the misleading tweet, written in simplified Chinese translates, in part, as: “A staff member at the British Consulate General in Hong Kong lost touch a few days ago. Western media wantonly attacked China, saying that family members did not know (what happened), and asked for his release and explanation......China, being forced, has to report the case in detail. It turned out he was caught after visiting a sex worker. He was afraid of being disgraced and asked that his family members not be informed, because it was too disgraceful.”", "Beijing said on August 21, 2019 that an employee of the British consulate had been \"placed in administrative detention for 15 days as punishment\" by police in Shenzhen for breaking a public security law.", "The Global Times, a state-run newspaper, said in this August 22, 2019 report that Cheng had been detained for \"soliciting prostitutes\", citing police in Shenzhen -- a city on the China-Hong Kong border. But a Facebook page run by Cheng's family dismissed the report.", "The misleading post and the Global Times story contain two other photos of Simon Cheng --  both of which show him wearing square, black glasses.", "Below is a screenshot of the misleading tweet:", "The photo -- and versions of the image in which the faces of the two people were not pixelated -- was also posted widely online, for example here, here, and here on Twitter, and also on Chinese social platform Weibo, for example here and here with similar claims about Cheng being caught after visiting a sex worker.", "Below is a screenshot of one of the Weibo posts by user 晶城微天下 on August 23, 2019:", "The claim is false; the photo had circulated online long before Cheng was detained in mainland China.", "A reverse image search led to this post on the LIHKG Forum, dated August 13, 2018, with headline that translates from traditional Chinese characters to: \"Member Agger was put into prison for 15 days when visiting a sex worker ”.", "The caption of the forum post says: \"He was caught last Thursday. Only this morning his brother got a call asking him to pay the bail. He also asked about the Manchester City's score yesterday.\"", "Below is a comparison of the screenshot from the misleading tweet (L) and the photo from LIHKG Forum (R):", "The photo also appears in this April 26, 2019 YouTube video about the need for legislation on privacy in China.", "It was also published in this July 9, 2019 news report by Hong Kong-Taiwan-based media Next Magazine.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]