["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "How many Illinoisians are trading the Land of Lincoln for the Badger State?", "Since when did Wisconsin become a magnet for residents from its neighbors to the south?", "According to Mark J. Perry, an economist at the American Enterprise Institute, Wisconsin’s economy and strong job market are driving people from Illinois to move here.", "\"Wisconsin is currently seeing an influx of new residents, Illinois is seeing an outflux,\" Perry said on 1130 WISN’s Jay Weber Show on June 28, 2019, suggesting it’s because of Wisconsin’s low unemployment rate and job openings.", "Perry’s claim comes from a study he conducted for the Badger Institute, a conservative think tank, titled \"Leaving Illinois for Wisconsin: An analysis of the accelerating outbound migration across the border to the Badger State.\"", "We’ve seen the Cubs gear at Miller Park, but figured most of those fans were just visiting.", "How many Illinoisians are trading the Land of Lincoln for the Badger State?", "And does his claim account for Wisconsinites who are moving south of the border?", "We decided to take a look.", "How the study was conducted", "To conduct the study, Perry used numbers from the Census Bureau’s annual reports of  inbound and outbound migration for each state.", "\"All of that is publicly available data and information that I just got from various government sources,\" Perry told PolitiFact Wisconsin.", "The Wisconsin/Illinois study was part of a wider study Perry conducted on nationwide migration patterns.", "To find data for the state-to-state migration flows, the Census Bureau asks respondents about everyone age 1 year and over and whether they lived in the same residence a year ago. If the person lived somewhere else, they are asked to say where they moved from.", "In 2017, when all migration is considered, Wisconsin had 112,519 move in and 113,492 move out, a net loss of less than 1,000 people. (Of course, there are other factors in overall population changes -- births and deaths).", "Looking strictly at migration changes, Wisconsin’s net outflow of 973 people in 2017 puts the state  around the middle of the pack. All told, there were 21 states that lost more people to migration that year.", "Florida saw the biggest boost via net migration, adding 118,890, while New York took the biggest hit with 167,328 more leaving than coming.", "Wisconsin vs. Illinois", "The picture changes for Wisconsin when you look strictly at Illinois -- there a big gap emerges.", "According to the Census Bureau’s most recent data from 2017, Illinois had a population of almost 12.7 million, compared to Wisconsin’s 5.7 million.", "In 2017, 26,963 people moved from Illinois to Wisconsin, according to the census bureau’s migration data. Meanwhile, 12,274 moved from Wisconsin to Illinois. That means Wisconsin picked up a net 14,689 people from Illinois in 2017 alone.", "(To be sure, there are a lot more people in Illinois who may be on the move. The state has more than twice the population of Wisconsin.)", "That means 297,812 people left Illinois for Wisconsin between 2006 to 2017 and 181,419 left Wisconsin for Illinois in the same time period. That leaves a net flow of 116,393, which matches Perry’s study.", "And his claim.", "Researching the process", "We also asked researchers who have worked on similar migration studies how they go about conducting a study using these kind of numbers.", "Chris Edwards, director of tax policy studies at the CATO Institute, who conducted his own study on interstate migration, used census numbers and Internal Revenue Service numbers for the process.", "For Perry’s study, Edwards said the question should remain in whether Wisconsin is really as strong of a location in attracting business when it also has a steady outflow.", "\"The data is accurate,\" Edwards said. \"The flows are accurate. The debate really is why people are moving.\"", "Our rating", "Perry claimed \"Wisconsin is currently seeing an influx of new residents, Illinois is seeing an outflux.\"", "He indicated he was speaking about the flow between the two states, with Wisconsin picking up a net 116,000 residents from Illinois between 2006 and 2017.", "But a caveat is in order:", "Listeners could be left with the idea Wisconsin is booming in this regard. In reality, when all states and locations are taken in, Wisconsin ranks in the middle of the pack, based on the most recent numbers, from 2017.", "Our definition for Mostly True is \"The statement is accurate but needs clarification or additional information.\" That fits here.", "The Jay Weber Show, Why Thousands Are Leaving Illinois for Wisconsin, June 28, 2019", "The Badger Institute, Leaving Illinois for Wisconsin, June 2019", "Phone interview with Mark Perry on Aug. 13, 2019", "U.S. Census Bureau state-to-state migration flows from 2006 to 2017", "American Enterprise Institute, Top 10 inbound vs. top 10 outbound U.S. states in 2017: How do they compare on a variety of tax burden, business climate, fiscal health and economic measures?, Dec. 24, 2018", "Phone interview with Chris Edwards of CATO Institute on Sept. 9, 2019", "CATO Institute, Tax Reform and Interstate Migration, Sept. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]