["About this rating", "In September 2019, we received multiple inquiries about the authenticity and provenance of a quotation widely attributed to U.S. President Abraham Lincoln. On Sept. 21, the right-leaning Facebook page Turning Point USA posted a meme that read:", "\"'If you want to test a man's character, give him power.' Abraham Lincoln.\" The meme was accompanied by a caption that stated, \"Big government is [sic] abuses its power!\"", "That quotation has been attributed to Lincoln for almost a century. Variations of it have appeared in multiple newspaper columns, it has been promulgated in countless memes and quotation compendiums, and it was widely shared when it was tweeted out by the writer J.K. Rowling in 2017.", "It has been attributed to Lincoln in the U.S. Senate on three occasions, including two citations by Sen. Rand Paul, R-Ky., and the earliest Lincoln attribution we found was in the early 1930s.", "The full quotation is usually given as, \"Nearly all men can stand adversity, but if you want to test a man's character, give him power.\"", "In reality, Lincoln never uttered or wrote those words, or words to that effect. Rather, they were said about him. The original version of the quotation came on Jan. 16, 1883, during a speech in Washington, D.C., by the prominent writer and orator Robert Ingersoll.", "According to newspaper reports, Ingersoll was introducing another speaker, who was scheduled to give a lecture on Lincoln, at an unspecified \"auditorium\" in the nation's capital. During the course of his introductory remarks (which were printed in full by the press), Ingersoll said:", "\"... If you want to know the difference between an orator and a speaker, read the oration of Lincoln at Gettysburg, and then read the speech of Everett at the same place. One came from the heart, the other was born only of the voice. Lincoln's speech will be remembered forever. Everett's no man will read. It was like plucked flowers. [Applause].", "\"If you want to find out what a man is to the bottom, give him power. Any man can stand adversity — only a great man can stand prosperity. It is the glory of Abraham Lincoln that he never abused power only on the side of mercy. [Applause]. He was a perfectly honest man. When he had power, he used it in mercy ...\"", "A modified version of those lines later appeared in published volumes of Ingersoll's speeches and essays. For example, in his 1895 \"Abraham Lincoln, a Lecture,\" he wrote:", "\"Nothing discloses real character like the use of power. It is easy for the weak to be gentle. Most people can bear adversity. But if you wish to know what a man really is, give him power. This is the supreme test. It is the glory of Lincoln that, having almost absolute power, he never abused it, except on the side of mercy.\"", "The exact same formulation of words appeared in Volume 3 of the 12-volume \"Works of Robert G. Ingersoll,\" which was published in 1902, three years after the well-known orator's death.", "For a few decades, Ingersoll's pithy praise of Lincoln was widely cited and correctly attributed in American newspapers, but the subject of the quotation appears to have been conflated with its author, beginning in the 1930s. Newspaper archives indicate that the quotation became increasingly condensed and increasingly attributed to Lincoln over the following decades, and in the present day Ingersoll's original authorship has been almost entirely eclipsed.", "Turning Point USA was far from the first to mistakenly attribute the quotation to Lincoln in the site's September 2019 meme, but the error was the latest prominent example in a list that stretches back almost 100 years.", "Heleringer, Bob.  \"Lincoln and the Challenge of Power.\"\r\n  The Courier-Journal (Louisville, Kentucky).  12 February 2005.", "Thomas, Cal.  \"Clinton Diagnosed as a Congenital Liar.\"\r\n  Tribune Media Services/The Messenger (Madisonville, Kentucky).  18 September 2016.", "Weaver, Mason.  \"Lincoln Was Principled, Honorable.\"\r\n  The Californian.  13 February 1998.", "Lum, Bill.  \"Power, Love and Sound Mind...Not Fear.\"\r\n  Hawaii Tribune-Herald.  10 December 1966.", "Grams, Rod.  \"U.S. Senate Debate, 18 November 1995.\"\r\n  Congressional Record.  18 November 1995.", "Paul, Rand.  \"U.S. Senate Debate, 20 May 2015.\"\r\n  Congressional Record.  20 May 2015.", "Paul, Rand.  \"U.S. Senate Debate, 21 September 2016.\"\r\n  Congressional Record.  21 September 2016.", "Williamsburg Journal Tribune.  \"Homestead.\"\r\n  26 March 1931.", "The Herald-Despatch (Decatur, Illinois).  \"A Brief Bit of Bob's Eloquence.\"\r\n  27 January 1883.", "Ingersoll, Robert.  \"Speech in Washington D.C., 16 January 1883.\"\r\n  Wisconsin State Journal.  16 January 1883.", "Ingersoll, Robert.  \"Abraham Lincoln, a Lecture.\"\r\n  C.P. Farrell (Publisher).  1895.", "The Dresden Publishing Company.  \"The Works of Robert G. Ingersoll, Volume 3.\"\r\n  1902.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]