["About this rating", "Disneyland Resort originally announced plans on June 10 to reopen its two amusement parks Disneyland Park and Disney California Adventure on July 17. However, the company canceled those plans. The Downtown Disney District reopened in July. Disney Resort announced plans to extend the Downtown Disney District to Buena Vista Street inside the gates of Disney California Adventure in November. However, only shopping and dining will be accessible.", "As of November 2020, Disneyland Resort had not announced a new reopening date.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 pandemic pressed on into November 2020, theme and amusement parks in California remained closed under guidance by state leaders who expressed concerns over large social gatherings and events. Over the summer, Disneyland flirted with the idea of trying to reopening the amusement park.", "However, no evidence indicates Disneyland or any other theme parks in California will reopen by the end of the year, such as for the holidays.", "Disneyland Park and Disney California Adventure announced their closures on March 12 amid uncertainty surrounding the coronavirus pandemic, as well as the reality of new policies in the state of California, and were no longer open to the public as of March 14. Guests who had been staying at Disneyland Resort were given until March 16 to leave.", "In the months since its closure, fans of Disneyland speculated about reopening efforts. It's true that Disney announced plans on June 10 to reopen the two parks on July 17.", "However, the company canceled the plans on June 24, saying: “Our theme parks and resort hotels remain closed and will reopen at a later date, pending state and local government approvals.” At the time of this writing, Disneyland Resort had not announced plans of reopening its two parks during the final months of 2020.", "According to a statement on the Disneyland Resort webpage, the company had begun a phased reopening of its Downtown Disney District in July, which included some cafes and live music. It also announced plans to extend the Downtown Disney District to Buena Vista Street, inside the gates of Disney California Adventure Park: \"Only the shopping and dining experiences along Buena Vista Street will be accessible from the Downtown Disney District at this time, as Disney California Adventure park is currently closed.\"", "However, the Hotels of the Disneyland Resort, Disneyland Park, and Disney California Adventure Park remained closed until an undetermined opening date, which was to be set forth by state and local government approvals.", "During an Oct. 19 news briefing, California Gov. Gavin Newsom spoke about the “dreaded third wave” of the virus that was trickling through the state in fall 2020. In a meeting the following day, California Health Secretary Dr. Mark Ghaly announced guidance for amusement and theme parks amid the pandemic that included a three-step tiered system for reopening. Under the new rules, small theme parks were allowed to resume operations under Tier 3 (orange/moderate potential spread), and all amusement parks, including Disneyland, would only be allowed to open under Tier 4, which was characterized by minimal potential spread.", "In a statement shared to Twitter by Disney Park News, Disneyland Resort President Ken Potrok expressed disappointment at the new guidelines.", "We have proven that we can responsibly reopen, with science-based health and safety protocols strictly enforced at our theme park properties around the world. Nevertheless, the State of California continues to ignore this fact, instead mandating arbitrary guidelines that it knows are unworkable and that hold us to a standard vastly different from other reopened businesses and state-operated facilities. Together with our labor unions we want to get people back to work, but these State guidelines will keep us shuttered for the foreseeable future, forcing thousands more people out of work, leading to the inevitable closure of small family-owned businesses and irreparably devastating the Anaheim/Southern California community.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]