["About this rating", "In mid-2019, one of the many hotly contested political issues in the United States was whether the forms to be used for the upcoming 2020 national census could (or should) include questions regarding citizenship status. The Trump administration favored the addition of such questions, but after the U.S. Supreme Court initially blocked that move, the administration announced that the Census Bureau had \"started the process of printing the decennial questionnaires without the question.\"", "Around that time, a social media meme purported to offer an image of the \"current census form,\" showing that the form did indeed include an \"unconstitutional\" question about the respondent's citizenship status:", "That image was not a photograph of the form to be used for the decennial U.S. census in 2020, however. It was actually a picture of the questionnaire used for the American Community Survey (ACS), which the U.S. Census Bureau sends out to about 3.5 million households across the U.S. every year.", "As described on the U.S. Census Bureau's website, the American Community Survey \"helps local officials, community leaders, and businesses understand the changes taking place in their communities. It is the premier source for detailed population and housing information about our nation\":", "The American Community Survey is a legitimate survey conducted by the Census Bureau.", "Unlike the every-10-year census, this survey continues all year, every year. We randomly sample addresses in every state, the District of Columbia, and Puerto Rico.", "Answers are collected to create up-to-date statistics used by many federal, state, tribal, and local leaders. Some American Community Survey questions have been asked in the decennial census since it first began in 1790.", "Although many of the same households that respond to the decennial U.S. census are also surveyed by the ACS, and although some the same questions appear in both surveys, the census and the ACS use distinctly different forms.", "Many critics would likely not find much distinction between the two, however. The American Community Survey is conducted by the U.S. Census Bureau, it was created in 2005 to replace the long form previously used by the decennial census, and responding to the ACS is required by law (as it is for the decennial census). Yet one has citizenship questions and the other does not.", "Perhaps not surprisingly, a study released in September 2018 by the Center on Poverty and Inequality at Georgetown University in Washington, D.C., found that the portion of respondents who did not answer the ACS citizenship question more than doubled between 2010 through 2016, from 2.7% to 6%.", "Mervis, Jeffrey.   \"Fewer People Are Answering a U.S. Agency’s Citizenship Query.\"\r\n    Science.   10 September 2018.", "Wang, Hansi Lo   \"What You Need to Know About the 2020 Census.\"\r\n    NPR.   31 March 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]