["About this rating", "In October 2020, reports and social media posts emerged claiming that someone had erected a large \"TRUMP\" sign over Interstate 405 in Los Angeles. Newsweek, for example, reported that:", "Large letters in the style of the iconic Hollywood sign reading \"TRUMP\" were found on Los Angeles' 405 Freeway on Tuesday morning. Los Angeles CBS Local reported that the letters were installed sometime between late Monday night and Tuesday morning on the southbound side of the Freeway in Sepulveda Pass. The giant letters appeared to use the iconic typeface from the \"SF Hollywood Hills\" font family, making it blend into the hilly setting seamlessly.", "Such reports were accurate. Local television channel KTLA posted its own, authentic aerial footage of the sign as it appeared on Oct. 6, clearly showing its location on a hillside overlooking a stretch of I-405 at the Sepulveda Pass, around 25 miles west of downtown Los Angeles:", "The sign didn't last long. Later on the morning of Oct. 6, crews from the California Department of Transport (Caltrans) flattened out the structure undergirding each of the letters, and appeared to begin dismantling it. As further proof of the sign's authenticity, CBS Los Angeles captured aerial footage of the sign's decommissioning:", "A spokesperson for Caltrans told Los Angeles Times that, because the sign was on private property, it was not removed entirely, but it was flattened out so that it did not provide a \"visual distraction.\"", "\"This was a life and safety issue because there were concerns about distracted driving,\" the spokesperson said.", "Watts, Marina.   \"Giant Hollywood-Style Trump Sign Appears on Los Angeles Freeway.\"\r\n    Newsweek.  6 October 2020.", "Smith, Hayley.   \"Giant Trump Sign Appears — and is Swiftly Taken Down — in Sepulveda Pass.\"\r\n    Los Angeles Times.  6 October 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]