["A video of a mass gathering of people supposedly offering prayers has been massively shared on social media. Facebook user Saleem Ashraf shared an 80-second clip with the message, “इटली में सभी मजहब के लोग सजदे के बल अल्लाह से रो रोकर अपने गुनाहों की माफ़ी की तलब कर रहे है। या अल्लाह दुनिया का तू बादशाह है बेशक जो भी तुझसे मदद की भीख मांग रहे है तौबा की तलब कर रहे हैं तू उनकी दुआ को कुबूल कर और हिदायत दे अमीन”. As per the message, the video depicts scenes from Italy where people are ‘prostrating’ before the God and asking for his forgiveness in the backdrop of the coronavirus pandemic. It may be noted that Italy is one of the worst-hit countries by the pandemic. The video has amassed over 11,000 shares at the moment.", "इटली में सभी मजहब के लोग सजदे के बल अल्लाह से रो रोकर अपने गुनाहों की माफ़ी की तलब कर रहे है। या अल्लाह दुनिया का तू…", "Posted by Saleem Ashraf on Thursday, 26 March 2020", "On March 29, Facebook page Coronavirus Worldwide posted a longer version of the same video, which is a purported Facebook live stream. The accompanying message reads, “In Italy people of all religions prostrate before God. They started crying and asking for forgiveness for their sins. Keep sharing the video”.", "In Italy people of all religions prostrate before God. They started crying and asking for forgiveness for their sins. Keep sharing the video", "Posted by Coronavirus WorldWide on Saturday, 28 March 2020", "Alt News has received several requests on its official android application to fact-check this video. The same video has been shared in Hindi, English, and Urdu on Twitter.", "It is also being shared with the claim that the video is from Spain. “अभी ताजा रिपोर्ट सारा स्पेन सजदे में गिर गया स्पेन में तमाम मजहब के लोग अल्लाह के सामने सजदे मे गिर गए रो रो कर अपने गुनाहों की माफी मांगने लगे वीडियो को शेयर करे (Fresh reports from Spain. The whole of Spain including people from different religion prostrated in front of Allah. They cried and asked for forgiveness for their sins. Do share the video),” reads the claim.", "Alt News went through the comments posted below the purported Facebook live stream and found that the video is neither from Italy nor from Spain. It was shot at the San Martin Plaza in Lima, Peru.", "In the comparison below, one can easily identify that the structures seen in the background of the viral video match with those at San Martin Plaza. The image on the right is Google street view of the location.", "A subsequent search for this video on Facebook led us to another live stream that dates back to December 6, 2019. It was posted with the message, “Prayer vigil for Peru. San Martin Square -Lima”. According to its ‘About Us’ section, Facebook page – Perú, Jesucristo es la única esperanza (Peru, Jesus Christ is the only hope-translated) – is the national co-ordination platform for evangelical churches in Peru.", "VIGILIA DE ORACIÓN POR EL PERÚ. Plaza San Martín – Lima.", "Posted by Perú, Jesucristo es la única esperanza on Friday, 6 December 2019", "Alt News was independently able to ascertain that both the videos now viral on Facebook and the one live-streamed on December 7, 2019, showed the same event in Peru.", "We compared a frame from the viral video (top) showing the lighted rooms inside a specific building with another frame taken from the video posted by this Facebook page showing the same visuals (bottom). This was to ascertain that both the videos were shot on the same day and around the same time. The security personnel in the crowd can also be spotted in both the images.", "We also found a poster of the event shared by the Facebook page on December 3, 2019. It is most likely a gathering organized by a religious group. It is important to note here that the gathering took place on December 6, 2019, while according to Reuters news agency, the first positive case of coronavirus in Peru was reported on March 6, 2020. Thus, it can be said with certainty that the event has no connection with the coronavirus pandemic.", "With a keyword search (VIGILIA DE ORACIÓN POR EL PERÚ) on Facebook, we found the exact video now viral. It was actually shot via a Facebook live shot by local politician Alejandro Muñante.", "Vigilia de oración por el Perú🇵🇪", "Posted by Alejandro Muñante on Friday, 6 December 2019", "A December 2019 video from Peru was shared as people offering prayers in Italy and Spain in the light of coronavirus outbreak in the two countries. As it turned out, the video is unrelated to the pandemic. It was shot on December 6, 2019. China informed the World Health Organisation (WHO) about a cluster of pneumonia-like cases on December 31, 2019. The WHO issued a statement on January 9, 2020, that people were infected with the novel coronavirus. Therefore, citizens in Peru (or Italy and Spain for that matter) couldn’t possibly be praying in light of an infection that was yet to take a global stage.", "At the time of writing this article, Italy and Spain have reported over 11,500 and 8,100 deaths respectively. As per the John Hopkins coronavirus resource centre, the total number of coronavirus positive cases in Peru has crossed 950.", "Note: The number of positive cases of the novel coronavirus in India is over 1,400. This has caused the government to impose a complete restriction on movement apart from essential services. Globally, more than 8 lakh confirmed cases and over 38,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]