["Jab pani mein se bijli nikal jayegi, aur pani kheto mein jayega, toh pani mein se bijli nikal jayegi toh takat hi nikal jayegi, phir kheto mein pani kaam kya ayega (If electricity is removed from water and the water goes to the farm, such water will have no energy and will be useless in the farm- translated). AICC General Secretary and former Rajasthan CM Ashok Gehlot is being roasted on social media after he purportedly made these daft remarks at a press conference. A 16-second clip is circulating widely on Twitter in which Gehlot can be heard saying these words. Sambit Patra, National spokesperson of the BJP tweeted about this video with the words “Is it authentic? Is this the way Congress misguided our farmers?” It was also shared by Akhilesh Mishra who is a former director of MyGoV. Mishra has now deleted his tweet. It has been tweeted by several others who are followed by the Prime Minister on the social media platform.", "Friends I received this video! Is it authentic?? Is this the way the Congress misguided our Farmers?? Pls enlighten!! अशोक गहलोत का विज्ञान – पानी मे से बिजली पैदा करके खेतो में भेजेंगे तो प… https://t.co/cLPCawUXiz via @YouTube", "— Sambit Patra (@sambitswaraj) June 5, 2018", "Within no time, #ScientistGehlot became one of the top trends on Twitter as social media users supportive of BJP and PM Modi tweeted it in droves.", "The mockery over this statement apparently made by Gehlot has spread on Facebook as well, with a number of individual users posting this video clip and ridiculing Gehlot and the Congress party.", "So, did Ashok Gehlot say these words? Indeed he did, as can clearly be seen in the video which is real. But, did he mean these words? What was the context in which they were uttered? Alt News fact checked this viral claim about Gehlot’s statement and found that the clip doing the rounds is a severely truncated part of a longer video. A longer version of this video which explains the context has been posted below.", "The video is of a press conference by the Congress party on May 26. Watching the video in totality makes it clear that Gehlot is referring to Jan Sangh, the forerunner of the BJP. According to Gehlot, when he was young he had witnessed how Jan Sangh cadres were spreading misinformation about the Bhakra dam which was inaugurated by former PM Jawaharlal Nehru, spreading rumours that once electricity is removed from water, the water will become useless. He had said, “I remember, during childhood there was the Jan Sangh. When the Bhakra dam was built, Jan Sangh cadres used to preach that ‘Pandit Nehru has lost it. He is building a dam, on which he will construct a hydro power plant. If electricity is removed from water and the water goes to the farm, such water will have no energy and will be useless in the farm”- translated).", "Ashok Gehlot had in fact posted the video of this press conference on his official Facebook page on May 26.", "देश में करीब 6 लाख गांव हैं, यदि 18 हजार गांवों में मोदी जी ने बिजली पहुंचाई तो फिर 5 लाख 82 हजार गांवों में बिजली किसने पहुंचाई? मोदी जी झूठ बोलने की हदें पार कर चुके हैं।", "Posted by Ashok Gehlot on Saturday, May 26, 2018", "This is not the only instance of Gehlot making this claim. A video posted on YouTube by the page Gujarat Congress shows Gehlot making a similar statement in December 2012.", "Meanwhile, Gehlot tweeted a clarification and slammed those circulating the edited video.", "ये इनकी असलियत है और इनकी फितरत में है कि मुझ जैसे साधारण इंसान को भी #ScientistGehlot का दर्जा दे देते हैं। This is the original, which was edited.. pic.twitter.com/KGygG7RPMn", "— Ashok Gehlot (@ashokgehlot51) June 5, 2018", "Mischievous editing that obscures the original meaning of what has been said and places words completely out of context is a popular tactic deployed by fake news purveyors. Earlier, a statement made by Congress President Rahul Gandhi (‘Aloo ki factory’) had been subjected to similar treatment following which Gandhi was ridiculed incessantly. In another instance, journalist Ravish Kumar was targeted by BJP IT cell head Amit Malviya who had shared an edited clip with a false claim.", "The manner in which this edited video was shared and the pace with which it spread across social media in an organised manner represents a strategy that hardly leaves any scope for reflection or scepticism with regard to such videos. This allows such propaganda to spread all over social media in no time.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]