["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Three screenshots using doctored images falsely suggest that there were reports of the same boy’s death in three countries.", "The boy pictured in the claim died in 2017 from an apparent suicide.", "Stirring new grief for the family of a boy who committed suicide in 2017, people are sharing doctored images of the child in an apparent attempt to cast doubt on the coronavirus pandemic.", "\"Same little boy died of COVID-19 in three different countries,\" a Facebook post says facetiously. \"Still don’t believe the media is #fakenews?\"", "The post, which contains three screenshots of what appear to be portions of three different news reports, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo that is repeated in all of them, however, is of Conor Wilmot, a 13-year-old boy from County Clare, Ireland, who died after reportedly participating in a self-harm challenge. The story was covered by local media at the time after the boy’s loved ones spoke out.", "Let’s look at each image in the Facebook post:", "1. Conor Wilmot", "The first screenshot includes a portion of a legitimate May 16, 2017, news article in the Irish Times about Conor’s death.", "The boy’s father said in the article his son died from playing a \"choking game\" he had found on the internet and did not intend to take his own life.", "The photo of Conor in that article, visible in the screenshot, is authentic.", "2. Isaiah Gonzales", "The second screenshot includes the same photo of Conor.", "But the caption identifies the boy as Isaiah Gonzales and the photo credit is from a TV station in San Antonio, Texas.", "Isaiah Gonzales is the name of a 15-year-old boy from San Antonio who hanged himself on July 8, 2017, news reports show.", "According to his family, Isaiah’s suicide was possibly tied to a sometimes-dangerous online game known as the Blue Whale Challenge, the Washington Post reported.", "Both suicides occurred more than two years before the coronavirus first surfaced in China.", "3. Ismail Mohamed Abdulwahab", "The third screenshot also has the same photo of Conor.", "It includes the headline from an April 1, 2020, news article about the youngest person in the United Kingdom to die from COVID-19.", "That person is Ismail, who was 13 and lived in London.", "AFP Fact Check and other websites have reported that social media posts have falsely included a photo of Conor with news articles about Ismail’s death.", "The newspaper in Conor’s home area, The Clare Echo, published a news article April 6, 2020 about the misuse of Conor’s photos. It included a screenshot of the same images in the Facebook claim we’re checking.", "The article said Conor’s older sister, Melanie Wilmot, posted a message online that said: \"We’re devastated that they can do this, frankly had enough just let us be and leave Conor alone.\"", "This Facebook post does not show that the media is falsely suggesting that the same boy had died of the coronavirus in three different countries.", "Rather, it shows that someone used doctored images of a child who reportedly killed himself to falsely suggest a media conspiracy over COVID-19.", "We rate it Pants on Fire.", "Facebook, post, April 6, 2020", "Irish Times, \"Conor Wilmot ‘found something on the internet that went wrong,’\" May 16, 2017", "Washington Post, \"Texas family says teen killed himself in macabre ‘Blue Whale’ online challenge that’s alarming schools,\" July 11, 2017", "iol.co.za, \"Boy, 13, becomes youngest in UK to die from Covid-19,\" April 1, 2020", "BBC, \"Coronavirus: 13-year-old boy dies, says London hospital trust,\" March 31, 2020", "en.as.com, \"Coronavirus: 13-year-old boy dies of coronavirus in the UK,\" April 1, 2020", "AFP Fact Check, \"This photo has circulated in reports about an Irish teenager who died in 2017,\" April 8, 2020", "Lead Stories, \"Fact Check: Photo On Biography Of Boy Who Died From Coronavirus Is NOT Actually Him,\" April 6, 2020", "Republic World, \"Fact Check: Is The Picture Of A 13-year-old Boy In UK Passing Away Due To COVID-19 Real?\" April 8, 2020", "The Clare Echo, \"‘Leave us alone’ – Sixmilebridge family horrified at being falsely linked to UK COVID-19 death,\" April 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]