["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Following the 2020 U.S. presidential election, a prominent Twitter account and a YouTuber with 464,000 subscribers shared outdated news stories reporting that Attorney General William Barr had called an \"emergency meeting\" with President Donald Trump after making a \"major discovery.\"", "The viral tweet came from former game show host and conservative podcaster Chuck Woolery, who tweeted a story from Conservative Brief to his 675,000 Twitter followers. The story's social media copy said it was a \"shock discovery\" and included in the social subheading: \"We all feared this.\"", "A YouTube video was also shared on Nov. 12 from YouTuber Lisa Haven, with the video title: \"Barr Calls Emergency Meeting With Trump…Is It All About To Hit The Fan? Lawsuit Inside Details!\" The video also highlighted the same meeting referenced by Woolery.", "The Nov. 12 YouTube video title and Nov. 15 tweet both appeared to promise a post-election revelation. However, both the video and tweet were about two ABC News stories from September 2020.", "The tweet's mention of a \"major discovery\" appeared to refer to nine ballots, which we covered previously. On Sept. 24, ABC News reported:", "As mail-in voting begins in many states, and President Donald Trump continues to question its validity, one of battleground Pennsylvania's three pivotal counties has been thrust into the national spotlight after a small number of mail-in ballots were found in a trash dumpster outside a board of elections office.", "The U.S. Attorney's Office of the Middle District of Pennsylvania and the FBI's Scranton Office earlier this week said they \"began an inquiry into reports of potential issues with a small number of mail-in ballots at the Luzerne County Board of Elections.\"", "\"At this point we can confirm that a small number of military ballots were discarded. Investigators have recovered nine ballots at this time. Some of those ballots can be attributed to specific voters and some cannot,\" the U.S. attorney's office said in a statement.", "On Sept. 25, ABC News also published that the president had been briefed on the matter by the attorney general, but did not say that it was \"major,\" a \"shock discovery,\" or an \"emergency meeting\":", "A Justice Department official told ABC News Friday that Attorney General William Barr personally briefed President Donald Trump about the DOJ's investigation into a small number of ballots in Pennsylvania that were found to be discarded, prior to the information being made public by a U.S. attorney's office Thursday afternoon.", "President Trump went on to first reveal the investigation in an interview with Fox News Radio, where he, without evidence, argued that it bolsters his baseless claims of widespread fraud in mail-in voting.", "The story also said that seven of the ballots included votes cast for Trump, while the remaining two were \"reinserted into what appears to be their appropriate envelopes, which is why they are unable to determine which candidate the ballots were cast for.\"", "In late October, the Pittsburgh Post-Gazette reported that the nine ballots were discarded not because of fraud, but due to an \"improperly trained contract worker who had been handling mail-in ballots for the county for two days.\"", "On Nov. 7, The Associated Press projected that Joe Biden had been victorious in the 2020 U.S. presidential election. President-elect Biden was already making preparations for a transition into the White House as the outdated and incorrectly framed news continued to be pushed as if it contained fresh and revealing information, not by ABC News, but by third parties.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]