["About this rating", "An image supposedly showing a \"Beware of Artists\" poster issued during the 1950s by Joseph McCarthy, a U.S. senator known for making accusations of treason and spreading fears of communism, is frequently shared on social media:", "The poster reads, \"Beware of artists. They mix with all classes of society and are therefore the most dangerous\":", "The McCarthy era certainly saw its fair share of propaganda posters, and artists — particularly filmmakers — were often the targets of Congressional investigations into \"un-American activities.\" Although the poster displayed above may express the sentiments of that time, its phrasing did not originate in the 1950s.", "This warning about \"dangerous\" artists can actually be traced back to the 19th century. In 1845, Leopold I, King of the Belgians, wrote a letter to Queen Victoria in which he expressed a similar warning against artists (emphasis ours):", "The King of the Belgians to Queen Victoria.", "St. Cloud, 10th October 1845.", "My Dearest Victoria - All you say about our dear Albert, whom I love like my own child, is perfectly true. The attacks, however unjust, have but one advantage, that of showing the points the enemy thinks weakest and best calculated to hurt. This, being the case, Anson, without boring A. with daily accounts which in the end become very irksome, should pay attention to these very points, and contribute to avoid what may be turned to account by the enemy. To hope to escape censure and calumny is next to impossible, but whatever is considered by the enemy as a fit subject for attack is better modified or avoided. The dealings with artists, for instance, require great prudence; they are acquainted with all classes of society, and for that very reason dangerous; they are hardly ever satisfied, and when you have too much to do with them, you are sure to have des ennuis...", "Your devoted Uncle, Leopold R.", "We have not been able to determine who revised King Leopold's words into a more modern phrasing or exactly when posters bearing those words may have been created, but we found no record of such a poster's circulating during the 1950s. The earliest iteration of this image we've found (multiple online versions of this version employ different fonts, colors, and composition) only dates as far back as 2012.", "This \"Beware of Artists\" poster is a modern expression of a political opinion that has been extant since at least the mid-1800s.", "Queen Victoria.   The Letters of Queen Victoria: A Selection from Her Majesty's Correspondence Between the Years 1837 and 1861.\r\n    Longmans, Green, and Company, 1907.", "Schwab, Katherine.   \"The NSA's Newly Declassified Propaganda Posters Are Wild.\"\r\n    Fast Company.   6 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]