["The post says it is “from a vet on Facebook” and states: “PLEASE do NOT give your dogs ice cubes or other frozen items in the heat to cool them down! Ice cubes do not cool dogs down!”", "Identical versions of the publication were shared by concerned individuals like in this post and by pet care businesses here and here.", "Lori Tarbett, of the Canadian Veterinary Medical Association told AFP by email: “A few ice cubes are fine for normal, healthy dogs. Of course, you would want to limit the size (choking hazard) for any dog, as well as the amount. And it is important not to force a dog to consume an ice cube.”", "The post explains that ice cubes are dangerous for dogs in hot weather because “the canine anterior hypothalamus is triggered to warm up the body because it recognises something icy cold has been absorbed, and subsequently the bodily temperature rises to compensate for this.”", "“This is definitively pseudo-science,” Éric Troncy, animal pharmacology expert at Université de Montréal, told AFP in an email.", "Troncy pointed out that although a part of the anterior hypothalamus, the preoptic region, does serve a temperature regulation purpose in dog brains, it is not anatomically connected to the pharynx-oesophagus through which ice would circulate.", "Instead, “temperature changes are detected by thermal nervous receptors”, on the skin or on viscera and vessel walls, “which then send the information to the central nervous system before it is sent to the thermoregulatory center (in the hypothalamus),” Troncy added.", "Troncy told AFP he thinks the hoax could come from the fact that pet owners are advised not to submerge an overheating dog into ice cold water, which could aggravate cardiovascular disturbances that occur when a dog overheats.", "According to Tarbett: “The main thing is not to let your dog overheat. Provide lots of water, which they use to cool by evaporation (panting). And ensure there is ample shade for your dog if s/he is outside.”", "In the UK, the Royal Society for the Prevention of Cruelty to Animals does advise dog owners to put ice cubes in the canines’ water bowls in order to help them cool down.", "In the United States, the Humane Society recommends letting dogs suffering from heatstroke “drink small amounts of cool water or lick ice cubes,” while taking them to a veterinarian.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]