["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Barack Obama called on the nation to \"end the tyranny of oil\" in a July 11, 2008, speech on energy security. He said it's an issue we've been talking about for decades.", "\"We have heard promises about energy independence from every single U.S. president since Richard Nixon,\" Obama said in Dayton, Ohio. \"We've heard talk about curbing our use of fossil fuels in nearly every State of the Union address since the oil embargo of 1973.\"", "The first part sounded true enough — what president hasn't waxed poetic about liberating us from foreign oil? But the latter line about fossil fuels struck us as the sort of thing speechwriters might throw in without fact-checking, on the assumption that no one else would be crazy enough to do so.", "They didn't count on PolitiFact. We scoured the past 35 State of the Union speeches for \"talk about curbing our use of fossil fuels.\" It was about as fun as a root canal. But it prompted us to put together\n\nthis quiz\n\nshowcasing presidents' State of the Union chestnuts. And it enabled us to tell you this about Obama's claim:", "It's true that the oil embargo of 1973 — when Arab countries cut oil exports to punish the West for supporting Israel in the Arab-Israeli war — prompted serious concern among U.S. leaders about our reliance on oil.", "Richard Nixon kicked off his 1974 State of the Union speech by commenting on how it was the first of its kind to feature energy as the No. 1 priority. He went on to say that even if the embargo is lifted, \"conservation will continue to be necessary.\" And private enterprise will \"develop the new resources, the new technology, the new capacity America will require for its energy needs in the 1980s.\"", "In our view, that constitutes \"talk about curbing our use of fossil fuels.\" (Fossil fuels are fuels like coal, oil and natural gas that come from the fossilized remains of plants and animals).", "Gerald Ford picked up the thread, calling in 1975 for more synthetic fuels, home insulation, efficient cars and the like. And in 1976 he advocated \"technology to capture energy from the sun and the Earth.\"", "Jimmy Carter was an avid conservationist, and talked at length about the subject during his State of the Union speeches, such as in 1981 when he endorsed technology such as \"photovoltaics, which generate energy directly from the sun.\"", "Ronald Reagan? Not so much. His first three State of the Union speeches had only glancing references to the environment, and his last four had nothing even remotely related to curbing fossil-fuel use.", "President George H.W. Bush had just one reference to new energy sources in his State of the Union addresses, and Bill Clinton omitted the subject from his in 1994 and 1995.", "Since then, every State of the Union has included talk of new ways to power our cars and homes, culminating in the President George W. Bush's call this year to trust American researchers and entrepreneurs to \"pioneer a new generation of clean energy technology.\"", "The bottom line: 23 of the 35 State of the Union speeches since the Arab oil embargo contained endorsements of the idea of curbing the country's use of fossil fuels. (That's being generous, and including, for example, Clinton's endorsement in 1993 of an energy tax because it \"promotes energy efficiency.\")", "The 12 State of the Union addresses in '82, '83, '84, '85, '86, '87, '88, '89, '90, '92, '94 and '95 — though some had references to air pollution — could not reasonably be considered to contain any \"talk about curbing our use of fossil fuels.\"", "We should note that the first part of Obama's quote — that every president has made promises about energy independence — was startlingly accurate. State of the Union speeches were rife with lines like this one, from Richard Nixon, in 1974:", "\"Let this be our national goal: At the end of this decade, in the year 1980, the United States will not be dependent on any other country for the energy we need.\"", "But what we are evaluating is Obama's claim that \"nearly every\" State of the Union speech since 1973 included talk about curbing fossil fuels. And the fact is, about two-thirds of the speeches in question contained a reference. And that is substantial, but not \"nearly every.\"", "We rule Obama's claim Mostly True.", "UPDATE:\n\nIn our original posting of this item on July 18, 2008, we mistakenly attributed a 1976 quote from President Gerald Ford to President Jimmy Carter. The item was corrected on July 21, 2008.", "Cleveland Plain Dealer,\n\nTranscript of Barack Obama's Speech in Dayton\n\n, July 11, 2008, accessed July 16, 2008", "ThisNation.com,\n\nState of the Union Addresses\n\n, accessed July 16, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]