["Diabetes is a growing concern for Nigeria, a drug multinational executive said ahead of a recent summit on the chronic disease in Lagos.", "“About three years ago South Africa and Ethiopia tended to have more diabetes than Nigeria,” said Dr Philip Ikeme, the medical director of the Nigeria, Ghana and eastern African arm of pharmaceutical giant Sanofi. Among Sanofi’s products are the insulin shots used to manage diabetes.", "“Now Nigeria has the highest incidence of diabetes in sub-Saharan Africa.” (Note: Incidence refers to the number of new cases in a given period, say a month or a year, while prevalence is the total number of people in a population with a disease in a specific time period.)", "“In terms of actual numbers we are looking at five million people whom we know have diabetes,” Ikeme said, adding that the actual number was “much more”.", "Does the data support Ikeme’s claim?", "We examined the numbers.", "\"Nigeria has the highest incidence of diabetes in sub-Saharan Africa.\"", "In support of his claims, Ikeme directed Africa Check to two studies on diabetes in Nigeria. One, a 2008 study, cited WHO estimates that 1.7 million Nigerians were living with diabetes while the other put the number at 4 million in 2014. “I fear the [media] reports may be slightly overrepresented as the publications indicate that about 4 million are suggested to have diabetes and 70%-80% of these remain undiagnosed. The prevalence of known diabetes is suggested at 1.7 million Nigerians.”Ikeme specifically spoke of new cases of diabetes in Nigeria (incidence) at the media briefing. But the World Health Organisation’s most recent report on diabetes does not include specific data on new cases in Nigeria or sub-Saharan Africa, saying that data is “generally lacking.” There isn’t any such diabetes data from the global health agency or any other source, Dr Gojka Roglic, who is with the WHO’s department for non-communicable diseases, told Africa Check.WHO noted that in 2015, only 17% of countries in sub-Saharan Africa had a diabetes registry.“However, no data is available on incidence for any country in Africa, so the claim is unsubstantiated,” Roglic added.", "\"Over five million Nigerians are living with either the type 1 or type 2 diabetes.\"", "The World Health Organisation’s most recent data on Nigeria estimates a prevalence of 4.3% in adults (18 years and older) for the years 1980 to 2014, the health agency’s Dr Gojka Roglic told Africa Check. “Given that there are about 90 million adults in Nigeria by United Nations 2015 estimates, the number of adults with diabetes comes to around 3.9 million,” he said. The prevalence in Nigerian children isn’t known, but it wouldn’t \"substantially change the total\", Gojka added.According to the International Diabetes Federation, an estimated two thirds of people with diabetes in Africa are undiagnosed. In Nigeria the last nationwide survey on the burden of diabetes was in 1997.\"Because we have poor routine health data collation in Nigeria those [IDF and WHO] estimates are not really reflective of what is happening in the country,” Dr Davies Adeloye, who is with the department of demography and social statistics at the Covenant University in Ogun State told Africa Check. This informed an analysis of 42 studies done on diabetes in Nigeria between 1985 and 2016 in which Adeloye is a co-author. The research, published in October 2017, found that about 4.7 million Nigerians aged between 20 and 79 years had type 2 diabetes. It would thus be correct to say more than five million Nigerians have the two common types of diabetes, said Adeloye.“Even from the IDF and WHO estimate, 80% of that estimate goes for type 2 diabetes. That means there could be an interval of 20% for other types of diabetes,” he explained. “So if 4.7 million is 80%, and if we want to model, we could say more than 5 million Nigerians are living with diabetes.\"", "Please complete this form to receive the HTML sharing code.", "We examine three claims in a Cape Talk interview with the National Sea Rescue Institute on world drowning prevention day.", "Covid has trained a spotlight on causes of death and how deaths are recorded across the world. We disentangle what paperwork has to be filed...", "In a widely listened-to podcast, the BBC made the startling claim that more than a million Africans die each year on the continent’s roads. ...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]