["About this rating", "The idea that women living or working in proximity to one another synchronize their menstrual cycles is particularly persistent, and has now become accepted as conventional wisdom.", "However, it's a relatively new idea — it has its origins in a survey conducted on a population of college students at an all-female college published in Nature in 1971 — and was based on a small population monitored only for about eight menstrual cycles. It found that there was increased synchronization between roommates and close friends:", "There was a significant increase in synchronization (that is, a decrease in the difference between onset dates) among roommates, among closest friends and among roommates and closest friends combined. The increase in synchrony for roommates did not differ significantly from the increase for closest friends.", "There were then, and are now, many biologically-informed explanations for such a phenomenon, referred to in the scientific community as “socially mediated synchrony”, discussed by University of Oxford anthropologist Alexandra Alvergne:", "There have been many evolutionary arguments for why females would synchronise the timing of sexual receptivity. These theories [...] assume that synchrony would serve to maximise the reproductive success of females (and also sometimes males). The most popular one is that it enables females to minimise the risk of being monopolised by a single dominant male, and thus make it easier to engage in polyandry. [...]", "In this vein, a meta-analysis of 19 primate species found that the degree to which a dominant male would father all offspring was inversely related to the degree to which the females synchronised their cycles. In other words, a dominant male had less control over reproduction if all females were receptive at the same time.", "The method by which humans could signal each other's cycle to nearby females, similarly, is not without broad biologic grounding, as laboratory experiments suggest that humans can unknowingly react to the pheromones of others in a way that can affect menstruation. The presence or absence of socially mediated synchrony in humans has been investigated, with varying degrees of scientific and quantitative rigor, in a variety of social contexts including roommates, lesbian couples, co-workers, close-friends, and various combinations of these social relationships, ever since.", "While some studies do demonstrate the presence of menstrual syncing, these small scale studies have been called into question. The literature provides far from conclusive evidence for the existence of menstrual synchrony at all, and increasingly researchers are finding methodological and theoretical flaws in the work with suggesting its existence. This was discussed in a 2006 study titled “Women Do Not Synchronize Their Menstrual Cycles” which, true to its title, found no evidence for synchrony:", "Since the publication of the [1971 Nature] study, a number of studies have been conducted, with some apparently replicating the finding of synchrony, while others failed. Subsequent methodological critiques have argued that serious errors occurred in studies reporting synchrony. Thus, while menstrual synchrony among women is widely believed to occur and argued to be adaptive, its very existence is scientifically controversial.", "Another 2006 study attempted to replicate the results of the first 1971 study with less problematic statistical approaches, finding:", "Women within units (pairs and triples) did not synchronize their menstrual cycles. No statistically significant changes were found in any of the comparisons made, and the mean differences observed for all comparisons were close to the expected mean difference of 7.5 days. [...]", "The negative results of this study add to the growing body of evidence undermining the existence of menstrual synchrony in human females. Menstrual synchrony has never been demonstrated in any unindustrialized, natural fertility, hunter-gatherer population.", "From a mathematical perspective, most critiques of studies purporting to find positive results focus on the demonstrable likelihood that perceived synchrony happens by chance or by viewing data through a biased lens. A 1992 review argued that the studies demonstrating a menstrual syncing have used methods that “increase the probability of finding menstrual synchrony in a sample.” This study used a mathematical proof to demonstrate that the trends demonstrated in these studies are likely based on chance alone:", "[These studies] assume that a decrease in onset differences between pairs of subjects over the same number of onsets is an indication of menstrual synchrony.  At the beginning of the observation period, approximately one-half of the pairs of a sample have onset differences that are decreasing over the same number of menstrual cycles. [...]", "Thus, over the first several onsets, whether the onset difference of randomly paired subjects remains constant, increases, or decreases is due to the chance factors of the subjects' relative mean menstrual cycle lengths and the order of their initial onset dates.", "A 1997 study utilized a comparably large amount of data gathered from women of the Dogon hunter-gatherer society in Mali, finding no evidence of synchrony. This population was selected because evolutionary explanations for synchrony would, many biologists argue, best be tested in a \"natural fertility\" population in which \"couples do not attempt to control their fertility in a parity-dependent [based on how many pregnancies a woman has had] fashion\", as these were the conditions under which human reproductivity evolved:", "The lack of empirical support for menstrual synchrony among the Dogon and in Western populations does not establish the species wide absence of the phenomenon, but it shifts the burden of proof onto those who argue that the phenomenon exists.", "While later studies have also failed to empirically demonstrate it exists, the issue was brought back into the limelight when the period-tracking App \"Clue\" teamed up with Oxford anthropologist Alex Alvergne (cited earlier). On 9 March 2017, they described a pilot study on their website (which was not published as a peer-reviewed study) based on data collected in the app:", "Thanks to our global community tracking every day [...] we’re able to test these commonly held beliefs with data, so we started an investigation to see if cycles really sync.", "We reached out to Clue users and asked if they thought their cycles had been syncing with someone (who also uses Clue). [...] We received over 1,500 responses and narrowed it down to 360 pairs with at least three cycles over a similar time period that we were able to review [who did not use hormonal birth control].", "We analyzed a minimum of three consecutive cycles for each of those pairs and found that 273 pairs actually had a larger difference in cycle start dates at the end of the study than at the beginning of the study. Only 79 of the pairs behaved the opposite way, with the gap between cycle start dates narrowing over the course of the study.", "Though not as statistically involved an analysis as some of the published studies, this report does make use of a large dataset and finds, again, no evidence to support synchrony in menstrual cycles. In a piece for The Conversation on the topic, written before the Clue post, Alvergne said:", "As disappointing as it may be, it seems that there is now overwhelming evidence to suggest that menstrual synchrony in humans is no more than a methodological artifact from one study that has since turned into an urban myth.", "An additional aspect may be attributed, according to the author of the 1997 study, to human bias:", "Given the paucity of evidence, it is surprising that belief in menstrual synchrony is so widespread.", "I suggest that this belief arises, in part, from a popular misconception about how far apart one would expect the menstrual onsets of two women to be by chance alone. If two women both have 30-day menstrual cycles, the maximum they can be out of phase is 5 days, and, on average, their onsets date expected to be 7.5 days apart.", "Fully half the time then onsets should be closer than 7.5 days. If menstrual synchrony among friends has psychological appeal, then onsets that happen to be close together may make a greater impression than onsets that happen to be disparate.", "We rate this claim as unproven due to an increasing lack of scientific evidence demonstrating that menstrual synchrony exists at all, but at the same time, we allow that the topic is complicated by myriad confounding variables.", "McClintock, Martha, K.   \"Menstrual Synchrony and Suppression.\"\r\n    Nature.   22 January 1971.", "Alvergne, Alexandra.   \"Do Women’s Periods Really Synch When They Spend Time Together?\"\r\n    Nature.   14 July 2016.", "Stern, Kathleen, and McClintock, Martha, K.   \"Regulation of Ovulation by Human Pheromones.\"\r\n    Nature.   12 March 1998.", "Yang, Zhengwei, and Schank, Jeffrey, C.   \"Women Do Not Synchronize Their Menstrual Cycles.\"\r\n    Human Nature.   December 2006.", "Ziomkiewicz, A.   \"Menstrual Synchrony: Fact or Artifact?”\r\n    Human Nature.   December 2006.", "Wilson, H. Clyde.   \"A Critical Review of Menstrual Synchrony Research.”\r\n    Psychoneuroendocrinology.   November 1992.", "Strassmann, Beverly I.   \"The Biology of Menstruation in Homo Sapiens: Total Lifetime Menses, Fecundity, and Nonsynchrony in a Natural-Fertility Population.”\r\n    Current Anthropology.   February 1997.", "HelloClue.com.   “Do Menstrual Cycles Sync? Unlikely, Finds Clue Data.\"\r\n    19 March 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]