["The claim was posted on this Naver Cafe with more than 70,000 members on November 3, 2020.", "The post's Korean-language title translates to English as: “[NEWS] Bicycles allowed on Seoul buses”.", "It features seven screenshots of a news report by South Korea’s TBS television network. The strapline in the first screenshot reads: “People can board buses with bicycles from the 26th”.", "Some of the comments on the post expressed discontent at the local government’s implementation of the scheme.", "One user wrote: “This is difficult in a country like ours where there’s a culture to do things as quickly as possible… Seoul Metropolitan Government seems to be implementing many weird policies lately”", "Another commented: “This looks problematic! They’re implementing this without a trial run!”", "A similar claim was also shared here, here and here on Facebook, here on the South Korean blog Tistory, and here on South Korea’s Naver Blog.", "The claim, however, omits important context; the scheme was introduced for a two-month trial period and only covers five bus routes in the city.", "Original video", "A reverse image search found the screenshots in the misleading post match this video published on the YouTube account of South Korean broadcaster TBS, dated October 26, 2020.", "The report states, in part: “Seoul City has started a test scheme that allows bicycles on buses, following its taxi and subway schemes.", "“The trial will run across five bus routes that pass the Han River and other key tourist spots.”", "The report also features a soundbite from Koh Ok-hui, an official overlooking bus policies at the Seoul Metropolitan Government, who says: “There may be complaints, because there is a chance of bus delays. We will look into this and take into consideration when discussing future expansion plans”.", "A closer examination of the TBS video also revealed that its top strapline indicated the scheme was temporary: “‘Bicycles on buses’, a test run”.", "Below is a screenshot of the TBS video, with the strapline circled in red by AFP:", "Local government statement", "AFP located Seoul Metropolitan Government’s statement on the announcement of the new scheme here on its website, dated October 22, 2020.", "Part of the Korean-language statement translates to English as: “The Seoul Metropolitan Government announced on October 26 that it will run a two-month test scheme of buses fitted with bicycle stands. Cyclists who board these buses can either use the bike stands on the back of these buses or board with their bicycles.", "“This test run will first apply to five bus routes circling popular tourist spots, such as the Han River, Cheonggyecheon stream and the Seoul World Cup Stadium. For the convenience of those involved it may be used during all hours except during rush hour on weekdays and on all hours on weekends.”", "It added that the city will seek feedback from the public to “assess possible expansion into other routes from early 2021”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]