["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ralph Reed said “social science is irrefutable” that children are better off being raised by a mom and a dad.", "On ABC’s Easter Sunday edition of This Week, host Martha Raddatz discussed the intersection of religion and politics with her guests.", "\"Just a few months after taking office, Pope Francis spoke out on the issue of homosexuality, saying, ‘If they accept the Lord and have goodwill, who am I to judge them?’ \" she said. \" ‘They shouldn't be marginalized, the tendency to homosexuality is not the problem. They're our brothers.’ \"", "Faith and Freedom Coalition founder Ralph Reed told Raddatz he doesn’t support gay couples raising adopted children.", "\"This is about what's best for children here in the United States. And the social science is irrefutable,\" Reed said. \"And it is that a child who grows up in a home without the mother and father present and they both play very unique procreative, nurturing and socializing role, they're nine times more likely to end up dropping out of high school. They're five times more likely to end up in poverty. And they're three times more likely to end up addicted to drugs and alcohol.\"", "PunditFact wanted to know what social science has to say about the effects gay parents have on children compared to straight parents.", "The social science statistics Reed called \"irrefutable\" actually have nothing to do with gay couples raising kids. Instead, they’re focused on the effects of children who grow up without a father in a one-parent household. Put another way, the studies focus on the quantity of parents and not their gender.", "Reed’s office pointed us to his book, as well as a Brookings Institution report that says parents who graduate from high school and bear children within marriage have a 2 percent chance of living in poverty. But neither the study nor his book draws any comparison between gay and straight marriages. In fact, it makes no mention of gay marriages.", "Other research often cited by gay parenting critics, like Sara McLanahan’s Growing Up With a Single Parent, similarly doesn’t include any information on gay parenting, specifically.", "Again, the critique is focused on having one parent present versus two. We decided not to investigate further the specific stats Reed cited once we realized they weren’t measuring what he said they were.", "Comparisons like Reed’s are \"a complete misuse of the research,\" said Judith Stacey, a New York University sociologist.", "We did find one study funded by conservative organizations as showing gay parents are worse than straight ones, but it’s been denounced by the American Sociological Association, the researcher’s own university and many reputable sociologists. In conducting the study, Mark Regnerus loosely defined same-sex couples and, in doing so, only spoke with two children who were actually raised by gay parents.", "Research is still limited, but many reputable studies so far have concluded that children of gay parents, generally speaking, are just as well off as children of straight parents. What’s more important is the number of parents a child has, experts told us.", "\"Kids are better off with two parents,\" said Andrew Cherlin, a sociology professor at Johns Hopkins University. \"But we don't have much evidence that those parents must be of the opposite gender.\"", "Our ruling", "Reed said there’s \"irrefutable\" social science to show that children are better off being parented by a mother and father. That’s not right. What studies really show is that children are better off with two parents. Those studies do not focus on gender.", "All reputable research so far indicates that children brought up by gay parents are just well off as those brought up by straight parents.", "We rate Reed’s statement False.", "American Sociological Review, \"(How) does the sexual orientation of parents matter?\" April 2001", "Australian Institute of Family Studies, \"Same-sex parented families in Australia,\" Jan. 2, 2014", "Brookings Institution, \"Combating poverty: understanding new challenges for families,\" June 5, 2012", "Current Directions in Psychological Science, \"Children of lesbian and gay parents,\" 2006", "Email interview with Joy Creaseman, Faith and Freedom Coalition marketing director, April 22, 2014", "Journal of Marriage and Family, \"How does the gender of parents matter?\" February 2010", "Email interview with Andrew Cherlin, Johns Hopkins University sociology professor, April 21, 2014", "New York Times, \"Debate on a study examining gay parents,\" June 11, 2012", "Pediatrics, \"Promoting the well-being of children whose parents are gay or lesbian,\" March 20, 2013", "Phone interview with Judith Stacey, New York University sociology professor, April 21, 2014", "Social Science Research, \"How different are the adult children of parents who have same-sex relationships? Findings from the New Family Structures Study,\" July 2012", "University of Melbourne, \"The Australian study of child health in same-sex families: interim report,\" accessed April 22, 2014", "University of Texas at Austin, \"Statement from the chair regarding professor Regnerus,\" April 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]