["About this rating", "On 27 June 2018 the Facebook page Uncle Sam's Misguided Children shared the photograph reproduced below, purportedly showing women \"screaming\" at United States President Donald Trump, but somehow through their vaginas:", "Text on the image read:", "Not a joke.", "They gathered to scream at Trump through their vaginas.", "These are the people who want to control the government and teach your kids.", "Predictably, no documentary information was presented to support the claim, and Facebook users were both expected to — and did — take the explanation on its face. However, a reverse image search indicated that the image had been circulating since at least February 2016, well before President Donald Trump was elected.", "A number of backstories were previously attributed to the photograph. In February 2018, YouTube videos and blogs claimed that the images showed \"a new trend\" known as \"raising your skirt for diversity\":", "I follow a few accounts on Instagram that post hilarious feminist stuff (or, I suppose, anti-feminist stuff), and on one of those accounts today, I came across this:", "[Image.]", "Obviously, I had to investigate to see if Raising The Skirt is an Actual Thing, which is what led me to the sourcelink. And you guys, their About page is positively insane. It says, in big bold letters across the top, \"Reclaim your c*nt. Reclaim our c*nt.\" Only without the polite asterisks.", "The disgusting feminists of the world have officially outdone themselves. They've now launched a new project dubbed \"Raising the Skirt,\" which calls on women to perform a sick act in public.", "Case in point: Some of the more enthusiastic social justice warriors of the feminist movement have begun a project called \"Raising the Skirt,\" aimed at \"celebrating the diversity of vaginas.\" This is not a drill. There are actual women gathering with the sole purpose of raising their skirts, exposing their most intimate part to complete strangers. And they call it a celebration.", "At that point, the photograph was at least two years old, and had circulated once again on Reddit in July 2017:", "Originally reported articles about the \"new feminist trend\" of skirt-raising dated back to September 2015, but did not include the photograph seen above:", "\"Raising the Skirt\" by artist Nicola Canavan is exploring [women's relationships with their genitals] in her series of portraits of everyday women, as they share the beauty of their bodies, while exploring their relationships with their vaginas and what they symbolise to them.", "A photograph labeled as \"feminists ... screaming through their vaginas\" at President Trump was taken in or earlier than February 2016, and was later attributed to artist Nicola Canavan's \"Raising the Skirt\" series of portraits. Canavan's work was not a \"feminist trend,\" but rather a photography project undertaken on a relatively small scale.", "We contacted Canavan, who confirmed that this is one of her images. Further, we found no evidence that either skirt-raising or vagina-screaming had become a popular activity for any reason.", "Sinclair, Leah.   \"This Artist Is Pushing For Recognition Of Vagina Diversity.\"     Dazed.   15 September 2015.", "Chicks on the Right.   \"Raising Your Skirt To Celebrate Vagina Diversity Is a Thing Now.\"     20 February 2018.", "Mad World News.   \"Disgusting Feminists Launch 'Raise the Skirt' Project, Want Women To Do SICK Act in Public.\"     20 February 2018.", "Raising The Skirt.   \"About.\"     Accessed 27 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]