["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during an Independence Day celebration in front of the Lincoln Memorial in Washington, Thursday, July 4, 2019. (AP Photo/Susan Walsh, Pool)", "Posting a photo of people packed on the National Mall on the Fourth of July, Breitbart wrote on its Facebook account that \"the left rooted against\" President Donald Trump’s \"Salute to America.\"", "\"The Establishment Media ignored it,\" the July 5 post continues, \"but the people showed up anyway and had a blast!\"", "The words: \"Happy birthday, America! Love, We the People,\" appear in red type over the image.", "Commenters voiced support for the post, including one who said: \"Can you believe the lamestream media deliberately tried to hide this beautiful celebration from the American people? If you didn’t see it before, you definitely see it now; they are the enemy of the people!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Breitbart didn’t immediately respond to a message PolitiFact sent asking about the post.", "We’ve already fact-checked claims that the event drew a small crowd; photos from that day tell a different story.", "For this claim, we started by looking for coverage by the New York Times. Searching for \"Fourth of July\" and \"Trump,\" we found the following headlines on or before July 5 (among others):", "•\"Trump announces Fourth of July ‘Salute to America’ at the Lincoln Memorial,\" by Feb. 24, 2019", "•\"Trump says tanks will be on display in Washington for July 4,\" July 1, 2019", "•\"Tanks already in Washington for Trump’s Fourth of July event,\" July 2, 2019", "•\"Washington prepares for July 4 spectacle, starring and produced by President Trump,\" July 3, 2019", "•\"With flyovers and flags, Trump plays M.C. for the Fourth,\" July 4, 2019", "•\"Two Americas, celebrating separately in one place,\" July 4, 2019", "•\"Trump sets off fireworks of a different sort with Fourth of July speech plan,\" July 5, 2019", "That’s among other media coverage from outlets like CNN, Reuters, Bloomberg, The Guardian and The Washington Post.", "On July 10, Vulture reported on the 6.4 million people who watched the festivities on TV. Most of those were tuned into Fox News, which had 4.9 million viewers during the hour, according to Nielsen ratings. CNN mixed coverage of Trump’s speech with analysis and drew 1.5 million viewers, according to Vulture.", "It notes that NBC had a \"politics-free presentation of the Macy’s Fourth of July fireworks/concert,\" before airing a condensed version of the special at 10 p.m. MSNBC, meanwhile, aired \"encores of the first Democratic-primary presidential debates.\"", "Before the big event, some publications advised readers on how they could watch the celebration. Newsweek reported that CBS News, C-SPAN and Fox News would carry it live and streaming elsewhere online. Deadline reported that PBS was also planning to air it live while \"the broadcast networks will rely mostly on their streaming channels for Trump’s portion of the event.\"", "Still, there was plenty of other coverage of the event.", "We rate this Facebook post False.", "Facebook post, July 5, 2019", "PolitiFact, \"Posts saying Trump’s July 4 event drew small crowd are wrong,\" July 9, 2019", "The New York Times, \"Two Americas, celebrating separately in one place,\" July 4, 2019", "The New York Times, \"Trump announces Fourth of July ‘Salute to America’ at the Lincoln Memorial,\" Feb. 24, 2019", "The New York Times, \"Washington prepares for July 4 spectacle, starring and produced by President Trump,\" July 3, 2019", "The New York Times, \"Trump sets off fireworks of a different sort with Fourth of July speech plan,\" July 5, 2019", "The New York Times, \"Tanks already in Washington for Trump’s Fourth of July event,\" July 2, 2019", "The New York Times, \"Trump says tanks will be on display in Washington for July 4,\" July 1, 2019", "The New York Times, \"With flyovers and flags, Trump plays M.C. for the Fourth,\" July 4, 2019", "Vulture, \"People actually watched Trump’s Fourth of July special,\" July 10, 2019", "Newsweek, \"Donald Trump’s ‘Salute to America’: Where to watch live stream of president’s speech at Lincoln Memorial, parade routes, fireworks, and tanks on display,\" July 4, 2019", "Deadline, \"Fox News will fly biggest flag for Donald Trump’s ‘Salute to America’ coverage — how to watch,\" July 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]