["The images of Congress president Rahul Gandhi and his BJP counterpart Amit Shah filing their nomination papers for the 2019 Lok Sabha elections is viral on social media. The two photographs, juxtaposed together, are being shared with the caption – “the party with a difference”. By looking at the juxtaposition, it would seem as if Amit Shah stood up while handing over his nomination papers with the EC official sitting on the chair, while Rahul Gandhi was seated while handing over his nomination papers with the EC official having to stand-up to receive them.", "Both party #President @RahulGandhi and @AmitShah , see the difference pic.twitter.com/LaxIgdtOsV", "— Ashish Ahir (@ashishahir) April 13, 2019", "Several BJP party members and leaders have circulated the collage on Twitter. Their bio lists their positions within the party as – BJP Karnataka general secretary N Ravi Kumar, BJP Maharashtra youth secretary Raj Dixit, BJP Gandhinagar mahila wing secretary Anita Jayesh Patel and BJP Mumbai north general secretary Umesh Motwani.", "The photograph of Rahul Gandhi viral on social media represents the Congress president filing his Lok Sabha nomination papers from Amethi. A quick glance at the image gives the impression that the Congress president was seated while handing his nomination papers, with the EC official having to stand-up and reach out to accept the papers. However, available videos of the event throw a completely different light.", "Gandhi filed his papers at the district collector’s office in Amethi. He seems to be seated while doing so due to the height of the collector’s table. The surface of the desk reached up to Gandhi’s chest, making it appear as if he was seated, when, in fact, he was standing. Upon viewing the act from a different angle, it is clear that Gandhi was not sitting.", "A misleading visual perception was widely circulated to portray Rahul Gandhi as disrespectful and Amit Shah’s as courteous. Since the start of the elections, Rahul Gandhi has also been targeted with photoshopped images and manufactured newspaper clipping.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]