["The image has been viewed hundreds of times after being posted here on Facebook on June 6.", "It purports to show a close-up shot of a teary woman during a May 31 TV interview by Hong Kong broadcaster TVB, whose logo can be seen in the top right-hand corner.", "The Chinese text written in a red vertical column next to the woman translates to English as: “Tiananmen Mothers”.", "A purported on-screen description written in traditional Chinese states: “I am 55 years old this year. 30 years ago, my then-20-year-old son was shot dead by the People’s Liberation Army at Tiananmen Square”.", "The traditional Chinese-language caption of the Facebook post accuses the woman of lying, as she would have been only five-years-old when she had her “son”, adding that she represents the “low intelligence” of anti-Chinese Communist Party and pro-Hong Kong/Taiwan independence groups.", "\"Tiananmen Mothers\" is an activist group formed by the families of those killed during the Chinese government’s crackdown on the Tiananmen Square protests in 1989. Here is an AFP article about the group.", "The photo was also shared alongside similar claims on Facebook here, here and here, and on Twitter here, here and here.", "The misleading claim circulated online following the 31st anniversary of the 1989 Tiananmen Square crackdown on June 4, 2020, when tens of thousands of people in Hong Kong defied a ban on public gatherings to commemorate victims of the deadly crackdown, as reported by AFP here.", "However, the claim is misleading; the image is doctored from a 2019 TV interview with a woman who lost her husband in the crackdown.", "A keyword search on Google found the image published more than a year ago in this May 31, 2019 news broadcast on the TVB website.", "The video report, titled “Family of June 4 incident victims, witnesses of history, will not allow the truth to be buried”, features four women who lost family members in the 1989 crackdown.", "The image in the misleading post corresponds with the one-minute 37-second mark of the TVB video report, but without any on-screen text about the woman’s age or her “son”.", "The woman, named Zhang Yanqiu, says in the interview that her husband was killed during the 1989 crackdown, leaving behind a then seven-year-old daughter.", "Below is a screenshot comparison of the image in the misleading posts (L) and the TVB footage at its one-minute 37-second mark (R):", "The misleading claim has also been debunked by Hong Kong fact-checking organisation Kauyim Media here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]