["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida House Speaker Richard Corcoran sharpened his ax against economic incentives by calling out companies with state deals by name.", "Corcoran singled out aerospace and defense company Lockheed Martin during a speech at the Panhandle Tiger Bay Club on March 17.", "Corcoran told a story about the company as an example of how easy it is to walk back ambitious job goals prescribed in state incentive contracts.", "\"I say, I promise you 305 jobs, and then I come back to you and say, ‘Hey, I'm not close on the jobs. Can you help me out?’ You know what they do? ‘No problem, we'll amend your contract. How many jobs can you deliver?’ Six. ‘Fine. Now, the contract says you will deliver six jobs.’ And then we go out and tout it community to community as a success.\"", "Corcoran continued: \"That’s a true story, Lockheed Martin.\"", "We wondered if there is evidence that a Lockheed Martin contract was amended to reduce the number of new jobs that needed to be created from 305 to just six.", "Corcoran’s story has some truth but oversimplifies what happened.", "What the state recommended at first", "Lockheed Martin has multiple facilities throughout the state, including in Orlando and Ocala, and is involved in more than one job incentive project on job deals, according to state data.", "Corcoran was referring to a $4 million incentive deal for a facility in Oldsmar, located in northern Pinellas County.", "In September 2012, the Florida Department of Economic Opportunity, an agency created in 2011 to oversee incentive programs, informed the Legislature about a proposed deal between Enterprise Florida and Lockheed Martin to bring jobs to Pinellas County. (The DEO has to notify the Legislature when an incentive deal of this kind worth more than $2 million is being considered.)", "DEO provided the Legislature the first outline of the deal for Lockheed Martin's Pinellas facility, which was signed by Gov. Rick Scott.", "Part of the plan hinged on whether Lockheed Martin would win the bid for a contract to develop and build the U.S. Navy’s new Air and Missile Defense Radar, or AMDR.", "Lockheed Martin officials had said its other facilities in the Northeast were also in competition with Oldsmar for the gig.", "The outline said: \"If Lockheed Martin wins the AMDR contract and chooses to complete the work in Pinellas County, the company will create 305 new and retain 554 full time jobs over the life of this project.\"", "Based on the document, Lockheed Martin and the DEO wanted to use the extra cash to renovate the Oldsmar facility and invest more in manufacturing equipment. This would make the facility more competitive with the other companies bidding for the defense contract.", "\"Anything that Lockheed Martin can do to help make the project more economically feasible helps to create a more competitive bid,\" reads the 2012 document.", "The recommendation was for the state to award the company $4 million in one chunk once the facility held 726 jobs, showed a $14 million capital investment, and maintained an average wage of $59,000.", "Corcoran’s team said the draft of the project was presented to the Legislature as a done deal.", "But that’s not how the DEO sees it.", "305 jobs taken out before final contract", "DEO press secretary Morgan McCord said the agency informed the Legislature during the negotiation period that the recommended job metrics were being changed.", "Those revisions came about a month before the contract was signed and executed.", "McCord sent over a copy of an email sent to legislative leadership and budget staff on April 16, 2013, that went over the changes.", "That email shows DEO and Lockheed Martin agreed to revise a projected job creation and payment schedule.", "The result was a new goal: the retention of 560 jobs — just six more than the earlier draft — for an average of 700 jobs by 2022.", "Why the change? DEO officials still believed Lockheed Martin was in the running for the defense contract, but the company would not need to ramp up its new jobs as high as originally thought. It would be hard to \"precisely estimate\" job levels every year over the term of the agreement, the contract said.", "\"As a result, the company has requested that it set a job target number (560) to be reached at a minimum each performance year to qualify for the closing fund award,\" reads the emailed explanation for the changes in payment conditions.", "Here's more detail:", "Here's what Corcoran was calling out: the new minimum target is 560 jobs a year instead of 554. That's six more jobs.", "Lockheed Martin doesn’t necessarily have to meet the 700-job average every year in order to get state dollars; it just needs to hit the 560-job minimum.", "The DEO document said the overall goal of the project \"remains the same: the retention and expansion of the company's manufacturing operations in the City of Oldsmar.\"", "Scott approved the revisions. The contract was finalized on May 30, 2013.", "Lockheed Martin didn’t find out until late October 2013 that it wasn’t awarded the AMDR contract. (It went to Raytheon.)", "An amended contract was approved May 26, 2015 to reflect the fact that Lockheed Martin did not win the defense contract.", "This change did not alter job creation requirements, wage requirements, capital investment or return on investment under the final terms of the contract.", "Those stipulate that in order to get the first seven $500,000 payments from the state between 2016 to 2022, Lockheed Martin must retain 560 jobs every year.", "In order to get the final $500,000 payment, it has to have at least 700 jobs in year eight and average at least 700 jobs in the previous seven years.", "Despite losing the missile defense bid, Lockheed Martin told the DEO that it was still committed to growing its Oldsmar facility and said it would stay committed to the key terms of the project that were agreed upon in 2013.", "Lockheed Martin has not received any money yet for 2016. The DEO and a third-party auditor are reviewing the company's performance for 2016. If the the company met  its performance requirements, it will receive the first $500,000 payment.", "Our ruling", "Corcoran said the state reworked an incentive contract with Lockheed Martin after the company asked to lower its job creation from 305 jobs to six.", "Corcoran is onto something, but there's additional information readers need to know.", "State officials recommended Lockheed Martin receive incentive dollars as the company pursued a hefty missile defense contract from the federal government. If awarded, the state incentives contract said Lockheed Martin would create 305 new jobs in Pinellas County. Before the state contract was finalized, state officials agreed to amend the language about 305 jobs so that Lockheed Martin could receive $500,000 a year for seven years as long as it retained at least 560 jobs (six more jobs in addition to 554 already in place).", "Corcoran left out that the jobs were contingent on a federal grant. With that caveat, we rate his statement Mostly True.", "YouTube, \"Panhandle Tiger Bay Club | Florida House Speaker Richard Corcoran,\" Published March 19", "Interviews, Fred Picciolo, spokesperson for Richard Corcoran, March 20-23", "Interviews, Morgan McCord, press secretary for the Florida Department of Economic Opportunity, March 21-23", "Interviews on background, JoAnne Leznoff, staff director for the House Appropriations Committee, March 22", "Interview, Nathan Edwards, Director of Communications for Enterprise Florida, March 21", "Email interview, John Kent, senior manager for media relations at Lockheed Martin Missiles and Fire Control, March 22", "Closing Fund Review - Project ABC", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]