["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Roy Cooper on Aug. 15 called on state lawmakers to kill House Bill 330, which aims to protect some drivers who hit protesters.", "As graphic images emerged from Virginia over the weekend of a car crashing into a crowd of people, some turned their attention to a proposed North Carolina law that aims to protect drivers who inadvertently injure protesters in the street.", "House Bill 330 was introduced in response to protests in Charlotte last fall, when some residents who were upset about the police shooting of Keith Lamont Scott blocked interstate highways and other roads in the city. The N.C. House of Representatives approved the bill this spring but it hasn’t been considered by the state Senate.", "The bill drew renewed scrutiny after an Ohio man named James Fields, 20, allegedly rammed his car into a crowd of people protesting a white supremacist rally in Charlottesville, Va. The car killed one woman and injured 19 others. The news sparked fears that drivers in North Carolina could hit protesters without legal repercussions.", "On Tuesday, Gov. Roy Cooper called for legislators to let the bill die.", "\"The North Carolina legislature should defeat a bill that grants immunity from liability to motorists who strike protesters. That bill passed the state House and remains alive in the Senate. The Senate should kill it. Full stop. Those who attack protesters, weaponizing their vehicles like terrorists, should find no safe haven in our state.\" he wrote.", "We wondered whether the bill really \"grants immunity from liability to motorists who strike protesters,\" as Cooper said.", "A ‘tightly tailored’ bill?", "Cooper spokesman Ford Porter elaborated on the governor’s statement in an email.", "\"The purpose of the bill is to immunize certain drivers from findings of liability. Courts already take into consideration the circumstances surrounding an accident – this legislation adds vague new protections specifically for people who hit protesters with their cars,\" Porter said. \"That sends the wrong message and opens the door to potentially serious consequences. Governor Cooper has been clear that our state has no business going down this path.\"", "The bill’s authors, Republican state Reps. Justin Burr and Chris Millis, released a statement saying the bill is \"tightly tailored\" to protect drivers as well as people who are lawfully exercising their First Amendment rights.", "\"It is intellectually dishonest and a gross mischaracterization to portray North Carolina House Bill 330 as a protection measure for the act of violence that occurred in Charlottesville this past weekend,\" Burr and Millis said. \"Any individual who committed a deliberate or willful act, such as what happened this weekend in Charlottesville, would face appropriately severe criminal and civil liabilities.\"", "What the bill says", "The one-page bill, which is short by legislative standards, aims to provide legal immunity from personal-injury lawsuits to motorists who exercise \"due care\" when driving but injure someone who blocks traffic while participating in a protest.", "The bill expresses important distinctions: it wouldn’t apply to drivers who injure protesters through \"willful or wanton\" actions; nor would it apply to drivers who injure someone who has a permit to protest in the street. It also wouldn’t apply to someone being criminally prosecuted. And it certainly wouldn’t allow drivers to \"weaponize\" their cars without legal consequence.", "In short, the bill doesn't grant immunity to anyone who hits a protester on purpose.", "What it changes", "Attorneys and legal experts doubt that the bill would have much impact because state laws already offer broad protections to drivers who accidentally hit people who are unlawfully in the street.", "In North Carolina, Virginia, Alabama and Maryland, state law makes it difficult for a plaintiff to win.", "Other states apply the doctrine of \"comparative fault.\" Let’s say a protester in a comparative fault state is found to be 20 percent responsible for his or her injury and a driver is found to be 80 percent at fault. State laws in those states merely limit – not block – the amount of money awarded to the protester.", "In North Carolina, by contrast, state laws apply the doctrine of \"contributory negligence.\" If a defendant proves \"that the Plaintiff is even 1 percent responsible for their injuries – they lose automatically,\" said T. Greg Doucette, a criminal defense and business litigation attorney based in Durham.", "Doucette said the effect of the bill is unknown because it’s untested. But, on the bill’s surface, it seems to change little about civil litigation.", "Proving intent", "If the bill were to pass, how would it play out in court? If a protester is in the street and doesn’t have a permit, but thinks a driver intentionally struck him with his car, the protester would have to prove \"willful and wanton\" intent.", "Donald Beskind, a Duke University professor who’s practiced law for more than 30 years, said juries in that kind of situation are asked to consider direct and circumstantial evidence. Most cases are clear cut, he said.", "\"If you want to know if someone was careful, you would want to look at what they were doing at the time of the accident. If they were texting, we would infer they were not careful,\" Beskind said.", "If someone drove into protesters and \"on the back side of their car there was a sign that said ‘Kill the Antifa,’ we would assume they were being willful,\" he added, referring to the anti-fascist political organization.", "Inspiring recklessness?", "Effectiveness or ineffectiveness aside, attorneys said the bill might inspire violent acts by people who don’t understand the laws.", "\"While I don’t think it would make the Charlottesville thing legal by any stretch of the imagination, it could embolden someone to do something like the Charlottesville guy did,\" said David Stradley, a personal injury lawyer in Raleigh. \"We just don’t need to be encouraging people to do something around a demonstration.\"", "Our ruling", "Cooper overstates what this bill would do. And legal experts say that, while untested, the bill doesn't appear to change litigation and might not offer any additional protections at all. We rate this claim Mostly False.", "Interview with T. Greg Doucette, a criminal defense and business litigation attorney based in Durham.", "Phone interview with Donald Beskind, attorney and professor at Duke Law School.", "Phone interview with David Stradley, partner at White & Stradley, PLLC in Raleigh.", "A state-by-state guide to personal injury laws compiled by Matthiesen, Wickert & Lehrer Attorneys at Law in South Carolina.", "Email interview with Ford Porter, spokesman for Gov. Roy Cooper.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]