["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump claimed Rep. Dan Donovan, NY-11, voted for tax cuts. (Courtesy: Rep. Dan Donovan's website)", "President Donald Trump endorsed Rep. Dan Donovan for re-election, citing the Staten Island Republican’s support for tax cuts.", "In a tweet, Trump praised Donovan’s record on taxes, the military and other issues.", "There is no one better to represent the people of N.Y. and Staten Island (a place I know very well) than @RepDanDonovan, who is strong on Borders & Crime, loves our Military & our Vets, voted for Tax Cuts and is helping me to Make America Great Again. Dan has my full endorsement!", "\"There is no one better to represent the people of N.Y. and Staten Island (a place I know very well) than @RepDanDonovan, who is strong on Borders & Crime, loves our Military & our Vets, voted for Tax Cuts and is helping me to Make America Great Again. Dan has my full endorsement!\" Trump tweeted.", "Donovan faces a challenge from former Rep. Michael Grimm, who held the seat before Donovan won a 2015 special election. Grimm resigned from Congress after pleading guilty to felony tax evasion charges in 2014.", "Donovan trailed Grimm by 10 points in a poll conducted by the Democratic Congressional Campaign Committee in April. Trump’s tweet could help narrow that gap.", "But is Trump right about Donovan’s record on tax cuts?", "Recent tax cuts", "A spokesperson for Trump did not get back to us with information supporting his claim, so we can't say for sure what he was talking about in his endorsement. A search on Twitter shows Trump tweeted about tax cuts four other times in May.", "Each of those tweets referred to the Tax Cuts and Jobs Act, the federal tax law passed last year designed to lower taxes for the middle class and give major breaks to corporations and wealthy earners.", "Donovan was one of only 13 Republicans in the House that actually voted against the law.", "He and four other Republicans from New York state were against a part of the bill that limited the deductibility of state and local taxes. Residents were previously allowed to deduct an unlimited amount of those taxes. The new law caps that deduction at $10,000.", "\"Capping this deduction – which has been a part of the U.S. tax code since 1913 – will increase taxes and harm the already-unaffordable housing market in my district,\" Donovan said in a statement at the time. \"With the state and local tax deduction nearly eliminated, this tax bill doesn't equal relief for far too many New Yorkers.\"", "Past tax cuts", "Congress has passed other tax cuts since Donovan took office. He voted in favor of an omnibus spending bill that included more than $600 billion in tax relief in 2015.", "The bill permanently extended several tax breaks enacted during the Great Recession that were set to expire in 2017.", "The enhanced child tax credit, for example, gave couples without a tax liability a larger tax refund based on the number of children they have. The 2017 tax law allows an even larger refund for those families with the credit.", "The 2015 law also extended a $2,500 tax credit for low- and middle-income filers attending their first four years of college. That credit was not changed in the 2017 law.", "Other provisions of the 2015 law expanded another tax credit for low- and middle-income workers with children, allowed teachers to deduct up to $250 in school-related expenses, and extended other tax breaks", "Donovan also voted for a budget bill earlier this year that included more tax extenders for filers, and a bill in 2017 that gave extra tax relief to victims of Hurricanes Harvey, Irma, and Maria.", "Our ruling", "Trump said Donovan \"voted for Tax Cuts.\"", "That's actually true. Donovan has voted for tax cuts in the past, though he was against the Tax Cuts and Jobs Act last year. Trump's other tweets about tax cuts refer to that law, but we can't assume what Trump was talking about.", "That makes Trump’s statement accurate, but it required additional information. We rate it Mostly True.", "Tweet from President Donald Trump, May 30, 2018", "Email conversation with Patrick Ryan, communications director for Donovan", "Votes on the Tax Cuts and Jobs Act, via GovTrack", "\"Issues Remain On Tax Bill For Some House Republicans,\" NPR, Dec. 5, 2017", "\"Statement from Congressman Dan Donovan on Final Tax Bill,\" Dec. 19, 2017", "House vote on the 2015 omnibus spending bill", "\"President Obama signs massive spending bill, tax measures into law,\" USA Today, Dec. 18, 2015", "\"Under Wire, House Passes Big Package of Tax Cuts,\" New York Times, Dec. 17, 2015", "\"Congress clears $1.8 trillion tax and spending bills,\" Politico, Dec. 18, 2015", "Summary of the tax cut portion of 2015 spending bill from the House Ways and Means Committee", "Congressional Research Service report on 2018 Budget Bill with tax extenders", "Bipartisan Budget Act of 2018", "\"Michael Grimm announces resignation,\" CNN, Dec. 30, 2014", "\"Disgraced ex-Congressman Michael Grimm holds big lead over Rep. Dan Donovan in GOP primary, poll shows,\" NY Daily News, April 21, 2018", "Twitter search on Donald Trump using 'Tax Cuts' in a tweet", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]