["About this rating", "A photograph supposedly showing two \"fluffy\" cows after they had been shampooed, conditioned, and blow-dried is frequently met with curious comments as it circulates on social media:", "While this is a genuine photograph, it does not show a new breed of fluffy cow. Rather, this image shows two cows after they were shampooed, conditioned, and blow-dried in the run-up to a cattle show.", "This picture was taken in 2011 and shows two cows named Johnny Football and Texas Tornado from Lautner Farms in Adel, Iowa. When the image first went viral, Lautner Farms published a blog post explaining just how much work goes into making these cows show-ready:", "This summer, millions of Americans will visit state fairs across the country. Aside from the rides and the cotton candy, many people might not realize that the beef industry is celebrating a long-held tradition in the barns — cattle shows.", "Behind the now “famous” #fluffycow phenomenon is families, who work together year-round to make these steer and heifer projects look their best for the chance to walk through the show ring. This requires the youth showmen to wash, comb and blow dry their animals’ hair daily — sometimes twice a day. Before the show, these animals are treated to a day at the “salon,” where they use hair sprays, oils, and clippers to cut, style and fluff up the hair. This is all in an effort to earn the attention of a judge, who evaluates the animals — not just for the presentation of their hair, but for other merits like carcass quality (for market animals) or breeding traits (for heifers and bulls).", "Here's another photograph of a fluffy cow from Lautner Farms:", "https://twitter.com/LautnerFarms/status/1278428296204750855/photo/1", "KCCI, a local news channel from Des Moines, Iowa, filed a video report on the farm's fluffy cows in 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]