["The claim, published in this Facebook post on June 13, shows a purported list of regions in the Philippines, their corresponding COVID-19 risk levels and designated lockdown measures.", "According to the post, areas in the Philippines are divided into categories of low, moderate and high COVID-19 risks. Under the Philippine government’s guidelines, areas with moderate risk are subjected to general community quarantine (GCQ) and those with high risk are under enhanced community quarantine (ECQ), which comes with more movement restrictions.", "The claim alleges that IATF, the country’s Inter-Agency Task Force on Emerging Infectious Disease, has put three areas back under ECQ following lockdown easing in mid-May.", "Those areas include the NCR, the National Capital Region commonly known as Metro Manila; Cebu, a city on the island of Cebu; and Laguna, a province southeast of the capital Manila.", "Identical claims were also shared on Facebook here, here, here and here.", "However, the claims are misleading.", "On June 15, the government announced here that while Cebu would revert to ECQ, Metro Manila and Laguna would remain at GCQ until at least the end of June.", "The Philippine government also published an image of the misleading claim here on its COVID-19 website with a superimposed stamp that states: “FAKE NEWS”.", "The government added that the latest IATF resolution is numbered 45, not the “just approved” no. 35 as the misleading claim states.", "A copy of IATF's resolution no. 35, issued on May 11, 2020, can be viewed here.", "While the document presented similar categorisation for various Philippine regions, it placed Metro Manila, Laguna and Cebu under “modified ECQ”, a slightly more relaxed version of ECQ, until at least the end of May.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]