["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Sean Duffy, R-Wis., has criticized single-payer health care proposals for their cost. (Jeff Franko/USA Today)", "Perturbed by technical difficulties during his Facebook Live town hall on Sept. 14, 2017, U.S. Rep. Sean Duffy blamed \"bad government wi-fi.\"", "But for the most part the video stream allowed the Wisconsin Republican to answer viewers’ questions. One asked his opinion of a national single-payer health care plan introduced the previous day by U.S. Sen. Bernie Sanders, who ran for the 2016 Democratic nomination for president. The proposal is prominently supported by U.S. Sen. Tammy Baldwin, D-Wis.", "Duffy panned it, saying:", "The single-payer program was tried in Vermont, where Bernie Sanders is from. They had to scrap it, it was way too much money, they were going bankrupt.", "It turns out Vermont was the first state to adopt single-payer legislation.", "But the program wasn’t going bankrupt when it was abandoned.", "It couldn’t. It had never been implemented at all.", "What single-payer is, what is its appeal", "Generally speaking under single-payer, everyone, or at least most people, would get health coverage from the federal government (the single payer) and it would pay all the bills. Details can vary, of course. For example, Sanders’ national proposal would eliminate nearly all private insurance.", "Single-payer hasn’t necessarily enjoyed widespread support. In 2014, during an interview on Milwaukee radio, four-time presidential candidate Ralph Nader said most Americans \"since Harry Truman days\" have supported single-payer health insurance. Our rating was False. There were individual poll results dating back to 1945 indicating majority support, but overall the results were mixed, at best.", "One issue is cost. As PolitiFact National reported, Sanders has pegged the cost of his national single-payer plan -- \"no more copays, no more deductibles and no more fighting with insurance companies\" -- at $1.38 trillion per year. Other estimates are as much as double that amount.", "But all of that involves single-payer at the national level.", "Getting back to Duffy, what happened in Sanders’ home state?", "The Vermont experience", "Vermont adopted single-payer legislation in 2011. It required then-Gov. Peter Shumlin, a Democrat, to submit a detailed financial plan by 2013.", "But the plan was abandoned in 2014 without ever being implemented, or even funded.", "Even the two news articles Duffy’s office cited to back up his statement make that clear.", "1. The introduction to a National Public Radio piece that aired the day before Duffy’s statement explains it was about \"why Vermont was unable to establish a single-payer health care system.\" Linda Blumberg, an Urban Institute health insurance and health reform expert, told NPR that leaders in Vermont determined the taxes needed \"would not be politically palatable.\"", "2. A December 2014 Politico article said that when Shumlin, who was first elected in 2010 after running on single-payer, pulled the plug he \"admitted what critics had said all along: He couldn’t pay for it.\"", "We found similar reports.", "The Daily Beast said Shumlin dropped single-payer after an estimate said it would cost $4.3 billion a year, almost the size of the state’s entire $4.9 billion budget.", "The Washington Post reported that Shumlin said he could not \"responsibly support\" an 11.5 percent payroll tax hike on all Vermont businesses and an income tax hike of up to 9.5 percent that his administration said would be required.", "Writing in the New England Journal of Medicine, Harvard University practice of public health professor John McDonough pointed out that the decision to drop single-payer was as much about politics as finances. While studies showed the taxes would have been high, they also showed that the plan was economically viable (as the Cornell Policy Review also noted). But when Shumlin barely was re-elected in 2014, as McDonough put it, \"a clear public mandate for his health care agenda was nowhere in evidence.\"", "So, it’s clear that cost was cited as the reason Vermont did not implement single-payer, even though it was predicted that the tax revenue would have made the program viable.", "That’s not the same as single-payer being in place and then dumped because it was heading for bankruptcy.", "In fact, no one knows how single-payer in Vermont would have performed had it been put in place.", "Our rating", "Duffy said Vermont had to \"scrap\" its single-payer health insurance program because it was \"going bankrupt.\"", "Vermont adopted legislation for single-payer in 2011. But by 2014, Vermont’s governor abandoned the plan, saying the tax increases it needed would have been too high. In short, single-payer in Vermont didn’t go bankrupt; it was never even funded or implemented.", "We rate Duffy’s statement False.", "Facebook, Sean Duffy Facebook Live (17:00), 9/14/17", "Email, Sean Duffy spokesman Mark Bednar, Sept. 18, 2017", "PolitiFact Wisconsin, \"For 70 years, most Americans have supported single-payer government-run health insurance?\" May 14, 2014", "PolitiFact National, \"How expensive would a single-payer system be?\" July 21, 2017", "National Public Radio, \"Why Bernie Sanders' Single-Payer Health Care Plan Failed In Vermont,\" Sept. 13, 2017", "Politico, \"Why single payer died in Vermont,\" Dec. 20, 2014", "Cornell Policy Review, \"The Rise and Fall of Vermont’s Single Payer Plan,\" July 13, 2017", "Interview, Urban Institute senior fellow Linda Blumberg, Sept. 19, 2017", "New England Journal of Medicine, \"The Demise of Vermont's Single-Payer Plan,\" April 23, 2015", "Daily Beast, \"Bernie Sanders’ Single-Payer Health Care Plan Failed in Vermont,\" Jan. 25, 2016", "Boston Globe, \"Costs derail Vermont’s dream of a single-payer health plan,\" Jan. 25, 2015", "Washington Post, \"Vermont ends push for single-payer health care,\" Dec. 18, 2014", "The Atlantic, \"Vermont Becomes First State to Enact Single-Payer Health Care,\" May 26, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]