["About this rating", "During a panel interview with journalists of color, presumed U.S. Democratic 2020 presidential nominee Joe Biden was prodded by an interviewer to comment on whether he would take a cognitive test to prove his mental fitness, to which the former U.S. vice president reportedly replied, \"Are you a junkie?\"", "After a clip of the interview went viral in August 2020, Snopes readers inquired about the veracity of the claim, which we determined to be true.", "During a virtual convention for the National Association of Black Journalists and the National Association of Hispanic Journalists (NABJ/NAHJ), CBS Correspondent Errol Barnett questioned Biden about his mental fitness, highlighting that U.S. President Donald Trump has made his likely Democratic opponent's cognitive ability a campaign topic. In July 2020, Trump boasted about his own mental fitness after having taken a cognitive test himself and challenged the 77-year-old Biden to do the same.", "In a clip shared on Barnett's Twitter account and YouTube channel on Aug. 5, 2020, Biden scoffed when the journalist asked if he planned to take a cognitive test.", "\"No, I haven't taken a test. Why the hell would I take a test? Come on, man. That's like saying to you before you got on this program if you had taken a test [on] were you taking cocaine or not?” Biden said. \"What do you think, huh? Are you a junkie?\"", "https://www.youtube.com/watch?v=f2OZpH8bVcE&feature=youtu.be", "Barnett then asked Biden to comment on Trump's mental state, who the reporter said \"brags about his test\" and makes Biden's \"mental state an issue for voters.\" Biden visibly laughed in response, saying that if the president \"can’t figure out the difference between an elephant and a lion, I don’t know what the hell he's talking about.\"", "\"C'mon, man. I know you’re trying to goad me but, I mean, I’m so forward looking to have an opportunity to sit with the president or stand with the president in the debates,\" he continued, before he said he was cutting himself off in order not to say something he \"probably shouldn’t say.\"", "In July 2020, Biden contended that he was \"constantly tested\" for cognitive decline on the campaign trail, news website Axios reported at the time.", "The NABJ/NAHJ convention is sponsored by Yahoo News and is the largest annual gathering of journalists of color in the U.S. Trump was also invited by organizers to attend the panel but reportedly did not respond.", "Yahoo News Staff.   \"NABJ-NAHJ Newsmaker Plenary: Presidential Forum.\"\r\n    Yahoo News.   5 Aug 2020.", "Cohen, Max.   \"Biden Hits Back At Reporter Asking If He Took A Cognitive Test: ‘Are You A Junkie?’\"\r\n    Politico.   5 Aug 2020.", "Talev, Margaret.   \"Trump vs. Biden: Senility Becomes 2020 Flashpoint.\"\r\n    Axios.   1 July 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]