["By Saranac Hale Spencer", "Posted on September 4, 2020", "Contrary to QAnon-fueled claims that a California bill would legalize pedophilia, the bill would actually standardize the rules about who is required to be on the state’s sex offender registry.", "Facebook is teeming with falsehoods about a California bill aimed at equalizing standards for the state’s sex offender registry.", "Some of the most widely shared claims say: “IT STATES NO FELONY FOR HAVING SEX WITH A MINOR!”", "Others say: “PEDOPHILIA is now LEGAL in California!”", "Both are wrong.", "The bill, SB-145, was introduced in January 2019, but it got little attention until it passed the state Senate on Aug. 31. After that, claims on social media started appearing, often with the hashtag, #SaveTheChildren. That hashtag is associated with the QAnon conspiracy theory, which regards President Donald Trump as a crusader against a shadowy group of elite pedophiles who supposedly run the government. The audience for QAnon soared in 2020, as stay-at-home orders grounded the country in an effort to slow the spread of the novel coronavirus.", "But the claims QAnon adherents are spreading about SB-145 are bunk.", "The bill, which hasn’t become law since it’s still awaiting the governor’s signature, doesn’t address the criminal classification of sex with a minor, as the first claim states.", "In California, a sexual act between a minor and someone over 18 can be treated as either a felony or a misdemeanor. The statutes criminalizing various sex acts are among the state’s “wobbler” laws, which, as the U.S. Supreme Court explained in a 2003 decision, means that the level applied is at the discretion of the prosecutor or the court.", "SB-145 would have no effect on that. Rather, it would standardize one aspect of sentencing for all those crimes.", "As the state’s sentencing laws stand now, courts have discretion in whether or not to require inclusion on the sex offender registry for someone convicted of having vaginal intercourse with a minor who was within 10 years of the adult’s age. There is no such discretion allowed for those similarly convicted of anal sex, oral sex or sexual penetration (which is different than intercourse in that it doesn’t involve a penis).", "“This distinction in the law — which is irrational, at best — disproportionately targets LGBT young people for mandatory sex offender registration, since LGBT people usually cannot engage in vaginal intercourse,” the bill’s sponsor, state Rep. Scott Wiener, said in a statement when he introduced the legislation.", "“For example, if an 18 year old straight man has vaginal intercourse with his 17 year old girlfriend, he is guilty of a crime, but he is not automatically required to register as a sex offender,” Wiener’s statement explained. “[I]nstead, the judge will decide based on the facts of the case whether registration is warranted. By contrast, if an 18 year old gay man has sex with his 17 year old boyfriend, the judge *must* place him on the sex offender registry, no matter what the circumstances.”", "SB-145 would make the registry requirements for similar offenses the same. It would have no effect on the level of crime prosecuted, and it certainly would not make pedophilia “LEGAL in California,” as the second claim says. The laws against sex with minors would remain intact.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "California Senate. “SB-145 Sex offenders: registration.” (as passed by the Senate 31 Aug 2020.)", "Wiener, Scott. Press release. “Senator Wiener Introduces Legislation to End Discrimination Against LGBT People Regarding Sex Offender Registration.” 22 Jan 2019.", "Ewing v. California. No. 01-6978. Supreme Court of the U.S. 5 Mar 2003.", "Caswell, Gabe. Senate floor analysis – SB-145 Sex offenders: registration. 31 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]