["About this rating", "On 8 February 2017, the Huffington Post published an article suggesting that newly-confirmed Secretary of Education Betsy DeVos had ordered the immediate \"flattening\" of classroom globes, presumably due to her belief that the Earth is flat:", "Upon hearing of her extremely narrow Senate confirmation, newly confirmed Education Secretary Betsy DeVos issued an order that all globes being used in any American school are to be “flattened like God made it just 6,000 years ago.”", "DeVos was confirmed in the Senate 51-50, with the deciding vote being cast by Vice President, and 2015 winner of the “Lantern-Jawed Bigot of the Year Award” from Christofascists Weekly, Mike Pence. When Pence broke the tie, it was the first time since 2008 that a Senate vote had to be broken in such a way. Perhaps most notably, this was the first time in our nation’s 240-year history that a cabinet member had to be confirmed in such a way.", "“Sure, I was literally dragged across the finish line by Vice President Pence,” DeVos said in an email to the DOE staffers directing the globe flattening edict, “but elections have consequences. Apparently so does giving hundreds of millions of dollars to campaigns.”", "Immediately preceding the content of the article was a disclaimer stating that \"You can read more satirical news items like this every day on The Political Garbage Chute.\"", "Since Huffington Post articles do not typically incorporate satire, many readers accepted the headline at face value. A number of those viewers might have seen the headline on social media, noted that it was attributed to Huffington Post, and assumed it represented real news without clicking through to read the underlying article.", "Huffington Post's forays into satire previously confused readers with an October 2016 article that suggested Dick Cheney would be jailed for 20 years on war crimes charges.", "The Huffington Post's confusion is not without precedent. New Yorker humorist Andy Borowitz has a satire column within a non-satirical outlet, and the New York Times' publication of a piece suggesting that Stanford University had admitted no students for the class of 2020 was a similar unexpected joke mistaken for real news by a number of readers.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]