["“GOOD NEWS FOR CANCER PATIENTS,” reads one post, which we’ve archived here. “THE CURE IS HERE.” It was posted on Nigerian Facebook page ‘Healing herbal’, which has more than 50,000 followers.", "“WILD EGG PLANT KILLS CANCER IN ONE MONTH,” says another post, which has been shared more than 250 times since it was published in August.", "The posts share a recipe of wild aubergine mixed with water or beer, which they say patients should drink twice a day to “kill cancer outright”.", "AFP found similar claims in Facebook posts that are supposedly endorsed by doctors. A post from October on a Zambian Facebook page called ‘Dr Gilliard Pharmacy’ claims that drinking wild aubergine mixed with water will make cancer “disappear”.", "A reverse image search on the Facebook page’s profile picture, which shows a man wearing a stethoscope, reveals he is not ‘Dr Gilliard’ but actually an American doctor called Paul Rivas, whom we can see talking in this video about his weight loss pills.", "Many comments on the posts express gratitude for the advice or ask for more information about the recipe.", "However, medical professionals told AFP that the claim is false and warned of the risks of turning to herbal remedies to treat cancer.", "“There is no scientific evidence that wild aubergine plant can cure cancer,” said Dr Samuel Smith, associate professor at the Leeds Institute of Health Sciences in the UK.", "“The scientific consensus from high quality large trials shows that natural and herbal treatments do not affect cancer outcomes, and could cause serious harm,” he told AFP by email.", "Cancer Research UK’s head information nurse Martin Ledwick said patients should speak to their doctor before considering any alternative or complementary medicine.", "“Herbal medicine and so called ‘natural’ cures have not been properly tested and should not be relied on. They could interact with other medicines that a person is taking and sometimes they may even have a harmful effect,” he told AFP by email.", "Where does the claim come from?", "To find out more about the origin of the claim, AFP ran keyword searches on Facebook. We found a post from 2017 about an ‘eggplant cancer cure’ on a page called ‘The Truth About Cancer’, which has more than one million followers.", "The post features a video promoting Curaderm BEC5, described on the product’s website as ‘The Eggplant Skin Cancer Cream’.", "In 2015, the US Food and Drug Administration (FDA) wrote a warning letter reprimanding the company behind Curaderm for marketing the product without their approval.", "Although the ‘eggplant skin cancer cream’ has not been approved by the FDA, it is widely available online.", "Contacted by AFP, a spokesman for the agency warned consumers to be wary of “fraud products”.", "“In general, consumers should be cautious of products marketed and sold online claiming to diagnose, cure, mitigate, treat or prevent any disease,” he told AFP by email.", "“The FDA is very concerned about these fraud products, and removing these products from the market remains one of the agency's top priorities.”", "AFP has previous debunked various social media posts promoting false cures for cancer, including claims that drinking warm water or eating a sugar-free diet can cure the disease.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]