["The photo was published here on Facebook on March 8, 2020. It has since been shared more than 400 times.", "It shows Pakistani journalist Mansor Ali Khan with his wife and child.", "The Urdu-language slogan on the piece of paper in Khan’s wife's hand translates to English as: “There is no shame in getting naked”.", "The post’s caption translates as: “Mansoor Ali Khan’s wife is carrying a slogan ‘there is no shame in getting naked’ and my host is laughing sheepishly.”", "Below is a screenshot of the misleading Facebook post:", "The same photo showing the slogan on the placard was also shared on Facebook here and here and on Twitter here and here, with a similar claim.", "But the claim is false; Khan posted the original photo, which shows his wife holding a blank piece of paper, on his Facebook page here.", "Below is a screenshot of Khan’s post:", "Below is a comparison of the doctored photo in the misleading Facebook posts (L) and the original photo posted by Khan (R):", "Khan also posted another collage image that showed the original photo beside other doctored versions of the photo with different slogans. He captioned this post: \"The dark world of Photoshopped pictures\".", "The other texts digitally edited into the collage reads “My body, my choice” and “Divorce wanted.”", "Below is a screenshot of Khan’s Facebook post:", "The Khan family were among the thousands of protesters who marked International Women’s Day in cities across Pakistan on March 8. The rallies promoted counter “anti-feminist” rallies, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]