["About this rating", "A gunman opened fire at Marjory Stoneman Douglas High School in Parkland, Florida on 14 February 2018, killing seventeen people — mostly teenaged students. Immediately, in what has become a deeply troubling (yet entirely predictable) pattern, Internet trolls took the tragedy as yet another opportunity to hawk \"false flag\" conspiracy theories.", "Before the families of massacre victims even had the chance to bury their loved ones, disreputable outlets and personalities like InfoWars' Alex Jones began claiming without evidence the shooting was a \"false flag,\" or a government operation carried out for the purpose of seizing guns from Americans.", "Alex Leary, Washington bureau chief for the Tampa Bay Times, reported that an aide for Florida Rep. Shawn Harrison had claimed in an official e-mail that child survivors of the Florida shooting were \"crisis actors\" who travel around the country posing as victims in mass shootings:", "Here's the email. I asked for more information to back up the claim and was sent another email that linked to a YouTube conspiracy video. pic.twitter.com/VRSVOcjj3E", "— Alex Leary (@learyreports) February 20, 2018", "I was just made aware that my aide made an insensitive and inappropriate allegation about Parkland students today. I have spoken to him and placed him on leave until we determine an appropriate course of action. I do not share his opinion and he did so without my knowledge.", "— Shawn Harrison (@Shawnfor63) February 20, 2018", "I’ve been terminated from the State House. I made a mistake whereas I tried to inform a reporter of information relating to his story regarding a school shooting. This was not my responsibility. I meant no disrespect to the students or parents of Parkland.", "— Benjamin Kelly (@benakelly) February 20, 2018", "Others pounced on a Google search engine glitch that mischaracterizes the publishing dates of news stories to claim reports about the shooting were posted in advance. For example, a site dedicated to anti-Semitic conspiracy theorist Henry Makow posted an image of the Google search results and claimed there were \"crisis actors\" and multiple shooters, both common conspiracy theory motifs.", "Images like this one circulated on the message board 4chan and various other disreputable web sites:", "Listing the date and time for news stories is complicated, as there is no universal standard used. Sometimes, stories have no date and time on the webpage. Sometimes, a story may appear on a page that lists related stories, and they all have different dates and times shown. Sometimes a publisher might be in a different time zone and the date gets picked up incorrectly. All these things may cause us to occasionally list the wrong date. We're looking at ways to improve.", "Google's public search liaison Danny Sullivan addressed the issue on Twitter, explaining why some of the article dates were misleading:", "The time comes from this embedded in the story's code:\ndatetime=\"2018-02-14T14:40:35+00:00\"\nThat means the story is as of 2:40pm UTC -- IE Greenwich time, not Miami time. The publication likely forgot to set the time zone to Miami, mistakenly reporting it five hours early.", "— Danny Sullivan (@dannysullivan) February 14, 2018", "The first is because we picked up the wrong date for a related article at the end. The others are going to be similar. We can get the wrong date for a variety of reasons. pic.twitter.com/tpKtRqrPr6", "— Danny Sullivan (@dannysullivan) February 14, 2018", "The \"false flag\" conspiracy theory is applied almost as a reflexive reaction to promote unfounded fears of a government takeover, which will be preceded by a forcible national gun grab (although there's never any explanation offered for how a government entity might be clever enough to keep the same hoax with the same people going over and over again for years but too stupid to be able to orchestrate a full takeover).", "Although it is hardly original, it is sadly employed as grounds to harass victims of mass shootings. Since at least the 2012 massacre at Sandy Hook Elementary in Newtown, Connecticut, the families of shooting victims have been relentlessly harassed. One conspiracy theorist was sentenced to prison for sending a death threat to the father of a child who was killed in that shooting.", "Johnson, Katanga. \"Survivors of Florida School Shooting Launch Gun Control Push.\"\r\n  Reuters. 20 February 2018.", "Selk, Avi, and Grant, Mary Lee. \"A Fake Shooter and ‘False Flag’ Rumors at the Hospital — How Dark Online Hoaxes Came to Texas.\"\r\n  The Washington Post. 6 November 2017.", "Hawkins, Derek. \"Sandy Hook Hoaxer Gets Prison Time for Threatening 6-Tear-Old Victim’s Father.\"\r\n  The Washington Post. 8 June 2017.", "Levin, Sam. \"'I Hope Someone Truly Shoots You': Online Conspiracy Theorists Harass Vegas Victims.\"\r\n  The Guardian. 26 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]