["But the rumours of an October 11 wedding were false; presidential media aides denied it and the president was reported to have observed Friday prayers by his official residence. The minister also appears to have been out of the country during the period.", "Aisha Buhari flew back to Nigeria on Sunday and warned against “fake news”.", "The rumours appear to have been launched by a piece on Nigerian news website Point Blank News on September 30. It cited anonymous sources saying that the president was set to marry Minister of Humanitarian Affairs, Disaster Management and Social Development Sadiya Umar Farouq. The website described Farouq  as “a very close friend” of the president’s who regularly cooked for him and his close advisors. The report was shared just a little over a hundred times. We archived it here.", "About 10 days later, the same story began showing up on many other blogs in the country. A post by The Herald in Nigeria claimed that Buhari was set to marry. This report was shared over 500 times, according to social media monitoring tool Crowdtangle. Nairaland, the most visited local social media network in Nigeria, picked up the story and added that the marriage was set to be held on Friday.", "A poorly-designed invitation started circulating on social media on October 10, claiming that the wedding was set for 2pm the next day at the Abuja Central Mosque. The hashtags #BUSA19 and #BUSA2019 were created and trended on Twitter in Nigeria for 48 hours.", "When asked to confirm or deny the wedding, Garba Shehu, the presidential spokesman, told AFP that “he did not get any invitation for any wedding”. NAN also quoted Femi Adesina, special adviser to the president saying the news of any wedding was “a deceptive manoeuvre by those who fabricated the news’’.", "A video of Sadiya Umar Farouq started making the rounds on social media on Friday, claiming to show the wedding ceremony. One version of the video, archived here, was seen more than 23,000 times.", "AFP checked the video and found it was taken from an event in September, 2019, celebrating her appointment as minister. Here are some pictures from the same event.", "Yesterday, i attended a walimah organised by my family and friends to congratulate me on my appointment as a honorable Minister by President Muhammed Buhari. pic.twitter.com/9GrzPKgMx5", "In reality the minister appears to have been at a UN meeting in Geneva. A UNHCR document showed Farouq was to lead the Nigerian delegation at the session and her ministry on Thursday published video of her at the session. AFP confirmed -- using video verification tool InVID -- that the video was indeed shot on October 10, 2019. The ministry tweeted pictures of Farouq arriving in Nigeria from Geneva on Tuesday October 15.", "The HM, @Sadiya_farouq addressing the High Level segment on Statelessness at the ongoing 70th Session of the #EXCOM2019 by the @Refugees UNHCR. She presented ??'s pledges and commitments towards ending statelessness and ongoing efforts. pic.twitter.com/sEQ1rxWuvs", "The minister has not directly addressed the marriage rumours. But on Friday she tweeted to disown a Twitter account making claims about the marriage. The account has since been taken down by Twitter.", "It has come to my attention that a fake Twitter account @Sadiya_farouq_ has been created in my name. I wish to inform my followers and well meaning Nigerians to disregard the handle and any information posted on it.\n\t\tMy official Twitter handle remains @Sadiya_farouq\n\t\tThank you", "First Lady Aisha Buhari had been out of the public eye since August, when she was last seen publicly in Nigeria before travelling to Saudi Arabia for hajj.", "Her absence from the country fuelled rumours on social media that Aisha had fallen out with some of her president’s top advisors after criticising them.", "Mrs Buhari actually flew back to Nigeria over the weekend. She departed London on Saturday night, after meeting with the wife of the Nigerian high commissioner to the UK, Modupe Oguntade, and arrived in Nigeria on Sunday Oct 13, 2019.", "Speaking with journalists on her arrival in the country, she said she had been away on a medical trip.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]