["About this rating", "On 19 March 2015, several articles about a class-action lawsuit filed in California Superior Court claiming that dozens of brands of (primarily inexpensive) wines produced in that state contain \"dangerously high levels of poisonous inorganic arsenic\" were published on the Internet. This claim spread quickly online, although some of its details were somewhat obscured in its rapid transmission via social media.", "CBS in San Francisco published an article on the topic that provided some additional details behind the story. According to that article and others, the class action lawsuit was initiated by Kevin Hicks of BeverageGrades, \"a private company offering lab testing, quality assurance and certification of alcoholic beverages for suppliers, restaurants, retailers and ultimately, the end consumer.\"", "The CBS article summarized Hicks' claims, noting an inverse relationship between the cost of wines and the levels of arsenic they contained and the lack of an explanation to account for that phenomenon:", "[Hicks] tested more than 1,300 bottles of wine and found almost a quarter contained levels of arsenic higher than the Environmental Protection Agency's maximum limit for drinking water of 10 parts per billion. In some cases he says the wines contained up to four and five times that amount.", "So far there is no theory on why this might be happening, but Hicks' tests showed an interesting pattern.", "The lower the price of wine on a per-liter basis, the higher the amount of arsenic,\" he said. Hicks' list of low-priced, high-arsenic wines includes Trader Joe's famous Two-Buck Chuck White Zinfandel, which tested at three times the limit. A bottle of Menage a Trois Moscato was four times the limit and a Franzia Blush had five time the EPA limit for drinking water.", "Immediately some skeptics (including winemakers affected by the news) pointed out that whether or not Hicks' claims had merit, his company stood to gain financially should consumers develop an interest in lab testing of alcohol. And, in fact, BeverageGrades sent out a press release timed to the announcement of the lawsuit that offered services to provide \"retailers reassurance from arsenic in wine.\"", "Critics also dismissed as mere scare-mongering that Hicks used safety standards established for drinking water and applied them to wine, noting that consumers imbibe far more water than they do wine:", "The EPA threshold for acceptable amounts of arsenic in drinking water is 10 parts per billion. Which, as you probably can figure out, is not very much at all. Now it's quite logical on one level to be worried about a wine that exceeds that level. But on the other hand think about how much water you drink relative to how much wine you drink.The average adult generally consumes somewhere around two liters of water per day. If they're seriously lucky, or seriously happy, an adult might consume a full liter (almost 1.5 bottles) of wine on one particular day. But seven days per week? Then we're into serious alcoholism territory. And that's what you'd have to do in order to get yourself a dose of arsenic that approached the amount that the EPA says you should be able to consume safely in your drinking water.", "Here's another data point for you. Apple juice and pear juice contain up to two or three times as much arsenic as drinking water as a matter of course. The Food and Drug Administration has known this for years. In fact the acceptable threshold for traces of arsenic in juice is much higher than it is for water, a fact that the FDA explains by simply saying that people don't drink as much juice as they do water.", "In short, the FDA is not worried about arsenic levels in juice that are up to five times higher in juice than in water.", "And what were the most egregious results that BeverageGrades found in their testing of these mass-market wines? Their worst offender was a bottle of Franzia's White Grenache which had five times the amount [of arsenic] allowed in drinking water.", "This is basically a bullshit, scaremongering story that BeverageGrades is very cunningly using to drum up business.", "CBS This Morning cast additional doubt on the urgency of the \"arsenic in wine\" scare by testing four of the wines named in the lawsuit. In those tests, the levels of arsenic in wine found did not match those reported in BeverageGrades' testing:", "CBS News also spot-checked and tested the four wines listed in the lawsuit. They were not the same vintages, but the arsenic levels were all considerably lower than BeverageGrades' results. One of them, the Wine Group's Flip Flop Pinot Grigio, came in within the acceptable federal arsenic levels for water.The others were at or above that limit, including Trader Joe's Two Buck Chuck White Zinfandel, which tested at more than twice that standard.", "In response to news of the lawsuit, California wines trade group The Wine Institute released a statement noting that while the United States indeed had no established acceptable levels of arsenic in wine, California wines were routinely tested by other countries (including the EU) and deemed to be below those countries' established limits:", "We have learned of possible litigation alleging that certain wines pose a risk to consumers because they contain trace amounts of arsenic. Although we are not privy to the contents of the litigation, we believe this allegation is false and misleading and that all wines being sold in the U.S marketplace are safe.Arsenic is prevalent in the natural environment in air, soil and water, and in food. As an agricultural product, wines from throughout the world contain trace amounts of arsenic as do juices, vegetables, grains and other alcohol beverages. There is no research that shows that the amounts found in wine pose a health risk to consumers.", "The U.S. Tax and Trade Bureau (TTB), the agency that regulates wine, beer and spirits, monitors wines for compounds, including arsenic, as part of its testing program. While there are no established limits in the U.S., several countries, including the European Union, have established limits of 100 parts per billion or higher for wine. California wine exports are tested by these governments and are below the established limits.", "Wine Spectator contacted some of the wine brands named in the lawsuit, many of whom stated that Hicks had made no effort to contact them before filing the class action, although he did send out a press release to some wine vendors offering his company's testing services to them:", "[A wine company] spokesman said he had not heard of any named winery contacted by Hicks before the lawsuit was filed. The same day the suit was filed, BeverageGrades sent a press release to certain retailers offering its services for a \"screening and certification model that allows them to assure their customers of the purity of all the alcoholic beverages they sell.\"", "O'Donnell, Ben.   \"Lawsuit Claims California Wines Contain Dangerous Arsenic Levels\".\r\n    Wine Spectator.   19 March 2015.", "CBS San Francisco.\r\n  \"Your Favorite Wine Might Contain High Levels of Deadly Arsenic.\"    19 March 2015.", "CBS This Morning.\r\n      \"'Very High Levels Of Arsenic' in Top-Selling Wines.\"     19 March 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]