["Floyd Mayweather Jr. speaks at a news conference on Aug. 27, 2017, after defeating Conor McGregor in a super welterweight boxing match in Las Vegas. (AP photo)", "Boxer Floyd Mayweather’s middle name might be money, but stories of him donating $200 million to the victims of Hurricane Harvey is definitely fake.", "An Aug. 29, 2017, post on HoustonChronicle-tv.com said, \"Floyd Mayweather Jr. donates a whopping sum of money to Houston after hurricane.\" Facebook users reported the post as potentially fabricated, as part of the social network’s efforts to fight fake news.", "The link at HoustonChronicle-tv.com redirects to a story on NewsPhd.com, which in turn credits the story to \"Houston Chronicles TV.\" The Internet Archive showed that the story originally was posted at HoustonChronicle-tv.com but has apparently since been changed.", "The post said the champion boxer was giving $200 million to help victims of Hurricane Harvey, which displaced thousands with high winds and flooding. As of this writing, the death toll has reached 24, according to CNN.", "\"My thoughts and prayers are with our brothers and sisters in Houston,\" Mayweather is quoted. \"My initiative is donating $200m to the entire Houston community to assist and house victims of the devastating flood that has rendered people homeless. The fund is intended to provide shelter, food, clothing and medicines.\"", "Facebook users also flagged the same assertion on a couple of other websites.", "There is no credible report that Mayweather, pictured below, has made a contribution that large.", "pic.twitter.com/Nq0qUlI0iu", "Mayweather’s name likely became a target for fake news writers after he won a guaranteed $100 million for his Aug. 26 boxing match against MMA fighter Conor McGregor (his share of money from the fight could climb as high as $300 million).", "HoustonChronicle-tv.com is not the website for a TV news station, or the Houston area’s real newspaper, the Houston Chronicle. It’s a fake news site that we’ve listed on our Fake News Almanac as mimicking a legitimate media outlet.", "While Mayweather does have a foundation that aids and promotes community groups, there has been no news that the foundation or the boxer have given money out specifically for hurricane relief.", "Another sign the story is fake is that the same unsubstantiated details have been attributed to other boxers. This same story has already been reused, almost word-for-word, to say that boxer Manny Pacquiao gave $50 million to the city for hurricane relief.", "How or why this post has ended up on other sites is hard to say, but it doesn’t go the distance on our Truth-O-Meter. We rate it Pants On Fire!", "HoustonChronicle-tv.com, \"Floyd Mayweather Jr. donates a whopping sum of money to Houston after Hurricane,\" Aug. 29, 2017", "NewsPhd.com, \"Floyd Mayweather Jr. donates a whopping sum of money to Houston after Hurricane,\" Aug. 29, 2017", "PolitiFact.com, \"PolitiFact's guide to fake news websites and what they peddle,\" April 20, 2017", "USA Today, \"How much money will Floyd Mayweather make for his Conor McGregor superfight?,\" Aug. 27, 2017", "Fox News, \"Mayweather vs McGregor: 2.9 million viewers watched fight on pirated streams, says security firm,\" Aug. 30, 2017", "CNN, \"Harvey hits again: Live updates,\" accessed Aug. 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]