["The report was published here on March 2, 2020 by Komchadluek, a Thai newspaper. The report, titled “7 evil things that virus COVID-19 is afraid of”, has been shared more than 12,000 times and read more than 34,000 times, according to the website’s data tracker.", "Below is a screenshot of the misleading article:", "Parts of the report translate to English as: “When realised, you shouldn't be alarmed but you should be aware of the evil ‘COVID-19’ because there are still some ‘weaknesses’ that this evil virus can not overcome.", "\"Komchadluek has compiled 7 things that COVID-19 fears:", "The seven “fears” were also shared here in a Thai-language Facebook health group with more than 6,000 followers. A similar claim was posted on social media in Thai here, here, here and here; in Spanish here; and in English here, here, here, here and here.", "But some of the tips in the report are misleading and do not correlate with health experts' advice.", "--UV light--", "While ultraviolet (UV) light can be used at extremely high intensities as a disinfectant, everyday UV emitters, such as the sun, only release low levels of UV light.", "“Ultraviolet is able to kill COVID-19 if it is exposed to the concentrated UV ray in a certain amount of time and distance,” Dr. Pokrath Hansasuta, an assistant professor of virology in Chulalongkorn University’s Department of Microbiology, explained to AFP by phone on March 18, 2020. “However, that level of UV exposure is harmful to human’s skin. Most likely, it will be in the light bulb or lamp as the natural UV from the sun is not strong enough to kill it.”", "The World Health Organization (WHO) also stated here that UV should not be used as a disinfectant for the coronavirus. “UV lamps should not be used to sterilize hands or other areas of skin as UV radiation can cause skin irritation,” the agency said.", "Below is the screenshot of the WHO’s advisory:", "--Chlorine disinfectants--", "Chlorine disinfectants can also be effective repellents against the coronavirus, but only if used properly.", "The WHO states here that chlorine should not be applied directly to your body as it can be damaging to clothes and sensitive areas, such as your eyes and mouth.", "But the Australian Department of Health notes here that chlorine should be used as a disinfectant in clean supplies and the US Centers for Disease Control and Prevention (CDC) notes here that it can be used to disinfect certain water sources, like pools.", "--High temperatures--", "It remains unclear whether or not temperatures of 56 degrees celsius would effectively kill the novel coronavirus, according to experts.", "“Since it is a new virus, there is no research that proves that,” Dr. Hansasuta said.", "It is true, however, that the SARS coronavirus, which caused a global epidemic in 2002-2003, was killed in temperatures above 56 degrees Celsius, according to the WHO.", "--Other claims--", "The other practices mentioned in the misleading post can be effective precautions when applied properly.", "Alcohol based products, such as hand sanitizer, do require a high percentage of alcohol to kill the virus. “Only alcohol 70-75% can kill the novel coronavirus,” Dr. Hansasuta said.", "The CDC noted here that hand sanitizers should be at least 60% alcohol and cleaning solutions at least 70%. Such products, however, are not for consumption.", "Keeping air-ventilated is also a recommended practice, but does not provide foolproof protection against the virus.", "“Although there is no evidence of the effectiveness of mechanical or natural air ventilation to reduce COVID-19 transmission, there is mechanistic plausibility, and it should be applied, and enhanced especially in settings where people gather regularly,” the European Centre for Disease Prevention and Control states in a report here.", "Frequently washing one’s hands and taking steps to maintain a strong immune system are also widely accepted as worthwhile preventive measures.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]