["The graphic was published here by an Australia-based Instagram user on September 16, 2020. The post has received more than 500 likes.", "The post's caption reads: \"Here are some REAL facts and figures for you to share around.\"", "The image is titled “CORONAVIRUS FAQ” and bears the logo of the UK’s National Health Service.", "The text in the mage reads: \"Does Covid-19 Exist ? \n\t\"NO, SARS 1 & 2 have not yet been isolated and the current unlawful measures are a freedom grab.", "\"Are the tests accurate ? \n\t\"NO, the PCR test cannot identify any virus whatsover and are only used to create false cases & fear", "\"Any science behind Social Distancing & Masks? \n\t\"NO, none of these measures are backed by science and proven harmful to health & immunity. Not one life has been saved, instead the opposite is true", "\"Are Vaccines Safe? \n\t\"NO, since vaccines, 56% of the global population now has a permanent chronic illness & Autism now 1 in 100”.", "The image also appeared here and here on Instagram, and here and here on Facebook alongside a similar claim.", "The claim is false.", "The NHS denied producing the graphic in an email to AFP on September 22, 2020.", "Official NHS advice and information about the novel coronavirus, which causes the disease Covid-19, can be found here on its website.", "The NHS recommends social distancing to prevent the spread of the novel coronavirus. On its website, it states it recognises that vaccines are safe and important in preventing the spread of infectious diseases. This is consistent with advice from the World Health Organization (WHO).", "According to this coronavirus test explainer on the Imperial College Healthcare NHS Trust website, the PCR test is being used widely to test for Covid-19 in the UK.", "“[The PCR] test is used for patients and NHS staff, as well as in the community, and it gives you a fairly accurate indication of whether or not you are infected with coronavirus currently. The antigen test is a different test that can also tell you if you are currently infected, but it is much less accurate than the PCR test and not yet in wide use. The antibody test is still being developed for wider use and its result can indicate that you may have previously had coronavirus,” the webpage reads.", "As of September 23, 2020, the UK requires masks to be worn in most public indoor settings, as well as other areas “where social distancing may be difficult and where you will come into contact with people you do not normally meet”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]