["Michael Bloomberg delivered a speech at the New Hampshire Institute of Politics on Jan. 29, 2019. (Courtesy Mike Bloomberg/Facebook)", "A week before announcing his bid for the 2020 Democratic presidential nomination, former New York City Mayor Michael Bloomberg made news by apologizing for his support of stop-and-frisk policing, which led to the disproportionate stopping of black and Latino people across the city.", "But Bloomberg also boasted in his speech at the Christian Cultural Center, a black megachurch in Brooklyn, N.Y., about his record on crime and criminal justice.", "\"In fact, no other city in America did what we did,\" the billionaire former Republican and former independent claimed. \"We reduced murders by 50%, reduced police shootings to historic lows, reduced the number of people incarcerated by nearly 40%.\"", "Bloomberg also made the murder and incarceration claims on his campaign website, and he repeated them on Twitter on the day he announced.", "Statistics back Bloomberg, but he goes too far in claiming credit.", "In 1981, long before he became the latest presidential candidate in a crowded Democratic field, Bloomberg co-founded Bloomberg LP, a financial information and media company. He is now the eighth-wealthiest American, with a net worth of $54 billion, according to Forbes.", "Bloomberg succeeded Rudy Giuliani as mayor in 2002 and served until 2013. He was succeeded by the current mayor, Bill de Blasio, who briefly ran for the Democratic presidential nomination before dropping out in September.", "In 2013, near the end of his tenure, Bloomberg claimed that New York was the nation’s safest big city. Our rating, looking at violent crimes plus property crimes, was Mostly True.", "Now let’s dig into each of the four parts of his current claim.", "Bloomberg’s campaign cited data showing there were 649 murders in 2001, the year before Bloomberg took office, and 335 in 2013, his final year in office. That’s a reduction of roughly half.", "But murders started declining a decade before Bloomberg took office and continued downward after he left.", "Murders dropped \"precipitously\" during the 1990s — from roughly 2,200 at the start of the decade, noted Ames Grawert of the Brennan Center for Justice at the New York University School of Law.", "\"Was the slope any steeper during Bloomberg than in the preceding decade? Not at all,\" said Jeffrey Fagan, a professor of law and a professor of epidemiology at Columbia University.", "In 2013, the total number of shots fired by officers — 248 — and total shooting incidents — 81 — were the lowest since the New York Police Department began keeping such records in 1971, according to the department’s 2013 annual firearms discharge report, which Bloomberg’s campaign cited. Police shot and killed eight people and injured 17 others that year, the report says.", "But here, too, Bloomberg appears to be going too far by taking credit: The trend downward started before Bloomberg took office. And while shooting incidents hit the record low of 81 in 2013, they had risen to 105 a year earlier, during his tenure.", "\"The fact that reductions have continued under de Blasio shows that the declines are being driven by factors other than the municipal genius of mayoral-led policing and prosecutorial strategies,\" said Eugene O’Donnell, a lecturer at the John Jay College of Criminal Justice in New York City.", "In 2001, the year before Bloomberg took office, New York City had 703 jailed or imprisoned inmates for every 100,000 residents, according to the mayor’s Office of Criminal Justice. In 2013, it was 429  — a drop of 39%.", "The same chart shows, however, that the decline began years before Bloomberg took office and has continued for years afterward, the figure was 910 in 1996 before dropping to the 703 in 2001, a decline of 23% in five years. And there’s another issue.", "\"The criminal prosecution/punishment decisions are not those of the mayor or his administration,\" said Franklin Zimring, a University of California, Berkeley, School of Law faculty director of criminal justice studies and author of the 2012 book, \"The City That Became Safe: New York’s Lessons for Urban Crime and Its Control.\"", "Bloomberg’s campaign says no other city has achieved the three reductions Bloomberg touted. There is truth to that.", "\"New York City is in a class by itself in the country on public safety — serious crime has dropped for decades,\" O’Donnell told us.", "But comparisons are dicey.", "The FBI is one of the strongest voices warning that city-to-city comparisons are invalid. Among other things, the FBI points out that no two cities are alike and the rates at which crimes are reported vary among cities.", "Bloomberg said, \"No other city in America did what we did. We reduced murders by 50%, reduced police shootings to historic lows, reduced the number of people incarcerated by nearly 40%.\"", "He’s generally on target, as each of the three statistical claims are backed by the numbers. But Bloomberg can’t claim all the credit, in that the declines began before he took office and continued afterward; and experts including the FBI warn against using statistics to make city-to-city comparisons.", "For a statement that is accurate but needs clarification, our rating is Mostly True.", "YouTube, Michael Bloomberg speech (2:40), Nov. 17, 2019", "PolitiFact, \"Michael Bloomberg says New York is safest big city in United States,\" Aug. 26, 2013", "Email, Michael Bloomberg campaign spokesman Stu Loeser, Nov. 26, 2019", "New York Mayor’s Office of Criminal Justice, \"Jail and Prison Inmates per 100,000 Residents,\" accessed Nov. 26, 2019", "New York Police Department, \"New York City Police Department Annual Firearms Discharge Report, 2013,\" 2014", "Email, James Jacobs, director of the Center for Research in Crime and Justice at New York University Law School, Nov. 25, 2019", "Email, Franklin Zimring, University of California, Berkeley, School of Law faculty director of criminal justice studies and author of The City That Became Safe: New York’s Lessons for Urban Crime and Its Control (2012), Nov. 25, 2019", "Email, John Jay College of Criminal Justice Research and Evaluation Center director Jeffrey Butts, Nov. 25, 2019", "Email, John Jay College of Criminal Justice lecturer Eugene O’Donnell, Nov. 25, 2019", "Email, Jeffrey Fagan, professor of law at Columbia Law School and professor of epidemiology at the School of Public Health at Columbia University, Nov. 26, 2019", "New York City Mayor’s Office, \"Mayor Bloomberg and Police Commissioner Kelly Announce 2013 Saw the Fewest Murders and Fewest Shootings in Recorded City History at NYPD Graduation Ceremony,\" Dec. 27, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]