["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, Snopes readers asked us to look into remarks made by former Congressman Trey Gowdy during a Fox News discussion about U.S. House Speaker Nancy Pelosi and COVID-19 relief.", "On Dec. 8, the right-wing website Western Journal published an article with the headline \"Trey Gowdy 'Madder Than Hell' After Pelosi Lets Her True COVID Relief Strategy Slip.\"", "The article presented a short excerpt of remarks made by Pelosi during a Dec. 4 news conference and attributed the following response to Gowdy:", "In an interview with Fox News’ Dana Perino on Monday [Dec. 7], Gowdy wasn’t buying that. “That’s one of the dumbest and also most despicable things I have ever heard an alleged leader say,” Gowdy told Perino.", "“Just because Joe Biden won, it’s OK to do it, but if Donald Trump had won — I mean when you’re suffering, when you’re, like, in economic self-defense mode, you don’t care about politics. You just want to keep your business going, your family fed, you don’t want to be evicted from your home.”", "...“What’s missing, Dana, is if Paul Ryan or John Boehner had said or done what she just said, there would be media outcries. … What other entity has commented on what the speaker of the House just said? It really is so outrageous. It’s hard to get me upset, but what she just said makes me madder than hell.” It should make a whole lot more people than Trey Gowdy madder than hell.", "Those comments, including \"What she just said makes me madder than hell,\" were correctly attributed to Gowdy. They can be viewed in full, below:", "By contrast, Western Journal's presentation of what Pelosi said was lacking, as was that of Fox News. Pelosi was speaking about ongoing Congressional negotiations over both an omnibus spending bill for 2021, and renewed COVID-19 relief, at a Dec. 4 news conference. The remarks quoted in the Fox News segment were as follows:", "What was then before was not more of this — this has simplicity. It's what we've had in our bills. It's for a shorter period of time, but that's ok now because we have a new president.", "Fox News, Gowdy and Western Journal all misrepresented that brief excerpt — taken from much longer remarks — as an illustration of crass and cynical partisanship on the part of Pelosi that, as Gowdy put it, \"Because her team won in November, she's going to do something.\"", "However, in her full remarks, Pelosi explained that her and other Democrats' renewed optimism about striking deals with their Republican counterparts before the holidays came in part from the impending distribution of a COVID-19 vaccine, a development that would in time ease the economic and public health burden on the American people, as well as the incoming presidency of Biden — not merely because of their shared party, but specifically because she saw the president-elect's likely approach to pandemic-related problems as markedly superior to that of outgoing President Donald Trump.", "During her news conference, Pelosi spoke of a \"new dynamic\" surrounding the negotiations, and decried what she characterized as the approach of the outgoing Trump administration to the damage caused by the COVID-19 pandemic:", "One of the saddest parts of it is the neglect that this administration has paid. Delay, denial, distortion, \"hoax.\" And now, finally, we have a new dynamic. A new president, in a little more than a month, committed to crushing the virus. A new dynamic. A vaccine, a successful vaccine, more than one successful vaccine, to make all the difference in the world.", "Specifically, Pelosi also cited her concern about November employment figures, released earlier on Dec. 4, as \"further indicative of the need for us to crush the virus so the economy can get going.\"", "Later, Pelosi was asked by a reporter to clarify what had changed that made her more optimistic about cutting deals with Congressional Republicans. This is the portion of the news conference during which she made the remarks cherry-picked by Fox News and Western Journal. Her full answer provides important context and a proper understanding of her position — which Fox News, Gowdy, and Western Journal denied their viewers and readers by presenting only a few seconds of:", "Perhaps you missed what I said earlier. Joe Biden committed to ending and crushing the virus and having a [\"build back better\"] initiative. A vaccine. Answer to our prayers... That is a total game-changer. A new president, and a vaccine. So what then before was not more of this — this has simplicity. It's what we've had in our bills. It's for a shorter period of time, but that's ok now because we have a new president — a president who recognizes that we need to depend on science to stop the virus, a president who understands that America's working families need to have money in their pockets in a way that takes them into the future...", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]