["About this rating", "\"Tilapia\" is the market name of a variety of mild-flavored, inexpensive freshwater fish species commercially farmed, harvested, and consumed throughout the world. As of 2016, it was the fourth most popular seafood species eaten in the United States.", "Despite the recognized health benefits of consuming tilapia (and fish generally), however, the product has been maligned by claims that the farm-raised species are riddled with contaminants, lack essential nutrients, and contain a less desirable balance of omega-6 fatty acids versus omega-3 fatty acids than do other popular types of seafood.", "An Internet meme making the social media rounds since 2017 goes so far as to claim that tilapia is a \"mutant\" species not found in nature that is literally \"killing our families\" because it is so unhealthy to eat. True to form, the fear-mongering meme does not cite a single source to support its extreme claims:", "To begin with the most obvious flaw in this error-riddled presentation, it is illustrated with a commonly used stock photo of a tilapia fish showing that it does, in fact, have skin. Tilapia also have bones (as anyone who has ever cleaned or filleted one knows).", "Please enjoy this educational video:", "Next we encounter the claim that tilapia can't be found in the wild, and that it's \"being harvest [sic] in artificial fish farms.\" But although it's true that the majority of the tilapia sold and eaten in the United States is harvested on fish farms (in Latin America and Asia), the species originated in the wild in the Middle East and Africa.", "Health concerns have been raised about the consumption of farm-raised versus wild-caught fish, mainly due to questionable aquacultural practices that can result in fish diseases, which some producers treat with antibiotics. However, Environmental Defense Fund scientist Tim Fitzgerald told the New York Times in 2014 that fish farming practices have been improving, and alert consumers can find \"healthy and eco-friendly farmed options\" by choosing their merchants carefully. Fitzgerald recommended aiming for a mix of both wild and farmed seafood for best results.", "Tilapia fish are mostly vegetarian and subsist on algae and freshwater plants in the wild, although, as the meme indicates, under aquacultural conditions they are fed corn and soybeans. Given that the vast majority of corn and soybean varieties grown worldwide are now genetically manipulated to be herbicide-tolerant and insect resistant, unless otherwise labeled the likelihood that farm-raised tilapia have eaten genetically modified products is quite high.", "There is no scientific evidence to support the assumption that feeding farm-raised tilapia genetically engineered products makes the fish unsafe for humans to consume, however. In an article published on the U.S. Department of Agriculture (USDA) web site, Iowa State University food scientist Ruth S. MacDonald notes that there is no evidence that altered DNA from GMO feed is transferred to the animals that consume it, nor that GMO foods generally pose a health risk to human beings. The scientific consensus on GMO safety remains strong.", "The claim that eating tilapia \"is worse than eating bacon or a hamburger\" appears to have been gleaned from web sites reacting to a 2008 study pointing out that farm-raised tilapia offers a less desirable ratio of health-promoting omega-3 fatty acids to potentially inflammatory omega-6 fatty acids. A summary of the research said:", "“For individuals who are eating fish as a method to control inflammatory diseases such as heart disease, it is clear from these numbers that tilapia is not a good choice,” the article says. “All other nutritional content aside, the inflammatory potential of hamburger and pork bacon is lower than the average serving of farmed tilapia.”", "The article notes that the health benefits of omega-3 fatty acids, known scientifically as “long-chain n-3 polyunsaturated fatty acids” (PUFAs), have been well documented. The American Heart Association now recommends that everyone eat at least two servings of fish per week, and that heart patients consume at least 1 gram a day of the two most critical omega-3 fatty acids, known as EPA (eicosapentaenoic acid) and DHA (docosahexaenoic acid).", "But, the article says, the recommendation by the medical community for people to eat more fish has resulted in consumption of increasing quantities of fish such as tilapia that may do more harm than good, because they contain high levels of omega-6 fatty acids, also called n-6 PUFAs, such as arachidonic acid.", "We hasten to note that there is an obvious difference between saying that the inflammatory potential of hamburger and bacon is lower than that of tilapia, and saying that eating tilapia is \"worse\" than eating those other foods. More importantly, the overall implications of the study have been challenged by other experts. Sanford Health nutrition researcher William S. Harris wrote that despite its particular fatty acid content, eating tilapia is still a healthy choice, and replacing it with bacon, hamburgers, or donuts is \"absolutely not recommended\":", "Eating fish, especially oily fish, at least twice per week is recommended for heart disease prevention. Fish is low in total and saturated fats, high in protein and essential trace minerals, and contains long-chain omega-3 fatty acids (EPA and DHA). Oily fish rich in these healthy omega-3s include salmon, trout, albacore tuna, sardines, anchovies, mackerel and herring. Our omega-3 needs can also be met by eating less-oily (lower-fat) fish more often.", "Tilapia and catfish are examples of lower-fat fish that have fewer omega-3s than the oily fish listed above, but still provide more of these heart-healthy nutrients than hamburger, steak, chicken, pork or turkey. Actually, a 3 ounce serving of these fish provides over 100 mg of the long chain omega-3 fatty acids EPA and DHA. Considering that this is about the current daily intake of these fatty acids in the U.S., even these fish should be considered better choices than most other meat alternatives. Since they are also relatively low in total and saturated fats and high in protein, they clearly can be part of a healthy diet.", "According to Walter C. Willett, professor of nutrition at Harvard School of Public Health, the authors of the tilapia study overlooked the established health benefits of omega-6 fatty acids:", "[T]he notion that omega-6 fats are bad just hasn't panned out. For one thing, how the body uses arachidonic acid doesn't depend on the ratio of omega-3 and omega-6 fats. For another, the argument overlooks the other good things that omega-6 fats do. These include lowering LDL and triglycerides, boosting protective HDL, and helping control blood sugar by making muscle cells respond more readily to insulin.", "In fact, \"the doubling of the intake of omega-6 fat in the American diet since 1960 is one reason why heart disease deaths have declined since then,\" says Heart Letter advisor Dr. Walter C. Willett, professor of nutrition at Harvard School of Public Health.", "As to the claim that \"dioxin is found in this fish,\" while it's accurate to say that the toxic (and sometimes carcinogenic) chemical compounds known as dioxins sometimes turn up in both wild and farmed seafood (as they do in other foods), we came up short when we looked for proof that dioxins are found in tilapia more often than in any other seafood. Exposure to industrial contaminants such as dioxins is likely to vary according to where (i.e., in what countries) the fish are harvested.", "At least one scientific report found that farmed fish such as tilapia are no more prone to contamination by dioxins (or mercury, for that matter) than wild-caught specimens. Another study found that tilapia, like other smaller, relatively short-lived species, are less likely to accumulate such contaminants in their flesh than larger, longer-lived species such as salmon.", "The bottom line is that none of the supposed justifications for avoiding tilapia or claiming that \"it's killing our families\" hold water. To the contrary, the U.S. Food and Drug Administration (FDA) included tilapia in its 2017 list of \"best choices\" for seafood consumption by pregnant women and children, recommending two to three servings per week. The FDA also recommends eating a variety of fish, obviating the need to worry about balancing one's intake of fatty acids.", "Haspel, Tamar.  \"Tilapia Has a Terrible Reputation. Does It Deserve It?\"\r\n  The Washington Post.  24 October 2016.", "McCarthy, Sky.  \"The Truth About Tilapia.\"\r\n  Fox News.  9 April 2014.", "Oaklander, Mandy.  \"Should I Eat Tilapia?\"\r\n  Time.  4 June 2015.", "Rosenthal, Elisabeth.  \"Another Side of Tilapia, the Perfect Factory Fish.\"\r\n  The New York Times.  2 May 2011.", "Servick, Kelly.  \"Once Again, U.S. Expert Panel Says Genetically Engineered Crops Are Safe to Eat.\"\r\n  Science.  17 May 2016.", "Taylor, David A.  \"Aquaculture Navigates Through Troubled Waters.\"\r\n  Environmental Health Perspectives.  June 2009.", "Vasudevan, Krishnan.  \"Ask Well: What Fish Is Safe to Eat?\"\r\n  The New York Times.  8 December 2014.", "Weaver, Kelly L., et al.  \"The Content of Favorable and Unfavorable Polyunsaturated Fatty Acids Found in Commonly Eaten Fish.\"\r\n  Journal of the American Dietetic Association.  July 2008.", "Harvard Health Publishing.  \"Flap Over Tilapia Sends the Wrong Message.\"\r\n  November 2008.", "Sanford Health.  \"An Open Letter Regarding Recent Reports that Low-Fat Fish Like Tilapia Are Unhealthy.\"\r\n  16 July 2008.", "Seafood Health Facts.  \"Tilapia.\"\r\n  Accessed 12 April 2018.", "U.S. Department of Agriculture.  \"Scientific Report of the 2015 Dietary Guidelines Advisory Committee.\"\r\n  February 2015.", "U.S. Food and Drug Administration.  \"Advice About Eating Fish.\"\r\n  January 2017.", "Wake Forest Baptist Medical Center.  \"Wake Forest Researchers Say Popular Fish Contains Potentially Dangerous Fatty Acid Combination.\"\r\n  8 July 2008.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]