["About this rating", "When President Joe Biden redecorated the Oval Office, military flags that were displayed by the previous administration were removed.", "However, these military flags are not traditionally displayed in the Oval Office. During most presidencies, two flags have been displayed behind the Resolute Desk: The American flag, and a flag bearing the presidential seal.", "Whenever a new U.S. president takes office, the Oval Office in the White House is redecorated to better match the incoming president's tastes. In January 2021, for instance, the Oval Office underwent a number of changes in preparation for President Joe Biden's arrival. New paintings were hung on the wall, new portraits and sculptures were placed around the room, a \"Diet Coke button\" was taken out, and around the perimeter of the Oval Office, military flags were removed.", "The Washington Post reported that Biden will keep the two flags traditionally displayed behind the Resolute Desk in the Oval Office — the American flag, and a flag bearing the presidential seal —but that he removed the military flags that had adorned former President Donald Trump's Oval Office:", "\"Gone are the flags of the branches of the military that Trump displayed behind the Resolute Desk. Biden has installed an American flag and another with a presidential seal.\"", "Trump had numerous flags displayed in the Oval Office. In addition to the two flags traditionally displayed behind the Resolute Desk, the American flag and the presidential seal, Trump also displayed additional American flags and flags representing the military branches around the perimeter of the Oval Office.", "While most modern presidents have only displayed two flags behind the Oval Office, Fox News notes that Trump was not the first to add additional flags. Fox News reported:", "Most modern presidents, but not all, have displayed only two flags behind the Resolute Desk – the American flag and the presidential seal, according to the Atlantic.", "Archival photos show former Presidents John F. Kennedy, Lyndon Johnson and Richard Nixon had displayed military battle flags in the office.", "When Biden took office, all of the flags, except the two behind the Resolute Desk, were removed. The photograph at the top of this article shows the Oval Office on Biden's first day in office.", "The change in flags, of course, is not the only difference between Trump and Biden's Oval Office. BBC reported that Biden also replaced a portrait of Andrew Jackson with one of Benjamin Franklin, removed a bust of Winston Churchill, and added portraits and sculptures of various historical figures, such as Alexander Hamilton, civil rights activists César Chávez and Rosa Parks, and former presidents Thomas Jefferson, Franklin D. Roosevelt, George Washington, and Abraham Lincoln.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]