["The photos were published in this Facebook post on September 12, 2019, which has been shared almost 500 times.", "Below is a screenshot of the misleading post:", "The post’s Bengali-language caption translates to English as: “CPM’s great procession against the misrule of Yogi government in Lucknow, the capital of Uttar Pradesh. Paid media of BJP will not show you this.”", "CPM refers to Communist Party of India (Marxist) and Yogi refers to Yogi Adityanath, chief minister of the north Indian state of Uttar Pradesh. Lucknow is the capital city of Uttar Pradesh.", "The post was shared also Facebook here, here and here alongside a similar claim.", "The claim is false; these photos actually show recent pro-democracy demonstrations in Hong Kong.", "Below is a screenshot of the first photograph from the misleading post:", "A reverse image search on Google found the photo published here on the website for the Associated Press news agency on July 7, 2019.", "The caption states: “Protesters take part in a march in Hong Kong on Sunday, July 7, 2019. Thousands of people, many wearing black shirts and some carrying British flags, were marching in Hong Kong on Sunday, targeting a mainland Chinese audience as a month-old protest movement showed no signs of abating.”", "Below is a side by side comparison of part of the image from the misleading Facebook post (L) and the Associated Press photo (R):", "The image was captured here on the border of Wan Chai and Causeway Bay according to Google Street View.", "Below is a screenshot of the second photo shared in the misleading Facebook post:", "A Google reverse image search found the photo published here on Bloomberg’s website alongside an article about the Hong Kong protests on June 16, 2019.", "The photo’s caption states: “Protesters march during a rally in Hong Kong on Sunday, June 16. PHOTOGRAPHER: PAULA BRONSTEIN/BLOOMBERG”.", "Below is a side by side comparison of the image shared in the misleading Facebook post (L) and the image published by Bloomberg (R):", "The photo was taken here in Causeway Bay next to Victoria Park, according to Google Street View.", "Below is a screenshot of the third image from the misleading Facebook post:", "A reverse image search on Google found the photo was taken by the Reuters news agency and published here on its website on June 16, 2019.", "The photo’s caption states: \"Protesters attend a demonstration demanding Hong Kong's leaders to step down and withdraw the extradition bill, in Hong Kong, China, June 16, 2019. REUTERS/Tyrone Siu.\"", "Below is a side by side comparison of the image shared in the misleading Facebook post (L) and the image published by Reuters (R):", "The photo was taken here in Causeway Bay, according to Google Street View.", "Below is a screenshot of the fourth image from the misleading Facebook post:", "Another reverse image search on Google found the fourth image was a screenshot from this video of a pro-democracy protest in Hong Kong’s on 16 June, 2019. The screenshot was taken at the 21-second mark of the video.", "Below is a side by side comparison of part of the image from the misleading Facebook post (L) and the original photo (R):", "The video was captured here on the border of Wan Chai and Admiralty districts, according to Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]