["About this rating", "On 18 April 2017, the entertainment website World News Daily Report (WNDR) published a fake news article claiming that Bruce Franklin, a Philadelphia man, killed and ate his wife after being stuck in an elevator for 71 hours:", "44-year old Bruce Franklin was arrested this morning, after he confessed to killing his wife and eating her flesh while he was stuck with her in an elevator.", "According to the Philadelphia Police Department, the partially devoured corpse of his wife was lying next to him when he was rescued after being stuck for three days in an elevator.", "There is no truth to this story. WNDR is a well-known satirical website with a long history of peddling fictional news articles. The site carries this disclaimer:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "As with many of its fake news stories, WNDR used photographs from unrelated events in order to lend credence to its claims:", "Although we have not been able to uncover the exact source for the mugshot, that image has been online since 2011 when it was included in a gallery of \"funny hair\" mugshots.", "Another image in the article shows Philadelphia Police Deputy Commissioner Richard Ross, correctly identified by WNDR, but the photograph was taken during a City Council budget hearing in April 2016, not a press event concerning a man who just ate his wife.", "The final photograph in the article, of the elevator shaft, was taken inside the National Lift Tower in Northampton, England.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]