["About this rating", "The decades-old Alaska Permanent Fund pays annual dividends to state residents conditionally; in 2015, that dividend equaled $2,072; Alaskans pay no sales or income tax.", "The amount paid out annually fluctuates and isn't always exactly $2,072; the Permanent Fund was not created to prevent Alaskans from leaving.", "The meme reproduced above appeared at some point in 2015, claiming that residents of Alaska are entitled to a yearly payout for staying in the state:", "If you live there 190 days a year and aren't a convicted felon, you get an annual check from the state of Alaska just for not leaving. This year it was $2,072.00 per person regardless of age. Oh, and they have no income tax or state sales tax, either.", "That initiative indeed exists. It is known as the Alaska Permanent Fund Dividend (colloquially called the PFD), its disbursement is reported annually in the national media, and the dividends come from the Alaska Permanent Fund's investments:", "The dividend calculation (PDF) is based on the number of eligible Alaskan applicants in a dividend year and half of the statutory net income averaged over the five most recent fiscal years. The available funds are also reduced by prior-year dividend obligations, PFD operation expenses, and other state agency program appropriations.", "The PFD is occasionally referenced as a rare American application of the concept of universal basic income:", "The PFD did not initially have broad support in the legislature. Many lawmakers felt that the money distributed as dividends could be more beneficially spent on public programs and, particularly, on capital projects which would increase the physical infrastructure of roads, harbors, airports, power generation, etc. in the state—investments considered to be a necessary pre-requisite for economic development. There was also fear that much of the PFD would be spent unwisely—on everything from alcohol to trips to Hawaii—and that it would be an inducement for people to drop out of the labor market and become an economic burden. But supporters argued that if the objective was to provide benefits for all Alaskans, there was no better way than to give them cash so they could decide for themselves what to spend it on rather than leaving that decision to the government.", "The annual distribution soon became the most popular program of state government. Although the Permanent Fund balance, which ultimately determines the size of the PFD, is constitutionally protected, there is no such guarantee for the annual distribution. The legislature has the authority to change the formula at any time and could, by law, eliminate it entirely. Its only guarantee is its political popularity. No legislator would suggest a change in the formula that would reduce its amount or the share of Permanent Fund earnings allocated to the dividend for fear of losing the next and all subsequent elections.", "On 2 October 2014, the Los Angeles Times, not sparing a single Alaska-related pun, reported that the payout that year was one of the largest in the state's history:", "An avalanche of free money strikes Alaska on Thursday as the oil-rich state government deposits $1,884 into the bank account of nearly every year-round resident.", "The $1.1-billion payout is the third-largest since the Alaska government began using earnings from a rainy-day account, created by windfall oil revenue, to pay people for living here. The arrival of the money has become an annual holiday for families and retailers, part Christmas, part Black Friday.", "This Alaska-centric perk probably got attention because of the advent of memes of its type on social media. The claim fits neatly onto many images of photogenic Alaska, serving as a fun fact and appealing fantasy rolled into one, perhaps increasing its popularity.", "The claim as presented is mostly accurate, although it's specifically for 2015. The APF was established via ballot initiative in 1976:", "During construction of the Trans-Alaska Pipeline in the 1970's, oil companies flooded state coffers with money paid for leases to explore and secure drilling rights. The Legislature spent all $900 million of that initial lease money within a few years. Alaskans realized that they were about to receive a great deal more money from oil when the pipeline was complete. They wished to better safeguard the robust income forthcoming from the pipeline, but the state constitution did not allow for dedicated funds. So Alaskans voted in 1976 to amend the constitution to put at least 25% of the oil money into a dedicated fund: the Permanent Fund. This would save money for future generations, which would no longer have oil as a source of income. In 1976 Governor Hammond proposed a constitutional amendment to create the Fund. The 9th Alaska Legislature modified the governor's legislation and placed it as a ballot proposition in the 1976 General Election. It passed by a margin of two to one.", "Former Alaska governor Jay Hammond, who created the system, said in 2004 that he was actually hoping to make the fund much bigger:", "I wanted to put literally four times as much money. I would have loved to put all of it in, but I realized we’d be lucky to get any of it into a permanent fund. So I proposed half (tape skip) bonuses, royalties, and severance taxes. The legislature cut out severance taxes and automatically reduced the input by half and cut the 50 percent to 25 percent, which cut it again. So one-quarter of what I proposed went in. And we did get something and we did get a dividend program but then it got what I call zovolized which totally distorted and abused it into the degree where I even thought about after the Supreme Court decision, I very briefly thought about vetoing the bill. But then I concluded it was far better than nothing and - but I refused to sign the - I’m the only governor that has never signed their permanent fund dividend check. I don’t know if you know that. I had my commissioner of administration sign them. Governor Murkowski the other month or two ago said something about one thing Hammond and I both were delighted to do is sign permanent fund dividend checks. I didn’t sign them. I was that disgusted in the manner in which it went.", "According to the web site for the Alaska Permanent Fund Corporation, which manages its portfolio, the fund was not created specifically to entice Alaskans to stay, but rather as a failsafe against volatile oil futures:", "The 1976 state law establishing the Permanent Fund (AS 37.13), states that the Fund was created:", "• to provide a means of conserving a portion of the state's revenue from mineral resources to benefit all generations of Alaskans\n• to maintain safety of principal while maximizing total return\n• to be a savings device managed to allow maximum use of disposable income for purposes designated by law", "The Alaska Constitution states that the Fund's principal cannot be spent. The dividend can only be paid from Fund earnings. If the earnings reserve is zero or negative on June 30, no money can be paid out.", "The PFD's ties to fluctuating markets mean that some years see drastically lower (or higher) payouts than others. While the dividend climbed to $1,963.86 in 2000, it plummeted to $845.76 in 2005. By 2008 it reached $2,069.00, hit a low of $878.00 in 2012, and reached $2,072.00 in 2015 (arguably its highest ever).", "Other requirements cited in the meme were also mostly accurate, as were its claims about sales tax and income tax (although Alaska was considering introducing an income tax as of December 2015).  And while you can be a convicted felon and still receive a dividend, you can't receive one in the year that you have been convicted:", "The meme most likely appeared before the state announced in June 2016 that the PFD payouts would be capped at $1,000 through at least 2019 in order to address an ongoing fiscal crisis.", "DeMarban, Alex and Yereth Rosen.   \"‘Day Of Reckoning’: Gov. Walker Vetoes Hundreds Of Millions In Spending, Caps Permanent Fund Dividend At $1,000.\"\r\n    Alaska Dispatch News.   29 June 2016.", "Hopkins, Kyle.   \"Alaska Gives Every Resident $1,884 Despite Declining Oil Revenue.\"\r\n    Los Angeles Times.   2 October 2014.", "Johnson, Kirk.   \"As Oil Money Melts, Alaska Mulls First Income Tax In 35 Years.\"\r\n    New York Times.   25 December 2015.", "Luckerson, Victor.   \"Why Everyone Who Lives In Alaska Is Getting $1,884 Today.\"\r\n    TIME.   2 October 2014.", "Merchant, Brian.   \"The Only State Where Everyone Gets Free Money.\"\r\n    Vice.   4 September 2015.", "Raines, Liz.   \"Gov. Walker Caps This Year’s PFD Checks At $1,000.\"\r\n    KTVA.   29 June 2016.", "Stigall, Russell.   \"Cost Cuts And Dividend Caps With Alaska Gov Bill Walker.\"\r\n    Seward City News.   7 September 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]