["Photographs of the dead body of a woman constable have been widely shared on social media with the claim that she was raped and murdered in Congress-ruled Punjab. The pictures are circulating against the backdrop of the alleged rape in Uttar Pradesh’s Hathras, which is under the Bharatiya Janata Party’s rule.", "#प्रियंका गांधी वाड्रा यह भी एक महिला है देखते हैं आपके मुंह में जुबान है या नहीं। पंजाब फतेहगढ़ चुरियन रोड यार्ड शंगना…", "Posted by Raju Das Ayodhya on Friday, 2 October 2020", "The claim adds that she was dumped on the roadside in Fatehgarh Churain near Sangatpura village.", "पंजाब में पुलिस महिला कांस्टेबल की हत्या..", "क्या पुलिस भी सुरक्षित नही है.. सिर्फ हाथरस पर राजनीति करेंगे.. राजस्थान, छत्तीसगढ़ में आये दिन बलात्कार की घटनाएं हो रही हैं, बेटियां सुरक्षित नहीं हैं। pic.twitter.com/90kTgGdGA8", "— Veere Vishal (@VeereVishal) October 2, 2020", "The constable’s identification card has also been shared which says that her name was Nomi, D/O Salim Masih from Amristar. This led us to several media reports. According to Tribune India, constable Nomi died on the spot after her scooter was hit by a speedy Mahindra Scorpio SUV near Sangatpura village on October 1.", "The incident was also reported by Punjab Kesari and Punjab Jagran.", "A verified Punjabi YouTube channel uploaded a video report on the incident where the photographs currently viral were featured.", "An earlier fact-check report by Aaj Tak carries Amritsar commissioner’s statement. “The claim of rape and murder is absolutely baseless as the woman constable died in a road accident. She was working in the MSK branch of Amritsar District Police.”", "Pictures of a woman constable who died in a road accident in Punjab are viral with the false claim that she was raped and murdered.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]