["Del. Kirk Cox has been leading Republican criticism that Virginia is off to a slow start in getting COVID-19 vaccines into the arms of citizens.", "Cox laid the blame on outgoing Democratic Gov. Ralph Northam on Jan. 13 during the GOP response to Northam’s State of the Commonwealth speech.", "\"The Northam administration’s ability to distribute and administer vaccines has been extremely disappointing,\" Cox said. \"Ranking in the bottom third of states nationally, every state we border is doing a better job than Virginia in administering this life-saving vaccine.\"", "Cox, from Colonial Heights, is a former speaker of the House who is seeking the Republican gubernatorial nomination this year, and his criticism is likely to become a campaign issue. So we fact checked his claim about Virginia’s bottom-third ranking and found that he was being charitable in describing the roll out.", "The day Cox made his statement, Virginia ranked 39th among states in getting its allotted vaccine doses into people’s arms, according to Becker’s Hospital Review, a health systems website that, among many other things, analyzes data from the Centers for Disease Control and Prevention.", "Since then, Virginia’s ranking has fallen. On Jan. 19, the latest date of CDC data available at this writing, Virginia ranked 48th. From the 853,000 vaccines distributed to the state, 327,000 shots were given - a 38.3% rate.", "The national rate was 50.4%. The two states trailing Virginia were Georgia and Alabama. North Dakota had the highest rate, using 82% of its allotted vaccines for shots.", "Northam’s response", "At a Jan. 14 news conference, Northam said he was satisfied with the vaccine rollout. \"This is probably one of the most massive logistical efforts that has ever taken place in Virginia, when you think about it, to get 8.5 million Virginians not one dose, but two doses,\" he said. \"I’m pleased with the way we’ve rolled.\"", "Administration officials have said published Virginia data is undercounted because of delays and glitches in the state’s electronic reporting system. During the seven-day period ending on Jan. 19, Virginia averaged giving 17,464 shots a day, according to the state Department of Health’s dashboard. Northam said he wants to reach 50,000 shots a day and have all Virginians double vaccinated by early to mid summer.", "Northam took steps last week to speed things up. He announced that all people 65 and older would now be eligible for the vaccine, and so would people aged 16 to 64 with health problems. Northam said that makes about half of Virginians eligible for vaccines. The rest will qualify later.", "Our ruling", "Cox said on Jan.13 that Virginia ranked \"in the bottom third of states nationally\" in getting its allotted COVID-19 vaccines into arms. Virginia ranked 39th in the nation on that date. Although not part of this ruling, it should be noted that Virginia has since fallen to 48th, even though it has picked up pace in giving vaccines.", "We rate Cox’s statement True.", "Kirk Cox, GOP response to the State of the Commonwealth speech, Jan. 13, 2021 (0:27 mark).", "Becker’s Hospital Review, \"States ranked by percentage of COVID-19 vaccines administered,\" Jan. 13, 2021.", "Centers for Disease Control and Prevention, \"Covid-19 vaccinations in the United States,\" accessed Jan. 15-19, 2021.", "The New York Times, \"See How the Vaccine Rollout Is Going in Your State,\" accessed Jan 15-19, 2021.", "Gov. Ralph Northam, News conference comments, Jan. 14, 2021 (43:35 mark)..", "Virginia Department of Health, Covid-19 vaccine dashboards, accessed Jan. 20, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]