["About this rating", "On 13 November 2018, the Facebook page \"Stop The World, the Deplorables Want Off\" posted an image graphic featuring a photograph of Donald Trump Jr. and a quote ostensibly uttered by him about the deadliest fire in the history of California during an appearance on Tucker Carlson Tonight:", "Let California burn. It's what they voted for. Notice no fires in red states. - Donald Trump Jr., 11/12/18, Tucker Carlson Tonight.", "This is not a genuine quote from Donald Trump Jr.", "Stop the World the Deplorables Want Off (you can see their watermark down the length of Trump Jr's tie) is an entertainment page that frequently posts \"parody\" content:", "This is a mixture of political memes & messages. We make a lot of parody posts & those are NOT meant to be taken seriously. Check for “quotations marks”.", "Another indication that this quote was fabricated is the fact that Donald Trump Jr. did not appear on Tucker Carlson Tonight on the stated date. A synopsis for the episode, which can be viewed here, makes no mention of Trump Jr. or the fire in California:", "Nov. 13, 2018 - 39:35 - On Monday, Tucker Carlson investigates the election recount ongoing in Florida. Mysterious ballots appearing in close races. Then later, Tucker Carlson reacts as Democrat Kyrsten Sinema defeats Republican Martha McSally in the Arizona Senate race. Plus: Hillary Clinton might run in 2020.", "Donald Trump Jr. did not say \"Let California burn. It's what they voted for. Notice no fires in red states.\" This quote was made up out of whole cloth by a parody Facebook page.", "Grinberg, Emanuella.   \"44 Dead in California Fires as the Camp Fire Becomes the Deadliest in State History.\"\r\n    CNN.   13 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]