["108 people died from Covid-19 in China on February 10th, one of the worst days so far.", "It is true that 108 people died in China from Covid-19 on 10 February, however, this death toll has since been surpassed.", "26,383 people die of cancer each day.", "This is broadly correct.", "24,641 die of heart disease every day.", "This is an underestimate for all cardiovascular disease deaths, but close to the daily figure of those who die from coronary heart disease specifically.", "4,300 people die of diabetes every day.", "This is broadly correct.", "Suicide is the cause of death for around 3,000 people per day", "Suicide is the cause of death for around 2,000 people per day.", "Mosquitoes kill 2,740 people every day.", "This appears to be an overestimate. Mosquitoes are responsible for no more than around 700,000 deaths per year, or 1,900 a day.", "Humans kill 1,300 fellow humans every day.", "This is broadly correct if just considering homicides and not including war or terrorism.", "Snakes kill 137 people every day", "This is an underestimate. Snakes kill around 378 people per day.", "A post comparing Covid-19 death rates to other things that can kill people has been shared thousands of times on Facebook.", "The post reads:", "“One of the worst days so far for Coronavirus was the 10th of February. On that day, 108 persons in CHINA died of coronavirus.", "BUT, on that same day", "26,283 people died of Cancer", "24,641 died of Heart Disease", "4,300 people died of Diabetes", "and on that day, Suicide, unfortunately, took more lives than the virus did, by 28 times.", "Moreover, Mosquitoes kill 2,740 people every day, HUMANS kill 1,300 fellow humans every day, and Snakes kill 137 people every day.", "Take a deep breath, and wash your hands.”", "It’s true that over a 24 hour period spanning 10-11 February, the World Health Organisation (WHO) reported that 108 people had died in China of Covid-19 after contracting SARS-CoV-2 (the new coronavirus that causes Covid-19). This was at the time the highest death rate for a single day.", "Since then, there have been days with a higher number of recorded deaths. According to the WHO, from 23-24 February there were 156 deaths globally (150 of which were in China).", "Looking at the figures for all the other causes of death mentioned in the post, some are broadly right while others are incorrect. The general claim implied by the post, that all the things listed kill more people per day than Covid-19 has so far is also correct.", "However, it’s important to bear in mind that this isn’t comparing like with like. A virus can spread and kill people very differently to the other things mentioned. One of the reasons why viral outbreaks attract concern from medical authorities is that they may have the potential to kill many more if they are allowed to spread unchecked. So while it’s important to put the risks of coronavirus in perspective, raw numbers like these shouldn’t necessarily be taken as an indicator of how concerned you should be about any of them.", "The estimate for cancer deaths is broadly correct. According to the World Health Organisation's (WHO) International Agency for Research on Cancer, there were 9.6 million deaths from cancer in 2018. That works out to around 26,000 deaths a day worldwide.", "17.9 million people died from all cardiovascular diseases in 2016 according to the WHO—this works out as 49,000 a day, way above the figure given in the Facebook post. Ischaemic  heart disease or coronary heart disease specifically was the cause of 9.4 million deaths worldwide in 2016, 25,840 a day, closer to the post’s estimate.", "In 2016 the WHO estimated that 1.6 million people a year die from factors relating directly to diabetes. This is about 4,400 a day, so the Facebook post is broadly correct.", "But, the post overstates the number of people who died by suicide. The WHO estimated there were 800,000 people who died by suicide in 2018, equivalent to around 2,000 per day, while the Facebook post suggests there are closer to 3,000 per day.", "The post claims that mosquito-borne diseases kill 2,740 people a day, which works out at a million per year. This also seems an overestimate. The WHO estimates that vector-borne diseases (spread by animals) account for 700,000 deaths per year, of which at least 440,000 are by mosquitos alone through transmitting malaria and dengue fever (around 1,205 per day).", "The figure for deaths caused by other humans seems fairly correct looking specifically at homicides. The United Nations Office for Drugs and Crime estimated that in 2017 464,000  died globally from homicide, which is about 1,270 a day. This number would be higher if deaths from war or terrorism were included.", "The WHO estimates that up to 137,800 people die each year from snake bites, about 378 a day, or double the number given in the Facebook post. However, they also note that underreporting of snake bites and subsequent deaths is common, so it’s likely this number could be higher still.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as true\n            because it is generally correct to say that more people die each day from these causes than Covid-19.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]