["About this rating", "The abortion rate has steadily declined since the 1980s throughout both Democratic and Republican administrations, with a greater rate of decline during the former.", "The reasons behind differing rates of decline in the abortion rate cannot be definitively tied to actions undertaken by the administrations of different political parties.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In September 2020, social media users began circulating a text meme charting the decrease in abortion rates in the U.S. during previous presidential administrations, attributing the greater drop in those rates during Democratic administrations to a difference in approach (i.e., making it illegal vs. making it unnecessary):", "As we noted in an earlier article on a similar topic, following the 1973 Roe v. Wade Supreme Court decision that protected a pregnant woman's liberty to choose to have an abortion without excessive government restriction, the abortion rate rose immediately afterward until it peaked in the 1980s, and it has fairly consistently declined since that peak through presidential administrations of both parties:", "Following nationwide legalization of abortion in 1973, the total number, rate (number of abortions per 1,000 women aged 15–44 years), and ratio (number of abortions per 1,000 live births) of reported abortions increased rapidly, reaching the highest levels in the 1980s before decreasing at a slow yet steady pace.", "Although it is true that the abortion rate has experienced greater declines during Democratic administrations than Republican ones, we can't draw any definitive conclusion that, as the meme tries to suggest, this difference is primarily due to varying approaches by the two main political parties.", "The simple idea presented by the meme has a number of flaws, chief among them that political factors that might influence the abortion rate (e.g., policies, legislation, judicial appointments and rulings) do not neatly conform to presidential terms of office -- what takes place during one administration generally continues to have an effect throughout subsequent administrations. As well, events occurring at state and local levels (not necessarily directly tied to federal actions) can have a substantial impact on the availability and prevalence of abortions.", "More important, though, is that we cannot definitively determine to what extent political factors influence the abortion rate. As the Guttmacher Institute (a pro-abortion-rights research organization) observed, recent declines in the abortion rate appear to have been driven not primarily by abortion restrictions but by a broader decline in pregnancies:", "Abortion restrictions target either individuals’ ability to access the procedure (such as by imposing coercive waiting periods and counseling requirements) or providers’ ability to offer it (such as through unnecessary and intentionally burdensome regulations). Any one of these restrictions could result in some people being forced to continue pregnancies they were seeking to end; this could, in theory, lower the abortion rate.", "With the available evidence, it is impossible to pinpoint exactly which factors drove recent declines, and to what degree. However, previous Guttmacher analyses have documented that abortion restrictions, while incredibly harmful at an individual level, were not the main driver of national declines in the abortion rate ... Rather, the decline in abortions appears to be part of a broader decline in pregnancies, as evidenced by fewer births over the same period.", "What's driving that decline in pregnancies, then? We don't know that for sure, either, but likely a combination of social, cultural, economic, medical, and political factors:", "Experts say the decline isn’t due to a single cause, but rather a combination of several factors, including changing economics, delays in childbirth by women pursuing jobs and education, the greater availability of contraception, and a decline in teen pregnancies.", "The trend seen in the United States is also seen in much of the developed world, including Western Europe, said Dr. John Rowe, a professor at Columbia University’s Mailman School of Public Health. One important factor driving this is the changing roles of women in society, Rowe said.", "“In general women are getting married later in life,” he explained. “They are leaving the home and launching their families later.”", "[Dr. Helen Kim, an associate professor at Northwestern University’s Feinberg School of Medicine] said the concept of the ideal family size may be changing. “There are shifts where having smaller families is a trend,” she added. “I can’t speak on this as a sociologist, but this is what I’ve seen among my peers and colleagues.”", "One of the biggest factors is the decline in teen pregnancies, Rowe said. “That’s good news ... And that makes a huge difference to their lives.”", "The Guttmacher Institute posited a similar mix of factors to explain the decline in the abortion rate:", "Because both abortions and births [have] declined, it is clear that there were fewer pregnancies overall in the United States ... The big question is why.", "One possible contributing factor is contraceptive access and use. Since 2011, contraception has become more accessible, as most private health insurance plans are now required by the Affordable Care Act (ACA) to cover contraceptives without out-of-pocket costs. In addition, thanks to expansions in Medicaid and private insurance coverage under the ACA, the proportion of women aged 15–44 nationwide who were uninsured dropped more than 40% between 2013 and 2017. There is evidence that use of long-acting reversible contraceptive methods -- specifically IUDs and implants -- increased through at least 2014, especially among women in their early 20s, a population that accounts for a significant proportion of all abortions", "Another possible contributing factor might be a decline in sexual activity. Findings from one national survey suggest a long-term increase in the number of people in the United States -- mostly younger men -- reporting not having sex in the past year.", "Yet another possibility is that infertility is increasing in the United States, thereby reducing the chances of getting pregnant and subsequently seeking to obtain an abortion.", "More generally, there are a host of other potential factors that could be driving declines in pregnancy rates, from individuals’ evolving desires about whether and when to become parents to people’s changing economic and social circumstances.", "Finally, it is possible that ... there could have been an increase in self-managed abortions happening outside of medical facilities, which the census would be unable to capture.", "The Centers for Disease Control and Prevention (CDC) also offered a combination of potential explanations for lower abortion rates:", "Multiple factors influence the incidence of abortion including the availability of abortion providers; state regulations, such as mandatory waiting periods, parental involvement laws, and legal restrictions on abortion providers; increasing acceptance of nonmarital childbearing; shifts in the racial/ethnic composition of the U.S. population; and changes in the economy and the resulting impact on fertility preferences and access to health care services, including contraception.", "As we stated four years ago, \"causation between the presidency and abortion rates [is] difficult to demonstrate in any case, because it is hard to draw a straight line between federal government policy (let alone presidential policy) and abortion procurement.\" That observation remains true today.", "Carroll, Linda and Shamard Charles, M.D.   \"Americans Aren't Making Enough Babies to Replace Ourselves.\"\r\n    NBC News.   13 January 2019.", "Nash, Elizabeth and Joerg Dreweke.   \"The U.S. Abortion Rate Continues to Drop: Once Again, State Abortion Restrictions Are Not the Main Driver.\"\r\n    Guttmacher Institute.   18 September 2019.", "Kasprak, Alex.   \"Abortion Rates Fall During Democratic Administrations and Rise During Republican Ones.\"\r\n    Snopes.com.   11 November 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]