["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In September 2020, shortly after 2020 Democratic presidential nominee Joe Biden visited Kenosha, Wisconsin, in the wake of a series of protests in response to the police shooting of a Black man, an image supposedly showing a tweet sent by Biden started to circulate on social media:", "This fake tweet read: \"When I was in Kenosha, there wasn't half the damage that @realDonaldTrunp made it out to be. He's always gas lighting that the problems are in Democrat ran cities. What I observed in Kenosha was fewer black people than in major cities which means less looting. So he can't just say the problems are just because who runs the cities and states.\"", "This is a fake tweet that was never posted to Biden's account.", "For starters, this tweet does not appear anywhere on Biden's Twitter timeline. It also doesn't appear in ProPublica's database of deleted tweets.", "The message, which is 342 characters, also exceeds Twitter's characters limit of 280 characters. Lastly, the above-displayed image is actually a cropped version of the original fake tweet. The larger version includes the supposed date — April 9, 2020 — that it was posted to Biden's Twitter timeline. This is impossible, of course, because Kenosha wasn't at the center of protests until several months later when Jacob Blake was shot on Aug. 23.", "Milwaukee Journal Sentinel.   \"Joe Biden in Kenosha: Candidate 'Felt Good About' Wisconsin Visit.\"\r\n    7 September 2020.", "Clarke, Chevas.   \"What we know about Jacob Blake.\"\r\n    CBS News.   6 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]