["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Supporters of President Donald Trump stand outside the U.S. Capitol on Jan. 6, 2021, in Washington. (AP/Magana)", "John Sullivan, an activist from Utah, joined supporters of President Donald Trump who stormed the U.S. Capitol on Jan. 6. He said he was trying to document what happened.", "There’s no evidence that Sullivan “incited (the) insurgence” alone amid a crowd of thousands. Video he uploaded online shows his perspective as he filmed.", "Sullivan denied any affiliation to the broad antifa coalition, although he has posted related hashtags on his Twitter accounts. There remains no legitimate evidence that the mob at the Capitol was infiltrated or led by antifa activists in disguise.", "UPDATE, Jan. 15, 2021: Following the publication of this fact-check, John Sullivan was arrested Jan. 14 in Utah, the U.S. Justice Department announced. He was charged in a criminal complaint with one felony count of interfering with law enforcement in connection with a civil disorder, as well as misdemeanor charges of unlawful entry and disorderly conduct.", "An affidavit from an FBI agent that was filed in support of the criminal complaint and arrest warrant noted that despite Sullivan’s claims that he was present as a journalist, he has no press credentials and is not affiliated with any journalistic organization. The affidavit does not say Sullivan led the mob.", "Social media users and allies of President Donald Trump have continued pushing the baseless claim that it was antifa activists, not Trump supporters, who mobbed the U.S. Capitol.", "There’s no evidence that the crowd was infiltrated or led by antifa activists in disguise, and specific individuals held up online as antifa activists have turned out to be Trump supporters. One man accused of being an \"antifa thug,\" for example, is actually a supporter of the QAnon conspiracy theory. Another man labeled as an antifa activist is really a known neo-Nazi.", "But claims faulting antifa for the violence at the Capitol keep coming. The latest target is Utah’s John Sullivan, the founder of Insurgence USA, an activist group against police brutality.", "\"Anti-Trump founder of radical left-wing group ‘Insurgence USA’ John Sullivan incited insurgence of U.S. Capitol,\" said the text over one image shared widely on Facebook. The post originated on Parler, a social media platform targeted to conservatives.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Other posts sought to link him to antifa.", "Sullivan has not been shy about his presence at the Capitol riot. He filmed the events as they happened, and he was nearby when Capitol police fatally shot a woman inside the building. He described the shooting during an interview with CNN’s Anderson Cooper that night.", "Sullivan confirmed to PolitiFact that he entered the building with the rioters, and that he is in the photographs shown as part of the Facebook post.", "But there’s no proof that he \"incited (the) insurgence,\" and he has denied any affiliation with antifa, a broad coalition of anti-fascist activists. In a Jan. 8 press briefing, FBI Assistant Director Steven D’Antuono said the agency has \"no indication\" that antifa played a role.", "In interviews with PolitiFact and other national and local news outlets, Sullivan said he went to the riot to document what happened, not to participate. On his two Twitter accounts, Sullivan shared videos he captured as the crowd stormed into the Capitol, including a nearly 40-minute YouTube video that graphically documents Ashli Babbitt’s fatal shooting by police.", "\"I was not leading that in any shape, form or fashion,\" Sullivan said of the mob that bashed through windows and doors and stormed the Capitol. \"I didn’t organize it. I had no part in planning it. I was only there to experience and witness what went down.\"", "Jade Sacker, a documentary filmmaker working on a project about Sullivan and his brother, was there alongside Sullivan for much of the riot. As she filmed Sullivan and the mob around him, he was in her sight \"40 to 50% of the time,\" Sacker told PolitiFact.", "\"I wouldn’t say that he was directing the charge or anything. He was certainly actively there and interested in what was going on,\" Sacker said. \"He was recording the whole time.\"", "PolitiFact reviewed Sullivan’s video of the mob into the Capitol and Babbitt’s shooting. It doesn’t show Sullivan clearly engaged in the violence or leading the run up to the Capitol, although it does show him animated as he spoke with police and rioters from the frontlines.", "At points in the video, Sullivan can be heard telling others he was only filming and discouraging violence. At other points, he appeared to encourage what was happening. As rioters scaled a wall outside, for example, he cheered them on. \"We did this s---, together,\" he said after the barricades came down. \"This is f------ history. We’re all a part of this f------ history.\"", "\"Let’s burn this s--- down,\" Sullivan can be heard saying on the video before heading inside. It was not clear if the comment was directed to or heard by any specific person or people.", "He told Deseret News he was trying to blend in. In other videos online, he can be seen filming.", "\"He was vocal, but I wouldn’t say he was inciting violence,\" Sacker said.", "Sullivan spoke with police and FBI agents Jan. 7 about the shooting he witnessed, he said. \"You could say if I were going to be arrested, they would’ve done so,\" he said.", "Investigations by law enforcement agencies are ongoing, with several arrests made among the thousands of Trump supporters who took part in the chaotic scene. But there’s no evidence that Sullivan \"incited (the) insurgence\" on his own, as the Facebook post suggests.", "Social media users have linked Sullivan to antifa and Black Lives Matter because of his past protest history and social media activity. His Twitter accounts have frequently used #antifa, #blm, and other anti-Trump or anti-police hashtags, PolitiFact found. The cover photo for one of his accounts advertised a Jan. 6 Insurgence USA event to \"Kick These Fascists Out of DC.\"", "Sullivan has also been filmed using incendiary language in the past. At a small August rally in Washington, D.C., he described the need to \"rip\" Trump out of office, according to Fox News. Photos highlighted on his personal website show him holding a firearm.", "But Sullivan said he’s not a part of the antifa coalition often blamed for violent events, noting that Trump supporters at the riot were shouting \"f--- antifa.\"", "Sacker said she has followed Sullivan for four months and accompanied him to many protests, including some affiliated with Black Lives Matter. He is not pro-Trump, she said, but he cares about \"dismantling the system.\" She said she had not personally seen him be violent.", "Sullivan faces criminal charges related to a June 29 protest in Provo, Utah, according to public records. Deseret News reported that he helped organize the event and was seen on recordings kicking and threatening drivers while directing protesters to block intersections.", "PolitiFact found no other criminal history.", "Those claiming antifa infiltrated or led the mob at the Capitol have provided no proof. The evidence of Trump supporters participating, however, is indisputable.", "The march to the Capitol was weeks in the making, with plans indicating the potential for violence drawn up in the open on social media forums and pro-Trump websites. Video and photographs from the scene show Trump-branded paraphernalia and flags.", "A Facebook post claimed Sullivan \"incited (the) insurgence of (the) US Capitol.\"", "Sullivan joined the mob of Trump supporters that entered the Capitol, filming the events as they transpired and posting his videos online. But he was one person among thousands. There’s no evidence that he \"incited\" the violence himself or led the charge into the Capitol.", "Sullivan denied any affiliation with antifa, although he has posted related hashtags on Twitter.", "We rate this statement Mostly False.", "PolitiFact researcher Caryn Baird contributed to this report.", "UPDATE, Jan. 11, 2021: This fact-check was updated to include more detail from Sullivan’s video at the Capitol. Our ruling remains the same.", "Facebook post, Jan. 6, 2021", "Various searches through PACER and public records, Jan. 8, 2021", "John Sullivan on Twitter, accessed Jan. 8, 2021", "Jayden X on Twitter, accessed Jan. 8, 2021", "Jayden X on YouTube, \"Shooting and Storming Of The US Capitol In Washington DC (View Discretion Is Advised),\" Jan. 7, 2021", "Deseret News, \"Utah activist inside U.S. Capitol says woman killed was first to try and enter House chamber,\" Jan. 8, 2021", "U.S. Department of Justice, \"Thirteen Charged in Federal Court Following Riot at the United States Capitol,\" Jan. 8, 2021", "Buzzfeed News, \"The FBI Says There's No Evidence Of Antifa Involvement In The Capitol Mob,\" Jan. 8, 2021", "KUTV, \"Utahn inside US Capitol describes chaotic scene,\" Jan. 7, 2021", "Deseret News, \"Utah activist inside U.S. Capitol says woman killed was first to try and enter House chamber,\" Jan. 7, 2021", "Fox News, \"BLM activist inside Capitol claims he was 'documenting' riots, once said 'burn it all down,'\" Jan. 7, 2021", "KSL TV, \"Utahn Behind Social Justice Group At Washington March,\" Jan. 6, 2021", "CNN, \"Anderson Cooper 360,\" accessed via TVEyes, Jan. 6, 2021", "Heidi Hatch on Twitter, Jan. 6, 2021", "Deseret News, \"Organizer of Provo protest arrested, accused of rioting, making threats,\" July 10, 2020", "PolitiFact, \"There’s no proof antifa stormed the Capitol. The rumor spread quickly anyway,\" Jan. 7, 2021", "Phone interview with John Sullivan, founder of Insurgence USA, Jan. 8, 2021", "Phone interview with Jade Sacker, documentary filmmaker, Jan. 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]