["About this rating", "On 20 December 2017, President Donald Trump signed Executive Order 13818, \"Blocking the Property of Persons Involved in Serious Human Rights Abuse or Corruption.\"", "That executive order declared \"a national emergency with respect to serious human rights abuse and corruption around the world\" and provided \"for the imposition of sanctions on actors engaged in these malign activities.\" The order also authorized the U.S. Treasury to freeze the assets of persons \"who commit serious human rights abuse or engage in corruption\":", "“Today, the United States is taking a strong stand against human rights abuse and corruption globally by shutting these bad actors out of the U.S. financial system. Treasury is freezing their assets and publicly denouncing the egregious acts they’ve committed, sending a message that there is a steep price to pay for their misdeeds,” said Secretary of the Treasury Steven T. Mnuchin. “At the direction of President Trump, Treasury and our interagency partners will continue to take decisive and impactful actions to hold accountable those who abuse human rights, perpetrate corruption, and undermine American ideals.”", "Specifically, it mandated that \"all property and interests in property that are in the United States\" belonging to persons identified in the order \"are blocked and may not be transferred, paid, exported, withdrawn, or otherwise dealt in.\" The order listed thirteen individuals (all of them foreign nationals) and also allowed for the U.S. Treasury to freeze the assets of \"any foreign person determined by the Secretary of the Treasury ... to be responsible for or complicit in, or to have directly or indirectly engaged in, serious human rights abuse\" as well as the assets of \"current or former government official[s]\" who have engaged in \"corruption.\"", "Shortly after the issuance of EO 13818, the web site Your News Wire published an article about it under the inaccurate and grossly misleading clickbait headline \"Trump Signs Executive Order To Seize Assets Of Clinton & Obama,\" with an opening sentence declaring that \"President Donald Trump has signed an executive order allowing federal agents to seize the assets of Hillary Clinton and Barack Obama.\" Nothing in EO 13818 specifically authorized the U.S. government to seize any assets belonging to former Presidents Obama or Clinton, nor did the text of the Your News Wire article provide any information supporting the premise of its false headline and lede.", "Executive Order 13818 is directed at thirteen foreign nationals identified in its Annex, as well as other \"foreign persons,\" two groups that do not include the Obamas or the Clintons. The order does more generally allow the U.S. Treasury to freeze the assets of \"any person\" who has \"materially assisted ... foreign person[s]\" in the conduction of \"human rights abuse[s]\" or government \"corruption.\" In an extremely vague and broad sense, those provisions could conceivably apply to the Clintons or Obamas ... or anyone else in the world. Nonetheless, the order doesn't mention any Obama or Clinton by name, it doesn't specifically target them (it's primarily aimed at foreign nationals and entities), and nothing in the Trump administration's announcement of the order suggested it could or would be applied to them:", "Today, the Trump Administration launched a new sanctions regime targeting human rights abusers and corrupt actors around the world. Building on the Global Magnitsky Human Rights Accountability Act passed by Congress last year, President Donald J. Trump signed an Executive Order (Order) today declaring a national emergency with respect to serious human rights abuse and corruption around the world and providing for the imposition of sanctions on actors engaged in these malign activities. In an Annex to the Order, the President imposed sanctions on 13 serious human rights abusers and corrupt actors. In addition, the Treasury Department’s Office of Foreign Assets Control (OFAC), acting on behalf of the Secretary of the Treasury, in consultation with the Secretary of State and the Attorney General, imposed sanctions on an additional 39 affiliated individuals and entities under the newly-issued Order.", "Of course, the gross and egregious misreporting about the nature of Executive Order 13818 was to be expected, as it originated with Your News Wire, a fake news site that peddles in sensationalized and fabricated clickbait stories.", "Executive Order 13818.   \"Blocking the Property of Persons Involved in Serious Human Rights Abuse or Corruption.\"\r\n    20 December 2017.", "U.S. Department of the Treasury.   \"United States Sanctions Human Rights Abusers and Corrupt Actors Across the Globe.\"\r\n    21 December 2017.", "Adl-Tabatabai, Sean.   \"Trump Signs Executive Order to Seize Assets of Clinton & Obama.\"\r\n    Your News Wire.   23 December 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]