["Chintu Verma, a Twitter user who is followed by BJP national general secretary Kailash Vijayvargiya, shared a video where a group of children are seen walking in a queue. In his Twitter and Facebook bio, Verma claims to be “BJP’s Indore district general secretary”.", "He claimed that these children were being given the training to become terrorists in a madrasa in Kolkata, however, they were rescued by the police. The message shared with the video read – “आतंकवाद की फैक्टरी! कोलकाता के राजा बाजार के एक मदरसे से आतंकवादी बनाने की ट्रेनिंग पाते 63 बच्चों को पुलिस ने मुक्त कराया! ये खबर मीडिया ने नहीं दिखाई, उन्हें ‘ऊपर’ से आर्डर नहीं हैं! लेकिन, सोशल मीडिया पर तो कोई ‘ऊपर वाला’ नहीं होता! यहाँ तो दिखाएं! ये है मदरसों की असलियत! (Terrorism factory! Police have rescued 63 children, who were attaining terrorist training from a madrasa in Raja Bazaar, Kolkata. Media won’t show this news, they don’t have order from above but on social media, there are no such higher authorities. See this. This is the reality of madrasas -translated)”. The tweet was retweeted by more than 1100 people, including Kailash Vijayvargiya and Ashok Srivastava, a senior journalist with DD News.", "On June 8, Alt News had debunked the same video propagated with a slightly different narrative. It was earlier claimed that these children were caught in Kolkata while on their way to a madrasa in Pune where they would be getting trained in terrorism.", "The video actually represents an incident which took place at Kolkata’s Sealdah railway station in 2015. The children were apprehended by the police due to the alleged lack of documentation. The Indian Express had reported at the time that these children were intercepted by the Government Railway Police (GRP) based on a tip-off by CINI Asha Child Welfare Society.", "A protest was staged against the apprehension, citing religious discrimination – “It is unfair on their part. Only because there are so many Muslims travelling, they think they are going to be trained as terrorists. Do we now need passports to travel within our own country? They were little children who were going to study”.", "In a conversation with Alt News, then chairman of the State Commission for Protection of Child Rights, Asokendu Sengupta categorically denied the allegation raised by the protesters against the detention of the children being an attempt to stop them from taking religious training. He said, “As far as my knowledge goes, first of all, the incident is old and we took the decision based on a report by the Childline Sealdah. In this particular case, some children accompanied by one or two senior members were going from one place to another without any documents. That’s why I asked the childline to not to allow them to move any further. According to JJ [Juvenile Justice] Act, CWC is the legal custodian of all the children (in need of care & protection, CNCP) of their respective districts. So the boys needed to be sent to their respective [district] CWC authorities for identification. The protestors started a clamour that the children were apprehended only with the intention to stop them from taking religious training. That was not the case at all.”", "BJP national general secretary Kailash Vijayvargiya had retweeted an old video propagated with a false claim. The students were not stopped because they were on their way to a madrasa where they would be given training in terrorism. They were intercepted for an alleged lack of documentation.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]