["“CAUGHT ON TAPE: ELECTION WORKERS FILLING IN BALLOTS! Delaware County, Pennsylvania,” says the caption of a November 5, 2020 video viewed more than 60,000 times.", "Shot from overhead, the 41-second video zooms in on four workers. One, in a black shirt and mask, is busy marking and stamping ballots.", "The video was shared thousands of times on Facebook including here and here. One of the posts is captioned, “Is it legal to fill out and stamp blank ballets?? Didn't think so…”", "The footage was retweeted more than 20,000 times here before Twitter labeled it with a warning, and it also spread on a “Stop The Steal” Facebook group. The group, with more than 40,000 members, was created on November 5 -- the same day Facebook shut down a days-old group of the same name for trying to delegitimize the election process.", "Pennsylvania is a battleground state that could decide the presidency, and where the vote tally of Democratic challenger Joe Biden on November 6 passed that of Trump. That outcome left Biden on the brink of victory.", "The Democrat’s gains did not come with the help of fraud as purported in the online video, which is taken from an official Delaware County livestream, according to a statement AFP received from the public relations office of the county on the edge of Philadelphia.", "The “manipulated video” is zoomed in to exclude “the bipartisan observers who were not more than six feet away and does not give the full picture of the process,” the statement said.", "Those observers can be seen in a screenshot released by the county.", "The election workers were manually transcribing ballots damaged by a machine used to open them, the county statement said.", "The damage meant those ballots could not be scanned successfully but, according to the scanner manufacturer, the best way to deal with them “is to transcribe the votes on each ballot to a clean ballot and scan the clean ballot,” it added.", "“As ballots were being transcribed, the original damaged ballots were directly beside the new ballots and bipartisan observers witnessed the process at close range. Damaged ballots have been preserved,” it said.", "The county’s election results livestream uses 11 cameras, all of which have a wide-angle view.", "Patrick Christmas, policy director of the non-partisan Committee of Seventy which has monitored elections in Pennsylvania for more than a century, said by email that the video shows a process known as “ballot recreation, done in teams of two and documented so that the duplicated ballot can be traced back to the original.”", "Michael Hagen, an associate professor of political science at Temple University in Philadelphia, said by email that the counting of ballots “involves Democrats and Republicans working together, with the intent of each monitoring the other.”", "Details of the ballot processing in Pennsylvania can be seen in a video here.", "Government officials and monitors in Pennsylvania have repeatedly stressed the integrity of the state’s election process.", "“We have very strong processes in place that make sure that voting integrity and security are constantly followed by every county in the state,” Secretary of the Commonwealth Kathy Boockvar told a November 5 press conference.", "Trump that same day appeared on television to make a series of inaccurate comments about the election results, blaming “illegal votes” for his disappearing lead and claiming Democrats were “trying to steal an election.”", "AFP previously debunked a claim from lawyer Rudy Giuliani that Trump’s lead in Pennsylvania was unassailable, and has also fact-checked other false claims of electoral foul play.", "The Committee of Seventy, which works to improve democracy and governance in Pennsylvania, called Trump’s claims “baseless and outrageous.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]