["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "One of the hallmarks of U.S. President Donald Trump's handling of the COVID-19 coronavirus disease pandemic crisis in the spring of 2020 was his repeatedly comparing the U.S. to other countries in areas such as COVID-19 testing, issuing (not necessarily accurate) declarations such as boasting that the U.S. had done \"more testing than the entire world together\" and asserting that, “We’ve done more tests in eight days than South Korea has done in eight weeks. And our tests are better.”", "In mid-May, Trump abruptly walked out of a press conference when pressed by a reporter to explain why he viewed the subject of COVID-19 testing as a \"global competition\" and placed so much emphasis on the amount of coronavirus tests that have been conducted in the United States compared to other countries. Needless to say, the reporter did not get a direct answer to the question from the president.", "But a quote meme circulated in May 2020 presented Trump as saying that undertaking more coronavirus testing made the U.S. \"look bad\" by revealing more infections -- even though revealing infections is one of the primary purposes of the testing. According to the meme, Trump lamented that, \"More testing only reveals more infections and therefore increases the numbers. In a way, by doing all this testing we make ourselves look bad\":", "The meme is essentially correct in its gist, although the first sentence in the statement it attributes to Trump appears to be The New York Times' elaboration of what he meant rather than a literal reproduction of his words:", "[Trump said] that more testing only reveals more infections and therefore increases the numbers. “In a way, by doing all this testing we make ourselves look bad,” he said.", "Trump has expressed a fixation with coronavirus case numbers on multiple occasions. For example, in March 2020, while a Grand Princess cruise ship remained in limbo off the coast of San Francisco after some of its passengers and crew tested positive for the COVID-19 coronavirus disease, Trump indicated his aversion to allowing it to dock and disembark passengers due to the effect that would have on \"the numbers.\" NPR reported:", "[Trump] said that he would prefer to have all [the passengers] stay on board, because the arrival of more infected people on U.S. soil would raise the country's case total.", "\"I'd rather have the people stay,\" Trump said, while also noting that he left the final decision in the hands of his administration's coronavirus task force.", "\"I would rather — because I like the numbers being where they are — I don't need to have the numbers double because of one ship that wasn't our fault,\" Trump said.", "And during an interview with ABC News in May 2020, Trump again suggested that increased testing was in some way a negative because it increased the number of coronavirus cases reported by the U.S. relative to other countries:", "TRUMP: [...] Okay, let's talk about cases. You know why we’re at a million cases? Because we have more testing than anybody else. If we tested as much as these countries down here, okay, who don't do very much testing at all. Look at Japan: very little testing. They're at the bottom of the rung.", "Look at South Korea, it gets so much publicity. The president of South Korea is a friend of mine. President Moon. He called up, he said, “What you're doing with testing is amazing.” If I tested this number of people instead of this number of people, I'd have far fewer -- if I -- see this line? It goes all the way up over 7 million tests. If I tested down here at 1 million tests, I would have a lot fewer cases too.", "They know -- the news knows it. They said the other day -- In other words, the better I do with testing, the more I get beat up by saying, “but you have more cases.” I have more cases because I --", "DAVID MUIR: I understand. I understand the argument you're making --", "As Washington Post once observed, \"Trump’s obsession with numbers has dominated and shaped the administration’s response to the coronavirus, as advisers and public health experts try to placate a leader who largely views the global pandemic through the political lens of how the statistics reflect on his presidency and hopes for reelection.\"", "Chappell, Bill and Vanessa Romo.   \"Coronavirus: Grand Princess Cruise Ship Docks Off California Coast.\"\r\n    NPR.   9 March 2020.", "McFall-Johnsen, Morgan.   \"Trump Said He Wants to Keep Grand Princess Cruise Passengers on the Ship So That US Coronavirus Numbers Don't 'Double.'\"\r\n    Business Insider.   6 March 2020.", "ABC News.   \"ABC News Anchor David Muir Interviews President Trump in Arizona.\"\r\n    6 May 2020.", "Baker, Peter.   \"Trump’s New Coronavirus Message: Time to Move On to the Economic Recovery.\"\r\n    The New York Times.   6 May 2020.", "The Associated Press.   \"Trump Abruptly Ends Briefing After Contentious Exchanges.\"\r\n    12 May 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]