["About this rating", "Beginning in October 2018, social media users regaled one another with what appeared to be a news article reporting the death of a New York City man who supposedly contracted an E. coli infection by performing analingus (oral-to-anal sex) on his girlfriend.", "The story they were sharing originated on a disreputable website called Huzlers, who published the article on 5 October. The headline read (grammatical errors in the original): \"Man Eats Girlfriends Booty for the First Time Dies from E. Coli.\" The text of the poorly written article reported that:", "Michael Benson wanted to try something new in bed to spice things up in bed with his girlfriend who will remain anonymous. After listening to a few Kevin Gates songs he decide it would be a good idea to try this new craze.", "Benson admitted himself to the hospital after he felt ill he told doctors he felt fine the day before and had no change in diet or any serious illnesses. Doctors asked him several questions and the only thing he could think of doing differently in his daily routine was eating his girlfriends ass.", "Doctors took blood from Benson and after several test he tested positive for E. Coli by this time 21 year old Michael Benson had already died at his home. This article and information was made public to raise awareness “Not all booty is good booty.”", "Like everything else on Huzlers, however, it was a complete work of fiction. A blurb beneath the article described the site, which was founded in 2013, as \"the most infamous fauxtire & satire entertainment website in the world.\"", "Huzlers' original catchline was \"Because you love being lied to,\" its founder said in a 2015 interview. The line was eventually revised to explicitly state that the site's content was satirical \"to avoid liability.\"", "Despite its fictional narrative, the basic premise of the article may well be worth heeding. Medical experts confirm that E. coli bacteria (and other pathogens) can be transmitted via oral-to-anal contact. The Centers for Disease Control (CDC) recommend using a dental dam for oral sex that involves either vaginal or anal contact.", "Wile, Rob.   \"The Founders of the Hottest Fake News Site in America Swear They're Not Trying to Fool Anyone.\"\r\n    Splinter News.   17 July 2015.", "Centers for Disease Control.   \"How to Use a Dental Dam as a Barrier for Oral Sex.\"\r\n   12 August 2016.", "Mayo Clinic.   \"E. Coli: Symptoms and Causes.\"\r\n    Accessed 28 November 2018.", "National Health Service.   \"Does Anal Sex Have Any Health Risks?\"\r\n    8 October 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]