["By Saranac Hale Spencer", "Posted on October 17, 2018", "Q: Was the Supreme Court’s decision in Roe v. Wade made because Jane Roe said she was raped?", "A: No. “Jane Roe” falsely claimed she was gang raped, but that accusation was not a factor in the court ruling.", "A viral video is circulating online framed by text that says: “Did you know Roe v. Wade was passed only because Roe lied about being raped?” That’s not true.", "Rape played no part in the U.S. Supreme Court’s 1973 decision in Roe v. Wade, the case that made access to abortion legal across the country. Rather, the court ruled, in a 7-2 opinion, that women had a constitutional right to abortion under the 14th Amendment’s right to privacy.", "In fact, the court’s decision didn’t mention the circumstances that led to the plaintiff’s pregnancy at all. It just said: “Roe alleged that she was unmarried and pregnant; that she wished to terminate her pregnancy by an abortion ‘performed by a competent, licensed physician, under safe, clinical conditions’; that she was unable to get a ‘legal’ abortion in Texas because her life did not appear to be threatened by the continuation of her pregnancy; and that she could not afford to travel to another jurisdiction in order to secure a legal abortion under safe conditions.”", "The woman who brought the case in 1970 under the pseudonym Jane Roe was Norma McCorvey, who had been living in Dallas County, Texas. It is true that in seeking an abortion in Texas she had initially claimed to have been gang raped and then, in a 1987 interview, McCorvey said that she had lied about the rape.", "“I found out I was pregnant through what I thought was love,” McCorvey said during the interview with journalist Carl Rowan in a documentary series called “Searching For Justice: Three American Stories.” McCorvey had hoped that by claiming she was raped, she’d be able to get around the Texas ban on abortion, which included an exception if the mother’s life were in danger, according to an interview with Rowan by the New York Times in 1987.", "But McCorvey never ended up getting an abortion. Her baby was born before the Supreme Court’s decision came down, and she gave up the child for adoption, according to testimony she gave to the Senate Judiciary Committee in 2005.", "One of the lawyers who represented McCorvey at the Supreme Court, Sarah Weddington, said in a statement shortly before the 1987 documentary aired that during the case she never “touched the issue of rape and only emphasized the question of whether the Constitution gives to the state or leaves to a woman the questions of what she can or must do with her body.”", "So, while it’s true that McCorvey had first claimed to have been raped and later recanted, it is not true that the claim had any bearing on the Supreme Court’s decision in Roe v. Wade.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Robichaud, Paul. Video — “Did you know that Roe vs Wade only was passed because Roe lied about being raped?” Facebook.com. 9 Oct 2018.", "Roe v. Wade. No. 70-18. Supreme Court of the U.S. 22 Jan 1973.", "Rowan, Carl. “Searching For Justice: Three American Stories.” Gannett. 1987.", "Noble, Kenneth. “Key Abortion Plaintiff Now Denies She Was Raped.” The New York Times. 9 Sept 1987.", "McCorvey, Norma. “TESTIMONY OF NORMA MCCORVEY, THE FORMER ROE OF ROE v. WADE, BEFORE THE SUBCOMMITTEE\nON THE CONSTITUTION OF THE SENATE JUDICIARY COMMITTEE.” Senate Committee on the Judiciary. 23 Jun 2005.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]