["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Who would have thought that the battle between Republicans Allan Fung and Ken Block in the race for governor would slip into a debate over Nazis?", "But it did, thanks to a Facebook posting.", "On Aug. 18, Fung's campaign manager and spokesman, Patrick Sweeney, issued a statement complaining of a \"disgusting and offensive campaign tactic.\" The tactic? \"The use of Nazi imagery by the Block for Governor campaign to describe supporters of Allan Fung for Governor.\"", "\"The Block Campaign's comparison of Fung supporters to Nazi soldiers is an unconscionable tactic,\" the release said.", "What’s this all about?", "It begins with a message that the Fung campaign says it spotted on the personal Facebook page of a man named Peter Godon, who lists his hometown as North Smithfield.", "It includes two, side-by-side images. One shows the torso of a woman wearing a blue T-shirt that says, \"Girls Just Wanna Have Fung,\" a play on the Cyndi Lauper song. The other shows a drawing of a man in a Nazi uniform.", "The message above the images: \"Can you spot any difference in their actions?\"", "The Fung campaign then issued the news release calling the posting \"disgusting and offensive,\"and  included the Facebook posting as part of the news release, which can be seen in the notes section of the Fung For Governor Facebook page.", "In the news release, Sweeney was quoted as characterizing Godon as \"a contributor and key supporter of the Block campaign\" and he alleged that the Block campaign was comparing Fung supporters to Nazis.", "When we looked for the original Facebook posting on Aug. 20, we could not find it.", "The key point we are checking is whether the Block campaign had any role whatsoever in the posting of the image.", "We checked the Block Facebook page and didn't see the image posted there, so we wondered whether the Block campaign was really equating Fung supporters with Third Reich soldiers.", "We emailed Sweeney asking for his evidence that Godon represented the Block campaign.", "While we were waiting, we asked Block spokesman Jeff Britt about Godon's role in the campaign.", "He said Godon had worked as an unpaid volunteer putting up signs, who only got reimbursed for expenses. Britt produced records showing that on three dates in May, July and August, Godon was reimbursed a total of $122.61 for white panel boards, hardware and posts he purchased at Lowe's and Home Depot.", "The latest campaign finance records on file with the Rhode Island Board of Elections show that Godon contributed $100 to Block on Jan. 20, 2014 and wrote a second check, for $25, that was received on June 2, 2014.", "Donating $125 to a campaign, even if you also volunteer to put up signs, doesn't exactly make you a \"key supporter\" in a multi-million dollar campaign.", "We emailed Godon and left a message on his home answering machine seeking information, but received no reply.", "Britt called the posting \"tasteless\" and said that by the time he looked for it on Godon's page, late on Aug. 18, it was gone. \"It had not been posted on our page. If it had shown up on our Facebook page, we would have taken it down,\" he said. \"And if you take it in the context that Ken Block is Jewish, nobody in our campaign is going to be making Holocaust jokes.\"", "When we got through to Sweeney, he said, the posting \"just got brought to my attention so we put out something quick on it.\" He said he wasn't sure who raised the matter and contended that, \"I don't think we said anything in our release that the Block campaign posted anything. As a matter of fact, I know we didn't say that.\"", "The next day, Fung spokesman Robert Coupe emailed us to again say that Godon \"was in fact a key supporter of the Block campaign\" because of the $125 donation, the $122.61 reimbursement, the fact that Godon posted photos of himself online with Block at a fundraising event, the fact the Godon has frequently posted messages on social media advocating for Block or attacking Fung, and he appeared in Block's \"Town Hall\" television commercial.", "We checked the 30-second commercial. Godon is shown as an attentive audience member for one second.", "Our ruling", "Allan Fung, represented by his campaign manager, said in a news release that Ken Block's campaign compared Fung supporters to Nazi soldiers.", "The Fung campaign could offer no meaningful evidence that any official with any authority in the Block campaign was involved in creating or posting the bizarre message.", "To suggest that being an unpaid volunteer, donating $125 to a campaign, and showing up for one second as an extra in a campaign commercial makes you a \"key supporter\" of a candidate is a huge stretch. And to suggest that a posting on a personal Facebook page by a supporter of the campaign automatically represents the opinion of the candidate or the candidate's campaign is an equally large contortion.", "We rate this claim False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "News release, \"Fung for Governor Campaign Calls on Ken Block to Renounce Disgusting Use of Nazi Imagery,\" Aug. 18, 2014, accessed Aug. 19, 2014", "Interview, Patrick Sweeney, campaign manager, Aug. 21, 2014", "Email, Robert Coupe, spokesman, Allan Fung for Governor campaign, Aug. 22, 2014", "Interviews, emails and campaign finance records, Jeff Britt, campaign manager, Ken Block for Governor campaign, Aug. 20-21, 2014", "RICampaignFinance.com, \"Contribution report\" page, accessed Aug. 20, 2014", "YouTube.com, \"Town Hall,\" Ken Block for Governor channel, July 3, 2014, accessed Aug. 22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]