["When President Donald Trump traveled to Missouri last month to promote tax cuts, he also touted the state’s low unemployment.", "\"Thirteen states this year have seen unemployment drop to the lowest levels in the history of their state. And I hate to tell you, but Missouri happens to be one of them,\" he told a crowd in St. Charles on Nov. 29, 12 days after the October preliminary unemployment rates were released.", "So is it true that Missouri is one of \"13 states this year (that) have seen unemployment drop to the lowest levels in the history of their state\"?", "We decided to find out.", "Missouri unemployment", "The White House didn’t respond to a request for evidence, so we don’t know how they got their numbers. But the usual way of looking at this question is to use data from the federal Bureau of Labor Statistics, the government’s official tabulator of employment statistics.", "The bureau compiles the seasonally adjusted highs and lows for states, which can be found on its website. It lists 13 states that have hit historic lows this year. Not included: Missouri.", "We looked at seasonally adjusted data, which is the way economists prefer to compare numbers in various months of the year. For example, during the holidays, there’s typically a bump in temporary or seasonal workers. So if employment grows by 2 percent every November due to seasonal workers, seasonal adjustment takes that 2 percent out of the equation.", "The seasonally adjusted preliminary unemployment rate for October is 3.5 percent, according to the Bureau of Labor Statistics. The historic low was from October 1999 through January 2000 when the unemployment rate was 3.1.", "Our Ruling", "In a visit to St. Charles, Trump said that Missouri is one of \"13 states this year have seen unemployment drop to the lowest levels in the history of their state.\"", "In fact, the state’s lowest unemployment rate on record occurred in 1999 and 2000.", "We rate this statement False.", "Donald Trump, speech in St. Charles, Missouri, Nov. 29, 2017", "Bureau of Labor Statistics, Local Area Unemployment Statistics, Accessed Dec. 12, 2017.", "Email, Peter Mueser, Dec. 12, 2017, Professor of Economics, University of Missouri", "Phone call, Jacqueline Michael-Midkiff, Regional Economist and Chief of Information, ‎Bureau of Labor Statistics, Dec. 13, 2017.", "Bureau of Labor Statistics, Current Unemployment Rates for States and Historical Highs/Lows, Seasonally Adjusted, Accessed Dec. 13, 2017.", "Bureau of Labor Statistics, News Release, Nov. 17, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]