["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A conservative group in favor of legislation that benefits immigrants has a new ad claiming President Ronald Reagan said immigrants made America great — a jab to President Donald Trump’s campaign slogan and his hard-line immigration policies.", "\"Today, the Becoming American Initiative launched its first ad featuring a video of President Ronald Reagan talking about how immigrants have always made America great,\" the group said July 3. \"The message is especially important for conservatives and all Americans to hear on July 4th as President Trump pushes to limit immigration.\"", "The ad shows footage of Reagan talking about immigrants who \"brought with them courage and the values of family, work and freedom. Let us pledge to each other that we can make America great again.\"", "Reagan used the \"Let’s Make America Great Again\" slogan in his 1980 presidential campaign. Did he say what the ad shows?", "We found that Reagan in a 1980 campaign speech spoke about immigrants’ journey to America and of their contributions to society. The ad patched together what Reagan said about immigrants with his closing call for everyone to \"make America great again.\" The full speech wasn’t just about immigrants, it narrated Reagan’s grievances with Carter and the economy and Reagan’s own vision for America.", "We reached out to Becoming American Initiative, a conservative a 501(c)(4) nonprofit organization, via Twitter but did not hear back.", "The 30-second ad features Reagan’s voice over video of him delivering a speech with the Statue of Liberty in the background. It includes black and white video of a crowd of people walking and of men doing construction work, as well as video in color of a man picking fruit, of a child at the border, and a photograph of people waving American flags at what looks like a naturalization ceremony.", "Here’s a transcript of Reagan’s words:", "\"Through this Golden Door has come millions of men and women. These families came here to work. Others came to America and often harrowing conditions. They didn’t ask what this country could do for them but what they could do to make this refuge the greatest home of freedom in history. They brought with them courage and the values of family, work, and freedom. Let us pledge to each other that we can make America great again.\"", "A slide at the end of the video said: \"Immigrants Have Always Made America Great.\"", "The Becoming American Initiative ad is based on a Labor Day, Sept. 1, 1980 campaign speech Reagan delivered at Liberty State Park in Jersey City, N.J. Reagan went on to beat Democrat Jimmy Carter in the November election.", "With the Statue of Liberty in the background, Reagan paid tribute to immigrants, starting his speech by saying they came to America to work and helped build cities and \"incredibly productive farms.\"", "Reagan twice said \"make America great again\": around the middle of the speech, when he spoke about what his administration will do; and toward the end of the speech, when he called on everyone to also \"make America great again.\"", "The ad from Becoming American Initiative cut and patched together sentences. Below is a partial transcript of Reagan’s speech, in bold are the words the ad highlighted.", "\"Through this Golden Door, under the gaze of that Mother of Exiles, has come millions of men and women, who first stepped foot on American soil right there, on Ellis Island, so close to the Statue of Liberty.", "These families came here to work. They came to build. Others came to America in different ways, from other lands, under different, and often harrowing conditions, but this place symbolizes what they all managed to build, no matter where they came from or how they came or how much they suffered.", "They helped to build that magnificent city across the river. They spread across the land building other cities and towns and incredibly productive farms.", "They came to make America work. They didn’t ask what this country could do for them but what they could do to make this, this refuge the greatest home of freedom in history.", "They brought with them courage, ambition and the values of family, neighborhood, work, peace and freedom. We all came from different lands but we shared the same values, the same dream.", "Today a President of the United States would have us believe that dream is over or at least in need of change.", "Jimmy Carter’s Administration tells us that the descendants of those who sacrificed to start again in this land of freedom may have to abandon the dream that drew their ancestors to a new life in a new land.", "The Carter record is a litany of despair, of broken promises, of sacred trusts abandoned and forgotten. ...", "This country needs a new administration, with a renewed dedication to the dream of an America -- an administration that will give that dream new life and make America great again! Restoring and revitalizing that dream will take bold action. ...", "I want more than anything I've ever wanted, to have an administration that will, through its actions, at home and in the international arena, let millions of people know that Miss Liberty still \"lifts her lamp beside the golden door.\"", "Through our international broadcasting stations -- the Voice of America, Radio Free Europe, and the others -- let us send, loud and clear, the message that this generation of Americans intends to keep that lamp shining; that this dream, that this dream the last best hope of man on earth, this nation under God, shall not perish from the earth.", "We will instead carry on the building of an American economy that once again holds forth real opportunity for all, we shall continue to be a symbol of freedom and guardian of the eternal values that so inspired those who came to this port of entry.", "Let us pledge to each other, with this Great Lady looking on, that we can, and so help us God, we will make America great again.\"", "Several years later, Reagan signed into law the 1986 Immigration Reform and Control Act (IRCA), also known as the Simpson-Mazzoli Act. The law allowed about 2.7 million people to get green cards — including people who had been in the United States since 1982 and special agricultural workers.", "A Becoming American Initiative ad claimed Ronald Reagan said immigrants \"brought with them courage and the values of family, work, and freedom. Let us pledge to each other that we can make America great again.\"", "The ad is based on a 1980 Labor Day campaign speech in New Jersey, where Reagan lauded immigrants’ contributions, while also listing his grievances with Carter and his own vision for America.", "Reagan didn’t say immigrants \"made America great\" verbatim, but he did imply it. The ad cuts out some of Reagan’s words to make the comments appear adjacent. We rate Becoming American Initiative’s statement Mostly True.", "Ronald Reagan Presidential Library, Labor Day Speech at Liberty State Park, Jersey City, New Jersey, Sept. 1, 1980", "Becoming American Initiative, Immigrants Have Always Made America Great, July 3, 2018", "The New York Times, Trump’s Campaign Hat Becomes an Ironic Summer Accessory, Sept. 11, 2015", "IRS.gov, Types of Organizations Exempt under Section 501(c)(4), Page Last Reviewed or Updated: April 2, 2018", "YouTube, Ronald Reagan's Remarks at Liberty State Park on September 1, 1980, Ronald Reagan - Liberty State Park Address (Audio Enhanced)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]