["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Opponents of California's proposed tobacco tax say it 'cheats' schools. Photo by Florian Christoph / Flickr", "Opponents of Proposition 56, California’s proposed $2 per pack cigarette tax hike, are flooding radio airwaves with attacks on the measure.", "The initiative is one of many on the state’s November ballot.", "The No on 56 campaign is funded by tobacco companies Phillip Morris and R.J. Reynolds. Its campaign says online and in radio ads that the measure \"cheats schools out of at least $600 million a year.\"", "The industry attacks are not surprising. And they’ll likely continue as opponents of the measure have raised more than $35 million, while supporters have collected about $17 million.", "We wondered whether there’s any truth to the claim that Prop 56 ‘cheats’ schools out of all that money.", "Our research", "Nearly three decades ago, voters in California approved Proposition 98 requiring a minimum level of funding for public education. It requires the state to dedicate roughly 40 percent of new General Fund revenues to K-12 schools and community colleges.", "Prop 56 would generate up to $1.4 billion in tax revenue its first year.", "But instead of sending that revenue to the General Fund, Prop 56 would place it in a special fund to help pay for Medi-Cal, which provides health coverage for millions of low-income Californians.", "We asked the No on 56 campaign for evidence that the tobacco tax measure ‘cheats’ schools. A spokeswoman pointed to language in the measure that exempts Prop 56 from the school funding guarantee.", "The campaign said this exemption is proof that the measure undermines the funding guarantee and ‘cheats’ schools.", "But the experts we spoke with say there’s nothing new about this proposal. Past tobacco taxes, in 1988 and 1998, also established special funds rather than sending money to the General Fund.", "One of the experts said the opponents’ claim is misleading.", "\"When I think of this claim that the schools are going to be cheated -- particularly that word ‘cheated’ out of this money -- that suggests something that’s wrong or illegal. And this is not the case,\" said Steve Boilard, executive director of Sacramento State University’s Center for California Studies. \"There’s plenty of examples where new revenue is raised that is not subject to the Prop 98 funding guarantee.\"", "Boilard pointed to Proposition 63, a tax on wealthy Californians that funds mental health services.", "Curran Kelleher / Flickr", "Others reject claim", "State Superintendent of Public Instruction Tom Torlakson rejected the claim that the new tax measure ‘cheats’ schools.", "In a recent letter circulated by the Yes on 56 campaign, he wrote: \"Make no mistake, Proposition 56 will not divert a dime away from schools. Rather, it will raise revenues for school based tobacco prevention and intervention programs.\"", "A report by the Legislative Analyst’s Office estimates Prop 56 will add $20 million for those school based programs.", "The Sacramento Bee’s fact-checking team, PoliGRAPH, recently examined the same claim about Prop 56 ‘cheating’ schools.", "It found that it \"isn’t fair to say the measure 'cheats' schools out of $600 million a year. Nothing in the measure reduces school funding. If the measure passes, the budget for schools does not decrease.\"", "Our ruling", "The No on 56 campaign is running ads that say the proposed tobacco tax \"cheats schools out of at least $600 million a year.\"", "The measure includes an exemption from the state’s school funding guarantee. A portion of its revenues, estimated at up to $1.4 billion, could otherwise have been directed toward school funding.", "But past tobacco taxes and a tax to fund mental health services have also legally avoided this guarantee. Those had exemptions allowing their revenues to fund health services.", "This doesn't mean, however, that money will be taken from schools or community colleges under Prop 56. The measure, in fact, sends about $20 million to schools for tobacco prevention programs.", "The claim that Prop 56 \"cheats\" schools goes too far. It might have been accurate to say the measure exempts most all revenue from going to schools.", "But the term chosen by No on 56 is misleading.", "We rate the claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/aabdc989-5155-4716-837a-cae1783eac21", "No On 56 campaign website, accessed August 2016", "No On 56 campaign, No on 56 Launches First Radio Advertisements, August 16, 2016", "Yes On 56 campaign website, accessed August 2016", "Interview, Beth Miller, spokeswoman for No on 56 campaign, August 18, 2016", "Interview, Mike Roth, spokesman for Yes on 56 campaign, August 18, 2016", "Interview, Steve Boilard, executive director, Sacramento State University’s Center for California Studies, August 23, 2016", "Interview, Ken Kapphahn, senior fiscal and policy analyst, Legislative Analyst’s Office, August 25, 2016", "Tom Torlakson, letter on claims by No on Prop 56, August 9, 2016.", "Legislative Analyst’s Office, analysis of Prop 56, July 18, 2016", "Sacramento Bee, PoliGRAPH fact check, \"Tobacco companies mislead voters in radio ad,\" August 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]