["The meme was posted here on Facebook where it has been shared more than 12,500 times. It shows a small furry creature with sharp teeth and cheetah spots, clinging to a human fingertip.", "The text reads: “Not all Australian animals will kill you. Don’t get me wrong... he wants to. He just can’t.”", "The meme has also been shared more than 6,000 times in multiple Facebook posts here and here.", "While some immediately guessed the image was digitally altered, others believed it to be the real thing.", "However, a reverse image search on TinEye shows that a similar picture has been online since September 2014.", "This version of the animal doesn’t have the cat-like snout, sharp fangs and spots of the specimen in the meme. The picture is of a softer and more innocent-looking creature, taken by an Amanda McLean.", "It appears in an Australian Geographic article titled: “The western pygmy possum is the cutest Australian animal”, published on September 25, 2014.", "It describes the western pygmy possum as native to Australia and grows to just 7.7cm long, with an 8cm-long tail.", "McLean, who was a PhD student at the University of Adelaide at the time, took the picture while on a field trip to the Eyre Peninsula.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]