["By Chelsey Zhu", "Posted on December 13, 2019", "Facebook users are recirculating a meme from May that makes misleading economic comparisons between Presidents Barack Obama and Donald Trump. The meme includes inaccurate or selective information about Obama’s record on jobs and economic growth.", "In May, Tea Party Patriots Action, a conservative nonprofit organization, posted a partly false meme on its Facebook page, comparing the economy under Presidents Obama and Trump. The same meme has recently gone viral again, gaining thousands of shares.", "The meme claims that in the “8 years under Obama,” the U.S. lost “4 million jobs,” “unemployment peaked to 9.9%,” and GDP went “down 2.8%.” In contrast, it claims that in the “2 1/2  years under Trump,” the U.S. gained “5.1 million jobs,” “unemployment fell to 3.6%,” and GDP went “up 3.2%.”", "But the numbers for Obama are either wrong or cherry-picked, and the numbers for Trump are now out of date.", "As we’ve written before, there had been a net increase in jobs under Obama. Total nonfarm employment grew by more than 11.6 million, an 8.7% increase over his eight years.", "More than 4 million jobs were lost in Obama’s first year in office, but that was while the economy was still reeling from the Great Recession, which officially lasted from December 2007 until June 2009. That may be what the figure in the meme is based on, but it’s false to claim that represents jobs lost in the “8 years under Obama.”", "Also, the unemployment rate under Obama began at 7.8% in January 2009 (during the recession), peaked at 10% in October 2009 and remained at or above 9% until October 2011. But then it steadily declined. It was 4.7% when he left office in January 2017. Overall, the unemployment rate dropped 3.1 percentage points over his two terms.", "It’s not exactly clear how Tea Party Patriots Action measured the percent change in GDP under Obama, and the organization didn’t respond to our queries.", "According to the Bureau of Economic Analysis, annual real, inflation-adjusted GDP did decrease by 2.5% in 2009, but it increased every other year of Obama’s presidency. The average annual increase in real GDP from 2009 to 2016 was 1.6%.", "The Trump figures in the meme may have been accurate when the post first appeared on Facebook in the spring, but they are now outdated.", "The most recent figures from the Bureau of Labor Statistics show that total nonfarm employment has increased by over 6.5 million, or 4.5%, from when Trump took office in January 2017 through November 2019. And while the unemployment rate was 4.7% at the beginning of Trump’s term, it fell to 3.5% as of November — a decrease of 1.2 percentage points.", "It’s true that the BEA did initially estimate that real GDP in the first quarter of 2019 increased at an annualized rate of 3.2% — the figure used in the meme. But the BEA later revised its estimate to 3.1% growth in that quarter, and it most recently estimated that real GDP grew at an annualized rate of 2.1% in the third quarter of this year.", "On an annual basis, however, GDP growth has not reached above 3% during Trump’s term, despite his repeated promises of 4% to 6% growth per year. Real GDP was 2.9 percent higher in 2018 than it was in 2017, and it was 2.4 percent higher in 2017 than it was in 2016. The average annual increase in Trump’s first two years has been 2.6%.", "The BEA will announce its first estimate of GDP growth for all of 2019 at the end of January. That’s also around the time we plan to publish the next update of Trump’s Numbers, our quarterly scorecard of statistical measures of how things have changed since Trump took office.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "U.S. Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Total Nonfarm Employment, Seasonally Adjusted.” Data extracted 12 Dec 2019.", "U.S. Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; Unemployment Rate, Seasonally Adjusted.” Data extracted 12 Dec 2019.", "U.S. Bureau of Economic Analysis. “Domestic Product and Income.” Data extracted 12 Dec 2019.", "Jackson, Brooks. “Obama’s Final Numbers.” FactCheck.org. 29 Sep 2017, updated 24 Sep 2018.", "Jackson, Brooks. “Trump’s Economic Falsehoods.” FactCheck.org. 15 Nov 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]