["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Deputy Attorney General-designate, federal prosecutor Rod Rosenstein, listens on Capitol Hill in Washington, Tuesday, March 7, 2017, during his confirmation hearing before the Senate Judiciary Committee. (AP)", "A fake news headline stated that President Donald Trump has fired Rod Rosenstein, the deputy attorney general who tapped former FBI director Robert Mueller as special counsel to investigate connections between Trump’s 2016 campaign and Russia.", "\"Breaking: Trump fires deputy attorney general Rod Rosenstein, raising questions over Mueller’s fate,\" stated the Dec. 8 headline posted on Houstonchronicle-tv.com, an imposter website that mimics a real newspaper's name.", "Facebook users flagged the story as being potentially fabricated, as part of the social network’s efforts to combat fake news. The article is phony.", "A spokesman for the Justice Department, Ian Prior, confirmed for PolitiFact that Rosenstein remains deputy attorney general. Rosenstein first joined the Justice Department in 1990, and Trump nominated him as deputy attorney general in January. The Senate confirmed his nomination on April 25.", "Rosenstein oversaw the Russia inquiry at the Justice Department after Attorney General Jeff Sessions agreed in March to recuse himself from all proceedings related to the Russia investigation.", "In May, Rosenstein wrote a memo recommending that Trump fire former FBI director James Comey because of how he handled the Hillary Clinton email investigation. When Trump fired Comey, the White House made public Rosenstein’s memo.", "But recently, Trump has been critical of the Justice Department.", "In a Dec. 2 tweet, Trump wrote, \"Many people in our Country are asking what the \"Justice\" Department is going to do about the fact that totally Crooked Hillary, AFTER receiving a subpoena from the United States Congress, deleted and \"acid washed\" 33,000 Emails? No justice!\"", "Trump tweeted a day after Michael Flynn, his former national security adviser, pleaded guilty to one count of making false statements to federal investigators related to lying to the FBI that he hadn’t spoken about sanctions with Russian ambassador Sergey Kislyak.", "But a critical tweet is a far cry from a firing. Trump hasn’t fired deputy attorney general Rod Rosenstein. We rate this headline Pants on Fire.", "Houstonchronicle-TV.com, \"Breaking: Trump fires deputy attorney general Rod Rosenstein, raising questions over Mueller’s fate,\" Dec. 8, 2017", "U.S. Department of Justice, \"Meet the Deputy Attorney General,\" Accessed Dec. 11, 2017", "USA Today, \"Rod Rosenstein, deputy attorney general, defends Justice Department in wake of Trump criticism,\" Dec. 5, 2017", "Los Angeles Times editorial, \"Bashing Mueller and the FBI,\" Dec. 8, 2017", "AP, \"Trump alters story on why he fired Flynn,\" Dec. 3, 2017", "New York Times, \"Deputy Attorney General’s Memo Breaks Down Case Against Comey,\" May 9, 2017", "President Donald Trump, Tweet, Dec. 2, 2017", "PolitiFact, \"PolitiFact's guide to fake news websites and what they peddle,\" April 20, 2017", "PolitiFact, \"Who is Robert Mueller? New special counsel leading Russian investigation,\" May 17, 2017", "PolitiFact, \"Fact-checking Donald Trump’s NBC interview, claims about firing FBI Director James Comey,\" May 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]