["By Eugene Kiely", "Posted on March 15, 2018", "In making his case for renegotiating NAFTA, President Donald Trump told GOP donors that the U.S. has a trade surplus with Canada — but only because the trade balance “doesn’t include energy and timber.” That’s false.", "According to the U.S. Census Bureau, the U.S. ran a trade surplus in goods and services of nearly $2.8 billion with Canada last year. That includes timber and energy, the bureau told us.", "Trump made his remarks during a March 14 fundraising speech for Republican U.S. Senate candidate Josh Hawley in Missouri. At the event, Trump talked about the need to renegotiate the North American Free Trade Agreement and regaled GOP donors with a conversation he said he had with Canadian Prime Minister Justin Trudeau.", "As he tells it, Trump and Trudeau had a disagreement about the trade balance between the two countries. The president admitted that he didn’t know the facts when he told Trudeau that the U.S. has a trade deficit with Canada — an admission that has gotten a fair amount of news coverage.", "Here is a transcript published by the Washington Post, which obtained an audio of the president’s remarks:", "Trump, March 14: Trudeau came to see me, he’s a good guy, Justin. He said, “No, no, we have no trade deficit with you, we have none. Donald, please.” Nice guy, good-looking, comes in — “Donald, we have no trade deficit” — he was very proud, because everybody else you know were getting killed with our, so he’s [unintelligible]. I said, “Wrong, Justin, you do.” I didn’t even know. Josh [Hawley], I had no idea. I just said, “You’re wrong.” You know why? Because we’re so stupid. [Unintelligible, laughter] And I thought they were smart.", "I said, “You’re wrong, Justin.” He said, “Nope, we have no trade deficit.” I said, “Well, in that case, I feel differently,” I said, but I don’t believe it. I sent one of our guys out, his guy, my guy, they went out, I said, “Check, because I can’t believe it.”", "“Well sir you’re actually right. We have no deficit, but that doesn’t include energy and timber. But when you do we lose $17 billion a year.” It’s incredible.", "That’s not accurate. The Census Bureau, which is within the U.S. Department of Commerce, said its trade figures do include timber and energy and referred us to two publications that show that the agency does include timber and energy for imports and exports:", "Canada also includes timber and energy in its trade data, as shown in that country’s database of imports and exports between Canada and the United States.", "The Office of the U.S. Trade Representative said that mineral fuels were Canada’s second largest export to the United States in 2016 at $54 billion.", "We asked the White House what evidence the president had that the trade balance figures do not include timber and energy. We were referred to a tweet from White House Press Secretary Sarah Sanders that she posted after her March 15 press briefing.", "In the briefing I said I would provide the trade deficit number we have with Canada. In 2017 we had a $17.58 B trade deficit. In January 2018 we had a$3.63 B trade deficit. Both reflect trade in goods. Which is exactly what @POTUS referenced. https://t.co/PHm7hXdszD", "— Sarah Sanders (@PressSec) March 15, 2018", "But that tweet addressed only U.S. trade in goods — not goods and services — and it doesn’t at all address the president’s false claim that the trade figures do not include timber and energy.", "As we wrote earlier this month, Census Bureau figures show that the U.S. buys more in goods from Canada than it sends there, but it more than makes up for that deficit with an even bigger surplus in sales of services — chiefly travel, transportation and intellectual property (such as movies and software). On balance, the U.S. had a nearly $2.8 billion surplus in goods and services.", "The president has a tendency to focus just on goods and ignore services when talking about trade deficits, as we have noted before. But the U.S. hasn’t had a total trade deficit with Canada since 2014.", "And, while Trump attributes the trade deficit in goods to NAFTA, the nonpartisan Congressional Research Service said in a 2017 report that it “may also be attributed to other economic factors, such as energy prices.”", "We should note that Canada reported that it had a $26.8 billion surplus in goods and services with the U.S. in 2017. That would be about $19.8 billion in U.S. dollars based on the 2017 annual exchange rate of $1.350 Canadian dollar to $1 U.S. dollar.", "We asked the Census Bureau about this discrepancy between the two countries’ data, and we were told that it is common to have differences because of the methodologies used by different countries.", "One factor, we were told, is re-exports — which are products that Canada ships to the U.S. that originate in another country. Canada would know the origin of the product, but the U.S. may not — so re-exports are booked differently by each country. The same would go for re-exports from the U.S. to Canada.", "Either way, the trade imbalance with Canada — whether a $2.8 billion surplus or a $19.8 billion deficit — is relatively small compared with the total trade of $680.6 billion in goods and services last year between the two countries.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]