["Should we change the way we pick our president?", "That was the issue June 13, 2013, when the Rhode Island House of Representatives debated a proposal that would give all four of the state's electoral votes to whomever won the popular vote nationwide in a presidential election, regardless of whether the majority of Rhode Islanders voted for that candidate.", "The change is designed to bypass the Electoral College system, which encourages candidates to devote the vast majority of their energy to swing states, where the race is close. States like Rhode Island, where the Democratic candidate typically wins, are ignored.", "The proposal would not take effect until enough states -- enough to represent a majority of all electoral votes -- agree to the plan.", "Both the House and Senate have passed comparable versions of the bill but they have to agree on at least one chamber's version before it can go to the governor.", "During the House debate, Rep. Raymond Gallison, a Democrat from Bristol, asserted that the \"National Popular Vote\" initiative has widespread support in Rhode Island.", "\"Seventy four percent of Rhode Islanders support [a] national popular vote [for president] because they, as I, believe in one person, one vote,\" Gallison said.", "Getting 74 percent of Rhode Islanders to agree on anything controversial would be an accomplishment. But because we had never heard of a poll -- recent or otherwise -- on the issue, we asked Gallison for his source.", "He told us he would get back to us. Meanwhile, we checked around.", "We could find only one poll where Rhode Islanders were asked about the topic. It was on the website of National Popular Vote Inc., a \"social welfare\" nonprofit, tax-exempt organization that paid for the survey. The poll was conducted by Public Policy Polling, a Democratic-leaning survey firm based in North Carolina. Democrats tend to favor popular vote proposals.", "The question: \"There is a proposal to change the way we elect the President. The current system elects a President based on the state-by-state vote totals. The new proposal would switch to a system that elects the President according to the vote totals in all 50 states. Would you generally support or oppose switching to a system that counts the votes in all 50 states combined?\"", "As Gallison reported, 74 percent who responded supported electing the President by a purely popular vote. The margin of error was plus/minus 3.5 percent.", "But there are a few things to note.", "The poll was done five years ago.", "Nobody was interviewed for the survey. The data from 800 registered Rhode Island voters were collected by robocalls, where people hear a recorded message and are asked to respond by pressing a button on their telephone. That means a lot of people were hanging up without answering. Jim Williams, a polling analyst with Public Policy Polling, which did the survey, said about 9 out of every 10 people called typically hang up without answering a question.", "Perhaps most important, there was no ability for residents to indicate that they were undecided or didn't care. They had two choices: \"support\" or \"oppose.\" Historically, 12 to 15 percent of the population has had no opinion on the subject, according to older Gallup surveys listed on National Popular Vote's website.", "Patrick Rosenstiel, spokesman for National Popular Vote, said the survey was designed to force a choice. \"We didn't offer an 'undecided' or 'don't know' because a legislator, when the bill comes before them, can't be undecided. They've got to vote green or vote red,\" he said.", "The difference is that legislators have time to gather the facts, pro or con, before they are expected to make a choice. The poll offered no such guidance.", "When Gallison got back to us, he told us that his information came from that 2008 survey.", "We found a more recent Gallup poll on the question, conducted in October 2011. It posed the question in a way to help ensure that the wording did not affect the outcome and it allowed \"undecided\" as an option. In that survey, 62 percent supported a national popular vote and 35 percent endorsed keeping the Electoral College system. The rest were undecided. (The margin of error was plus/minus percentage points.)", "Sixty-two percent is a far cry from 74 percent. But that was a national survey, and Gallison was talking about Rhode Island.", "Rhode Islanders might feel differently because the Ocean State tends to be awash in Democrats, and Democrats favor the popular vote option. When Gallup only looked at the results for Democrats nationwide, the level of support was 71 percent.", "During his floor speech, Gallison said 74 percent of Rhode Islanders supported a popular vote because they believed in the concept of one person, one vote.", "Yet the automated survey didn't ask respondents to give a reason.", "When we asked Gallison about that, he said his statement was based on comments he had received from constituents who wanted him to vote in favor of the plan.", "Our ruling", "Rep. Raymond Gallison said, \"Seventy four percent of Rhode Islanders support [a] national popular vote because they, as I, believe in one person, one vote.\"", "In the first half of his statement, he was correctly quoting a single five-year-old robocall poll from a special interest group in which respondents only had two options to choose from. Those who didn't know or didn't care either had to either pick an answer -- without the ability to hear arguments pro or con -- or just hang up, as most people do with such surveys.", "Nonetheless, other surveys have shown a high level of support for a national popular vote, even if it's not quite as high as the percentage quoted by Gallison.", "The second half of his statement implied that Rhode Islanders had been polled about their reasons for supporting the proposal. But the 2008 survey -- the one Gallison relied on -- never even posed that question. We can think of a few other reasons (such as wanting to bring more campaign money into Rhode Island) why residents might want a national popular vote.", "Because his statement is partially accurate but leaves out important details or takes things out of context, we rate it Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "RILIN.state.RI.us, \"2013--H5575; An Act Relating to Elections,\" and Capitol Television Video on Demand, \"6-13-13 House of Rep...\" at the 106:23 mark, both accessed June 14, 2013", "NationalPopularVote.com, \"Polls Show more than 70% Support for a Nationwide Vote for President,\" \"Public Policy Polling: Rhode Island Survey Results,\" and \"About,\" all accessed June 18, 2013", "Interview and e-mails, Raymond Gallison, Rhode Island State Representative, June 18-19, 2013", "Interviews, Patrick Rosenstiel, spokesman for National Popular Vote Inc., and Jim Williams, polling analyst, Public Policy Polling, both June 19, 2013", "NPR.org, \"North Carolina Polling Firm Spotlighted During Race,\" March 16, 2012, accessed June 18, 2013", "Gallup.com, \"Americans Would Swap Electoral College for Popular Vote,\" Oct. 24, 2011, accessed June 24, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]