["We’ve archived some of the posts, which have together been shared more than 3,000 times, here, here and here. They quote Atiku as saying: “My Server Results Are Authentic and If judges frustrate the Justice we will take over the street. I will lead all Nigerians in a massive protest that mankind have (sic) never witness(sic) before”.", "The posts do not state when or where Atiku is supposed to have made such a warning.", "“Such a statement did not emanate from me or my privies,” Atiku said in a June 16 statement on his official Facebook page.", "He said the invented quotes were the work of “mischief makers” who wanted to tarnish his “spotless pro-democratic record”.", "Final results from the February 23 presidential election showed Atiku losing to President Muhammadu Buhari by nearly four million votes.", "But Atiku, who ran on the platform of the Peoples Democratic Party (PDP), claimed that results from the computer server of the Independent National Electoral Commission  (INEC) show that he won, and that the figures announced to the public were not authentic.", "He has since challenged the outcome of the election at the election tribunal, which is expected to deliver its verdict within six months of the election. While the tribunal has not concluded the process of hearing the election suit, INEC has said that Atiku’s claims are not valid.", "Posts that falsely attribute comments to individuals, often to add support to one political argument or another, are common in Nigeria.", "In another example, posts circulating in April quoted former NASA astronaut Kathryn Sullivan as claiming that crude oil could never be found in northern Nigeria. Sullivan told AFP this was not her subject area and she would never have made such comments.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]