["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "These days, spreaders of misinformation will go to any length to pass off bogus rumors as legitimate information including, it seems, screenshotting a portion of an actual fact-check without including, um, the actual fact-check!", "That’s what one Facebook post attempts in a screenshot of a Snopes article involving President Donald Trump. The only problem is ...  the photo is only of the claim that Snopes researched, not the conclusion.", "The screenshot shows Snopes’ URL and the claim, which reads: \"November 2018 marked the first Veterans Day in 56 years upon which a sitting U.S. president did not attend a wreath-laying ceremony at the Tomb of the Unknown Soldier in Arlington National Cemetery.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The screenshot conveniently cuts off right before the Snopes rating – which, of course, you already likely know is False. There is no mention of the \"False\" rating or all the reasons why that fact-checking organization determined this claim is completely wrong.", "According to the Snopes article, it is accurate that Trump did not attend a wreath-laying ceremony at Arlington on Veterans Day in 2018, but he was nowhere near the \"first sitting U.S. president in 56 years\" to do so.", "Several presidents have not attended the ceremony at one time or another. Obama was elsewhere in 2014 and 2010; George W. Bush did not attend in 2008, 2007, 2005 and 2001; George H.W. Bush was not present in 1989, 1990 and 1992.", "Since 1989, President Bill Clinton is the only one to have attended the event all eight years of his presidency.", "A viral image on social media claims that president Trump was the \"first\" sitting U.S. president who did not attend the wreath-laying ceremony at Arlington Cemetery on Veterans Day 2018.", "It is accurate that Trump was elsewhere that day, but he is not the first president to be absent from the event. Three out of the four presidents who preceded Trump observed the holiday elsewhere.", "This screenshot is a blatantly inaccurate and incomplete depiction of a fact-check.", "We rate it Pants on Fire!", "Facebook post, June 4, 2019", "Snopes, Was Donald Trump the First President in 56 Years Not to Visit Arlington National Cemetery on Veterans Day?, Nov. 16, 2018", "CBS, Obama Not the 1st President to Miss Memorial Day at Arlington, May 31, 2010", "U.S. Department of Veterans Affairs, Veterans Day Speeches, Accessed June 10, 2019", "CSPAN, Veterans Day wreath-laying ceremony 2014, Accessed June 10, 2019", "WhiteHouse.gov, Remarks by the Vice President at the National Veterans Day Observance, Nov. 11, 2017", "White House archives, FACT SHEET: President Obama’s Visit to China, Nov. 11, 2014", "White House archives, President Obama to America's Veterans: \"We Remember.\", Nov. 11, 2010", "New York Times, Bush Honors Veterans at the Intrepid, Nov. 11, 2008", "White House archives, President Bush Marks Veterans Day at National Fallen Soldiers Memorial Ceremony in Waco, Texas, Nov. 11, 2007", "White House archives, President Commemorates Veterans Day, Discusses War on Terror in Tobyhanna, Pennsylvania, Nov. 11, 2005", "YouTube, MT136 Dedication of the Texas Vietnam War Memorial in Dallas, Texas - 11 November 1989, Accessed June 10, 2019", "CSPAN, Veterans Day Remarks, Nov. 11, 1992", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]