["A fabricated news story claiming Donald Trump’s controversial executive order on immigration led to the arrest of a suspected terrorist doesn’t pass inspection.", "\"Executive order leads to capture of ISIS leader, Rasheed Muhammad,\" reads the headline on a Jan. 31, 2017, story at USAPoliticsZone.com. The post was flagged by Facebook as part of the website’s efforts to identify potentially contrived news stories.", "The story is false, however, and appears to have originated on a website chock full of fabricated content.", "Trump’s Jan. 27 order barred citizens of Iraq, Syria, Iran, Yemen, Somalia, Sudan and Libya from entering the United States for 90 days. It also puts Syrian refugee admissions on hold indefinitely. The order drew protests at airports nationwide.", "Trump fired acting Attorney General Sally Yates on Jan. 30 for refusing to enforce the order.", "The action is currently on a nationwide temporary restraining order pending judicial review. You can review some key issues about the order in this explainer.", "The next day, the website Times.com.mx posted the story that a suspected terrorist named Rasheen Muhammad had been arrested at John F. Kennedy International Airport in New York. It included a photo of a handcuffed man flanked by men in FBI windbreakers.", "The story said stricter screening procedures in place because of the order were to credit, and said Yates apologized via Snapchat for being wrong. The story also quoted FBI Director James Comey as saying details would not be released as the agency investigates.", "None of these things happened.", "There was no arrest of any person named Rasheen Muhammad at JFK, terrorist or otherwise. The only Rasheen Muhammad we could find in a news search during the proper time frame was a 19-year-old gang member in Chicago being held in Cook County Jail on Feb. 4 for a juvenile warrant.", "Yates, who had said she was not sure Trump’s order was legal, also did not apologize for refusing to enforce it. There are no reports of such an apology, whether on Snapchat or otherwise.", "Comey also did not address the arrest, seeing as how the arrest never happened.", "Times.com.mx is another website that attempts to imitate legitimate news outlets with fake stories to lure readers. USAPoliticsZone.com and several other sites copied the story verbatim.", "None of the photographs are of someone named Rasheen Muhammad. Anyone with eyes can see that the three photos are actually of different people:", "USAPoliticsZone.com also added this image, which is of Sajmir Alimehmeti. The Bronx, N.Y., man was arrested in May 2016 on charges of providing material support to a terrorist organization for failed attempts to join or aid ISIS.", "Finally, USAPoliticsZone.com included this image, a still from a video of Abu Mohammad al-Adnani, who really was an ISIS leader. Al-Adnani, considered the official spokesman for the Islamic State, was reportedly killed while fighting in Syria last fall.", "This post has been passed off as a true news report, but it can’t clear a background check. We rate it Pants On Fire!", "https://www.sharethefacts.co/share/c9633303-5511-4f4e-8acf-2178c587e6dc", "USAPoliticsZone.com, \"Executive Order Leads to Capture of ISIS Leader, Rasheed Muhammad,\" Jan. 31, 2017", "Times.com.mx, \"Executive Order Leads to Capture of ISIS Leader, Rasheed Muhammad,\" Jan. 31, 2017", "Time, \"How the Zazi Terror Probe Could Help U.S. Intel,\" Sept. 23, 2009", "NBC New York, \"NYC Man Attempted to Join ISIS, Tried to Help Undercover Informant Get to Syria: Complaint,\" May 24, 2016", "CNN, \"Death of senior leader al-Adnani caps bad month for ISIS,\" Sept. 1, 2016", "PolitiFact, \"Trump’s immigration ban: 4 key questions answered,\" Jan. 29, 2017", "PolitiFact, \"Why comparing Trump's and Obama's immigration restrictions is flawed,\" Jan. 30, 2017", "CNN, \"Trump fires acting AG after she declines to defend travel ban,\" Jan. 31, 2017", "CNN, \"9th Circuit Court of Appeals to hear challenge to Trump's ban Tuesday,\" Feb. 7, 2017", "Moline Dispatch, \"Cook County courts raise bonds for gun crimes — but suspects getting out faster,\" Feb. 4, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]