["State Speaker of the House Mike Turzai, R-Allegheny County, uses some hand sanitizer during a legislative session, Tuesday, March 24, 2020, at the Capitol in Harrisburg, Pa. (Joe Hermitt/The Patriot-News via AP)", "Arguing that Pennsylvania should move quickly to reopen its economy even as coronavirus cases surge in some areas, the state House’s Republican leader said this weekend that reopening schools in the fall should be a top priority.", "Not only do students deserve a chance to perform experiments in science labs and play instruments in recitals, House Speaker Mike Turzai said children are largely protected from the ravages of the virus because of their youth and would be safe if they go back to school.", "\"Guess what, they’re not at risk unless they have an underlying medical issue,\" said Turzai, whose comments came in a video he recorded from his Allegheny County home and later shared on social media.", "We wondered whether school-age children are as safe as the house speaker says.", "Turzai was on the right track when he said that children in poor health who contract the coronavirus are at risk of becoming seriously ill. And it’s true that children are far less susceptible than adults. But his claim that other children are totally safe is incorrect, according to a study published recently in the medical journal JAMA Pediatrics.", "Turzai declined to provide any evidence he relied on when he made this claim.", "Testifying before the Senate this week, Anthony Fauci, the government’s top infectious disease doctor, warned Americans not to be \"cavalier in thinking that children are completely immune to the deleterious effects.\"", "The study followed 48 children and young adults with COVID-19 who were admitted to pediatric intensive care units in the U.S. and Canada in March and April. Roughly one out of every five children studied had no underlying conditions. The others suffered from immune suppression, obesity, diabetes, seizures, or chronic lung disease.", "In some cases, the impact of the virus was devastating.", "The Rutgers University researchers who authored the study found that more than 20% of children experienced failure of two or more organ systems and almost 40% required a breathing tube and ventilator. At the end of the study period, a third of the children the researchers tracked were still hospitalized. Two of the children had died.", "\"Children without chronic illness are also at risk,\" the study authors wrote. \"Parents need to continue to take the virus seriously.\"", "Publication of the study came the same day New York City officials announced that a growing cluster of children sickened with the coronavirus have developed a serious condition called pediatric multi-symptom inflammatory syndrome.", "So far, at least 52 children have been diagnosed with the syndrome, which causes high fever and swelling and may cause heart and kidney failure. Most are between the ages of 5 and 9. New York City officials said symptoms of the syndrome vary from patient to patient but include fever, rash, bright red lips, swollen hands and feet and abdominal pain. One five-year-old has died.", "\"This was not something that the health care community saw on their radar,\" New York City Mayor Bill de Blasio said Tuesday at his daily coronavirus briefing. \"Then in the last week or two, suddenly, we’re seeing something that’s very troubling.\"", "In other parts of New York state, 21 additional children with coronavirus symptoms have become seriously ill.", "It’s unclear whether any of the children sickened by pediatric multi-symptom inflammatory syndrome had underlying medical conditions.", "Half of the children in New York City who were diagnosed with the syndrome tested positive for COVID-19, meaning their bodies are battling an active infection and the syndrome simultaneously. Almost  two dozen other children with the syndrome tested positive for antibodies against the disease, meaning they had previously contracted the virus and recovered before they developed symptoms of the syndrome.", "It’s not known how many Pennsylvania children may have developed pediatric multi-symptom inflammatory syndrome. According to data from the state Department of Health, fewer than 3% of the almost 60,000 known coronavirus cases across the state are among children and teenagers.", "Speaking about the coronavirus, Turzai said children are \"not at risk unless they have an underlying medical issue.\" A new study and a growing number of gravely ill children in New York City prove otherwise. We rate this statement False.", "Centers for Disease Control and Prevention, \"Coronavirus Disease 2019 in Children — United States, February 12–April 2, 2020,\" April 10, 2020", "Science Daily, \"Children face risk for severe complications and death from COVID-19,\" May 11, 2020", "CNBC, \"Coronavirus inflammatory syndrome is causing heart and kidney failure in some NYC kids,\" May 11, 2020", "CNBC, \"More than 50 kids in New York City have coronavirus inflammatory syndrome, mayor says,\" May 12, 2020", "Pennsylvania Department of Health, \"Positive cases by age range to date,\" accessed May 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]