["Columbia Missourian State retirement system pays performance bonuses despite losses June 18, 2009", "Columbia Missourian UM System ends executive incentive program, will not seek repayment March 10, 2017", "Columbia Missourian UPDATED: State auditor says UM System paid out $2 million in ‘inappropriate’ bonuses", "St. Louis Post-Dispatch Bonuses for all at state agency, Nixon calls for oversight as extent of ‘incentive payments’ is revealed, April 10, 2009", "Columbia Daily Tribune Senators focus on critical states audit while questioning nominees for University of Missouri curators March 8, 2017", "Missouri State Auditor’s Office, audit of Missouri State Employees’ Retirement System, December 2010", "Missouri State Auditor’s Office, audit of University of Missouri System Administration, March 2017", "Missouri State Auditor’s Office, audit of the City of Huntsville, October 2016", "Missouri State Auditor’s Office, \"audit of Buck Prairie Special Road District,\" August 2016", "Missouri State Auditor’s Office, \"audit of Marion County,\" April 2016", "Missouri State Auditor’s Office, \"audit of Henry County,\" December 2015", "Missouri State Auditor’s Office, \"audit of Village of Leasburg,\" November 2015", "Missouri State Auditor’s Office, \"audit of the Missouri Department of Transportation,\" November 2015", "Missouri State Auditor’s Office press release, \" Auditor Galloway releases Henry County audit, notes previous findings have not been addressed,\" December 23, 2015", "Phone interview with Nicole Galloway, April 11, 2017", "Phone interview with Gena Terlizzi, March 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]