["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Judges Rebecca Dallet, who appeals to liberals, and Michael Screnock, who appeals to conservatives, participated in their first one-on-one debate about a month ahead of the 2018 election for Wisconsin Supreme Court. (Rick Wood/Milwaukee Journal Sentinel)", "In a televised debate from Milwaukee between the two remaining Wisconsin Supreme Court candidates, Sauk County Circuit Judge Michael Screnock, who is backed by conservatives, attacked Milwaukee County Circuit Judge Rebecca Dallet, who is backed by liberals.", "In the March 2, 2018 debate, a month ahead of the April 3, 2018 election, Screnock charged that Dallet \"has talked about her interest in advocating for policies that need to be changed to achieve her political objectives.\"", "We found in a previous fact check that Dallet had not been as partisan as Madison attorney Tim Burns, who was eliminated in the primary election.", "But while Dallet generally sticks to stating her \"values\" on key issues, there have been instances where she’s gone further.", "Values vs positions", "For this fact check, we’re reviewing eight statements made by Dallet. Regarding the first six, Dallet campaign manager Jessica Lovejoy told us Dallet \"has not shied away from talking about her common Wisconsin values of equality, fairness, clean air and water, and good schools. She does not advocate for specific policies to advance these values.\"", "As we’ll see, in the first three statements, Dallet singled out mass incarceration, the environment and fighting \"right-wing special interests\" as issues that she said need to be addressed, though she didn’t advocate for specific policies.", "1. I’m not going to apologize for standing up for safer communities and for victims. And I think that we can do that while also trying to address racial injustice and the problem of mass incarceration.", "2. Just look at our president and you have to worry about equal protection under the law. Women are under attack. We have to protect our environment.", "3. I believe we (Burns and her) share many of the same values, and I hope that we can unite Wisconsinites to fight against right-wing special interests and make our state Supreme Court work for the people again.", "But in the next three statements in which Dallet talked about her values, she went further.", "Dallet talked about not making it more difficult to vote, alluding to the debate over whether Wisconsin’s photo ID law makes it more difficult to vote; she attacked the National Rifle Association, which is known for its activism to protect gun-owner rights; and she flatly stated that sales of a particular gun should be outlawed.", "4. I believe in clean air and water, I believe in our public education system and I believe in working people. I think we need to ensure we increase participation in our voting system, not decrease it. I think we need to address racial and gender inequality head on, not sweep the vestiges of a racist and patriarchal system under the rug.", "5. That’s why I took the #NoNRAMoney pledge. I will not accept money from an organization that puts profits above the lives of Americans. Will you join me today in pledging that we won’t vote for any candidate who takes NRA money? nonramoney.org/voter-pledge #NRABoycott", "6. Why do you need that rifle that was used in that (Parkland, Fla.) school shooting? What was it, an AR-15? Who ever needs to fire off that many rounds in a minute? There is no reason for that gun. There is no basis for it. It’s not a gun that should be sold in the United States. I mean, let’s talk about reasonable gun control …. I’m not going to write that law, that’s going to be our legislatures. But we should all -- I mean, I’m a citizen just like everyone else -- we should all write our legislatures, tell them how we think and let them write those laws.", "Recusal rule", "On the remaining two statements, Lovejoy told us that when Dallet speaks about changing policy, \"she's referencing the need to update the Supreme Court recusal policy that currently allows sitting justices,\" such as retiring Justice Michael Gableman, \"to remain on cases where a party spent significantly on their behalf in their election.\"", "Here are those Dallet statements:", "7. It is the time for women. It’s a time for making sure we stand up and our rights are protected. And experience matters to get the policies we want to move forward and to protect our rights.", "That statement was made during the concluding remarks of a campaign appearance. Dallet had begun her remarks talking about her experience as a prosecutor and judge, then she talked at length about the importance of the recusal rule, and then she spoke about the experience Screnock and Burns have, before concluding.", "It could be argued that in making the \"policies we want\" statement, Dallet was echoing her remarks about recusals rather than making a general statement about the need \"get the policies we want.\"", "But in the final statement, from a radio interview, it’s harder to see the argument that Dallet was referring to recusals.", "8. All of the values that I talked about -- clean air and water, and equal protection, and women -- are under attack.  And, this is something we all feel and we all relate to. And I'm the candidate that is going to be able to protect those values at this critical time, and there is just too much at stake right now to have someone without the experience needed to advocate for the policies that need to be changed and to make sure to protect those values.", "Dallet had been asked earlier in the interview about recusals. But she made the statement we cite when asked about about why she featured criticism of President Donald Trump in her first TV campaign ad.", "Our rating", "Screnock says Dallet \"has talked about her interest in advocating for policies that need to be changed to achieve her political objectives.\"", "Dallet frequently says she is merely stating her values, such as equal rights or clean air and water, and often she singles out those issues without advocating for a particular policy position.", "But on some occasions she has gone beyond that.", "For example, after citing clean air and water, and equal protection as her values, she pledged to \"advocate for the policies that need to be changed.\" And she has advocated for addressing \"mass\" incarceration; increasing voter participation and not allowing the sale of AR-15 guns.", "We rate Screnock statement’s Mostly True.", "WISN-TV, video (9:10) of Supreme Court debate, March 2, 2018", "Interview, Rebecca Dallet campaign spokeswoman Gillian Drummond, March 19, 2018", "Email, Michael Screnock campaign spokesman Sean Lansing, March 9, 2018", "PolitiFact Wisconsin, \"Have 2 Supreme Court hopefuls campaigned against Scott Walker laws, for legislating from the bench?\" Feb. 14, 2018", "Twitter, Rebecca Dallet tweet, Feb. 24, 2018", "Facebook, Rebecca Dallet post, Feb. 21, 2018", "Wisconsin Public Radio, interview, Feb. 8, 2018", "Milwaukee Journal Sentinel, \"Wisconsin high court candidates Rebecca Dallet and Michael Screnock divided over guns, NRA,\" March 9, 2018", "\"Devil’s Advocates\" radio show, Rebecca Dallet interview, Feb. 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]