["The image shows two elk taking refuge in a body of water from a raging forest fire with the text “Pray for Oregon” -- one of the states hit hard by the unprecedented wildfires.", "The posts have been circulating on Facebook since at least September 9, 2020 and more examples are available here, here, and here.", "The post is also in Spanish here and here.", "Fires up and down the US West Coast have burned more than five million acres, an area roughly the size of the state of New Jersey, and the disaster has brought the issue of global warming to the forefront of the US presidential campaign.", "Reputable scientists around the world are almost unanimous in their belief that the world is getting warmer because of human activity. This man-made climate change amplifies droughts, creating ideal conditions for wildfires to spread out-of-control.", "The image of the forest fire also circulated erroneously in 2019 during fires in the Amazon rainforest. At that time, AFP Factual conducted a reverse image search of the content and found that the original photo was taken in Sula, Montana on August 6, 2000 by John McColgan, a wildfire expert working with the US Bureau of Land Management.", "The photo was selected by Time magazine as one of the most compelling photos of the year for 2000.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]