["“Watch this nurse pass out after receiving the COVID vaccine. It’s so safe though, right?  This will become a mass genocide if people continue to follow these rabid dictators,” says a December 17, 2020 Facebook post.", "Other posts about the incident can be found on Facebook here, Instagram here and YouTube here.", "Video footage shows Tiffany Dover, a nurse at CHI Memorial Hospital in Chattanooga, Tennessee, speaking to media after receiving the vaccine. She says she is “feeling really dizzy” as she touches her temple, before starting to collapse and being lowered to the floor by two men.", "Covid-19 vaccinations have begun across the US, where the disease has killed more than 310,00 people, but some are still hesitant about receiving them, though the number who say they are willing to do so is growing.", "“On Thursday, December 17, 2020, CHI Memorial administered its first doses of the Pfizer Covid-19 vaccine to six individuals -- three physicians and three nurses,” the hospital administration told AFP by email.", "“Shortly after and while conducting a media interview, one of the nurses became dizzy and was assisted to the floor. She never lost consciousness and quickly recovered,” it said.", "The nurse said she has a history of passing out.", "“I have a history of having an overactive vagal response, and so with that, if I have pain from anything -- hangnail, or if I stub a toe, I can just pass out,” Tiffany Dover said, according to a video from the WRCB Chattanooga TV channel.", "“I have passed out probably six times in the past six weeks... it’s common for me,” Dover said.", "Dr Jesse Tucker, a critical care physician at CHI Memorial who also received the vaccine, said in the same video that there is “no reason to suspect that that’s due to the vaccine whatsoever.”", "It is “kind of like if you’ve been to the doctor and had bloodwork done before, some people get a little lightheaded when they see the needle going into their skin -- this is the identical kind of reaction,” said Tucker.", "According to the US Centers for Disease Control and Prevention’s website, “fainting can be triggered by many types of medical procedures. In fact, CDC has received reports of people fainting after nearly all vaccines.”", "“Fainting itself is generally not serious, but harm from related falls or other accidents can cause injury,” it says.", "Some posts -- as well as a Facebook group titled “Justice for Tiffany Pontes Dover RIP” -- claim that the nurse died after receiving the vaccine. This is also false.", "“Tiffany is doing well. She has asked for privacy,” the hospital administration said by email.", "The hospital also released a video of Dover and surrounded by colleagues on December 21.", "AFP Fact Check has debunked other examples of inaccurate information about Covid-19 vaccines, including that they cause female sterilization or change a patient’s DNA.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]