["ATM में पैसो की कमी के पीछे का सच ..दिल्ली में कर्नाटक कोंग्रेस के मंत्री डी के शिवकुमार के दिल्ली सफदरजंग एन्क्लेव के बंगले पर छापा पड़ा है उसका वीडियो आपके साथ शेयर कर रहा हुँ रु का गोदाम देखों और शेयर करों जिससे कांग्रेस का असली चेहरा सामने आ सकें। (The truth behind cash crunch in ATMs. The house of Congress Minister in Karnataka D K Shivakumar was raided at Safdarjung enclave in Delhi. I am sharing the video with you. Look at this godown of currency notes so that the Congress’ real face is exposed” )(translation)", "This message accompanies a video which shows a huge stash of currency notes kept inside bags, boxes and wardrobe. It is claimed that this is the reason for the shortage of cash in ATMs across the country. The implication is that this money is to be used by the Congress party in the upcoming Karnataka assembly election.", "This video and the accompanying message is being circulated widely on social media and particularly on Facebook in the last 24 hours where many individual users have posted it with identical text in all cases. This suggests that the video is probably circulating on WhatsApp and it has been uploaded by users on to the platform.", "The video has also been shared on Twitter. Oriental Times, which is known for spreading fake news also tweeted this video.", ".@INCKarnataka के मंत्री डी. के. शिवकुमार के दिल्ली सफदरजंग एन्क्लेव के बंगले पर छापा पड़ा है उसका वीडियो आपके साथ शेयर कर रहा हुँ। 👇👇👇👇👇👇", "रु का गोदाम देखों और RT करों जिससे कांग्रेस का असली चेहरा सामने आ सकें। 😡😠#CashCrunch#CongressMeansCorruptionpic.twitter.com/uKnmNx1yzq", "— APOORV (@iModiBhakt) April 25, 2018", "It turns out that this video is NOT of a raid on the house of Congress minister from Karnataka D.K Shivakumar. It is in fact of an Income Tax raid on T&T law firm in Delhi founded by Rohit Tandon. In total, 13 crores worth of cash was found in raids on Rohit Tandon’s law firm and residences in Delhi in December 2016. The video that is now being shared as cash found in D.K Shivakumar’s house was originally posted by a journalist Shiv Sunny on his Twitter timeline on December 10, 2016. He posted the video with the text, “Video of over Rs 8 cr cash (Rs 2 cr in new currency) seized by Delhi Police from T&T law firm in Delhi’s GK.“. The video can be seen below.", "Video of over Rs 8 cr cash (Rs 2 cr in new currency) seized by Delhi Police from T&T law firm in Delhi’s GK. @the_hindu@abaruah64pic.twitter.com/qXlQ7Ixg3y", "— Shiv Sunny (@shivsunny) December 10, 2016", "This video had been circulated in 2017 as well with the same claim that this money was recovered from the house of Karnataka Minister D.K Shivakumar. Alt News had dispelled this rumour when it had surfaced back then. Recently, fake news that a BJP worker had been caught with 120 crore cash in Karnataka was viral on social media. This kind of mischief is representative of a now predictable pattern wherein old, unrelated videos are pulled out and placed out of context with a false narrative in order to take potshots at the political opposition.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]