["About this rating", "On 7 July 2017, the \"Casper Planet\" Facebook page published a post stating that lava has shot out of one of the geysers in Yellowstone National Park after a string of earthquakes hit the surrounding area:", "**Breaking**", "Yellowstone Lava Geyser", "For the first time in recorded human history, lava has shot out of one of the geysers in Yellowstone National Park. This following directly after a string of earthquakes in Montana and very rural Wyoming. Geologists, NASA and an oil rig drilling crew are already on scene to document this never recorded event and try to find the cause. We will continue to update you with more information as it surfaces.", "This item was not true, nor was it reported by any legitimate news outlet.", "Although a magnitude 5.8  earthquake did rock southern Montana on 6 July 2017, with its epicenter only 230 miles from Yellowstone National Park, that phenomenon did not trigger a feared supervolcano event, nor did it cause lava to come gushing our of geysers at the famed wilderness area.", "Moreover, the image that accompanied this report did not originate with anything occurring at Yellowstone National Park.  It is a screen grab taken from a video shot by the University of Hawaii's Center for the Study of Active Volcanoes (CSAV) showing lava entering the ocean at Kalapana in July 2008 (watch for it around the 0:42 mark):", "Bort, Ryan.   \"5.8 Magnitude Earthquake Hits Montana, Raising Supervolcano Concerns.\"\r\n    Newsweek.   6 July 2017.", "Graham, Taylor.   \"Geologist Believes Earthquake Will Not Affect Supervolcano.\"\r\n    KTVM [Butte, MT].   6 July 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]