["About this rating", "In July 2015, government investigators announced that they had discovered classified information in the private email setup that Hillary Clinton had used during her tenure as U.S. Secretary of State. and the FBI opened an investigation into the matter of whether Clinton had mishandled sensitive government information. A year later, FBI Director James Comey announced that the FBI had completed its investigation and was recommending to the Department of Justice \"that no charges are appropriate in this case\" because \"[a]lthough there is evidence of potential violations of the statutes regarding the handling of classified information, our judgment is that no reasonable prosecutor would bring such a case\" and \"we cannot find a case that would support bringing criminal charges on these facts.\"", "Several times since 2017, and as recently as September 2020, U.S. President Donald Trump has been claiming that Hillary Clinton (or persons closely connected to her) illegally donated $700,000 to the political campaign of a candidate who just happened to be the wife of the man who headed the FBI during that investigation:", "But this claim by Trump incorporates multiple falsehoods.", "Trump is referring to Dr. Jill McCabe, who (unsuccessfully) ran as a Democratic candidate seeking a seat in the Virginia state Senate in 2015 and is the wife of Andrew McCabe, who served as acting director of the FBI until August 2017. However, Andrew McCabe was not the \"head of the FBI\" during the period between July 2015 and July 2016 when the FBI was actively investigating Hillary Clinton's use of a private email server. In July 2015, McCabe, who had been serving as assistant director in charge (ADIC) of the FBI's Washington Field Office (WFO), was appointed as the FBI's associate deputy director, and then in January 2016 he was named as the FBI's deputy director.", "Andrew McCabe did not become acting director of the FBI (i.e., \"head of the FBI\") until May 2017, when Trump dismissed James Comey from that position. But by that time, the FBI's investigation of Hillary Clinton had long since run its course, as had Jill McCabe's senate campaign. The timing of events makes it impossible for Hillary Clinton to have donated $700,000 to a political campaign being run by the wife of the FBI's head while Clinton was under investigation by that agency.", "Moreover, Clinton herself didn't give money to Jill McCabe's campaign, illegally or otherwise. The $700,000 in funds raised for Jill McCabe's Senate campaign that Trump refers to consisted of $467,500 donated by the Common Good VA political action committee (PAC), and another $207,788 from the Virginia Democratic Party. Terry McAuliffe, who was governor of Virginia from 2014 to 2018 and was a long-time ally of the Clintons (he co-chaired Bill Clinton's 1996 re-election campaign and chaired Hillary Clinton's 2008 presidential campaign) certainly wielded a good deal of influence over both those entities, but Terry McAuliffe is not Hillary Clinton, and nothing about the donations from the PAC or the state Democratic Party was illegal.", "Finally, the FBI themselves stated that by the time Andrew McCabe had any supervisorial role in the Clinton investigation (even if he was not yet \"head\" of the agency), his wife's campaign had already ended, so giving money to Jill McCabe would not have helped Hillary Clinton:", "Q: Did Andrew McCabe have any oversight of the investigation into Secretary Clinton's email server while his wife was running for political office?", "A: No. The FBI investigation into Secretary Clinton's email server began in July 2015 after a referral was received by the Intelligence Community Inspector General. At that time, Andrew McCabe had no supervisorial oversight of the investigation. Jill McCabe lost the election on Nov. 3, 2015. It was not until he assumed the position of Deputy Director in February 2016 that he had oversight of the investigation, well after her political campaign had concluded.", "Q: Dr. McCabe announced she planned to run for Virginia state senate in mid March 2015. Earlier that month the New York Times reported Hillary Clinton used a private e-mail server while serving as Secretary of State. In March Clinton also acknowledged using private e-mail. Is it relevant that the existence of Secretary Clinton's e-mail server was reported in the same month that Dr. McCabe announced her candidacy for state senate?", "A: No. The FBI was not conducting an investigation regarding Secretary Clinton in March 2015. Four months later in July 2015 the State Department Inspector General made a referral to the FBI for investigation. The allegation centered on the possibility that Clinton had classified e-mail on her personal system. At the time of the referral Mr. McCabe was serving as ADIC of WFO [Washington Field Office and was not supervising the Clinton investigation.", "Barrett, Devlin.   \"Clinton Ally Aided Campaign of FBI Official’s Wife.\"\r\n    The Wall Street Journal.   24 October 2016.", "FBI National Press Office.   \"Andrew McCabe Named Deputy Director of the FBI.\"\r\n    29 January 2016.", "Schmidt, Michael S. and Matt Apuzzo.   \"Hillary Clinton Emails Said to Contain Classified Data.\"\r\n    The New York Times.   24 July 2015.", "FBI National Press Office.   \"Statement by FBI Director James B. Comey on the Investigation of Secretary Hillary Clinton’s Use of a Personal E-Mail System.\"\r\n    5 July 2016.", "The Associated Press.   \"Trump Tweets Falsehoods About Wife of Retiring FBI Deputy Director McCabe.\"\r\n    Los Angeles Times.   23 December 2017.", "FBI National Press Office.   \"FBI Announces Executive Appointments.\"\r\n    30 July 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]