["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo shared online appears to show duplicate mail-in ballots addressed to one Pittsburgh resident.", "It’s very unlikely that the person, or anyone else who erroneously receives more than one ballot could vote more than once.", "The system uses one unique barcode, or number, for each voter. If a duplicate is scanned, election officials would mark the ballot as rejected.", "Some Pennsylvania residents in Pittsburgh’s Allegheny County received duplicate mail-in ballots in May 2020 due to a computer glitch that caused an error during the printing process.", "Posts circulating on social media, which appear to share an image of two of the county’s ballots addressed to the same person, suggest the error proves that the vote-by-mail system is susceptible to voter fraud.", "\"Two mail in ballots in PA sent to the same person with their names on both a week and a half apart. FB keeps deleting this. Make it go viral,\" reads text above the image.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "RELATED: No, receiving multiple ballot applications doesn’t let you vote more than once", "The image is blurry, and we were unable to confirm that the papers in it were indeed official mail-in ballots, but several areas of the document point to Allegheny County, which mistakenly sent duplicate mail ballots to some residents in May.", "The underlying suggestion that two ballots mailed to the same person gives someone the ability to cast more than one vote is wrong. If a person returned multiple ballots, the system would flag it as a duplicate vote and only one would be counted.", "Allegheny County erroneously sent some residents multiple mail-in ballots ahead of the state’s primary election on June 2, according to news reports. The incident was included in a lawsuit filed by President Donald Trump’s campaign, which claims that election officials in Pennsylvania have implemented a fraudulent mail voting system that will undermine the results of the general election on Nov. 3.", "In a May 14 news release, the county said duplicate labels for mail-in and absentee ballots were printed because of a glitch in the state’s computerized voter registry system.", "As the system processed and printed a large volume of mailing labels for ballots, at some point, it paused and sent an error message, which resulted in a queue of labels that appeared to be blank. But the labels were actually still printing, so when the system rebooted, some printed twice, the release said.", "The county said it was going to start printing labels in smaller batches to prevent the error from occurring again, and that affected residents should destroy any duplicate ballots.", "\"Even if a person receives multiple ballots, only one return ballot can be counted. This is because the barcode on the label that is being used for tracking is exactly the same,\" the release noted.", "\"When voted ballots are returned to the office, they are scanned. If another ballot was returned from that same voter, it would show as a duplicate vote when scanned and would be rejected by the system. Staff would mark the ballot as rejected. Those ballots are kept but are not sent to the warehouse to be counted or opened.\"", "An image appears to show two mail-in ballots addressed to one Pennsylvania resident, suggesting this means they could vote twice.", "It’s accurate that a group of residents in Allegheny County, Pa., received duplicate mail ballots due to a computer glitch ahead of the state’s primary election in June, and the photo in the post appears to show an example of the error.", "But it’s wrong to suggest that this means they can cast multiple votes. The system uses one barcode for each voter. If a duplicate is scanned, election officials would mark the ballot as rejected.", "We rate this Half True.", "Facebook post, July 19", "Pittsburgh Post-Gazette, Allegheny County doesn't know how many duplicate ballots it mailed out, May 15, 2020", "Allegheny County news release, Elections Division Statement on State SURE System Issue Impacting County, May 14, 2020", "Snopes, Did a Pennsylvania Voter Receive Two Usable Ballots?, Aug. 6, 2020", "Lead Stories, Fact Check: Photo Does NOT Show Someone Got Two Mail-In Ballots in California, May 15, 2020", "Email interview, Amie M. Downs Allegheny County spokesperson, Aug. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]