["Twitter user Nabeha Latif, who in her bio claims to be from Islamabad (Pakistan), posted a purported screengrab of Indian news broadcaster Mirror Now with the claim that the Indian government has imposed a ban on animal slaughter in Kashmir during Eid. The graphic started circulating on social media after reports of re-imposition of curfew in Srinagar on the eve of Eid.", "Indian government imposed ban in Kashmir that kashmiris are not allowed to slaughter animals on eid ul azha. I don’t know how to celebrate #EidAlAdha2019! pic.twitter.com/M4FwWvOnnO", "— Nabeha Latif (@Nabehal) August 11, 2019", "Another user from the United Kingdom tweeted the same screenshot along with one more similar screengrab. It has been retweeted more than 2,500 times so far.", "This is Indian occupied Kashmir#WakeUpUN_KashmirBleeding pic.twitter.com/jVAPEIpmuq", "— Ravneet Kaur (@FreeJagtar) August 11, 2019", "According to the second screengrab, the reporter’s name is Pramod Madhav.", "Mirror Now editor Faye D’Souza took to Twitter to debunk the photoshopped screengrab of the news channel viral on social media. She said, “This is a fake screen. FALSE. Photoshopped”.", "This is a fake screen. FALSE . Photoshopped 1. The bottom ticker is missing 2. The font is not the one used by the channel 3. This is not a story carried by @MirrorNow pic.twitter.com/Ugoz7lAQHo", "— Faye DSouza (@fayedsouza) August 11, 2019", "She pointed out the discrepancies in the morphed screengrab by referring to the actual composition of the screen and the fonts used by the broadcaster. D’souza asserted that the news channel has not carried such a story. Moreover, we also found that Pramod Madhav, the reporter whose name is mentioned in the second viral screengrab, is reporting on Kerala floods right now and is NOT in Kashmir.", "#TheBigStory — The death toll has risen to 76 in #Kerala. Orange alert issued in 7 districts. @madhavpramod1 reports on #KeralaFloods @avniraja pic.twitter.com/ixP1JhgaAC", "— Mirror Now (@MirrorNow) August 12, 2019", "It may also be noted that the English text in the morphed screenshots of the news channel is grammatically incorrect. While the text in the screengrab reads, “No one can slaughter animal now”, it should have said, “animals” and not “animal”.", "Shehla Rashid, a political activist and general secretary of Jammu and Kashmir Peoples Movement had posted the fake graphic on Twitter and later clarified that these were photoshopped.", "Warning: There are photoshopped images of a @MirrorNow screen being circulated with the caption that animal slaughter has been banned in Kashmir. I checked with Mirror Now. They deny having run the story. Looks like a trap by the ruling party to discredit Kashmiris.", "— Shehla Rashid شہلا رشید (@Shehla_Rashid) August 11, 2019", "In conclusion, a photoshopped screengrab of Mirror Now was circulated on social media to falsely claim that the Indian government has banned animal slaughter in Kashmir during Eid.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]