["By Mark Shtrakhman", "Posted on February 27, 2018", "Q: Was Malia Obama arrested for attacking an elderly white woman? Did the arresting police officer mysteriously die?", "A: No. Those false stories originated on websites that claim to publish satire.", "Former first daughter Malia Obama was not among a group of people arrested for a “racist antifa attack” on an elderly white woman. The alleged assault never happened.", "That false story originated in November on America’s Last line of Defense, a self-described satirical website that presents “fiction as fact,” according to its “about us” page.", "It claimed that Obama, a freshman at Harvard University, was among 10 students who attacked the woman as she was coming out of a church in Cambridge, Massachusetts. But we examined the Cambridge Police Department’s daily logs for November and found no mention of any such crime.", "That made-up story has since been removed from lastlineofdefense.online, but an updated version was recently published on factiven.com and flagged by Facebook users as potentially false.", "The latest version claims that “Obama was able to walk free” due to “an error in the paperwork,” and that her arresting police officer, “Patrick Farley,” later died of a heart attack “under pretty suspicious circumstances.”", "That didn’t happen, either.", "Factiven.com credited the story to nativeamericanapache.com, but it first appeared last year on Reagan Was Right, another so-called satire website that we have previously written about.", "Also, the photo of “Farley” included in the story on reaganwasright.com really shows Brad Miller, a former Arlington, Texas, police trainee, who was fired in August 2015 after fatally shooting an unarmed black teen at a car dealership.", "Jeremy Warnick, the director of communications and media relations for the Cambridge Police Department, confirmed to FactCheck.org in an email that “Malia [Obama] was never arrested by the Cambridge Police, and we don’t have an officer by that name [Patrick Farley] in the department.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“UPDATE: Malia Obama Among 10 Arrested In Racist Antifa Attack.” Lastlineofdefense.org. 4 Nov 2017.", "“About Us.” LastLineofDefense.org. Accessed 26 Feb 2018.", "“UPDATE: COP WHO ARRESTED MALIA OBAMA FOUND DEAD UNDER SUSPICIOUS CIRCUMSTANCES.” Factiven.com. 25 Feb 2018.", "“UPDATE: Cop Who Arrested Malia Obama Found Dead Under Suspicious Circumstances.” Reaganwasright.com. 5 Nov 2017.", "Maycan, Taylor. “Spotted: Malia Obama moving in to Harvard.” USA Today. 22 Aug 2017.", "Steele, Tom. “No charges filed against Arlington police trainee who fatally shot unarmed teen at car dealership.” Dallas Morning News. 08 June 2016.", "Warnick, Jeremy, director of communications and media relations for the Cambridge Police Department. Email interview with FactCheck.org. 26 Feb 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]