["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Members of SEIU Healthcare of Illinois & Indiana protest in Springfield.", "On paper, the race for Illinois state comptroller is about which candidate is best qualified to be keeper of the state's checkbook. In reality, though, it's become an extension of the bitter budget war that's been waged for more than a year between Republican Gov. Bruce Rauner and Democratic House Speaker Michael Madigan.", "Democrats and their supporters are doing everything possible to link incumbent Republican Leslie Geissler Munger to Rauner’s \"reforms before revenue\" position that has perpetuated the budget impasse and hurt social social service providers. Democratic comptroller candidate and Chicago City Clerk Susana Mendoza has made the connection the central theme of her campaign.", "In a YouTube video published Aug. 29, SEIU Healthcare of Illinois and Indiana, a union that represents health care and child care workers and is one of the sharpest critics of the anti-union Rauner, zeroed in on Munger for remarks she made during an Aug. 25 Chicago Tribune editorial board debate.", "SEIU claims Munger, who was appointed by then-Gov.-elect Rauner after the sudden death of Judy Baar Topinka in December 2014, said the state would have to \"cut social services completely\" in order to balance the budget.", "The 40-second YouTube video takes clips from the debate with the state’s four comptroller candidates, and includes a description that says: \"In an interview with the Chicago Tribune’s Editorial Board, Comptroller Leslie Munger says that in order to balance a budget, the state would have to ‘cut social services completely.’\"", "The union repeated the charge in a tweet:", "Politicians frequently argue about how to better manage social services, but we’ve never heard of any candidate advocating eliminating all programs that assist society’s most vulnerable citizens. We decided to look into SEIU’s claim.", "Context of comptroller’s comments", "James Muhammad, communications director for SEIU Healthcare Illinois Indiana, confirmed the YouTube video was referencing comments Munger made during the editorial board debate.", "Munger was asked by the editorial board whether she agrees with Rauner that reforms from his Turnaround Agenda must be passed before there’s an agreement on a full-year budget. Rauner sees his plan as helping business; his opponents see it as an anti-union assault in the guise of reform.", "While the comptroller did not answer the question directly, Munger said workers’ compensation reform and a property tax freeze are two of the governor’s reform items she believes would help businesses create more jobs, expand the tax base and grow the economy.", "This is where the SEIU YouTube video claims Munger said the state would have to \"cut social services completely\" to balance the budget.", "\"We have to pass a balanced budget. I don’t know how you pass a balanced budget, unless you literally cut social services completely as an example, cut education,\" Munger said. \"You cannot get to a balanced budget without a growing economy in our state right now. We cannot do it.\"", "The video includes Munger’s comments in their entirety, though both the title and the description imply the comptroller was saying the state needs to completely eliminate funding for social services to balance the budget.", "Despite Munger making clear she was using such cuts as \"an example\" to illustrate how drastic cuts alone would have to be, SEIU makes it appear as if Munger wants and is proposing to eliminate all funding for social services in the video as well as on its social media accounts.", "Munger reiterated her support for an income tax increase as long as it’s \"coupled\" with reductions in spending, noting the current individual income tax rate of 3.75 percent would have to be hiked up to about 8 percent just to pay down the state’s current $8.1 billion backlog of unpaid bills.", "\"You cannot cut enough to get to a balanced budget, so you need revenue,\" Munger said during the debate. \"And you cannot raise revenue enough to get it balanced without a growing economy.\"", "This statement also debunks SEIU’s contention that Munger wants to \"cut social services completely,\" and further clarifies she was saying the state never would be able to make cuts as severe as what you would need to balance the budget as things currently stand.", "Our ruling", "In a YouTube video, SEIU Healthcare Illinois and Indiana said: \"In an interview with the Chicago Tribune's Editorial Board, Comptroller Leslie Munger says that in order to balance a budget, the state would have to ‘cut social services completely.’\"", "The video, along with a tweet from the union’s Twitter account, gives the impression Munger wants to cut all funding for social services in order to balance the budget.", "However, both the video and the tweet take Munger’s comments out of context and fail to acknowledge she was speaking hypothetically.", "In addition, Munger’s statement that the state \"cannot cut enough to get to a balanced budget\" and \"cannot raise revenue enough to get it balanced without a growing economy\" undercuts SEIU’s contention that she wants to cut all social services.", "Essentially, Munger’s point is that lawmakers never would be able to make cuts as severe as what would be needed to balance the budget without new revenue.", "We rate SEIU Illinois’ claim False.", "YouTube, \"Mungers says we have to ‘cut social services completely,’\" Aug. 31, 2016", "James Muhammad, Communications Director, SEIU Healthcare of Illinois, Indiana, Missouri, Kansas, phone interview, Sept. 1, 2016", "Charlie Wheeler, professor, Department of Public Affairs Reporting at University of Illinois at Springfield, phone interview, Sept. 6, 2016", "General Assembly’s Commission on Government Forecasting and Accountability, \"State of Illinois Budget Summary: Fiscal Year 2017,\" Aug. 10, 2016 (accessed Sept. 6, 2016).", "The Institute for Illinois’ Fiscal Sustainability at the Civic Federation, \"State of Illinois FY2017 Budget Roadmap: State of Illinois Budget Overview, Projections and Recommendations for the Governor and the Illinois General Assembly,\" Feb. 11, 2016 (accessed Sept. 7, 2016).", "Chicago Tribune, \"Illinois Comptroller candidates sit down with Chicago Tribune’s editorial board,\" Aug. 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]