["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jared Brown of AmeriCorps removes drywall from a flood-damaged house in Hanover, W.Va., in 2009. (Louis Sohn/FEMA)", "Is West Virginia the largest source of members for AmeriCorps, a federally run network of national service programs that operate in communities to mentor youth, fight poverty, sustain national parks, and prepare for disasters?", "Sen. Joe Manchin, D-W.Va., said so in a tweet on Aug. 8, 2018: \"West Virginians look out for one another and our commitment to service speaks for itself. This year West Virginia produced more @americorps members than any other state. Do you know an AmeriCorps member? Thank them for their service!\"", "West Virginians look out for one another and our commitment to service speaks for itself. This year West Virginia produced more @americorps members than any other state. Do you know an AmeriCorps member? Thank them for their service! pic.twitter.com/q9m8oe0e3E", "We wondered whether Manchin was correct that West Virginia produces more AmeriCorps members than any other state.", "On its website, AmeriCorps published a study listing the states that produced the most AmeriCorps volunteers for 2018. Here’s the list, which ranks the states based on a per-capita measurement, so that larger-population states don’t dominate the rankings:", "Rank", "State", "1.", "West Virginia", "2.", "Washington, D.C.", "3.", "Minnesota", "4.", "Utah", "5.", "Vermont", "6.", "Montana", "7.", "Hawaii", "8.", "New Mexico", "9.", "Massachusetts", "10.", "Maryland", "This is the first time West Virginia has ranked first. In 2017 and 2016, it ranked third, and in 2015, it ranked fifth.", "So why does West Virginia rank so high? History, said Dana Bryant, a spokeswoman for Volunteer West Virginia, the state's commission for national and community service.", "National service programs like AmeriCorps \"have a long history in West Virginia, from the Civilian Conservation Corps of the 1930s to southern coalfield (Volunteers in Service to America) fighting poverty in the 1960s to the creation of AmeriCorps in 1993,\" she said. In West Virginia, \"volunteering is just a way of life,\" she said.", "West Virginia also received benefits from AmeriCorps. In 2017, the agency said, more than 3,800 people undertook national service in 600 locations across West Virginia and $12.2 million was invested, including \"reducing crime and reviving cities, connecting veterans to services, fighting the opioid epidemic, helping seniors live independently, and rebuilding communities after disasters.\"", "Manchin tweeted, \"This year West Virginia produced more AmeriCorps members than any other state.\"", "AmeriCorps data confirms West Virginia’s first-place rating per capita for 2018, the first time the state ranked first since the agency began publishing the data in 2015.", "We rate the statement True.", "Joe Manchin, tweet, Aug. 8, 2018", "Volunteer West Virginia, \"West Virginia Ranks First in the Nation for Producing AmeriCorps Members,\" Aug. 7, 2018", "Corporation for National and Community Service, \"New List Reveals Top States, Cities that Produce AmeriCorps Members,\" Aug. 7, 2018", "Corporation for National and Community Service, AmeriStates and AmeriCities web page, accessed Aug. 29, 2018", "Corporation for National and Community Service, \"National Service in West Virginia,\" 2017", "Email interview with Dana Bryant, spokeswoman for Volunteer West Virginia, Aug. 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]