["About this rating", "An image that purportedly shows President Trump wading through floodwater while holding two cats was widely circulated on social media after Hurricane Harvey hit Texas in late August 2017:", "The original photograph, which showed a man named Brandon Smith rescuing his two cats from floodwaters in Cedar Rapids, Iowa, in June 2008, was taken by photographer Harry Baumert of the Des Moines Register. Although the original article containing the image is no longer online, the Iowa newspaper reprinted the photograph in a 2009 article that provided an update on Smith and his cats:", "Brandon Smith wading through water in Cedar Rapids with his cats clutched to his chest embodied the ultimate test of mettle that the historic disaster foisted upon Iowa. Yet the cats with clinging paws reflected perhaps the entirety of 2008 a year in which we often felt as if we needed to hold on as tight as we could. The good news is, like Smith and his cats, we endured and in some cases thrived. Smith, fiancee Sarah Neumann and their beloved pets are dry and living in a farmhouse near De Witt. The couple, who already have a toddler, two dogs and a third cat, are adding to their brood, expecting their second child.", "To create the doctored photograph, someone placed Trump's headonto Smith's shoulders. Here's a side-by-side comparison of the fake image (left) and the original photograph (right):", "Photographer David Greedy also captured several photographs of Smith rescuing his cats from the flood waters in June 2008. One of them, available via Getty Images, was accompanied by the following caption:", "Brandon Smith carries his two cats, Fry and Bender, to dry land from their flooded and evacuated home on June 12, 2008 in Cedar Rapids, Iowa. Much of the city has been evacuated as the Cedar River continues to rise to record levels. More rains are predicted over the next few days. (Photo by David Greedy/Getty Images)", "This isn't the first fake rescue photograph of President Trump. He was also digitally manipulated into an image of a rescue boat in choppy waters. In the days following Hurricane Harvey, many other fake or miscaptioned photographs also appeared online.", "Boston.com.   \"Mississippi Floodwaters in Iowa.\"     17 June 2008.", "CBS News.   \"Trump Visits Harvey Victims in Houston — Live Updates.\"     2 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]