["About this rating", "In what one expert called a “hair-raising” experience, a now-viral video recorded in October 2020 captured one Utah man’s experience being followed by a mountain lion — one of the largest predators found in the United States Rocky Mountains — for more than six harrowing minutes.", "Snopes readers asked us to verify whether the mountain lion was stalking the hiker in a predatory fashion or, as many social media users pointed out, was in fact protecting her cubs from the perceived threat of the hiker.", "Kyle Burgess, the original poster of the video, told the local Fox affiliate station KSTU that he was hiking in the Slate Canyon wilderness area of Utah around 5 p.m. when he came across what he thought were bobcats.", "What he encountered turned out to be much more threatening.", "https://www.youtube.com/watch?v=9Pg2CDCm34w&feature=youtu.be", "“Turns out they were cougar cubs and their mother was not happy to see me. She follows me for over six minutes acting very aggressive while I walk backwards up the trail. Very scary cougar encounter,” wrote Burgess in a post accompanying the YouTube video.", "Snopes spoke with Darren DeBloois, game mammals program coordinator with the Utah Division of Wildlife Resources, who said that the mountain lion’s body language and duration of stalking were likely in response to perceiving a threat to her cubs rather than an attempt at dinner.", "“The fact that he ran into kittens first and was then pursued is considered a defensive action,” said DeBloois, adding that Burgess “appeared to do everything right” given the situation by making himself appear larger, louder, and avoiding running.", "“Who knows what she would have done if he had turned around and run,” he added.", "Mountain lions are known by many names — cougar, puma, panther, and scientifically Puma concolor — and are one of the largest predators of North America, though they range from the Canadian Yukon to the tip of South America, according to the National Wildlife Federation. The Cougar Fund adds that mountain lions give birth to between one and six cubs year-round and are dedicated mothers who spend more than three-quarters of their lives caring for their cubs, making them protective and territorial.", "Generally speaking, mountain lions are ambush predators and will stalk their prey under cover of the surrounding landscape until the perfect moment reveals itself, at which point they will pounce and bite the neck of their prey.", "DeBloois said that it is apparent the mountain lion did not perceive Burgess as a direct threat and delivered a handful of bluff charges to remind him who was in charge.", "“She knew that he knew that she was there and wasn’t going to cross that line – but it could have happened. At any moment, she could have decided that this threat was big enough, and she could have done something more,” said DeBloois.", "In North America, the nonprofit advocacy organization Predator Defense reports that cougars have killed 25 people since 1890. Mountain lions rarely attack humans, particularly those traveling in large groups, but human-cougar conflicts have been known to occur. In the event of an attack, experts recommend staying calm and confident, making yourself appear larger and louder while maintaining eye contact. Slowly create distance between yourself and the mountain lion, but never turn your back and walk away. If attacked, fight back.", "Higgins, Hailey.   \"Caught on Video: Orem Man Records Tense Mountain Lion Encounter in Slate Canyon.\"\r\n    Fox 13.   12 October 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]