["About this rating", "One of the the most popular bits of scientific misinformation in circulation is the notion that the female praying mantis always cannibalizes the head of her mate post-coitus. This claim is not without any merit, as female praying mantids often decapitate and ingest the heads of their mates after copulation, phenomenon biologists refer to as \"sexual cannibalism\":", "Sexual cannibalism refers to females killing and consuming their male partner at some stage during courtship and mating. Sexual cannibalism can occur before or during mating, which will determine potential explanations for its occurrence.", "Praying mantids are perhaps the most famous example of sexual cannibalism, which is common in insects, spiders, and other arthropods. The assertion that their copulations necessitate this action, however, is false, as the bulk of mantid copulations do not end in decapitation. The prevalence of this phenomenon was discussed in a 2016 study published in the Proceedings of the Royal Society B:", "In praying mantids that exhibit sexual cannibalism, it occurs in 13–28% of natural encounters in the field, thus imparting significant mortality on males during the breeding season.", "Unlike some sexually cannibalistic spiders, male mantids can mate repeatedly and potentially fertilize multiple females during their lifetime. Thus, all else being equal, male mantids should be under significant selection to reduce to cost of falling prey to a mate.", "Myriad explanations have been offered for the behavior’s occurrence, but many entomologists generally link the practice to be a trade-off between resource scarcity and procreation (though plenty of other explanations have been advanced as well):", "Sexual cannibalism necessarily eliminates the possibility of future mating for the male, but this cost might be at least partially ameliorated if he mates successfully with the predatory female and his value as a food item allows this female to produce more offspring. Male sacrifice may evolve if the chance of encountering more than one female in a lifetime is small and the consumption of the male by the female operates as parental investment that increases the female’s reproductive output.", "In other words, the benefit to a female may stem from the nutritional support provided by the male, assuming the deadly deed occurs after ejaculation. The male, in turn, would have the benefit of ensuring nutritional support for the mother and his genetic progeny in exchange for his head (and life). This mechanism was tested in a 1994 laboratory experiment in which males were introduced to either starved or well fed female mantids, and cannibalism was observed to occur only when males were exposed to the underfed females:", "No female fed ad libitum ate any of her mates despite considerable variation in degree and intensity of male courtship [...]. In all but one case starved females ate their mates, again irrespective of the degree and intensity of the male display.", "While evolutionary biologists continue to investigate and debate this unsettling behavior, there is a growing consensus that its occurrence in nature may have multiple potentially unrelated causes. Regardless of cause, however, the evidence is clear: male mantids can and often do successfully copulate without having their heads ingested, and therefore the claim that it is a biologically necessary aspect of praying mantid mating is demonstrably false.", "Liske, E. and W.J. Davis.   \"Sexual Behavior of the Chinese Praying Mantis.\"\r\n    Animal Behaviour   (32:916-917, 1984).", "Chapple, Steve.   \"Bugz: Everyone Has a Scorpion-in-the-Ear Story.\"\r\n    Sports Afield.   1 August 1997.", "Raver, Anne.   \"Ants in Your Pants? Nope, They're Dozing Underground.\"\r\n    Minneapolis Star Tribune.   7 November 1996.", "Teyssier, Jean Claude and Dan Schneider.   \"The Devil's Riding Horse.\"\r\n    Canadian Geographic.   17 July 1997.", "Elgar, Mark A., and Jutta M. Schneider.   \"Evolutionary Significance of Sexual Cannibalism.\"\r\n    Advances in the Study of Behavior. 13 December 2004.", "Brown, William D. et al.   \"Sexual Cannibalism Increases Male Material Investment in Offspring: Quantifying Terminal Reproductive Effort in a Praying Mantis.\"\r\n    Proceedings of the Royal Society B. 29 June 2016.", "Kynaston, Suzanne E. et al.   \"Courtship, Mating Behaviour and Sexual Cannibalism in the Praying Mantis, Sphodromantis Lineola.\"\r\n    Animal Behaviour.   March 1994.", "Prenter, John et al.   \"Sexual Cannibalism and Mate Choice.\"\r\n    Animal Behaviour.   13 February 2006.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]