["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This undated electron microscope image made available by the U.S. National Institutes of Health in February 2020 shows the Novel Coronavirus SARS-CoV-2, yellow, emerging from the surface of cells, blue/pink, cultured in the lab. (NIAID-RML via AP)", "A virology lab in Wuhan received about $600,000 over five years from the U.S. government. Some of the money came while Trump was president. The grant was part of an effort to spot viruses in wildlife that might jump and infect humans.", "The best genetic analysis to date says the virus that causes COVID-19 was not created in a lab.", "A Facebook post alerted readers to this \"breaking news\":", "\"President Trump just announced that the ‘biological’ lab in Wuhan where the COVID-19 virus was created was ‘funded’ by President Barak (sp) Hussein Obama in 2015 to the tune of $3,800,000 American dollars! This fact directly links Obama to all 150,000 deaths around the world!\"", "A different post makes a similar point: \"Well well well, in 2015 Obama gave the Chinese lab in Wuhan 3.7M grant to study the corona virus what a coincidence.\"", "The first post builds on the conspiracy theory that the Wuhan Institute of Virology in China created the virus.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There’s nothing correct in this post, although President Donald Trump does play a supporting role in spreading some of the inaccurate information at the heart of the claim.", "Here’s where the post either misleads or flat out gets things wrong.", "Early on in the crisis, the idea took hold that the virology lab in Wuhan engineered the virus. We looked at that claim in detail before and found that the genetic sequence of the virus shows no signs of genetic engineering.", "A research team at Scripps Research compared the virus to viruses that had hit humans, such as the one behind the SARS outbreak, and viruses that are found in animals. All the evidence pointed to a natural source.", "\"We do not believe that any type of laboratory-based scenario is plausible,\" the researchers wrote.", "There are unresolved concerns that protective lapses at the lab may have allowed a virus collected from nature to escape, and to be clear, that is an unproven allegation, and Chinese officials deny it. But that is different from the virus being intentionally manufactured by human hands.", "The correct amount sent to the Wuhan virology lab is $598,500, and that was spread over five years, according to the American research group running the project.", "Here’s what we know about the lab, that work and the U.S. funding.", "In 2014, the National Institute of Allergy and Infectious Disease backed a project by the EcoHealth Alliance, a nonprofit that aims to protect the people, land and animals in areas where viruses can jump from one species to another, as coronaviruses are known to do. The alliance has projects across 30 countries, including many in Asia, such as Thailand, Vietnam and China.", "The 2014 project focused on bats in Yunnan province, about 800 miles southwest from Wuhan, on the border with Vietnam, Laos and Myanmar. In 2018, alliance researchers reported they had found a virus in bats very similar to SARS.", "\"If we know what viruses are out there in wildlife, and which people are getting infected, we have a chance to stop pandemics dead in their tracks,\" the group’s president Peter Daszak said in a press release at the time.", "The group contracted the virology lab in Wuhan to conduct the genetic analyses of the viruses that were being collected in the field. The lab was selected after it was approved by the U.S. State Department and NIH.", "The National Institutes of Health website shows a total award of about $3.4 million over six years to EcoHealth Alliance. The group’s spokesman Robert Kessler told us that, of that, the Wuhan lab received just under $600,000.", "That’s about 85% less than the Facebook post asserted.", "That NIH spending included about $265,000 for the lab under the Trump administration. In 2019, NIH renewed the grant to EcoHealth Alliance for another five years. That decision came on Trump’s watch and he said \"we will end that grant very quickly.\"", "There is a virology lab in Wuhan, and it did get money from the U.S. National Institutes of Health. But the post exaggerates what Trump said about that.", "In an April 17 White House coronavirus briefing, a reporter from the conservative website Newsmax asked Trump about the grant. Here’s the exchange:", "Reporter: \"(There’s a) report that the NIH, under the Obama administration, in 2015 gave that lab $3.7 million in a grant. Why would the U.S. give a grant like that to China?\"", "Trump: \"The Obama administration gave them a grant of $3.7 million? I’ve been hearing about that. And we’ve instructed that if any grants are going to that area — we’re looking at it, literally, about an hour ago, and also early in the morning. We will end that grant very quickly.", "\"But it was granted quite a while ago. They were granted a substantial amount of money. We’re going to look at it and take a look. But I understand it was a number of years ago, right?", "\"When did you hear — when did you hear it was — the grant was made?\"", "Reporter: \"2015.\"", "Trump: \"2015? Who was president then? I wonder.\"", "Trump didn’t announce anything. He responded to the reporter’s question about the grant and said he’d heard about certain reports and was looking into it.", "A Facebook post said Trump announced that a lab in Wuhan where the COVID-19 virus \"was created\" received $3.8 million under the Obama administration.", "A reader would see this claim and assume millions of U.S. tax dollars were used to create the virus that leads to COVID-19. That isn’t the case.", "Trump didn’t make this announcement. He was responding to a reporter’s question.", "The best evidence so far says the virus was not created in a lab.", "The money that went to the lab was about 85% less than what the post said.", "We rate this claim False.", "Blogger, Facebook post, April 22, 2020", "Science Daily, COVID-19 coronavirus epidemic has a natural origin, March 17, 2020", "Nature, The proximal origin of SARS-CoV-2, March 17, 2020", "National Institutes of Health, Project: Understanding the risks of bat coronavirus emergence, accessed April 29, 2020", "USA Spending, EcoHealth Alliance, accessed April 24, 2020", "U.S. Health and Human Services Grant Tracking, Understanding the risk of bat coronavirus emergence, accessed April 30, 2020", "Virologica Sinica, Serological Evidence of Bat SARS-Related Coronavirus Infection in Humans, China, Jan. 8, 2018", "EcoHealth Alliance, EcoHealth Alliance Announces Discovery of SARS-Like Viruses Spilling Over into People in China, March 2, 2018", "White House, Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing, April 17, 2020", "Reuters, France says no evidence COVID-19 linked to Wuhan research lab, April 17, 2020", "New York Times, Scientists Were Hunting for the Next Ebola. Now the U.S. Has Cut Off Their Funding, Oct. 25, 2019", "Fox News, Gaetz calls for end to NIH grant to Wuhan virology lab, says it can be done with 'stroke of a pen', April 14, 2020", "Daily Mail, U.S. government gave $3.7million grant to Wuhan lab at center of coronavirus leak scrutiny that was performing experiments on bats from the caves where the disease is believed to have originated, April 12, 2020", "Email exchange, Robert Kessler, communications manager, EcoHealth Alliance, April 29, 2020", "Email exchange, press office, National Institute of Allergy and Infectious Disease, April 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]