["Rep. Nita Lowey is administered the oath of office by House Speaker Nancy Pelosi on Jan. 3, 2019. (Facebook/Congresswoman Nita Lowey)", "The federal government’s partial shutdown has amplified disagreements over how best to secure the southern border. U.S. Rep. Nita Lowey, whose 17th Congressional District includes Rockland County and part of Westchester County, contends building a wall would not prevent the influx of opioids to the United States.", "\"I think there are serious differences about what we should be doing for border security,\" Lowey, a Democrat, told WNYC radio host Brian Lehrer.", "Lowey, who chairs the House Appropriations Committee, called the amount of opioids coming through ports of entry a \"real threat.\" She said people should know that opioids arrive in the United States through smugglers approaching legal points of entry.", "\"The facts are, the majority of opioids and all kinds of other things that are connected to the opioids are coming through the point of entry,\" she said. \"They’re not coming with an individual person, maybe some are. But they’re coming in trucks, they’re coming in cars, they’re coming right through the point of entry.\" She added later: \"The fence, the wall, the concrete wall that the president is talking about, from most of the experts, doesn’t make a difference.\"", "Given the debate over building a wall along the southern border, and also the lives lost to opioid addiction, we wondered if Lowey is right. Do most opioids come through legal ports of entry and not across the border where President Trump wants to build a wall?", "Trump, to bolster his case for a wall, at times has said it would stop the flow of drugs. In a 2019 budget memo, the administration stated, \"Building the wall is critical to impeding and denying the flow of illicit drugs into our country.\"", "The southwest border \"remains the primary entry point for heroin into the United States,\" according to the Drug Enforcement Agency.", "The United States has more than 300 ports of entry, where U.S. Customs and Border Protection agents screen travelers and cargo. Enforcement at these ports of entry, such as airports and shipping facilities, are the responsibility of the Customs and Border Protection’s Office of Field Operations. Enforcement between ports of entry is the responsibility of the CBP’s Border Patrol.", "People inside and outside government use U.S. Customs and Border Protection data to understand how heroin and other drugs flow into the United States, but it should be noted that the data reflects drug seizures and cannot account for drugs that come in undetected. The Congressional Research Service warned in December that \"data on seizures are available, but these reflect an unknown portion of total drugs traversing U.S. borders.\"", "While we cannot measure the heroin that comes into the country undetected, it should be noted that federal data since at least 2012 have been consistent in showing that agents encounter far more heroin at ports of entry than between ports of entry.", "Lowey’s spokesman, Mike Burns, pointed us to enforcement statistics from U.S. Customs and Border Protection to support her claim.", "The data show that far more drugs are detected at ports of entry than between ports of entry. The Office of Field Operations, working at ports of entry, seized 4,813 pounds of heroin during the first 11 months of fiscal year 2018, through Aug. 31, 2018. During the same period, U.S. Border Patrol, which works between legal ports of entry, seized 532 pounds of heroin. CBP statistics from 2012 through 2017 show similar disparities between heroin seized at ports of entry and heroin seized between ports of entry. The data also show that fentanyl, another opioid, was seized at ports of entry at a higher rate than at points between ports of entry.", "The Drug Enforcement Agency reports similar findings, noting in its 2018 National Drug Threat Assessment that \"a small percentage of all heroin seized by CBP along the land border was between ports of entry.\"", "The agency reports that most heroin flows into the nation through privately owned vehicles entering through legal ports of entry, followed by tractor-trailers, where the heroin is co-mingled with legal cargo. \"Body carriers\" account for a smaller percentage of heroin movement across the U.S.-Mexico border, according to the agency.", "The agency said 85 percent of the fentanyl that came across the U.S.-Mexico border in 2017 entered through the San Diego port of entry.", "Data and analysis from the drug enforcement and customs agencies have been used by the Congressional Research Service, Cato Institute, and Brookings Institution, among others, to explain the flow of drugs and recommend policy changes.", "David Bier, an immigration analyst who writes about border security at the libertarian Cato Institute, said that by saying a \"majority\" of opioids come through ports of entry, Lowey had \"understated the case.\"", "\"By weight, the average port inspector seized 8 times more cocaine, 17 times more fentanyl, 23 times more methamphetamine, and 36 times more heroin than the average Border Patrol agent seized at the physical border in early 2018,\" Bier wrote in an email.", "\"Given these trends, a border wall or more Border Patrol agents to stop drugs between ports of entry makes little sense,\" Bier wrote in a paper for Cato. The Cato Institute advocates for drug legalization.", "A 2017 report by Vanda Felbab-Brown, who led the Brookings Institution’s project on global drug policy, used the same statistics and argued that a border wall would not affect the flow of drugs in the United States. Brookings is a public policy think tank that has fellows of different points of view.", "In early 2018, PolitiFact North Carolina factchecked a related claim from Ann Coulter, in which she tied \"100 percent\" of the opioid epidemic to the lack of a wall, and rated it \"Pants on Fire.\"", "In 2017, PolitiFact National wrote about Trump’s claims about how a border wall would stop drugs from entering the country, and found that much of the illegal drugs coming into the United States come through legal ports of entry.", "In a conversation about the federal government’s partial shutdown and Trump’s desire for a wall at the U.S.-Mexico border, Lowey said that the majority of opioids come through points of entry, not between points of entry where a wall would be.", "Data from Customs and Border Protection and analysis from the Drug Enforcement Agency confirm that when heroin and fentanyl come into the U.S., most come through ports of entry in private vehicles, not between ports of entry.", "We rate Lowey’s claim True.", "\"Chairwoman Lowey on the Government Shutdown in the New Session,\" the Brian Lehrer Show, WNYC, Jan. 7, 2019. Accessed Jan. 8, 2019.", "Email conversation, Mike Burns, spokesman, Rep. Nita Lowey, Jan. 9, 2019.", "Twitter, @realDonaldTrump, April 25, 2017. Accessed Jan. 10, 2019.", "Customs and Border Protection Enforcement Statistics FY 2018. Accessed Jan. 9, 2018.", "Combatting the Opioid Epidemic, 2019 Budget Factsheet. Accessed Jan. 9, 2018.", "\"Full Transcripts: Trump’s Speech on Immigration and the Democratic Response,\"  New York Times, Jan. 8, 2019. Accessed Jan. 9, 2019.", "\"The White House says the border wall would keep opioids out of the U.S. It wouldn’t,\" Washington Post, Jan. 8, 2019. Accessed Jan. 8, 2019.", "\"Trump’s wall won’t do anything about the opioid epidemic,\" Vox, Jan. 9, 2019. Accessed Jan. 9, 2019.", "Heroin trafficking in the United States, Congressional Research Service. Dec. 11, 2018. Accessed Jan. 9, 2019.", "2018 National Drug Threat Assessment, Drug Enforcement Agency, October 2018. Accessed Jan. 10, 2019.", "Email conversation, David Bier, Cato Institute, Jan. 10, 2019.", "\"How Legalizing Marijuana Is Securing the Border: The Border Wall, Drug Smuggling, and Lessons for Immigration Policy,\"  Cato Institute, Dec. 19, 2018. Accessed Jan. 9, 2019.", "\"The Wall: The real costs of a barrier between the United States and Mexico,\" Brookings Institution, August 2017. Accessed Jan. 10, 2019.", "\"Would a border wall have prevented the opioid epidemic?\" PolitiFact North Carolina, Feb. 2, 2018. Accessed Jan. 9, 2019.", "\"Will a border wall stop drugs from coming into the United States?\" PolitiFact, Oct. 26, 2017. Accessed Jan. 10, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]