["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Democratic primary voters search for differences between U.S. Reps. Steve Rothman and Bill Pascrell, Rothman claims that support for a government-run health insurance plan separates them.\n\nCalling himself the more progressive Democrat, Rothman pointed out various differences between him and Pascrell during a March 16 interview on NJToday. Rothman and Pascrell are preparing to battle June 5 for their party’s nomination to represent the 9th Congressional District.\n\nAmong those differences, Rothman claimed that \"Bill voted to remove the public option from the Affordable Health Care Act.\"\n\nPolitiFact New Jersey checked the voting records and found that Rothman is wrong to claim Pascrell voted to remove the public option. In fact, the congressmen cast the same votes on major health care reform measures in late 2009 and early 2010.\n\nLike Rothman, Pascrell voted in November 2009 in support of a House bill that included a public plan as part of overhauling the nation’s health care system. A public option was later scrapped in a U.S. Senate version of health care reform, which became the final law.\n\nFirst, let’s explain the congressmen’s voting records on health care reform.\n\nIn a 220-215 vote on Nov. 7, 2009, the House narrowly approved the Affordable Health Care for America Act, which included a public health insurance option. Pascrell and Rothman both voted for the bill.\n\nThe following month, the Senate approved its own health care reform bill, called the Patient Protection and Affordable Care Act, in a 60-39 vote. That legislation did not include a public plan option.", "The House would later pass the Senate bill in a 219-212 vote on March 21, 2010, sending it to President Barack Obama to become law. The reform law was later modified by a separate piece of legislation.\n\nPascrell and Rothman both voted for the Senate bill, and the legislation making changes to it.\n\nSo, Pascrell did not vote \"to remove the public option.\" Pascrell voted for a House bill that included the public option, but a Senate health care overhaul bill -- which became the final law -- did not include it.\n\nPaul Swibinski, a consultant to Rothman’s campaign, told us in an e-mail that \"Steve misspoke when he said that Pascrell voted against the public option. Steve meant to say that Pascrell opposed the public option.\"\n\nSwibinski pointed to a January 2010 Congressional Quarterly Today article, which stated Pascrell was proposing a series of scaled-back health care bills. \"No 'public option,' no mandates, no entitlements,\" Pascrell is quoted as saying in the article.\n\nSean Darcy, a spokesman for the Pascrell campaign, argued that at the time of the article, \"the public option was dead.\" Various news articles in early January 2010 indicate that House Democrats had abandoned hopes for a public option in light of the Senate vote.\n\n\"Pascrell was still very much in favor of the public option and was extremely supportive of it,\" Darcy said in an e-mail. \"As noted, the Senate bill did not include the public option so the consensus among the people actually fighting to get a substantive health care bill passed was that this piece was no longer an option. With all this in mind, Pascrell was acknowledging that we needed to move on and find a way to get health care reform done.\"\n\nBefore and after the health care reform was enacted, Pascrell publicly expressed his support for a government-run health insurance plan.\n\nIn an August 2009 opinion piece, Pascrell wrote, \"Health care reform without the public health insurance option would be a hollow one.\" An August 2010 article on PolitickerNJ.com quoted a Pascrell spokesman as saying the congressman \"remains a supporter of the public option.\"\n\nOur ruling\n\nIn an NJToday interview, Rothman claimed Pascrell \"voted to remove the public option from the Affordable Health Care Act.\"\n\nBut Pascrell voted in November 2009 for a House bill that included a public option. The Senate approved a reform bill that didn’t include a public option, and that version became the final law.", "We rate the statement False.", "To comment on this ruling, go to NJ.com.", "NJToday, Rep. Steve Rothman Says His Opponent Isn't a Progressive Democrat, March 16, 2012\n\nPublic Health Insurance Option A Must, an opinion piece written by Congressman Bill Pascrell, Aug. 19, 2009\n\nNew York Times, A History of Overhauling Health Care, accessed March 20, 2012\n\nPolitiFact, It's official: The public option is dead, March 26, 2010\n\nTHOMAS, legislative history of health care reform laws, accessed March 26, 2012\n\nCongressional Research Service, A Comparative Analysis of Private Health Insurance Provisions of H.R. 3962 and Senate-Passed H.R. 3590, Jan. 8, 2010\n\nEmail interview with Paul Swibinski, a consultant to Congressman Steve Rothman’s campaign, March 20-22 and 26, 2012\n\nCongressional Quarterly, House Democrats Urged Not to Abandon Opportunity of a 'Legislative Lifetime', Jan. 22, 2010\n\nCongressman Bill Pascrell’s Office, Pascrell Responds to Misrepresentation of the Affordable Health Care for America Act, Nov. 25, 2009\n\nPOLITICO, Bill Pascrell fed up with 'arrogant' Democrats, Jan. 25, 2010\n\nThe Hill, Some House Dems warming to idea of scaled-back healthcare reform, Jan. 21, 2010\n\nYouTube, Rep. Pascrell talks Health Care with Chris Matthews on MSNBC's Hardball, Jan. 25, 2010\n\nThe Henry J. Kaiser Family Foundation, Side-By-Side Comparison of Major Health Care Reform Proposals, April 21, 2010\n\nEmail interview with Sean Darcy, spokesman for Congressman Bill Pascrell’s campaign, March 20 and 26, 2012\n\nPolitickerNJ, Straten takes on tough-to-beat Pascrell for the second time in as many cycles, Aug. 2, 2010\n\nNew York Times, House Democrats to Pursue Health Bill Changes, Jan. 5, 2010\n\nAssociated Press, Government Health Insurance Option Appears Doomed, Jan. 9, 2010\n\nNew York Times, A Higher Price Tag Enters Negotiations, Jan. 10, 2010", "Congressional Research Service, Health-Related Revenue Provisions: Changes Made by the Reconciliation Act of 2010 to Senate-Passed H.R. 3590, March 19, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]