["“The CEO of a Netflix – Reed Hastings – has been caught by FBI agents with 13,000 files of child pornography. He was arrested at his home in California,” reads a Facebook post, archived here, shared more than 400 times since it was published on September 12, 2020.", "The same claim also circulated on social media in Spanish, Portuguese, German and Italian.", "Many posts give the source of the information as Toronto Today, a website describing itself on Facebook as offering “radical and revolutionary news”.", "AFP Fact Check found the site was registered on July 8, 2020, according to domain name search site WhoIs. Since then, the website has published several viral false claims debunked by various fact-checking organisations, including Snopes and Lead Stories.", "On September 12, 2020, Toronto Today published an article headlined, \"Netflix CEO gets BUSTED with 13,000 files of CHILD PORNOGRAPHY\". Although the article has since been removed, an archived version is still accessible.", "AFP Fact Check ran a Google search of keywords from the article, such as the alleged “13,000 files” of child pornography and “279 of the submitted files” allegedly depicting victims known to authorities.", "We found US news reports about the arrest of a man in Utah state in December 2019. The man, described as a “CEO”, reportedly possessed more than 13,000 files of child pornography, with 279 including “identifiable child victims”.", "The Toronto Today story also mentions two organisations that were allegedly involved in investigating Hastings - the Internet Crimes Against Children Task Force (ICAC) and the National Center for Missing and Exploited Children (NCMEC).", "AFP Fact Check ran keyword searches for “Hastings” on the websites of the two organisations but found no information on his alleged arrest.", "Brandon Pursell, commander of the ICAC task force in central Califonia, told AFP Fact Check his task force “did not arrest” Hastings.", "Furthermore, the FBI did not release a statement on Hasting's alleged arrest as it has done in the past for prominent figures, including former Uber CSO Joseph Sullivan, who was charged in August with attempting to cover up a hack of millions of customers’ personal details.", "Hastings, who co-founded Netflix in 1997, was active on Twitter on September 12, 2020 -- the same day the Toronto Today article reported that he had been “arrested at his home in California”.", "https://t.co/Wkr1S14YZV Some independent perspective on the Sundance award-winning French film Cuties", "He has since given interviews to media outlets including Wired and NPR promoting his book, ‘No Rules Rules: Netflix and the Culture of Reinvention’.", "The child pornography allegation comes amid calls for a boycott of Netflix over French film “Cuties” (“Mignonnes”), which critics say portrays its young stars in a sexualised way. Celebrities and politicians have tweeted the hashtag #CancelNetflix, used more than 200,000 times.", "Just a reminder to #CancelNetflix if you haven’t already. My dear friend & fellow child advocate @drjohndegarmo called @Netflix & after a calm and lengthy discussion on why #Cuties is child exploitation, promoting pedophelia, and is soft core porn, Netflix says they stand by it.", "Meanwhile, US Republican Senator Ted Cruz wrote to the Justice Department asking it to investigate \"whether Netflix, its executives, or the makers of the film ‘Cuties’ violated any federal laws against the production and distribution of child pornography\".", "Deeply disturbing: Netflix aggressively promoting new movie sexualizing children. Hollywood should not be celebrating & making $$ off of the sexual abuse of 11-year-old girls. This is not OK. https://t.co/GYZMVvKBO4", "Netflix has withdrawn a promotional photo for the film that shows its young actresses in shorts and crop tops.", "Contacted by AFP Fact Check, the FBI has declined to comment on the claims. Netflix's press office and the National Center for Missing and Exploited Children (NCMEC) have so far not replied to our queries.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]