["About this rating", "Hollywood actor Richard Gere has been the subject of multiple hoaxes throughout his life.", "In 1998, we covered the infamous story about Gere and a gerbil. The star of 1982's \"An Officer and a Gentleman\" also was part of a rumor that spread virally on Facebook in 2015 claiming that Gere had gone undercover to give $100 to every homeless person he saw in New York City. There was also a claim about a sequel to the 1990 classic film, \"Pretty Woman.\"", "Since at least March 2019, the website MoneyPop.com bought online advertisements that said: \"Richard Gere's net worth left his family in tears.\" The advertisements were accompanied by the following photograph of Gere, which appeared to come from the 2014 drama, \"Time Out of Mind\":", "The advertisement was false. As of December 2020, Gere is alive. We were able to find the advertisement with the \"Richard Gere's net worth left his family in tears\" text in multiple Google searches.", "We previously reported that Alex Trebek, Sean Connery, and even the very much alive Jaleel White had also been subject to the same \"net worth left his family in tears\" hoaxes.", "Once clicked, the advertisement for Gere led to a 51-page slideshow about celebrity net worths. The slideshow story did not mention anything about Gere's family being \"left in tears\" about his net worth.", "The strategy behind these misleading advertisements and lengthy slideshow stories is known as advertising \"arbitrage.\" The goal was to make more money on the ads displayed on each of the 51 pages in the slideshow than it cost to run the initial ad that lured readers to the story in the first place. The business and technology blog Margins referred to \"arbitrage\" as \"the mythical free lunch that economics tells us does not exist.\"", "Other examples of misleading \"arbitrage\" ads that we've covered in the past included a vacation photo that went viral, \"man finds weird cave\" (and it supposedly happened in your town), and a military vehicle that purportedly cost $1 billion.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]