["The video was published here on Twitter on February 25, 2020.", "It has been viewed more than 110,000 times.", "Below is a screenshot of the misleading Twitter post:", "The video was also published here and here on Facebook and here and here on Twitter alongside a similar claim.", "This claim is misleading; this video was shot underwater off Coron in the Philippines by a freediver but the supposed lake is an illusion created using an upside-down camera trick.", "A keyword search found this 12-minute video titled “One Breath Around The World” on the Youtube channel of Guillaume Néry, a multi-record holding French freediver. The clip is a longer version of the same video in the misleading tweet.", "Below is a screenshot comparison of the video in the misleading tweet (L) and the video on Néry’s Youtube channel at the five-minute 53-second mark (R):", "Néry’s video was also included in this February 4, 2019 article published on the website for Philippines-based lifestyle magazine SPOT.ph. The report's headline reads: “This Jaw-Dropping Video Shows the Philippines Through the Eyes of a French Freediver\". It states the video was filmed using an “upside-down camera trick”.", "The article states, in part: “The short film, titled One Breath Around the World, was released on February 2 on Facebook and has since earned 1.6 million views and 39,000 shares. Some of the most amazing parts of the video include the limestone formations under Barracuda Lake in Coron, Palawan (2:16), an underwater shot in Coron filmed using an upside-down camera trick (5:50), and shots of Davao del Norte’s Sama-Bajau people, who can hunt underwater for as long as 13 minutes at depths of around 200 feet (6:14 mark).”", "Néry also published a similar photo taken underwater off Coron here on his Instagram account.", "#Repost @onedayonepicturenery ・・・ 569: July 22nd: Chilling at the beach / by @guillaumenery #guillaumenery with @juliegautier.nery / taken with #sonya7rii @nauticamhousings #nauticamhousings #underwater #underwaterart #underwaterphotography #freediver #freediving #freedivingart #freedivingphotography #philippines #itsmorefuninthephilippines", "A post shared by  Guillaume Néry (@guillaumenery) on Jul 23, 2017 at 8:50am PDT", "The same misleading claim was also debunked by Twitter account HoaxEye here on February 25, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]