["A video of an overflowing reservoir has been shared on social media with the claim that it represents the Pawna dam in Pune.", "India 🇮🇳 Konya Dam… nothing to see here. ☕️ pic.twitter.com/zOan9jDftw", "— RealEyes1776 (@RE_1776) July 25, 2021", "🇮🇳 India: Koyna dam of Maharashtra… pic.twitter.com/olyKr15aF8", "— 404_Not_Found (@4_04_Not_Found) July 26, 2021", "The same video was shared in August 2019 when Pune witnessed heavy rainfall. “Opened floodgates of one of the four reservoirs in Pune, India,” reads the message along with the 14-second video clip.", "Opened floodgates of one of the four reservoirs in Pune, India. pic.twitter.com/MrYeSNddzu", "— Swaminathan P (@swami2005) August 5, 2019", "Alt News found one more tweet with a similar claim saying – “Paunadharam dam near to Pune.”", "We ad received several requests to fact-check this claim on our Android Alt News App.", "Alt News used InVid to break down the video into multiple frames. Upon reverse searching one of the frames, we found the same video posted in April 2019. According to this post, the video is of a dam on the Yellow River in China.", "Yellow River – druga najdłuższa rzeka w Chinach", "Yellow River – druga najdłuższa rzeka w Chinach 🇨🇳 😮😮😮 ___________________________ Dziękujemy za dotychczasowe polubienia naszego fanpage i prosimy o kolejne. Naszą prace wykonujemy z pasji, nie mając za to żadnego wynagrodzenia. Dziękujemy, że jesteście z nami ❤❤❤ Nasz fanpage 👉 www.facebook.com/sjpiekny/ Nasza grupa 👉www.facebook.com/groups/swiat.jest.piekny/", "Posted by Świat jest piękny – magiczne miejsca on Friday, 26 April 2019", "Upon further searching with the keywords ‘Yellow River dam’, we came across the same video on YouTube published in November 2018 with the description, “The huge and amazing Water flow of Yellow river discharged from Xiaolangdi Dam in China”. Xiaolangdi Dam is in Jiyuan, in the Henan province of China.", "We also found a tweet by the Chinese news agency Xinhua, which had posted a video of the dam in July 2018.", "“Water from the sky”: China discharges water from Xiaolangdi Dam in an annual cleansing effort to prevent #flooding along #YellowRiver pic.twitter.com/9HQnL5aP7C", "— China Xinhua News (@XHNews) July 26, 2018", "Alt News juxtaposed a frame from the viral video with a video of the Xiaolangdi Dam to ascertain that the two are indeed the same. The juxtaposed image is posted below. Moreover, the colour of the water seen in both the videos is brown. This is due to siltation.", "In conclusion, the video in question represents not the Pawna Dam in Pune but the Xiaolangdi Dam on the yellow river in the Henan province of China.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]