["“Breaking News: Emergency Food stamp Hotline (281)330-8004 Share This Post,” reads a post shared on March 24, 2020, as unemployment in the US surges during a global economic slowdown caused by the novel coronavirus pandemic.", "One version was shared 39,000 times before it was removed.", "Users in the know may have spotted the reference to lyrics from a 2006 Mike Jones song, but others thought the number was genuine.", "“The phone number provided in the post is fake and should not be contacted for information about USDA’s Supplemental Nutrition Assistance Program (SNAP),” a USDA spokesperson told AFP in an emailed statement.", "More than 5,000 Americans have died from COVID-19. With more than half the planet under some form of lockdown to avoid spreading the virus, the global economy has taken a severe hit.", "A record 6.65 million Americans filed for unemployment benefits during the week ended March 28, and 3.3 million filed the week before, which was the previous record.", "The heads of three global agencies -- the UN's Food and Agriculture Organization, the World Health Organization and the World Trade Organization -- warned on March 30 of the risk of a worldwide \"food shortage\" if authorities fail to manage the crisis properly.", "People looking for information about food assistance can contact their local office, which can be found online via the SNAP state directory or by calling 1-800-221-5689, according to the USDA.", "“For general questions about USDA’s nutrition assistance programs, the public can call the USDA National Hunger Hotline at 1-866-3-HUNGRY (English) or 1-877-8-HAMBRE (Spanish),” the USDA statement said.", "Another version of the false post urges viewers to call the same phone number to track the status of their government stimulus checks, a reference to the $2.2 trillion emergency measure passed by the US Congress to ease some of the economic hardship caused by the COVID-19 pandemic.", "A US Department of the Treasury spokesperson confirmed the phone number is not affiliated with the Treasury or the relief bill.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]