["It didn’t take long for Charlie Crist to fire a major volley in the battle for the governor’s mansion, taking aim at incumbent Rick Scott’s record on homeowner’s insurance.", "Soon after the August primary, Crist outlined a plan to \"reverse Ricks Scott’s hikes to property insurance.\" The Sept. 4 document compared the new Democrat’s record on the issue to Scott’s, saying the cost-to-benefit ratio has been going in the wrong direction.", "\"During Scott’s tenure, premiums rose while the amount of coverage declined,\" Crist’s plan read. \"In other words, under Rick Scott, homeowners are paying higher premiums for less coverage.\"", "The insurance market has been on a rollercoaster ride the past decade, with consumers reeling from the highest costs for homeowner’s insurance in the nation. Are homeowners paying more for less coverage under the current Republican governor? It’s PolitiFact Florida’s policy to check the paper trail very carefully.", "A familiar pledge", "Crist is no stranger to making insurance rates a campaign issue. When he campaigned as a Republican in 2006, he pledged to bring rates down after eight hurricanes hit the state in 2004 and 2005, catapulting premiums ever higher. He followed through on a promise to call a special session of the Legislature in January 2007.", "The result was HB 1A, which expanded state-sponsored reinsurance (essentially insurance for insurers) for private carriers and froze rates for Citizens Property Insurance Corp., the state-run insurer of last resort. Because private insurers began charging such high premiums, Citizens had taken on some 400,000 more policies between 2004 and 2007, for a total of 1.2 million properties covered as private insurers looked to reduce their exposure in Florida.", "Industry experts warned that a major side effect of expanding Citizens was that the company would not be able to pay claims in the event of a direct hit by a hurricane, resulting in a statewide assessment on all policies. The rate freeze eventually stretched on until 2009, when Crist signed HB 1495, which passed the Legislature with strong support. That law allowed rate increases of up to 10 percent to help Citizens become actuarially sound. Florida’s insurance rates began another upward climb under Crist, despite no direct hits from hurricanes since 2005.", "Scott came into office in 2011 looking to reduce the high number of Citizens policies by turning to the private insurance market. His first year, he signed SB 408, which insurance companies and business groups praised. This is the bill Crist blames for rising premiums and reduced coverage; Crist vetoed a similar bill near the end of his term.", "Critics warned the legislation was bad for consumers because it allowed a reduction in overall coverage limits, shortened the window for filing sinkhole and storm-related damage claims, and limited claims for damage caused by sinkholes to primary structures, among other things.", "SB 408 also made carriers file requests with the regulation office for rate increases up to 15 percent to account for higher reinsurance costs. The law also allowed insurers to pay back some claims at actual cash value -- the cost of the insured dwelling minus depreciation -- instead of replacement value, depending on the policy.", "By the following year, Citizens began limiting coverage on most policies to the primary structure, leaving out things like gazebos, awnings, carports and pool enclosures. That was something private insurers had been doing since Hurricane Wilma in 2005.", "We took a look at average premiums for all private homeowners insurance policies over the last eight years. (Crist’s plan referred to all these years except 2014’s first quarter totals, as well, which the state’s Office of Insurance Regulation said were accurate).", "Total exposure is the amount both private companies and Citizens were liable to cover, while total premiums paid is the amount all policies collected in premiums. The state maintained a steady run of roughly 6 million total policies during this time period:", "Year/governor", "Average premium", "Total exposure", "Total premiums paid", "2007/Crist", "$1,679", "$1.82 trillion", "$9.6 billion", "2008/Crist", "$1,463", "$1.9 trillion", "$8.6 billion", "2009/Crist", "$1,421", "$1.9 trillion", "$8.3 billion", "2010/Crist", "$1,518", "$1.88 trillion", "$8.8 billion", "2011/Scott", "$1,608", "$1.88 trillion", "$9.3 billion", "2012/Scott", "$1,670", "$1.83 trillion", "$9.6 billion", "2013/Scott", "$1,732", "$1.82 trillion", "$10 billion", "2014/Scott*", "$1,741", "$1.68 trillion", "$9.5 billion", "* as of March 2014, excludes State Farm", "The chart shows that premiums dropped the first year after Crist took office, even while more coverage was in force. Premiums went up and exposure went down in 2010, Crist’s final year in office, but the trend really took off after Scott took office. Premiums continued to rise while exposure fell by some $200 billion.", "Scott’s aim was to shrink Citizens, and that’s what happened (his campaign promise to make Citizens \"actuarially sound\" is on our Scott-O-Meter). The state insurer slimmed down by more than 400,000 policies, largely by \"taking out\" customers, in which private insurers assumed coverage at slightly different terms. While customers were allowed to refuse the switch, the new policies often were less expensive than Citizens policies, with marginally better terms.", "On Sept. 4, the same day Crist released his plan to lower insurance rates if elected, the state Office of Insurance Regulation authorized 14 insurers to assume up to more than 425,000 Citizens policies, further shrinking the state’s pool of customers and reducing the company’s risk. It is the single largest authorized removal since Citizens was formed in 2002, although far fewer than that are likely to move to private insurers.", "There’s no question SB 408, passed under Scott, allowed rates to increase and coverage to be restricted, because that’s what it was supposed to do, according to Citizens media relations manager Michael Peltier. He told PolitiFact Florida that changes in sinkhole coverage were necessary because of a dramatic increase in claims that often were fraudulent. The problem hadn’t been addressed and was increasingly becoming an issue after those historic hurricane seasons in 2004 and 2005, leading to the 2007 legislation that froze rates.", "\"The rates have been raised since (SB) 408 and there have been more stricter policies since (SB) 408, but those are making up for prior deficits,\" Peltier said. He said now that rates have gone up and exposure has gone down, the company is in a much better position.", "It’s not all rosy, however, because some customers still cannot afford the coverage they need, since sinkhole coverage is not a part of a base policy.", "The entire insurance industry has insisted there are many other factors forcing continued rate increases, such as reinsurance costs and payouts for other claims beyond hurricane damage. For example, State Insurance Consumer Advocate Steve Burgess said, companies have pointed to a recent spike in claims on homeowners policies over water damage. Reports have surfaced of attorneys convincing contractors they were being shortchanged by insurance companies to repair damage from leaky pipes and floods.", "Data from the National Association of Insurance Commissioners in 2013 ranked Florida as having the most expensive homeowners insurance in the nation. Insurance Commissioner Kevin McCarty said in a January 2014 report that after years of double-digit increases, a half dozen top insurers suddenly had sought or approved cutting future premiums between 2.4 and 9.2 percent. Companies that had initially wanted increases reversed themselves when their savings on reinsurance came to light.", "Citizens in August also asked for a 2015 rate cut for about 70 percent of its customers.The state approved a slightly larger break than what was requested in September, and Citizens had to back off a plan to raise sinkhole rates in Hernando County. Peltier said the drop in exposure, the terms of 408 and the recent lower cost of reinsurance all helped bring about the lower premiums. The lack of hurricanes since 2005 has been a big help, as well.", "\"It’s taken time,\" Peltier said. \"Since (SB) 408 has had such an effect on our claims, we can’t project what our losses are going to be. We’ve had to wait.\"", "Our ruling", "Charlie Crist said \"under Rick Scott, homeowners are paying higher premiums for less coverage.\"", "He was referring to a controversial bill Scott signed in 2011, right after taking office, that made a host of changes to the insurance industry and allowed rates to go up.", "The insurance industry says these changes were necessary to remain solvent after dealing with a host of factors, including two very active hurricane seasons, a jump in sinkhole claims and high reinsurance costs. Those issues have since ebbed, and many policyholders should now enjoy a small break on premiums.", "Rates have been rising since Crist’s last year in office, in part because companies sought to catch up from limits placed on them by his 2007 legislative push after premiums rocketed out of control. That’s a bit of additional information Crist didn’t include in his attack on Scott, but his statement is still accurate.", "We rate the statement Mostly True.", "Charlie Crist, \"Protecting Your Paycheck: Charlie Crist's Plan to Reverse Rick Scott’s Hikes to Property Insurance,\" Sept. 4, 2014", "Insurance Journal, \"Fla. Gov. Crist Signs Property Insurance Bill,\" Jan. 25, 2007", "Florida House of Representatives, \"CS/HB 1A - Hurricane Preparedness and Insurance,\" Jan. 25, 2007", "Tampa Bay Times, \"Crist freezes rates for Citizens,\" June 27, 2007", "Jacksonville Business Journal, \"Crist extends Citizens rate freeze,\" May 30, 2008", "Insurance Journal, \"Florida Gov. Crist to Sign Property Insurance Rate Hike Bill,\" May 6, 2009", "Florida House of Representatives, \"CS/CS/CS/HB 1495 - Property and Casualty Insurance,\" May 27, 2009", "Insurance Journal, \"Florida Gov. Crist Vetoes ‘State Farm’ Insurance Rate Deregulation Bill,\" June 24, 2009", "South Florida Sun Sentinel, \"Property Insurance Bill Vetoed By Crist,\" June 25, 2009", "South Florida Sun Sentinel, \"Bill allowing insurers to raise rates likely to get vetoed by Crist,\" May 20, 2010", "Business Observer, \"The insurer of first resort,\" Jan. 20, 2011", "Florida Senate, SB 408 analysis, April 7, 2011", "Sarasota Herald-Tribune, \"Documents show a Scott push to shutter Citizens,\" April 23, 2011", "Florida Senate, \"CS/CS/CS/SB 408: Property and Casualty Insurance,\" May 17, 2011", "Insurance Journal, \"Florida Gov. Scott Signs Property Insurance Cost Control Bill,\" May 17, 2011", "Tampa Bay Times, \"Gov. Rick Scott signs sweeping property insurance changes into law,\" May 17, 2011", "South Florida Sun Sentinel, \"Citizens cuts some insurance coverage,\" Nov. 3, 2011", "Tampa Bay Times, \"Citizens sinkhole coverage could rise by 50 percent in Tampa Bay area,\" July 27, 2012", "South Florida Sun Sentinel, \"Scott signs bill to reform, shrink Citizens Property Insurance,\" May 29, 2013", "Citizens Property Insurance Corp., 2014 rate hearing presentation, Aug. 20, 2013", "Sarasota Herald-Tribune, \"Florida most expensive in nation for home insurance,\" Dec. 17, 2013", "Tampa Bay Times, \"Insurance summit focus is on cost,\" Jan. 16, 2014", "Palm Beach Post, \"Sans storms, Florida property insurance market continues to stabilize,\" March 24, 2014", "Tampa Bay Times, \"Florida sees small break in deluge of rising property insurance rates,\" May 12, 2014", "Tampa Bay Times, \"Florida regulators approve biggest-ever removal of policies from Citizens Property Insurance,\" Sept. 4, 2014", "South Florida Sun Sentinel, \"Most Citizens' rates cut for 2015,\" Sept. 5, 2014", "Insurance Journal, \"Florida’s Crist, Scott Spar Over Property Insurance in Race for Governor,\" Sept. 8, 2014", "Insurance Journal, \"Florida Approves Rate Cuts for Citizens Property Customers,\" Sept. 9, 2014", "Personal Insurance Federation of Florida, SB 408 position paper, accessed Sept. 8, 2014", "Florida Underwriter’s Magazine, \"Citizens rates going up; Crist on board with hikes,\" April 2009, accessed Sept. 9, 2014 via Nexis", "South Florida Sun Sentinel, \"Rick Scott calls for raising Citizens insurance rates,\" Sept. 21, 2010, accessed Sept. 9, 2014 via Nexis", "Interview with Matt Moon, Rick Scott campaign spokesperson, Sept. 9, 2014", "Interview with Steve Burgess, Florida Insurance Consumer Advocate, Sept. 9, 2014", "Interview with Amy Bogner, Florida Office of Insurance Regulation spokesperson, Sept. 9-10, 2014", "Interview with Laura Peterson, National Association of Insurance Commissioners spokesperson, Sept. 9, 2014", "Interview with Michael Peltier, Citizens Property Insurance Corporation spokesperson, Sept. 10, 2014", "Interview with Michael Kliner, Office of the Insurance Consumer Advocate attorney, Sept. 9-10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]