["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Tennessee Department of Health has no record of any licensed nurses who go by the name given in a viral video.", "There is no evidence of a direct link between the coronavirus vaccine developed by Pfizer and BioNTech and Bell’s Palsy.", "As coronavirus cases and deaths continue to rise across the country, a viral video on social media is urging people not to take the coronavirus vaccine.", "\"Hi, I am a registered nurse in Nashville, Tenn., and my name is Khalilah Mitchell. I am reaching out to everyone about the Covid-19 vaccination,\" a woman says in the video, which we found posted on YouTube Dec. 26 and shared in scores of public Facebook posts. \"I recently took the COVID-19 vaccination … After the shot I felt fine, but within three days I went to the doctor because I had problems with my face, the whole left side of my face actually.\"", "\"I have Bell's Palsy now, and as you can see I can't smile.\"", "(Screenshot from YouTube)", "The video was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It was also posted elsewhere on YouTube and in threads on anonymous internet forums.", "We’ve seen plenty of misinformation about the COVID-19 vaccines, including reports of nurses who had adverse reactions to the shot. So we wanted to look into this post, too.", "As of Dec. 29, nearly 80,000 people in Tennessee had been vaccinated for the coronavirus. A nurse named Khalilah Mitchell is not one of them.", "\"We have no record of anyone by that name in our health professional licensure system,\" said Shelley Walker, director of the Office of Communication & Media Relations at the Tennessee Department of Health.", "Fact-checking website Lead Stories checked online databases in 49 other states and the District of Columbia. It did not find any registered nurses named Khalilah Mitchell.", "We found one Facebook profile for someone named Khalila Mitchell in Nashville, and it said she works at a bakery and Ralph Lauren. We could not find any credible news reports of nurses developing Bell’s Palsy after receiving the vaccine.", "Misinformation about the condition, which affects about 40,000 Americans every year, has swirled online since a coronavirus vaccine from Pfizer and BioNTech was granted emergency-use authorization on Dec. 11.", "The confusion stems from a briefing document published by the Food and Drug Administration before the vaccine’s emergency approval. The agency noted that four vaccinated participants in clinical trials for the vaccine, representing 0.02% of the total group, developed Bell’s Palsy.", "The FDA recommended \"surveillance\" for cases of the condition as larger groups of people receive the vaccine. But the agency said the frequency of Bell’s Palsy among clinical trial participants was \"consistent with the expected background rate in the general population,\" and that \"there is no clear basis upon which to conclude a causal relationship at this time.\"", "The Facebook post is inaccurate. We rate it False.", "RELATED: Vaccine misinformation: preparing for infodemic’s ‘second wave’", "COVID Tracking Project, accessed Dec. 30, 2020", "Email from Shelley Walker, director of the Office of Communication & Media Relations at the Tennessee Department of Health, Dec. 30, 2020", "Facebook post, Dec. 28, 2020", "Food and Drug Administration, \"FDA Takes Key Action in Fight Against COVID-19 By Issuing Emergency Use Authorization for First COVID-19 Vaccine\"", "Food and Drug Administration, \"Vaccines and Related Biological Products Advisory Committee Meeting\"", "Lead Stories, \"Fact Check: Tennessee Registered Nurse Did NOT Claim She Suffered From Bell's Palsy After COVID-19 Vaccination,\" Dec. 30, 2020", "National Institute of Neurological Disorders and Stroke, Bell's Palsy Fact Sheet, accessed Dec. 30, 2020", "PolitiFact, \"Why you shouldn’t worry about getting Bell’s Palsy from the Pfizer COVID-19 vaccine,\" Dec. 11, 2020", "Snopes, \"About That Khalilah Mitchell COVID-19 Vaccine Video,\" Dec. 30, 2020", "Tennessee Department of Health, COVID-19 Vaccine Information, accessed Dec. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]