["By Robert Farley", "Posted on November 16, 2017", "As President Donald Trump listed the accomplishments of his trip to Asia, one example remains a mystery.", "“Vietnam is ordering at least $12 billion worth of Boeings. And I think they were going a different route. But now they’re going the route of ordering from us,” Trump said, while summing up some of the accomplishments of his Asian tour before leaving the Philippines.", "Curiously, though, no such deal can be found on the Boeing website, where such major deals are usually announced.", "We reached out to the White House press office for clarification, but did not hear back.", "A Boeing spokesman told us it’s possible the president may have been referring to future sales. However, he declined to comment on what future orders might look like, saying Boeing never comments on discussions it is having with its customers.", "Even if there are discussions underway for future deals, nothing has been finalized to the point where the president could claim “Vietnam is ordering at least $12 billion worth of Boeings.”", "Here’s what we can say.", "The president has repeatedly boasted that his 12-day trip to Asia resulted in $300 billion worth of trade deals. Although the figure is unconfirmed, Trump later claimed the deals would end up being much more than that.", "During the press gaggle in the Philippines on Nov. 14, Trump said: “[A]nd we have at least $300 billion worth of deals, but that will be, I think, way [sic] triple that number in a fairly short period of time.” Less than an hour later, Trump told reporters aboard Air Force One, “We actually sold $300 billion worth of equipment and other things. And I think that number is going to be quadrupled very quickly. So that’s over a trillion dollars’ worth of stuff.”", "But experts warn not to put too much stock in the announcement. As Bloomberg News put it, “The reality, however, is that the roughly 15 agreements unveiled on Thursday [in China] are mostly non-binding memorandums of understanding and could take years to materialize — if they do at all.”", "We asked the White House for a breakdown of those deals, but we did not hear back.", "Scott Kennedy, director of the Project on Chinese Business and Political Economy at the Center for Strategic & International Studies, told us via email that while the $250 billion in memorandums of understanding signed in China, for example, is a lot of money, “none of these reflect new market openings or should be seen as solidifying the U.S.-China economic relationship.”", "As for Vietnam, a White House press release said the United States and Vietnam concluded “$12 billion in commercial agreements, which when implemented will include $10 billion in United States content.”", "A press pool report from Vietnam included this list of agreements provided by the Vietnamese government:", "None of those include Boeing. The list does include two deals with the aerospace company Pratt & Whitney to purchase aircraft engines and support services.", "One contract was with Vietnam Airlines for engines for 20 planes, a deal worth $1.5 billion. Here are the press releases from Vietnam Airlines and Pratt & Whitney.", "The second deal was with VietJet for the purchase of engines to power 10 new aircraft, a deal valued at $600 million. Here are the press releases from VietJet and Pratt & Whitney.", "Those deals come to $2.1 billion, but they are not with Boeing — which makes Trump’s comment about a $12 billion deal between Vietnam and Boeing all the more puzzling.", "Here’s the context of Trump’s claim about the deal during a press gaggle in Manila, Philippines.", "Trump, Nov. 14: Coming to Vietnam was terrific. Vietnam is ordering at least $12 billion worth of Boeings, and I think they were going a different route. But now they’re going the route of ordering from us. And the reason I like the Boeing is because it’s jobs for the United States. It’s not jobs for somebody else. It’s jobs for the United States.", "But again, we could find no evidence that such a deal exists — at least not one that Trump could list among accomplishments of his Asian trip, or that happened recently under Trump’s leadership, as the comment “now they’re going the route of ordering from us” would suggest.", "As we said, there was a similar-sounding deal announced on May 23, 2016, during then-President Obama’s trip to Vietnam. On that day, Obama and Vietnamese President Tran Dai Quang, witnessed the deal, and Boeing put out a press release about it.", "Boeing press release, May 23, 2016: VietJet Aviation Joint Stock Company and Boeing [NYSE: BA] have finalized an order for 100 737 MAX 200 airplanes, the largest ever single commercial airplane purchase in Vietnam aviation. His Excellency Mr. Trần Đại Quang, President of the Socialist Republic of Vietnam, and U.S. President Barack Obama, witnessed the historic agreement, valued at approximately $11.3 billion at current list prices.", "If that’s the deal Trump was referring to, he’s double-dipping.", "Boeing officials did make the trek to Asia for Trump’s visit. During remarks in Tokyo, Japan, on Nov. 6, Trump noted that Japan was the second largest owner of Boeing aircraft behind the U.S., and he singled out a Boeing executive for applause.", "While Trump was in Beijing, China signed an agreement for the purchase of 300 airplanes from Boeing valued at $37 billion. The signing took place at a ceremony in Beijing attended by Trump and Chinese President Xi Jinping, according to a press release from Boeing. In September 2016, Boeing projected China would have demand over the next 20 years for 6,810 planes valued at over $1 trillion, so the announcement is consistent with previously announced plans.", "Prior to his Asian trip, Trump and Singaporean Prime Minister Lee Hsien Loong met on Oct. 23 at the White House, where Singapore Airlines was named as the previously “unidentified customer” of 39 new Boeing planes — a deal worth $13.8 billion at current list prices. The deal was formally announced at a White House ceremony, and Boeing put out a press release the same day.", "None of this, however, accounts for Trump’s claim that “Vietnam is ordering at least $12 billion worth of Boeings.” Unless he was talking about the deal in 2016 that was formally agreed to during Obama’s visit to the Southeast Asian country. That, or he was talking prematurely about future sales.", "We’ll update this post if the White House provides more information.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]