["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 coronavirus disease spread in March 2020, social media hoaxes raced right along with it.", "One such stunt was a fake tweet (displayed above) made to look like it was posted from the official Twitter account of U.S. President Donald Trump. The image suggested the president had blithely warned that relief checks from a COVID-19 stimulus package would only benefit people who had not published overt criticism of him on social media.", "Specifically, the hoax tweet read:", "Yes, I ordered the Treasury Secretary to send checks to Americans! First however, we will go through your social media history from the last 4 years and search for any post with #NotMyPresident in it. I wouldn't think of offending you with a check if I'm not your president! #MAGA", "We found no evidence that Trump authored this tweet. Neither a database dedicated to archiving his posts, nor a database that stores all of his deleted tweets had a record of this post.", "Another viral but false quote suggested that Trump said of the COVID-19 pandemic, \"People are dying today that have never died before.\" He did not.", "The above-displayed fake tweet was posted as lawmakers discussed a federal stimulus package that may include checks sent directly to Americans as part of an economic stimulus plan.", "As countries across the globe have worked to slow the spread of COVID-19, they have implemented various strategies of social distancing and quarantine measures that have resulted in widespread job losses and work-hour reductions.", "Menton, Jessica. \"Unemployment: U.S. Weekly Jobless Claims Jump amid Coronavirus Layoffs.\"\r\n  USA Today. 19 March 2020.", "The New York Times. \"Coronavirus Live Updates: Senate G.O.P. Plan Includes Large Corporate Tax Cuts.\"\r\n  Updated 19 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]