["“To curb water wastage, the Department of Water and Sanitation has begun its programme of training 15,000 young people as artisans.”", "“There has been no load shedding since August last year.”", "“At the level of gender, at senior management level males remain dominant at 67.6% and females at 32.4%.”", "“Government is actively involved in the property sector, having provided more than 4 million houses since 1994.”", "“There are currently almost one million students who are enrolled in higher education, up from 500,000 in 1994.”", "“Today we have nearly 1 million children who are participating in early childhood development facilities.”", "“Every month 17.5 million social grants are provided to South Africans.”", "“Since we launched the [Safe] initiative, 699 schools have been provided with safe and appropriate sanitation facilities and projects and a further 1,150 schools are either in planning, design or construction stages.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]