["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "More than a dozen campaign staffers for U.S. Democratic 2020 presidential candidate Joe Biden reportedly donated to the Minnesota Freedom Fund (MFF), a nonprofit organization that pays criminal bail and immigration bonds — or cash bonds — for those who cannot afford them. MFF became a national focus after several celebrities donated funds to the organization to bail out protesters arrested during demonstrations calling for the arrest of police officers associated with the death of George Floyd, a Black man who died while in custody.  Snopes readers inquired about the veracity of the claim.", "This claim is true. However, some incorrect or confusing information surrounding the amount donated and donors' affiliation with the Biden campaign did circulate online, following Twitter posts shared by staffers that displayed receipts for donations made to MFF.", "An investigation conducted by Reuters found that at least 13 Biden campaign staffers donated to the MFF. Colleen May, a field organizer for the Texas Democratic Party, posted a $50 receipt for her donation on May 29. Before her current role, she held several positions with the Biden campaign between December 2019 and June 2020. Patrick McCarthy, regional organizing director for the Florida Democratic Party, responded to her tweet with a similar donation. McCarthy also worked for the Biden campaign from November 2019 to June 2020. Neither May nor McCarthy were employed by the Biden campaign at the time of publication.", "In an emailed statement to Reuters, the Biden campaign declined to comment on whether May's and McCarthy's donations were made on behalf of, or in coordination with, the campaign. As part of his bid for the Democratic presidential ticket, Biden has publicly stated his opposition to the cash-bail system, referring to the practice as a \"modern-day debtors' prison.\" However, no evidence exists to suggest that donated funds came directly from the campaign.", "Adding to the controversy: A Twitter post shared by U.S President Donald Trump on June 1, 2020, said that \"Joe Biden's people\" were \"working to get the Anarchists out of jail, and probably more\" — a tweet that sparked social media outrage among some conservative groups. A Facebook post that went viral in May 2020 incorrectly claimed that the Biden campaign donated $20 million to bail out protesters. According to a report by Forbes, the MFF as a whole raised $20 million in four days from at least 150,000 individual donors, including staffers associated with Biden's campaign.", "Snopes contacted the Biden campaign but did not receive a response at the time of publication.", "Calicchio, Dom.   \"Biden Campaign Staffers Donate to Group That Bails Out Minneapolis Protesters: Report.\"\r\n    Fox News.   31 May 2020.", "Jason Lange and Trevor Hunnicutt.   \"Biden Staff Donate to Group that Pays Bail in Riot-torn Minneapolis.\"\r\n    Reuters.   30 May 2020.", "Davis, Jack.   \"Biden Campaign Staff Caught Financially Supporting Minnesota Riots.\"\r\n    The Western Journal.   1 June 2020.", "Torres, Libby.   \"Drake, Chrissy Teigen, and Steve Carell Are Just Some of the Stars Who've Donated to Bail-relief Funds Across the US.\"\r\n    Business Insider.   8 June 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]