["A migrant family crosses the border into El Paso, Texas, in Ciudad Juarez, Mexico, on Feb. 26, 2021. (AP)", "President Joe Biden never said he inherited “a mess” at the border from the Trump administration. That comment came from Senate Majority Leader Chuck Schumer.", "There were 172,286 southwest border encounters in January and February. Of those encounters, 39,572 were apprehensions.", "During the 2020 fiscal year, there were 400,651 encounters — more than 200,000 of which were apprehensions.", "Displaced by crime, political instability and the COVID-19 pandemic, thousands of migrants from Central America — including unaccompanied children — have arrived at the U.S.-Mexico border over the past few months. Top Republicans in Congress, including House Minority Leader Kevin McCarthy of California, blame the influx on President Joe Biden’s immigration policies.", "On Facebook, some users have echoed those talking points.", "\"Sleepy Joe now saying he inherited ‘a mess’ at the border,\" says a March 13 post. \"Fact: 9,000 illegals all of 2020. So far in 2021 108,000 entered U.S.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar posts have been shared thousands of times, according to CrowdTangle, a social media insights tool.", "The Facebook post misattributed the statement —  Biden never said his administration inherited \"a mess\" at the border from former President Donald Trump. That comment came from Senate Majority Leader Chuck Schumer, D-N.Y.", "(Screenshot from Facebook)", "\"Let me just say this: Joe Biden inherited a huge mess on immigration, and it’s not going to be cleaned up in a month,\" Schumer said on a March 11 episode of \"The View.\"", "Other Democrats have made similar remarks, but not Biden himself. Still, we wanted to take a closer look at the Facebook post’s claim about border crossings under Trump and Biden.", "The post is wrong — there were far more than 9,000 apprehensions at the southwest border in 2020.", "The Facebook post doesn’t specify an area of the border or a kind of Border Patrol encounter, so we looked at statistics about apprehensions along the entire southwest border with Mexico.", "In March 2020, Trump invoked Title 42, a federal public health law, to allow border officials to quickly expel migrants on the grounds that their entry could contribute to the spread of COVID-19. That means migrants arriving without permission now face either apprehension and removal proceedings, or immediate expulsion.", "According to the latest Border Patrol data, there have been 381,636 encounters at the southwest border during the 2021 fiscal year, which started in October. Of those, 64,046 encounters were apprehensions, meaning migrants were taken into custody between ports of entry, and the rest were Title 42 expulsions. In January and February, when Biden was president, there were 172,286 encounters and 39,572 apprehensions.", "By comparison, there were 400,651 southwest border encounters during the 2020 fiscal year, which spanned from October 2019 to September 2020. Of those, more than 200,000 were apprehensions. It’s important to note that Border Patrol data on encounters refers to events — not people.", "Homeland Security Secretary Alejandro Mayorkas said in a March 16 statement that officials are seeing a surge in attempted border crossings this year.", "\"This is not new. We have experienced migration surges before — in 2019, 2014, and before then as well,\" Mayorkas said in the statement. \"Since April 2020, the number of encounters at the southwest border has been steadily increasing.\"", "The 108,000 figure in the claim appears to stem from something Texas Gov. Greg Abbott said during a March 9 press conference about immigrants entering the country illegally.", "\"In all of last year, in the Rio Grande Valley Sector there were about 90,000 apprehensions,\" Abbott said, citing U.S. Customs and Border Protection officials. \"Just this year there have been 108,000 apprehensions there.\"", "The Rio Grande Valley Sector is a Border Patrol service area that covers more than 34,000 square miles of southeast Texas. There are 19 other sectors on the northern and southern borders that report their own apprehension statistics.", "We reached out to the Facebook user who shared the post for a comment, but we didn’t hear back.", "The post is inaccurate. We rate it False.", "RELATED: Did the increase of children arriving at the border start under Trump or Biden?", "ABC 10, \"Gov. Abbott blames Biden for 'surge' in migrants at Texas-Mexico border,\" March 9, 2021", "Associated Press, \"Claim that 9,000 border crossers were apprehended in 2020 is false,\" March 16, 2021", "Bloomberg, \"Migrant Surge at U.S.-Mexico Border Is New Bipartisan Blame Game,\" March 14, 2021", "CrowdTangle, accessed March 16, 2021", "Facebook post, March 13, 2021", "Factba.se, accessed March 16, 2021", "The Hill, \"Murphy: Immigration surge began under Trump,\" March 14, 2021", "KTVT, \"‘The Biden Administration Is Helping The Cartels Make Money,’ Texas Gov. Greg Abbott Speaks About Border Security,\" March 9, 2021", "PolitiFact, \"Border apprehensions then and now: Fact-checking McEnany’s comparison to 2014,\" March 11, 2021", "PolitiFact, \"Fact-checking Donald Trump’s claim of ‘best numbers’ at the border,\" May 20, 2020", "USA Today, \"As Biden faces ongoing surge of migrant children, Republicans criticize White House for border crisis,\" March 15, 2021", "U.S. Customs and Border Protection, \"CBP Announces January 2021 Operational Update\"", "U.S. Customs and Border Protection, \"Nationwide Enforcement Encounters: Title 8 Enforcement Actions and Title 42 Expulsions\"", "U.S. Customs and Border Protection, \"Rio Grande Valley Sector Texas\"", "U.S. Customs and Border Protection, \"Southwest Border Migration FY 2020\"", "U.S. Customs and Border Protection, \"Southwest Land Border Encounters\"", "U.S. Customs and Border Protection, \"FY 2020 Nationwide Enforcement Encounters: Title 8 Enforcement Actions and Title 42 Expulsions\"", "U.S. Department of Homeland Security, \"Statement by Homeland Security Secretary Alejandro N. Mayorkas Regarding the Situation at the Southwest Border,\" March 16, 2021", "\"The View,\" \"Chuck Schumer Discusses COVID-19 Relief Package and Biden's Border Policy | The View,\" March 11, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]