["Parts of Tamil Nadu and Puducherry witnessed heavy rainfall and storm due to Cyclone Nivar. Three people have died in the torrential downpour. Since then, social media is ripe with videos of storms claimed to represent Cyclone Nivar. One Twitter user shared a video on November 25 and captioned it, “Human lifes gonna end soon” with the hashtag #CycloneNivar. The video drew 48,000 views. (Archive link)", "Human lifes gonna end soon One after another,bad things happening to humans Advance RIP humans#ChennaiRain #ChennaiFloods #CycloneNivar #CycloneNivarUpdate #Chennaiweather pic.twitter.com/R4bWORJ8Uf", "— Kurma Vishnu Priya (@PriyaKurma) November 25, 2020", "A Facebook user shared another video showing heavy rainfall. He too claimed it depicts Cyclone Nivar.", "Nivar cyclone CHENNAI", "Posted by Gadde Rajapudi on Wednesday, November 25, 2020", "Alt News found that both videos are old and unrelated to the recent calamity.", "Video 1", "This video shows clouds gathering overhead, then they suddenly turning into a water tornado. This was earlier fact-checked by The Quint. A keyword search ‘Tornado CGI’ leads one to a video from December 2018. This video was posted by YouTuber Alexandru Dineci and titled, “Tornado CGI simulation (Cinema 4D TurbulenceFD)”. The viral video begins from the 00:10 mark.", "Alexandru Dineci posted the same video on his Instagram profile @orphicframer.", "A post shared by ORPHICFRAMER 🌪 (@orphicframer)", "He had also uploaded a breakdown of the CGI effects in his Instagram story highlights.", "Video 2", "Alt News broke down this video into multiple keyframes and reverse searched them on Yandex. We came across a YouTube video uploaded on September 12, 2017. A Twitter user had also posted the video a few days later on September 17, 2018. The title of the YouTube upload is in Turkish — “IRMA Kasırgası ABD” — which translates to “Hurricane IRMA USA”. The Twitter user posted the clip with a Spanish caption, “Poderoso tifón #Manghkut en Hong Kong”, that translates to, “Powerful typhoon #Manghkut in Hong Kong”.", "This slideshow requires JavaScript.", "While Alt News was unable to verify the location of the second video, it certainly does not represent devastation caused by Cyclone Nivar. One of the clips has been made using CGI while the other is at least three years old.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]