["The post was published on March 2, 2020, on this Facebook page of popular Nigerian entertainer and activist Charles Oputa, otherwise known as Charly Boy.", "The post’s caption reads in part: “For the first time ever, an African passport is among the top five most powerful in the world. Revealing this on its website, the Henley Passport Index released its ranking for the year 2020 and Nigeria had a dramatic rise from being at the 95th spot to going up to the 5th most powerful knocking out both Spain and Denmark and tying with Luxembourg.”", "The post claims that countries relaxed their visa requirements for Nigerians after CNN journalist Fareed Zakaria in a TV segment argued against a recently imposed US travel ban on Nigerians.", "The post alleges Nigeria’s passport rose to the top five of the Henley Passport Index, which ranks the world’s passports based on the number of destinations their holders can access without a prior visa.", "AFP traced the earliest version of the claim to this post published on February 25, 2020, by Abba Adam. The Facebook user credits someone called Osarieme Eweka as the creator of the content.", "The same story has been shared on Nairaland, Nigeria’s most visited domestic social network, according to Alexa website traffic rankings. AFP archived similar claims shared on Facebook and Twitter here, here, here and here.", "But the claim is false; although Zakaria’s news report was indeed broadcast on February 16, 2020, countries have not relaxed existing travel curbs for Nigeria.", "Henley Passport Index confirmed to AFP that Nigeria remained in 95th place out of 199 passports rated in terms of their travel freedom in the latest ranking released on January 7, 2020.", "Background", "On January 31, 2020, the Trump administration announced new travel restrictions for Nigerian immigrants, as well as those from Sudan, Tanzania, Eritrea, Kyrgyzstan, and Myanmar, as AFP reported here.", "While the US government had justified the inclusion of Nigeria in the travel ban with the “elevated risk and threat environment in the country”, Zakaria says in his CNN programme “GPS” that available data presented in his analysis shows otherwise.", "If the travel ban was based on national security concerns and education status, Zakaria argued that Nigerians were not responsible for any terror-related death in America between 1975 and 2017, and they were some of the most educated immigrants in the US.", "Nigeria was added to the Trump administration’s controversial visa and travel bans list. @FareedZakaria analyzes whether this is a security measure or a result of Trump’s views on immigration. https://t.co/hwqBe8PA4l pic.twitter.com/sAQhilGah2", "Nigeria’s ranking on Henley Passport Index’s website", "The Henley Passport Index ranking, which is based on data from the International Air Transport Association, shows that Nigeria along with Djibouti maintained its 95th position in the 2020 Global Passport Ranking.", "“I can confirm that Nigeria remains in 95th place and there has been no significant movement up as described in those posts,” Henley & Partners spokesman Paddy Blewer told AFP in an email response.", "Nigerians currently have visa-free access to 46 countries, according to the organisation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]