["About this rating", "On 20 December 2015 comedian Steve Harvey, acting as host of the Miss Universe pageant, accidentally crowned Miss Colombia Ariadna Gutierrez as the new Miss Universe. Although the mistake was quickly remedied (Miss Philippines Pia Wurtzbach was given the crown in an particularly awkward moment of beauty pageantry), rumors immediately started circulating in the aftermath of the public gaffe.", "One rumor came from the web site Super 7 News, who reported that Miss Colombia committed suicide shortly after the Miss Universe crown was removed from her head:", "Now, it is being reported that Miss Colombia, Ariadna Gutierrez, was found dead inside her changing room. Authorities believe Gutierrez committed Suicide. Authorities found multiple pill bottles laying around Gutierrez’s corpse. Gutierrez was taken away from the scene moments after.", "\"It's very sad to see such a beautiful woman kill herself because of the mistake Steve Harvey made. The whole situation must have cause so much hurt and sadness that she decided to just end her life\" said Officer Jaime Gill. It is also a possibility that Gutierrez's family will file a lawsuit against host Steve Harvey and Miss Universe Organization. We will update you as soon as more information is revealed.", "The web site Here It Before News also spread some misinformation about the beauty pageant contestant, reporting on 21 December 2015 that Miss Colombia had filed a $5 million lawsuit against Steve Harvey:", "According to Miss Colombia, she plans to sue Steve Harvey for five million dollars because he wrongfully announced another contender as the winner for 2015 miss universe. That mistake has put distress in my life, and i don’t think I’m ever going to be the same person again.", "Both Super7News and Here It Before News are fake news web sites that do not publish factual stories. Miss Colombia is still alive and has not announced (as of this writing) that she has filed a lawsuit against Harvey:", "A video posted to the Miss Universe Facebook page shortly after the pageant shows Miss Colombia saying that \"everything happens for a reason\":", "A message from Miss Universe Colombia.", "Posted by Miss Universe on Sunday, December 20, 2015", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]