["About this rating", "The bill does not actively classify children conceived through artificial insemination as “illegitimate” but it does seek to repeal a civil code that explicitly defines parental rights for both parents of such a child, regardless of biologic relation.", "The motivation behind this bill and its legal ramifications are disputed. The bill’s sponsor, Terri Lynn Weaver, argues that there is already a law on the books that maintains these rights, but critics have alleged that her logic is rooted in a misreading of legal briefs, or a desire to limit a same-sex couples’ ability to raise a child with the same legal protections as a heterosexual couple.", "On 9 February 2017, state Rep. Terri Lynn Weaver introduced HB1406 to the Tennessee House of Representatives. This exceptionally concise bill repeals Section 68-3-306 of the Tennessee Code Annotated (the state law) and is summarized on the Tennessee General Assembly web site:", "As introduced, repeals statute that deems a child born to a married woman as a result of artificial insemination, with consent of the married woman's husband, to be the legitimate child of the husband and wife. - Repeals TCA Section 68-3-306.", "TCA Section 68-3-306, the law Weaver’s bill seeks to repeal, was introduced with the express purpose of giving legal recognition to children conceived through artificial insemination:", "68-3-306. Birth from artificial insemination.", "A child born to a married woman as a result of artificial insemination, with consent of the married woman's husband, is deemed to be the legitimate child of the husband and wife.", "From a fact-checking standpoint, this would seem like a pretty open-and-shut case, as she is literally repealing a bill that defines the legitimacy of children born from artificial insemination. Weaver, however, contends in a Facebook post that the bill is simply a housekeeping procedure aimed at removing a law rendered unconstitutional by Obergefell v. Hodges, the Supreme Court ruling legalizing same-sex marriage, and that an existing law already protects the legitimacy of children born through in vitro fertilization:", "There is MUCH CONFUSION concerning HB 1406. The reason for this bill is as followed [sic]. A couple of months ago, the state's Attorney General filed a brief in a lawsuit related to this statute TCA 68-3-306 in which he said that the law, as written and enacted, was unconstitutional. It is not unusual for the legislature to repeal a law that is unconstitutional.", "Thankfully there is another statute TCA 36-2-304 still on the books that makes it clear that when a child is born to a married woman, the child is presumed to be that of her husband. So, the repeal of the law does not de-legitimize a child conceived by insemination and, to be honest, the law that will remain on the books is less intrusive into the relationship of a husband and wife than the statute being repealed. Unlike the law being repealed, the remaining law that will now govern the situation does not have the government inquiring into the means by which the couple¹s child came into existence or whose sperm, the husband's or a donor¹s, was used.", "HB 1406 does not apply to same sex marriages at all!!!! Conflicting laws have got to be repealed, families and lives are affected. Again children who are artificially inseminated ARE NOT ILLEGITIMATE.", "I hope that helps explain the overall situation.", "The lawsuit Weaver cites concerns a custody dispute over an child born from artificial insemination in a divorce proceeding between two women. Lawyers for the woman who did not conceive the child argued in an appeal to a ruling denying her parental rights that TCA 63-3-306 provided the non-conceiving spouse with parental rights as they were married when the baby was conceived. There was a dispute, however, over how this law — with gendered spousal terms — could be applied to same sex couples, a question the state's attorney general was asked to weigh in on.", "During an appeal in this case, Weaver had signed on to a memorandum asking the court not to interpret 68-3-206 for same-sex couples, leading many critics to suggest this new bill was a thinly veiled attack on same-sex marriage and not, as she argued, to get rid of a law deemed unconstitutional. This suspicion was further confirmed, in those critics eyes, by her Facebook explanation, which is based on the legally dubious argument that the law is not constitutional.", "Her explanation that TCA 63-3-306 is unconstitutional, in actuality, relies on a fairly significant misreading of both the attorney general’s brief regarding that law, as well as the other statute she contends will continue to legally declare the legitimacy of in vitro children.", "First of all, contrary to the claim made by Weaver, the brief filed by the Tennessee attorney general (which she referenced in her Facebook post) actually ruled that TCA 36-2-304 remains constitutional, provided it be construed as applying to both heterosexual and same-sex couples. At issue was this law’s gendered use of the words “husband” and “wife” as opposed to the word “spouse” as used in the 2015 Obergefell v. Hodges Supreme Court ruling, and described in the brief:", "Construed literally, Tenn. Code Ann. 68-3-306 would run afoul of the holding in Obergefell. lt would “exclude same-sex couples from civil marriage on the same terms and conditions as opposite-sex couples,\" because it would deem a child born to a married woman as a result of artificial insemination to be the legitimate child of a male spouse of that woman, but not of a female spouse of that woman.", "Attorney General Herbert H. Slatery went on to argue in this brief, however, that the code should not be construed literally, arguing that the courts have the power and duty to make sure laws exist to fit within constitutional requirements:", "Tennessee Code Ann. 68-3-306, however, need not and should not be construed literally. Courts have a duty to construe a statute in a way that will sustain it and avoid constitutional conflict, if such a reasonable construction exists. Davis-Kidd Booksellers, Inc. v. McWherter, 866 S.W.3d 520, 530 (Tenn. 1993). Under Tenn. Code Ann. $ 1-3-104(b), statutory \"[w]ords importing the masculine gender include the feminine and neuter, except when the contrary intention is manifest.\" So both the word \"husband\" and the word “wife\" in 68-3-306 would be properly construed to mean \"spouse.”", "After Obergefell, of course, that is no longer the case. In order to preserve the constitutionality of Tenn. Code Ann. 68-3-306, therefore, it must now be construed to read: \"A child born to a married woman as a result of artificial insemination, with consent of the married woman's spouse, is deemed to be the legitimate child of the two spouses.\" [...]", "For the reasons stated, the Court should rule that Tenn. Code Ann. 68-3-306 must be construed so as to apply to a child born as a result of artificial insemination during a same-sex marriage and that, as applied, the statute is constitutional.", "Therefore her argument for the utility of a bill in the first place, as presented on Facebook, is rooted in the false premise that the code she is seeking to repeal (by the standards of the Attorney General’s office) needs to be repealed on the basis of its unconstitutionality. It also means her assertion that “HB 1406 does not apply to same sex marriages at all!!!!” is demonstrably false.", "Secondly, Weaver goes on to argue that another code, TCA 36-2-304, already serves to define the parentage of a child born through artificial insemination. That law, like 68-3-306, also uses the terms “husband” and “wife”, making a literally construed interpretation of this code just as theoretically (but not actually, in the view of the Attorney General’s office) problematic as the former. This law, more generally, codifies the legal “presumption of parentage”:", "(a) A man is rebuttably presumed to be the father of a child if:", "(1) The man and the child's mother are married or have been married to each other and the child is born during the marriage or within three hundred (300) days after the marriage is terminated by death, annulment, declaration of invalidity, or divorce;", "(2) Before the child's birth, the man and the mother have attempted to marry each other in compliance with the law, although the attempted marriage is or could be declared illegal, void and voidable; [...]", "(4) While the child is under the age of majority, the man receives the child into the man's home and openly holds the child out as the man's natural child; [...]", "(b)", "(1) Except as provided in subdivision (b)(2), a presumption under subsection (a) may be rebutted in an appropriate action.", "(2)", "(A) If the mother was legally married and living with her husband at the time of conception and has remained together with that husband through the date a petition to establish parentage is filed and both the mother and the mother's husband file a sworn answer stating that the husband is the father of the child, any action seeking to establish parentage must be brought within twelve (12) months of the birth of the child. In the event that an action is dismissed based upon the filing of such a sworn answer, the husband and wife who filed such sworn answer shall be estopped to deny paternity in any future action.", "A joint statement from Weaver and the Tennessee senator sponsoring the Senate version of the bill makes the argument that this existing law will serve the same role as the law being repealed:", "“Under this legislation, Tennessee law would continue to provide that a child born to a married woman will be considered the child of her husband. By repealing the law, and relying on other Tennessee statutes that remain, the state will no longer intrude into how a woman conceives her child.\"", "However, critics argue that the existing law does nothing to define the legitimacy or parentage of a child born to same sex couples through artificial insemination, potentially providing a legal environment that limits the rights of the non-biologic partner in a same-sex marriage or relationship jointly raising an IVF-conceived child while, arguably, making that child illegitimate in the eyes of Tennessee State Law.", "The bill is currently being reviewed by the Tennessee House health subcommittee.", "110th Tennessee General Assembly.   \"House Bill 1406: An Act Solely to Repeal Tennessee Code Annotated, Section 68-3-306.\"", "Tennessee Code Annotated. \"Title 68 - Health, Safety and Environmental Protection, Chapter 3 - Vital Records, Part 3 - Births, 68-3-306 - Birth from artificial insemination.”", "Satterfield, Jamie.   \"Parenting rights in same-sex divorces headed to a Tennessee appellate court.\"\r\nKnoxville News Sentinel.   24 June 2016.", "Humphrey, Tom.   \"53 GOP Lawmakers Seek to Intervene in Knoxville Women’s Divorce.\"\r\nKnoxville News Sentinel.   12 September 2016.", "Slattery, Herbert H.   \"Memorandum of Law of the State of Tennessee in Defense of the Constitutionality of Tenn. Code Ann. 68-3-306\"\r\nFourth Circuit Court for Knox County, Tennessee.   24 October 2016.", "Tennessee Code Annotated. \"Title 36 - Domestic Relations, Chapter 2 - Parentage, Part 3 - Parentage and Legitimation, §36-2-304 - Presumption of Parentage.”", "Lowary, Jake.   \"Tennessee Lawmaker Fights Backlash Against Artificial Insemination Bill.\"\r\nThe Tennessean.   13 February 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]