["A viral Facebook post is urging users to pay attention to the bag size of lettuce at the grocery store, claiming that a flatter lettuce bag indicates freshness, while a puffier bag means the lettuce has aged.", "\"If you buy bagged lettuce or salads, choose the bag that is the flattest. When the greens are packaged, all of the air is sucked out of the bag,\" reads a March 7 meme. \"Then as they age, they give off gass (sic), making the bag puffier. Choose the flattest bag and your salad will be fresher, and last longer in the fridge without going bad.\"", "Accompanying the text is an image of a grocery store aisle with bagged lettuce. The post has over 100 reactions and comments including, \"Good to know\" and \"I had no idea.\"", "The claim recently went viral in a March 4 post with over 2,000 shares that was posted in a Facebook recipe group page.", "USA TODAY reached out to the Facebook users for comment.", "Fact check:Pouring Coca-Cola on pork does not make worms appear", "It's true that lettuce gives off gas after it is packaged, as the post claims. However, that does not suggest that larger bags of lettuce are not fresh, according toEat This, Not That!", "Gas is not able to build up as much in bagged lettuce because of a design called \"modified atmosphere packaging,\" which improves the shelf life of items through the manipulation of the atmosphere inside a packaged food, according to Industrial Packaging.", "In fruits and vegetables, oxygen is produced at high respiration rates, which means a shorter shelf life. To avoid this, oxygen is reduced and replaced with other gases to delay unwanted reactions.", "Further, the modified atmosphere packaging is created in a way that it \"breathes\" while also being able to maintain an atmosphere inside the package that will minimize any browning and spoilage, according to NPR.", "A 2009 study in the Critical Reviews in Food Science and Nutrition concluded that modified atmospheres, elevated concentrations of carbon dioxide and reduced levels of oxygen and ethylene, \"can be useful supplements to provide optimum temperature and relative humidity in maintaining the quality of fresh fruits and vegetables after harvest.\"", "Fact check:Mars Perseverance rover landing happened, Ingenuity helicopter can fly on Mars", "The best indicator of fresh lettuce is the bag's \"best by\" date, according to Eat This, Not That! and Delish.", "The U.S. Food and Drug Administration states that, \"the anticipated shelf life for many bagged, fresh-cut leafy greens is approximately 12-16 days\" and fresh-cut greens can last at least one week after the \"sell by\" or \"use by\" date.", "Salads are produced with around 16 code days, a date marking tool to ensure food safety, according to South Dakota Department of Health, and shoppers can work backward to find out when it was packaged. The date marking system allows people to identify when the food was prepared.", "In order to keep lettuce fresh after it is already opened from the bag, Eat This, Not That! recommends replicating the modified atmosphere packaging at home. This can be done by washing and drying the greens thoroughly, then placing them in a plastic bag and blowing air into it.", "Real Simple Magazine notes that adding a fresh paper towel into the bag will help absorb any moisture that would cause the leaves to rot. The towel can be replaced every day for maximum results.", "Lettuce can also be placed in another container, as thin plastic bags offer little protection from other fruits and vegetables also occupying the drawer.", "Fact check: Yum! Brands, based in Kentucky, owns Taco Bell, Pizza Hut and KFC in the US", "The claim that the amount of air in bagged lettuce indicates its freshness is FALSE, based on our research. While lettuce gives off gas after it is packaged, the lettuce is put into a bag using a technique called modified atmosphere packaging that allows lettuce to give off gas without affecting the atmosphere so that the product has a longer shelf life. The best indicator of how fresh bagged lettuce is the product's best by date.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]