["On March 24, Prime Minister Narendra Modi declared a 21-day nationwide lockdown, barring essential services, to contain coronavirus. As a result, lakhs of migrant labours across India began walking hundreds of miles to their villages due to lack of transportation. Some of the early reports were published by The Caravan, The Wire, The New York Times and Quartz.", "Recently, a 4-minute audio clip attributed to senior Supreme Court advocate Harish Salve is floating online. Here, a man speaks ferociously and blames Delhi Chief Minister Arvind Kejriwal for the exodus of migrant labours from Delhi to Uttar Pradesh and Bihar. The clip has been uploaded by several users on YouTube and Facebook.", "Since Twitter has a limit of 2:20 minutes, users have uploaded the clip in two parts (part 1 and part 2) asking for clarification if it is true or not.", "The transcript of the viral audio reads, “Don’t you have shame in giving an impression, in which you are appealing to the people, not to leave Delhi. But the fact is your administration had cut food and electricity supply. Don’t you care about these people who voted for you? Do you have any humanity left in you? And the most criminal acts of yours, which is unpardonable – why didn’t your government allow DTC buses to ply under lockdown? Why? If you had a humanitarian concern, why didn’t you ferry the people to their respective destination? Why did you dump them at Anand Vihar? You criminal! Why are you playing such dirty politics, Mr Kejriwal? Why is it that only natives of Uttar Pradesh and Bihar had assembled at Anand Vihar? Isn’t this a conspiracy Kejriwal? Is it because your government’s exchequer is empty? Or is it because you want to spread the Chinese virus to make India depend on China for masks and medicines? Or is it because you have this conspiracy to malign Nitish Kumar and Yogi Adityanath? After all, Bihar and Uttar Pradesh are going to face elections from some time. Kejriwal, everything was under control. The Modi government had an effective plan to save the nation from disaster, but you tried spoiling everything, you anarchist! People will hold your collars Kejriwal and seek answers from you. The whole country is against you. First, you masterminded Shaheen Bagh and planned anti-Hindu riots in Delhi. And now you’re pushing India to stage three Chinese virus. Kejriwal when you cannot handle a city-state like Delhi, you’re unfit to be a leader. I am sure the poor Delhi people will be repenting of electing you as the chief minister of Delhi. You see that UP government organised buses to take fleeing people home, but my first question to you Kejriwal is who spread the rumours to cause this panic? Who, who, who? Whenever I think you cannot stoop any lower, but you prove me wrong always Mr Kejriwal. What Xi Jinping did to China, you try doing to India. You are an Indian version of Mao Zedong. Do a handful of you think that the red flag can be hoisted in the nation? Do you? Impossible! (translated from तुम मूठीभर चांडाल यह समहाजते हो की देश में लाल झंडा फेराओ गे, यह समहाजते हो, नामुमकिन!)”.", "Alt News has received several requests to fact-check this on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News reached out Harish Salve via email to verify if the audio clip is genuine or not. He replied, “This is an absolute fake – like the previous one. The first one was my purported comments on the CAA and now this nonsense. I am complaining to the CP (commissioner of police) Delhi about this.”", "Therefore the claim associated with the viral video that the man speaking in the clip is Salve is false.", "Furthermore, the man in the audio clip claims that the recent Delhi riots were anti-Hindu. However, on March 18, The Polis Project, a non-profit research and journalism organisation, updated a documenting the individuals who died during the targeted violence in North East Delhi between February 23 to 29. Out 52 people, 41 people were from the Muslim community and 11 were from the Hindu community. Therefore, to label the riots as anti-Hindu is inaccurate and grossly misleading.", "There have been several such misleading audio clips circulating WhatsApp. On March 19, Alt News fact-checked a fake audio clip attributed to Dr Devi Shetty which advised against getting tested for coronavirus.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]