["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden signs executive orders alongside Vice President Kamala Harris and Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, in the White House on Jan. 21, 2021, in Washington. (AP/Brandon)", "President Joe Biden won a free and fair presidential election. He was inaugurated Jan. 20 and has begun his work in the White House.", "Dozens of judges in courtrooms across the country rejected lawsuits aimed at overturning the election in favor of Donald Trump.", "There remains no credible evidence of widespread election fraud.", "President Joe Biden was inaugurated Jan. 20, putting to rest his predecessor’s months-long effort to overturn what national, state and local officials affirmed was a free and fair election.", "Biden’s inauguration came two weeks after Congress counted and certified the electoral votes despite a mob of President Donald Trump’s supporters storming the U.S. Capitol to disrupt the process.", "But as Biden began his work in the White House, conservative radio host Rush Limbaugh pushed ahead with the false narrative that Biden’s election was illegitimate.", "\"With 74 million, maybe 80 million people who did not vote for Joe Biden, there is no way they can honestly say to themselves that they represent the power base of the country,\" Limbaugh told his millions of listeners Jan. 20. \"They're going to have to take it. They're going to have to hold on to it and never let go of it. They have not legitimately won it.\"", "Limbaugh, whom Trump awarded the Presidential Medal of Freedom in 2020, did not respond to a request for comment.", "He argued on his radio show that the heavy security presence and hundreds of thousands of flags lining the National Mall in place of a celebratory crowd were \"replacements for people\" because Biden’s camp was not \"confident a bunch of people would show up.\"", "Limbaugh also posited that Biden had too little support to welcome a large Inauguration Day crowd because \"nobody showed up at Joe Biden political rallies.\"", "In reality, the small, socially distanced inauguration crowd was a reflection of the pandemic that has killed more than 400,000 Americans. And the National Guard was summoned in large numbers to prevent a repeat of the Capitol riot that led to Trump’s impeachment a week earlier.", "Biden’s campaign events, too, were often deliberately kept small due to concern about the coronavirus, which spreads easily in big crowds.", "Finally, Limbaugh claimed the election was \"arranged rather than legitimately sought and won,\" and he said Biden was \"credibly accused of winning\" thanks to \"massive election fraud.\"", "PolitiFact has examined many such claims and rated them Pants on Fire.", "The presidential election was not unusually close. Biden, the former vice president, won 306 electoral votes, compared with 232 for Trump. He received 81 million votes overall to Trump’s 74 million.", "\"Joe Biden legitimately won the presidency,\" said Rick Hasen, a professor of law and political science at the University of California, Irvine. \"There is no credible evidence to the contrary, that any state in the Union wrongly reported its election results or had election irregularities that called the results into question. There was no massive voter fraud.\"", "Trump refused for months to concede defeat, even as dozens of judges in courtrooms across the country rejected lawsuits from his campaign and allies to flip the results. The challenges failed in part because they did not present evidence of the widespread fraud that was alleged.", "Some states held recounts, but the results did not change. After states certified their results, the nation’s electors cast their ballots and sealed Biden’s victory in December.", "State and local election officials, including in key swing states like Georgia, maintained that the results they certified were accurate. International observers said they saw no evidence of fraud, and so did Trump’s former attorney general, William Barr. Trump’s most senior cybersecurity official said the election was the \"most secure in American history.\"", "PolitiFact fact-checked a wide array of claims alleging election fraud. We found no evidence to suggest that Biden did not win \"legitimately,\" as Limbaugh claimed.", "We rate Limbaugh’s statement Pants on Fire!", "The Rush Limbaugh Show, \"The Establishment Thinks They Have Their Power Back — But They Know It’s Tenuous,\" Jan. 20, 2021", "PolitiFact, \"Joe Biden’s inauguration in extraordinary times, fact-checked,\" Jan. 20, 2021", "PolitiFact, \"Here’s why there are flags on the National Mall,\" Jan. 20, 2021", "PolitiFact, \"Mitch McConnell says, accurately, that Joe Biden’s win wasn’t unusually close,\" Jan. 8, 2021", "PolitiFact, \"Joe Biden is right that more than 60 of Trump’s election lawsuits lacked merit,\" Jan. 8, 2021", "PolitiFact, \"A day of crisis at the US Capitol, fact-checked,\" Jan. 6, 2021", "PolitiFact, \"Here’s why Georgia’s Republican officials are confident in their presidential election results,\" Jan. 5, 2021", "PolitiFact, \"Fact-checking Joe Biden’s speech after Electoral College vote,\" Dec. 15, 2020", "PolitiFact, \"Joe Biden won the presidential election legally,\" Dec. 14, 2020", "PolitiFact, \"46 minutes of falsehoods: Trump rehashes baseless election claims in White House video,\" Dec. 13, 2020", "PolitiFact, \"Donald Trump has lost dozens of election lawsuits. Here’s why,\" Dec. 10, 2020", "PolitiFact, \"Fact-checking Donald Trump’s tweet firing Christopher Krebs,\" Nov. 18, 2020", "PolitiFact, \"Biden-Harris Arizona event had no fanfare because the campaign didn’t invite the public,\" Oct. 12, 2020", "Email interview with Rick Hasen, professor of law and political science at the University of California, Irvine, Jan. 21, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]