["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In December 2020, a video went viral that supposedly showed Russian President Vladimir Putin's laughing at U.S. President Donald Trump as he was informed of the various goings-on following the U.S. Presidential Election.", "The people in the video are speaking Russian, but English subtitles show Russia's U.S. Ambassador supposedly informing Putin that Trump had \"claimed there was fraud but there wasn't,\" that his lawyers argued that \"dead people voted,\" that they held a \"press conference by a sex shop,\" that Trump's lawyers promised to \"release a Kraken,\" that Trump lost Georgia three times, and that Trump's own Supreme Court justices laughed at him. This spurred Putin to say, according to the subtitles, that Trump was \"such a loser.\"", "The captions provided in this video do not accurately reflect the actual conversation. This footage is several years old and has nothing to do with U.S. politics or Trump losing the election.", "This video was taken in 2017 and shows Russian Agriculture Minister Alexander Tkachev suggesting that Russia start exporting pork to Indonesia. Putin found this idea funny because Indonesia is a majority-Muslim country.", "The Straights Times reported:", "Mr Putin at first chuckled when Russian Agriculture Minister Alexander Tkachev mentioned the plan. He then explained to Mr Tkachev that Indonesia is a Muslim country and its people do not eat pork.", "The minister insisted and replied: \"They will.\"", "Mr Putin said \"No, they will not\", before bursting into laughter.", "Though Putin initially laughed at the idea, Russian officials took the proposal seriously because Indonesia has a large non-Muslim population that does consume pork.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]