["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Dalton Mayor David Pennington is one of the well-known candidates challenging incumbent Nathan Deal for governor.", "Pennington, along with fellow GOP challenger and State School Superintendent John Barge, have been traveling the state getting out their campaign messages. For Pennington, that message is limited government and limited spending. During one recent campaign stop in the city of Carrollton, before the Carroll County Tea Party, Pennington sought to distinguish himself from Deal by noting some of what he perceived as the governor’s missteps.", "One example was the extension of the hospital bed tax, legislation pushed by Deal and approved by the General Assembly earlier this year. By shifting the fee collection to an unelected health board, lawmakers subverted the law that governs how tax bills are passed, Pennington said.", "\"This is clearly unconstitutional,\" Pennington said during the meeting, which was reported by the Times-Georgian. \"Any tax law has to start in the House and this one was started in the Senate.\"", "Was this levy extension a violation of the law and we missed it? We wanted to determine whether Pennington was correct in his assessment, so we did some research.", "We asked Pennington about his source for the claim. The mayor said he relied on an article by longtime Capitol reporter Tom Crawford and confirmation of his claims by several legislators who also criticized the bill and process for getting it passed.", "\"The constitution is clear that any tax has to come from the Legislature, but they passed that (responsibility) on to another department,\" Pennington told us.", "Since 2010, hospitals have paid a Medicaid provider fee, a 1.45 percent tax on their total patient revenue, which was used to attract federal matching funds for Medicaid. The fee, also known as a \"bed tax,\" was set to expire June 30.", "The \"bed tax\" had traditionally been imposed by the General Assembly. The measure passed this year, which began as a Senate bill, would transfer that duty to the board of the Department of Community Health, and extend the fee another four years. Critics said it was an end run to keep lawmakers from having to vote on what they deemed a tax measure.", "Tracking the bill’s history through the Georgia General Assembly records shows that the legislation did begin in the Senate, where it was introduced on Jan. 14, the first day of the session. Two days later, a Senate committee approved the bill, and the following day, the full chamber passed the bill. It was signed into law a month later.", "Some lawmakers questioned the constitutionality of the Senate’s actions. By starting the bill in the Senate instead of in the House, \"you’re inviting a lawsuit where it can be overturned,\" Senate Minority Leader Steve Henson, D-Tucker, said at the time.", "Georgia law requires that \"all bills for raising revenue, or appropriating money, shall originate in the House of Representatives.\" But because the fee would be collected by a board and not by state tax collectors, supporters said the measure did not have to follow the procedure required for tax bills.", "And why didn’t the criticism get more publicity? Because the lawmakers who were the critics were Democrats, the minority in the Legislature, so they really didn’t have a say in the matter, reporter Tom Crawford told us.", "Also, the General Assembly’s lawyers said the path through the Senate was acceptable.", "\"From a strict legal perspective the bill does not require that the (community health) department impose any fee but rather gives the department complete discretion as to whether or not to assess a fee,\" said the Legislative Counsel opinion, issued Jan. 13. \"... because the bill only authorizes the imposition of a fee, but does not actually impose a fee, the bill would not be considered a revenue bill\" and would not have to originate in the House.", "Thus far, there have been no challenges to the bills, Henson said. And a favorable ruling in the matter would be difficult based on state law.", "In other court challenges, the Georgia Supreme Court has held that if an act has been passed by both houses of the Legislature, signed by the governor and recorded, the court has determined that the act was passed in a constitutional manner.", "So is Pennington correct in his assessment of the hospital \"bed tax\" extension passed during the most recent legislative session?", "Pennington said the hospital \"bed tax\" extension bill was a tax bill and should have started in the House, instead of the Senate as it did.", "The mayor and gubernatorial candidate is correct that tax laws must begin in the House of Representatives. But because the bill called for a state agency -- and not lawmakers -- to levy the fee, a legislative law opinion deemed the approval process acceptable. Also, challenges to the bill’s constitutionality would be difficult because the Georgia Supreme Court has not overturned legislation that has been duly passed by both houses and signed into law.", "Pennington and others may not agree with the process, or how the hospital levy is classified, but the law appears not to be on their side.", "We rate his claim Mostly False.", "Times-Georgian, \"Pennington delivers campaign speech of ‘limited government,’\" Winston Jones, Sept. 19, 2013", "Phone interview, David Pennington, Sept. 23, 2013", "Phone interview, Tom Crawford, editor, The Georgia Report, Sept. 30, 2013", "Phone interview, Sen. Steve Henson, D-Tucker, Oct. 1, 2013", "Phone interview, Sen. David Lucas, D-Macon, Oct. 1, 2013", "Columbia County News-Times, \"Politicians should be honest about ‘bed tax,’\" Tom Crawford, Feb. 6, 2013", "The Atlanta Journal-Constitution, \"‘Bed tax’ plan: practical solution or cop-out?\" Greg Bluestein and Aaron Gould-Sheinin, Jan. 14, 2013", "Georgia Report, \"Senate passes Medicaid fee extension on 46-9 vote,\" Tom Crawford, Jan. 17, 2013", "Office of the Governor, press release, \"Deal signs provider fee bill that ensures hospitals of critical Medicaid funding,\" Feb. 13, 2013", "The Atlanta Journal-Constitution, \"Deal signs hospital ‘bed tax’ bill, but health care woes persist,\" Greg Bluestein and Misty Williams, Feb. 13, 2013", "Georgia General Assembly, 2013-2014 regular session, SB 24: \"Hospital Medicaid Financing Program Act\"", "Collins v. Woodham, 362 SE 2d 61 - Ga: Supreme Court 1987", "Georgia Constitution, Article III, Sec. 5 Enactment of Laws, Paragraph II Bills for Revenue", "Georgia General Assembly, Legislative Counsel opinion on SB 24, issued Jan. 16, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]