["About this rating", "Michael Bublé said during an October 2018 interview that it would be his \"last interview\" and he was \"retiring from the [music] business.\"", "Bublé's comments about retiring were apparently meant to be humorous or ironic rather than literal, and he later disclaimed them.", "In mid-October 2018, singer-songwriter Michael Bublé defused speculation generated by a newspaper interview that he would be bringing his career to a close.", "Bublé took a two-year hiatus from recording in the wake of his firstborn son Noah's October 2016 cancer diagnosis.  During an interview published in the Daily Mail's weekend magazine on 13 October 2018 that touched on the end of that hiatus, Bublé explained his reasons for recording his forthcoming new album in the wake of his son's battle with cancer -- and seemingly announced his retirement from the music world in a story hyperbolically headlined \"\"Michael Bublé QUITS Music Following Heartache Over Son Noah's 'Life-Changing' Cancer Battle as He Reveals He Is Done with Fame in Final Interview\":", "\"One, because I felt a debt of gratitude, deeper than I can explain, to the millions of people all over the world who prayed for us and showed us compassion. That gave me faith in humanity.", "\"Two, because I love music and feel I can continue the legacy of my idols. And three, because if the world was ending -- not just my own personal hell but watching the political turmoil in America and watching Europe break up -- there’s never a better time for music.\"", "Then suddenly he stops. \"This is my last interview,\" he says quite solemnly. \"I'm retiring from the business. I've made the perfect record and now I can leave at the very top.\"", "But a few days later a spokesperson for Bublé told NBC's Today Show that \"He is NOT retiring. Definitely not.\"", "Perhaps Bublé's comments about having given his \"last interview\" and \"retiring from the business\" were meant to be tongue-in-cheek in a way that was misunderstood or didn't come across in print, as Today suggested:", "Given Bublé's sense of humor, we detect a little sarcasm in his self-praise and retirement talk. At least that's the theory TODAY's Savannah Guthrie is subscribing to.", "\"You know, he's a pretty funny guy,\" she said when the topic came up on the show. \"Maybe he just saying (his new album) is so good, I retire!\"", "The Canadian singer and songwriter himself also dismissed the Mail's report during a subsequent interview:", "After stepping back into the spotlight following a 2-year hiatus, it seemed like a strange time for Bublé to announce his departure. Fortunately, his rep calmed fans' fears, telling E! News in a statement that plans of his retirement are \"not true at all.\"", "As further reassurance, the 43-year-old father of three put the speculation to rest in a new interview with SiriusXM's Fantasy Sports Radio. \"Just consider the source -- that's all I say to people,\" he told co-hosts Mike Dempsey and Bob Harris. \"My buddies wrote me. I said, 'Look at who said it.' C'mon, are you kidding me? I need the money. I'm not going anywhere.\"", "Bublé's new album, Love, is scheduled to be released on 16 November 2018.", "Storey, Katie.   \"Michael Bublé QUITS Music Following Heartache Over Son Noah's 'Life-Changing' Cancer Battle as He Reveals He Is Done with Fame in Final Interview.\"\r\n    Daily Mail.   13 October 2018.", "Hines, Ree.   \"Michael Bublé Is 'Definitely Not' Retiring Following Son's Cancer Battle.\"\r\n    The Today Show.   15 October 2018.", "Hautman, Nicholas.   \"Michael Buble Laughs Off Retirement Rumors: 'I Need the Money.'\"\r\n    US Magazine.    16 October 2018.", "Schnurr, Samantha.   \"Michael Bublé Laughs Off Retirement Rumors: 'Consider the Source.'\"\r\n    E! News.    16 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]