["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Louisiana Gov. Bobby Jindal took his presidential campaign to Iowa on Aug. 18, 2015. (AP photo)", "Fresh from marking the 10th anniversary of Hurricane Katrina, Louisiana Gov. Bobby Jindal says he thinks the political storm caused by Donald Trump will die down after the weather cools off.", "Jindal, who’s No. 14 in the latest polls, said on ABC’s This Week that while Trump \"has done a great job tapping into the anger, the frustration that voters feel,\" there’s only one candidate with true conservative bona fides: himself.", "\"I think after we get past this summer of silliness and insults, the voters are going to begin to look at who is prepared to do the job,\" he said on Aug. 30. \"Right now the American people are saying we've got to shrink the size of the government, grow the American economy. I'm the only candidate — there are not two — I'm the only candidate that has actually reduced the size of government, and I think that experience matters.\"", "We were curious about Jindal’s claim that he’s the only candidate out of 17, including 8 former or current governors, who’s walked the fiscal conservative walk.", "The answer is, it depends on the analysis.", "Jindal’s evidence", "On his website, Jindal makes a more specific version of the claim: Jindal is \"the only candidate to actually cut spending.\" To back up the claim, he cites a report by libertarian think tank the Cato Institute. (A spokesperson for Jindal confirmed that this is what he was referring to on ABC.)", "According to Cato, Jindal is indeed the only governor out of the eight running to have cut spending. During his seven-year tenure as Louisiana's chief, Jindal reduced spending by an average of 1.76 percent every year. Every other governor increased spending. Here’s a graph that details this:", "Jindal’s chart doesn’t factor in the size of the states, which Cato says is important. When adjusted for population, Jindal’s numbers actually come out looking better: 2.41 percent per capita in cuts every year.", "\"Bobby Jindal shows the most fiscal restraint,\" the report concludes. (Much of the reduction, reported the Times-Picayune in 2011, is \"explained by waning hurricane recovery appropriations and the end of federal stimulus aid.\")", "However, the Cato report is just one way, and something of a simplistic way, to look at the state budget picture. It fails to consider the different per capita income levels across different states (higher incomes bring more government services and thus spending), different approaches to handling federal money (Ohio Gov. John Kasich, for example, took the Medicaid expansion while Jindal did not), and different time periods, lists Alan Auerbach, a professor of public finance at the University of California at Berkeley.", "Unlike Jindal and other sitting governors, Jeb Bush, Mike Huckabee and George Pataki weren’t leading their states through economic downturns. Auerbach explains: \"During recessions, balanced-budget requirements have typically forced states to cut spending, in addition to legislating tax increases.\"", "Kasich himself takes issue with Cato’s analysis, arguing that Cato focused on a specific pool of money known as the general revenue fund. Kasich prefers instead to look at the all-funds budget, a much larger pot of federal and state money. (Cato’s response: \"Our data is correct, and so is his. Kasich seems to pick the dataset that shed the best light on him.\")", "Chris Edwards, Cato’s director of tax policy, argued that the general fund data is more recent and perhaps more relevant than the all-funds.", "\"Governors have more direct control over the general fund budget,\" he said. \"A lot of the non-general fund budget comes from the federal government, which governors don’t have much control over.\"", "Another way to run the numbers", "Others have looked at this question and come up with different results.", "If we look at all-funds and adjust for the time differences, four governors actually out-cut Jindal, according to a fact-check by Fox News, which compared each governor’s budgets to their contemporaries (in other words, how Bush stacked up against other governors in the 2000s, and how Jindal is doing compared to sitting governors).", "The two top spenders by Cato’s count, Bush and Kasich, actually ranked best in Fox News’ analysis. Bush and Kasich slashed spending by 3.66 percent and 1.76 percent respectively. Jindal, meanwhile, came in at No. 5 on the Fox News analysis, with an average reduction of 0.25 percent per year. Here’s Fox’s breakdown:", "This is still an imperfect way of comparing the budget records of the various governors, but to an extent, it’s fairer, Auerbach said.", "\"Controlling for what other states did at the same time certainly is better than not controlling for time period,\" he said. \"One might do better still by controlling for relative economic conditions in the different states but … the controls are reasonable.\"", "Our ruling", "Jindal said, \"I’m the only candidate that has actually reduced the size of government.\"", "He was talking about the cuts in spending. To his credit, a Cato report backs his claim.", "However, there’s more than one way of looking at spending cuts. One other approach that an expert said is valid suggests that Jindal was out-cut by four other governors.", "Jindal’s claim is partially accurate. We rate it Half True.", "Email interview with Mike Reed, spokesperson for Bobby Jindal, Aug. 30, 2015", "Email interview with Chris Edwards, director of tax policy studies at the Cato Institute, Aug. 30, 2015", "Email interview with Alan Auerbach, professor of public finance at the University of California at Berkeley, Aug. 30, 2015", "ABC, This Week, Aug. 30, 2015", "BobbyJindal.Com, Blog, Aug. 10, 2015", "Cato Institute, Republican Candidates’ Spending Increases, Aug. 7, 2015", "Cato Institute, Revisiting Kasich’s Record on Spending, Aug. 3, 2015", "Cato Institute, Keeping Their Promises, July 21, 2015", "Columbus Dispatch, ‘Kasich disputes report that claims he dramatically increased state spending,’ Aug. 2, 2015", "Times-Picayune, Gov. Bobby Jindal says he's 'beginning to turn this state around', Oct. 12, 2011", "Fox News, Fact Check: Which Republican candidates actually cut spending?, Aug. 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]