["About this rating", "Harvard University graduate student and wunderkind Sabrina Gonzalez Pasterski has already been the subject of significant media attention owing to her remarkable accomplishments in aviation engineering at a young age and her reputation as a physicist with extraordinary potential.", "In December 2017, she received even more when Facebook user Ashley Kipping re-posted a meme created by the Free Thought Project, listing several remarkable claims about Pasterski (who is also known as \"Physics Girl.\") Kipping wrote: \"We need to stop idolizing silly people and start praising the smart ones. Starting with this gem.\"", "The meme reads:", "Meet Sabrina Pasterski. She is only 24 years old. At the age of 14 she built and flew her own single engine airplane. Stephen Hawking follows her on Twitter. At M.I.T. she got the highest grade possible. Harvard University called her the next Einstein. Let's make her famous...she deserves it!", "Some of these claims are accurate, while others have a grain of truth in them but misrepresent the full facts. Here's a breakdown of each claim.", "She is only 24 years old.", "This is true. According to a video posted by Pasterski, her date of birth is 3 June 1993, meaning she was still 24 years old as of December 2017, when this meme appeared.", "At the age of 14 she built and flew her own single engine airplane.", "This one is mostly true. According to Pasterski's account on her web site, her grandfather gifted her a Cessna 150 airplane for her 10th birthday. Over the next few years, Pasterski got help from a mechanic and others in rebuilding the plane's engine and constructing the frame for a new aircraft. She told the Chicago Tribune in a 2015 interview that she first went up in a plane at age 9:", "The first time was a discovery flight (which typically includes both instruction and a quick time in the air with a flight instructor). It was basically along the shoreline. That was really gorgeous. It's a nice feeling. It gives you a different perspective; everything's so much smaller.", "Then, two days before her 14th birthday, Pasterski flew the plane by herself in Canada. She created a video montage to document her work on the project.", "Stephen Hawking follows her on Twitter.", "This one is false. Stephen Hawking doesn't have a Twitter account; Pasterski does not have any social media presence at all.", "However, the truth is actually much more interesting. Two scientific papers published in 2016 and co-authored by Hawking cited two pieces of research co-authored by Pasterski and one written solely by her. So rather than following her on social media, Hawking follows Pasterski's work.", "At the Massachusetts Institute of Technology, she got the highest grade possible.", "This is true. Her perfect grade point average received extensive coverage after she graduated from MIT. On her web site, Pasterski explains:", "I graduated #1 at MIT Physics — the first girl to win the MIT Physics Orloff Scholarship award; and tied for the top overall GPA [grade point average] at MIT Institute wide: 5.00.", "Harvard University called her \"the next Einstein.\"", "We could find no record of anyone at Harvard describing Pasterski in this way. However, a widely-shared January 2016 profile on the web site Ozy said Pasterski \"might be the new Einstein.\" Since then, journalists around the world have repeatedly referred to Pasterski as \"the new Einstein\" or \"the next Einstein.\"", "It is a label she clearly finds uncomfortable. On her web site, Pasterski has posted an alternate version of the Ozy article, with the headline \"This millennial is Sabrina\" instead of \"This millennial might be the new Einstein.\"", "We have reached out to Pasterski for comment, but have not yet heard back. However, she wrote on her site in a section titled \"Media Fact-Check Sheet\":", "I am just a grad student. I have so much to learn. I do not deserve the attention.", "Hawking, Stephen W.; Perry, Malcom J.; Strominger, Andrew.  \"Superrotation Charge and Supertranslation Hair on Black Holes.\"\r\n  Journal of High Energy Physics.  31 May 2017.", "Hawking, Stephen W.; Perry, Malcom J.; Strominger, Andrew.  \"Soft Hair on Black Holes.\"\r\n  Physical Review Letters.  10 June 2016.", "Halime, Farah.  \"This Millenial Might be the New Einstein.\"\r\n  Ozy.com.  12 January 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]