["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the run-up to the May 20 primary elections, Georgia voters were deluged with candidate robocalls. Former Gov. Sonny Perdue even began his automated call by apologizing for ringing voters’ phones at dinnertime on election eve. Perdue said he just had to make a last-minute pitch for his cousin David Perdue, who went on to finish first in the crowded GOP race for the U.S. Senate.", "For many people, the automated campaign calls aren’t just annoying, they also are irrelevant. For the primary, more than 239,000 voters went to the polls in advance of Election Day to cast ballots for U.S. senator, governor, and a long list of state and local officeholders. An additional 772,643 followed on Election Day.", "Secretary of State Brian Kemp said the numbers \"make clear that Georgia voters are increasingly taking advantage of early-voting opportunities.\"", "Kemp was specifically comparing early votes from the primaries in 2010 (at 19 percent) to 2014 (at 24.2 percent), Kemp spokesman Jared Thomas said.", "We decided to see whether Kemp is right.", "Thirty-three states and the District of Columbia have early voting -- Georgia included.", "\"We were one of the later states to come to the table. By that time, it had already become a pretty accepted practice,\" former Secretary of State Cathy Cox recalled. \"It just makes such common sense in a busy world.\"", "The Georgia General Assembly passed legislation in 2003, allowing a one-week early-voting period, the Monday through Friday before Election Day. By the 2004 general election, when Republican George W. Bush defeated Democrat John Kerry for president, 13 percent of Georgia voters cast ballots early.", "Since then, the number of voters who have cast their ballots early has generally risen steadily, according to data from the Secretary of State’s Office.", "They soared to the highest level  -- 53 percent -- in the 2008 election, when Barack Obama was elected president, the data show. Last month, they accounted for 24.2 percent of votes in the GOP and Democratic primaries.", "Andra Gillespie, an associate professor of political science at Emory University, said looking at the presidential elections in 2004, 2008 and 2012 and the midterm elections for governor in 2006 and 2010, \"it’s clear that early voting is now quite common.\"", "\"The fact that more than a third of Georgia voters cast early ballots in 2012 is impressive,\" Gillespie said.", "Here’s the specifics:", "Election", "Early votes", "Total votes cast", "% registered voters", "% early votes", "2004 Primary", "90,266", "1,401,915", "35%", "6%", "2004 Primary Runoff", "36,076", "559,920", "14%", "6%", "2004 General", "422,814", "3,303,453", "78%", "13%", "2004 General Runoff", "25,145", "254,376", "6%", "10%", "2006 Primary", "129,129", "924,480", "22%", "14%", "2006 Primary Runoff", "51,865", "396,360", "9%", "13%", "2006 General", "375,536", "2,139,235", "49%", "18%", "2006  General Runoff", "51,171", "219,485", "5%", "23%", "2008 Primary", "218,179", "1,012,257", "21%", "22%", "2008 Primary Runoff", "91,292", "464,189", "10%", "20%", "2008 General", "2,093,029", "3,939,235", "76%", "53%", "2008 General Runoff", "553,614", "2,109,917", "41%", "26%", "2010 Primary", "212,487", "1,116,820", "23%", "19%", "2010 Primary Runoff", "88,734", "688,261", "14%", "13%", "2010 General", "783,702", "2,622,729", "52%", "30%", "2010 General Runoff", "57,965", "290,325", "6%", "20%", "2012 Primary", "412,541", "1,644,066", "32%", "25%", "2012 Primary Runoff", "98,562", "412,222", "8%", "24%", "2012 General", "1,922,144", "3,911,750", "73%", "49%", "2014 Primary", "239,031", "987,618", "20%", "24%", "Source: Georgia Secretary of State Brian Kemp's Office", "PolitiFact has looked previously at the research on in-person early voting that’s been growing as more states have added this option. Before 2008, much of the research suggested that early voting did not raise the overall level of voter participation in presidential contests over several decades.", "But that year in Obama’s run to become the first African-American president, and in major elections since, prominent researchers have detected a small turnout increase due to early voting, especially among black voters.", "Some top researchers say the increase is not significant.", "\"Our take on this is that instead of increasing turnout, it just makes it easier for those who would have voted on Election Day to show up at other times to vote,\" Jan E. Leighley, a co-author with Jonathan Nagler of \"Who Votes Now? Demographics, Issues, Inequality and Turnout in the United States,\" told PolitiFact earlier this year.", "Cox said Georgia officials had hoped early voting would boost overall voter participation. But Maxine Daniels, who runs elections in DeKalb County, said she hasn’t seen that result.", "\"It’s not an uptick in voting. It’s basically a shift in when people vote,\" Daniels said. \"It just made it easier for the people who were going to vote anyway.\"", "There have been other benefits, Daniels and Cox said. Election Day lines are shorter, and counties have been spared the costs of adding more voting machines and ramping up staffing of the polls on Election Day, they said.", "Georgia has changed its rules on early voting more than once. After having early voting for one week in advance of the elections in 2003 and 2004, the law was amended in 2005 to allow a voter to request an absentee mail-in ballot without giving a reason up to 45 days ahead of a federal or state election or 21 days ahead of a special election. They could still vote in person in the week before the election.", "In 2010, the law was amended to in-person early voting for seven weeks without giving a reason. In 2011, early voting was reduced to 21 days, ending the Friday before the election and including at least one Saturday of early voting.", "To sum up, there’s plenty of evidence that Georgia voters are taking advantage of the chance to cast their ballots early. In the 2012 presidential election, 1.9 million early votes were cast. That’s up from about 420,000 in 2004, the first time Georgians could vote early in a presidential election.", "We rate Kemp’s statement as True.", "Press release from Secretary of State’s Office, \"Secretary Reports Early Voting Numbers\", posted May 19, 2014", "Interviews and emails with Jared Thomas, chief of staff and press secretary to Secretary of State Brian Kemp", "National Conference of State Legislatures report on early voting", "Email interview with Andra Gillespie, associate professor, political science, Emory University", "Phone interview with Cathy Cox, president of Young Harris College and Georgia Secretary of State from 1999 to 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]