["About this rating", "On Feb. 2, 2021, two FBI agents were killed while serving a search warrant in Sunrise, Florida, in an investigation into violent crimes against children. The agents were identified by the FBI as Special Agents Daniel Alfin and Laura Schwartzenberger.", "Sadly, it didn't take conspiracy trolls long to pounce on this tragedy, claiming without evidence in memes that Alfin was \"the top investigator for Hunter Biden's laptop\":", "This meme reflected another baseless claim that was pushed in the days leading up to the November 2020 election: that a laptop allegedly belonging to then-Democratic candidate Joe Biden's son Hunter Biden contained child pornography. No evidence for this claim has surfaced.", "That claim stemmed from a bizarre saga which played out in October 2020, when a laptop that allegedly belonged to the younger Biden and was left at a computer repair shop in Delaware was later given by the shop's owner, John Paul Mac Isaac, to a lawyer representing former President Donald Trump's personal attorney Rudy Giuliani, who then provided a copy of the laptop's hard drive to the New York Post.", "Although the paper reported in detail on the contents of that laptop, the New York Post didn't state that they found evidence of child pornography on the laptop. This allegation circulated on various conspiracy sites and social media posts before the election and appeared to echo the Qanon conspiracy theory positing that various high-profile figures, from Democratic legislators to entertainers, are part of a satanic child trafficking ring.", "The New York Post story included what it reported were federal subpoenas for the laptop and its contents, which were seized by the FBI in December 2019. Hunter Biden announced in December 2020 that he had learned for the first time that federal authorities were investigating his tax affairs.", "But the FBI agents who seized Biden's laptop were not the same ones who were serving the search warrant in Florida when the two agents were killed. The Baltimore Sun reported that the federal authorities who took the laptop from the computer shop owner work out of Baltimore and Wilmington, Delaware, and that their investigation involved finances:", "Isaac said he met with FBI agents in late 2019 and provided them with a timeline of events. The agents returned about two weeks later in mid-December with a grand jury subpoena allowing them to seize the laptop and the external hard drive. The subpoena was signed by a federal prosecutor in the U.S. attorney’s office in Wilmington who handles criminal investigations such as fraud, and Isaac acknowledged receiving it.", "The agents also gave him a receipt for what they took, according to a photograph of it published by Fox News. The receipt included an FBI code, 272D, the bureau’s internal classification for money laundering investigations, and “BA” for its Baltimore field office. Officials separately confirmed that the FBI seized the laptop and an external hard drive as part of an investigation, though they did not detail the inquiry or whether it involved money laundering or Hunter Biden. They also confirmed that the agent who signed the receipt works in Wilmington and is overseen by the Baltimore office.", "According to the FBI, Alfin and Schwartzenberger were assigned to FBI's Miami field office. Alfin, who was 36, had worked cases involving crimes against children out of FBI Miami since 2017.", "Alfin and Schwartzenberger were serving a warrant on David Huber, a 55-year-old computer technician, who engaged agents in a pre-dawn gun battle, killing two FBI agents and wounding three others before turning the gun on himself.", "We found no real-world connection between Hunter Biden's laptop and the murder of the two FBI agents in Florida, and it appears that claims the two were linked were invented to stir up a specter of conspiracy where none was present.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]