["About this rating", "In January 2021, Snopes received several inquiries from readers about the accuracy of a widely shared meme that claimed Kevin Seefried, a Delaware man charged with taking part in the Jan. 6 attack on the U.S. Capitol by supporters of then-U.S. President Donald Trump, was in fact a registered Democrat and supporter of President Joe Biden.", "Seefried came to the attention of the FBI after photographs showed him carrying a Confederate flag inside the halls of Congress. The meme consisted of one of those photographs, along with the following text:", "\"This 'domestic terrorist,' who brought a Confederate flag into the Capitol during this outrageous attack on America has been arrested in his home state of Delaware. His name is Kevin Seefried. He's a registered Democrat and Biden supporter. Is Pelosi going to impeach Biden now too?\"", "The popularity of the meme can be seen in the following screenshot, which shows just a selection of Facebook posts containing it:", "As evidence in support of the claim that Seefried is a registered Democrat, some Facebook users cited a listing for a \"Kevin D Seefried\" on the website VoterRecords.com:", "However, the only credible evidence available strongly indicates that Seefried is a supporter of Trump, who took part in a destructive effort to overturn the lawful and legitimate results of the 2020 presidential election, which Biden won. In court filings, an FBI special agent wrote that Seefried had said he traveled from Delaware to Washington, D.C., on Jan. 6 \"to hear President Trump speak.\"", "Furthermore, the only supposed evidence presented in support of the claim that Seefried is a registered Democrat and Biden supporter is fatally flawed. The voter registration listing came from an unofficial source, and in any case referred to a voter born in 1986, and therefore decades younger than Seefried, who is 51 years old.", "Since we don't have voter registration information for Seefried, we can't definitively say that he is not a registered Democrat, and so we are issuing a rating of \"Unproven.\" However, the available evidence strongly indicates that, whatever his voter registration might be, Seefried acted in support of Trump and took part in an effort to overturn Biden's legitimate victory — hardly in keeping with the meme's baseless description of him as a \"Biden supporter.\"", "The Jan. 6 assault on the Capitol, which led to several deaths, damaged the reputation of the movement — spearheaded by Trump — to overturn the results of the 2020 presidential election using baseless conspiracy theories that falsely alleged widespread electoral fraud.", "As a result, some Trump supporters attempted to distance that movement from the events of that day, falsely claiming that the attack had been planned or perpetrated by left-wing agents provocateurs, in particular antifa (short for \"anti-fascist\"). We have addressed and debunked several strands of that conspiracy theory, and the \"Biden supporter Seefried\" meme appears to be just another such example.", "On Jan. 14, Seefried and his 23-year-old son Hunter were charged with the following three offenses each:", "An affidavit written by an FBI special agent stated that: both Seefried and his son were captured on video breaking into the Capitol through a broken window; that Hunter Seefried had cleared glass from that semi-broken window in order to clear a path for entry; and that once inside, Seefried brandished a Confederate flag through the halls of the Capitol.", "According to the FBI affidavit, the two men were identified because of a tip-off from one of Hunter's co-workers, who claimed Hunter had bragged about his participation in the attack on the Capitol. The co-worker also recognized Hunter's face from a police flier requesting information from the public about persons of interest from the riot.", "According to the FBI, both men confirmed their involvement in the attack on the Capitol during interviews conducted on Jan. 12. The affidavit states that Kevin Seefried told federal agents he had travelled from Delaware to Washington, D.C., on Jan. 6 in order to hear Trump speak at a rally at the Ellipse, near the White House, and that he had subsequently marched from the Ellipse to the Capitol. Seefried reportedly told the FBI he had brought the Confederate flag with him from Delaware, where it normally flies outside his house.", "Worcester County, Maryland court records list Kevin Seefried's month and year of birth as March 1969, meaning he was 51 years old when he was charged. The address listed in those records is located in Laurel, Delaware, and matches the location of his family home, which the Delaware News Journal visited and described in a Jan. 15, 2021 report.", "The same residential address is found in Worcester County court records for Hunter Seefried, and those records list his month and year of birth as November 1997, meaning he was 23 years old when charged.", "Given that Kevin Seefried is 51 years old, he could not be the same individual listed as a registered Democrat on VoterRecords.com — the only piece of supposed evidence put forward to support the claim that Seefried is a secret Biden supporter.", "However, Seefried's actual voter registration information, if it exists, was not readily available, so we cannot definitively rule out the possibility that he is registered as a Democrat, notwithstanding his current political views. Snopes contacted attorneys for both Kevin and Hunter Seefried, in an effort to clear up those uncertainties, but we did not receive a response in time for publication.", "If we receive information that clarifies Seefried's voter registration status, we will update this fact check accordingly. For now, we're issuing a rating of \"Unproven.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]