["On February 18, several Facebook and Twitter users shared a video of a rap performance and claimed that the issue of farmers’ protest was raised after the Miss India pageant aired on MTV. The winners of Miss India 2020 were announced on February 15. The song talks about the plight of farmers in India. It ends with the artist saying, “Farmers of our country unite for we have nothing to lose but our chains.”", "(The video has been shared with the Hindi text: मिस इंडिया कॉन्टेस्ट के बाद एक बार फिर से गूंजा किसान आंदोलन का मुद्दा MTV पर,जजों स्टैंडिग ओबिएशन दी है…. बात निकली है तो दूर तलक जाएगी….)", "Twitter user @vandana_21gupta posted the video on February 18. Since then it has been viewed over one lakh times.", "मिस इंडिया कॉन्टेस्ट के बाद एक बार फिर से गूंजा किसान आंदोलन का मुद्दा MTV पर,", "जजों स्टैंडिग ओबिएशन दी है…. बात निकली है तो दूर तलक जाएगी…. pic.twitter.com/FriUDH9yLo", "— #Andolanjeevi Vandana Gupta (@vandana_21gupta) February 18, 2021", "This tweet was quote-tweeted by actor Sushant Singh, INC member Alka Lamba and Om Thanvi, vice-chancellor at the Haridev Joshi University of Journalism and Mass Communication in Rajasthan. Between these three accounts, the video gained over 2,000 retweets.", "This slideshow requires JavaScript.", "Parody Facebook page Rofl Gandhi also shared the video along with the viral text.", "Alt News performed a reverse image search via video verification tool InVid and found a result that suggested the video is from MTV Hustle, a rap music reality show.", "Next, we performed a keyword search on YouTube and found that the viral video was uploaded by a YouTube channel called Abstracted TV in November 2019. As per the description, the video shows a performance by Santhanam Srinivasan Iyer, popularly known as EPR​, of the song ‘Tobe Ekla Cholo Re’. The video has over five lakh views.", "Hindustan Times and The Times of India reported that the rapper performed this song on MTV Hustel’s finale in October 2019. EPR also posted this video on his Instagram account.", "In a telephonic call with Alt News, EPR confirmed that the performance was from the MTV Hustle finale in October 2019. He added, “While the song was written prior to the introduction of farms bills and subsequent protests against it, I wouldn’t deny that it echoes the sentiments of the movement. I wrote this song in 2019 for MTV Hustle’s finale. I sought my inspiration from Rabindranath Tagore’s patriotic Bengali song ‘Ekla Cholo Re’. The song ‘Tobe Ekla Cholo Re’ expresses my feelings about the plight of Indian farmers and my solidarity with the farmers’ movement.”", "Readers should note the farm bills that led to nationwide farmers’ protests were introduced in Lok Sabha on September 14, 2020. Therefore the claim the video is related to the current movement is false. The claim that the song was performed after Miss India 2020 pageant is also deemed false. Moreover, the contest’s finale is yet to air on television. It will be broadcast by Colors TV on February 28.", "A video of Santhanam Srinivasan Iyer’s performance at MTV Hustle 2019 finale was shared with the false claim that the song was performed for the recent farmers’ protest and was aired on MTV.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]