["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Another meme attempting to put words into the mouths of historical figures is making the rounds on Facebook.", "This time, it’s Benjamin Franklin in the spotlight.", "The June 23 post, which gained more than 6,800 shares in just a few days, uses president Trump as a target of the alleged Franklin quote.", "Shared by the Occupy Democrats Facebook page, the post features an image of Franklin with the following quote attributed to him: \"We are all born ignorant, but one must work hard to remain stupid.\" Below that, a photograph of President Trump appears along with the words: \"The hardest working man in America.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no record of Franklin ever saying or writing this statement, and the meme appears to have been created solely to crack a joke against the president.", "Carla Mulford, English professor at Pennsylvania State University and author of the book \"Benjamin Franklin and the Ends of Empire,\" pointed PolitiFact to the Franklin Papers, an exhaustive database of Franklin’s writings, to check out the quote. She added, \"This is some modern expression attributed to Franklin. The man was more eloquent and pithy.\"", "A search though the volumes of Franklin’s collected works on the database produced no results for any portion of the quote. As well, a list of famous quotes from the inventor on the Franklin Institute website, a science museum that houses the Benjamin Franklin National Memorial, also did not include the quote.", "Etymologist Barry Popik also researched the quote in 2013 and found no evidence Franklin said or wrote it. Popik reported that the phrase \"has been cited in print since only about 1999 – far removed from Franklin’s lifetime.\"", "This \"quote\" is Pants on Fire!", "Facebook post, June 23, 2019", "Franklin Papers, Framed Volumes, Accessed June 27, 2019", "The Franklin Institute, Benjamin Franklin’s Famous Quotes, June 27, 2019", "BarryPopik.com, Entry from November 30, 2013, Accessed June 27, 2019", "CheckyourFact, FACT CHECK: DID BENJAMIN FRANKLIN SAY, ‘WE ARE ALL BORN IGNORANT, BUT ONE MUST WORK HARD TO REMAIN STUPID’?, June 19, 2019", "Email interview, Carla Mulford English professor at Penn State and Benjamin Franklin researcher and author, June 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]