["As Gov. Chris Christie and Democratic legislators battle over cutting taxes for the fiscal year beginning Sunday, both sides have been turning to federal labor statistics to make their case.\n\nClaiming that the \"Jersey Comeback\" has begun, the Republican governor recently called for an income tax cut by pointing out how the state gained 17,600 nonfarm jobs in May. Christie received a False on the Truth-O-Meter for claiming that job growth represented 25 percent of the net new jobs created nationwide that month.", "The Democrat-controlled Legislature on Monday approved a fiscal year 2013 budget that sets aside $183 million for a tax cut, but said taxes only would be reduced if Christie's revenue projections are met between now and December. While discussing how the projections appear to be \"overly optimistic,\" state Sen. Paul Sarlo (D-Bergen) cited New Jersey’s unemployment rate.\n\n\"The state's unemployment rate is fifth-highest in the country, a full point above the nationwide rate and higher than all of our...neighboring states,\" Sarlo, chairman of the Senate Budget and Appropriations Committee, said during a speech on the State Senate floor.\n\nPolitiFact New Jersey found that Sarlo’s statistic is accurate.\n\nWith an unemployment rate of 9.2 percent in May, New Jersey had the fifth-highest rate among the 50 states, according to seasonally adjusted data from the U.S. Bureau of Labor Statistics. New Jersey’s unemployment rate also was one percentage point higher than the national unemployment rate of 8.2 percent in May, according to the bureau.\n\nThe only states with higher unemployment rates were Nevada (11.6 percent); Rhode Island (11 percent); California (10.8 percent); and North Carolina (9.4 percent), the bureau said.\n\nJust as Sarlo said, New Jersey’s unemployment rate was greater than in its neighboring states, according to the bureau.\n\nNew York had an unemployment rate of 8.6 percent, followed by 7.4 percent in Pennsylvania and 6.8 percent in Delaware, the bureau said.\n\nHere are the top 10 highest unemployment rates in May among the states:", "Now, here are the states with the top 10 lowest unemployment rates in May:", "For the individual states, the unemployment rates for May are preliminary.\n\nIt’s worth noting that New Jersey’s unemployment rate has dropped slightly in recent years. In February 2010 -- Christie’s first full month as governor -- the unemployment rate was 9.7 percent, according to the latest figures from the bureau.\n\nOur ruling\n\nIn a speech on the State Senate floor, Sarlo claimed: \"The state's unemployment rate is fifth-highest in the country, a full point above the nationwide rate and higher than all of our...neighboring states.\"\n\nAccording to data from the U.S. Bureau of Labor Statistics, the senator’s claim is on target. In May, the Garden State had an unemployment rate of 9.2 percent, marking the fifth-highest amount among the 50 states.\n\nNew Jersey’s unemployment rate also was higher than the national employment rate by one percentage point and greater than the rates in New York, Pennsylvania and Delaware.\n\nWe rate the statement True.", "To comment on this ruling, go to NJ.com.", "Video of New Jersey Senate session, June 25, 2012\n\nU.S. Bureau of Labor Statistics, Regional and State Employment and Unemployment -- May 2012, June 15, 2012\n\nU.S. Bureau of Labor Statistics, The Employment Situation -- May 2012, June 1, 2012\n\nPolitiFact New Jersey, Chris Christie claims New Jersey’s job growth in May represents 25 percent of the net new jobs nationwide, June 24, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]