["The video was published here on Facebook on August 8, 2020. It has since been viewed more than 142,000 times.", "The 26-second video shows a group of men chanting while carrying what appears to be a coffin along a street.", "The video’s Hindi-language description translates to English as: “Look at the mentality of these people at a funeral procession celebrating news of Amit Shahji testing positive for coronavirus. Someone tell them that the lion has now recovered, and they will definitely have to show the papers now.”", "Amit Shah is the incumbent Minister of Home Affairs in India. He announced that he tested positive for the novel coronavirus in a tweet published on August 2, 2020.", "“Show the papers now” is a reference to a slogan widely used by Muslim groups during the anti-citizenship law protests in India last year. The new Citizenship Amendment Act, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh, and Pakistan, prompted months of violent protests across several Indian cities in late 2019. Critics argue the law is anti-Muslim.", "An identical video was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter, alongside a similar claim.", "The claim is false; the video has circulated online since December 2019 -- at least eight months before Amit Shah announced he had tested positive for COVID-19.", "A closer examination of the video in the misleading post shows there is a police barricade at the video’s seven-second mark. The blue text reads: \"Kolkata Traffic Police\".", "Kolkata is the capital city of India’s West Bengal state.", "Below is a screenshot of the video with the police barricade highlighted in red by AFP:", "A subsequent keyword search on Google found a higher quality version of the same video published here on Facebook on December 21, 2019. It is titled: “Amit Shah passed away [smiley face]”.", "The men in the Facebook video can be heard chanting “Azadi”, which translates to freedom in English. “Azadi” is also a slogan that was adopted by those opposing India’s new citizenship law, as seen in this local media report of last year’s protests.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the Facebook video (R):", "The same video also circulated online here, here and here on Facebook in December 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]