["About this rating", "On 21 December 2016, Twitter user Adam Saleh sent a video tweet during his removal from a Delta flight, a removal that he claimed was based solely on his speaking Arabic on the plane:", "We got kicked out of a @Delta airplane because I spoke Arabic to my mom on the phone and with my friend slim... WTFFFFFFFF please spread pic.twitter.com/P5dQCE0qos", "— Adam Saleh (@omgAdamSaleh) December 21, 2016", "Saleh appended a video of the incident as he was escorted off the flight and a fellow passenger objected to the situation (while others approved or appeared neutral). Saleh continued tweeting his experiences with Delta on the morning of 21 December 2016 and asked other Twitter users for their assistance in reaching Delta and helping him return to his destination (New York):", "Please help us get back to NYC https://t.co/DPBoQ6MN8z — Adam Saleh (@omgAdamSaleh) December 21, 2016", "Bro!! I'm crying man... idk what to do!! Love xx https://t.co/iqEVpmhduc — Adam Saleh (@omgAdamSaleh) December 21, 2016", "We are still stuck at the airport and Delta has not given us any info. They keep telling us to wait. Please spread the word #BoycottDelta — Adam Saleh (@omgAdamSaleh) December 21, 2016", "UPDATE: Delta just brought the police to speak to us. — Adam Saleh (@omgAdamSaleh) December 21, 2016", "UPDATE: We're being security checked AGAIN right now. — Adam Saleh (@omgAdamSaleh) December 21, 2016", "UPDATE: were now on another flight with a different airline heading to NYC after being checked for 30 minutes. We land 5:50pm in NYC — Adam Saleh (@omgAdamSaleh) December 21, 2016", "The company sent a series of tweets to multiple users about Saleh's claims:", "@heatco Two customers were removed from this flight and later rebooked after a disturbance in the cabin resulted in more than 20... 1/3 — Delta (@Delta) December 21, 2016", "@heatco ...customers expressing their discomfort. We're conducting a full review to understand what transpired. We are taking... 2/3", "— Delta (@Delta) December 21, 2016", "@heatco ...allegations of discrimination very seriously; our culture requires treating others with respect. *MR 3/3 — Delta (@Delta) December 21, 2016", "In their responses Delta asserted that \"more than 20 ... customers [expressed discomfort]\" but didn't explain why the passengers were uncomfortable, remarks that didn't go too far in discrediting the tweet's claim. (It's possible the incident was merely one of an unruly passenger's being removed from a crowded flight and was unrelated to anyone's \"speaking Arabic.\")", "Saleh's last tweet in the series indicated he managed to board a flight with a different carrier and expected to arrive in New York City later that day. At 12:15 on 21 December 2016, Delta issued a statement about the dispute:", "We take all allegations of discrimination seriously and we are gathering all of the facts before jumping to any conclusion. Our culture requires treating everyone with respect. Furthermore, Delta people are trained to and frequently handle conflicts between passengers.", "Maintaining a safe, comfortable and orderly onboard environment is paramount for every flight and requires the cooperation of all of our customers in conjunction with adherence to directions from our crew members. This is a Delta policy and is required by U.S. regulations as well as others governing aviation worldwide.", "Two customers were removed from Delta Flight 1 departing London-Heathrow today after a disturbance in the cabin resulted in more than 20 customers expressing their discomfort.", "We have spoken with the customers who were removed; they were rebooked on another flight. Plans are in place to immediately speak with our crew and other passengers when the flight lands this afternoon. We will provide an update once we have more information.", "Mediaite noted that Saleh has \"a history of making videos about fake anti-Muslim racial profiling incidents and prank videos about planes in particular,\" and former CNN host Soledad O’Brien tweeted that a source had told her the crew was aware Saleh was a YouTube prankster:", "A LOT still unclear. But apparently woman sitting near my friend tipped off flight attendants he was a youtube star known for pranks.", "— Soledad O'Brien (@soledadobrien) December 21, 2016", "Delta later confirmed that aspect, posting a statement declaring that Saleh was removed from the flight he \"is a known prankster\" who \"sought to disrupt the cabin with provocative behavior\":", "Upon landing the crew was debriefed and multiple passenger statements collected. Based on the information collected to date, it appears the customers who were removed sought to disrupt the cabin with provocative behavior, including shouting. This type of conduct is not welcome on any Delta flight. While one, according to media reports, is a known prankster who was video recorded and encouraged by his traveling companion, what is paramount to Delta is the safety and comfort of our passengers and employees. It is clear these individuals sought to violate that priority.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]