["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Lindsey Graham, R-S.C., ran against Donald Trump in the Republican presidential primary. (AP photos)", "Online reports said Sen. Lindsey Graham, R-S.C., would switch parties unless the GOP stops supporting President Donald Trump.", "The headlines are wrong, even though the stories use real quotes from Graham.", "\"Lindsey Graham threatens to convert to Democrat if Republicans don’t Dump Trump,\" read the headline from a March 21, 2017, post from TrueTrumpers.com. Facebook users reported the post as potentially being fabricated, as part of the social media site’s efforts to crack down on fake news.", "The headline is certainly made up, because there’s no evidence Graham has considered trading in his elephant for a donkey. The story, meanwhile, does use real quotes in which Graham disagreed with Trump — albeit before the real estate billionaire was president.", "We can tell this is an old article, because TrueTrumpers.com’s post called Trump the \"the Republican Party’s presumptive nominee.\" The bulk of the story concerns Trump’s attacks on U.S. District Judge Gonzalo Curiel, the judge overseeing a fraud case involving Trump University.", "Trump had said in June 2016 that Curiel had \"an absolute conflict\" because of his \"Mexican heritage,\" saying Curiel was biased against Trump over his calls to build a wall on the border with Mexico.", "Curiel shrugged off the comments, and approved a $25 million settlement in the case. The judge has recently been assigned a case brought by a young man deported in February 2017, despite being protected by the Deferred Action for Childhood Arrivals program.", "The TrueTrumpers.com post said Graham told the New York Times that Trump’s comments were \"the most un-American thing from a politician since Joe McCarthy. If anybody was looking for an off-ramp, this is probably it.\"", "Graham did say this, in a June 6, 2016 story in the New York Times.", "The post also uses another real quote from Graham, who told NBC News’ Hallie Jackson the following day:", "\"There are a lot of people who want to be loyal to the Republican Party, including me. But there’ll come a point in time where we’re gonna have to understand that it’s not just about the 2016 race, it’s about the future of the party and I would like to support our nominee. I just can’t.\"", "There are also quotes from Republican Sens. Mitch McConnell of Kentucky and Susan Collins of Maine (although the post referred to Collins as a representative instead of a senator).", "The TrueTrumpers.com story largely copied a June 7, 2016, article on the Huffington Post, and has appeared on other websites prior to this March 21 post.", "A June 9 post on WeAreChange.org had the same story, but with a slightly different headline that read, \"Lindsey Graham will become a Democrat if Republicans select Trump,\" reflecting that Trump had not yet been officially nominated. The first couple of paragraphs were altered from the Huffington Post article.", "By March 20, 2017, a post on Spinzon.com had the same headline as the TrueTrumpers.com post.", "It’s apparent that a radical headline was slapped on the story to drive traffic. Graham did not say he was planning on changing his party affiliation, but he did disagree with Trump’s comments about a federal judge.", "While the story itself is accurate (albeit with little context), the headline is not. We rate it False.", "TrueTrumpers.com, \"Lindsey Graham threatens to convert to Democrat if Republicans don’t Dump Trump,\" March 21, 2017", "Wall Street Journal, \"Trump Says Judge’s Mexican Heritage Presents ‘Absolute Conflict’,\" June 3, 2016", "New York Times, \"Democrats Jump on Allies of Donald Trump in Judge Dispute,\" June 6, 2016", "NPR, \"Who Is Judge Gonzalo Curiel, The Man Trump Attacked For His Mexican Ancestry?,\" June 7, 2016", "MSNBC, \"Sen. Graham refuses to support Trump,\" June 7, 2016", "Huffington Post, \"Lindsey Graham Wants Republicans To Unendorse Donald Trump,\" June 8, 2016", "WeAreChange.org, \"Lindsey Graham will become a Democrat if Republicans select Trump,\" June 9, 2016", "Spinzon.com, \"Lindsey Graham Threatens To Convert To Democrat If Republicans Don’t Dump Trump,\" March 20, 2017", "U.S. News & World Report, \"Trump Paying $25M After Judge Approves Trump University Deal,\" March 31, 2017", "U.S. News & World Report, \"Judge Criticized by Trump Over Mexican Heritage to Preside Over DACA Case,\" April 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]