["About this rating", "On 26 November 2016, Canadian Prime Minister Justin Trudeau sparked controversy by praising Fidel Castro in a statement about the former Cuban dictator’s death, saying that \"While a controversial figure, both Mr. Castro’s supporters and detractors recognized his tremendous dedication and love for the Cuban people who had a deep and lasting affection for 'el Comandante.' I know my father was very proud to call him a friend and I had the opportunity to meet Fidel when my father passed away. It was also a real honour to meet his three sons and his brother President Raúl Castro during my recent visit to Cuba.\"", "Some Canadians (and others) were angered by what they viewed as Trudeau’s humanization of a dictator who had caused profound suffering for his own people. Trudeau's statement, as well as his family's friendly history with Castro, led to speculation that a much harder truth lay behind his soft words.", "On 27 November 2016, two days after Castro’s death was announced, a user on the Donald Trump subreddit /r/The_Donald presented a theory that Justin Trudeau, the son of former Prime Minister Pierre Trudeau, was actually the love child of Fidel Castro and Margaret Trudeau. The theory rested on three unconnected assertions: 1) Margaret Trudeau and Fidel Castro met in 1971 and were close friends ever after, 2) Margaret Trudeau was sexually promiscuous, and 3) Fidel and Justin were similar in appearance.", "The Trudeaus were indeed close to Fidel Castro, who once described Pierre Trudeau as “a close friend and an extraordinary figure.” Margaret Trudeau was also open in her later writings about her various past affairs. And yes, young Castro and Justin Trudeau might bear a physical resemblance. The notion that the Trudeaus and the Castros met in 1971, however, is based what appears to be a willful misreading of a newspaper article by a reddit user:", "So now that we've established the similar appearance, we need to figure out if it's even possible that Fidel met with Margaret before Justin's conception. Turns out he did — in fact, Pierre and Fidel met for the first time one year before Justin was born.", "Ignoring the biological impossibility of conceiving a child a literal year before that child was born, the user linked to an article by the Canadian newspaper The Globe and Mail, describing the first time the two leaders spoke to (not met) each other:", "Pierre Trudeau’s and Fidel Castro’s paths crossed for the first time in 1970, when the Canadian government sought to negotiate the exile of members of the FLQ, who had kidnapped British trade commissioner James Cross. Fidel Castro obliged the Canadian PM by providing a refuge, and in a private letter Mr. Trudeau later extended his heartfelt gratitude.", "The two leaders' paths did not literally cross at that time: no head-of-state level visit took place between Cuba and Canada in 1970. (These things typically make big news.) The first time Castro and the Trudeaus met face-to-face was a famous trip made by the Canadian couple to Cuba in 1976. This event has been chronicled, along with some purportedly saucy comments, in a book that has been cited by many of the Trudeau-truthers to suggest sexual attraction between Margaret and Fidel. But even if true that facet is a red herring, as Justin had been born well before the 1976 meeting.", "One doesn’t even have to believe any of that, though, as science gives us a rough estimate of when the future leader of Canada was conceived, and history can tell us where Margaret, Pierre, and Castro were during this window of opportunity.", "Justin Trudeau was born on 25 December 1971. By means of a rough estimate, we note that a 2013 study published in the journal Human Reproduction used data from 130 pregnancies to investigate the range of different pregnancy lengths from conception to birth (gestation) and reported a range of from 247 to 284 days:", "It is extremely unlikely that Justin’s birth fell outside of that gestational range, meaning that Castro and Margaret Trudeau would have to have conceived their secret love-child between March 16th and April 22nd, 1971.", "It should be noted that Margaret and Pierre Trudeau were secretly wed on March 4th, 1971, and honeymooned until March 8th. When they returned home, Margaret moved in with the prime minister for the first time. If ever there were a time to make a baby and have it be born in late December, it would have been then, as hinted at in a Harper’s Bazaar profile of Margaret: \"Margaret moved into the prime minister's official residence, at 24 Sussex Drive in Ottawa, and gave birth to Justin just 10 months after the wedding, on Christmas Day in 1971.\"", "If that is not enough evidence, or if the prospect of a head of state (or his spouse) making secret visits to foreign nations unnoticed sounds plausible, careful examination of the historical record provides little chronologic room to place Margaret Trudeau and Fidel Castro together at the time necessary to have conceived the child. Upon their return from their honeymoon, the shock of the Trudeaus' marriage (she was 22 and he was 51) put them under intense media scrutiny, making it unlikely the young Margaret could slip away to Cuba for a tryst unnoticed, since she was now the talk of the town.", "The first couple made a big impression at a local sugaring event, for example, on March 27, and the press (in a testament to the level of scrutiny the prime minister's new wife received) noted that Margaret did not travel with Pierre on an April trip to the Niagara region:", "For the remainder of April, Pierre was busy with governing, as attested to by logs of the Canadian House of Commons, making unlikely that his work would take the couple anywhere near Havana.", "Fidel Castro, for his part, was in Cuba during this conception window. In terms of public appearances, Castro gave a address to attendees of the “first education and culture congress” on 1 April 1971. On 19 April, he gave a defiantly anti-American speech that commemorated the 10th anniversary of the defeat of the United States‐sponsored Bay of Pigs invasion.", "There is no reason to think, or evidence to support the notion, that Margaret Trudeau met Castro before 1971, and there is no plausible circumstance during which a meeting between Fidel Castro and Margaret Trudeau could have occurred during the biologically necessary time that accommodates their known public schedules. Even the original poster of the reddit thread seemed to cede this point:", "There are still some timeline issues - anything that would place them together around the time of conception would seal the deal, but I'm confident in what I've found so far.", "That would be an understatement. The most plausible explanation remains that, soon after marrying, honeymooning, and moving in together after years of keeping their relationship secret, Pierre and Margaret Trudeau had sex and created a child who would one day become another Canadian prime minister.", "Office of the Prime Minister of Canada.   \"Statement by the Prime Minister of Canada on the Death of Former Cuban President Fidel Castro.\"\r\n    26 November 2016.", "Park, Madison.   \"O Canada: Trudeau's Castro Tribute Raises Eyebrows.\"\r\n    CNN.   27 November 2016.", "The New York Times.   \"Castro Rejects New Ties to U.S.\"\r\n    20 April 1971.", "AP Images.   \"Pierre Trudeau with His Bride Margaret\"\r\n    27 March 1971.", "Library of Parliament.   \"House of Commons Journals, 28th Parliament, 3rd Session: Vol. 117.”", "Kuczynski, Alex.   \"First Lady Wild Child: Margaret Trudeau.\"\r\n    Harper’s Bazaar.   17 March 2016.", "Getty Images.   \"Bringing His Bride Home: Prime Minister Pierre Trudeau and Wife.\"\r\n    8 March 1971.", "The New York Times.   \"Trudeau Weds in Canada.\"\r\n    5 March 1971.", "Jukic, A.M.   \"Length of Human Pregnancy and Contributors to Its Natural Variation.\"\r\n    Human Reproduction.   6 August 2013.", "Wright, Robert.   \"Castro and Trudeau: A Famous, But Also Fraught Friendship\"\r\n    The Globe and Mail.   26 November 2016.", "Cohn, Andrew.   \"What a Long, Strange Trip It's Been\"\r\n    The Globe and Mail.   15 October 2010.", "Castro, Fidel.   Fidel Castro: My Life.\r\n    Simon and Schuster, 2008.   ISBN 1-416-56250-8.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]