["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidate Rand Paul speaks in Des Moines, Iowa, on May 16, 2015.", "That Sen. Rand Paul of Kentucky often disagrees with infectious-disease expert Dr. Anthony Fauci is well known.", "Recently, the pair clashed at a Senate hearing when Paul, a Republican, argued against mask recommendations for people who have had Covid-19 or have been vaccinated against it.", "At the hearing, Fauci, President Joe Biden’s chief medical adviser, pushed back against Paul’s characterization of wearing masks as \"theater.\" Continued caution is advised, Fauci said, as scientists study the new variants now circulating in the U.S. and other countries.", "Paul, an eye doctor by training, continued the squabble a few days later, calling out Fauci in a tweet, pointing to a study that he said \"shows vaccines and naturally acquired immunity DO effectively neutralize COVID variants.\"", "The tweet linked to a study published online at the JAMA Network, a family of specialty medical journals.", "We reached out to Paul’s office for additional sources for his tweet but did not receive a reply.", "So, we asked the experts: Are Covid variants effectively neutralized by vaccines or natural immunity conferred on people who recover from the illness?", "In short, the research cited by Paul does show good blood levels of neutralizing antibodies against at least some of the current variants following infection or vaccination. But they’re not the whole story.", "Mehul S. Suthar, an author of the study Paul cited, said the results are encouraging but should not be seen as all-encompassing: \"Our interpretation is that our study looks at one aspect of immune response, antibodies.\"", "Neutralizing antibodies are important because they can block the ability of a virus like the one that causes Covid to infect cells. But the body also has other defenses. T cells, for example, can be spurred by infection or vaccination, Suthar said, although the study was not designed to look at those.", "For the study, researchers gathered blood samples from 40 people who were in the hospital with Covid or had recovered from it. From the National Institutes of Health, they also received blood samples drawn from 14 people who had gotten both doses of the Moderna vaccine, said Suthar, an assistant professor at Emory University’s vaccine center.", "Then they ran tests on those samples against the original SARS-CoV-2 virus and three variants, including the one dubbed B.1.1.7, which first appeared in the United Kingdom and is now circulating widely in the U.S.", "They wanted to know: Did antibodies produced by being infected or vaccinated neutralize B.1.1.7?", "\"We are lucky with B.1.1.7 that our antibodies appear to work well against this virus,\" Suthar said.", "However, as with any study, there are caveats. For one thing, the results were based on a small number of samples. And the analysis did not include other variants of concern, such as the ones that emerged in South Africa and Brazil, which limits the ability to draw broad conclusions.", "Finally, antibodies are just one measure of potential protection against disease. Laboratory research measuring antibodies indicates that some immunity is created by both illness and vaccination, but the strength and longevity of that protection — the effectiveness in the real world — is a separate question. That’s partly because the ideal level of neutralizing antibodies needed for protection is not known and other immune protections, such as T cells, aren’t measured.", "Also, in the real world, other factors — such as the variant a person is exposed to, and the presence of  other mitigating factors, including masks and good ventilation — can make a difference.", "\"Part of the reason that real world data are so important is looking at the whole picture of immunity,\" said Gigi Gronvall, a senior scholar at Johns Hopkins Bloomberg School of Public Health. \"Also, with the level of community transmissions of disease, I would be concerned that there will be more variants that emerge.\"", "Paul’s tweet — taking aim at what he sees as an overcautious approach by public health experts — doesn’t capture that type of nuance, nor does it reference studies on the other emerging variants.", "\"Blanket assertions made by non-scientific experts are not going to help,\" said Gronvall.", "Dr. Jesse Goodman, professor of medicine and a specialist in infectious diseases at Georgetown University, agreed.", "\"It’s wrong to declare victory and say there’s no problem with variants and that everyone previously infected will be fine,\" said Goodman, who served as chief scientist of the Food and Drug Administration under the Obama administration.", "Viruses naturally mutate as they replicate. So it’s not surprising that the coronavirus has done so. Several variants have emerged, including home-grown ones from California and New York.", "Lab tests on blood samples from vaccine trial participants in South Africa showed lower levels of neutralizing antibody production, possibly related to the variant circulating there.", "How big a difference the lower levels measured in those samples make isn’t yet known.", "Levels are still high and could \"effectively neutralize the virus,\" Fauci wrote in an editorial published Feb. 11 in JAMA.", "Even so, clinical trials used to test Covid vaccines before they were approved for emergency use showed lower efficacy when tested in areas where the South African variant was circulating.", "\"We expect vaccines and prior infection to offer significant protection against variants that are closely related,\" said Goodman. \"But as they become more genetically different — like the South African one — that protection could go down.\"", "The main goal of the vaccines is to prevent hospitalization and death, and all the vaccines in use in the U.S. appear to substantially reduce the risk of hospitalization and death from Covid, according to research.", "\"Even if the current vaccines may not be perfect, they do appear to prevent more severe outcomes,\" Goodman said.", "Don’t assume, as Paul’s tweet implies, that recovering from covid or getting vaccinated means zero risk of infection.", "For one thing, reinfection is rare but can occur.", "Goodman pointed to a recent study conducted in Denmark showing that a small percentage (0.65%) of people who tested positive for Covid in the spring fell ill again.", "\"People should not presume that even if they had the vaccine or were previously infected that there’s no future risk,\" Goodman said.", "Even though no vaccine is 100% effective, Gronvall at Hopkins said not to use that as an excuse to avoid inoculation.", "\"The vaccines appear to be great,\" she said. \"Get one when you can.\"", "Paul is correct that the JAMA study showed vaccination or previous infection appeared, based on a small sample of people, to help neutralize the virus. However, he left out important details that make his position an oversimplification of a complicated issue.", "The study considered only one variant — the one that emerged in the U.K. — and did not include an analysis of other types now circulating, or the potential for additional variants that could emerge. Also, the type of antibody studied is just one factor in protecting against disease, and just what those levels of neutralizing antibodies  measured in a laboratory experiment may mean in the real world is not known.", "So, for those reasons, we rate the senator’s statement Half True.", "Telephone interview with Mehul S. Suthar, assistant professor at the Emory Vaccine Center, March 22, 2021", "Telephone interview with Gigi Gronvall, senior scholar at Johns Hopkins Center for Health Security and associate professor in the environmental health and engineering department at Johns Hopkins Bloomberg School of Public Health, March 23, 2021", "Telephone interview with Jesse Goodman, professor of medicine at Georgetown University and former chief scientist of the Food and Drug Administration, March 24, 2021", "JAMA Network, \"Neutralizing Antibodies Against SARS-CoV-2 Variants After Infection and Vaccination,\" March 19, 2021", "CNN Politics, \"Masks Are Not Theater, Fauci tells Sen. Rand Paul in Hearing Exchange,\" March 18, 2021", "The New England Journal of Medicine, \"Neutralizing Activity of BNT162b2-Elicited Serum,\" March 8, 2021", "The New England Journal of Medicine, \"Serum Neutralizing Activity Elicited by mRNA-1273 Vaccine,\" March 17, 2021", "Yale Medicine, \"Comparing the COVID-19 Vaccines: How Are They Different?,\" updated March 25, 2021", "Fast Company, \"Can I Get Covid-19 Twice? New ‘Lancet’ Study Offers Insight on Reinfection Rates,\" March 22, 2021", "JAMA Network, \"SARS-CoV-2 Viral Variants — Tackling a Moving Target,\" editorial, Feb. 11, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]