["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. David Jolly has announced he will run for re-election in the U.S. House against former Gov. Charlie Crist. (AP photo)", "Only hours after U.S. Rep. David Jolly announced he would drop his Senate bid and instead seek re-election to Congress, his Democratic opponent Charlie Crist sent out a fundraising email attacking the incumbent.", "\"We are now being challenged by a well-funded former Washington lobbyist,\" former Gov. Crist’s June 17, 2016, email stated. \"This is a man who has used money and power to try to take away women’s rights, drill off our beaches and block common sense gun control.\"", "Jolly had been vying for the U.S. Senate seat Marco Rubio was vacating after his presidential campaign, but Rubio decided he wanted to run for re-election after all. Now Jolly is competing against Crist in a redrawn district that leans heavily Democratic.", "There’s plenty of accusations packed into that sentence, but Jolly’s record on oil drilling struck us as particularly Florida-centric. Was Jolly an advocate for offshore drilling, as Crist said?", "Crist has a point about Jolly’s past work, which we’ve previously researched. But his claim ignores Jolly’s record of pushing back against offshore drilling in Congress.", "Not off our shore", "Jolly, a former lobbyist and aide to longtime U.S. House Rep C.W. \"Bill\" Young, replaced the congressman after Young died in office in 2013. He’s been in office since winning a 2014 special election.", "Offshore drilling, for the most part, is not allowed off Florida shores. The 2006 Gulf of Mexico Energy Security Act prohibits drilling within 230 miles of Tampa Bay and 125 miles from the Panhandle. The law expires in 2022.", "Crist is making it sound as if Jolly clearly favors more drilling off the coast of Florida. Jolly’s actions recent actions haven’t shown that at all.", "As a congressman, Jolly voiced opposition in July 2014 to expanded exploration off Florida’s Atlantic coast using sound waves, out of concern for the same process being used in the Gulf of Mexico. He signed a bipartisan letter to President Barack Obama opposing so-called seismic testing. (The Atlantic drilling was later called off.)", "He introduced legislation in June 2015 that was co-sponsored by Democratic Reps. Gwen Graham and Patrick Murphy to extend the ban on drilling in the eastern Gulf another five years, until 2027. The following month, he introduced an amendment heading off a Senate plan that would have potentially expanded drilling off Florida’s Gulf coast.", "This is not to say that Jolly is against drilling for oil as a practice. In an editorial that coincided with his bipartisan bill, he said Florida didn’t need to risk its beaches simply to increase oil production.", "\"In the eastern region off Florida's coast, there are zero producing leases, and none are needed,\" he wrote in a Tampa Bay Times op-ed on June 3, 2015. \"Gulf drilling activities in the western and central Gulf meet today's energy demands and are capable of meeting tomorrow's.\"", "Jolly makes no secret his strategy is based on keeping Florida waters free of oil platforms while relying on drilling elsewhere.", "\"I've been pretty clear I support the current administration plan for continued drilling in the western and central Gulf, while strengthening the ban in the eastern Gulf,\" Jolly told us in an email statement through his spokesman.", "So where is Crist getting the idea that Jolly worked to open up more drilling? His campaign’s single piece of evidence was one of our own fact-checks from 2014.", "The Democratic Congressional Campaign Committee accused the then-candidate of working to expand the practice in the Gulf, but Jolly claimed he \"never lobbied for offshore oil drilling.\" We rated Jolly’s statement Mostly False.", "While at his firm Three Bridges Advisors, Jolly had listed on a March 3, 2011, lobbying disclosure form that he had discussed H.R. 909, an energy independence proposal known as the Roadmap for America’s Energy Future. The bill in part called for expanded offshore drilling and was supported by Jolly’s client, an anti-regulation advocacy group called Free Enterprise Nation.", "Jolly admitted he had listed the bill on the form because he was at a meeting in which his client discussed it, but he \"did not lobby on its behalf.\" Lobbying experts we spoke to at the time said it was unlikely Jolly would have listed the bill if he hadn’t discussed it, although there was no way to verify that.", "More importantly, according to the Lobbying Disclosure Act, even being in a meeting in which it was discussed was technically a form of lobbying. We decided that Jolly couldn’t claim to having never lobbied on the subject, because he said he had.", "But we think a single instance of lobbying on a broad energy plan years ago is very different than implying Jolly did (and still) wants to expand drilling entirely.", "Our ruling", "Crist said Jolly \"has used money and power to try to … drill off our beaches.\"", "His campaign’s argument is that Jolly technically lobbied on a failed 2011 bill that would have potentially expanded offshore drilling. But that was several years ago, and about a claim Jolly made during his House campaign concerning one event in his years as a lobbyist. Crist is ignoring Jolly the congressman’s efforts while in office  — however nuanced — to keep drilling away from Florida’s shores.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "https://www.sharethefacts.co/share/c29ba169-b094-41c3-b660-bfcb9bb12d57", "Charlie Crist, Fundraising email, June 17, 2016", "The Weekly Standard, \"Summary of the Energy Roadmap,\" March 2, 2011", "Tampa Bay Times, \"U.S. Rep. C.W. Bill Young dies at 82,\" Oct. 18, 2013", "PolitiFact Florida, \"David Jolly says he 'never lobbied for offshore oil drilling',\" Jan. 6, 2014", "Tampa Tribune, \"Florida officials oppose reopening of offshore oil exploration,\" July 19, 2014", "U.S. Rep. David Jolly, \"Rep. Jolly introduces House measure extending Florida’s Gulf of Mexico drilling moratorium,\" June 4, 2015", "Sunshine State News, \"Congress Adopts David Jolly's Amendment Cutting Off Oil Exploration in Eastern Gulf Until 2022,\" July 8, 2015", "U.S. News & World Report, \"U.S. Bars Atlantic Drilling,\" March 15, 2016", "Tampa Bay Times, \"Jolly: Protect, extend drilling ban off Florida's coast,\" June 3, 2015", "Tampa Bay Times Buzz blog, \"Jolly and Graham introduce bipartisan legislation to extend Gulf oil drilling ban,\" June 4, 2015", "U.S. Rep. Mark Sanford, \"Sanford, Connolly Lead House Letter to President Opposing Seismic Testing in the Atlantic,\" June 8, 2016", "Tampa Bay Times Buzz blog, \"David Jolly tells supporters he's got \"unfinished business\" in Congress,\" June 17, 2016", "Tampa Bay Times, \"U.S. Rep. David Jolly drops out of U.S. Senate race to run for re-election,\" June 17, 2016", "U.S. House of Representatives, Lobbying Disclosure Act Guidance Sec. 3, Definitions, accessed June 28, 2016", "U.S. House of Representatives, Legislative Resource Center LD-2 Disclosure Form, accessed June 28, 2016", "Congress.gov, HR 2630, accessed June 28, 2016", "Congress.gov, S 1276, accessed June 28, 2016", "Interview with Max Goodman, Jolly spokesman, June 27-28, 2016", "Interview with Kevin Cate, Crist spokesman, June 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]