["About this rating", "During the Brown & Black Democratic Presidential Forum, hosted by Vice News in Des Moines, Iowa, on Jan. 23, 2020, candidate and former U.S. Vice President Joe Biden was asked about what reforms he would bring to Immigration and Customs Enforcement (ICE).", "In the course of his answer, Biden said he would change policy so that children of \"undocumented\" people don't live in fear and uncertainty of their parents being deported. As one example, he said he did not consider \"drunk driving\" as a felony that justified an ICE agent arresting someone.", "They [the children of 'undocumented' immigrants] go off to school wondering whether their mom comes and picks them up, is she not going to be there because an ICE agent was there to arrest her? Or she takes them to the doctor, that she’s going to not be there because she is ‘undocumented’ and an ICE agent is going to pick him up.", "[...] You change the culture by saying you are going to get fired. You are fired if, in fact, you do that. You only arrest for the purpose of dealing with a felony that's committed, and I don't count drunk driving as a felony.", "Those remarks are recorded in the following video, beginning at the 3:04:55 mark:", "The moment was highlighted in a headline published by the conservative Capitol-oriented news outlet Washington Examiner.", "As the Examiner noted, driving under the influence (DUI) can constitute a felony, depending on the state where the offense occurred and the severity of the incident.", "The Trump administration has come under fire for its immigration rhetoric and policy. In 2018, roughly half of the 158,000 people \"administratively arrested\" by ICE had DUI charges or convictions.", "Pearce, Tim.   \"Joe Biden: 'I Don't Count Drunk Driving as a Felony.'\"\r\n    Washington Examinier. 20 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]