["About this rating", "On 29 November 2017, United States President Donald Trump retweeted three videos from Jayden Fransen, the deputy leader of the far-right anti-Islam organization Britain First who was found guilty of religiously aggravated harassment in November 2016. As this group has a penchant for sharing out-of-context, misleading, and false information, it wasn't surprising that at least one of these videos, which purportedly shows violent acts committed by Muslims, had a misleading caption :", "Although the video is frequently accompanied by the caption \"Muslim migrant beats up Dutch boy on crutches,\" there is no evidence to support this assertion, which in fact came, like so many other unfortunate assumptions, from its comment section.", "This video was first posted to the web site Dumpert.nl, a popular video portal in the Netherlands, in May 2017. Although the original posting largely focuses on the act of hitting a person on crutches, and it was not shared with any claims about the attacker's religion, some people on the comment section naturally — and baselessly — assumed that the perpetrator was Muslim. As the video was reposted to other web sites, the unfounded claim that the attacker was a Muslim migrant followed it.", "Shortly after this video was posted to Dumpert.nl, Dutch police officers were able to locate the attacker and arrest him. A news report from the Telegraaf identified him as a 16-year-old boy from Monnickendam. The report made no mention of the boy's religion.", "Further, when this months-old video was brought back into the spotlight in November 2017 thanks to a retweet from President Trump, Dumpert.nl posted a short article that mocked Trump for sharing the video:", "(By the way, fake news! Dader was geen moslim en geen immigrant. Maar leuk geprobeerd Trumpie)", "(By the way, fake news! Perpetrator was not a Muslim and not an immigrant, but nice try Trumpie)", "Geenstijl, the web site that operates Dumpert, also stated that the attacker in the video was not a Muslim:", "Moreover, the perpetrator was not a Muslim, let alone a migrant, but simply a Dutchman.", "The official Twitter account of the Public Prosecution Service of North Holland also disputed the claim that the attacker in this video was a Muslim migrant. In a message posted on 29 November 2017, they explained that the video showed a May 2017 quarrel between two minors. The attacker, who was born in the Netherlands, was placed in the HALT Program, an alternative settlement for young first time offenders:", "A video has been shared on twitter in which an argument between two underage boys can be seen. This incident took place in May of this year. The public prosecution service Noord-Holland has studied the file submitted by the police. (1/2)", "— OM Noord-Holland (@OMNoord_Holland) November 29, 2017", "The suspect, who was born and raised in the Netherlands, received a HALT settlement (https://t.co/w62MNOFvug). This has been successfully completed. (2/2)", "— OM Noord-Holland (@OMNoord_Holland) November 29, 2017", "The Netherlands Embassy in the United States also took to Twitter to tell to President Trump that \"facts do matter\" and that the attacker in the video was not a Muslim migrant:", ".@realDonaldTrump Facts do matter. The perpetrator of the violent act in this video was born and raised in the Netherlands. He received and completed his sentence under Dutch law.", "— Netherlands Embassy ?? (@NLintheUSA) November 29, 2017", "Greenstijl.   \"LOL. Real Donald Trump Retweet Dumpertvideo.\"\r\n    29 November 2017.", "Telegraaf.   \"Aanhoudingen dankzij filmpje Dumpert.\"\r\n    13 May 2017.", "Nelson, Sara.   \"Britain First Mocked for Stealing Satirical Post Slamming Jeremy Corbyn Thinking It Was Genuine.\"\r\n    Huffington Post.   27 June 2017.", "Porter, Tom.   \"Who Is Britain First's Jayda Fransen, The U.K. Far-Right Anti-Islam Leader Who Trump Retweeted?\"\r\n    Newsweek.   29 November 2017.", "Osborne, Samuel.   \"Jayda Fransen Guilty: Britain First Deputy Leader Convicted After Abusing Muslim Woman in Hijab.\"\r\n    The Independent.   3 November 2016.", "Updated [29 November 2017]: Added statement from Public Prosecution Office of North Holland.", "Updated [30 November 2017]: Edited to reflect that Britain First was deregistered as a political party by the UK Electoral Commission in November 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]