["About this rating", "Changes proposed in the 2017 tax reform bill working its way through Congress will have palpable repercussions in many areas of American life, including education.", "The combined effects of a pair of controversial provisions impacting the funding of public and private schools take center stage in a widely shared meme on social media:", "Until now, your income that paid for public schools (via state & local taxes) wasn't taxed by the federal government. GOP bill ends that. Instead, they're now creating a tax break for *private* school tuition.", "The GOP is, in effect, defunding public schools to fund private schools. This is a straight-up war on public education.", "It's a bit hyperbolic to characterize it as \"defunding\" public schools, but the post is accurate in stating that the bill (both the House and Senate versions of it) would eliminate existing deductions for state and local taxes (except for a $10,000-or-less property tax deduction) while granting tax breaks to families who homeschool or send their children to private schools.", "Repealing the state and local tax (SALT) deduction, which has been integral to the federal tax code since 1913, would have adverse impact on public schools, critics say, because it would lead to reductions in the state and local taxes that fund them. The Government Finance Officers Association (an organization of public finance officials) agrees, explaining it this way:", "States, cities, counties, school districts, and other special districts have all established tax rates that operate under the assumption that the federal tax code provides deductibility. Taxpayers would not accept a tax increase in taxes paid, or double taxation, and they would make their displeasure known — especially those in high-tax jurisdictions. Deprived of SALT as a tool for keeping their tax burden lower, they would push back against the tool that they have available to them — local tax rates, which provide the revenues needed to provide essential public services, such as police officers, teachers, firefighters, and other valuable public servants, along with critically important investments that provide for infrastructure, public safety, healthy communities, and many factors contributing to the quality of life.", "According to the Tax Policy Center, the SALT deduction and local tax rates are so interlinked that the former amounts to a federal subsidy:", "The SALT deduction provides an indirect federal subsidy to state and local governments by decreasing the net cost of nonfederal taxes to those who pay them. For example, if state income taxes increase by $100 for families claiming the SALT deduction on their federal returns who are in the 35 percent federal income tax bracket, the net cost to them is $65; that is, state taxes go up by $100, but federal taxes go down by $35. This federal tax expenditure encourages state and local governments to levy higher taxes (and, presumably, provide more services) than they otherwise would.", "At least one institutional critic of the tax reform legislation, the National Education Association (NEA), projects that eliminating SALT could result in $370 billion in spending cuts for education nationwide over the next ten years, and the loss of as many as 250,000 jobs. A national coalition of education groups issued a strongly worded statement condemning the proposed repeal:", "We believe any comprehensive tax reform must preserve the state and local tax (SALT) deduction as a matter of national priority. The SALT revenue is invested in local communities to fund vital needs including infrastructure, public safety, home ownership and public schools, which educate almost 90 percent of students in our country. Representing public education leaders entrusted with the important responsibility for educating students, we are deeply committed to ensuring students get the best possible education and support. Eliminating the SALT deduction endangers public education and our students’ future.\n\nState and local tax deductions ensure a stable local tax base that public schools rely on to educate students and provide needed services, such as health care and related needs. The current proposal to eliminate the SALT deduction as part of broader tax reform would cripple this ability and damage state and local economies.", "Private schools would fare much better. A revision of Section 529 of the existing federal tax code extends the applicability of so-called \"529 plans\" (tax-exempt savings accounts covering higher education expenses) to tuitions for K-12 private and parochial schools, as well as the costs of homeschooling.", "As illustrated in a December 2017 article in Forbes, the benefits could be significant for well-to-do families who send their children to private schools:", "Consider the case of a parent who saves $4000 per year in a 529 for a child's education in my home state of Virginia. He also deposits the $230 of annual tax savings he gets from Virginia into the account as a supplemental contribution. Our taxpayer sends his child to a Catholic school which charges $6500 per year in tuition, and then a Catholic high school which charges $10,000 per year in tuition.", "Throughout the course of the child's pre-college educational life, our taxpayer has saved $76,000 in original contributions to the 529 but had enough money in the account to spend just under $100,000 on tuition, assuming a 5 percent annual investment growth rate. Nearly $25,000 was therefore totally free, totally tax-exempt education funding. His 529 subsidized one-quarter of his daughter's tuition bill, a bill he would have paid entirely with after-tax dollars without the Cruz amendment.", "For poorer families, however, the 529 extension would do little to make it more feasible for parents to choose private schools (or homeschooling) over public schools — public schools which may, in a few more years, face funding crises brought about by the same legislation.", "Balingit, Moriah and Anderson, Nick.  \"After a High-Drama Vote, Here's What the Senate Tax Bill Means for Schools, Parents and Students.\"\r\n  The Washington Post.  2 December 2017.", "Camera, Lauren.  \"Teachers Union: GOP Tax Plan Puts 250,000 Education Jobs at Risk.\"\r\n  U.S. News and World Report.  9 November 2017.", "Ellis, Ryan.  \"Ted Cruz's 529 Education Savings Amendment to Tax Reform Is a Big Win for Families.\"\r\n  Forbes.  4 December 2017.", "Green, Erica L.  \"Tax Bills Could Expand Private School Benefits and Hurt Public Education.\r\n  The New York Times.  4 December 2017.", "Government Finance Officers Association.  \"The Impact of Eliminating the State and Local Tax Deduction.\"\r\n  20 September 2017.", "National Education Association.  \"Funding for 370,000 Education Jobs at Risk If Senate Eliminates State and Local Tax Deduction.\"\r\n  14 November 2017.", "Tax Policy Center.  \"How Does the Deduction for State and Local Taxes Work?\"\r\n  Accessed 5 December 2017.", "U.S. Securities and Exchange Commission.  \"An Introduction to 529 Plans.\"\r\n  4 December 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]