["A video of a man set ablaze while security personnel try to douse the fire is being shared with the claim that the incident took place at Kannur airport, Kerala. A power bank allegedly placed inside his pocket, which he was using to charge his phone, is being held responsible for the fire. A screenshot of the viral WhatsApp message can be seen below. It says, “This unfortunate incident happened in Kannur-Airport, Kerala. He was charging his mobile phone keeping in his pant pocket using power bank. This is a big lesson for all.”", "The video has been circulating on Facebook with the same claim at least since March 2019.", "It is also floating on Twitter.", "This unfortunate incident happened in Kannur-Airport,Kerala. He was charging his mobile phone keeping in his Pant pocket using Power Bank. This is a big lesson for all. 😓 pic.twitter.com/Era6dLXkGL", "— Riya 🔨 ரியா రియా ರಿಯಾ ਰਿਆ রিয়া റിയ ରିୟା रिया (@riyaOmm) March 24, 2019", "With a keyword search on Google, Alt News found that the incident was reported by digital news outlet Morocco World News on June 4, 2018. A 30-year-old man set himself on fire at the entrance of a supermarket in Agadir, according to the report.", "Furthermore, as per a local Moroccan website, hours before the incident on June 3, 2018, the man was allegedly caught with a stolen item from the market. Following which, he came to the supermarket with an inflammable substance and attempted to immolate himself. The website further reported that the person had suffered third-degree burns on his body and was later transported to Hassan II hospital in the city.", "Earlier in June 2018 when the same video went viral with a claim that the incident took place at a mall in Dubai, the official Twitter handle of Dubai Police had denied the claim and warned users to not spread false news. The claim was earlier debunked by Gulf News.", "In conclusion, an old video of a man immolating himself in Morocco was shared with the false claim that a power-bank explosion led to the incident of this man caught up in a fire at Kannur airport, Kerala.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]