["“Joe Biden sighns executive action cancelling the Trump Administration’s hard line on sex trafficking. ‘Operation Talon’ targeted sex traffickers living in America illegally,” says a March 3, 2021 Facebook post featuring a photo of the president signing executive orders.", "Other posts shared thousands of times in late February and early March conveyed a similar message without the photo.", "ICE gained influence under former president Trump’s tough immigration policies, which Biden is attempting to reform.", "But until new policies are enacted, controversial practices of the past continue, while some such as detaining unaccompanied minors have soared due to an increase in border crossings based on the belief that rules under the Democrat will be more lenient.", "Operation Talon -- which was planned to broadly pursue alien sex offenders -- was not canceled by the Biden administration, and the Presidential Actions section of the White House website does not mention an order targeting the program.", "Talon is a nationwide effort designed to remove sex offenders subject to deportation from US territory, and falls under the Sex Offender Alien Removal initiative, or SOAR, an ICE spokesperson told AFP.", "Operations under SOAR are frequently developed and executed, the ICE spokesperson said, adding that the public is generally not made aware of them lest targeted individuals realize they may be about to be apprehended.", "ICE planned Operation Talon in January, when former president Trump was still in office, but it was never executed, the spokesperson said, specifying that the Republican did not have a direct role in the operation’s creation.", "Talon was postponed, not canceled, in a decision made by operational-level officers without involvement of the current administration or the Department of Homeland Security (DHS), which ICE is part of, the spokesperson added.", "DHS did not respond to AFP requests for comment.", "The claims appeared on social media shortly after The Washington Post reported in early February that internal emails showed Operation Talon had been canceled.", "The Post article led the attorneys general of 18 states to sign a letter to Biden asking for Talon to be maintained.", "The ICE spokesperson said the agency was not aware of the email correspondence mentioned by The Washington Post and would not comment on it.", "The agency announced in February that interim operating guidance will temporarily govern deportation operations “until Secretary of Homeland Security Alejandro Mayorkas issues new enforcement guidelines for the Department.”", "Among the priorities under the interim guidance are non-citizens posing a threat to public safety and who have been convicted of an aggravated felony.", "The Homeland Security Investigations branch of ICE investigates transnational crimes including “child exploitation, human smuggling and trafficking,” the agency’s website says.", "AFP Fact Check has previously debunked a series of other inaccurate claims related to sex trafficking.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]