["About this rating", "On Jan. 18, 2021, two days before former U.S. President Donald Trump left office, a controversial education commission he established months earlier filed its final report.", "In 2020, Trump set up the 1776 Commission as a direct response to The New York Times' 1619 Project, which evaluated the legacy of slavery in the founding and subsequent history of the United States, and was itself the subject of considerable controversy.", "The 1619 Project became a bête noir among conservatives, and in September 2020, Trump described it as \"totally discredited,\" saying it \"rewrites American history to teach our children that we were founded on the principle of oppression, not freedom.\" In response, he ordered the establishment of the 1776 Commission, in order to \"better enable a rising generation to understand the history and principles of the founding of the United States in 1776 and to strive to form a more perfect Union.\"", "When the commission published its final report, several historians strongly criticized its contents, including Jim Grossman, executive director of the American Historical Association, who called it a \"hack job\" and \"a work of contentious politics designed to stoke culture wars.\" CNN reported that President Joe Biden's transition team said Biden will dissolve the 1776 Commission after he takes office.", "Others claimed that sections of the 1776 Commission report appeared to have been copied and pasted from earlier writings. For example, Politico reported that:", "An entire page of the report suggesting classroom discussion topics for teachers appears to be copied nearly verbatim from an opinion piece published in 2008 by one of the commission’s members, Thomas Lindsay. The similarities are pronounced enough to raise questions about how much original work actually went into the construction of the 1776 report. And it will undoubtedly fuel criticism that the final product was not meant to be an academic endeavor but, rather, a partisan effort to tilt the educational playing field.", "Similar articles were published by Business Insider and Unilad. Those reports were accurate. Segments of the 1776 Commission report were not only similar to previous writings by Lindsay and commission Executive Director Matthew Spalding, but identical, meaning they were manifestly copied from that earlier work.", "The practice of reusing your old writing, without properly citing the original source and informing the reader that it is not original work, is known as self-plagiarism, and is typically regarded as unethical in academia and journalism.", "As Politico first pointed out, several different sections of the report included phrases and even whole paragraphs that were taken from earlier writings by Lindsay and Spalding. The following is a breakdown of those replications.", "Page 39 of the 1776 report contains the following learning prompts for teachers:", "Those questions were taken from Lindsay's 2008 op-ed in Inside Higher Education, in which he wrote:", "Also on page 39, the 1776 report poses the following two prompts:", "Those questions were also lifted from Lindsay's 2008 piece:", "Page six of the 1776 report contains two sections taken directly from Spalding's 2014 book \"We Still Hold These Truths.\" The following is the first phrase, followed by its original appearance in the book:", "And the following is the second borrowed phrase, first as it appears on page six of the commission report, followed by its earlier appearance in Spalding's book:", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]