["“Sorry but you have lung cancer. But I don’t even smoke. But you been wearing a mask for 8 months,” reads the text over an image of a woman speaking to a medical professional. The picture was shared on Facebook on February 4, 2021.", "More examples of the post can be found here, here and here.", "Since the beginning of the pandemic, disinformation about the use of masks has spread worldwide. The World Health Organization, the US Centers for Disease Control and Prevention and Health Canada agree that masks are generally safe to use and help to curb the spread of Covid-19, which has infected more than 100 million people, killing nearly 2.4 million globally.", "A similar claim can be found in an article headlined, “Long-Term Mask Use May Contribute to Advanced Stage Lung Cancer, Study Finds.”", "It has been shared more than 3,400 times on Facebook, according to the social media monitoring tool CrowdTangle. The article was also published on GlobalResearch.ca -- a site previously fact-checked by AFP -- and spread on Facebook and Instagram via screenshots of the same headline from Geopolitic.org.", "AFP also found the claim circulating in Spanish, Portuguese and Polish.", "“A recent study in the journal Cancer Discovery found that inhalation of harmful microbes can contribute to advanced stage lung cancer in adults. Long-term use of face masks may help breed these dangerous pathogens,” reads the article.", "It is based on a study published in the journal Cancer Discovery, which makes no mention of masks, and also references a local news report that recommends wearing masks during the pandemic but cautions readers to wash them regularly if they are reusable.", "Study co-author Dr Leopoldo Segal told AFP in an email that “our recent study does not address mask-wearing, and there is no scientific rationale or evidence to support the mistaken idea that mask-wearing increases the amount of oral bacteria that reach the lungs.”", "Other experts agreed that there is no data supporting the claims circulating online", "Dr Nicole Ezer, assistant professor at the Faculty of Medicine and Health Sciences at McGill University, said in an email that “there is currently no scientific evidence to conclude that masks increase the risk of lung cancer.”", "And Dr Gerard Cox said there is “no plausible link (mechanism of causing cancer) between wearing a PPE mask and developing lung cancer.” Cox, who also spoke by email, is a professor with the Faculty of Health Sciences at McMaster University.", "The article shared on Facebook also references a local news report that recommends wearing masks during the pandemic but cautions readers to wash them regularly to guard against fungus and bacteria if they are reusable.", "Ezer, who also directs a screening program for lung cancer at the McGill University Health Centre, emphasized the importance of washing such masks. “The air you are breathing already has bacteria that lives in your mouth, so it will not change by wearing a mask. Perhaps if you haven’t washed your mask, I may be worried about new bacteria entering the mouth, but in general recommendations are to wear disposable masks or wash reusable masks!”", "Some of the posts on Facebook and Instagram use purported quotes about oxygen deprivation of the cells by Otto Warburg, who won the Nobel Prize in Physiology or Medicine in 1931 and died in 1970.", "But science has evolved since Warburg’s era.", "McGill’s Ezer explained: “What Warburg thought of as causative (deprivation of oxygen and acid causes cancer formation), is now considered to be a result of mutations in genes (oncogenes and tumor suppressor genes).”", "“Warburg made important scientific contributions to cell metabolism, but his research really was not able to demonstrate causation, which these Facebook posts assume,” she said.", "The American Lung Association said in a blog post that “masks are designed to be breathed through and there is no evidence that low oxygen levels occur.”", "A group of global health experts also published a rebuttal to the claim that masks cause cancer, writing: “Wearing a face mask does not put you at a higher risk of cancer.”", "“There is no current evidence linking the use of face masks to cancer, and science shows that any risks associated with wearing masks are low overall, while the benefits are high… Healthcare workers often wear masks for long hours in the hospital and have been doing so for a long time,” the experts said.", "AFP has debunked many false or misleading claims about masks,  including claims about bacteria, pneumonia and masks here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]