["The video was shared in this Facebook published on December 25, 2019. It has been viewed more than 2,900 times.", "In the clip, a large group of men wearing Dastars, a style of turban worn by some Sikhs, can be heard chanting slogans as they march across a bridge wielding swords and sticks.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi-language caption translates to English as: \"No policemen seen during a protest rally against NRC in Punjab today.\"", "NRC is an acronym for the National Register of Citizens, a government-kept record of all Indian citizens, implemented in India’s northeastern state of Assam. The register was criticised after almost two million people were found to have been omitted in its August 2019 release, effectively stripping the state's large minority of Muslims of citizenship, as reported by AFP here on September 2, 2019.", "The video was also shared in posts here, here, here and here on Facebook, and here, here and here on Twitter with a similar claim.", "The claim is false; the video has circulated online since at least May 2016 in reports about a protest unrelated to the NRC.", "The reports stated the protest was called by Sikh organisations in response to a Hindu nationalist party's proposals for a public gathering in the northern Indian city of Amritsar.", "A Google reverse image search of keyframes extracted from the video using digital verification tool InVID found the same clip published here on YouTube on May 25, 2016.", "Below is a screenshot comparison of two frames from the video in the misleading posts (L) and the YouTube video (R):", "Protesters in the video can be heard chanting “Long live Khalistan” 35 seconds into the video. Khalistan is the name of the proposed separate country that Sikh separatists seek to create in the Punjab region of India.", "The video caption reads: \"Live From Beas (Shiv Sena not Come to Amritsar)\".", "“Beas” refers to the Beas River, which ends in the Indian state of Punjab.", "Shiv Sena is a regional Hindu-nationalist political party in Maharashtra, India.", "A further Google keyword search found this news report on the protest published here by English-language newspaper Hindustan Times on May 25, 2016.", "Below is a screenshot of the Hindustan Times report:", "The report reads in part: “Even as Hindu right wing Shiv Sena had called off its Lalkar Rally about three days back, Sikh hardliners assembled at the proposed site - the Beas bridge - on the National Highway -1 on Wednesday to challenge them.", "“Amid heavy security arrangements, Sikh radicals from across the state started gathering on the bridge early morning. They raised slogans against the Shiv Sena and the state government.”", "The same protest was also covered by other Indian media, including Indian English-language daily newspapers The Times of India and The Tribune, in May 2016.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]