["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An activist expressed elation after Austin voters rejected a $1 billion rail-and-roads proposition, going on to say the rail part of the plan would have been a financial headache.", "Jim Skaggs, founder of Citizens Against Rail Taxes, told the Austin Monitor for a Nov. 5, 2014, news story, that the rail costs would have been imposed \"on a community already burdened by the fastest-growing tax increases of any major city in the nation.\"", "Mark Nathan, a consultant to Let’s Go Austin, which advocated for the proposition, asked us to check Skaggs’ claim.", "All aboard!", "To our inquiry, Skaggs said by email he believes he learned of Austin’s dubious status from an Austin Business Journal story. \"I do not have time to research it at the moment,\" Skaggs wrote Nov. 5, 2014.", "City spokeswoman: Mild rate changes", "We hunted unsuccessfully for such a story while to our nudge, a city spokeswoman, Melissa Alvarado, said by email the city does not track taxes in other jurisdictions. Alvarado also pointed us to a city chart showing its property tax rate mostly sliding from 1993 through 2009 and increasing or holding steady since:", "Source: \"Austin, Texas, Approved Budget 2013-14, Volume 1,\" page 19 (downloaded Nov. 24, 2014)", "Alvarado continued: \"Please keep in mind the city is only one taxing jurisdiction. There’s also the county, school district, health district and then more, depending on where exactly someone lives.\" Also, she said, appraisals \"are a factor for taxes, not just the tax rate.\" (She noted the 2015 tax rate is the same as the 2014 rate.)", "Indeed, surging property values are a driver in local government revenues, the Austin American-Statesman has noted; of late, an April 2014 news story quoted Travis County’s chief appraiser, Marya Crigler, saying taxable residential values — a home’s market value minus property-tax exemptions — were up an average of 8 percent for 2014. Changes in those values, the story said, influence government spending plans.", "Austin versus other big Texas cities", "Our search for a breakdown of changes in taxes among U.S. cities led us to analyst James Quintero of the conservative-leaning Texas Public Policy Foundation, who pointed out by email that since 2008, according to a graph in the city of Austin’s proposed fiscal 2015 budget, Austin residents have experienced a bigger burst in their share of income paid in city property taxes than residents of Dallas, Fort Worth, San Antonio or Houston.", "Specifically, Quintero said, the percentage of median family income spent on property tax bills for median-value homes in the Austin area represented a little less than 1.1 percent in fiscal 2008. In fiscal 2014, that figure had increased to just under 1.5 percent, representing an increase of 0.4 percent. The other big Texas cities demonstrated smaller increases over the period.", "National comparisons", "Then again, Skaggs said Austin’s tax increases were No. 1 among major cities nationally.", "We turned to Beverly Kerr, lead researcher for the Greater Austin Chamber of Commerce, who sifted information compiled by the Cambridge, Mass.-based Lincoln Institute of Land Policy. The institute, which focuses on property valuation and taxation policy, urban planning and development, land economics and property rights, annually issues a 50-state property-tax comparison study.", "Kerr, drawing from the latest study, issued in March 2014 by the center and the Minnesota Center for Fiscal Excellence, emailed us charts indicating numerous cities had significant property tax hikes in recent years and also that by one gauge, Austin ranked close to No. 1 nationally in its increases compared with the most-populous cities.", "One institute analysis looked at how much revenue per resident different cities have taken in.", "Our takeaways:", "From 2006 to 2011, per-person property tax revenue collected in Austin by all local government units (including school districts, the city and the county) decreased 4 percent, as measured in constant 2011 dollars. Then again, per-person revenue from city property taxes alone went up 6 percent; Austin ranked 35th among the 50 largest cities for that rate of increase. Higher rates of increase were recorded by cities including Philadelphia, Houston, Dallas, New York, San Francisco, San Jose, Los Angeles and Chicago, which had a 60 percent spike in per-person property tax revenue.", "Over a longer span, 2001 to 2011, Austin ranked 27th nationally for its 26 percent increase in per-person revenue from city property taxes. The Texas capital was outpaced in percentage growth by cities including San Antonio, Houston, Dallas, Fort Worth, New York and Los Angeles.", "Austin experienced a 2 percent increase in per-person revenue from all taxes from 2006 to 2011, ranking 25th in this way. Its increase trailed hikes occurring in the more populous cities of San Jose, Dallas, Houston, Philadelphia and Los Angeles.", "Another institute breakdown highlighted by Kerr shows Austin ranking among cities with the greatest increases in taxes on a median-valued home.", "Our snapshots:", "From 2009 to 2013, Austin’s effective tax rate on a median-priced home increased from 1.93 percent to 2.22 percent; that bump amounted to the 11th-greatest increase (0.29 points) in the 50 biggest cities. As of that year, Phoenix, Philadelphia, Jacksonville and Chicago were the cities more populous than Austin that ranked higher by this indicator. In this instance, the effective rate is not the rate by which a government unit can generate the revenue it raised the year before. Rather, the study defines the effective rate as the total tax on a median-priced home divided by its total value, which takes into account variations in assessment rates and value exemptions across localities. While Austin’s effective tax rate in 2013 was ahead of its rate in 2009, it was less than the 2.44 percent rate of 2005.", "In 2013, property taxes on a median-value Austin home ran $1,049 ahead of those taxes on such a home in 2005, up nearly 26 percent. That percentage increase placed Austin 10th nationally in this way behind Portland, San Jose, Denver, Philadelphia, Oklahoma City, Tulsa, Albuquerque, Columbus and Cleveland -- and only San Jose, Portland and Philadelphia had greater dollar increases than Austin. Among, say, the 15 largest cities as of that time, Austin ranked third behind San Jose and Philadelphia for the percent change in net tax 2005-2013. Over a shorter period, 2009-2013, Phoenix, San Jose, San Francisco, San Diego, New York and Jacksonville experienced greater increases in net property tax on a median-value home. (Dallas, Chicago, San Antonio, Los Angeles, Philadelphia, Houston and Indianapolis had smaller increases.)", "Our ruling", "Skaggs said Austin has the fastest-growing tax increases of any major U.S. city.", "Among the nation’s largest cities, Austin appears to have had the third-fastest growth in its property-tax bite on a median-valued home from 2005 to 2013. It seems reasonable to speculate local taxpayers feel the pinch.", "However, Skaggs didn’t provide nor did we find a sign of Austin ranking first in tax growth among the country’s major cities.", "We rate the statement False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"Austin rejects bond for urban rail by wide margin,\" the Austin Monitor, Nov. 5, 2014", "Email, Melissa Alvarado, interim media relations manager, City of Austin, Nov. 7, 2014", "News story, \"Travis County taxable home values rise 8%,\" Austin American-Statesman, April 24, 2014", "Email (excerpted), James Quintero, director, Center for Local Governance, Texas Public Policy Foundation, Nov. 7, 2014", "Study, \"50 – State Property Tax Comparison Study,\" Lincoln Institute of Land Policy and Minnesota Center for Fiscal Excellence, March 2014 (downloaded Nov. 24, 2014)", "Charts, \"Tax Revenue Per Capita and Property Tax Revenue, Constant 2011 Dollars,\" \"Top 50 Homestead Property Taxes for a Median-Value Home, 2005, 2009, 2013,\" information downloaded from the Lincoln Institute by Beverly Kerr, vice president, Research, Greater Austin Chamber of Commerce (received by email Nov. 19-24, 2014)", "Telephone interview, Sally Powers, visiting fellow, Department of Valuation and Taxation, Lincoln Institute of Land Policy, Cambridge, Mass., Nov. 25, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]