["The photo was published here on Facebook on December 18, 2020.", "The Indonesian-laguage text on the photo translates into English as “PRAISE BE TO GOD FOR THE FIRST TIME CHRISTMAS TREES INSTALLED IN THE YARD OF INDONESIAN STATE PALACE! Since Indonesia’s Independence in 1945! JOKOWI’S government IS AMAZING.”", "The Indonesian-language caption of the post reads: “On every major religious day of the 6 religions that are legal in Indonesia, hopefully every religious symbol will be installed in front of the state palace, as a form of tolerance between religious communities.”", "Joko Widodo, commonly known by his nickname Jokowi, is the current president of Indonesia. More than 87% of the country’s population is Muslim.", "The State Palace is part of the presidential palace complex in Jakarta.", "The photo has also appeared alongside a similar claim here, here, here and here.", "This photo, alongside a similar claim, has circulated in posts going as far back as 2014, on Facebook here and here, and on Twitter here.", "A reverse image search on Google, followed by a keyword search, found the photo was previously published here in a report from an Indonesian Islamic news blog site, Portal Islam, on December 22, 2014.", "The blog post’s title reads: “There Are 3-Metre-High Christmas Trees at Ahok’s Office.”", "The report’s first paragraph reads: “Christmas decorations in the form of bright trees appeared in front of Ahok’s official residence at Taman Surapati and at Jakarta City Hall.”", "Ahok is the nickname of Basuki Tjahaja Purnama, Jakarta governor from 2014 to 2017, and the first Chinese Christian who ever held the position.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo on the Portal Islam blog (R):", "The building in the photo corresponds with Google users' photos tagged at the location of Jakarta City Hall on Google Maps, such as this one and this one.", "Other Indonesian news outlets, such as Detikcom and Tribunnews, also reported about the Christmas trees installed at the Jakarta City Hall and published similar photos on December 22, 2014. Ahok told the media that the idea to install the Christmas tree came from “the Christmas committee”.", "An image of the Indonesian State Palace on Google Maps can be seen here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]