["President Joe Biden ran his presidential campaign on the underlying promise that he would be an entirely different leader than Donald Trump. In keeping with that, following his Jan. 20 inauguration, Biden's administration has been unravelling Trump's policies.", "Since he took office, Biden has signed more than 40 executive orders and actions with focuses ranging from health care to the economy.", "Some orders, like the reversal of Trump's ban on transgender people joining the military, undid work from the previous administration. Many others relating to the coronavirus are exclusive to advancing the goals of the new administration.", "Biden's slew of executive orders has been met with pushback from conservatives, against both the number of orders issued and the president's past quotes about them.", "For instance, both Senate Minority Leader Mitch McConnell and Fox News personality Sean Hannity have misquoted Biden in trying to use his own words against him. The incorrect quotation has been picked up in viral social media posts that also compare executive orders among Biden and his predecessors.", "One Facebook post shows a graphic of the last five presidents and how many executive orders they signed during their first week in office, which for each would be Jan. 20-27. At the bottom is a quote attributed to Biden: \"You can't (legislate) by executive order unless you're a dictator.\"", "A similar post says Biden signed 37 executive orders in his first week, Barack Obama signed nine and Trump signed five. There is also a quote attributed to Biden that reads, \"Only a Dictator legislates through executive orders!\"", "USA TODAY has reached out to both users for comment.", "Let's look into both the numbers and the quote in question.", "More:Fact check: Biden executive order halts border wall construction, redirects funding", "Biden has now signed more than 40 executive orders, actions and memorandums — each of which has a different power and purpose — during his first few weeks in office. Of those, 29 are executive orders, according to the Federal Register.", "Social media posts about the number of executive orders signed by Biden in his first week vary. For example, this post says he signed 32, while this one says he signed 37.", "The first post, which cites NBC News as its source, compares Biden's orders to four past presidents; the second post only includes totals for Obama and Trump.", "In their first week in office, Trump signed five orders, Obama signed five, George W. Bush signed zero and Bill Clinton signed zero. In Biden's first week, he signed 24 executive orders, all according to the Federal Register.", "The Federal Register publishes regulations, proposed rules and notices of interest to the public every weekday.", "On top of Biden's 29 orders, he has signed 14 proclamations and memorandums, bringing the grand total of executive actions to 43 as of Feb. 8.", "Both posts were slightly off in their final tallies of executive orders signed by Biden and other former presidents in their first week in office.", "It's worth noting that Biden explicitly campaigned on a promise to sign executive orders — both targeted at reversing Trump policies and addressing the coronavirus — if he was elected.", "For example, the orders Biden signed on climate action fulfill the campaign promise that is still on his website, \"On day one, Biden will sign a series of new executive orders with unprecedented reach that go well beyond the Obama-Biden Administration platform and put us on the right track.\"", "Of the signed actions, 18 have been reversals of Trump administration policy.", "Prominent conservatives have expressed their disapproval of Biden's use of executive orders and actions, and have attempted to use his own words against him.", "On his Jan. 26 show, Hannity said, \"Biden signed off on a record number of executive orders during his first week but just three months ago, according to Biden himself, that's something only a dictator would do.\"", "And in the Senate, McConnell said, \"As recently as October, now-President Biden said you can't legislate by executive action unless you are a dictator. Well, in one week, he signed more than 30 unilateral actions.\"", "Biden's comment about executive orders and dictators is from an October town hall hosted by ABC News.", "The full quote was in defense of his tax plan, following a comment from host George Stephanopoulos. \"So, there's not going to be any delay on the tax increases?\" he asked, referencing Biden's plans to raise taxes on corporations and the wealthy and Biden's answer to previous questions.", "Biden replied: \"No, well, I've gotta get the votes. I gotta get the votes. That's why — you know, the one thing that I — I have this strange notion. We are a democracy. Some of my Republican friends and some of my Democratic friends even occasionally say, 'Well, if you can't get the votes, by executive order you're going to do something.' Things you can't do by executive order unless you're a dictator. We're a democracy. We need consensus.\"", "Biden's comment was not about the use of executive orders in general, but was instead related to the use of executive orders to legislate what he said he believes should require approval from Congress.", "The quote has been twisted to imply that he believes the use of executive orders in general is bad.", "The claims in the post have been rated as MISSING CONTEXT. Biden has signed more executive orders — 29 orders and 14 proclamations and memorandums —  in the first weeks of his presidency than previous presidents, but the quote in question has been taken out of context. Biden's comment about executive orders and dictators was made in response to a question about his tax plan and how he believes that some legislation requires the support of Congress, meaning that presidents should avoid using executive orders in those instances.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]