["“Trudeau lashes out against seniors that don’t agree with his world view,” claims a meme shared on “Justin Trudeau Not,” a Facebook page dedicated to the prime minister and whose content AFP has previously debunked.", "Next to a black-and-white photo of a laughing Trudeau, a quote attributed to the Liberal Party prime minister reads: “These people generally don’t believe in climate change, green initiatives, basically anything we’re trying to do to save the planet that they won’t be around for. So why are we letting them ruin it for the rest of us?”", "The meme is based on a now-deleted article from the Cultural Action Party of Canada, a website debunked by AFP in the past. According to the article, the prime minister spoke ill of seniors during a visit to the Atlantic province of New Brunswick. He declared that seniors over the age of 85 would no longer be allowed to cast votes in the next federal election, due to their views on climate change.", "However, Trudeau did not utter the words attributed to him and seniors will still be able to cast ballots in the election.", "The now-deleted report cited “an alternative media,” linking to a November 2019 article from The Manatee, a New Brunswick-based satirical website that writes about Canada’s Atlantic provinces.", "The quotes attributed to Trudeau are directly lifted from The Manatee’s article, which is pure fabrication, its author Alex Vietinghoff told AFP by email.", "“My article is entirely satirical and made-up! The piece was inspired by stories I saw shared on Facebook at the time of the election (in October 2019), of elderly poll workers mixing up ballots and votes being spoiled by accident,” Vietinghoff said.", "Satirical articles from The Manatee have misled the public in the past, such as when online users believed that smoking in public before 8:00 pm would become illegal in New Brunswick.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]