["About this rating", "On 26 July 2017, supplement and paranoia peddling website NaturalNews.com made a sweeping conclusion about climate change based on a portion of a single chart they found. The post, by Mike \"Health Ranger\" Adams, uses a time series of satellite sea level data from the National Aeronautics and Space Administration to argue that climate change is no big deal and that the “mainstream media” is ignoring data that proves him right:", "NASA’s own data reveal that world-wide ocean levels have been falling for nearly two years, dropping from a variation of roughly 87.5mm to below 85mm.", "These data, of course, clearly contradict the false narrative of rapid, never-ending rising ocean levels that flood continents and drown cities — a key element of the climate change “boogeyman” fiction that’s used to scare gullible youth into making Al Gore rich.", "To \"prove\" this, Adams points to NASA’s satellite altimetry data — used by scientists to precisely measure global average sea level change since 1993 — which he says busts the whole global warming thing wide open, despite its fairly unambiguous long-term upward trend:", "The NASA chart allegedly showing that sea level is not rising. Credit: NASA.", "The region of the chart — around the last two years of the record — that allegedly proves global warming is a lie is highlighted above. It shows a period of generally flat sea level rise. Astute chart readers, however, may note that there have been a number of times throughout the record in which sea level rise has been flat, or even briefly reversed, before continuing the more dominant rising trend. According to University of New South Wales climatologist and sea level expert John Church, this is the reason the \"media\" is \"silent\" on the issue; in fact, it is in no way newsworthy:", "The short term fall over the last year or so reported on the Natural News website is nothing out of the ordinary and in fact the fall seems less than several previous examples of sea level fall, such as [the drop documented in 2010-2011].  It does not seem to be a particularly noteworthy event.", "To understand why the event is not noteworthy, one needs to understand both the short- and long-term drivers of sea level change. From a long-term global perspective, there are two primary drivers of sea level rise: the first is the balance between water trapped in ice and water contained within the ocean itself. Simply put, when ice that is trapped on land melts, it increases the volume of water in the ocean, causing sea level to rise.", "The second major driver is known as thermal expansion — when water gets warmer it expands, increasing its volume. Research suggests that these two contributors alone explain 75 percent of the observed sea level rise since 1971.", "These larger trends, however, can be dampened (or enhanced) by shorter term weather patterns. The most important factors to consider on this time-scale are the El Niño-La Niña cycle (which affects both water temperature, as well as evaporation and precipitation of moisture) and the hydrological issues associated with where rainwater falls on land. The best illustration of these factors combining to alter the overall trend of sea level rise is the 2010-2011 drop in sea level mentioned above.", "In this instance, the confluence of La Niña and a number of other atmospheric circulation patterns forced an anomalously large amount of rain to fall over the uniquely bowl-shaped continent of Australia, as described by Scientific American:", "In most cases, though, water that falls on land eventually drains into the ocean. Even if a whole lot of rain fell in South America's Amazon, for example, it could slow sea-level rise for only about a couple of months, as it slowly made its way to the sea.", "So in order to make sea levels fall, the water had to be stored in a place where it didn't reach the ocean for a long while. That place, it turns out, was Australia. [...]", "Lake Eyre is the lowest point in Australia. It's usually a dry, salty flat. But when it rains heavily, the basin fills, and the lake teems with new life, as long-dormant seeds spring to life and birds flock to the lake.", "From 2010 to 2011, enough rain fell on Australia to fill the lower part of the lake almost completely, and the upper portion at least 75 percent. Australia got about a foot of rain more than normal over that period, said [National Center for Atmospheric Research scientist John] Fasullo.", "The continent stored that excess water for long enough to change global sea levels.", "That the world's smallest continent can affect global sea levels this way is pretty extraordinary, said Fasullo. It's also rare. [...]", "In addition to La Niña, other climate variations also played a role. Together, they forced the extraordinary rainfall and water storage in the Australian continent.", "Eventually, of course, this water evaporates and returns to the ocean, where it joins the expanding and increasing global ocean reservoir. We spoke to Fasullo — the lead author on the study that documented the cause of the 2010-2011 drop in sea level — about this current hiatus, and he told us it in no way conflicts with our understanding of the connection between global warming and sea level rise:", "Of course, this leveling does not conflict with our understanding of sea level rise and its main drivers. It is well known for example that sea level falls (in an anomalous sense) at the end of an El Niño due to drought subsiding over many tropical land areas such as the Amazon (water moves from the ocean to land surface) and heat being released from the ocean (as the tropical upper Pacific Ocean releases heat to the atmosphere, causing contraction).", "[The] recent leveling of sea level rise comes on the heels of an unprecedented rate of rise during the four years that preceded it (2011-14). In addition to global warming, this rise was also strongly influenced by the El Niño-La Niña cycle and so it too should not be oversold.", "Ultimately, the story published by Adams attempts to disguise a weather as a climatological trend, University of California, Santa Cruz Climatologist Gary Griggs told us:", "One or two or three years of weather means very little in the long-term record of sea-level rise just as it would have very little meaning for global temperature records. Due to a variety of atmospheric circulation patterns and variations, temperatures vary from year to year as does rainfall, etc., the recent 4 year drought in the west is a good example.", "Using two years of data to make sweeping claims about trends in the global climate system, especially when such fluctuations are known and understood by science, is misleading and inaccurate, and as such we rank this claim as false.", "Adams, Mike.   \"NASA Confirms: Sea Levels Have Been Falling Across the Planet for Two Years … Media Silent.\"\r\n    Natural News.   26 July 2017.", "NASA.   \"Understanding Sea Level\"\r\n    Accessed 1 August 2017.", "IPCC.   \"Climate Change 2014: Synthesis Report. Contribution of Working Groups I, II and III to the Fifth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, R.K. Pachauri and L.A. Meyer (eds.)]\"\r\n    2014 (Chapter 13).", "Boening, Carmen, et al.   \"The 2011 La Niña: So Strong, the Oceans Fell.\"\r\n    Geophysical Research Letters.   4 October 2012.\r\nOgburn, Stephanie Page.   \"A Scientist Explains the Mystery of Recent Sea-Level Drop.\"\r\n    Scientific American.   20 August 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]