["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After months of debate, the Democrat-controlled Illinois General Assembly recently approved a measure placing a question on the 2020 ballot asking voters to lift the state’s constitutional ban on taxing different income levels at different rates.", "We’ve reviewed a number of exaggerated claims from both sides about the effects of a graduated rate structure, which is backed by Gov. J.B. Pritzker and opposed by Republican lawmakers and prominent state business groups. With the question headed for the ballot box next year, supporters and detractors alike have plenty of time to continue making their case for or against switching out the state’s flat-rate income tax, which is currently set at 4.95%.", "Several days before the measure passed the legislature, a group of Republican House lawmakers held a press conference to voice their concerns. One freshman who spoke out against the plan pointed to New York as a cautionary tale, citing remarks from that state’s Democratic governor.", "\"Gov. [Andrew] Cuomo of New York said, ‘tax the rich, tax the rich, tax the rich. God forbid the rich leave,’\" said Rep. Mike Murphy of Springfield. \"When they implemented a program similar to this, they had a 2 to 3% shortfall in their (revenue) forecast because of the outward migration of their top earners.\"", "We confirmed with Murphy that he was referencing comments Cuomo made in early February when he announced New York tax collections came in $2.3 billion below projections for December and January.", "When we spoke with Murphy by phone, he told us he got his information from an editorial published in February by Investor’s Business Daily. That piece focused on Cuomo’s warning that asking New York’s wealthiest earners to pay more was spurring them to decamp for lower-tax states.", "What Murphy neglected to mention during the press conference was that Cuomo wasn’t criticizing his state’s graduated income tax rate structure. Rather, Cuomo’s remarks were aimed at what he thought were the effects of economic uncertainties such as stock market volatility combined with new limits placed by a 2017 Republican-led federal tax overhaul on the deductibility of state and local income taxes.", "\"‘Implemented' might have been a poor word to use,\" Murphy told us after we pointed out that New York state income tax rates haven’t changed substantially in a decade. \"‘Continuing to’ would have been a better word, maybe.\"", "That argument holds up no better, however, because Cuomo himself provided no proof of the supposed exodus he described.", "Single filers in New York pay a rate of at least 6.85% on income over $215,400, according to the Tax Foundation. Illinois lawmakers are currently considering a bill that would begin applying higher rates to income greater than $250,000 if voters approve the constitutional change. Under that plan, which Murphy opposes, an Illinoisan making more than $750,000 annually would be charged a 7.99% rate on her or his entire income. Meanwhile, New York applies its highest rate of 8.82% to earnings above $1.07 million.", "Since New York raised state taxes on top-bracket earnings in 2009 to help close a budget deficit, the number of federal tax filers in that state with income greater than $200,000 has grown annually, data from the Internal Revenue Service show. And there were roughly 210,600 more filers reporting top incomes in 2016, the latest year for which data is available, than there were in 2006, before the Great Recession, when rates paid by high earners were lower.", "Indeed, Cuomo’s own warning relied on evidence his administration acknowledged was only sketchy.", "\"Anecdotal evidence suggests that high income taxpayers are considering changing their residence and that financial industry firms are looking at real estate outside of New York,\" read a slide included in his February presentation.", "And New York Comptroller Thomas DiNapoli noted collections could improve with state tax payments in April, a prediction that proved accurate.", "New York revenues dropped by $3.7 billion for the year ending March 31, records show, but by April as annual tax returns were filed there were clear signs of a rebound. Revenues from the personal income tax in New York were up 57 percent this April from the comparable month in 2018, according to a report from DiNapoli’s office.", "We ran Murphy’s claim by state finance expert David Merriman, who questioned the broader connection Murphy sought to make between high tax rates on top earners and out-migration.", "\"As far as we know, there’s very little mobility in response to these tax rates on very high income groups,\" said Merriman, who heads the Fiscal Futures Project at the University of Illinois and recently co-authored a report outlining the academic evidence on the subject.", "A recent Better Government Association analysis also found the number of high-income tax filers in Illinois grew during a period several years ago when Illinois’ flat income tax rate jumped a record 67%. That occurred despite warnings from critics that the tax hike would lead to a big exodus from Illinois of wealthy taxpayers.", "Citing remarks made in February by the governor of New York, Murphy claimed that when that state \"implemented a program\" to tax the wealthy at higher rates it saw a revenue shortfall \"because of the outward migration of their top earners.\"", "Cuomo did raise the specter of out-migration among the state’s better-off taxpayers when personal income tax revenues came in below projections early this year. But he blamed the drop on fallout from the Republican federal tax overhaul of 2017 and other factors, not graduated income tax rates in New York which haven’t been raised in a decade.", "What’s more, IRS data show the number of people filing with income greater than $200,000 in New York has increased every year since 2009 when New York raised rates on top earnings to levels similar to those currently under consideration in Illinois.", "We rate Murphy’s claim False.", "FALSE — The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "\"Graduated income tax question heads to ballot as House OKs constitutional amendment,\" Chicago Sun-Times, May 27, 2019", "Video: Rep. Murphy on taxes, May 22, 2019", "Video: Gov. Cuomo and Comptroller DiNapoli deliver revenue update, Feb. 4, 2019", "\"New York faces a shortfall of $2.3B in tax revenue and blames Washington,\" lohud, Feb. 4, 2019", "Phone interview: Rep. Mike Murphy, May 24, 2019", "State Individual Income Tax Rates: 2000-2014, Tax Foundation, accessed May 23, 2019", "State Individual Income Tax Rates and Brackets for 2019, Tax Foundation, Mar. 20, 2019", "\"Illinois House committee advances graduated-rate income tax plan approved earlier by Senate,\" Chicago Tribune, May 24, 2019", "Dataset: Individual income tax return statistics for New York, Internal Revenue Service, accessed May 24, 2019", "\"New York Millionaires Tell Albany: Tax Us, Please,\" New York Times, Feb. 12, 2019", "\"Albany Agrees on a Plan to Raise Taxes on Top Earners,\" New York Times, Mar. 28, 2009", "\"'Serious as a heart attack': Cuomo warns of falling state revenue,\" The Buffalo News, Feb. 4, 2019", "\"New York state tax revenues plummet by $3.7 billion,\" New York Post, April 19, 2019", "Monthly Report on State Funds, Office of the New York State Comptroller, April 2019", "Phone interview: David Merriman, director of the Fiscal Futures Project at the University of Illinois, May 24, 2019", "Report: Revenue Implications of Alternative Personal Income Tax Structures in Illinois, University of Illinois Institute of Government & Public Affairs, May 2019", "\"Poor left, rich thrived when Illinois hiked flat tax,\" Better Government Association, April 8, 2019", "Phone interview: Richard Auxier, research associate with the Urban-Brookings Tax Policy Center, May 29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]