["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this March 1, 2017, file photo, Reese's miniature peanut butter cups are displayed in Hershey's Times Square store in New York. Hershey's told the AP in September that a story claiming the company would discontinue the Reese's candy is false. (AP)", "A fake news story on Facebook stated that Reese’s peanut butter cups were scheduled to be removed from all store shelves by the end of 2017.", "\"World’s most popular candy to be removed from shelves by December 2017,\" stated a Dec. 18 headline on musclecarusa.info. The website is mostly about cars and had no contact information.", "\"RIP Reese’s peanut butter cups,\" said the article, which cited a news conference about declining sales that did not happen. \"Make sure to get you one before they are gone!\"", "Peanut butter cup lovers have no reason to panic -- the candy remains available.", "A Hershey’s spokeswoman, Anna Lingeris, told PolitiFact in an email that the story is inaccurate.", "\"Rest assured, the only people removing Reese’s products from shelves are consumers, who are taking them home to eat,\" she said.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news.", "Because we were curious, and a little hungry, we researched whether Reese’s is the world’s most popular candy. Lingeris told PolitiFact that Reese’s is the No. 1 franchise in the candy-mints-gum category based on dollar sales, according to IRI Market Advantage, a market insights and analytics provider. We contacted IRI directly to confirm the information but did not get a response.", "It’s fake news that the peanut butter cups were slated for removal from store shelves. We rate this headline Pants on Fire.", "Muslecarusa.info, \"World’s most popular candy to be removed from shelves by December 2017,\" Dec. 18, 2017", "Business Insider, \"The Fascinating Rise Of Reese's Peanut Butter Cups,\" June 30, 2013", "Amazon, \"REESE'S Peanut Butter Cups: The Untold Story: Inventor, H.B. Reese,\" Nov. 19, 2008", "Fox News, \"America's favorite chocolate candies,\" May 19, 2015", "IRI, \"The Hershey Company Selects IRI as Its Market Insights and Analytics Provider,\" Aug. 1, 2017", "Interview, Anna Lingeris, The Hershey Company​ spokeswoman, Jan. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]