["By Saranac Hale Spencer", "Posted on February 11, 2020 | Updated on October 10, 2023", "Online posts have claimed to reveal various “cures” for the novel coronavirus. Some are benign, like eating boiled garlic, while others are potentially dangerous, like drinking chlorine dioxide, an industrial bleach. Neither will cure the virus.", "Treatments billed as miracle cures have cropped up across the internet since the novel coronavirus began spreading in Wuhan, China, at the end of December.", "One rumor claims that boiled garlic can cure the virus. Another says that loading up on vitamin C will do the trick. Yet another would have people, essentially, drink bleach.", "None of these “cures” will treat the virus.", "We’re addressing each of these widely circulated claims in separate articles, starting with the most dangerous one — the claim that drinking chlorine dioxide will cure the virus.", "Chlorine dioxide kits are sold online under various names — Miracle Mineral Solution, Miracle Mineral Supplement, Master Mineral Solution — but they are most often referred to as MMS.", "These kits typically include a bottle of sodium chlorite and a bottle of an “activator” such as citric acid. When the two chemicals are mixed together, they make chlorine dioxide, a common industrial bleach used in the production of paper products, according to the federal Agency for Toxic Substances and Disease Registry.", "But MMS hucksters sell the chemical solution as a cure-all for cancer, AIDS, autism and, now, the novel coronavirus.", "One popular conspiracy theorist, Jordan Sather, wrote on Twitter: “‘NO KNOWN CURE FOR CORONAVIRUS’, they say. Well, it sure sounds like chlorine dioxide could wipe it out.” He directed his 116,000 followers to a website called Keavy’s Corner, which posted a banner at the top of its site telling customers, “We are experiencing high order volume that has us a few days behind on shipping.”", "Keavy’s Corner, based in Florida, didn’t respond to an email seeking comment.", "Another major proponent of MMS, Kerri Rivera, posted a story on her website under the headline: “Good News: Coronavirus Destroyed By Chlorine Dioxide.” Rivera primarily advocates for the use of MMS in treating autism. She was effectively barred in 2015 from selling chlorine dioxide for the treatment of autism in Illinois. But she is still active online and said in her recent post, “We already know CD is safe for ingestion by people, and has been used for helping the body heal from any number of health conditions including autism, malaria, herpes and AIDS.”", "None of that is true. The U.S. Food and Drug Administration and similar agencies in the U.K., Canada, New Zealand, South Africa, and Australia, have warned against the use of MMS.", "In August 2019, the FDA issued this warning:", "FDA, Aug. 12, 2019: Drinking any of these chlorine dioxide products can cause nausea, vomiting, diarrhea, and symptoms of severe dehydration. Some product labels claim that vomiting and diarrhea are common after ingesting the product. They even maintain that such reactions are evidence that the product is working. That claim is false.", "Moreover, in general, the more concentrated the product, the more severe the reactions. The FDA has received reports of consumers who have suffered from severe vomiting, severe diarrhea, life-threatening low blood pressure caused by dehydration, and acute liver failure after drinking these products. If you have had a negative reaction to any of them,  consult a health care professional as soon as possible.", "While MMS is available on websites that look like herbal medicine dispensaries, like Keavy’s Corner, it is also described as a “sacrament” by an organization that calls itself the Genesis II Church.", "Genesis II appears to have been one of the first major proponents of MMS. One of its founders, Jim Humble, claims to have discovered the solution in 1996 and Genesis II members push the use of MMS in online videos and self-published books, some of which are available on Amazon. Humble did not respond to an email seeking comment.", "Shane Hawkins, who is listed as a reverend on the Genesis II website, was sued by the state of Texas and barred in 2017 from selling MMS. The state sued Hawkins after he charged $500 for admission to a series of “seminars” on the use of MMS at Houston-area hotels.", "Hawkins isn’t the only person who has been to court for the sale MMS. Louis Smith, of Spokane, Washington, faced criminal charges in federal court for selling MMS on a website called Project GreenLife. He was convicted in 2015 and sentenced to more than four years in prison.", "And, in 2018, Stanley Nowak pleaded guilty in Canadian court to selling MMS, an unauthorized drug under Canadian law.", "Despite warnings from government health agencies and legal consequences for direct sellers, pitches for MMS continue to get attention in conspiracy-theory and anti-vaccine circles online.", "That’s likely because, like a lot of long-running conspiracy theories and scams, there’s a grain of truth to MMS. Chlorine dioxide is used as a disinfectant in municipal water treatment, so people can ingest trace amounts of the chemical. But the Environmental Protection Agency has set a maximum allowed level of 0.8 milligrams per liter. The dropper bottles used for MMS, however, serve 3 to 8 milligrams per drop, according to one medical journal. Humble recommends drinking six drops in a half-cup of water and then drinking the same amount an hour later to treat the coronavirus. That’s about 200 to 500 times the maximum amount set by the EPA.", "The effect of drinking higher amounts of chlorine dioxide from MMS kits has been documented in medical journals by doctors who have treated patients who drank it. A 75-year-old man in New York who tried to treat his prostate cancer with MMS ended up spending four days in the hospital and received a blood transfusion. A 2-year-old in Nashville drank from a bottle of MMS and was twice hospitalized, requiring two blood transfusions. And a 27-year-old woman in Birmingham, Alabama, accidentally drank two-and-a-half ounces of MMS instead of two drops and spent two days in the hospital.", "The FDA has warned against using MMS since 2010 and reiterated in a statement to FactCheck.org that “the FDA recommends consumers do not ingest these products.” The statement, provided by spokesperson Jeremy Kahn, went on to say, “We understand people are concerned about the spread of the novel coronavirus and we urge people to talk to their health care provider about treatment options.”", "Update, Oct. 10: Mark Grenon, a co-founder of Genesis II, and his three sons — Jonathan, Jordan and Joseph – were found them guilty of conspiring to defraud the U.S. government by distributing MMS as a cure for COVID-19 and other diseases. On Oct. 6, the judge sentenced Jonathan and Jordan Grenon to 12 and a half years in prison and Mark and Joseph Grenon to five years.", "Update, April 10: Phrasing for the novel coronavirus has changed since we first posted this story. We updated the original phrasing to reflect that.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "U.S. Food and Drug Administration. “Danger: Don’t Drink Miracle Mineral Solution or Similar Products.” 12 Aug 2019.", "Agency for Toxic Substances and Disease Registry. Public health statement. Chlorine Dioxide and Chlorine. Sep 2004.", "State of Illinois County of Cook in The Matter of: Kerri Rivera. Investigation number: 2015-HCL-241.", "“Seller of ‘Miracle Mineral Solution’ Sentenced to Prison for Marketing Toxic Chemical as a Miracle Cure.” Press release. U.S. Department of Justice. 28 Oct 2015.", "The State of Texas v. Shane Hawkins. No. 2016-29921. District Court of Harris County, Texas. 27 Jun 2017.", "U.S. Environmental Protection Agency. Drinking Water Treatability Database. Chlorine Dioxide.  Accessed 6 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]