["By Eugene Kiely", "Posted on March 11, 2020", "On the night of the Michigan primary, Eric Trump falsely claimed that on his father’s watch “[m]ore manufacturing jobs have been created in Michigan than just about every state.” Instead, manufacturing jobs over the last three years have increased in Michigan by less than 2% — half the national average.", "Even worse, the state lost 5,300 manufacturing jobs last year. That’s the first decline in manufacturing jobs in the state since 2009, according to Bureau of Labor Statistics data.", "The president’s son also boasted that “auto manufacturers are going back to Michigan,” when in fact there’s been a net loss of three automotive manufacturing plants since the end of 2016, according to the independent Center for Automotive Research.", "Eric Trump made his remarks on Fox News on the night of presidential primaries in six states, including Michigan. Donald Trump won Michigan in 2016 by only 10,704 votes — a little more than two-tenths of 1% — over Democratic presidential nominee Hillary Clinton.", "Michigan is a key swing state that President Trump needs to win reelection, and polls show him in a tight race against either former Vice President Joe Biden or Sen. Bernie Sanders.", "The president has been counting on a strong economy to bolster his reelection chances in swing states like Michigan, but the new coronavirus pandemic has caused global economic disruption that threatens the U.S. economy.", "In recent days, President Trump has talked about a stimulus package to lessen the impact of the new coronavirus on the nation’s economy. Fox News anchor Bret Baier asked Eric Trump, the second oldest of the president’s sons, what an economic decline would mean for the president’s reelection chances in Michigan.", "Eric Trump boasted about the economy, in general, but then spoke specifically about Michigan — calling the growth of manufacturing jobs in the state “unbelievable.”", "Eric Trump, March 10: More manufacturing jobs have been created in Michigan than just about every state. I mean, it’s unbelievable. Auto manufacturers are going back to Michigan for the first time. My father has a great story to tell, not just in Michigan, but in Pennsylvania and Ohio — quite frankly, in all of the swing states.", "In fact, Michigan’s manufacturing job growth has been pedestrian, not “unbelievable.”", "We ranked the states by manufacturing job growth in Trump’s first three years, and found that Michigan ranks 37th, using BLS data for each state. The state had 616,800 manufacturing jobs in January 2017, when Trump took office, and 628,900 as of December 2019, according to the most recent BLS data. That’s an increase of 12,100 jobs, or 1.96%.", "As the map below shows, the growth of manufacturing jobs was about the same in Ohio (1.99% growth, ranked 35th) and even worse in Pennsylvania (0.69%, ranked 45th) — the two other swing states that Eric Trump mentioned.", "Among Michigan’s nearby states, Illinois has the highest growth rate (2.9%, ranked 29th), while the lowest was Indiana (1.51%, ranked 40th).", "The growth in manufacturing jobs has been greatest in the southern and western parts of the country, including Nevada, Arizona, Texas, Wyoming, Oregon and Utah — which have all seen growth of more than 8%.", "Eric Trump also boasted that “auto manufacturers are going back to Michigan for the first time.” That’s not true, either.", "Kristin Dziczek, vice president of industry, labor and economics at the Center for Automotive Research, told us that there is only “one new automaker facility going up in the state.” And in that case, Fiat Chrysler Automobiles is actually converting an engine plant to a vehicle assembly plant — “so plant count [is] unchanged by this move.”", "In its press release announcing the move a year ago, Fiat Chrysler said it would “convert the two plants that comprise the Mack Avenue Engine Complex into the future assembly site for the next-generation Jeep Grand Cherokee.”", "And, while Fiat Chrysler retools that plant for reopening in December, the automaker closed its Conner Avenue assembly plant in Detroit in 2017. That was one of three plant closures in Michigan since Trump took office.", "General Motors closed a transmission plant in Warren, Michigan, in August, and Ford Motor Co. and the United Auto Workers agreed as part of a new contract ratified in December to close an engine plant in Romeo, Michigan.", "That’s a net loss of three automotive manufacturing plants in Michigan since the end of 2016, Dziczek said, “if we count Mack Assembly as operational, which it isn’t planned to start production until December 2020.”", "In addition, automaker investments in the past three years in Michigan have declined by 29% compared with the previous three years, Dziczek said. Such investments in the state totaled $15.8 billion from 2014 through the end of 2016 compared with $11.2 billion from January 2017 through January 2020.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]