["The claim was shared on the messaging app Line Messenger on August 10, 2020.", "The Thai-language message translates to English as: “Don’t buy or eat vegetables and fruits from the US… Singapore has forbidden people from doing so already. This is because the US used trucks that carry bodies of those infected with COVID-19 to carry food too, so the food will also be contaminated with the virus.”", "A similar claim was also shared here, here and here on Facebook.", "The claim, however, is misleading.", "In response to the misleading posts, the state-run Singapore Food Agency issued a statement on Facebook on July 28, 2020, saying that no such guidance had been issued.", "We are aware of posts circulating on social media making spurious claims that Singapore media has reported that fruits...", "The communique reads in part: “We are aware of posts circulating on social media making spurious claims that Singapore media has reported that fruits and food products exported from the United States (US), Europe and Brazil to Asia and Africa have been contaminated by the COVID-19 virus. SFA has not issued any statement discouraging consumption of imports from the US, Europe or Brazil.”", "There is insufficient scientific evidence that COVID-19 can be transmitted to humans through food, according to health experts worldwide.", "The Centers for Disease Control and Prevention (CDC), a national public health institute in the United States, issued this statement about coronavirus trasmission in March 2020. It says there is “no evidence to support transmission of COVID-19 associated with food”. Similarly, the European Food Safety Authority states here that there is “no evidence that food is a likely source or route of transmission of the virus”.", "During a phone conversation with AFP on August 13, 2020, Dr. Thira Worathanarat, an associate professor in the Department of Preventive and Social Medicine at Thailand’s Chulalongkorn University said: “There is no evidence that COVID-19 can be transmitted to humans via fruits and vegetables, but you always have to be careful. Clean your fruits and vegetables before you eat them, and it’s recommended that you eat well-cooked food.”", "Dr. Pokrath Hansasuta, an assistant professor of virology at Thailand’s  Chulalongkorn University, also said that while it may be “theoretically” possible for the virus to “exist on a food surface”, it is not always harmful.", "“It might be possible that the virus can exist on a food surface, but only at four degrees celsius. It also isn’t always the case. As long as you rinse your fruits and vegetables with water, it is safe,” he said.", "AFP Fact Check debunked a hoax that the novel coronavirus can be spread through fruits and vegetables here in April 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]