["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "On Feb. 13, 2021, the day before Valentine's Day, a tweet thread alleged an unidentified member of the Los Angeles Police Department (LAPD) used social media to share a photo of George Floyd with the words, \"You take my breath away.\"", "Around 7:30 p.m. EST, Jasmyne Cannick, a Los Angles-based political strategist, posted the tweets featuring a screenshot of what appeared to be an email written by LAPD Capt. Jay Mastick to everyone in LAPD's harbor patrol division. That email read, according to Cannick's screenshot:", "I just received word through the chain of command of a complaint that was generated on an inappropriate online post from a Department member (Division not disclosed).", "The post depicts a photo of George Floyd, with a caption, \"you take my breath away\" in a valentine format.", "Chief [Michel] Moore was disgusted by the post and directed that a Department complaint be generated.", "This was followed by an instruction that supervision reinforce the need for professionalism on our online behavior, as it is a reflection on all Los Angeles Police Officers. Messages with inappropriate content may also result in discipline.", "In other words, an officer filed an internal complaint about a colleague (whose division and rank remained unknown) engaging online with the image of Floyd in a \"valentine format,\" according to the alleged internal memo. It was unclear based on that evidence whether the complaint accused an officer of digitally creating the racist post or circulating it, perhaps via retweeting or Facebook-sharing someone else's content.", "Chief Michel Moore confirmed the authenticity of the above-displayed memo, and said the department was preparing to interview the officer who filed the complaint, according to The Washington Post.", "Hours after Cannick's tweets (which included a copy of the alleged post), LAPD said on Twitter that it indeed launched an internal investigation into allegations that the image was being \"passed around the department\" — a statement that suggested more than one officer was accused of seeing, or engaging with, the racist content.", "The tweets also said that department leaders directed supervisors to look for physical copies of the image at police headquarters, and that no evidence showed an officer used photo-altering technology to create the post.", "\"At this point the Department has not identified any actual postings in the workplace or identified that it was in fact our department employee who created the image,\" LAPD tweeted at 11:36 p.m.", "Around the same time, the Los Angeles Times published a story in which Moore said the department was hoping to determine exactly where and how the image may have come into the workplace, either online or otherwise, and who may have engaged with it.", "“Our investigation is to determine the accuracy of the allegations while also reinforcing our zero tolerance for anything with racist views,” Moore told the LA Times.", "In other words, it was true that LAPD on Feb. 13 announced an investigation to determine if, or to what extent, one or more officers created or circulated the racist image, though the outcome of that examination remained unknown.", "The department said it did not believe an employee created the content, though it did not publicly comment on whether one or more employees passed it around, either on social media or physically.", "On Feb. 15, Snopes reached out to Moore for more details about the internal investigation. An LAPD representative responded to that request via email:", "\"The Department is aware of the inappropriate post and a personnel complaint has been initiated. Due to a personnel matter we are unable to comment further.\"", "Additionally, we reached out to Cannick to learn how she obtained a copy Mastick's email, which seemingly sparked the public attention on the investigation, and she told us via email that a Black LAPD officer sent it to her for sharing \"because the department was trying to keep it hush hush.\"", "We asked LAPD for its response to the accusation that it was attempting to keep the internal complaint and subsequent investigation out of the public's eye. The representative wrote in an email:", "On May 25, 2020, Floyd, a 46-year-old Black man, died after one Minneapolis police officer knelt on his neck for more than eight minutes as he repeatedly said, \"I can't breathe.\" Floyd's death sparked protests denouncing systematic racism and police brutality against Black people across the U.S. and the world.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]