["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The United States did not give $3.7 million to a lab in China. That is an incorrect amount. The actual amount was just under $600,000.", "The money that was given was permitted. ​", "A virology lab in Wuhan, China, continues to draw scrutiny for work it did on bat viruses as part of American-funded research.", "To be clear, there is no sign that the coronavirus that has swept around the globe was bioengineered, but suspicions run high, including from President Donald Trump’s lawyer Rudy Giuliani.", "Giuliani tweeted April 26, \"Why did the US (NIH) in 2017 give $3.7m to the Wuhan Lab in China? Such grants were prohibited in 2014. Did Pres. Obama grant an exception?\"", "Why did the US (NIH) in 2017 give $3.7m to the Wuhan Lab in China?Such grants were prohibited in 2014.Did Pres. Obama grant an exception?", "To answer Giuliani’s question, no exception was granted, because none was needed.", "The policy that hit pause on certain research in 2014 didn’t apply to the sort of work that was being done in Wuhan.", "Giuliani’s wrong about what the policy was, and he’s wrong about the dollars that went to the Wuhan lab.", "Let’s unpack this.", "In the summer of 2014, a cardboard box of vials labeled Variola was found in an ordinary cold storage room on the campus of the National Institutes of Health in Bethesda, Md. The variola virus causes smallpox, and it had no place outside of a secure biological facility.", "In August 2014, the Obama administration called for a nationwide stand-down and review for all labs working with potentially deadly biological agents. On Oct. 17, 2014, the White House announced it would not fund new projects that involved a certain kind of research called gain-of-function.", "Like the phrase suggests, gain-of-function research boosts the ability of a pathogen to cause disease. Why would anyone want to do that, outside of building a biological weapon? Well, this sort of work can help spot potential threats and give researchers time to craft ways to thwart a new virus.", "Administration officials said that until they had new policies, this sort of work on viruses that cause influenza, MERS and SARS (two new diseases that had triggered pandemics) wouldn’t get new money, and they asked labs with research underway to hit pause.", "But the administration specifically let other research continue. The language is technical, but the key word is \"naturally.\"", "\"The funding pause will not apply to the characterization or testing of naturally occurring influenza, MERS, and SARS viruses unless there is a reasonable expectation that these tests would increase transmissibility or pathogenicity,\" the Oct. 17 policy said.", "The Wuhan lab worked with naturally occurring viruses.", "The Wuhan Institute of Virology was participating in a project led by the New York-based organization EcoHealth Alliance. That’s a nonprofit that aims to protect the people, land and animals in areas where viruses can jump from one species to another, as coronaviruses are known to do.", "In 2014, the U.S. National Institute of Allergy and Infectious Disease backed work that focused on bats in Yunnan province, about 800 miles southwest from Wuhan, on the border with Vietnam, Laos and Myanmar. Teams in the field gathered blood from bats and local residents. They sent the samples to Wuhan where the initial analysis took place.", "The point is, any viruses found emerged in nature.", "\"The policy would not prohibit government agencies from funding any and all research at Wuhan Institute of Virology,\" said Gregory Koblentz, George Mason University associate professor of biodefense.", "It’s possible, Koblentz said, that some work done as part of the larger U.S. project might have involved gain-of-function experiments, but whether those would fall under the specific types of gain-of-function research covered by the restriction was doubtful.", "\"To the best of my understanding, Mr. Giuliani’s claim is not consistent with reality,\" said  John Holdren, one of the architects of the Obama administration’s policy and a former assistant to the president for science and technology.", "The work the lab did for the project did not involve gain-of-function research, but it is possible that other projects at the lab did.", "Added Robert Kessler with the EcoHealth Alliance: \"We have not ever participated in gain-of-function research. Nor have we ever been funded to participate in gain-of-function research.\"", "Giuliani’s claim has another flaw — timing. The moratorium policy took effect October 2014. The grant was approved at the end of May, five months earlier.", "We reached out to Giuliani and did not hear back.", "Giuliani said the National Institutes of Health gave $3.7 million to the lab in Wuhan in 2017.", "The correct amount is $598,500, according to the EcoHealth Alliance.", "The NIH website shows that the total size of the grant was $3.4 million. About 15% of that went to the Wuhan lab. The grant was awarded in 2014, not 2017, as Giuliani said.", "Giuliani said that in 2017, the United States gave $3.7 million to the lab in Wuhan at a time when such a grant was prohibited.", "The grant was made in 2014, and the amount that went to the lab was a bit under $600,000.", "The grant restriction did not apply to identifying naturally occurring viruses, which is what the Wuhan lab did.", "We rate this claim False.", "Rudy Giuliani, tweet, April 26, 2020", "White House, Doing Diligence to Assess the Risks and Benefits of Life Sciences Gain-of-Function Research, Oct. 17, 2014", "FBI and Centers for Disease Control and Prevention, Joint investigation of vials labeled Variola, Aug. 8, 2014", "White House, Ensuring Biosafety and Biosecurity in U.S. Laboratories,  Aug. 18, 2014", "Bulletin of the Atomic Scientists, New pathogen research rules: Gain of function, loss of clarity, Feb. 26, 2018", "National Institutes of Health, Project: Understanding the risks of bat coronavirus emergence, accessed April 29, 2020", "USA Spending, EcoHealth Alliance, accessed April 24, 2020", "U.S. Health and Human Services Grant Tracking, Understanding the risk of bat coronavirus emergence, accessed April 30, 2020", "Virologica Sinica, Serological Evidence of Bat SARS-Related Coronavirus Infection in Humans, China, Jan. 8, 2018", "Washington Times, Anthony Fauci should explain '$3.7 million to the Wuhan laboratory', April 27, 2020", "RedState, Rudy Giuliani Slammed Dr. Fauci Over His Agency’s $3.7 Million Grant to the Wuhan Institute of Virology, April 26, 2020", "Email exchange, Gregory Koblentz, associate professor, School of Policy, Government, and International Affairs, George Mason University, May 1, 2020", "Email exchange, John P. Holdren, professor of Environmental Policy, Belfer Center for Science and International Affairs, Harvard Kennedy School, May 1, 2020", "Email exchange, Robert Kessler, communications manager, EcoHealth Alliance, May 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]