["Joe Biden on Sept. 12, 2019, during a Democratic presidential primary debate in Houston. (AP)", "Joe Biden claimed that a key difference between the administrations of Barack Obama and Donald Trump is that Obama didn’t \"lock people up in cages.\"", "During the Sept. 12 Democratic presidential debate in Houston, Univision anchor and debate co-moderator asked Biden why Latinos should trust him given the millions of deportations under Obama’s presidency, when Biden served as vice president.", "\"What Latinos should look at is, comparing this president to the president we have is outrageous, number one,\" Biden said. \"We didn't lock people up in cages. We didn't separate families. We didn't do all of those things, number one.\"", "We’ve noted that Obama did not have a policy to separate families arriving illegally at the border, and that separations under Trump happened systematically as a result of his administration’s policy to prosecute all adults crossing the border illegally.", "But Biden mentioned \"cages,\" specifically, and reporting from the time he was vice president described an enclosure for migrant children with that word.", "Controversial use of ‘cages’ description", "The term \"cages\" has continuously been used by Democrats in attacks against Trump and the detention of immigrants arriving at the border. The Trump administration says that the facilities it uses are not cages.", "The description has been used to refer to chain-link enclosures holding immigrants at border processing facilities during both the Obama and Trump administrations.", "Notably, critics of Trump’s \"zero-tolerance\" policy that resulted in family separations circulated a photo that purportedly showed children face down on the floor behind a chain-link enclosure during Trump’s tenure. However, the photo was from 2014 when Obama was president.", "Our fact-check showed the Associated Press photo was taken in 2014 at a Customs and Border Protection facility in Nogales, Ariz. The photo was used in an Arizona Republic article centered on an influx of children arriving at the border unaccompanied by a parent or guardian.", "The Arizona Republic article, in part, said:", "\"They are undocumented. They entered the country illegally. And when they were apprehended by U.S. Customs and Border Protection, they were shipped to Nogales from overwhelmed processing facilities in Texas.", "\"But they are still children in cages, not gangsters, not delinquents. Just children, 900 of them, in a makeshift border-town processing center that is larger than a football field.\"", "The article adds that the children are \"housed behind 18-foot-high chain-link fences topped with razor wire.\"", "Additional description of the enclosure said: \"Nylon tarps, tied to the fences, provide a modicum of privacy between the groups. They share the kind of portable toilets used at fairs and construction sites, placed inside the cages and vented with clothes-dryer hoses.\"", "Reporting from the Los Angeles Times in 2014 referred to enclosures keeping immigrant children as \"makeshift cages.\"", "Here are other 2014 photos, from Getty Images, of children kept within chain-link enclosures. For comparison, here’s a 2018 photo provided by Customs and Border Protection, of immigrants in a similar chain-link enclosure.", "Jeh Johnson, a former Homeland Security secretary during the Obama administration, in media interviews and at other forums has been asked about the use of cages during the Obama administration.", "During a June 2019 interview at an event by The Aspen Institute, Johnson was asked to speak about a photo that depicts him \"walking past what appears to be children in cages.\"", "\"Very clearly, chain link, barriers, partitions, fences, cages, whatever you want to call them, were not invented on Jan. 20, 2017, okay,\" Johnson said, adding that the photo was taken during a spike in the arrival of migrant children, and that under the law, children have to be transferred within 72 hours to the Health and Human Services department.", "\"But during that 72-hour period, when you have something that is a multiple, like four times, of what you’re accustomed to in the existing infrastructure, you’ve got to find places quickly to put kids. You can’t just dump 7-year-old kids on the streets of McAllen or El Paso. And so these facilities were erected, that one I think was a large warehouse, and they put those chain-link partitions up so you could segregate young women from young men from, you know, kids from adults, until they are either released or transferred to HHS. Is it ideal? Of course not.\"", "Johnson addressed the photo from 2014 again the next month on CBS’ Face the Nation.", "Johnson said in part, \"the partitions you see, some call them cages, are meant to separate the women from the men, the girls from the boys. But these were temporary.\"", "Our ruling", "Biden said the Obama administration \"didn't lock people up in cages.\"", "Immigration policies of Obama and Trump are very different. Trump’s administration implemented a policy that led to the separation of thousands of children from their parents. Obama did not have that policy.", "But for Biden to say that Obama’s administration did not put people in cages is inaccurate. Obama and Biden in 2014 saw an influx of children arriving at the border without a parent or guardian, and reporting from 2014 by the Arizona Republic referred to a chain-link enclosure holding children as \"cages.\" A former Homeland Security secretary under the Obama administration in interviews has acknowledged that some have described as \"cages\" the enclosures used during Obama’s tenure.", "There’s a debate on whether a chain-link enclosure is a \"cage\" and whether applying that term to those structures is subjective. But the term certainly was used in 2014 to describe enclosures used by Obama’ administration.", "We rate Biden’s claim False.", "PolitiFact, Donald Trump, again, falsely says Obama had family separation policy, June 21, 2019", "PolitiFact, Trump correctly tweets that Democrats mistakenly tweeted photo of child migrants being held in 2014, May 29, 2018", "PolitiFact, Website claims child immigrants kept in dog kennels, concentration camps. Here are the facts, June 22, 2018", "Los Angeles Times, Related story: Jeh Johnson says ‘no free pass’ for children after border crossings, June 25, 2014", "CBS, Transcript: Former DHS Secretary Jeh Johnson on \"Face the Nation,\" July 14, 2019", "YouTube, The Aspen Institute - Children in Cages are Not New, June 29, 2019", "Getty Images, Central Processing at McAllen Border Patrol Facility, June 17, 2018 photo from Customs and Border Protection", "Azcentral.com, First peek: Immigrant children flood detention center, Published 1:05 p.m. MT June 18, 2014 | Updated 9:06 a.m. MT Dec. 9, 2016", "DHS.gov, Myth vs. Fact: DHS Zero-Tolerance Policy, June 18, 2018", "Getty Images, U.S. Border Patrol Houses Unaccompanied Minors In Detention Center, additional photo, Sept. 8, 2014", "The Washington Post, Three dozen migrants with flu virus quarantined at Texas processing facility, May 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]