["Los Angeles Clippers owner Donald Sterling, right, and V. Stiviano, left, watch the Clippers play the Sacramento Kings during the first half of an NBA basketball game in Los Angeles. (AP)", "When Los Angeles Clippers owner Donald Sterling was outed for allegedly making racist comments, conservatives leapt to dig deeper and came up with a surprising find. Sterling is a Democrat.", "Or so they claimed. Matt Drudge tweeted to more than 264,000 followers: \"NYT informed the unwashed how Bundy is a Republican. Leaves out NBA Sterling is a Democrat.\"", "A recording of Sterling telling his girlfriend not to bring African-American friends to basketball games came on the heels of Nevada rancher Cliven Bundy suggesting blacks would do better as slaves. Hence, Drudge’s tweet comparing the two men.", "PunditFact adds its research to the work of several other news organizations to correct the record on Sterling. (Hat tips below.) He is a registered Republican, according to the Los Angeles County voter registry.", "As far as we can tell, the conservative website Daily Caller was the first to tie Sterling to the Democratic Party. It had an click-baiting item on Saturday that declared, \"Race hate spewing Clippers owner is Democratic donor.\"", "That article listed Sterling’s campaign contributions from more than 20 years ago. He spread a total of $4,000 among three Democrats, including former New Jersey Sen. Bill Bradley, Vermont Sen. Patrick Leahy, and California Gov. Gray Davis. According to public records, he has given no money to any candidate since.", "Shortly after midnight, the National Review Online posted that Sterling was a Democrat and then sometime later corrected itself. \"An earlier version of this post identified Sterling as a Democrat,\" the editor wrote. \"Although his political donations appear to have been exclusively to Democrats, his official party affiliation is not known.\"", "At about noon on Sunday, Drudge made his claim.", "In the wee hours, as Sunday became Monday, Los Angeles Times columnist Michael Hiltzik rebutted those statements. Hiltzik tweeted, \"What makes anyone think Donald Sterling is a Democrat? LA County records show him registered Republican since 1998.\"", "Mother Jones, Talking Points Memo and the Washington Post quickly made the same point during the day on Monday.", "Our ruling", "Drudge said Sterling is a Democrat. County records show that he is a registered Republican and has been for many years. His donations to Democrats took place two decades ago and were modest even by the standards of that time.", "We rate the claim Pants on Fire.", "Update: As we were publishing our fact-check, Drudge deleted his tweet without explanation. Here's a screen grab from Real Clear Politics:", "Matt Drudge, Steriling is a Democrat tweet, April 27, 2014", "Los Angeles County Registrar-Recorder/County Clerk, Voter registration verification", "Daily Caller, Race Hate Spewing Clippers Owner Is Democratic Donor , April 26, 2014", "National Review Online, Racist Clippers Owner Donald Sterling Has Only Contributed to Democrats, April 27, 2014", "Michael Hiltzik, Sterling is registered Republican tweet, April 28, 2014", "Mother Jones, Donald Sterling Is a Registered Republican, April 28, 2014", "Talking Points Memo, Conservatives Called Him A Democrat, But Sterling Is Registered Republican, April 28, 2014", "Washington Post, Donald Sterling is a Republican and has given money to Democrats. His politics don’t matter., April 28, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]