["About this rating", "This spooky tale first started appearing on the internet in 2012:", "A photograph allegedly leaked from Erie, PA police department appears to show a disproportionately large handprint on a missing student's dorm room window.", "19 year old Elizabeth Hetzler disappeared from her dorm in Edinboro University of Pennsylvania on the night of February 12th, 2007. Her room was located on the third floor of the building, the door was locked, and there was no ledge outside her window. Her roommate awoke in the morning, having heard nothing unusual overnight and simply assumed that Elizabeth had left to go to class early. The roommate later told investigators that when she noticed the handprint, she screamed and knew immediately that \"everything Elizabeth had been talking about was true. It was real.\"", "The previous evening, Elizabeth had remarked to her friends that she’d had a strange experience walking back to her dorm from a late night dance rehearsal. As she made her way across campus, she gradually got the uneasy feeling that someone was watching and following her. “She seemed so relieved to be back in her room again,” her roommate said.", "No trace if Elizabeth has yet been found, and investigators have called it the most baffling missing person case of their careers. Since the above image has been circulating the internet for nearly two years, it is difficult to say for certain if it is genuine, although it matches what students and investigators have described (note its size in relation to the coffee pot in the foreground). Remarked Detective Stephen Broze, \"You'd think our suspect would be pretty easy to spot. He must stick out in a crowd with eleven-inch fingers.\"", "The above-related tale about the mysterious 2007 disappearance of Edinboro University student Elizabeth Hetzler and the abnormally large handprint found on her dorm room window appeared on the now-defunct Tumblr page CallMeSlendy, presumably a site devoted to legends about popular internet horror character Slenderman.  Early versions of the story included a photograph of the purported handprint, said to have been \"leaked\" from the Erie, Pennsylvania, police department.", "This tale is not an account of a real crime, but rather a fictional scary account woven around an unusual picture to produce a \"creepypasta\"  a neologism given to Internet-generated scary stories submitted to the web site of that name (the sort of supernatural tales not out of place around a campfire or on Reddit's popular NoSleep subreddit, such as the infamous account of a Russian Sleep Experiment).", "Nothing about this particular ghost story would ordinarily merit much attention from us, except for that along the way someone created a mocked-up graphic that made it appear the tale had been included in our web site's listings (with an \"undetermined\" status) back in 2007:", "This has been tossed around on Snopes, and it's not yet proved true (but nothing is in the supernatural realm, is it?). Basically, this girl Elizabeth Hetzler disappeared from her dorm at Edinboro University of Pennsylvania on the night of February 12th 2007. Her door was locked, so was her window, and her room was on the third floor ...", "For the record, the \"inhuman handprint\" story was never an entry on our site before now (March 2015), so if you once struggled (like many searchers) to locate it here, that's because the page in question never existed in our Fauxtography category's \"Oddities\" category (as the image suggested), or in any other section of this site. Nonetheless, the circulating screenshot is a well-rendered forgery, albeit one likely intended as an immersive element of dynamic storytelling rather than a fake page created to dupe the unsuspecting into believing the tale was literally true.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]