["The two-minute and 22-second video was published on Facebook here on February 27, 2020. The video has been viewed more than 3,600 times.", "Below is a screenshot of the misleading post:", "The post's Hindi-language caption translates to English as: “This is a scene outside a hospital in Iran. Please convey this to the people who cannot stay at their homes even these days.”", "The caption makes reference to the Indian government’s decision to impose a three-week nationwide lockdown in an attempt to curb the spread of COVID-19, the disease caused by the novel coronavirus.", "The video was also shared alongside a similar claim on Facebook here, here, here and here and on Twitter here, here, here and here. Similar posts in English were published on Facebook here and here and on Twitter here.", "The claim is false.", "A reverse Google image search using video keyframes extracted with InVID-WeVerify, a video verification tool, found the footage has circulated in reports about the bodies of worshippers who died during Hajj in Saudi Arabia.", "A screenshot of the video was published here in an Arabic news report on August 17, 2019, several months before COVID-19 was first detected in the Chinese city of Wuhan.", "“Beautiful scene, funeral prayer for 58 pilgrims, who died during the pilgrimage in their Ihram (white dress), at the sacred mosque,” the report reads.", "Below is a screenshot comparison of the photo published in the media report (L) and the video shared in the misleading Facebook post (R):", "The same video was also published on YouTube here and here on August 16 and 17, 2019 respectively. Both of the posts' descriptions state the footage shows worshippers who died during Hajj that year.", "The pilgrim deaths were also reported in this article by Bangladesh-based newspaper The Daily Star and this report by Turkish news organisation Anadolu Agency.", "More than two million Muslims from across the world travelled to Mecca to participate in Hajj in August 2019, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]