["The video has been viewed more than 15,000 times after it was published on Facebook here on October 31, 2020.", "The 59-second video shows a CCTV recording of a policeman slamming a handcuffed woman to the floor.", "The Malaysian-language caption translates to English as: “French police are very cruel to Muslim women who wear hijab, they are very afraid of Islam, that’s why we are obliged to boycott products made in France”.", "The claim circulated online after French President Emmanuel Macron criticised Islamists and vowed not to “give up cartoons” depicting Prophet Muhammad, sparking calls to boycott French products in the Islamic world.", "The video was viewed more than 44,000 times after it appeared with a similar claim on Facebook here and here, on Twitter here, and YouTube here and here.", "The video was also posted with a similar claim in Arabic here and here.", "The claim is false.", "A reverse image search using keyframes extracted with digital verification tool InVID-WeVerify, followed by a keyword search, found a longer video of the incident was posted on October 28, 2020, on the YouTube channel of 660 News, a Canadian news station.", "The video is titled: “FULL VIDEO: Const. Alex Dunn is seen slamming a woman to the ground”. The caption reads: “Dunn was charged with assault causing bodily harm in the Dec. 2017 event. His trial is underway in Calgary. This video, which is featured in the trial, was provided to CityNews by the court.”", "Calgary is a city located in the Canadian province of Alberta.", "Below is a screenshot comparison of the video from the misleading post on Facebook (L) and the YouTube video (R):", "The 2017 video was also published by other Canadian news outlets, such as CBC and Global News, in their reports about the police officer’s trial in late October 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]