["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The tail of a southern right whale emerges from the waters of the Atlantic Ocean near Puerto Piramide, some 1,000 miles south of Buenos Aires, Sunday, June 10, 2001. (AP Photo/Jose Luis Pasten)", "Woe, to be a third wheel. Or a third whale.", "At least, a recent Facebook post equates the two.", "\"Third whaling,\" says the Aug. 19 post, which features an illustration of two whales seemingly mating and a third underneath them. \"So apparently when two large whales do the nasty there’s sometimes this one bro who just sort of holds them up so they don’t float off. Nature is beautiful.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Nature is beautiful, but what’s happening here is a little less love, a little more war.", "\"Good story!\" Scott Kraus, chief marine mammals scientist at the Anderson-Cabot Center for Ocean Life, said about the Facebook post. \"But entirely fictional. Why one male would help another secure a copulation? It makes no sense biologically to give up creating your genetically related offspring to help your buddy.\"", "Many observations of mating groups in right, bowhead and gray whales have led people to think males are helping one another to get the female, Kraus said. \"But it is mostly competition, pure and simple.\"", "Quoting from the book \"Gray Whales\" by David G. Gordon and Alan Baldridge, a 2000 New York Times Q&A says that \"two courting bulls often follow the same cow, forming tightly knit trios that remain intact right up to the moment of conception.\"", "The idea that any extra males held the mating whales together to brace them has been \"mostly dismissed as a misinterpretation of what is going on in a process that is difficult to study,\" according to the Times.", "Different whale species behave differently. The contests between male humpback whales can be violent, or deadly, according to a 2008 Smithsonian Magazine story, as male whales attack each other underwater vying for the female’s attention.", "In August 2000, meanwhile, a female North American Right whale was observed by scientists simultaneously having sex with two males. Kraus told us that when female whales remain with their blowholes upright and swimming forward, they may be ensuring that only males fit enough to keep up and hold their breath for long periods of time can mate with her. In right whales, he said, \"it’s likely that the female instigates this behavior by calling — the more males, the more competition, the more likely she is to get the best male.\"", "A 2015 video posted on YouTube by National Geographic shows gray whales the magazine says \"may be engaged in a ‘three way.’ \"", "\"It’s common to see two male gray whales courting a female,\" the text that appears over the video reads. \"They take turns attempting to mate with her. Body alignment is important in these 35-feet plus mammals. One male supports the female as the other attempts to mate with her.\"", "An accompanying article quotes a gray whale researcher saying: \"Many times gray whales do mating triads, and at times one male props the other male up to mate and then they flip flop positions.\"", "These statements seem to support the Facebook post, but we wanted to know more. We reached out to Mark Girardeau, the wildlife photographer who used a drone to record the footage of the whales that National Geographic posted. He told us that the information in the New York Times Q&A that challenges the notion of a third \"helper\" whale is accurate.", "\"Many species have never even been documented mating, so we just don’t know,\" he said. \"Gray whales were previously thought to have only mated in threes for support, but I’ve also recently found out that it is just two males competing, and it’s just a matter of which bull’s semen does the job.\"", "We asked Trevor Branch, a professor at the School of Aquatic and Fisheries Sciences at the University of Washington, about the \"third whaling\" claims.", "\"Sounds super unlikely,\" he told us in an email. \"Often there are two males competing to mate with the female, and it might appear (as) if one is below (and) that it’s supporting the mating couple.\"", "He pointed us to a recent article in Marine Mammal Science that he notes was \"about this exact scenario in blue whales.\"", "The article says that escorting behavior, in which a male accompanies a female, is known to happen among animals including humpback whales, African elephants and some primate species.", "\"Escorting allows a male to defend a female, limiting access of other males to the female and thereby increasing the likelihood of siring potential offspring,\" the article says. \"Rival males may challenge the escorting male to take his place… . In the Gulf of St. Lawrence, it is often observed that when a blue whale pair is joined by a third whale — usually a male — the trio starts coursing, racing high out of the water involving vigorous surface displays causing explosive splashes and bow waves. This behavior can either end with the intruding male leaving the pair or the primary escort being replaced by the intruding male.\"", "Rob Williams, chief scientist with Oceans Initiative, told us that back in the 1980s, there was a theory of mating trios including \"helpers\" among gray whales. \"But I think even the authors noted that was speculation,\" Williams said. \"I’m not aware of any genetic evidence emerging over the last 30 years that those third whales are actually helpers.\"", "Philip Clapham, former program leader of the Cetacean Assessment and Ecology Program and the National Oceanic and Atmospheric Administration, was blunter when we asked him about the Facebook post.", "\"The idea that one male holds up a mating pair is complete and utter bulls---,\" he said.", "In some species of whales, multiple males compete for the same female,\" he told us. Gray whales are more sedate than, say, humpback whales, but that underwater melee is competition, not cooperation.", "We rate this Facebook post False.", "Facebook post, Aug. 19, 2019", "The New York Times, \"Q&A: Facts of life for whales,\" July 4, 2000", "Smithsonian Magazine, \"Big Love,\" February 2008", "BBC, \"Animals are kinkier than you,\" Feb. 13, 2015", "National Geographic, \"How do animals have sex underwater?\" May 27, 2017", "YouTube, \"Rare video: whales engage in three-way mating ritual,\" Feb. 20, 2017", "National Geographic, \"Watch the elaborate courtship of three gray whales,\" Feb. 10, 2017", "Marine Mammal Science, \"Visual and passive acoustic observations of blue whale trios from two distinct populations,\" accepted Aug. 13, 2019", "Email interview with Trevor Branch, Richard C. and Lois M. Worthington Endowed Professor in Fisheries Management, School of Aquatic and Fisheries Sciences, University of Washington, Aug. 31, 2019", "Email interview with Mark Girardeau, wildlife photographer, Sept. 4, 2019", "Email interview with Rob Williams, chief scientist, Oceans Initiative, Sept. 5, 2019", "Email interview with Philip Clapham, former program leader, Cetacean Assessment and Ecology Program, National Oceanic and Atmospheric Administration, Sept. 5, 2019", "Email interview with Scott Kraus, chief scientist, marine mammals, Anderson-Cabot Center for Ocean Life, Sept. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]