["Bengaluru witnessed deadly riots on the night of August 11 when a mob, enraged over a derogatory Facebook post, attacked Congress MLA Akhanda Srinivasa Murthy’s residence and police stations at DG Halli and KG Halli. Murthy’s nephew Naveen had allegedly shared a post against Muhammed, the prophet of Islam, for which he was arrested. As many as 110 people have also been arrested in connection with Tuesday’s violence.", "Social media grapevine has now alleged that Naveen’s post was a reaction to a derogatory post shared by a Muslim man, Adyar Basheer, targeting Hindu gods and Prime Minister Modi. The tweet below by @SanjayGandhi75 garnered over 1,600 retweets as of this writing.", "[Note: Social media posts carrying derogatory remarks have not been linked in this report.]", "A Facebook user Om Prakash Singh shared a wider screenshot of Basheer’s post which carries Naveen’s alleged remarks in the comments, repeating the claim that Naveen was responding to a post derogatory toward Hindu deities.", "The popular claim circulating on social media suggests — Basheer shared a derogatory post against Hindu gods, Naveen responded to him with a ‘meme’ on Muhammed, the prophet of Islam, members of the Muslim community cropped out Basheer’s post and instigated the violence.", "This slideshow requires JavaScript.", "Basheer’s post is two years old and had caused quite a stir back then. Below is a post on Facebook page ‘I Support Anant Kumar Hegde’ shared on June 16, 2018.", "That same day, a Twitter user had also shared an original screenshot of Basheer’s post.", "Naveen’s remarks cannot be in response to a post which no longer exists on Facebook. His post was therefore morphed into the comment section of a screenshot of Basheer’s old post to give the false impression that Naveen was reacting to derogatory remarks against Hindu gods.", "A keyword search of Adyar Basheer’s name in Kannada (ಬಶೀರ್ ಅಡ್ಯಾರ್‌) took us to an article by Kannada outlet Prajavani published on June 17, 2018. The article claimed that an account created in Basheer’s name shared offensive posts targeting Hindu gods, PM Modi and Maratha warrior Chhatrapati Shivaji.", "Prajavani also reported that people were accusing the Bharatiya Janata Party (BJP) and the Rashtriya Swayamsevak Sangh (RSS) of creating a fake account with a Muslim name to trigger social unrest. Alt News was unable to find any reports which suggest this was true.", "A report published by One India Kannada that same day claimed that Basheer was arrested by the police.", "However, a report in The Hindu published on June 18, 2018, does not speak about Basheer’s arrest but informs that he was booked by Barke police for making a derogatory post against Shivaji. “The police have taken suo motu note of the content and registered a case under Sections 153(a) and 505(2) of the Indian Penal Code,” per The Hindu report according to which Basheer was a resident of Dhahran in Saudi Arabia.", "Website coastaldigest.com said that Basheer hailed from coastal Karnataka and was working in Saudi Arabia.", "A journalist with The Times of India Mangalore Jaideep Shenoy had tweeted about the case. He wrote that a complaint was filed against Basheer by a man named Ganesh.", "Based on derogatory content being circulated in social media, a case has taken up under Cr 128/18 u/s 153(a), 505(2) IPC at Barke PS on complainant from Ganesh, c. Accused as in FB page Basheer Adyar Basheer. Investigation taken up by Barke PI. @compolmlr @DrParameshwara", "— Jaideep Shenoy 🇮🇳 (@jaideepSTOI) June 16, 2018", "Alt News was unable to locate further updates on the case. However, it is clear that Basheer’s post is neither recent nor does it exist on Facebook anymore. Thus Naveen’s remarks could not have been a reaction to Basheer’s post targeting Hindu deities.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]