["About this rating", "In the wake of an October 2018 mass shooting attack at a Pittsburgh synagogue that left eleven worshipers dead, both news and social media platforms picked up on a show of solidarity extended to the survivors on the part of two Muslim groups.", "On 30 October 2018, the liberal Facebook group The Other 98% shared a photograph of two men hanging a Star of David for Irving Younger, one of the victims of the attack at the Tree of Life Synagogue three days earlier, along with the caption \"Muslim Americans raise more than $190,000 for those affected by Pittsburgh synagogue shooting. This is what makes America great\":", "In this case, the meme was correct: As of 1 November 2018, the Muslims Unite for Pittsburgh Synagogue fundraising campaign had raised over $227,000, dwarfing their initial fundraising goal of $25,000.", "The campaign was organized by two Muslim community groups, MPowerChange and CelebrateMercy, as described on the fundraiser's web site:", "In a campaign organized by CelebrateMercy and MPower Change, the Muslim-American community extends its hands to help the shooting victims, whether it is the injured victims or the Jewish families who have lost loved ones.", "We wish to respond to evil with good, as our faith instructs us, and send a powerful message of compassion through action. Our Prophet Muhammad, peace be upon him, said: \"Show mercy to those on earth, and the One in the Heavens will show mercy to you.\" The Quran also teaches us to \"Repel evil by that which is better.\"", "On 30 October 2018, the groups updated the fundraiser to note that they had transferred $25,000 to the Islamic Center of Pittsburgh, which had met with officials \"to begin planning fund disbursement to the victims' families.\"  On 1 November, they reported another $110,000 had been disbursed.", "Eleven people were killed in the shooting. The suspect, a 46-year-old Pennsylvania man, had a history of spewing anti-Semitic rhetoric online, including promoting the conspiracy theory that Jewish people were helping immigrants from Central America, whom he called \"invaders,\" make their way to the United States. The day of the shooting, he posted on the right-wing social media site Gab to say that he \"can't sit by and watch [his] people get slaughtered,\" adding, \"Screw your optics, I'm going in.\"", "On 31 October 2018, the suspect was charged with 11 federal hate crimes, including murder, for the fatal assault.", "El-Messidi, Tarek.   \"Muslims Unite for Pittsburgh Synagogue.\"\r\n    LaunchGood.   27 October 2018.", "Ahmed, Saeed and Paul P Murphy.   \"Here's What We Know So Far About Robert Bowers, The Pittsburgh Synagogue Shooting Suspect.\"\r\n    CNN.   28 October 2018.", "United States Department of Justice.   \"Pennsylvania Man Charged with Federal Hate Crimes for Tree of Life Synagogue Shooting.\"\r\n    31 October 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]