["A video viewed more than 100,000 times has been shared in multiple tweets that claim it shows Nigeria’s ambassador to the US on his way to a meeting with President Donald Trump to discuss new travel restrictions for Nigerians. The claim is false; the video clip was circulating online long before the US government announced an expansion of the country’s travel restriction list to include Nigeria.", "The claim first appeared in this tweet published on February 1, 2020, a day after the US government announced new visa restrictions on citizens of Nigeria, as well as citizens from five other countries, effective February 21, 2020.", "The 22-second clip was reposted with a similar caption in this tweet, which has been shared nearly 2,000 times.", "The post’s caption reads: “BREAKING NEWS: Nigeria Ambassador to the US arrives Washington DC to discuss the travel ban with President Donald Trump [sic]”.", "The video clip shows Sylvanus Adiewere Nsofor, Nigeria’s ambassador to the US, limping and using a walking stick. He is accompanied by two men, including one in Nigerian military uniform.", "The footage has been viewed more than 170,000 times, including reposts, and was also shared with similar claims here and here on Facebook, as well as here and here on Twitter.", "But the claim is false: The viral footage was already circulating on social media well before January 31, 2020, the date on which the Trump administration announced an expansion of the country’s travel ban list to include Nigeria, Myanmar, Eritrea, Kyrgyzstan, Sudan, and Tanzania.", "Using the video verification tool InVID to conduct reverse image searches, AFP found that the video had been published in a tweet months earlier, back in September 2019.", "Moreover, the video does not show the ambassador in Washington DC, as some of the misleading tweets claimed, but in New York City.", "AFP tracked down another video that was filmed in the same location as the first video. It was tweeted on September 23, 2019 by Simon Ateba, a Nigerian journalist and the publisher of US-based Today News Africa.  In his tweet, Ateba said he met the ambassador when he paid a visit to Nigerian President Muhammadu Buhari, who was in New York to participate in the 74th Session of the United Nations General Assembly.", "Signage visible in both videos indicate that it was filmed at the United Nations Plaza. Using Google Street View, AFP confirmed that the video was indeed shot at the United Nations Plaza in New York City.", "Architectural features and other matching features are visible in both of the videos and on Google Street View, including a “No Smoking” symbol and inscriptions showing “ONE UN” and “United Nations Plaza Tower” (see below).", "Matching features are also visible when looking from a different direction in Google Street View.", "Nsofor, 84, is a retired justice from Nigeria’s Court of Appeal whose nomination as a non-career ambassador was at first rejected by Nigeria’s senate amid concerns about his age.", "Since his appointment was confirmed in June 2017, following a second nomination by Nigeria's president, Nsofor’s age and physical appearance have become a recurrent subject of debate in Nigeria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]