["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The foundation formula determines how much the state will need for every school district.", "In 2017, Rowden voted for an amendment that fully funded K-12 education for the first time in the current formula’s history. But the previous formula used was fully funded from 1994 to 2001.", "State Sen. Caleb Rowden is trying his best to keep Missouri’s 19th District red with campaign ads stretched across social media touting his efforts in office. Rowden and his opponent, Democrat Judy Baker, have stressed public education, which has been historically underfunded by the state.", "A recent Facebook ad by Rowden’s campaign asks users to \"like\" his page \"to help re-elect State Senator Caleb Rowden who fully funded Missouri K-12 education for the first time in state history.\"", "What does it mean to \"fully fund\" public education? And does Rowden deserve credit?", "Missouri’s K-12 education is funded by a mix of local, state, and federal sources, with state sources accounting for about 40% of the total funds each year, according to the Missouri Budget Project. For decades, Missouri has been using what is called the foundation formula to determine the level of state funding for each of the more than 500 school districts in the state. This in turn provides a state funding target each fiscal year.", "According to the State & Regional Fiscal Studies Unit at the University of Missouri, the foundation formula has gone through many revisions due to changing economic circumstances, court rulings, and modifications in how real and personal property is taxed in the state.", "When the 1993 formula was deemed obsolete, a new foundation formula was adopted on July 1, 2006. It determines each district’s state aid by multiplying the weighted average daily attendance, which accounts for low-income, special education, and limited English proficiency students, by that of the minimum amount that will be spent on students in all districts to ensure all students receive an adequate education. That number is then adjusted based on local funding and local cost of living.", "Kim Rueben, director of the State and Local Finance Initiative at the Urban-Brookings Tax Policy Center, told us that the legislature has to meet the total dollar amount determined by the formula for K-12 education to be considered fully funded.", "\"It isn't necessarily uncommon for formulas or guarantees not to be fully funded,\" Rueben said.", "The current formula wasn’t fully funded until 2017 for the 2018 fiscal year. It was again fully funded the following year.", "Rowden did not respond to our requests for evidence to support the claim in his Facebook ad.", "But in April 2017, the Kansas City Star reported that a bipartisan group of senators voted on an amendment to fully fund K-12 education \"for the first time in history.\"", "Rowden did not sponsor the amendment. But the senator, who was sworn into office three months earlier, was among the 19 \"yeas\" to add $45 million and bring public education funding to a total of $3.4 billion, matching the formula’s yearly funding target.", "We wondered whether previous formulas had been fully funded. So we asked someone who helped draft the prior formula in 1993, Otto Fajen, the legislative director at the Missouri National Education Association.", "\"There has been multiple, sustained years of a fully funded K-12 education formula, as it stood under law at that time, throughout the ‘90s,\" Fajen said.", "The Missouri Department of Elementary and Secondary Education provided us with a table that proves K-12 education was fully funded for the fiscal years 1994 through 2001.", "Rowden said he \"fully funded Missouri K-12 education for the first time in state history.\"", "He voted to approve a 2017 budget amendment to fully fund K-12. But he wasn’t a sponsor. And public education was fully funded in a previous formula for at least eight consecutive years from 1994 to 2001.", "The statement is not accurate. We rate this claim False.", "Missouri’s Office of Administration-Division of Budget and Planning, Missouri School Funding & Foundation Formula Handout, accessed on Sep. 3, 2020.", "Supreme Court of Missouri, Committee For Educational Equality v. The State of Missouri En Banc, accessed on Sep. 13, 2020.", "Springfield News-Leader, How the Missouri school funding formula works, accessed on Sep. 3, 2020.", "The Missouri Budget Project, Budget Basics: K-12 Education, accessed on Sep. 4, 2020.", "State & Regional Fiscal Studies Unit at the University of Missouri-Columbia, Missouri Tax Policy & Education Funding-May 2003, accessed on Sept. 16, 2020.", "The Missouri Budget Project, Missouri School Foundation Formula: Fuzzy Math meets Fiscal Crisis, accessed on Sept. 8, 2020.", "Missouri Senate, Journal of the Senate: 4/25/17, accessed on Sept. 5, 2020.", "Education Week, Judge in Missouri Strikes the State's Finance Formula, accessed on Sept. 16, 2020.", "The Kansas City Star, For first time in history, Missouri Senate votes to fully fund K-12 public schools, accessed on Sept. 4, 2020.", "Email exchange, Mallory McGowin, communications coordinator at DESE, Sept. 22, 2020.", "Interview, director of the State and Local Finance Initiative at the Urban-Brookings Tax Policy Center Kim Rueben, Sept. 10, 2020.", "Interview, legislative director of Missouri National Education Association Otto Fajen, Sept. 11, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]