["The image of a crowd was published in this Facebook post on October 9, 2019.", "It has been shared more than 3,600 times.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language text superimposed on the image translates to English as:", "“A sea of about 400,000 people gathered at the Anuradhapura Salgadu Stadium for Mr. Gotabaya’s inaugural rally. Toiyyas are ruined. Victory is certain!”", "Gotabaya refers to Gotabaya Rajapaksa, the presidential poll candidate of the Sri Lanka Podujana Party (SLPP).", "His inaugural political rally was held on October 9, 2019, at the Salgadu Stadium in Anuradhapura, a city located in North Central Sri Lanka.", "“Toiyya” is a Sinhala phrase coined to troll supporters of the ruling United National Party (UNP).", "The misleading post’s Sinhala-language caption translates to English as:", "“Baiyyas share in the name of victory!”", "“Baiyya” is a Sinhala term used to describe supporters of the SLPP, Gotabaya’s party.", "The same image was shared here and here on Facebook with a similar claim.", "The claim is false; the photo shows a crowd who gathered in Paris on the day France won the 2018 FIFA World Cup.", "A reverse image search on Yandex found this photo published by UK-based photo agecy Alamy on July 15, 2018.", "The photo is credited to photographer Samantha Ohlsen.", "Below is a screenshot of the image on the Alamy website:", "The photo’s caption states: “Paris, France. 15th July, 2018. Large crowds turn out in Paris to watch France win the World Cup. Paris, France”.", "France won the 2018 FIFA World Cup on July 15, 2018, after defeating  Croatia 4-2 at the Luzhniki Stadium in Moscow.", "Below is a screenshot comparison of the image used in the misleading post (L) and the image on Alamy (R) with key identifying feautres highlighted in yellow by AFP:", "A closer analysis of the two images shows the photo in the misleading post had been digitally manipulated, with patches of red added into the crowd, possibly in an attempt to mislead audiences into believing the image was taken at an SLPP rally.", "Red is the official colour of the SLPP.", "Below is a screenshot of the image in the misleading post with the areas which were digitally manipulated highlighted by AFP:", "The original photo was taken at Champ de Mars in Paris.", "Below is a screenshot of the same location on Google Street View:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]