["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "By now, most of those following the so-called \"Ground Zero Mosque\" issue know it is not on Ground Zero -- but rather is two blocks away.", "But on ABC's This Week on Aug. 22, 2010, Bloomberg's Al Hunt said it's not even a mosque.", "Hunt said the issue has been \"demagogued\" and added, \"This is not on ground zero. This is not a mosque. It's a cultural center that has a prayer area.\"", "Hunt's comment echoed Frank Rich who stated in an Aug. 21, 2010, New York Times op-ed, \"It’s not a mosque but an Islamic cultural center containing a prayer room.\"", "But the developing organization repeatedly refers to the religious component of the site as a mosque.", "On the website for the project (Park51.org), the plan sounds more like a Muslim YMCA-type operation. The site's \"facilities\" page details plans for a \"world-class community center\" open to all New Yorkers, regardless of faith. According to the site, plans include: a swimming pool, gym and basketball court, a 500-seat auditorium, a restaurant and culinary school, exhibitions, education programs, a library, reading room, art studios, childcare services and a September 11 memorial and \"quiet contemplation space, open to all.\"", "The plan also includes \"a mosque, intended to be run separately from Park51 but open to and accessible to all members, visitors and our New York community.\"", "Organizers say the center would be used to promote cultural diversity and would be overseen by a 23-member Board of Directors, whose membership will not be limited to Muslims. But the center would be geared toward \"engaging New York’s many and diverse Muslim communities and promoting empowerment and compassion for all.\"", "Another page of the website explains that the project, called Park51, is an independent project led by American Muslims. On that same page, it states, \"The mosque, yet to be named, will be run by a separate non-profit whose Board of Directors will reflect a broad range of experience. While the mosque will be located in the planned final structure of Park51, it will be a distinct non-profit.\"", "In a July 24, 2010, interview with altmuslim.com, an Islamic news site, Sharif El-Gamal, owner of the building and developer of the Park51 project, was asked, \"Why must the project necessarily include a mosque? Wouldn't a general prayer area, which could be reserved in advance by any religious group, be more appropriate and compatible with the community-centric interfaith mission of the project?\"", "Gamal answered, in part, \"With respect to the mosque, which will take up only a small portion of the final space, it’s a question of meeting a need. This mosque will be open to all. There are probably one million Muslims in the tri-state area and several hundred thousand in New York City.\"", "We also turned to a website for the Cordoba Initiative, \"a multi-faith non-profit organization whose aim is to improve relations between different communities, and in particular between the Muslim world and the United States of America\" which was founded by Imam Feisal Abdul Rauf, who along with Gamal acts as project manager of the Park51 site.", "On the \"Frequently Asked Questions\" page is one that asks, \"Why are you building a mosque at Ground zero?\"", "The response:", "\"The community center is not located at Ground Zero.", "\"It will be a multi-floor community center open to all New Yorkers, much like a YMCA or Jewish Community Center (JCC) with a designated prayer space (mosque) in one area to serve the needs of the large existing community of American Muslims in the neighborhood.", "\"The community center will provide a place where individuals, regardless of their culture or background, will find a place of learning, arts and culture, and, most importantly, a community center guided by the universal values of all religions in their truest form – peace, compassion, generosity, and respect for all.\"", "We note that the \"mosque\" in parentheses is their word, not ours.", "Imam Rauf has been leading prayer services in one of the buildings -- a former Burlington Coat Factory -- since 2009, drawing a spillover from the imam's former main place for prayers, the al-Farah mosque about a dozen blocks north of the World Trade Center grounds, according to the Washington Post. According to the Post, the site's organizers estimated that the mosque could attract as many as 2,000 worshipers on Fridays.", "So how exactly does one define a mosque according to Islamic tradition, as opposed to simply a prayer space? We explored this very issue a bit when we researched a claim from Kendrick Meek, a Democratic Senate hopeful, who said there is a mosque at the Pentagon. It turns out there is a non-denominational chapel at the Pentagon, and it is used once a day by Muslim employees who gather there for prayer services.", "While that might be considered a sacred place by those who use it, it doesn't meet the definition of a mosque, according to Shafayat Mohamed, imam of the Darul Uloom mosque in Pembroke Pines, Fla. \"The main thing that makes a mosque a mosque is the establishment of praying five times a day at that spot,\" Mohamed said. \"If people pray five times per day, then it is considered a regular mosque.\"", "We agree with those who say it's imprecise to simply refer to the New York project as a mosque. As is clear from the organizers' comments and formal web pages, the big picture plans are for a $100 million, 15-story Muslim community center that would be open to New Yorkers of all faiths. But those comments and websites also make clear that the plans do include a \"mosque.\" It may be a \"small portion\" of the overall project, but it is a part. And so when Hunt said, \"This is not a mosque. It's a cultural center that has a prayer area,\" that's not accurate either. It's a cultural center that includes a mosque. And so we rate Hunt's comment False.", "ABC News, ABC \"This Week\" roundtable discussion, Aug. 22, 2010", "New York Times, Op-ed: \"How Fox Betrayed Petraeus,\" by Frank Rich, Aug. 21, 2010", "Cordoba Initiative, The Proposed Community Center Project in Lower Manhattan FAQs", "PolitiFact, \"Fact-checking the 'Ground Zero mosque' debate,\" by Robert Farley, Aug. 20, 2010", "Washington Post, The view from Ground Zero", "Newsweek, \"War Over Ground Zero,\" by Lisa Miller, Aug. 8, 2010", "Park51.org, the web site of the organizers of the cultural center/mosque project", "AP, \"Fact Check: Islam already lives near ground zero,\" by Calvin Woodward, Aug. 19, 2010", "Washington Post, \"Mosque near Ground Zero: Frequently asked questions,\" Aug. 18, 2010", "Altmuslim.com, \"We want to build Park51 so it has something for everyone,\" by Aziz Poonawalla and Shahed Amanullah, July 24, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]