["About this rating", "President Obama attempted to delegitimize Fox News by calling their oppositional stance \"destructive\" for the country, took questions from Fox News correspondents less frequently than he did from those of other major networks in press briefings, and his administration expressed a willingness to exclude Fox reporters from interviews with top officials.", "The Obama administration never rescinded the press passes of Fox News reporters nor ejected or banned them from White House press conferences.", "President Trump's bellicose relationship with the press reached a crescendo in November 2018, when he blasted CNN correspondent James Acosta for being a \"rude, terrible person\" during a briefing which culminated in the suspension of Acosta's \"hard pass\" to White House press events.", "For all Trump's attacks on what he calls \"the fake news media,\" whom he regularly accuses of lying and being \"enemies of the people,\" however, he is not the first president to have hostile relations with the fourth estate. Richard Nixon added prominent members of the press to his infamous \"enemies list, while Harry Truman grumbled that presidents and their cabinets \"have been slandered and misrepresented since George Washington.\" And, in a letter to a newspaper editor more than 200 years ago, President Thomas Jefferson wrote that \"Nothing can now be believed which is seen in a newspaper. Truth itself becomes suspicious by being put into that polluted vehicle.\"\nEven President Barack Obama, who enjoyed a generally genial relationship with the press overall, complained of unfair treatment by the conservative-leaning Fox News Channel throughout his tenure. During a 2018 speech in which the former president implicitly contrasted himself with his successor, Obama denied ever retaliating against the news network despite their negative coverage of his administration: \"It shouldn't be Democratic or Republican to say that we don't threaten the freedom of the press because they say things or publish stories we don't like. I complained plenty about Fox News -- but you never heard me threaten to shut them down, or call them enemies of the people.\"\nHowever, he did, in a 2010 interview with Rolling Stone, accuse Fox News of caring more about trumpeting a particular point of view than being objective. \"It’s a point of view,\" Obama said, \"that I think is ultimately destructive for the long-term growth of a country that has a vibrant middle class and is competitive in the world.\"\nDuring the Acosta episode, a number of social media users claimed that the Obama administration had, in fact, \"blocked\" or \"banned\" Fox News reporters from White House press conferences:\n\nObama blocked fox news reporters from press conferences for no reason. No outrage for that, of course.\n— Greg (@MrGRH) November 9, 2018\n\n\nThank you! I thought I was the only one who remembered. @BarackObama banned Fox News from being at any of his press conferences.\n— lisa modica?????‍♀️?? (@LisaNovi777) November 14, 2018\n\n\nFox news was banned from all Obama press conferences !!\n— Smeech (@Smeech8) November 14, 2018\n\nThe claim was sometimes accompanied by a video clip ostensibly showing Obama ejecting a reporter from a press conference, though in fact it showed him directing aides to remove a disruptive protester from a White House event in July 2015.\nAnother tale about Obama's supposedly ousting a reporter turned out to be a fictionalization of an incident that occurred in the Los Angeles International Airport in 2009. As reported by NBC Los Angeles, Georgia Informer columnist and religious activist Brenda Lee was removed from the vicinity of Air Force One for refusing to cooperate with security personnel while attempting to deliver a personal letter to President Obama (who was not present). The incident did not occur on Air Force One as claimed, nor was the columnist's removal ordered by the President himself.\nWe were unable to find any actual examples of Obama or members of his administration banning any reporters (much less Fox News reporters) from White House press events or revoking their credentials.\nIn a November 2018 interview with Hill.TV, however, former Fox News White House correspondent Major Garrett asserted that even though there was \"never an effort to shut me out of the briefing room,\" ongoing tensions between the Obama administration and Fox News hindered his ability to do his job:\n\"The White House would always pull me aside and say 'well, really, Major, we're not at war with you,' and I said 'stop talking to me like that because when you're at war with my network you by definition are questioning and assailing my journalistic credibility and the work I do here every day,'\" he said. \"'So don't tell me it's not about me, it is about me.'\"\n\"Now, they never tried to pull my pass, but they had this sort of arms-length relationship to Fox and tried to demonize it on a daily basis. So that's another part of American history and journalism in the White House press corps I think at least should be noted at this moment,\" he said.\nWhat's more, a 2013 analysis by the University of Minnesota's Eric Ostermeier found that Fox News correspondents were called on far less often during White House press briefings than those of the other major television networks (ABC, CBS, NBC, and CNN).\nOther incidents occurring early on in the Obama administration also suggested a pattern of discriminating against Fox News and its reporters. For example, in September 2009 Obama famously snubbed \"Fox News Sunday\" (anchored by Chris Wallace) when making the rounds of Sunday talk shows to discuss health care reform, and he did not appear on the show until 2016, his last year in office. Again in 2009, Obama spokesperson Josh Earnest admitted a willingness to exclude Fox News from interviews with top administration officials.\nMore disturbingly, the Washington Post reported in 2013 that Obama's Department of Justice (DOJ) surveilled a Fox News reporter and obtained a search warrant for his e-mails while conducting an investigation into national security leaks in 2009. Although he wasn't the only journalist targeted in such an investigation, the Fox News correspondent was singled out as a possible \"aider, abettor, and/or co-conspirator,\" a fact which, according to the Post, \"distinguishes his case from the probe of the AP, in which the news organization is not the likely target.\"\nNot unlike Trump designating CNN and other mainstream media outlets \"fake news,\" the Obama administration sought to delegitimize Fox News as a reputable news organization and marginalize its reporters. However, Obama's White House never banned Fox News correspondents from press conferences, nor did they revoke or suspend any reporters' credentials, as the Trump White House did in the case of CNN's James Acosta.", "For all Trump's attacks on what he calls \"the fake news media,\" whom he regularly accuses of lying and being \"enemies of the people,\" however, he is not the first president to have hostile relations with the fourth estate. Richard Nixon added prominent members of the press to his infamous \"enemies list, while Harry Truman grumbled that presidents and their cabinets \"have been slandered and misrepresented since George Washington.\" And, in a letter to a newspaper editor more than 200 years ago, President Thomas Jefferson wrote that \"Nothing can now be believed which is seen in a newspaper. Truth itself becomes suspicious by being put into that polluted vehicle.\"", "Even President Barack Obama, who enjoyed a generally genial relationship with the press overall, complained of unfair treatment by the conservative-leaning Fox News Channel throughout his tenure. During a 2018 speech in which the former president implicitly contrasted himself with his successor, Obama denied ever retaliating against the news network despite their negative coverage of his administration: \"It shouldn't be Democratic or Republican to say that we don't threaten the freedom of the press because they say things or publish stories we don't like. I complained plenty about Fox News -- but you never heard me threaten to shut them down, or call them enemies of the people.\"", "However, he did, in a 2010 interview with Rolling Stone, accuse Fox News of caring more about trumpeting a particular point of view than being objective. \"It’s a point of view,\" Obama said, \"that I think is ultimately destructive for the long-term growth of a country that has a vibrant middle class and is competitive in the world.\"", "During the Acosta episode, a number of social media users claimed that the Obama administration had, in fact, \"blocked\" or \"banned\" Fox News reporters from White House press conferences:", "Obama blocked fox news reporters from press conferences for no reason. No outrage for that, of course.", "— Greg (@MrGRH) November 9, 2018", "Thank you! I thought I was the only one who remembered. @BarackObama banned Fox News from being at any of his press conferences.", "— lisa modica?????‍♀️?? (@LisaNovi777) November 14, 2018", "Fox news was banned from all Obama press conferences !!", "— Smeech (@Smeech8) November 14, 2018", "The claim was sometimes accompanied by a video clip ostensibly showing Obama ejecting a reporter from a press conference, though in fact it showed him directing aides to remove a disruptive protester from a White House event in July 2015.", "Another tale about Obama's supposedly ousting a reporter turned out to be a fictionalization of an incident that occurred in the Los Angeles International Airport in 2009. As reported by NBC Los Angeles, Georgia Informer columnist and religious activist Brenda Lee was removed from the vicinity of Air Force One for refusing to cooperate with security personnel while attempting to deliver a personal letter to President Obama (who was not present). The incident did not occur on Air Force One as claimed, nor was the columnist's removal ordered by the President himself.", "We were unable to find any actual examples of Obama or members of his administration banning any reporters (much less Fox News reporters) from White House press events or revoking their credentials.", "In a November 2018 interview with Hill.TV, however, former Fox News White House correspondent Major Garrett asserted that even though there was \"never an effort to shut me out of the briefing room,\" ongoing tensions between the Obama administration and Fox News hindered his ability to do his job:", "\"The White House would always pull me aside and say 'well, really, Major, we're not at war with you,' and I said 'stop talking to me like that because when you're at war with my network you by definition are questioning and assailing my journalistic credibility and the work I do here every day,'\" he said. \"'So don't tell me it's not about me, it is about me.'\"", "\"Now, they never tried to pull my pass, but they had this sort of arms-length relationship to Fox and tried to demonize it on a daily basis. So that's another part of American history and journalism in the White House press corps I think at least should be noted at this moment,\" he said.", "What's more, a 2013 analysis by the University of Minnesota's Eric Ostermeier found that Fox News correspondents were called on far less often during White House press briefings than those of the other major television networks (ABC, CBS, NBC, and CNN).", "Other incidents occurring early on in the Obama administration also suggested a pattern of discriminating against Fox News and its reporters. For example, in September 2009 Obama famously snubbed \"Fox News Sunday\" (anchored by Chris Wallace) when making the rounds of Sunday talk shows to discuss health care reform, and he did not appear on the show until 2016, his last year in office. Again in 2009, Obama spokesperson Josh Earnest admitted a willingness to exclude Fox News from interviews with top administration officials.", "More disturbingly, the Washington Post reported in 2013 that Obama's Department of Justice (DOJ) surveilled a Fox News reporter and obtained a search warrant for his e-mails while conducting an investigation into national security leaks in 2009. Although he wasn't the only journalist targeted in such an investigation, the Fox News correspondent was singled out as a possible \"aider, abettor, and/or co-conspirator,\" a fact which, according to the Post, \"distinguishes his case from the probe of the AP, in which the news organization is not the likely target.\"", "Not unlike Trump designating CNN and other mainstream media outlets \"fake news,\" the Obama administration sought to delegitimize Fox News as a reputable news organization and marginalize its reporters. However, Obama's White House never banned Fox News correspondents from press conferences, nor did they revoke or suspend any reporters' credentials, as the Trump White House did in the case of CNN's James Acosta.", "Adams, Becket.   \"Obama, Whose Administration Prosecuted and Spied on Reporters, Claims Trump Is Very Bad for Criticizing Newsrooms.\"\r\n    Washington Examiner.   7 September 2018.", "Bellantoni, Christina.   \"WH: We're Happy to Exclude Fox, But Didn't Yesterday with Feinberg Interview.\"\r\n   Talking Points Memo.   23 October 2009.", "Marimow, Ann E.   \"A Rare Peek Into a Justice Department Leak Probe.\"\r\n    The Washington Post.   19 May 2013.", "Ostermeier, Eric.   \"Fox Still Shunned at Obama Press Conferences.\"\r\n    Smart Politics.   16 January 2013.", "Weinger, MacKenzie.   \"Study: Obama 'Shuns' Fox News at Pressers.\"\r\n    Politico.   16 January 2013.", "Wenner, Jann S.   \"Obama in Command: The Rolling Stone Interview.\"\r\n    Rolling Stone.   14 October 2010.", "The Hill.   \"CBS Correspondent Says 'It Should Be Noted' That the Obama White House 'Demonized' Fox News Daily.\"\r\n    16 November 2018.", "USA Today.   \"Read Transcript of Former President Obama's Speech, Blasting President Trump.\"\r\n    7 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]