["Kashmir continues to be a pivot for misinformation purveyors on social media, on either side. A photograph is being circulated on social media, claiming it represents the state of Kashmir ever since key provisions of Article 370 were abrogated by the Indian government.", "#28DaysOfKashmirShutdown pic.twitter.com/wsjFWqWRCO", "— काकावाणी کاکاوانی (@AliSohrab007) September 1, 2019", "The above tweet has been posted with the hashtag #28DaysOfKashmirShutdown. The same image has been shared on WhatsApp. Alt News was requested by users of the Alt News app to ascertain the veracity of the photograph, which is claimed to be recent.", "A simple reverse-image search on Google revealed that the photograph is from 2013. It pertains to a terror attack in Srinagar in September 2013, in which a Central Industrial Security Force (CISF) jawan was killed. Alt News found this photograph in the archives of The Indian Express.", "A photograph dating back to September 2013 has been circulated as recent. This is only the latest of several such instances tracked by Alt News over the past month.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]