["About this rating", "On 2 June 2017, the Lifezette web site reported that French President Emmanuel Macron has begun offering refugee status to U.S. liberals. The article claimed:", "French President Emmanuel Macron is offering refuge to American liberals upset at President Donald Trump’s decision to withdraw from the Paris climate agreement.", "The article cited a video message posted by Emmanuel Macron the day before, in response to Trump's announcement that the U.S. would not participate, and accurately quotes the following from that message:", "I wish to tell the United States: France believes in you. The world believes in you. I know that you are a great nation. I know your history, our common history.", "To all scientists, engineers, entrepreneurs, responsible citizens who were disappointed by the decision of the president of the United States, I want to say that they will find in France a second homeland.", "I call on them: Come and work here, with us, to work together on concrete solutions for our climate, our environment. I can assure you, France will not give up the fight.", "To all scientists, engineers, entrepreneurs, responsible citizens who were disappointed by the decision of the US: pic.twitter.com/qxjPX8MhKt", "— Emmanuel Macron (@EmmanuelMacron) June 1, 2017", "Macron did indeed extend this invitation, but he did not offer \"refugee status\" to any particular group of Americans. Rather, he offered an invitation to work in France.", "\"Refugee status\" is a legal designation with a very specific meaning.", "In French law, it is reserved for someone who meets the requirements of the Geneva Convention:", "[A person] who is outside the country of his nationality, or if he has no nationality, the country of his former habitual residence, because he has or had well-founded fear of persecution by reason of his race, religion, nationality or political opinion and is unable or, because of such fear, is unwilling to avail himself of the protection of the government of his nationality, or, if he has no nationality, to return to the country of his former habitual residence.", "A person fearing persecution based on their gender or sexual orientation can also apply, according to the Law Library of Congress.", "A French official confirmed for us that there was no plan to modify France's asylum rules or practices to reach out to US citizens, and added:", "We don’t need to change France’s asylum and refugee procedures to welcome American scientists or experts on climate.", "Law Library of Congress.  \"Refugee Law and Policy: France.\"\r\n  LOC.gov.  21 June 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]