["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A mature marijuana plant flowers prior to harvest under artificial lights at Loving Kindness Farms in Los Angeles. (AP)", "Only five Republicans supported a House bill that would decriminalize marijuana at the federal level. Congressman David Rouzer was not among them.", "The legislation — if passed by the Senate and signed by the president — would remove marijuana from the Controlled Substances Act and eliminate criminal penalties for people who carry or distribute small amounts, CNN reports. The House passed it 228-164 on Dec. 4.", "Rouzer, who represents southeastern North Carolina, used Twitter to announce his displeasure with the House vote.", "\"As @HouseDemocrats push marijuana legalization instead of small business COVID-19 relief, remember: the @NIH states that regular marijuana use can reduce IQ by 8 points (which may be irreversible) and impairs memory and learning,\" Rouzer tweeted.", "First, we should note that the House did pass a bill in October that authorized more financial support for small businesses through the HEROES Act.", "But here we focus on another part of the claim: Is it true that the National Institutes of Health, a division of the U.S. Department of Health and Human Services, says \"regular marijuana use can reduce IQ by 8 points\"?", "The topic is relevant in North Carolina, where a task force appointed by Gov. Roy Cooper recommends decriminalizing marijuana as part of a push for racial justice.", "Turns out, Rouzer overstates the effect of marijuana on the brain and the NIH’s position.", "John Elizandro, Rouzer’s communications director and senior adviser, referred PolitiFact NC to a report compiled by the NIH in July.", "The 42-page report addresses available information on both the health benefits and potential detriments of marijuana use, including whether it can diminish someone’s IQ.", "The report specifically mentions a large study in New Zealand, which found that \"persistent marijuana use disorder with frequent use starting in adolescence was associated with a loss of an average of 6 or up to 8 IQ points measured in mid-adulthood. Those who used marijuana heavily as teenagers and quit using as adults did not recover the lost IQ points.\"", "What Rouzer doesn’t mention in his tweet is that the findings applied only to smokers who began using during their adolescence. The report says of the New Zealand study: \"People who only began using marijuana heavily in adulthood did not lose IQ points.\"", "Furthermore, Rouzer ignores language in the NIH report that explicitly states that more research is needed to establish a link between marijuana use and a decline in IQ points. The report summarizes research this way:", "\"Some studies have also linked marijuana use to declines in IQ, especially when use starts in adolescence and leads to persistent cannabis use disorder into adulthood.", "However, not all of the studies on the link between marijuana and IQ have reached the same conclusion, and it is difficult to prove that marijuana causes a decline in IQ when there are multiple factors that can influence the results of such studies, such as genetics, family environment, age of first use, frequency of use, having a cannabis use disorder, duration of use, and duration of the study.\"", "The NIH webpage summarizing the report mentions other reasons links are hard to establish.", "Different strains of marijuana have varying levels of THC, the main active ingredient in cannabis, the NIH says, and the ability to draw definitive conclusions about marijuana’s long-term impact on the brain \"is often limited by the fact that study participants use multiple substances, and there is often limited data about the participants’ health or mental functioning prior to the study.\"", "The report mentions another study, which tracked 4,000 people over a 25-year period. It found that lifetime exposure to marijuana affected memory \"but did not affect other cognitive abilities such as processing speed or executive function.\"", "We contacted the NIH about its view of marijuana’s effect on a user’s IQ levels.", "Spokeswoman Simona Combi said the NIH believes more research is needed.", "\"The New Zealand study mentioned here has limitations that limit our ability to draw definitive conclusions from it,\" Combi said in an email. \"Per the report, not all studies have come to the same conclusion, and more research will be needed to answer definitively whether marijuana use causes long-term IQ losses.\"", "Rouzer said the \"NIH states that regular marijuana use can reduce IQ by 8 points.\"", "The NIH itself has not actually established a link between marijuana use and loss of IQ points — and it says so explicitly in the report Rouzer cited.", "Rouzer cherry-picked a stat in a study from another country. He then mischaracterized it as the NIH’s findings and tweeted it without proper context, failing to note that it applied only to people who started marijuana use in their adolescence.", "His tweet contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Tweet by U.S. Rep. David Rouzer, a Republican representing North Carolina’s 7th District, on Dec. 3, 2020.", "Email correspondence with John Elizandro, communications director and senior advisor to U.S. Rep. David Rouzer.", "Email correspondence with Simona Combi, senior media manager (contractor) for the office of science policy and communications at the National Institute on Drug Abuse and National Institutes of Health.", "Story by CNN, \"House passes bill decriminalizing marijuana at federal level,\" posted Dec. 4, 2020.", "Story by WRAL, \"State panel calls for not prosecuting possession of small amounts of marijuana,\" posted Nov. 18, 2020.", "Marijuana research report published by the National Institute on Drug Abuse in July 2020.", "Summary of the National Institute on Drug Abuse’s July 2020 marijuana report on its website.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]