["Facebook user ‘Tarunnam Khan’ has caused quite a stir with a post where she claimed that she married her ‘father’ Ayub Khan. The person tagged was Hyderabad Congress leader Ayub Khan whose profile is no longer accessible on the platform.", "Quite expectedly, the Congress leader is facing the brunt of ridicule on social media. A parody account dedicated to actor Mukesh Khanna @TheMukeshK tweeted in Hindi, “Hyderabad “Congress leader Ayub Khan” got married to his daughter Tarunnam Khan. (हैदराबाद के “कांग्रेस नेता”अयूब खान” ने अपनी ही बेटी “तरुन्नम खान” से निकाह कर लिया.)”", "The Hindi text is in fact widely circulating on Twitter.", "Tarunnam Khan’s post was earlier widespread in September. @effucktivehumor shared Tarunnam’s post gathering over 4,000 likes. He is followed by BJP Delhi leaders Kapil Mishra and Tajinder Pal Singh Bagga.", "Another user @BefittingFacts also shared her post, drawing over 3,700 likes.", "A simple reverse-image search of one of the photographs in the viral post led us to a YouTube video from two years ago. It was uploaded by the channel ‘Style World’ and is a hairstyle tutorial. The woman getting a makeover is Tarunnam.", "The pictures were part of a video tutorial on embellished hairstyle and are almost two years old. Therefore, they cannot be Tarunnam’s ‘wedding’ photographs with Ayub Khan which according to her Facebook post happened recently.", "A quick scroll through her online activity suggests that she is a social media influencer who makes ‘entertaining’ videos. Below is one where she’s urging people to vote for PM Modi because he is the only Prime Minister who “sold tea for free on social media accounts”.", "If you’re trying to decipher that joke, don’t.", "We observed that most content posted by Tarunnam makes little to no sense. For instance, a video where she is lip-syncing to the song ‘Chane ke khet mein’ but the caption reads, “Tarunnam Khan | Sizzling Likee Video | After Getting Pregnant With A| Ayub Khan.”", "It’s possible that the bizarre caption is meant to draw views. But she does seem fixated on Hyderabad Congress leader Ayub Khan.", "Her Instagram profile with over 1.2 lakh followers has videos with random Bollywood numbers playing in the background and the Congress leader’s name superimposed on the clips.", "In another video on her YouTube channel, she has juxtaposed photographs of herself with Ayub Khan.", "But the absurdity doesn’t end there.", "In several videos, she has also referred to herself as the wife of Indian cricket team captain Virat Kohli.", "Tarunnam Khan wishes her husband ViratKohli to play well as she will b watch his match onwards IPL – Indian Premier League WorldCup2018", "Posted by Tarunnam Khan Kohli on Thursday, 1 February 2018", "Other prominent personalities that find a mention in her videos are Akash Ambani, Mufti Menk, Amitabh Bachchan and Vijay Mallya. In these posts, she claims that she’s either dating them, is about to marry them, or is already married to them. In an old Facebook video, she also said that Salman Khan is her father.", "A post by an unknown content creator was widely shared owing to its bizarre description. Congress leader Ayub Khan was mocked on social media as the post said he married his own daughter. Despite its apparent falseness, the post was also picked up by several websites including thenewsbangla.com and andhrafriends.com.", "A user also shared a newspaper clipping to support the claim despite the story identifying the man as Afazuddin. The clipping pertains to a report in The Times of India from 13 years ago.", "Telangana Congress leader Ahub Khan married his daughter Tharnum Khan at Hyderabad. pic.twitter.com/YmUKorR3E1", "— P. Nair (@pn906) October 1, 2020", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]