["About this rating", "On 7 December 2015, the web site Christ Church Cincy published a post titled \"Quoting Bible illegal in Cincinnati starting this Wednesday….\" The post was later edited to replace \"pastor\" with \"counselor,\" but it said:", "According to the article it will likely be a done deal on Wednesday of this week. [City Council Member Chris] Seelbach is confident that he has the necessary votes both to make it out of committee tonight and to pass it as law on Wednesday. Although a few states have passed similar laws, no major city has done so, and Cincinnati.com is exultant in claiming that Cincinnati is leading the way in such wickedness.", "Why “wickedness”? Because this law is nothing less than a denial of the biblical doctrine of sanctification, threatening fines of $73,000 per year to a [pastor] that uses 1 Corinthians 6:9-11 to help those caught in sin: “Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived; neither fornicators, nor idolaters, nor adulterers, nor effeminate, nor homosexuals, nor thieves, nor the covetous, nor drunkards, nor revilers, nor swindlers, will inherit the kingdom of God. Such were some of you; but you were washed, but you were sanctified, but you were justified in the name of the Lord Jesus Christ and in the Spirit of our God.” (1 Corinthians 6:9-11).", "The post cited Cincinnati.com as a source and linked to a 6 December 2015 article titled \"Cincinnati to consider ban on reparative therapy for LGBT youth.\" As the title indicated, the ban in question had nothing to do with making it \"illegal\" to quote from the Bible, and it reported:", "Nearly a year after the death by suicide of local transgender teenager Leelah Alcorn, Cincinnati again stands to become a national leader in LGBT rights, with debate scheduled Monday on a measure that would ban reparative or conversion therapy for LGBT youth[.]", "City Council Member Chris Seelbach said Thursday that at Monday’s meeting of the council’s law and public safety committee, he will propose an ordinance that would impose a $200-a-day fine on a therapist or counselor practicing the therapy that aims to “change” lesbians, gay men, bisexuals or transgender people from their sexual orientation or gender identity.", "Passage apparently would make Cincinnati the first major U.S. city to ban reparative or conversion therapy. The Movement Advancement Project, an LGBT organization in Denver that tracks legislation nationwide on reparative therapy, has no record of a city passing an ordinance that would ban the practice.", "Seelbach's concern over the discredited practice of \"conversion therapy\" for gay and transgender youth was not new; in December 2014, he confirmed then-rumors about the death of Ohio teenager Leelah Alcorn to Snopes.com. On 29 December 2014, Seelbach eulogized Alcorn in a Facebook post that was subsequently widely shared, publicizing the circumstances of Alcorn's suicide.", "Ultimately, the original post's title (\"Quoting Bible illegal in Cincinnati starting this Wednesday…\") claimed that Seelbach's efforts criminalized reading from the Bible and pastor's efforts to counsel LGBT congregants. The insinuation was false, as Seelbach's efforts focused solely on the legality of conversion therapy (a practice already banned in California, Illinois, New Jersey, and Oregon):", "Reparative or conversion therapy once was an accepted therapeutic practice but in the past 20 years, professional organizations such as the American Academy of Pediatrics, the American Medical Association, the American Psychiatric Association and the American Psychological Association have forbidden it. Reparative therapy “potentially can lead to severe emotional damage,” in the words of the National Association of Social Workers.", "[article-meta]", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]