["About this rating", "Jan. 10, 2021, marks the five-year anniversary of the death of singer and musician David Bowie. Many online began marking his death by reliving important moments from his decades-long career, particularly when Bowie spoke up against racial inequality in the music industry.", "Around the time of his death in 2016, MTV shared a 1983 interview clip between Bowie and one of its VJs (video jockeys), Mark Goodman, in which Bowie takes the television channel to task for not featuring enough Black artists. The interview went viral again in January 2021.", "The full interview is available on MTV's official YouTube channel, but MTV also shared the moment that went viral:", "https://www.youtube.com/watch?v=XZGiVzIr8Qg&list=FLf9E7t2XT3fEpk7s95hMUSg&index=373", "At the time, the television station was only two years old. After an interview about his work and persona, Bowie wanted to ask Goodman a question of his own, about MTV not playing enough videos of Black artists:", "Bowie: Having watched MTV over the past few months, it's a solid enterprise with a lot going for it. I'm just floored that by the fact that there's so few Black artists featured on it. Why is that?\nGoodman: I think we're trying to move in that direction. We want to play artists that seem to be doing music that fits into what we want to play on MTV. The company is thinking in terms of narrow-casting.\nBowie: That's evident [...] The only few Black artists one does see are on about 2:30 in the morning until 6:00. Very few are featured prominently during the day. I'll say that over the last couple of weeks things have been changing, but it's been a slow process.", "A transcript of key moments of the conversation is reproduced below:", "Goodman: It's funny, I think people have different perceptions. When you wind up watching -- let's say you watch an hour or two or even three a day, people somehow come away with different ideas about what we are doing. We don't have any kind of day-parting for anything, let alone for Black artists, day-parted out of what would be \"prime time.\" We don't have that.\nBowie: Because one sees a lot on -- there's one Black station on television that I keep picking up. I'm not sure which station it's on. But there seem to be a lot of Black artists making very good videos that I'm surprised aren't used on MTV.\nGoodman: Of course, also, we have to try and do what we think not only New York and Los Angeles will appreciate, but also Poughkeepsie or Midwest -- pick some town in the Midwest -- that would be scared to death by Prince, which we're playing, or a string of other Black faces and Black music.\nBowie: That's very interesting. Isn't that interesting?\nGoodman: We have to play the music that we think an entire country is going to like. And certainly we are a rock 'n' roll station. Now, the question would be asked, should, since we're in New York, should [W]PLJ play, you know, the Isley Brothers. Well, you and I might say, well, yeah, because we've grown up in an era when the Isley Brothers mean something to me. And so do the Spinners way after the Isley Brothers. But what does it mean to a 17-year-old? Well, when you talk on the phone to these guys like I did when I was in radio, it's scary.\nBowie: Well, I tell you what it means. I tell you what maybe the Isley Brothers or Marvin Gaye means to a Black 17-year-old. Surely he's part of America as well.\n[...]\nGoodman: Well, what I'm saying, though, is that there's, as you say, there certainly are a lot of Black kids and white kids who may want to see Black music, but there's a ton of them who are -- it's not like it was in '67 where you say, \"Yeah, I'm not into that, but you are? Yeah?\" Now it's, \"You're into that? I don't like YOU.\" And that's scary, and we can't just turn around and go, \"Well, look, this is the right way!\" We can only teach, I think, a little bit at a time.\nBowie: Interesting. OK, thank you very much.\nGoodman: Does that make sense? Is it a valid point?\nBowie: [Smiling] I understand your point of view. [Laughs]", "By the end of the interview Bowie, who would later be married to Somali model Iman, did not seem entirely satisfied by Goodman's responses.", "Given that the interview was released on MTV's official YouTube channel, we rate this claim as \"True.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]