["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Tom Reed. File/Buffalo News", "Rep. Tom Reed weighed into the debate over how to begin the new school year amid the Covid-19 pandemic. It should be up to local authorities - not the state - to establish their re-opening plans, Reed said.", "\"I caught the governor’s comment yesterday that ‘opening the schools is not the president’s choice,’\" Reed said during a news conference in Buffalo on July 9. \"That’s true. That is a local determination, but it’s not a state determination.\"", "Reed, a Republican from Corning who said he wants to see schools re-open, said that the state \"should defer to the local school districts, and the superintendents, and the school boards. They’re the ones that know their school districts.\"", "He added: \"It’s not the governor’s call either. It’s the local officials that should be doing that.\"", "Since reopening schools matters to parents, teachers and employers among many others, we wondered if Reed is correct, that the decision to reopen is a local determination, not a state one.", "We consulted with five people who work in education and know New York well, including lawyers, people who study education and a representative of school superintendents.", "Their opinions differed on Reed’s statement. Some said an argument could be made for local or state authorities holding the power, while others said that executive authority during an emergency gives the governor control. Another said the state has authority over the districts regardless of whether a state of emergency has been declared.", "During an emergency, the governor has complete authority to open and close public schools, said Brian Backstrom, director of education policy studies at the Rockefeller Institute of Government, part of the State University of New York. The details of how schools will operate will be left to the state Board of Regents in consultation with districts, but the governor will set the standards for when districts can be open, Backstrom said.", "A spokesman for Gov. Andrew Cuomo, Jason Conwall, said that schools typically have local authority, but that during a declared emergency, the governor’s powers supersede local governments. The schools were closed by an executive order, Conwall said, and will be reopened by one.", "Conwall directed us to several executive orders that Cuomo has issued since the coronavirus became a concern in New York, including 202.4, which closed \"every school in the state of New York\" by March 18, for two weeks. It was subsequently extended by other orders. On May 7, executive order 202.28 closed schools through the end of the school year. These orders stipulated that state aid would not be lost by the districts because they are closed. An executive order on June 5 allowed for in-person special education instruction for summer school. A subsequent order, 202.45, issued June 26, continued to close schools to in-person instruction, except for special education.", "The executive director of an organization that advocates for public school students said that districts are creations of state governments, and that states have authority over opening and closing, even in non-emergency situations.", "\"When you think about it legally, in New York, like in all 50 states, (states) are required to maintain and support public school systems,\" said David Sciarra of the Education Law Center, which is based in New Jersey and is partially funded by teachers’ unions.", "\"Authority is granted by the state, period, pandemic or not,\" he said.", "But some experts said that in times when an emergency has not been declared by the governor, the circumstances would be different.", "Several, including Robert Lowry, deputy director for advocacy, research and communications at the New York State Council of School Superintendents, said that public schools must be in session for 180 days in New York or they risk losing state aid for every day they are not in session.", "\"A district could elect to remain closed, but few districts would be willing to go more than a few days losing aid,\" Lowry said.", "Lowry pointed to Section 3604 of state education law, which provides that the state education commissioner may forgive state aid penalties for \"any day or days on which session had been previously scheduled but the superintendent was required to close the school or schools due to a properly executed declaration of a state or local state of emergency.\" Cuomo signed such an executive order on March 7.", "Kathryn McCary, an education lawyer based in Schenectady, said that although public school districts have \"significant local autonomy\" and are funded with property taxes raised locally, they are dependent upon state aid, as well as federal funding for certain programs. \"So yes, it is theoretically a local decision, but it isn’t an unconstrained one,\" she said.", "David Bloomfield, an education lawyer and professor at Brooklyn College and The CUNY Graduate Center, said that in New York, reopening would typically be a local determination, as long as the district meets the statutory 180-day minimum attendance requirement. But Cuomo, under executive powers conferred to him by the Legislature, has emergency authority that preempts local school boards.", "We also approached Reed’s office for evidence of his claim.", "\"School districts in collaboration with other local elected officials, teachers, and parents, as opposed to one-size-fits-all mandates from Albany, should determine school reopenings,\" Reed said in a statement. \"Members of our school boards are duly elected by the communities they serve and are in the best position to determine the appropriate course of action for their students and teachers, including when to safely reopen.\"", "In April, PolitiFact New York found that both New York state and New York City had authority to close New York City schools.", "Reed said that the decision to open schools is not a state determination. School calendars are typically set by districts, as long as they can meet the state’s 180-day statutory requirement.", "During this pandemic, however, the governor closed the schools by executive order, and Cuomo’s spokesman said that he will be opening them by executive order. A few days after  Reed made his statement, the executive branch and the state Education Department announced guidelines and detailed what should be contained in plans for re-opening.", "If districts do not work with the state, and seek its approval for their reopening plans, they could lose state funding.", "We rate Reed’s statement False.", "YouTube, \"Congressman Reed holds press conference with state leaders,\" via WNY News Now, July 9, 2020.", "Phone interview, Brian Backstrom, director of education policy studies, Rockefeller Institute of Government, July 15, 2020.", "Phone interview, email, Jason Conwall, spokesperson, Gov. Andrew Cuomo, July 15, 2020.", "Email interview, David C. Bloomfield, professor of education leadership, law and policy, Brooklyn College and The CUNY Graduate Center, July 14, 2020.", "Phone interview, David Sciarra, executive director, Education Law Center, July 15, 2020.", "Email interview, Kathryn McCary, lawyer, July 14, 2020.", "Email interview, Robert Lowry, deputy director for advocacy, research and communications, New York State Council of School Superintendents, July 14, 2020.", "New York State Executive Orders 202, 202.2, 202.4, 202.11, 202.14, 202.18, 202.28, 202.37, 202.45, 202.48, 202.47. Accessed July 15, 2020.", "New York State news release, \"Governor Cuomo Announces New Data-Driven Guidance for Reopening Schools,\" July 13, 2020. Accessed July 16, 2020.", "New York State Department of Education news release, \"State Education Department Presents Framework of Guidance to Reopen New York State Schools,\" July 13, 2020. Accessed July 16, 2020.", "PolitiFact New York, \"Both Cuomo, de Blasio can exercise power to close NYC schools,\" April 30, 2020.", "New York State Consolidated Laws, Education, Section 3604. Accessed July 16, 2020.", "Emailed statement, Rep. Tom Reed, July 17, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]