["About this rating", "The December 2016 conviction of Charleston church shooter Dylann Roof led to the recirculation of related conspiracy theories and fake news, including an old report that Roof had been raped in prison by fellow inmates:", "Shocking news out of South Carolina as it is being reported that Dylann Roof, the Charleston Church Shooter ... remains in critical condition in a prison infirmary for treatment of multiple injuries due to being sexually assaulted numerous times. He is also being put on a suicide watch. Apparently two African-American prisoners were responsible for the assault according to the correction officer who was on duty.", "Although the item was appeared on the fake news web site NYMeta in July 2015 (not long after Roof's initial identification and arrest), the outwardly undated piece was spread again after his December 2016 conviction led to his name again appearing in headlines. The storyline appealed to many social media users' desire for justice due to the gravity of Roof's crime and his targeting of peaceful black congregants.", "However, items published by NYMeta (largely inactive in December 2016) were not meant to be taken seriously. Before claiming Roof was raped in prison, the site featured items asserting a morbidly obese woman gave birth to a 40 lb. baby, that Facebook's \"rainbow filter\" was a danger to users, and that Kansas kindergarteners were exposed to Ebola via a substitute teacher.", "A disclaimer on the site reads:", "NY Meta is an entertainment website. We post the latest trending articles circulating the web. Whether interesting, controversial, abnormal, thought provoking or satirical we aim only to entertain with the stories we publish.", "In real news, Roof was reportedly beaten, but not raped, by a black inmate while detained at the Charleston County Detention Center in August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]