["About this rating", "A surprisingly well-populated genre of internet rumor deals with photographs and videos supposedly showing trash left behind after major public events, such as a parade, concert, or political rally. On 19 June 2019, we came across yet another piece of media that supposedly showed lawn chairs, coolers, and garbage littered across a field outside of the Amway Center in Orlando, Fla., where U.S. President Donald Trump had kicked off his 2020 presidential campaign the night before:", "This deplorable mess left by Trump’s piglets in Orlando is very symbolic of what will be left to the next president after this MAGA nightmare is over. pic.twitter.com/fMVOV6QAti", "— Max Howroute▫️ (@howroute) June 20, 2019", "Before Trump took the stage to officially kick off his 2020 campaign, his supporters gathered outside of the center for a \"45 Fest.\" The all-day tailgate featured live music, food trucks, rain, and plenty of Trump memorabilia. When it was time for the crowd to move inside for Trump's speech, many attendees left their chairs, and trash, outside on the lawn, as Orlando TV station WOFL reported:", "They came, they partied, they left a mess. Downtown Orlando is slowly getting back to normal, after President Donald Trump’s visit on Tuesday evening to officially launch his 2020 re-election bid.", "It’s time to take out the trash downtown. After Tuesday night’s party, downtown is feeling a bit hungover but many are happy about the money they brought in at the the \"45 Fest\" party.", "Lots of items and trash were left behind. The city says it’s up to the Trump campaign to take out the trash and pay for it. Meanwhile, businesses nearby felt the effects of the rally Tuesday night.", "Much of the footage in the above-displayed video can be seen in local news reports about the event. A small gallery of photographs of the items left behind after the rally can also be viewed on Orlando Sentinel.", "A video report from WOFL can be viewed below:", "One should note a major cleanup is almost always required after a large public gathering. WESH-TV in Orlando reported that Orlando's contract with Trump's campaign stipulated that the city would be responsible for all clean-up after the event, but that Trump's campaign would be responsible for the bill.", "Concha, Joe.   \"Trump 2020 Kickoff Rally Delivers Nearly 5M Viewers for Fox News.\"\r\n    The Hill.   20 June 2019.", "Lara Greenberg.   \"After Trump Rally, Comes the Clean-Up.\"\r\n    WOFL-TV.   19 June 2019.", "Orlando Sentinel.   \"Pictures: Cleanup at Camp Trump Outside Amway Center.\" \r\n    19 June 2019.", "WESH-TV   \"President Trump Announces Re-Election Bid at Orlando Rally.\"\r\n    19 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]