["“Gelsemium 200, Homeopathy medicine for Nipah Virus, Weekly 3 doses for 3 weeks. It can protect you from the virus. Please do share it with your friends and family…May you all be safe”", "Following the outbreak of Nipah Virus infection, a message has been viral on social media claiming a homeopathic pill Gelsemium 200 can protect people from the deadly virus. Many of the social media messages are also accompanied with the following image.", "During the course of this article, we will discuss:", "1. Nipah virus infection – Extent of outbreak, symptoms and causes 2. World Health Organization’s (WHO) statement which states that there is no official drug or vaccine for Nipah virus infection. 3. Publicly available studies on Gelsemium 200 which proves its ineffectiveness as a treatment (or as a preventative measure) for Nipah virus infection.", "Following the outbreak of the Nipah Virus infection that started off in Kerala and possibly spread to Karnataka, 15 people have died suspected from this infection. In Kolkata, a soldier has also reportedly died due to a suspected Nipah virus infection after a trip to Kerala.", "Symptoms of Nipah virus infection are both respiratory and neurological and can be presented as an acute respiratory infection (flu like symptoms), headache, fever or can be asymptomatic. Another 16 have been diagnosed and the case fatality rate is about 86%.", "World Health Organization (WHO) has stated that Nipah Virus (NiV) infection is a form of zoonosis, a disease that transmits from animals to humans, is spread through consumption of palm sap that has been contaminated by fruit bats – a natural host of the virus but have also been found to spread from pigs and through human-human contact.", "A lot of misinformation has been shared on social media and on whatsapp about alternative treatments for NiV infection. The message quoted at the start of this article was shared about 5 days ago and is still viral on social media. Is there any truth to the claim?", "World Health Organization (WHO) has stated that there is no official drug or vaccine for Nipah infection. The primary treatment for both animals and humans is intensive support care such as isolation, hygiene and symptomatic treatments.", "The drug Gelsemium 200, a homeopathic therapy is prescribed as one of the forms of treatment for dengue by the Ministry of AYUSH, and the Central Council for Research in Homoeopathy (CCRH), a government body for homeopathy research under the ministry of AYUSH.", "It should also be noted that according to WHO guidelines, neither treatment nor vaccine has been found for dengue fever as well, and therapy is heavily reliant on supportive care.", "While the AYUSH ministry or its ministers haven’t officially suggested this treatment for Nipah virus infection, but only for dengue, we assessed, whether it is known to have any efficacy at all in both, NiV and dengue infection, or any other conditions.", "We found two human studies that discussed that effect of Gelsemium in anxiety and heart rate variability and used the dilutions of this homeopathic drug with 5CH/15CH and 200CH respectively.", "The Gelsemium 5CH/15CH study, published in The Journal of Fundamental and Clinical Pharmacology, reported no significant changes in anxiety in patients as compared to a placebo treatment (e.g. sugar pill).", "Whereas, the Gelsemium 200CH study conducted at CCRH and published in The Journal of Alternative and Complementary Medicine reported small changes in heart rate variability with only a small number of sample size (n=5 subjects) out of which only 60% (n=3 subjects) responded to changes in heart rate 20% (n=2 subjects) responded to changes in blood flow.", "Such small sample sizes and its effects due to a random chance event or experimenter bias as the study was not double blinded.", "Most importantly Gelsemium 200 is a diluted drug as per homeopathic dilutions procedures in either alcohol or water poured over sugar pills, where 200 is the centesimal scale of the dilution that equated to 30x.", "In homeopathy, 1x means the main concentrated drug called “mother tincture” drug is diluted to a 1/100 (decimal scale: 10-2) dilution rate and then shaken vigorously (dynamization). Repeated this procedure 30x times will give a result described in the drug formulation above.", "That means, for Gelsemium 200, only 1 ml drug is present in 10000000000, 0000000000, 0000000000 ml of water or alchohol.", "This hypothesis that suggests such weak dilutions of any drug, whether Gelsemium 200 or other drugs prescribed by homeopathy can cure anything better than plain sugar pills is unscientific. In live systems such as cells, or animal and human bodies, there is need for a minimum dosage of any active ingredient, to have an effect and homeopathic dilutions do not meet that standard.", "For further reading on how drug formulations work in homeopathy, read our previous article Is homeopathy an effective form of treatment? at AltNews.", "It is evident that the drug Gelsemium 200 has no effective role in Nipah Virus therapy and such information should not be spread.", "Particularly, in cases of priority diseases, information spread through social media can have harmful consequences such as self-treatment and denial of treatment of supportive care by assuming an alternative treatment will be able to cure the illness.", "If anyone is with found with acute symptoms of Nipah virus infections, it is advisable to isolate and seek help at the nearest medical facility. Secondary infections are highly prevalent in family and friends as well as health care workers.", "Researchers in the USA and Japan are conducting experiments to find effective solutions for Nipah virus infections such as antiviral Favipiravir (T-705) but it has only been tested in animal models so far. However, it cannot be used in patients infected with Nipah virus without appropriate testing in humans. Other studies published have also been listed on PUBMED.", "For further reliable information, read the factsheet by WHO with respect to Nipah virus infection.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]