["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Joe Biden (left) and House Speaker Paul Ryan applaud President Barack Obama during Obama's State of the Union address on Jan. 12, 2016. (Associated Press)", "As U.S. House Speaker Paul Ryan discussed the repeal and replacement of the Affordable Care Act, a top priority of President-elect Donald Trump, he made a claim about the financial health of Medicare.", "\"What people don’t realize is, because of Obamacare, Medicare is going broke,\" the Wisconsin Republican told Fox News host Bret Baier on Nov. 10, 2016.", "The Affordable Care Act certainly has its detractors. When Ryan claimed the same month that Obamacare is not a popular law, our rating was Mostly True. The polls generally showed most Americans had an unfavorable opinion of it.", "But surprisingly for Ryan, who is regarded as a federal budget expert, his claim about the law flies in the face of evidence that it actually helps shore up Medicare.", "What the ACA did on Medicare", "https://www.sharethefacts.co/share/7de6b429-1d9a-42de-ad08-c7998eaa6ca5", "Here’s how Marc Goldwein, senior policy director at the Committee for a Responsible Federal Budget, lays it out:", "On one side of the ledger, Obamacare slowed the growth of Medicare spending by, among other things, reducing increases in payments made to nearly all health care providers.", "On the other side of the ledger, the law included a surtax on high-income earners that brings more money into Medicare.", "Two health care policy experts further told us that the combination of spending curbs and revenue increases for Medicare Part A -- which covers hospital, nursing home and home care services, and is financed mainly through payroll taxes -- has extended the solvency of Medicare.", "(Medicare Part B, which is voluntary, covers doctor visits and some medical care.)", "Paul Ginsburg, a professor of the practice of health policy and management at the University of Southern California, pointed us to an October 2016 report from the nonpartisan Congressional Research Service.", "The report noted that in 2010, the Medicare trustees projected that Obamacare’s spending curbs and revenue increases would mean Medicare’s Hospital Insurance Trust Fund, which finances Part A, would remain solvent until 2029.", "That’s 12 years later than had been projected a year before the Affordable Care Act became law.", "(The projection has since been revised to 2028.)", "Michael Sparer, a professor health policy and management at Columbia University in New York, put it this way, financially speaking:", "If Obamacare were repealed completely, \"it would put Medicare in worse shape, not better shape.\"", "Finally, it’s worth noting that both Factcheck.org and the Washington Post Fact Checker also concluded that Ryan’s claim is wrong. They both also noted that, even if the Part A trust fund did become depleted in 2028, the program wouldn’t be broke, in that it is still set up to cover an estimated 87 percent of expenses.", "FactCheck.org’s rating was false and the Fact Checker gave Ryan its worst rating, four Pinnocchios, which is for statements deemed to be \"whoppers.\"", "Ryan’s office opted not to provide us any information to support his claim.", "Our rating", "Ryan said: \"Because of Obamacare, Medicare is going broke.\"", "Financially, Medicare isn’t entirely in the clear, given that actuaries project that a key reserve fund will run out of money in 2028.", "But the Medicare trustees themselves, along with a host of experts, say the Affordable Care Act’s changes to Medicare -- including holding the line on spending and raising taxes -- actually puts Medicare in better shape than before the law was adopted. That’s a long way from making Medicare go broke.", "We rate Ryan’s statement Pants on Fire.", "Fox News, Paul Ryan interview (6:00), Nov. 10, 2016", "Email, Paul Ryan press secretary Ian Martorana, Dec. 12, 2016", "Interview, Committee for a Responsible Federal Budget senior vice president and senior policy director Marc Goldwein, Dec. 19, 2016", "Center on Budget and Policy Priorities, \"To Repeat: Medicare Isn’t Going ‘Bankrupt,’\" Dec. 5, 2016", "Congressoinal Research Service, \"Medicare: Insolvency Projections,\" Oct. 5, 2016", "Email, University of Southern California professor of the practice of health policy and management Paul Ginsburg, Dec. 20, 2016", "Email, Urban Institute Health Policy Center co-director Stephen Zuckerman, Dec. 19, 2016", "Interview, Columbia University professor health policy and management Michael Sparer, Dec. 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]