["An image of “5D medical beds” has been shared in multiple Facebook posts alongside a claim that the technology will soon make “3D hospitals” obsolete. The claim is misleading: the image attached to these posts is a 3D model render which was originally posted on a stock image site.", "The Facebook post was published on February 17, 2021.", "“The concept of ‘Death’ will soon be a thing of the past,” the caption reads in part.", "“5D Medical Beds made with Crystalline Heart based technology will soon make every 3D hospital obsolete. Soon this newfound Freedom will make ‘Time’ a thing of the past.”", "5D refers to five dimensions, part of a hypothesis that there are additional unseen dimensions other than the three spatial dimensions (height, length and width) and the fourth dimension of time that humans can perceive, according to HowStuffWorks.", "Some social media users appear to have been misled and believed those are genuine 5D medical beds in the image:", "The image has also circulated here and here on Facebook with the same claim.", "However, the claim is misleading.", "A reverse image search of the image on Google found this identical image on Turbosquid, a website which sells stock 3D model renders.", "3D model rendering is the computer graphics process of converting 3D models into a 2D image that can be viewed on a screen.", "The page of the product entry, titled “Sci Fi Laboratory Model 3D”, showcases images of 3D models from artist cermaka.", "A description for the product entry reads: “HIGH POLYGON 3D model of Futuristic Sci Fi Laboratory Model. Detailed and realistic. Suitable for visualizations, advertising renders and other.”", "Below is a screenshot between the image in the misleading Facebook post (L) and the image of the 3D model rendering on Turbosquid(R):", "A Google search of “5D Medical Beds” did not produce any search results, nor did “Crystalline Heart based technology” -- although “Crystalline Heart” is an item in the video game Guild Wars 2.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]