["The photo was published on Facebook here on July 18, 2020. It was shared more than 7,200 times before it was deleted.", "The post’s Urdu-language caption translates as: ““Look at the atrocity of PTI folks”.", "PTI is acronym for the ruling Pakistan Tehreek-e-Insaf political party, which is headed by Prime Minister Imran Khan and came into power in August 2018.", "The post also contains an image of two boxes of Nuberol Forte, a painkiller and muscle relaxant. One box bears a manufacturing date of June 19, 2018 and is priced at 79.20 rupees (USD 0.47). The other box is marked with a date of June 6, 2018 and is priced at 426 rupees (USD 2.50).", "Below is a magnified cross section of the photo to show the printed information clearly:", "The same photo was also shared on Facebook here, here, here and here and on Twitter here and here alongside a similar claim.", "The claim, however, is misleading.", "The manufacturing date stamp on the boxes -- June 2018 -- predate the current PTI administration, which came into office in August 2018.", "A sales officer for Searle, the pharmaceutical company that manufactures Nuberol Forte, also said that the photo had been digitally manipulated.", "“I can confirm that Nuberol Forte was never priced 426 rupees,” the officer, Tahir Mubeen, told AFP by telephone on July 21, 2020. “The price info on the box has been doctored. We keep on seeing such fake news on social media and are aware of it.”", "Prices of a particular drug are regulated by the government across Pakistan. This document published by Pakistan's Drug Regulatory Authority on July 15, 2020 stipulates that revised prices must be approved by the authority.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]