["Justice Daniel Kelly used a Marquette law professor’s blog post as evidence that he can set aside his conservative views on the bench.", "But the post is from 2017 and only analyzes one type of case.", "Kelly’s claim also ignores a more recent analysis that assigns the title of “maverick” to another justice.", "State Supreme Court Justice Daniel Kelly likes to paint himself as a \"constitutional textualist.\"", "Kelly’s bid to hold onto his seat against Dane County Circuit Judge Jill Karofsky in the April 7, 2020 election has pitted conservatives and liberals against each other, with the state GOP and President Donald Trump backing Kelly, while Karofsky has the support of Democrats.", "But Kelly claims that on the bench he sets aside his conservative views and focuses only on the letter of the law.", "He made that argument again during a March 8, 2020 interview on WISN TV’s UpFront, and used a blog run by a Marquette law professor to bolster his claim. That professor, Kelly said, found no correlation between his opinions and conservative background and even called him a maverick.", "\"He starts out with what he believes he knows about my politics, and then he compares the opinions that I write and join,\" Kelly said. \"He’s looking to see if there’s any necessary correlation between the two. And his conclusion was that there’s not a necessary correlation there, and in fact, he called me a maverick.\"", "A professor who analyzes state Supreme Court justices did suggest Kelly could be a maverick among conservatives — in 2017, and in one type of case. But a more recent review of opinions indicates that title may belong to another justice.", "So how does Kelly’s claim stack up?", "The blog Kelly referenced, SCOWstats, is run by Marquette University history professor Alan Ball.", "When asked for evidence to back Kelly’s claim, his campaign referred PolitiFact Wisconsin to an Oct. 16, 2017 post by Ball titled \"Justice Kelly a Maverick? An Update on Fourth Amendment Cases.\" In that piece, Ball found that Kelly and Justice Rebecca Bradley were more receptive to Fourth Amendment arguments than their predecessors.", "Reminder: The Fourth Amendment of the U.S. Constitution protects people against \"unreasonable searches and seizures.\"", "Most Fourth Amendment cases that come before the state Supreme Court are criminal ones, Ball told PolitiFact Wisconsin. That could mean the search of a vehicle in a drug case, as one example. Liberal justices tend to be more sympathetic to defendants, Ball said, while conservatives often support the state and agree the evidence was admissible.", "Ball noted that Kelly had only cast a small number of votes at the time of writing and said \"this early impression will need to be checked against the results from subsequent terms.\"", "But Ball was struck by an opinion written by Kelly that cautioned against giving the state Legislature the power to erode people’s constitutional rights, using arguments that could have come from a more liberal justice.", "\"There are certain parts of the State that experience a disproportionate amount of crime,\" Kelly wrote in his opinion for State of Wisconsin v. Navdeep S. Brar. \"Perhaps the legislature might decide police need greater access to homes and other buildings in such areas.\"", "To Ball, that opinion and Kelly’s receptiveness to Fourth Amendment arguments distinguished him from other conservatives.", "\"Thus, if one were asked to predict who might emerge, if only occasionally, as a maverick among the court’s five ‘conservatives’ in the upcoming term, the most conceivable candidate could well be Justice Kelly, and a promising place to look for evidence of this would be his separate opinions in Fourth Amendment criminal cases,\" Ball wrote.", "While Kelly cited the post as evidence that he’s an independent thinker, it’s not quite that straightforward.", "Pay attention to Ball’s phrasing. He didn’t outright call Kelly a maverick — he instead speculated that the justice could emerge as a possible, but only occasional maverick.", "Plus, Ball wrote that post after Kelly’s first term and focused only on Fourth Amendment cases. That’s certainly not enough for Kelly to hinge his identity on.", "Kelly’s claim also omits some key information: Ball wrote another, more recent, blog post assigning the title of maverick to someone else.", "On Jan. 30, 2020, Ball argued in a post that Justice Rebecca Bradley is proving to be more independent than Kelly. The two were in lockstep during the 2016-17 term, Ball’s data show, but Bradley has increasingly deviated from her fellow conservatives.", "In 2018-19, for example, Kelly voted with conservative Chief Justice Patience Roggensack on two more cases than Bradley, according to Ball. Kelly voted with Justice Annette Ziegler 74% of the time that term, compared to 63% for Bradley.", "So far this term, Kelly has voted with Roggensack and Ziegler on every case, while Bradley has only voted with them 43% of the time. Ball expects that gap to close as the term progresses, but said Bradley — as it stands now — is still twice as likely to disagree with other conservatives than Kelly.", "\"If you wanted to call any of them a maverick, she would be a better candidate this year than Kelly,\" he said.", "Translation: Kelly is relying on an outdated analysis as evidence of his independence.", "In a TV interview, Kelly claimed that a Marquette law professor called him a \"maverick\" and found no correlation between Kelly's opinions and conservative background.", "The professor analyzed Kelly’s rulings on Fourth Amendment cases in 2017 and determined that Kelly \"might\" emerge as a maverick after standing out among his fellow conservatives. But that’s hardly enough to stake an identity on.", "And earlier this year, Ball awarded the label to a new justice: Rebecca Bradley. Kelly’s claim completely disregards the most up-to-date analysis of his opinions.", "A statement is Mostly False when it contains some element of truth but ignores critical facts that would give a different impression.", "That fits here.", "Justice Daniel Kelly calls charge ‘ugly slander,’ UpFront, WISN, March 8, 2020.", "Email from Charles Nichols, campaign manager for Friends of Justice Daniel Kelly, March 20, 2020.", "Justice Kelly a Maverick? An Update on Fourth Amendment Cases, SCOWstats, Oct. 16, 2017.", "A New Maverick on the Wisconsin Supreme Court?, SCOWstats, Jan. 30, 2020.", "Wisconsin Supreme Court race will pit Daniel Kelly against Jill Karofsky, Milwaukee Journal Sentinel, Feb. 18, 2020.", "Legal Information Institute, Cornell Law School, accessed March 24, 2020.", "Interview with Alan Ball, professor of history at Marquette University, March 24, 2020.", "Email from Alan Ball, professor of history at Marquette University, March 24, 2020.", "State of Wisconsin v. Navdeep S. Brar, Supreme Court of Wisconsin, accessed March 24, 2020.", "Merriam-Webster, accessed March 24, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]