["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This photo, which a chain email says came from a 2012 Arizona border raid, came from a 2010 raid elsewhere in Mexico.", "The photos tell a story.\n\nBut is it the one a chain email says they tell?\n\nA screed popping into in-boxes in April 2012 says it depicts a raid on the U.S.-Mexico border, where U.S. border patrol, Mexican patrol, Arizona SWAT teams and \"sheriff’s undercover agents\" seized an impressive cache of assault weapons, ammunition, grenades and launchers.\n\nMore than two dozen photos support the narrative: Tarps covered with weapons. Men in military garb sorting clips loaded with bullets. Unmarked SUVs. Recovered uniforms.\n\nSeveral images still carry Spanish-language captions.\n\n\"Why was there no news coverage of this raid on the Arizona border?\" the email says. \"Seizure was just five days ago. Right on the Arizona border!\"\n\nThe message text includes a date: March 2, 2012.\n\nA reader sent us the message, saying she had received it from at least three people in recent days.\n\nWe had to know: Did a significant raid take place in early March along the Arizona border that mainstream media failed to report?\n\n‘WE MUST PROTECT OUR BORDERS!!!!!’\n\nThe email begins:", "This is terrifying that we are seeing NONE of this on the news!!! WE MUST PROTECT OUR BORDERS!!!!!", "This is the 2nd raid this year - this one took place on 3/2/12 at 3 am - Border Patrol, Mexican Patrol, AZ swat teams and sheriff's undercover agents. I worked with one of the agent's dad for 25+ years and he sent these pictures this afternoon.", "3-7-2012", "Our country is in BIG trouble....Why was there no news coverage of this raid on the Arizona border?", "Definitely NOT Jose wishing to come pick lettuce!", "This is exactly why we MUST support ARIZONA.", "This seizure was just five days ago. Right on the Arizona border! This is but one seizure that has taken place along the border over the past year. There have been many more like this (but you won't hear about it on major media news). Not a mention on ABC - CBS - NBC - MSNBC - or CNN news- - even on FOX. These photos and reports come from a Spanish language news source.", "Thank God for the border patrol and that they did not allow this to get in. Huge stash of assault rifles (grenade launchers in center!).", "So, was there an Arizona border raid?\n\nUm, no.\n\nThe first clues are in the Spanish-language photo captions. They refer just to an operation by \"the military,\" near the municipality of Higueras. One says the raid happened at 10 a.m. about a third of a mile from the Marin-Higueras highway. Another says at least 25 offenders escaped to the mountains.\n\nAny reference to the United States? No. Arizona? No. March 2012? No.\n\nA quick Web search for roads identified in the photo captions turns up another false note: a YouTube video posted not last month, but in May 2010. It includes the same images repeated in the email message.\n\nThe Mexican town of Higueras, it turns out, is about 800 miles from the Arizona border. It’s more than 130 miles from Nuevo Laredo, Texas. (Or, by another measure, about 70 miles from the U.S. border.)\n\nSnopes debunked a version of this chain email in August 2010.\n\nA Newsweek article on May 17, 2010, says the Mexican military discovered a major training camp run by the Zetas drug cartel. Maybe you heard about the raid — back when it actually happened.\n\nOur ruling\n\nA chain email in April 2012 recycles images from a raid that happened nowhere near Arizona, and certainly not on March 2, 2012. \"Why was there no news coverage of this raid on the Arizona border?\" it says. \"Seizure was just five days ago. Right on the Arizona border!\" You didn’t see it on the news for an excellent reason: It’s not news. It’s instead a ridiculous claim that warrants a rating of Pants on Fire.", "Chain email sent April 6, 2012\n\nYouTube, \"revientan en Higueras ,Nuevo León. narcocampamento,\" uploaded May 11, 2010\n\nGoogle Maps, Agua Prieta, Ariz. to Higueras, Mexico, accessed April 10, 2012\n\nGoogle Maps, Nuevo Laredo, Texas, to Higueras, Mexico, accessed April 10, 2012\n\nSnopes, Arizona Border Arsenal, Aug. 18, 2010\n\nNewsweek, \"Is the Flow of U.S. Weapons to Mexican Drug Cartels Increasing Under Obama?\" May 17, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]