["About this rating", "In Florida and many other states, convicted felons are not allowed to vote during the time they serve their sentences. Prior to the adoption of Florida Amendment 4 during the 2018 midterm elections, an ex-felon’s right to vote was not guaranteed post-sentence, either. Now that right is re-granted to felons who have completed their sentences so long as their convictions were not for murder or felony sex offenses.", "The issue of disenfranchising felons from voting applies only to individuals who have been convicted, however. Those who are being held in jail awaiting trial but have not yet been convicted of any crime are still eligible both to register to vote and to vote. This fact was highlighted by the father of one of the victims of the February 2018 Parkland high school shooting, Andrew Pollack, who tweeted out a photograph of confessed shooter Nikolas Cruz’s voter registration, which showed that he registered to vote on 25 July 2018 while behind bars, using the jail’s address as his mailing address, and that he registered to vote as a Republican:", "I'm sick to my stomach. 18-1958 murdered 17 students & staff, including my daughter Meadow. Yet in July, Broward Sheriff @ScottJIsrael let people into the jail to get him & other animals registered to vote.The Despicable Democrats have no shame.Can't let them steal this election. pic.twitter.com/qWisidEpek", "— Andrew Pollack (@AndrewPollackFL) November 10, 2018", "While the claim that his registration is part of a Democratic plot to “steal” the 2018 election does not hold up to scrutiny and is belied by the fact that he registered as a Republican, it is true that Cruz was able to register to vote from jail, and that he would have been allowed to cast a vote in the 2018 midterm elections. This is because Cruz has yet to face trial for the crime he confessed to and therefore is not currently a convicted felon.", "Broward County sheriff's office spokesperson Veda Coleman-Wright explained to several news outlets, including the Washington Post, that not allowing Cruz this right would be unconstitutional:", "In general, jail inmates are constitutionally entitled to register and vote before their trials, assuming no prior convictions or legal disqualifications. Broward County records show that in 2016 and previous elections, several inmates did exactly that from the same jail where Cruz now sits. “It’s absolutely normal. It’s his constitutional right,” said Broward County sheriff’s office spokeswoman Veda Coleman-Wright. “Nothing different happened this year from any other year.”", "Lopez, German.   \"Florida Votes to Restore Ex-Felon Voting Rights With Amendment 4.\"\r\n    Vox.   7 November 2018.", "McMahon, Paula, and Brittany Wallman.   \"Watch Parkland Shooter Wail in Brother's Arms in Confession Video.\"\r\n    Vox.   8 August 2018.", "Selk, Avi.   \"Conservatives Are Irate the Parkland Shooter Registered to Vote from Jail — As a Republican.\"\r\n    The Washington Post.   12 November 2018.", "Chavez, Nicole and Ralph Ellis.   \"Nikolas Cruz Waives Right to Speedy Trial.\"\r\n    The Washington Post.   27 April 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]