["About this rating", "In early February 2020, a Facebook post circulated claiming the 2020 presidential campaign of former U.S. Vice President Joe Biden removed a flag in a public library in Iowa in preparation for an event held there. We include a screen capture of the post with the Facebook user's name cropped out for privacy:\n\nThe above post contains elements that are accurate and others that are not.", "The wife of 2020 the presidential candidate, Jill Biden, did visit the public library in Corning, Iowa, on Jan. 24, 2020. And an American flag was moved out of a room in the library where the Biden group met.", "What is inaccurate is the assertion that the \"library staff was told to remove the American flag as they did not want to say the pledge of allegiance. The librarian refused so the campaign people went out and took it down themselves!\"", "Fred Shearer, president of the library board, told us by phone that the Biden campaign rented a meeting room in the Corning Public Library and arranged the room themselves, and the library staff had nothing to do with that. \"We just rent the room and they arranged it the way they chose,\" Shearer said.", "The Biden team moved a roughly 5-foot-tall flag pole with an American flag in the corner of the room \"probably 5 feet into a hallway next to the room,\" Shearer added.", "We reached out to the Biden campaign to ask why someone moved the flag. A spokesperson for the campaign informed us that Jill Biden had nothing to do with that action. Instead, a campaign staffer noticed the flag was not dressed properly, meaning the way it was displayed did not meet etiquette standards, and the problem couldn't be resolved in time for the event.", "The spokesperson added that the decision had nothing to do with reciting the Pledge of Allegiance and pointed out that Joe Biden's deceased son, Beau, was an Iraq War veteran.", "The allegation that American flags were absent or otherwise disrespected at political events is a common election season trope, and it is often misleading.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]