["About this rating", "A compilation of violent video clips taken in the United States and Canada over the span of some thirty-odd years was presented on the Facebook page \"The Real Red Elephants\" in October 2018 as if it showed the \"left-wing mob that President Trump had recently talked about\":", "(The video can be viewed in its entirety here. We'll be posting the relevant screenshots and clips below.)", "President Trump used the term \"angry left-wing mob\" to describe Democrats while speaking at a rally in October 2018, referencing demonstrators who showed up in Washington, D.C., to protest the confirmation of Supreme Court nominee Judge Brett Kavanaugh.  President Trump repeated the phrase on Twitter:", "You don’t hand matches to an arsonist, and you don’t give power to an angry left-wing mob. Democrats have become too EXTREME and TOO DANGEROUS to govern. Republicans believe in the rule of law - not the rule of the mob. VOTE REPUBLICAN!", "— Donald J. Trump (@realDonaldTrump) October 7, 2018", "This video, however, does not specifically comprise only Democrats engaged in acts of violence, and some of the included scenes could not be fairly described as depicting \"angry mobs\" of any stripe.", "The very first clip in this video captured events that took place in Montreal, Quebec, where Canadian anti-capitalist protesters clashed with police during a May Day demonstration in 2018:", "One of the most dramatic pieces of footage included in this violent mob montage, a flaming police car burning in the middle of the street, also depicts events outside of the United States. In fact, more than a full minute of the \"Real Red Elephant\" video was lifted from the following footage of riots at the G20 international summit in Toronto, Ontario, in 2010, showing protesters in black banging on store windows, standing on cop cars, and eventually setting one of those vehicles ablaze:", "Although several clips in this compilation were unrelated and/or filmed outside of the United States, the Red Elephant did manage to include some footage of actual American protesters as well. The video used scenes of protesters confronting Senator Ted Cruz at a restaurant and a clip of demonstrators outside of President Trump's inauguration. Both of these incidents were non-violent however, even if the Red Elephant video employed ominous music to suggest they featured unruly \"mobs\":", "Amidst this smattering of unrelated and misleading footage, this viral video did incorporate a few genuine clips showing anti-Trump protesters engaged in violence. The scene of a protester smashing the window of a limousine, for example, was taken during the demonstrations surrounding President Trump's inauguration.", "The majority of this compilation depicts anti-fascists (Antifa) engaging in a series of violent clashes the group had with Trump supporters at the University of California, Berkeley in 2017. We'd quibble, however, with the notion that President Trump was referring to Antifa when he called Democrats a \"left-wing mob\" in October 2018. Or, rather, we'd quibble with the idea that Democrats supported the actions of these Antifa protesters:", "\"Our democracy has no room for inciting violence or endangering the public, no matter the ideology of those who commit such acts,\" [Rep. Nancy] Pelosi said in what was arguably the strongest disavowal of the group from a Democrat. \"The violent actions of people calling themselves Antifa in Berkeley this weekend deserve unequivocal condemnation, and the perpetrators should be arrested and prosecuted.\"", "Khan, Shehab.   \"Anti-Donald Trump Protesters Smash Up Limousine As He is Sworn in as US President.\"\r\n    The Independent.   20 January 2017.", "Edevane, Gillian.   \"Politicians Condemn Antifa Following Violent Protest in Berkeley.\"\r\n    NBC News.   31 August 2017.", "The Daily Beast.   \"Ted Cruz Heckled Out of D.C. Restaurant: ‘We Believe Survivors!'\"\r\n    25 September 2018.", "Steinmetz, Katy.   \"Fighting Words: A Battle in Berkeley Over Free Speech.\"\r\n    Time.   1 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]