["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Josh Lawson, chief counsel for the NC elections board, hands Republican Mark Harris a document during the fourth day of a public evidentiary hearing on the 9th Congressional District race on Feb. 21.", "After investigators found voting irregularities in North Carolina’s 9th Congressional District, the state Republican Party opposed the idea of a new election.", "In November, Republican Mark Harris held a 905-vote advantage over Democrat Dan McCready. The irregularities, the NCGOP argued, didn’t affect enough votes to make a difference in the outcome of the race.", "Fast forward to March. The NC elections board has called a special election in the 9th district, and the GOP is raising money to help whoever its candidate ends up being in September.", "In doing so, the party is misleading donors about the history of the race. A March 12 fundraising email warns supporters about \"horrible news.\"", "\"Democrats have forced a special election in North Carolina, and the race is tied!\" the email says in bold print.", "Is the race tied? Only in the sense that no candidates have emerged yet from their party’s primary.", "We’ll also address whether Democrats \"forced\" a special election. But first, some important dates: the primary will take place May 14 and the general election will be on Sept. 10. If no candidate gets 30 percent of the vote in the primary, a runoff election will be held Sept. 10, followed by a general election Nov. 5.", "Now, let’s talk about how we got here. The GOP says Democrats \"forced\" a special election — which gives the impression that support for a new election was purely partisan.", "It wasn’t.", "HOW IT HAPPENED", "The NC elections board has jurisdiction over races for federal office across the state.", "In November, the board was made up of nine members — four Republicans, four Democrats and a left-leaning unaffiliated member — when it voted 7-2 against certifying the 9th district race results.", "In January, a court decision reconstituted the board with five members: three Democrats and two Republicans.", "In February, after a four-day hearing on the findings of the fraud investigation, the reconstituted board voted unanimously (5-0) to nullify November’s results and launch a new election. The board acted shortly after Harris, in a surprise move, expressed his support for a new election.", "\"It’s become clear to me that the public’s confidence in the Ninth District’s general election has been undermined to an extent that a new election is warranted,\" Harris said, and the New York Times reported.", "A GOP-BACKED DECISION", "Dallas Woodhouse, executive director of the NC GOP, pointed out that Democrats controlled the elections board.", "\"Republicans could not force a special election, and could not certify alone,\" Woodhouse said.", "However, state law required four of the five board members to OK a new election, according to board spokesman Patrick Gannon. So Republicans had an influence on the decision to call for a new election. And the two Republican members of the board voted for a new election shortly after Harris (the Republican candidate) said he also supported it.", "Furthermore, on the day Harris called for a new election, Woodhouse said he supported Harris’ decision.", "\"Today I ask for everyone’s prayers for @MarkHarrisNC9 Today is a tremendously difficult day for his family, supporters and the entire @NCGOP We support our candidates decision in this matter. We will do everything we can to help the process and system improve in the future,\" Woodhouse tweeted on Feb. 21.", "In a statement released the same day, the NC GOP said \"we respect Dr. Harris’ decision\" and thanked the elections board. And on Feb. 26, after Harris dropped out of contention for the seat, the GOP put out another statement saying, \"This has been a grueling process for all involved, and we unequivocally support his call for a new election.\"", "OUR RULING", "An NC GOP fundraising email said \"Democrats have forced a special election\" in the 9th Congressional District. Democrats held a majority on the NC elections board, but the vote to order a new election was supported by the board’s two Republican members and the Republican candidate. We rate this claim False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "A March 12 fundraising email for the NC GOP.", "Email correspondence with Dallas Woodhouse, executive director of the NC GOP.", "Stories by The News & Observer, \"NC Gov. Cooper appoints an elections board member Republicans fought,\" published March 21, 2018.", "Stories by The Charlotte Observer, \"Elections board may finish 9th District investigation in a few weeks, new chairman says,\" published January 31, 2019; \"9th District chaos: Cooper plans interim elections board, Harris asks to be named winner,\" published Dec. 28, 2018.", "Story by Vox, \"Court dissolves North Carolina elections board with election fraud scandal still under investigation,\" published Dec. 28, 2019.", "Press releases by the NC State Board of Elections, \"Governor Cooper Appoints New State Board,\" published January 31, 2019; \"State board to hold public hearing into irregularities in 9th Congressional District contest,\" published November 30, 2018.", "Story by the New York Times, \"New election ordered in North Carolina race at center of fraud inquiry,\" published Feb. 21, 2019.", "A tweet by Dallas Woodhouse, executive director of the NC GOP, on Feb. 21, 2019.", "Press releases by the NC GOP, \"Hayes statement on Harris decision,\" published Feb. 21, 2019; \"Chariman Hayes Responds to Harris Decision,\" published Feb. 26, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]