["The UK's Guardian newspaper published an article with an alarming headline, that nearly half of all child deaths in Africa stem from hunger.", "Several publications reported that nearly half of child deaths in Africa stem from hunger, citing a 2019 “key finding” by an Ethiopia-based research institute.", "The African Child Policy Forum referred Africa Check to Unicef and WHO findings, who in turn drew the estimate from a 2013 Lancet study.", "A study author said the research was not specific to Africa and that a calculation for the region had not been done. Experts also urged caution when defining terms like hunger, undernutrition and malnutrition.", "“Nearly half of all child deaths in Africa stem from hunger,” read the headline of a June 2019 online article by the UK’s Guardian newspaper.", "Several other publications, including the UK’s Independent newspaper, Microsoft portal MSN and South Africa’s Citizen newspaper also reported this.", "All attributed this startling statistic to a 2019 report on child hunger by non-profit research institute, African Child Policy Forum (ACPF), which is based in Ethiopia.", "In a key finding, the report said that “hunger contributes to about 45% of childhood mortality in Africa”. But does the evidence support this claim? We checked.", "Retta Getachew is the manager of the child development and protection programme at the ACPF. He told Africa Check that it is difficult to find a “universally acceptable definition” of child hunger.", "Few reports directly address hunger and those that do focus on some aspects such as stunting or wasting. Therefore, the organisation had adopted a “more comprehensive understanding of child hunger”, Getachew said.", "This, he said, encompasses a spectrum of food deprivation ranging from a complete absence of food, in other words starvation, to malnutrition and undernutrition.", "Narrowing the scope of the statistic, Getachew told Africa Check that “various sources indicate child malnutrition, which the ACPF understands as one aspect of child hunger, contributes to nearly half of child mortality.”", "For sources, he referred us to a UN Children's Fund (Unicef) webpage on malnutrition. Dated April 2019, this says that “nearly half of all deaths in children under five are attributable to undernutrition”.", "Getachew also provided two factsheets from the World Health Organization. Both are dated 2018. The first covered malnutrition and said that “around 45% of deaths among children under five years of age are linked to undernutrition”. The second noted that “nutrition-related factors contribute to about 45% of deaths in children under five years of age”.", "Both WHO and Unicef told Africa Check the estimate came from a paper published in the Lancet, a weekly peer-reviewed general medical journal, in 2013.", "Juliana Krasevec, who focuses on statistics and monitoring for Unicef, said that the information on their page had referred to “undernutrition and not hunger”. The two terms are “not the same thing”, she told Africa Check.", "Using WHO estimates of child malnutrition, the authors of the Lancet study estimated that in 2011, some 3.1 million children, or 45% of all child deaths under five, were due to foetal growth restriction and suboptimal breastfeeding. Other causes of death were stunting, wasting and deficiencies of vitamin A and zinc.", "But this finding is different from the claim by the ACPF, which attributed this share of deaths as being only in Africa.", "Joanne Katz is a professor in the department of international health at the Johns Hopkins Bloomberg School of Public Health. She is one of the authors of the 2013 Lancet paper.", "Katz told Africa Check their estimates came from low and middle-income countries worldwide.", "“These calculations were not made specifically for African countries, hence the 45% listed may not be applicable to Africa. But we don’t know because that calculation has not been done,” she said.", "Katz also drew attention to other concerns with the ACPF estimate. For example, the organisation’s report did not specify an age group for “child deaths”.", "The Lancet paper referred only to those deaths that occurred in children under five years of age, Katz told Africa Check. “The causes of death are different for older children than younger ones,” she said.", "Kerstin Hanson, a paediatrician with Doctors Without Borders, agreed. She told Africa Check that children under five had the highest burden of disease due to undernutrition.", "“I think that ACFP should therefore indeed be more specific, as the burden is not the same across different ‘childhood’ age groups,” Hanson said.", "While the ACPF’s definition of “child hunger” included undernutrition, experts also urged caution with this.", "Undernutrition is taking in fewer nutrients than required for normal healthy functioning of the body, Katz said. These nutrients are both macronutrients – needed in larger amounts – and micronutrients, which though required in small amounts are still essential.", "But “an undernourished person could look normal and not be thin but be missing some important vitamins or minerals from their diet”, Katz said.", "Similarly, a person can feel satiated – or not hungry – but still be undernourished due to the food’s quality, said Hanson. “Although often used interchangeably”, it is preferable not to equate hunger with undernutrition, she said.", "The ACPF responds to our findings", "In response to our findings, the African Child Policy Forum noted that there was a dearth of cause of death data in many African countries. This had led to a reliance on research “undertaken in ‘similar’ contexts, with a special focus on those undertaken in low income countries and developing regions”.", "As their primary audience was busy policy makers, key government officials and decision makers, the organisation “is always compelled, to the extent possible, to use simple and plain language in its reports to convey key messages and recommendations...”.", "The organisation directed us to the Lancet list of low and middle income countries relied on for the claim. Of these, just under half, or 38 of 78 countries were in Africa. “This is again another statistically substantial number that would influence the percentage of child deaths attributed to hunger (about 45%).”", "The ACPF added that “by definition” child mortality is calculated for children under age five. “If one wants to refer to older children, it needs to be specified as such.”", "The organisation said that its estimate should be seen in light of these considerations, and that it believed its figure is “reasonably reflective of the reality in Africa”.", "In a widely publicised report, Ethiopia-based non-profit research institute African Child Policy Forum in June 2019 claimed that “about 45% of child deaths in Africa are attributable to hunger”.", "We traced the claim back to a 2013 study published in the Lancet medical journal. This found that 45% of all deaths in children under five in 2011 were attributable to undernutrition.", "But one of the study's authors said this share may not be applicable to Africa as that calculation has not been done. Further, one should be cautious about equating hunger to undernutrition.", "Policy decisions and advocacy should be informed by accurate data. Without any specific research on how many children die of hunger in Africa, we rate this claim unproven.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]