["About this rating", "Convicted sex offender and hedge fund manager Jeffrey Epstein was arrested in New York in early July 2019 on various charges related to the sex trafficking of minors. As the news broke, many viewers noted that Epstein had connections to several high profile politicians, including President Donald Trump and former President Bill Clinton.", "The fact that Donald Trump had a friendly relationship with Epstein — he told New York Magazine in 2002 that \"(Epstein's) a lot of fun to be with ... It is even said that he likes beautiful women as much as I do, and many of them are on the younger side\" — prompted the circulation of a viral photograph purportedly showing Epstein with Donald Trump and Trump's young daughter, Ivanka:", "This was not a genuine photograph, however, but a composite of at least two different pictures.", "The first photograph, which features a young Ivanka and her father standing next to a motorcycle, was taken in 1993 at the grand opening of the Harley Davidson Cafe in New York City. This image is available via Getty Images, where it is offered with the caption \"Donald Trump and Ivanka Trump during Grand Opening of The Harley Davidson Cafe at Harley Davidson Cafe in New York City, New York, United States. (Photo by Ron Galella, Ltd./Ron Galella Collection via Getty Images)\":", "The photograph of Epstein was taken from a 2005 photograph picturing him at the launch of Radar Magazine at Hotel QT in New York City. That photograph is also available via Getty Images, where it is presented with the caption \"NEW YORK, NY - MAY 18: Jeffrey Epstein attends Launch of RADAR MAGAZINE at Hotel QT on May 18, 2005. (Photo by Neil Rasmus/Patrick McMullan via Getty Images)\":", "While the above-displayed image showing Donald and Ivanka Trump together with Jeffrey Epstein is fake, a genuine photograph of Trump, Epstein, and two of Trump's children, Ivanka and Eric, was snapped by photographer Daffyd Jones at a Harley Davidson Cafe in Manhattan in 1993.", "Trump has also been photographed with the now-convicted sex offender on several other occasions. The following picture, which shows Donald Trump, his girlfriend Melania Knauss (now First Lady Melania Trump), Jeffrey Epstein, and Ghislaine Maxwell was taken at Trump's Mar-A-Lago club in Palm Beach, Florida in February 2000:", "Fedschun, Travis.   \"Jeffrey Epstein Due in Federal Court After Sex Trafficking Arrest, Preyed on Young Girls, Prosecutors Say.\"\r\n    Fox News.   8 July 2019.", "Danner, Chas; Stieb, Matt.   \"Everything We Know About the Sex Crimes Case Against Jeffrey Epstein.\"\r\n    New York Magazine.   8 July 2019.", "Thomas, Landon.   \"Jeffrey Epstein: International Moneyman of Mystery.\"\r\n    New York Magazine.   28 October 2002.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]