["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Billionaire philanthropist and former New York City Mayor Michael Bloomberg raised more than $16 million to pay the fines, fees, and restitution of roughly 31,000 convicted felons in Florida to restore their voting rights in advance of the 2020 general election.", "Bloomberg's donation added to the $5 million that was raised by the nonpartisan voting rights advocacy group Florida Rights Restoration Coalition (FRRC), as was first reported by Axios. According to a Sept. 22 news release, FRRC announced that it had raised $20 million of its $25 million goal to pay the fines and fees — not exceeding $1,500 — for formerly incarcerated citizens returning to society so that they are eligible to vote in the 2020 general election. That deadline is two weeks in advance of Florida’s voter registration deadline of Oct. 5.", "The claim that Bloomberg donated more than $16 million overall is true, though the exact monetary amounts for each convicted felon have not been independently verified by our team. Snopes contacted the FFRC and Bloomberg Foundation to confirm specific dollar amounts, but did not hear back at the time of publication.", "“The right to vote is fundamental to our democracy and no American should be denied that right. Working together with the Florida Rights Restoration Coalition, we are determined to end disenfranchisement and the discrimination that has always driven it,” said Bloomberg, who has publicly endorsed the organization, in a statement.", "Under federal law, convicted offenders may be ordered to reimburse victims for financial losses due to their crime in a process that is called restitution. During sentencing, a judge may order the felon to pay for lost income, property damage, medical, or funeral expenses, among other things. Up until 2018, Florida was one of four states where convicted felons did not regain their right to vote after fulfilling all requirements of their sentencing unless specifically restored by a state officer or board. (The three other states are Iowa, Kentucky, and Virginia.) The 2018 passage of Amendment 4 changed that by automatically restoring the voting rights of more than 1.4 million Floridians who had a past felony conviction and had completed all terms of their sentences — including fines, fees, and restitution — with the exception of those convicted of murder or a felony sexual offense.", "In September 2020, the 11th U.S. Circuit Court of Appeals, which presides over Florida, Georgia, and Alabama, ruled to uphold the law that the voting rights of felons could only be restored if they pay all fines, fees, and restitution owed to the government after some sued arguing that the amendment violated the Constitution.", "In order to reinstate the voting rights of convicted felons who still owe money to the government, the FRRC launched its Fines and Fees Program, an initiative that raises money to pay restitution for convicted felons so that they can complete all conditions of their prison sentence and have their voting rights restored. The average amount owed is $1,000 per person, according to the FRRC.", "“These donations will pay the fines and fees of tens of thousands of returning citizens so they will be eligible to vote and participate in this November’s election,” wrote the organization.", "FRCC Executive Director Desmond Meade, a voting rights advocate who spent three years in prison, argues that the effort creates a “more inclusive democracy.”", "More than 44,000 individuals and entities joined Bloomberg on the donor list, including Ben & Jerry’s, Levi Strauss & Co., as well as the Miami Heat and Miami Dolphins.", "The purported bailout spurred contempt from Republican leaders who argue that paying off felons’ debt could be considered potential bribery. In a Sept. 27 tweet, U.S. President Donald Trump accused Bloomberg of bribery, adding that he \"committed a serious crime.\"", "In addition, Florida Attorney General Ashley Moody sent a letter to the FBI and the Florida Department of Law Enforcement asking that the agencies investigate Bloomberg’s donation.", "https://www.scribd.com/document/477213691/Florida-AG-Moody-orders-investigation-into-Bloomberg-s-pledge-to-help-felons-pay-debts#from_embed", "Farrington, Brendan.   \"Bloomberg Raises Millions ot Help Florida Felons Vote.\"\r\n    The Associated Press.   22 Sept. 2020.", "Moreno, Edward J.   \"Florida Attorney General Scrutinizing Bloomberg Paying Fines for Felons to Vote.\"\r\n    The Hill.   22 Sept. 2020.", "Laskowski, Kathy.   \"Florida Attorney General Asks for Investigation of Bloomberg’s Fundraising Push to Cover Fines for Felons Who Want to Vote.\"\r\n    South Florida Sun Sentinel.   23 Sept. 2020.", "Mastrangelo, Dominick.   “Bloomberg Pays Fines for 32,000 Felons in Florida So They Can Vote.\"\r\n    The Hill.   22 Sept. 2020.", "Perano, Ursula.   \"Bloomberg Raises $16.1M to Help Florida Felons Regain Voting Rgihts.\"\r\n    Axios.   22 Sept. 2020.", "Sherer, Michael.   \"Mike Bloomberg Raises $16 Million to Allow Former Felons to Vote in Florida.\"\r\n    The Washington Post.   22 Sept. 2020.", "Downey, Renzo.   \"Matt Gaetz Calls for Investigation into Mike Bloomberg for Felon Voting ‘Bribe.’\"\r\n    Florida Politics.   23 Sept. 2020.", "\"Massive Momentum Builds to Free the Vote in Florida.’\"\r\n    FRRC.   22 Sept. 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]