["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Are any Florida K-12 students taking 45 days of standardized tests a year? We take a closer look. (Wikimedia commons)", "Facing a backlash from teachers and parents over standardized tests, state legislators are discussing whether to pare down the hours students spend on testing.", "The latest batch of criticism about Florida’s tests coincides with a national discussion about Common Core state standards. One of the potential GOP presidential contenders, former Florida Gov. Jeb Bush, has long defended the need to use tests to make schools accountable -- a position increasingly at odds with other GOP presidential contenders.", "The Florida Badass Teachers Association, which is part of a national association that formed in recent years in an effort to fight back against testing, raised concerns about the tests as they planned to protest Bush’s Feb. 10 speech in Tallahassee.", "Thomas James, an association spokesman and Miami-Dade history teacher, leveled many criticisms of Florida schools, including this one in a statement provided to the Miami Herald before Bush’s speech.", "\"Florida public school students have become little more than ‘test drones’ being bombarded with an array of standardized high stakes tests which eat up as much as 45 school days per year,\" James said.", "James’ claim about the amount of days eaten up by tests caught our eye because it was more than double the number we heard from state legislative leaders in 2013 -- though Florida has made changes to tests since that time.", "How many days a year do students actually take standardized tests?", "Backlash over Florida’s new tests", "We found no simple answer to that question because it varies widely depending upon students’ grades, courses and district and other factors.", "Testing of Florida students has always faced some criticism but changes to those tests resulted in a fresh round of backlash within the past year.", "This year, students will start taking the Florida Standards Assessments aligned to Florida's new education benchmarks, based on the Common Core State Standards. (After the Common Core drew increasingly vocal criticism, the Florida Legislature last year renamed them the Florida Standards with some tweaks.)", "During his 2014 re-election campaign, Gov. Rick Scott promised to investigate the state testing program and the state expects to have a report ready for the beginning of the legislative session March 3.", "James told PolitiFact Florida that he arrived at his claim in part through a bill proposed in February by Senate Education Chairman John Legg, R-Trinity. That bill would require that students spend no more than 5 percent of school hours taking statewide and district-mandated tests. But that adds up to 45 hours -- not days -- of tests.", "How many hours do students take tests?", "The Florida Standards Assessments include reading tests in grades 3 through 11, math tests in grades 3 through 8, and science tests in grades 5 and 8. High school students must take six end-of-course exams in subjects including math and history, for example.", "For example, fourth-graders take 1.5 hours of tests in english language arts, 2.67 hours in writing and 2.67 hours in math. That adds up to just under seven hours of tests.", "The hours spent on statewide tests grew between the 2013-14 and 2015-16 school year. For example, fourth-graders now spend about one extra hour on such tests while a sixth-grader spends nearly three extra hours on tests.", "In high school, students take several more hours of tests. For example, a high school student may take 13 hours of statewide tests including language arts, math, biology and history.", "And then there are the district-wide tests. Some school districts also give their own district-wide exams that are not required by the state, usually to see how students are progressing in any given subject.", "We interviewed spokespersons in a few school districts to get information about the number of hours their students spend taking standardized tests.", "Miami-Dade school officials concluded that the maximum example would be for an 11th-grader who takes all required tests and two international baccalaureate (or \"IB\") classes which would add up to about 44 hours.", "In Pasco County, the typical student on average takes state and districtwide tests for anywhere from three to 26 hours. (This does not include the IB example cited by Miami-Dade.)", "James told PolitiFact Florida that the Miami-Dade testing calendar shows that testing gears up in March and high schools continue testing nearly through the end of May. But not every student is taking every test throughout that two-month stretch of tests -- and some days they are taking a test for just part of that day. (The Miami Herald wrote in September that only eight out of 180 days on the district’s calendar had no standardized tests, but any individual student would be tested on only a fraction of those days.)", "Asked about the claim of having testing on as many as 45 days, James said, \"That would be the worst-case scenario.\"", "We should note that even for students who are not taking a test on a particular day or portion of a day, they still could be impacted in some way by the tests. For example, their teachers may be taken out of class to proctor other students taking tests. In May 2014 the Miami Herald reported that some classes at Dr. Michael Krop High School -- James’ school -- were watching movies, such as Frozen, or playing board games during such testing days. But we found no solid evidence to show the extent of students being displaced by other students taking tests. And in any case, this would vary district to district, school to school and grade to grade.", "How many hours each district spends on testing will become more clear when the Department of Education releases its report during the session. Still, Legg said there isn’t evidence that students are spending 45 days on tests.", "\"It is very plausible that those students are doing 45 hours,\" Legg said. However, \"I would find it impossible to do 45 complete days.\"", "The Florida Education Association, the union that represents teachers, argues that the number of days devoted to tests is even higher than what James stated and can reach 60 to 80 days. But the FEA counts any day during which a student takes a test for part of the day as a \"testing day,\" and it also includes days when students are in training to use the computers to take the tests. The FEA also points to tests only taken by a fraction of students -- for example, schools whose performance is rated \"D\" or \"F,\" which have to take progress monitoring assessments that higher-rated schools do not.", "Ruth Haseman Melton, the director of government relations for the Florida School Boards Association, calls James’ statement an oversimplification. An entire day may not be eaten up by tests, but more time is eaten up by tests beyond just the minutes a student takes them.", "\"It’s not accurate to count the number of days that tests are given, but it’s also not accurate to just count the time it takes to administer the actual test,\" which is what DOE and Senator Legg are suggesting,\" she said.", "Our ruling", "Florida students take \"an array of standardized high stakes tests which eat up as much as 45 school days per year,\" said James, a Miami-Dade teacher.", "Test days do appear to have risen in recent years, and students are not only affected by the tests they take themselves, but also by the impact of other students in their school taking tests.", "Pinpointing the number of days that students take standardized tests is difficult because it varies widely depending by grade, school, district and other factors. Even so, critics of the amount of testing did not provide hard evidence of any student taken up with testing for 45 total days a year, much less that it is a typical result in Florida. In fact, James’ own district said that the maximum number of hours spent on such tests would equal about 44 hours -- a small fraction of the figure James cited.", "We rate this claim False.", "Florida House, Senate Bill 616, Filed Feb. 2, 2015", "StateImpact Florida, \"Prosed limit might not reduce testing time,\" Feb. 11, 2015", "Badass Teachers Association, website, Accessed Feb. 17, 2015", "Miami Herald/Tampa Bay Times, \"Senator leaders propose fix for Florida’s testing troubles,\" Feb. 2, 2015", "Miami Herald/Tampa Bay Times, \"School testing changes sought,\" Jan. 8, 2015", "Miami Herald/Tampa Bay Times, \"A new challenge to Common Core -- from the left,\" Aug. 25, 2013", "Florida Today, \"Too many tests? Some parents, teachers say yes,\" SEpt. 2014", "Miami Herald, \"What do some students do during FCAT testing? Watch movies and play board games,\" May 4, 2014", "Interview, Gisela Feild, administrative director of assessment, research and data analysis for Miami-Dade schools, Feb. 13, 2015", "Interview, Sen. John Legg, R-Trinity, Feb. 13, 2015", "Interview, Thomas James, Miami-Dade history teacher and spokesman for the Florida Badass Teachers Association, Feb. 12, 2015", "Interview, Mark Pudlow, Florida Education Association spokesman, Feb. 16, 2015", "Interview, Ruth Haseman Melton, director of government relations Florida School Boards Association, Feb. 16, 2015", "Interview, Linda E. Cobbe, spokeswoman Pasco County schools, Feb. 16, 2015", "Interview, John Schuster, spokesman Miami-Dade school district, Feb. 13, 2015", "Interview, Stephen Hegarty, spokesman Hillsborough school district, Feb. 16, 2015", "Interview, Nadine Drew, spokeswoman Broward school district, Feb. 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]