["On Feb. 22, 2018, Corey Stewart gestures during a news conference at the Capitol in Richmond, Va. (AP/Steve Helber)", "Corey Stewart, the Republican vying to unseat incumbent Sen. Tim Kaine in Virginia, blasted Kaine and other Democrats for their immigration views during a live video broadcast to his Facebook page on June 30, 2018.", "\"The left is calling for — Tim Kaine and the Democrats are calling for — not only no border enforcement; they don’t want a border at all,\" Stewart said. \"Tim Kaine doesn’t want a border at all. He wants to get rid of Immigration and Customs Enforcement and basically the border patrol as well. He wants to get rid of all that.\"", "The video showed Stewart driving in his car to a protest at the Red Hen, the restaurant in Lexington, Va., that sparked controversy when its owner asked White House Press Secretary Sarah Huckabee Sanders to get up from her table and leave.", "Stewart was joined at the protest by campaign supporters, including a local \"Bikers for Trump\" group. His comments followed some Democratic calls to abolish ICE, the U.S. government agency best known for arresting, detaining and deporting undocumented immigrants.", "Heard @realDonaldTrump on Fox this morning talking about our rally outside the Red Hen yesterday with the Bikers for Trump!! pic.twitter.com/ODYir9ARYf", "After progressive candidate Alexandria Ocasio-Cortez defeated Rep. Joe Crowley, D-N.Y., with a campaign that called for ICE’s elimination, several Democratic leaders — including Sens. Kirsten Gillibrand and Elizabeth Warren — adopted similar positions.", "But we found no evidence that Kaine hopped on that bandwagon, despite Stewart’s claim. Noel Fritsch, spokesman for the Stewart campaign, did not respond to a request for comment.", "Kaine has been relatively firm in his support for bills that add to border security, while at the same time advocating for legal immigration, protection of Dreamers — immigrants here illegally who arrived as children — and other traditionally Democratic immigration policies.", "Kaine has also been critical of Trump’s policy of separating immigrant families at the border. With regard to ICE, Kaine has rebuked controversial raiding tactics practiced under the Trump administration, but he has not called for the agency’s termination.", "\"Tim believes we need comprehensive immigration reform and strongly supported legislation that passed the Senate in 2013 to create a path to citizenship and fund border security,\" said a statement on the immigration page of Kaine’s campaign website.", "The 2013 bill, for which Kaine delivered a Senate floor speech in Spanish, was the Border Security, Economic Opportunity, and Immigration Modernization Act, and it passed the Senate by a 68-32 vote. Although it ultimately died in the House, the bill would have increased the number of federal agents along the U.S. border with Mexico, required construction of 700 miles of border fencing and allocated money for aerial drones, among other border security measures.", "The bill also included provisions that would have allowed immigrants living in the U.S. illegally to adjust their immigration status so long as they satisfied certain criteria.", "Later, in February 2018, Kaine co-sponsored a bipartisan bill to protect Dreamers and enhance border security. In addition to providing legal status and a path to citizenship for people who arrived in the U.S. as children, the bill would have granted $25 billion in funding for Northern and Southern border security over a 10-year period.", "\"We’ve reached a deal that gives us the best chance to protect Dreamers against deportation from the only country they know as home,\" Kaine said at the time. Ultimately, the proposal fell short of the 60 votes needed to pass the Senate after the Trump administration publicly opposed it.", "\"I think we do need to do more border control,\" Kaine said during an interview on MSNBC’s \"Morning Joe\" in April 2018. \"I want to see a strategy … not just a president acting like the military was his palace guard and he could do whatever he wanted on a day in question.\"", "Ian Sams, communications director for the Kaine campaign, pointed to the 2013 and 2018 bills as well as an op-ed Kaine wrote criticizing the Trump policy of separating families at the border. Sams also noted that the $25 billion in border security funds provided by the 2018 proposal was the exact amount Trump had requested.", "Stewart said, \"Tim Kaine doesn’t want a border at all. He wants to get rid of Immigration and Customs Enforcement and basically the border patrol as well.\"", "We found no evidence to support this claim. On the contrary, Kaine has backed two comprehensive immigration bills that featured significant measures for increased border security.", "He has not made any statements about getting rid of ICE, let alone the border.", "We rate Stewart’s statement Pants on Fire!", "Corey Stewart on Facebook, June 30, 2018", "Kaine 2018, \"Fighting For Immigrant Communities,\" accessed July 2, 2018", "Tim Kaine, \"Immigration,\" accessed July 2, 2018", "Congress.gov, \"S.744 - Border Security, Economic Opportunity, and Immigration Modernization Act,\" June 27, 2013", "Tim Kaine, \"Senators Unveil Bipartisan Amendment to Protect Dreamers, Strengthen Border Security,\" February 14, 2018", "Vox, \"The list of Democrats calling to abolish ICE keeps growing,\" June 30, 2018", "The New York Times, \"Trump Attacks Democrats on Calls to Abolish ICE,\" July 1, 2018", "The Washington Post, \"‘A giant symbol’: In fight over Trump’s wall, Democrats who once supported a border barrier now oppose it,\" January 6, 2018", "Real Clear Politics, \"Peggy Noonan to Tim Kaine: Why Can't The U.S. Control Its Borders?\" April 10, 2018", "PolitiFact, \"Did Senate pass immigration bills in 2006, 2013 and House failed to vote on them?\" January 26, 2018", "Email correspondence with Ian Sams, communications director for the Tim Kaine for U.S. Senate campaign, July 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]