["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "On May 25, 2020, George Floyd, a 46-year-old Black man, was killed in Minneapolis, Minnesota, following an arrest for allegedly using a counterfeit bill. That event was followed by several nights of protests in the city, during which multiple buildings were set afire:", "Post offices, gas stations, pawnshops and a large apartment building under construction were set ablaze during the middle of confrontations between protesters and police that week. Dozens of households had to be evacuated.", "On one night, an entire apartment building in south Minneapolis was evacuated as an O’Reilly Auto Parts and Family Dollar were engulfed in flames. Firefighters did not arrive to extinguish the fire until about two hours after neighbors called 911.", "Some scenes from the aftermath of that unrest in Minneapolis continued to draw questions about their authenticity on social media for weeks after the fact, such as the following photograph of a burnt-out car parked on a street amidst a bunch of rubble and wreckage:", "This picture did originate in Minneapolis and not Kuwait (or elsewhere), as demonstrated by the fact that multiple photographs of the same car taken from different angles exist and were posted to social media at the time, including ones published by Twin Cities Business (TCB), Getty Images, and the Associated Press:", "(Kerem Yucel/AFP/Getty Images)", "(David Joles/Star Tribune via AP)", "Twin Cities Business.   \"Protests Tear Up Lake Street; Minneapolis Leaders Call for Peace.\"\r\n    28 May 2020.", "Penrod, Josh et al.   \"Buildings Damaged in Minneapolis, St. Paul After Riots.\"\r\n    [Minneapolis] Star Tribune.   19 June 2020.", "Otárola, Miguel.   \"Minneapolis Firefighters Blast Department's Response to Fires, Unrest After George Floyd's Killing.\"\r\n    [Minneapolis] Star Tribune.   18 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]