["The video was published here on Facebook on July 9, 2019. It has been viewed more than 82,000 times and shared more than one thousand times.", "The Chinese-language caption translates to English as: “A magnitude-4.0 earthquake occurred in Sabah. The people in the cars rushed to open spaces.”", "Sabah is a Malaysian state on the island of Borneo.", "Below is a screenshot of the misleading post:", "The 15-second video shows a woman, who is holding a baby, getting out of a vehicle and running towards a structure sheltering toll booths. Some other people can be seen running past her in the same direction.", "The video was also shared here and here on Facebook with the same claim.", "The claim is false. A reverse image search for keyframes of the video obtained using video analysis tool InVid found the clip had previously circulated in reports about an earthquake in Ternate, in the Indonesian province of North Maluku.", "The footage was published on video-licensing platform Newsflare on July 7, 2019, here. The first two sentences of the caption read: “A powerful 6.9 magnitude quake was felt in Indonesia on July 7. The shaking caused panic in the city of Ternate in Maluku islands which are close to the quake's epicenter.”", "Below is a screenshot comparison of the video in the misleading posts (L) with the clip published by Newsflare (R):", "On July 7, 2019, the USGS recorded a 6.9-magnitude earthquake in the Molucca Sea, 133 kilometres west of Ternate city. The data can be seen in the screenshot below.", "Indonesian outlet KompasTV reported on the incident on July 7, 2019, here, with the same clip used repeatedly. The clip is embedded below.", "The first sentence for the caption of the video, translated from Indonesian, reads: “A magnitude-7 earthquake occurred in Ternate, North Maluku.”", "No earthquakes were registered in Malaysia on the date the first misleading post was published -- or in the month to July 17.", "The United States Geological Survey (USGS) measures earthquakes around the world and makes the information publicly available. Its database of earthquakes can also be searched by date and location.", "Below is a screenshot of an earthquake search AFP conducted on the USGS website  -- encompassing Sabah and hundreds of kilometres around it.", "The search returned the results in the screenshot below. The blue square was added later to approximately indicate the location of Sabah state.", "Orange dots represent the sole quake that happened on July 17 -- the day the search was conducted -- yellow dots are quakes that occurred within a week of the search, while white dots are quakes that hit within a month of the search. Larger dots represent larger quakes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]