["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In video footage taken before he died on May 25, George Floyd, a 46-year-old black man, repeats that he \"can’t breathe\" as a white Minneapolis police officer presses his knee into Floyd’s neck.", "That officer, who has been identified as Derek Chauvin, and three other officers who were at the scene have been fired. Chauvin, a 19-year-veteran of the Minneapolis Police Department, has been involved in several police-involved shootings, the Star Tribune reported. On social media, people are sharing a photo that seemingly adds another layer to his history.", "\"Hey look,\" reads the caption of a photo that shows several people on a stage with President Donald Trump. A yellow arrow points to a man standing near him, behind a podium with the presidential seal. \"Here’s a picture of Derek Chauvin - the cop who killed George Floyd.\"", "A Fox News affiliate in Minneapolis reported on May 27 that neither Chauvin nor the other three officers were at the October campaign rally in Minneapolis that’s shown in the photo being shared online.", "Lt. Bob Kroll, the president of the Minneapolis Police Union, spoke at the rally, according to the station. Kroll, who is standing next to the man in the photo social media users have fingered as Chauvin, said it’s a different officer.", "We rate this Facebook post False.", "Tweet, May 27 2020", "Facebook post, May 27, 2020", "The New York Times, What we know about the death of George Floyd in Minneapolis, May 27, 2020", "Star Tribune, What we know about Derek Chauvin and Tou Thao, two of the officers caught on tape in the death of George Floyd, May 26, 2020", "Fox 9, Photo of officer on stage at Minneapolis Trump rally not officer involved in George Floyd’s death, May 27, 2020", "KARE 11, Pres. trump brings Mpls. police Lt. Bob Kroll on stage, Oct. 10, 2019", "C-SPAN, Mpls police on stage with Trump, May 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]