["About this rating", "On 18 December 2016, Bipartisan Report published an item titled \"BREAKING: National Security Agencies On HIGH ALERT After Trump Caught Telling DANGEROUS Lie.\"", "Social media users are often exposed only to the headlines of shared material, so many viewers who saw this item likely walked away having inferred several things: that the article's assertions were \"breaking news\" and therefore novel and highly important, that unspecified national security agencies had indeed changed some form of alert status to \"high,\" that President-Elect Donald Trump had recenrlt told a \"dangerous lie,\" and that the supposed \"dangerous lie\" had clearly compromised national security in general. But as is almost always the case with extraordinary claims emanating from a singular source, little of Bipartisan Report content related to their clickbait headline.", "The article in question pertained to a post shared by activist and journalist Shaun King, which mentioned no national security agency action nor referenced any sort of new information that would have provided such an agency cause for alarm:", "The president-elect has been caught in more than one lie during his presidential campaign, but one thing that no one has been able to prove, is whether or not Donald Trump has any kind of relationship with Russian Dictator, Vladimir Putin.", "Now, a video from 2013 has surfaced in which Trump is asked by a journalist if he has a “relationship” with Putin, and Trump proudly exclaims, “I do have a relationship.” He then goes on to creepily say that Putin is probably interested in the conversation they’re having, and will probably be watching the interview.", "Trump has said countless times that he has no relationship with Putin, and has even said that he’s never talked to him ... in any fashion ... ever. When the CIA released findings that Russia had, in fact, interfered in the 2016 election, Trump was very quick to discredit the Central Intelligence Agency rather than question the integrity of the ruthless leader.", "King's words were elided from the Bipartisan Report item, which shared the referenced video alone. But the content published by King alongside the video clearly stated that he had created the latter to illustrate what he believed was pertinent information that should be noted prior to the 19 December 2016 electoral college vote:", "Please watch and share this video I just edited before the Electoral College votes tomorrow.", "I used the words of Trump in 2 debates and a press conference, all from 2016, where he absolute denies knowing Vladimir Putin, when it appears he may be in trouble for it and compared it up against what he said in 2013, when he spoke very clearly and openly about their relationship.", "WATCH AND SHARE.", "Another notable aspect of the claim was its inherent suggestion that King's post had uncovered new information about Trump. But the 2013 interview King referenced had already been covered as early as July 2016 by news outlets such as MSNBC, NBC News, and Mediaite. The 2013 video in question (from which the first of the four quotes originated) had been uploaded to YouTube by an anti-Trump group in October 2016:", "News reports widely published and shared in July 2016 used wavering language such as \"tried to\" and \"[a] source [said]\" in their reporting, suggesting that claims of a deeper relationship between Trump and Putin were speculative in nature.", "The contrast between clickbait claiming Trump's \"dangerous lie\" had triggered national security \"high alert\" status in mid-December 2016 was quickly disproved by its source material. Trump may have downplayed the nature of his acquaintanceship with Russian president Vladimir Putin during his campaign, but that was not the nature of the false claim made by Bipartisan Report.", "Feldman, Josh.   \"In a 2013 Interview, Trump Said ‘I Do Have a Relationship’ with Vladimir Putin.\"\r\n    Mediaite.   28 July 2016.", "MSNBC.   \"Donald Trump Discusses Putin Relationship in 2013.\"\r\n    28 July 2016.", "NBC News.   \"Trump and Putin Tried to Meet in Moscow Three Years Ago: Source.\"\r\n    28 July 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]