["By Angelo Fichera", "Posted on June 13, 2019", "Viral posts on Facebook claim, falsely, that former Vice President Joe Biden “leaked the names of SEAL Team 6 family’s to Al Qaeda.” Biden publicly credited the SEALs with killing Osama Bin Laden, but did not disclose the team or team members responsible.", "As former Vice President Joe Biden mounts his 2020 campaign for president, viral social media posts are spreading a falsehood to argue that he “cannot be trusted.”", "Referring to the Navy SEALs unit responsible for the 2011 assassination of al Qaeda leader Osama Bin Laden, the posts claim that “it was Biden who leaked the names of SEAL Team 6 family’s [sic] to Al Qaeda and cannot be trusted!”", "There’s no evidence Biden ever provided the names of any SEAL Team 6 members or their families “to Al Qaeda.”", "The claim appears to be an exaggerated form of some criticism that followed Biden’s public confirmation that SEALs were behind the raid that resulted in Bin Laden’s death (though it had already been reported in press accounts).", "President Barack Obama on May 1, 2011, announced to the nation that “a small team of Americans carried out the operation” at a compound in Abbottabad, Pakistan. Press reports immediately following Obama’s announcement identified the SEALs’ involvement; some explicitly named Team 6.", "Then, on May 3, Biden in remarks at an Atlantic Council event lauded the SEALs for their work. He did not mention the specific unit or any specific members by name.", "“Let me briefly acknowledge tonight’s distinguished honorees. Admiral Jim Stavridis is the real deal,” Biden said. “He can tell you more about and understands the incredible, the phenomenal, the just almost unbelievable capacity of his Navy SEALs and what they did last Sunday.”", "He later continued: “I’d be remiss also if I didn’t say an extra word about the incredible events, extraordinary events of this past Sunday. As vice president of the United States, as an American, I was in absolute awe, awe, of the capacity and dedication of the entire team — both the intelligence community, the CIA, the SEALs.”", "Biden wasn’t the only one in the administration to publicly confirm the SEALs’ involvement. Then-CIA Director Leon Panetta, in an interview with PBS NewsHour the same day, credited the “split-second action on the part of the SEALs.”", "There was criticism about the details of the raid emerging from the administration at the time, including by then-Defense Secretary Robert Gates. In particular, as he shared that SEALs were concerned for their safety, Gates said that an agreement to “not release any operational details” from the mission “fell apart” the day after the raid. But a Defense spokesman later said that statement was not intended “as a criticism of any particular person or office.”", "“He was indeed voicing his concern about the breakdown in operational security after the killing of Bin Laden,” Deputy Assistant Secretary of Defense Geoff Morrell told CNN. “Anonymous sources revealing secret information about the tactics, training, and equipment of covert forces put at risk our ability to successfully mount similar missions in the future.”", "Three months after the raid, during a mission to capture or kill a Taliban leader in Afghanistan, Taliban fighters shot down a helicopter carrying 30 U.S. service members, including some members of SEAL Team 6. The episode is often referred to as “Extortion 17,” the call sign for the helicopter transporting the troops.", "Some commentators and family members of the victims subsequently criticized the Obama administration for openly crediting the SEALs with the Bin Laden raid. But officials have said that an investigation into the fatal helicopter attack did not support the notion that it was a targeted effort.", "“We do not believe Extortion 17 was the victim of a pre-planned enemy ambush, nor do we believe the enemy had advance knowledge of our flight route and landing zone location,” Garry Reid, who was principal deputy assistant secretary of Defense for special operations and low intensity conflict, told Congress in 2014.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2011 Atlantic Council Awards Dinner – Vice President Joe Biden.” Video, Atlantic Council. YouTube. 4 May 2011.", "“CIA Chief Panetta: Obama Made ‘Gutsy’ Decision on Bin Laden Raid.” PBS NewsHour. 3 May 2011.", "Colt, Jeffrey N. “Executive Summary (Crash of CH-47D Aircraft in Wardak Province, Afghanistan on 6 August 2011).” United States Central Command. 9 Sep 2011.", "“Gates: SEALs who killed bin Laden concerned for their safety.” CNN. 21 May 2011.", "“Osama Bin Laden Dead.” Obama White House. 2 May 2011.", "U.S. House. “Afghanistan: Honoring the Heroes of Extortion 17 – Hearing Before the Subcommittee on National Security of the Committee on Oversight and Government Reform.” 27 Feb 2014.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]