["Prime Minister in his address to the nation on 15th August, 2015 announced that 18,500 odd villages across India which hadn’t been electrified would be electrified within the next 1000 days. On April 28th, according to the Central Government, Leisang in Manipur became the last village in India to get electrified. Union Ministers and members of the ruling party lauded this milestone via their social media accounts.", "“Under the decisive leadership of PM @NarendraModi India has finally been able to electrify all its villages before the set target date. With the elimination of darkness from the lives of fellow Indian villagers, we commit ourselves to building a new and #PowerfulIndia” is Union Minister Piyush Goyal’s tweet while applauding Indian Government’s efforts in electrifying 18,452 villages. Along with his tweet, Piyush Goyal posted two maps stamped with ‘Before’ and ‘After’ stamps to portray the state of electrification in India during UPA versus NDA.", "Under the decisive leadership of PM @NarendraModi India has finally been able to electrify all its villages before the set target date. With the elimination of darkness from the lives of fellow Indian villagers, we commit ourselves to building a new and #PowerfulIndia pic.twitter.com/TJ8irmx4tk", "— Piyush Goyal (@PiyushGoyal) April 29, 2018", "The above maps tweeted by Piyush Goyal are derived from night maps that NASA periodically releases. In April 2017, NASA released new maps showing full hemisphere views of Earth at night. According to NASA website, these maps provide the clearest yet composite view of the patterns of human settlement across our planet.", "The two maps in the tweet above are comparisons of India’s night maps in 2012 versus 2016. As can be seen, the 2016 map looks visibly brighter than the map from 2012. In this article, we will investigate whether the pictorial comparison is a correct representation of increased electrification of Indian villages. We will also compare how NDA and UPA Governments fared in advancing rural electrification.", "Comparing the year-on-year statistics for number of villages electrified starting from 2005-06 to 2017-18, we find that in the year 2006-07, more than 28,700 villages had been electrified, the highest among the years that have been compared. The number of villages electrified each year grew steadily from 2007-08 to 2010-11, after which there was a drastic slump. From 18306 in 2010-11 to 7934, 2587 and 1197 in 2011-12, 2012-13 and 2013-14 respectively. Thus, the fag end of UPA-II saw a slowdown in rural electrification coverage. For 2014-15 i.e. the year in which Modi Govt assumed power, the number of villages electrified stood at a low 1405. However, the pace picked up sharply in the subsequent year and beyond to achieve total coverage in 2018. The graph below shows the y-o-y comparison.", "Over 95.60% of villages had already been electrified before May 2014. The present government kept the pace and completed the balance 4+% in the announced time-frame. Since the brightness of the maps is being equated to the extent of rural electrification, in absolute numbers, UPA Govt’s performance is superior to that of NDA Government.", "However, irrespective of which Govt achieved greater electrification, do the night maps released by NASA capture an increase in rural electrification at all? According to NASA website, the capture of night time view is made possible by the Visible Infrared Imaging Radiometer Suite. VIIRS detects gas flares, auroras, wildfires, city lights, and reflected moonlight. For the night maps, auroras, fires, and other stray light have been removed to emphasize the city lights.", "NASA clearly states that it is city lights that are captured in the night maps put out by them. To further verify this, Alt News overlapped a map of major cities of India on the 2016 NASA night lights map.", "As can be seen from the image above, major cities coincide with spots of bright light on the map, from Ahmedabad to Mumbai to Pune to Bangalore to Hyderabad to Delhi and even cities in Pakistan. Dhaka is not labelled on the map but there’s a giant bright spot on the map where Dhaka would have been located otherwise.", "In fact, Piyush Goyal himself tweeted a CNN article which co-relates the bright spots on NASA nighttime map to growth of Indian cities.", "NASA’s night time satellite images show huge growth of Indian cities via CNN https://t.co/yuXV4KM20A", "— Piyush Goyal (@PiyushGoyal) April 14, 2017", "The CNN article states:", "“Huge swaths of northern India, relatively dark in 2012 night shots, are lit up by huge new urban areas in imagery from 2016. According to the Oxford Economics Global City Forecast, of the 20 fastest-growing cities in the 2015-19 period, fourteen are in India.”", "According to the statistics above, between 2012 and 2016, 12297 villages were electrified which is a minuscule percentage (2%) of 597,464 inhabited villages in India. Clearly, it is the growth of urban pockets which has contributed majorly to India looking brighter in 2016 as opposed to 2012. Piyush Goyal has made a blooper, yet again.", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]