["On April 18, BJP’s National General secretary BL Santosh tweeted an image of Switzerland’s Matterhorn mountain with the message, “Matterhorn mountain in Swiss Alps lighted with tricolour in the name of HOPE after India under @narendramodi supplied HCQ tablets & leads the #Covid_19 battle… #IndiaFightsCorona”. The image shows the mountain lit up in the colours of the Indian national flag. The post has been retweeted more than 2,400 times so far.", "The official Facebook page of Prasar Bharati News Services also posted the photo with the same claim.", "The same message is viral with the image on Twitter and Facebook.", "Alt News has also received a few requests on its Android application to fact-check this image.", "We found that the image of the Indian National flag being projected on Switzerland’s Matterhorn mountain is true. However, the claim shared along with the image that this happened after India supplied HCQ tablets to the country is false. With a keyword search on Twitter, Alt News found a tweet by the official handle of the Indian embassy in Switzerland. According to a tweet, the Indian tricolour was projected on the Matterhorn mountain to express solidarity to all Indians in the fight against COVID-19.", "INDIAN TRICOLOR ON THE MATTERHORN MOUNTAIN: Indian Tricolor of more than 1000 meters in size projected on Matterhorn Mountain, Zermatt, Switzerland to express Solidarity to all Indians in the fight against COVID 19. A big Thank You to @zermatt_tourism for the gesture. @MEAIndia pic.twitter.com/y4diNDSlT9", "— India in Switzerland, The Holy See & Liechtenstein (@IndiainSwiss) April 17, 2020", "The same photo was put out by the official Instagram handle of Zermatt Matterhorn’s tourism website. “Hope and strength to all Indians,” said the message posted along with the image.", "Hope and strength to all Indians. 😚 . . #zermatt #matterhorn #thankful #thankyou #stayhome #keepsafe #keephealthy #covid_19 #staystrong #zusammensindwirstark #westandtogether #solidarity #hope #corona #coronatime #soschützenwiruns #swissalps #earth_shotz #inlovewithswitzerland #bestearthscapes #earthpix #iloveswitzerland #amazingswitzerland #gameoftones #myswitzerland #thisweekoninstagram #feelthealps #switzerlandpictures #india #switzerland . . 📷 @gabrielperren", "A post shared by  Zermatt – Matterhorn (@zermatt.matterhorn) on Apr 17, 2020 at 11:00pm PDT", "According to the tourism website of Zermatt Matterhorn, flags of several other countries fighting the pandemic were projected on the mountain, not just the Indian tricolour. You can see the images of the mountain lit up with national flags of India, China, America, Japan, Germany, Britain, Spain, France, and Italy.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]