["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "John Morgan, the lawyer who spearheaded Florida’s 2016 constitutional amendment to allow medical marijuana use, says that the Legislature has ignored the will of the voters by banning smoking it.", "In November, about 71 percent of Florida voters approved the medical marijuana amendment.", "To implement the new law, the Legislature passed a provision that defines medical use to exclude smoking marijuana.", "Morgan filed a lawsuit July 6 asking the Leon County Circuit Court to declare the Legislature’s provision unenforceable. He says that while the amendment allows the Legislature to ban smoking in public, it does not allow it to ban smoking in general.", "In the lawsuit, Morgan made some claims about the benefits of marijuana and then said this:", "\"Despite decades of marijuana being used for smoking in the United States, there have been no reported medical cases of lung cancer or emphysema attributed to marijuana.\"", "There have been people who smoked marijuana who had lung cancer, but that in itself doesn’t tell us if marijuana caused the cancer. We found some evidence to support Morgan’s statement, but the research comes with significant caveats and experts say more research is needed to reach more definitive conclusions.", "(Morgan also mentioned emphysema, but we will focus here on cancer.)", "Ben Pollara, who worked with Morgan on the amendment, sent us multiple articles related to research on cancer and marijuana.", "The most comprehensive information comes from a January 2017 report by the National Academies of Sciences, Engineering and Medicine.", "The report was written by a committee of experts who reviewed studies since 1999 regarding health effects of using cannabis and cannabis-derived products related to various diseases including lung cancer.", "In the section on lung cancer, the researchers looked at research and concluded: \"There is moderate evidence of no statistical association between cannabis smoking and the incidence of lung cancer.\"", "However the committee also noted that the studies it reviewed -- and research in general about marijuana -- had limitations:", "• A 2015 study published in the journal Cancer pooled data on 2,159 lung cancer cases. This study found no statistically significant association between smoking cannabis and lung cancer incidence including for a subgroup of study participants who were not tobacco smokers. However, the study noted that \"the possibility of potential adverse effect for heavy consumption cannot be excluded.\" The study relied on patients’ self-reporting about their use of cannabis.", "• In 2015, the American Association for Cancer Research published an epidemiologic review. One study evaluated lung cancer risk among 49,321 Swedish military conscripts over a 40-year period and found they had a statistically significant risk of developing lung cancer compared with those who didn’t use cannabis. However, the report noted several gaps related to the Swedish study, which the author has acknowledged.", "Overall, the National Academies report called for more research about marijuana and health effects while noting several barriers, including that it is classified as a Schedule 1 substance and that researchers often find it difficult to gain access to the quantity, quality, and type of cannabis product necessary to address specific research questions.", "Pollara also pointed to information on the American Cancer Society website that listed marijuana in a section on factors with uncertain or unproven effects on lung cancer risk.", "The ACS states that there are some reasons to think that smoking marijuana might increase lung cancer risk, including that marijuana smoke contains tar. However, it also explains that it’s difficult to research the impact of marijuana since the use has been illegal in many places for a long time, and many lung cancer patients have smoked marijuana and tobacco, making it difficult to attribute causes.", "\"More research is needed to know the cancer risks from smoking marijuana,\" ACS states.", "Many experts we reached echoed the sentiment that additional research is needed.", "Harvard Medical School professor Bertha K. Madras reviewed multiple studies and her conclusion was similar to the National Academies report that there didn’t appear to be an association.", "However, Madras expressed caution about reaching conclusions.", "\"Absence of evidence is not evidence of absence,\" she told PolitiFact. \"Data are old. Currently we have more persons smoking high potency marijuana daily than years ago, when most studies were collecting data.\"", "A 2016 literature review written by University of Tampa health sciences professor Mary Martinasek showed that while some studies indicated an increased risk of lung cancer, others found no such link or a lower risk for lung cancer.", "\"There is little evidence to support statistical associations either for or against cannabis and lung cancer,\" she said. \"We need more research to confirm or deny an association.\"", "Dr. Suzanne Sisley, who is an expert witness for Morgan and is doing an FDA approved trial related to marijuana and PTSD, said that the federal government has sought for decades to prove smoking marijuana caused lung cancer and has been unable to do so.", "Morgan said, \"Despite decades of marijuana being used for smoking in the United States, there have been no reported medical cases of lung cancer\" attributed to marijuana.", "The most comprehensive analysis about the health effects related to cannabis comes from a 2017 report by the National Academies of Sciences. The report found \"moderate evidence of no statistical association between cannabis smoking and the incidence of lung cancer.\"", "However, the report also noted various limitations of the research. Overall, the academies called for more research -- a sentiment shared by other experts we interviewed.", "Morgan’s statement is partially accurate, but more evidence is needed before definitely declaring smoking marijuana is risk-free when it comes to lung cancer. We rate the statement Half True.", "National Academies of Science and Engineering, \"The Health Effects of Cannabis and Cannabinoids: The Current State of Evidence and Recommendations for Research,\" Jan. 12, 2017", "Cancer, \"Cannabis smoking and lung cancer risk: Pooled analysis in the International Lung Cancer Consortium,\" (Zhang et al) February 2015", "Cancer Epidemiology Biomarkers Prevention, \"An epidemiologic review of marijuana and cancer: an update,\" (Huang et al) January 2015", "National Institute on Drug Abuse, Marijuana, Accessed July 12, 2017", "American Cancer Society, \"Small cell lung cancer risk factors,\" Accessed July 11, 2017", "World Health Organization article by Bertha K. Madras Professor of Psychobiology Department of Psychiatry Harvard Medical School, \"Update of Cannabis and its medical use,\" 2015", "Respiratory Care article by University of Tampa professor Mary Martinasek, \"A Systematic Review of the Respiratory Effects of Inhalational Marijuana,\" November 2016", "Medical Jane, \"Cannabidiol (CBD) May Prevent Cancer From Cigarette Smoke,\" Aug. 20, 2013", "Science Daily, \"Marijuana Cuts Lung Cancer Tumor Growth In Half, Study Shows,\" April 17, 2007", "Pharmacology, \"Cannabinoids inhibit cellular respiration of human oral cancer cells,\" (Donna Whyte et al) 2010", "AP, \"The good, the bad and the unknown about marijuana’s health effects,\" Jan. 12, 2017", "Miami Herald, \"John Morgan sues state for blocking the smoking of medical marijuana,\" July 6, 2017", "PolitiFact, \"R.I. psychotherapist says marijuana contains 50 to 70 percent more cancer-causing chemicals than tobacco,\" March 6, 2014", "Interview, Ben Pollara, United for Care treasurer, July 14, 2017", "Interview, Bertha K Madras, Professor, Department of Psychiatry, McLean Hospital Harvard Medical School, July 12, 2017", "Interview, Mary Martinasek, Assistant Dean, Natural and Health Sciences, Associate Professor, Public Health, Health Sciences and Human Performance University of Tampa, July 12, 2017", "Interview, Calvina Fay, Drug Free America Foundation executive director, July 12, 2017", "Interview, Dr. Suzanne Sisley, witness in John Morgan’s lawsuit who is doing an FDA approved trial of military veterans with PTSD who smoke cannabis, July 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]