["In his State of the State speech, Gov. Mike Parson discussed his goals for improving workforce development and infrastructure in Missouri. He pointed to plans to expand broadband, improve river transportation and the need to care for Missouri highways.", "\"Missouri has one of the largest highway systems in the country, and since we sit at the nexus of east and west, this system receives a great deal of strain,\" Parson said. \"Nonetheless, we maintain this system with one of the lowest levels of funding in the country.\"", "Where does Missouri rank in highway funding? Does the state have lower highway funding than Rhode Island or Vermont? We decided to find out.", "According to Parsons’ press office, this claim was taken from the Missouri Department of Transportation’s Citizen's Guide on Transportation Funding. The guide says, \"Missouri ranks 48th nationally in revenue per mile, primarily because the state’s large system — the nation’s seventh largest with 33,859 miles of highways — is funded with one of the lowest fuel taxes in the country: 17 cents per gallon.\"", "The key term here is \"revenue per mile.\" When you divide the average funding by the miles of roads maintained, Missouri ranks at the bottom. According to the Citizen’s Guide on Transportation, \"Missouri’s revenue per mile is $50,882, while the national average is $238,076.\"", "When asked, a spokeswoman for the Missouri Department of Transportation pointed to the same data.", "\"Missouri ranks seventh in miles of highways maintained,\" spokeswoman Sally Oxenhandler said in an email.", "When the Missouri legislature raised the state fuel tax in 1952, MoDOT took on an additional 12,000 miles of road maintenance. The goal was to have 95 percent of Missouri residents within 2 miles of a hard-surfaced road, Oxenhandler said.", "The low funding level \"leads to significant unfunded transportation needs across Missouri,\" Oxenhandler added.", "We cross-checked this data with the U.S. Department of Transportation and found it was accurate.", "When evaluating total funding, however, Missouri does not rank as low. Using aggregated data from the Federal Highway Administration, Missouri ranks 26th in highway funding revenue. Texas, California and New York rank at the top, and Vermont, Rhode Island and Wyoming rank at the bottom.", "Robert S. Kirk, a specialist in transportation policy with the Congressional Research Service, said in an email, \"If the issue is how much financial effort the state is putting into the roads, revenue per mile of state road is OK, as would be vehicle miles traveled per revenue spent.\"", "The important thing is that the amount of state maintained road is compared to the amount of money spent maintaining roads.", "Parson said, Missouri has one of the lowest levels of highway funding in the country.", "Missouri ranks 48th in highway revenue per mile. Though Missouri ranks 26th in total highway funding revenue, this measure does not take into consideration the amount of road a state must maintain. Revenue per mile is the best measure to evaluate highway funding, taking into account the amount of roads in a state in addition to the number of dollars spent. With this evaluation, Missouri does have one of the lowest levels of highway funding.", "We rank this statement True.", "Gov. Mike Parson, state of the state speech, Jan. 16, 2019.", "Missouri Department of Transportation, Citizens Guide Book on Transportation Funding, Accessed Feb. 2, 2019", "2015 State Statistical Abstracts, U.S. Department of Transportation, Accessed Feb. 10. 2019", "Email interview with Robert S. Kirk, Congressional Research Service, Feb 11, 2019", "Email interview with Sally Oxenhandler, Missouri Department of Transportation, Feb. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]