["About this rating", "In March 2020, a screenshot supposedly showing the above tweet from Denver councilwoman Candi CdeBaca was widely circulated in conservative circles:", "It was a genuine tweet posted by CdeBaca on Feb. 28, 2020, in response to another user's tweet that read: \"For the record, if I do get the coronavirus I'm attending every MAGA rally I can.\" While the original poster has deleted that message (archived here), CdeBaca's message still appears on her timeline.", "CdeBaca later said she was being sarcastic. She explained further in a response to to Ryan Saavedra, a reporter with The Daily Caller, writing:", "CdeBaca also sent a statement to the Denver news outlet West Word  about this controversy. The Denver councilwoman reiterated that her tweet was sarcastic and explained that she was mocking how U.S. President Donald Trump and some conservative politicians have been downplaying the threat of the disease.", "CdeBaca wrote (the full statement can be read here):", "Twitter is twitter. Sarcasm is often the tone of tweets, especially political commentary because of the nature of the tool. It's designed for 125 characters of sharp and simple commentary.", "I made a sarcastic tweet on Twitter responding to a thread regarding the CDC briefing with Trump to call attention to the administration's downplaying of the Coronavirus outbreak as a \"hoax\" no more dangerous than the common flu. What the conservatives are missing (in addition to the sarcasm) is the irony in their concern for human life is that is precisely what I was mocking the president for lacking. The original poster was sarcastically conveying that if the President believes it is a hoax, then why should there be worry if infected individuals are in their presence? She was sarcastically conveying that she would show up to their rallies in solidarity.", "I simply amplified her sharp commentary and the inconsistency in their application of logic seems to have shown itself to us in the responses from conservative media.", "While Trump has been criticized for downplaying the seriousness of the new coronavirus, he didn't exactly call the disease a \"hoax.\" Read more about that controversy here.", "Swanson, Conrad.   \"Denver Councilwoman Candi CdeBaca Tweets 'Sarcastic' Endorsement of Spreading Coronavirus at GOP Rallies.\"\r\n    Denver Post.   3 March 2020.", "McCormick-Cavanagh, Conor.   \"Candi CdeBaca 'Sarcastic' Coronavirus Tweet Goes Truly Viral.\"\r\n    Denver Post.   3 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]