["About this rating", "On 10 July 2016, Facebook user Wesley Scott Alexander posted a video supposedly documenting Black Lives Matter (BLM) protesters chanting a demanding \"dead cops\" three days after a shooting in Dallas during which five officers were killed and several more wounded:", "#BLM protestors chant \"what do we want? DEAD COPS! When do we want it? NOW!\". Please share because the media won't.", "At the time the video was posted, tension between white police officers and black civilians was high, all the more so after three more officers were shot and killed in Baton Rouge, Louisiana, a week later. The clip began appearing in our inbox shortly after the latter event,  suggesting that readers believed the chant and the incidents in Dallas and Baton Rouge were concurrent. In some instances, social media users asserted that protesters had chanted for \"dead cops\" outside a Dallas hospital:", "@HamlettKimberly because they chant \"what do want! Dead cops!\" Outside hospital of slain officers", "— Scott R (@ScottR1327) July 8, 2016", "Alexander's plea for users to \"share\" the clip because \"the media won't\" furthered impressions that Black Lives Matter protesters had loudly called for dead cops, that at least two individuals had answered the call in the worst way imaginable, and that a media conspiracy sought to bury the ugly truth. Repeatedly, readers apparently unfamiliar with Baton Rouge and New York City asked if the clip was footage from July 2016 protests held in the former location following the shooting death of Alton Sterling.", "In fact, July 2016 wasn't the first time this particular bit of footage caused both confusion and consternation. A Fox News video uploaded to YouTube on 15 December 2014, just before the ambush shooting deaths of two New York City police officers, documents that the protest it captured occurred on or before that date:", "The earliest tweets about that video also appeared on 13 December 2014 (linking to a since-deleted page):", "#shutitdown RT @alimhaider: Brooklyn Protest — “What do we want? Dead cops! When do we want it? Now!” (vid) https://t.co/HKPXpoEEPF — Pro-Western Local (@theWest) December 14, 2014", "Brooklyn Protest — “What do we want? Dead cops! When do we want it? Now!” (vid) https://t.co/TI8MMhoDNy", "— Jubal E. Harshaw (@alimhaider) December 14, 2014", "Officers Rafael Ramos and Wenjian Liu were shot dead on 20 December 2014, five days after that news clip appeared on Facebook, showing that the video antedated even that event. Following the deaths of Officers Ramos and Liu, the group @MillionsMarchNYC sent a tweet disavowing the chanters depicted in the video and expressing condolences over the murders of those policemen:", "From the #MillionsMarchNYC team.@TheSynead @UmaaraIynaas pic.twitter.com/Ryguy8mW2q — Millions March NYC (@MillionsMarch) December 21, 2014", "This clip and some background information about it were referenced in another video debunking Black Lives Matter myths that was posted online on 10 July 2016. At approximately the three-minute mark, the narrator notes that the \"dead cops\" clip captured a small group of protesters who hung around after the end of the Millions March in December 2014 and were disavowed by the organizers of that event, while video of the official Millions March event shows that it was a peaceful protest:", "The controversial clip was also misrepresented by some national news outlets as being a part of larger, mainstream protests:", "A separate video published around the same time involved a clip of protesters that had been deliberately misreported (or edited) to suggest that a crowd chanting \"we won't stop, we can't stop, until killer cops are in cellblocks\" (in reference to the Freddie Gray case) was really saying \"we won't stop, we can't stop, so kill a cop\":", "The original video of New York protesters referenced at the beginning of this article was uploaded on 13 December 2014 by Manhattan resident Tom Dilello, who maintained that he shot and uploaded the clip in the span of six minutes, leaving no time for him  to edit the raw footage of the \"dead cops\" chant.  A few weeks later, Dilello spoke to BuzzFeed about the then-viral video:", "In a phone interview, Dilello, who shot the video, told BuzzFeed News that he posted it to YouTube because, “I had never heard a group of people chanting that kind of crap in my life,” he said. “It was totally unacceptable, especially in my street.”", "After a FOX affiliate in Baltimore aired a video on Dec. 21 purporting to show another group chanting for dead cops — it turned out the video was edited inappropriately — many commenters on news sites like weekly Rockland Times and NBC News said they thought Dilello’s video was doctored. Some protesters suggested to BuzzFeed News that Dilello was a plainclothes police officer. He denied both ideas, adding that he had received threats since posting the video.", "“I am not a cop, I don’t know any cops, nobody in my family is a cop,” he told BuzzFeed News. “People think I manipulated the audio. I had a full six minutes from the time I took it to when I uploaded it.”", "That outlet also consulted an audio expert about the clip's authenticity:", "To verify the authenticity of the video, BuzzFeed News asked George Papcun, a forensic audio analyst who is an expert in altered recordings, to listen to the video. (Papcun has provided testimony in several high-profile cases. When George Zimmerman was on trial for the death of Trayvon Martin, Papcun’s testimony was ultimately beneficial to Zimmerman.)", "“I have listened to [the recording] with sophisticated audio equipment,” Papcun said. “Beyond a reasonable doubt, in my opinion, leaders chant, ‘What do we want?’ The crowd responds, ‘Dead cops.’ Then leaders chant, ‘When do we want it?’ The crowd responds, ‘Now.’”", "Papcun said that he had been able to isolate one more phrase in the muddled audio at the beginning of the recording: “Shoot back.”", "On 23 December 2014 (ten days after Dilello shared the video, and three days after the NYPD officers were ambushed), the Daily Beast attempted to drill down on who was responsible for the chanting. Their annotated article maintained that the New York chapter of the Trayvon Martin Organizing Committee (TMOC), who were unauthorized by the Martin family to use Trayvon's name or likeness, were the sole faction of marchers using the chant. The Daily Beast highlighted the use of a unique protest banner to connect TMOC with the December 2014 footage:", "An Instagram of that “No Cops No Prisons” banner displays a number of hashtags, including #turnuptheanger, a hashtag associated with TMOC. (The first mention of #turnuptheanger on Twitter, for example, directs to a Facebook page hosted by the Trayvon Martin Organizing Committee NYC.)", "It’s not the only apparent link between the “dead cops” chant and TMOC. At the beginning of the video and before the call to kill police, you can hear what sounds like, “arms up, shoot back!” That slogan appears on TMOC’s Twitter account.", "Such forensic reporting deemed the \"dead cops\" chant to be an aberration, one clearly \"smuggled in\" amid widespread peaceful protests involving tens of thousands of people (versus an estimated 200 \"dead cops\" chanters who were not part of Black Lives Matter):", "These violent messages appeared online and in the streets before the police were murdered and continued after. But you can’t reduce the mass protests in New York to a call for killing police without ignoring how that particular message had to be smuggled in.", "Political factions obsessed with government saboteurs and false-flag operations had to conspire to manipulate the larger movement around them. To give the truth its rights, you have to see that groups like TMOC were threatened by peaceful protest. For them, this city wasn’t angry enough.", "Update: Trayvon Martin’s family sent a statement exclusively to the The Daily Beast rejecting any association with the “Trayvon Martin Organizing Committee” and “its unauthorized use of our son’s name recently to carry a message of violence.” Read the full story here.", "Editor’s Note: this story has been updated with new information about online anti-police messages, and to clarify the nature of the Trayvon Martin Organizing Committee NYC’s relationship to people recently arrested for allegedly assaulting New York City police officers.", "MSNBC similarly performed some digging into what had become, in the aftermath of the NYPD officers' shooting, a clip widely-shared as emblematic of protests occurring at that time:", "The chant I didn’t hear on Dec. 13 was the one captured on a cell phone video and uttered by a small group numbering a few dozen, marching in a cluster behind a makeshift banner:", "“What do we want? Dead cops! When do we want it? Now!”", "The video of that particularly venal bromide was taken from a window high above Murray Hill, an upscale neighborhood in the middle part of Manhattan’s east side. It has been replayed and repeated over and over as part of the coverage of the tragic killing of officers Ramos and Liu, including on MSNBC.", "And yet, evidence shows the group that engaged in the death chant against police weren’t part of Millions March NYC. And if they did indeed march on Dec. 13, they did so long after the larger protest had moved downtown. They were not part of the main group.", "For one thing, according to the video, which was posted to Youtube the same day as the protest, the “dead cops” chant took place after sunset. You can see from the video that city lights are already on. The group starts by chanting “hands up, shoot back,” before switching to the death chant, and then an unintelligible chant at the end of the approximately 2 minute clip.", "MSNBC reported that the Millions March protests officially concluded at One Police Plaza at 6:30 PM, when the permit to demonstrate expired. The nighttime clip was clearly unrelated to it, and while commenters in 2016 lamented that the \"media won't\" show the footage, it was clearly widely aired back in 2014:", "By the time it reached Herald Square, which is on the west side of the city at least a mile from Murray Hill, it was still daylight. My photos from Herald Square are time stamped at around 3:30 p.m.", "The official march ended at One Police Plaza at 6:30 p.m., when the march’s permit expired, a point reinforced by a tweet sent by the organizers at 7:26 p.m.", "“Once the march reached 1 Police Plaza the march ended and there was a tweet that went out saying that anything that happens afterward was not organized by the MMNYC,” communications director Kate McNeely told me.", "According to Tom Dilello the clip was shot an hour's walk away from One Police Plaza, at 32nd Street and Fifth Avenue. Presumably marchers move more slowly than individual pedestrians, making the chanters again unlikely offshoots from the official march that concluded three miles downtown:", "The clip in question involving chants about \"dead cops\" was shot in New York City in December 2014, but contemporaneous reporting widely and incorrectly identified its source as Black Lives Matter and Millions March demonstrations taking place in different parts of the city at different times. After shootings claimed the lives of police officers in Dallas and Baton Rouge in July 2016, the clip resurfaced and was often mislabeled as occurring in one of those locations.", "Mora, Nicolás Medina.   \"Protester Who Chanted for 'Dead Cops' Says They Didn’t Mean It.\"\r\n    BuzzFeed.   3 January 2015.", "Reid, Joy-Ann.   \"The Truth About rhe ‘Dead Cops’ Chant.\"\r\n    MSNBC.   23 December 2014.", "Uygur, Cenk.   \"Fox Affiliate Caught Altering Protester Chant Video.\"\r\n    The Young Turks.   22 December 2014.", "Siegel, Jacob.   \"The Monsters Who Screamed for Dead Cops.\"\r\n    The Daily Beast.   23 December 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]