["Following Oprah Winfrey's consequential interview with Duchess Meghan and Prince Harry, social media has been flooded with mentions of all three public figures.", "One viral March 9Facebook post — which repeats a claim similar to others that went viral previously —  contains an image of Oprah sitting with singer Rita Ora, and Harvey Weinstein is visible in the upper left corner.", "The photograph was taken in 2014 at a Weinstein company event, according to a reverse image search. Ora tweeted some photos from the 2014 event after Winfrey's speech about the Time's Up movement at the 2018 Golden Globes.", "The Facebook post's caption reads, \"I think now is an excellent time to remind everyone that Oprah Winfrey for years and years pimped young Hollywood girls to Harvey Weinstein to be raped.\"", "USA TODAY has reached out to the poster for comment.", "Fact check:Meghan and Harry were not paid for their Oprah interview", "Winfrey has been caught up in various conspiracy theories in the last few years, with social media users falsely claiming she was under house arrest for sex-trafficking children alongside Ellen DeGeneres or that she was listed in Jeffrey Epstein's flight logs.", "Reports uncovering decades of abuse and harassment by Weinstein broke in October 2017. He was ultimately convicted and sentenced to 23 years in prison.", "Following the reports, Winfrey and other celebrities spoke out to condemn Weinstein's individual actions, as well as the systems that enabled him to continue patterns of abuse.", "“I’ve been processing the accounts of Harvey Weinstein’s hideous behavior and haven’t been able to find the words to articulate the magnitude of the situation,” Oprah reportedly wrote on Facebook.", "“Filmmaker James Schamus captured so much of what I’ve been feeling when he said: ‘This is the story of one predator and his many victims; but it is also a story about an overwhelming systemic enabling, and until that story is fully told we will fall far short of stopping future depredations on a similar scale,\" she also wrote, according to People Magazine.", "Additionally, Oprah has not been implicated in any of the 87 reports of sexual abuse or harassment by Weinstein.", "The claim is FALSE, based on our research. There is no evidence to support the claim that Oprah Winfrey was involved in any of the abuse or harassment by Harvey Weinstein.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]