["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew M. Cuomo claimed a case before the Supreme Court could end public labor unions. (Courtesy: Cuomo's Flickr account)", "Gov. Andrew M. Cuomo said in his State of the State address that a Supreme Court decision could end public labor unions.", "Cuomo said the case would be a blow to workers in New York state, which is home to the highest percentage of union workers in the country.", "\"A case before Washington’s Supreme Court seeks to effectively end public labor unions,\" Cuomo said. \"We will await the decision in the Janus case, but we must do all in our power to protect collective bargaining, the right to organize, and preserve workers’ rights.\"", "Cuomo did not say what actions the state would take to protect unions if the Supreme Court rules against them.", "The case he referred to will be heard by the court next month and decided later this year. It involves a state employee in Illinois and the union that represents him.", "Is Cuomo right that the court’s decision on the case would end public labor unions?", "Details on the case", "The case involves Mark Janus, an Illinois Department of Healthcare and Family Services employee, and the American Federation of State, County, and Municipal Employees. AFSCME represents workers at the agency where Janus works. He is not a member of the union, but money is still taken out of his paycheck to support it. He believes forcing non-members like him to pay union fees violates their constitutional right to free speech.", "\"I’m forced to pay money to a union that then supports political causes I don’t agree with,\" Janus said in an interview with Illinois Policy, a conservative think tank.", "If the court sides with Janus, non-members would no longer have to pay those fees. The decision would only apply to public sector unions.", "Unions are allowed to charge non-members a fee less than the amount of full dues because of a different Supreme Court decision in 1977.", "The court ruled in Abood v. Detroit Board of Education that non-members can still be required to make some payments to unions because the union negotiates for all workers, not just those who pay dues. Money from non-members may not be used for any of the union’s political campaigns.", "AFSCME spends millions of dollars each election cycle supporting Democrats, according to data from the Center for Responsive Politics. The union also lobbies lawmakers on issues it believes important to workers, like paid family leave.", "Analysis by experts", "Unions would suffer financially from the decision, but not end altogether, experts said.", "\"No, it doesn't mean the end of unions, and I certainly disagree with the governor about it,\" said Lee Adler, a senior extension associate at Cornell University’s School of Industrial and Labor Relations. \"It’s a very serious challenge to unions, there’s no question about it.\"", "Public unions would have to do the same amount of work with fewer resources. Non-members would no longer have to pay fees, but unions would still have to represent them in contract negotiations and grievances.", "\"Unions are no different than any other organization,\" said Celine McNicholas, labor counsel at the Economic Policy Institute, an economic research organization. \"It’s very difficult for an organization to be required to provide services to people who do not provide payment for those services.\"", "That may limit the power of what unions can accomplish, but the decision would not end collective bargaining or worker representation. It would just make those services harder to provide.", "\"There is that core of truth to what Cuomo is saying,\" said Vin Bonventre, professor of law at Albany Law School. \"Claiming that it is going to destroy unions is far too broad a statement.\"", "Some states have already passed laws to prevent unions from collecting payments from non-members. Public employees still organize in those states. Florida, for example, has had such a law for more than 70 years, but AFSCME still has more than 60 locals in the state.", "Our ruling", "Cuomo said \"a case before Washington’s Supreme Court seeks to effectively end public labor unions.\"", "The case presents a challenge for public labor unions that have been able to collect revenue from non-members. If the court sides with Janus, non-members of public unions would not have to pay union fees. But his claim that it would end those unions is an exaggeration, experts said.", "Cuomo's office did not respond to our inquiry about his claim.", "The statement is not accurate. We rate it False.", "Gov. Andrew M. Cuomo’s 2018 State of the State Address, Jan. 3, 2017", "Phone interview with Lee Adler, senior extension associate and adjunct professor at the  New York State School of Industrial and Labor Relations", "Phone interview with Vin Bonventre, professor of law at Albany Law School", "Phone interview with Matthew Dimmick, professor of law at the University at Buffalo School of Law", "Phone interview with Celine McNicholas, labor counsel at the Economic Policy Institute", "SCOTUSblog case file on Janus v. American Federation of State, County, and Municipal Employees, Council 31", "\"Symposium: Evidence shows unions will survive without agency fees\", Dec. 22, 2017, Patrick Wright, vice president for legal affairs at the Mackinac Center for Public Policy", "\"Symposium: Agency fees benefit the workplace — just ask the states\", Dec. 22, 2017, Xavier Becerra, the attorney general of California and Aimee Feinberg, a deputy solicitor general in the California Department of Justice", "\"For the third time, justices take on union-fee issue: In Plain English\", Dec. 18, 2017, SCOTUSblog", "Abood v. Detroit Board of Education, 1977, Cornell Legal Information Institute", "\"Supreme Court Will Hear Case on Mandatory Fees to Unions\", New York Times, Sept. 28, 2017", "\"Meet the man who could end forced union fees for government workers\", Illinois Policy interview with Mark Janus", "Center for Responsive Politics file on AFSCME, OpenSecrets.org", "\"The Janus Stakes\", Empire Center for Public Policy, Jan. 9, 2017", "AFSCME Florida local chapters", "Right-to-work laws in each state, National Conference of State Legislatures", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]