["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Escambia Sheriff David Morgan made some controversial statements about African-Americans in speeches.", "Escambia County Sheriff David Morgan has shared controversial thoughts on race, crime and African-American culture in a couple of videos.", "But he didn't go as far as some blogs would have you believe.", "The video clips have circulated across the Internet for years under this headline: \"Florida Sheriff: Blacks should learn to act like white people in order to stay alive.\"", "We noticed the headline on Aazah, a news and entertainment website for LGBTQ persons of color. Facebook flagged a post with the misleading headline as part of its efforts to identify fake news.", "In this case the headline is misleading, but the contents of the story are not necessarily fake.", "The spliced video clips of Morgan first circulated about four years ago, said Amber Southard, a spokeswoman for Morgan, who was re-elected to a third term in November 2016.", "\"Nowhere in the video does he say\" what the headline says, she said.", "Morgan has been in the news for controversial statements or practices involving African-Americans, but the claim that he did made the statement in the headline is wrong. We didn’t hear that statement in the videos, and we searched for it in Nexis and found no evidence that Morgan said it. We attempted to reach someone at the website where we saw this headline and were unsuccessful.", "We can’t fully evaluate Morgan’s comments because they appear to stem from partial videos and not full speeches. However, here is a summary of what he did say in the clips with some added context from other news accounts.", "PolitiFact Florida examined the origins of this claim as part of the inaugural International Fact-Checking Day, April 2, 2017. Organizers at Poynter.org describe the day as \"not a single event but a rallying cry for more facts -- and fact-checking -- in politics, journalism, and everyday life.\"", "‘Let me take issue with the title of African-American'", "In the first video clip, Morgan appears to be speaking in a sheriff’s office.", "\"First off, let me take issue with the title of ‘African-American,’\" Morgan begins. \"We’re Americans.\"", "Morgan then explains that he is \"fourth-generation Welsh\" and doesn’t refer to himself as a \"Welsh-American.\"", "\"I was not born in Wales and the blacks that currently reside in the United States of America are not from Africa,\" he says. \"Those sorts of terms that society has come to use are divisive in nature.\"", "Morgan then says many issues in the minority community in Escambia County are real while \"most of them are perceived.\"", "Morgan then says that not that many years ago, the thought of an African-American president would have been unthinkable but Barack Obama won election twice by getting the votes of people of various races -- not just blacks.", "\"If we’re such a racist nation, why do we currently have an African-American president?\" he says.", "The video shows Morgan offering his critique of the black community:", "\"We have unfortunately in the black community embraced a thug culture -- one that aggrandizes,  again, foul language, shooting cops, abusing women and if you don’t think those things have an effect on our children, you need to get a grip.\"", "Cites black-on-white crime incidents", "One of the video clips appears to come from part of a speech that Morgan made at a Rotary Club meeting in August 2013.", "His speech followed an incident in which two white Escambia deputies shot an unarmed black man who was looking for cigarettes in his mother’s car parked in his driveway. The deputies fired multiple rounds and two bullets struck 60-year-old Roy Middleton, shattering his leg. The deputies were responding to a burglary call. (A grand jury later found insufficient evidence to prosecute the officers but called for more intensive training for deputies.)", "The video clip circulating on the Internet shows Morgan recounting three violent crime incidents that involved black perpetrators and white victims.", "\"Last night we had four black male teenagers attack a 77-year-old white man,\" he said. \"Where is the public outrage in that?\"", "He also recounted a homicide in which he said three black people beat a white woman to death and a time a black man shot an unarmed white man \"execution style.\"", "Morgan then calls for \"equality across the board\" and calls for working together with families, schools and churches to bring back \"character and integrity to our communities.\"", "He says that criminologists have identified the \"rise of the superpredators\" -- people who are \"not tethered to faith, family, religion or community.\"", "\"It's about me, it's about my personal wants, needs and desires to the exclusion of anyone and everything and most assuredly institutions,\" he said.", "We read news articles about other portions of Morgan’s speech that were not included in the video clips.", "\"I'll share with you a political axiom that I think is appropriate today for what the Escambia County Sheriff's Office is currently facing,\" he said, according to the Pensacola News Journal. \"When forced to swallow (excrement) ... it is recommended to swallow it whole and for God's sake, don't chew it. We've been handed a couple of these here recently, and I'm doing my best to choke them down.\"", "(Slate wrote that the word Morgan used was \"turds.\")", "The audience laughed, and Morgan then discussed the apparent \"lack of race relations\" in the county.", "\"I was of the opinion, until just recently, that we have built some bridges in the community, and obviously we have not,\" he said. \"No one is more appalled by this than I ... I will also tell you that we intend to stay the course.\"", "Our ruling", "A headline that appeared on many websites quoted a Florida sheriff as saying \"blacks should learn to act like white people in order to stay alive.\"", "The articles include video clips of Escambia Sheriff David Morgan giving a Rotary Club address about black-on-white crime and the local outrage over the shooting of a black man by two white police officers.", "The stories use real quotes from Morgan, but not the one given most prominence in the headline. We listened to the clips and did not hear Morgan make that particular statement.", "We rate this claim Mostly False.", "Aazah, \"Florida Sheriff: \"Blacks Should Learn To Act Like White People In Order To Stay Alive,\" Aug. 26, 2015", "U.S. Department of Justice, \"Justice Department Finds Unconstitutional Conditions of Confinement at Escambia County, Fla. Jail,\" May 22, 2013", "Slate, \"David Morgan Is Wrong, Terribly Wrong,\" Aug. 15, 2013", "Pensacola News Journal, \"Sheriff David Morgan wins again,\" Nov. 8, 2016", "Pensacola News Journal, \"Feds propose settlement,\" (Accessed in Nexis) Dec. 20, 2013", "Pensacola News Journal, \"Sheriff discusses criticism,\" (Accessed in Nexis) Aug. 14, 2013", "Pensacola News Journal, \"Civil rights group calls for justice after Middleton shooting,\" (Accessed in Nexis) Aug. 12, 2013", "WEAR TV, \"Sheriff Morgan reelected as Escambia County's Sheriff,\" November 2016", "U.S. Department of Justice, \"Justice Department Finds Unconstitutional Conditions of Confinement at Escambia County, Fla. Jail,\" May 22, 2013", "Tampa Bay Times, \"The State You're In: St. Augustine's moment, the offer Chili Palmer couldn't refuse, what they carry to Cuba,\" Aug. 28, 2013", "Interview, Amber Southard, Escambia County Sheriff’s Office spokeswoman, March 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]