["Supporters of U.S. Senate hopefuls Michelle Nunn and David Perdue wave competing signs during their Oct. 7 debate that included claims about Perdue’s business record outsourcing. CURTIS COMPTON PHOTOS/ AJC", "The neck-and-neck battle for Georgia’s open U.S. Senate seat appears to have found its flash point: outsourcing.", "The race had already focused heavily on the careers of Democrat Michelle Nunn and Republican David Perdue, given both are political novices.", "But Nunn, the head of the nonprofit Points of Light Foundation, has increased the drumbeat against former Fortune 500 executive Perdue since a 2005 deposition surfaced with him saying he \"spent most of my career\" outsourcing.", "In the business world, the term refers generally to the process of contracting out jobs or work abroad that had been done, or could be done, in-house.", "For workers just easing out of the Great Recession, outsourcing represents a threat to job security and job growth.", "Democrats, aware of that perceived threat by voters, have worked since summer to paint Perdue’s business record as one that benefited him and not his employees.", "But the deposition has given Nunn new ammunition, prompting updated claims in ads and in the Oct. 7 debate at the Georgia National Fair.", "\"He would be the only senator who, from his own words, has built a career from outsourcing American jobs,\" Nunn said. \"That is not the experience we need in Washington.\"", "Given the reload, PolitiFact decided to see whether the deposition moves the needle on a previous Truth-O-Meter ruling that it was Half True that Perdue’s business record focused on shipping American jobs overseas.", "First up, a primer on the deposition. It was taken as part of a lawsuit following the bankruptcy of Pillowtex, a North Carolina firm that failed shortly after Perdue’s brief stint as its CEO.", "A claim during the GOP runoff election that Perdue was to blame for the firm’s collapse earned a Mostly False ruling this summer, largely given the company’s financial woes that predated his tenure.", "Perdue, however, did tell PolitiFact Georgia that before the extent of Pillowtex’s money troubles was revealed, his turnaround plan for the company was a mix of outsourcing and marketing. It called for lower-end products to be made in Asia, while brand-name items would be American-made.", "Perdue said the same thing in the deposition.", "But those statements, and the company’s business records, reveal outsourcing plans at Pillowtex were not an effort to eliminate American jobs, said Rob Bliss, a professor of finance at Wake Forest University.", "The plan – which was never implemented – was instead designed to save at least some domestic jobs in an industry that had largely moved overseas, Bliss said.", "\"There is nothing to suggest he was narrowly moving jobs overseas just to increase profits or give himself a bonus,\" Bliss said. \"Moving jobs overseas would have been an effort to make the company more competitive. It’s a perfectly legitimate thing to do.\"", "In Pillowtex’s case, there was only a failed plan to move jobs. PolitiFact Georgia did find evidence that American jobs were lost in other firms Perdue helped manage or lead.", "Sara Lee eliminated between 8,000 and 9,000 jobs worldwide – mostly in the United States and Europe – in a 1994 restructuring.", "At the time, Perdue was the senior vice president for the company’s operations in Asia. He confirms in the deposition that he successfully increased manufacturing and contracts in the region as part of that job.", "At the same time, the company was closing four plants in Georgia, eliminating at least 540 jobs. Nunn’s earlier claim using those facts was ruled True.", "The deposition also refers to Perdue’s time as a senior VP with the Haggar Clothing Co. between 1996 and 1998.", "Perdue does not mention details of his time there, though PolitiFact research showed 1,950 American jobs were lost at Haggar during that period.", "Business records show the firm also shed 65 foreign jobs in those two years, indicating an overall business decline in addition to any move to foreign production.", "\"He was part of a bad scene in American industry,\" said Kerwin Swint, the chairman of the political science department at Kennesaw State University. \"But trying to say he doesn’t care about American workers, that’s a leap.\"", "Taken together, Perdue’s own words in the legal interrogation only reveal what was already known about his business career. He managed and led companies in industries where jobs were being lost to both cheaper foreign production – outsourcing – and also to technology and global business trends far outside his scope of control.", "Moreover, the deposition was taken two years before Perdue, as CEO of Dollar General, persuaded the discount chain to sell to a private equity firm. At the time, he had grown the chain from 5,900 to 8,500 stores, adding about 19,000 part-time and full-time jobs.", "\"Politically, it’s a good strategy to focus on the outsourcing, but that doesn’t mean it’s accurate and fair,\" Swint said. \"There is more to it.\"", "We agree. It is accurate to claim Perdue’s sworn statement is that he spent most of his business career outsourcing.", "But that doesn’t translate into callous indifference to American workers – or even a tenure that did nothing more than ship jobs abroad.", "We continue to rate the claim Half True.", "David Perdue 2005 Pillowtex deposition", "WMAZ Television, \"Nunn, Perdue clash on outsourcing, healthcare at debate,\" (Part 3), Oct. 7, 2014", "PolitiFact Georgia, \"Jobs did go overseas; but how many unclear,\" Aug. 22, 2014", "PolitiFact Georgia, \"Pillowtex accusations overstate point,\" July 1, 2014", "PolitiFact Georgia, \"Claim about Perdue's former firm hits mark,\" Sept. 5, 2014", "CNNMoney.com, \"Dollar General to be Acquired by KKR,\" March 12, 2007", "Bloomberg, \"KKR seals deal for Dollar General,\" March 12, 2007", "Interview with David Perdue, Republican candidate for U.S. Senate, July 11, 2014", "Interview with Rob Bliss, professor of finance, Wake Forest University, Oct. 13, 2014", "Interview with Kerwin Swint, chairman of political science department, Kennesaw State University, Oct. 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]