["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral image on Facebook quotes Socrates as saying, \"When the debate is lost, slander becomes the tool of the losers.\"​", "There’s no evidence Socrates said that.", "The Facebook page Allen West Republic shared the photo on the morning of Sept. 25, the day Supreme Court nominee Brett Kavanaugh and one of the women accusing him of sexual assault, Christine Blasey Ford, testified in front of the Senate Judiciary Committee. (Kavanaugh narrowly passed the Senate’s confirmation vote and was sworn in Oct. 6.)", "The post has been shared more than 12,200 times since then, but the misattribution has been around a lot longer. A user posted the quote on Goodreads in 2008, and the quote has been circulating ever since.", "Socrates didn’t write anything himself, so the picture of who he was and what he said is reliant on others’ writings. Plato and Xenophon wrote about Socrates and slander but not in the context of lost debates, said Christopher Moore, a philosophy and classics assistant professor at Penn State.  Socrates believed those who slandered him hated philosophy and truth, but he didn’t call them losers.", "In Plato’s \"Apology,\" Socrates points to his effort to find men smarter than himself as the root of slander against him, according to Debra Nails, a Michigan State University philosophy professor emeritus. When Socrates decided other men weren’t as smart as him, those men didn’t like him very much. However, there's no evidence of him saying any version of the viral image quote.", "Plato’s and Aristotle’s versions of Socrates were not interested in debates as something that could be won or lost, at least not by an individual, according to Christopher Rowe, Durham University classics and ancient history professor emeritus. In Socrates’ view, only truth could defeat anyone.", "Middle school essayists love to start with a good philosophical quote or a dictionary definition, but this supposed Socratic saying originates from the internet, not from a textbook. We rate this claim Pants on Fire!", "Allen West Republic, post, Sept. 25, 2018", "goodreads, Socrates, April 2018", "Stanford Encyclopedia of Philosophy, Socrates, Feb. 6, 2018", "Snopes, \"Did Socrates say: ‘When debate is lost, slander becomes tool of the loser’?,\" April 12, 2016", "Email interview, Penn State philosophy and classics assistant professor Christopher Moore, Oct. 8, 2018", "Email interview, Michigan State University philosophy professor emeritus Debra Nails, Oct. 8, 2018", "Email interview, Durham University classics and ancient history professor emeritus Christopher Rowe, Oct. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]