["By Saranac Hale Spencer", "Posted on February 2, 2021", "A viral video clip makes bogus claims about COVID-19 vaccines and falsely accuses the government of “pure racism” for “push[ing] this heavily on Blacks and browns.” Public health experts have recommended prioritizing those communities for the vaccine because they have suffered higher rates of infection and death during the pandemic.", "No vaccine or medical product is 100% safe, but the safety of vaccines is ensured via rigorous testing in clinical trials prior to authorization or approval, followed by continued safety monitoring once the vaccine is rolled out to the public to detect potential rare side effects. In addition, the Food and Drug Administration inspects vaccine production facilities and reviews manufacturing protocols to make sure vaccine doses are of high-quality and free of contaminants.", "One key vaccine safety surveillance program is the Vaccine Adverse Event Reporting System, or VAERS, which is an early warning system run by the Centers for Disease Control and Prevention and FDA. As its website explains, VAERS “is not designed to detect if a vaccine caused an adverse event, but it can identify unusual or unexpected patterns of reporting that might indicate possible safety problems requiring a closer look.”", "Anyone can submit a report to VAERS for any health problem that occurs after an immunization. There is no screening or vetting of the report and no attempt to determine if the vaccine was responsible for the problem. The information is still valuable because it’s a way of being quickly alerted to a potential safety issue with a vaccine, which can then be followed-up by government scientists.", "Another monitoring system is the CDC’s Vaccine Safety Datalink, which uses electronic health data from nine health care organizations in the U.S. to identify adverse events related to vaccination in near real time.", "In the case of the COVID-19 vaccines, randomized controlled trials involving tens of thousands of people, which were reviewed by multiple groups of experts, revealed no serious safety issues and showed that the benefits outweigh the risks.", "The CDC and FDA vaccine safety monitoring systems, which were expanded for the COVID-19 vaccines and also include a new smartphone-based reporting tool called v-safe, have subsequently identified only a few, very rare adverse events.", "For more, see “How safe are the vaccines?”", "Link to this", "The authorized or approved vaccines were initially tested in animals and early phase clinical trials, in which scientists evaluated different doses, checked for the expected immune responses and monitored for potential safety issues. To find out whether the shots prevent disease and are safe, the vaccines that passed the first set of tests were then evaluated in phase 3 trials.", "The Moderna and Novavax phase 3 trials each included about 30,000 volunteers, while the Pfizer/BioNTech and Johnson & Johnson trials included about 44,000 each. In each of these trials, half of the participants received a placebo, while the other half received the vaccine, and the volunteers were followed over time to see if they fell ill with COVID-19 and had any adverse reactions.", "The trials were overseen by independent data and safety monitoring boards, and the results were reviewed not only by the Food and Drug Administration, which made the decision to authorize the vaccines for emergency use, but also by an outside panel of experts advising the agency. Another independent group, the CDC’s Advisory Committee on Immunization Practices, also reviewed the data and recommended use of the vaccines.", "Following analysis of additional data from the phase 3 clinical trials, safety surveillance data and a review of the manufacturing process, including inspections of production facilities, the FDA granted full approval of the Pfizer/BioNTech vaccine on Aug. 23, 2021, and the Moderna vaccine on Jan. 31, 2022.", "Pediatric versions of the mRNA vaccines were authorized based on immune response data, which showed vaccinated kids had similar immune responses to vaccinated young adults, for whom a clinical trial previously demonstrated efficacy.", "Booster doses of the original vaccines were also authorized primarily based on data showing the additional shots increased levels of virus-specific antibodies.", "For omicron-updated vaccines, including the bivalent doses available in 2022-2023, and the monovalent doses for the 2023-2024 season, the FDA used an approach similar to how it approves flu vaccines each year, in which clinical studies are not required since the changes to the vaccine are minor.", "Link to this", "Dr. Simone Gold, who has a history of spreading dubious claims about the pandemic, used misinformation to sow doubt about COVID-19 vaccines in a live-streamed Jan. 3 address at a Pentecostal church in Florida.", "The video featuring Gold’s roughly hourlong speech has been viewed tens of thousands of times on YouTube and Facebook. A shorter clip focused on claims about race was shared by a Facebook page that frequently posts about racial issues and describes itself as representing a nongovernmental advocacy organization. The page administrators are based in Ghana and the United Kingdom.", "We’ll address the claims made in that clip.", "One is a repeat of a vague claim we’ve debunked before — the suggestion that the vaccines are unsafe. (For more on this, please see our SciCheck story “Viral Video Makes False and Unsupported Claims About Vaccines.”)", "Gold’s other false or misleading claims are aimed primarily at Black participation in the COVID-19 vaccination program. She misrepresents advice from public health experts who have advocated prioritizing vaccine distribution in the communities most severely impacted by the pandemic, which include Black, Latino and Native American people. (We’ll get to the statistics next.) And she says that Black people are being used as unwitting test subjects, a suggestion that exploits distrust of the medical establishment in the Black community.", "Referring to the vaccine as an “experimental biological agent,” Gold, who is white, says in the video: “They are making an overt and covert attempt to push this heavily on Blacks and browns.”", "First of all, there are two available vaccines in the U.S. and both went through clinical trials with tens of thousands of participants before the Food and Drug Administration granted them each an emergency use authorization in December. The trials were overseen by independent data and safety monitoring boards, and the results were reviewed by the FDA and an outside panel of experts. So, calling either one an “experimental biological agent” is misleading.", "In the video, Gold also tells her audience: “The reason I don’t think this is ever going to be shown to be a race problem is things you just know by common sense. One is: It’s been all over the world, all races, OK? We can just start with that. Second is: In areas of the world where people … have those individual risk factors, like diabetes or obesity and other illnesses, and the group risk factors, such as living and working in tight quarters, it’s not Black people who get it at a worse rate, it’s those people in those situations.”", "Public health experts have called for prioritizing certain members of minority communities in the rollout of the vaccines because those communities have suffered higher rates of infection and death during the pandemic.", "Gold, however, misrepresents the reason for that recommendation, insinuating that experts say Black people are naturally more susceptible to COVID-19. But what they actually say is that social and historical factors have led to disparate health impacts on Black and some minority communities, which has led to elevated rates of illness and death from COVID-19.", "For instance, data from the Centers for Disease Control and Prevention show that Black patients have the highest rates of both diabetes and obesity among racial groups, which, as Gold points out, increases the risk of severe illness from COVID-19.", "“In the United States and worldwide, the COVID-19 pandemic has shed light on the pervasive impacts of social and structural inequities in society,” a paper from the National Academy of Sciences making recommendations on the equitable distribution of the vaccines said. “COVID-19 is having a disproportionate impact on people who are already disadvantaged by virtue of their race and ethnicity, age, health status, residence, occupation, socioeconomic condition, and/or other contributing factors.”", "According to data compiled at the end of 2020 by the CDC, Black Americans had a COVID-19 illness rate 1.4 times higher than their white counterparts and a death rate 2.8 times higher.", "Similarly, a project of American Public Media that tracks the impact of the virus by race found that in 2020, Indigenous, Black and Latino residents were at least 2.7 times more likely to die of COVID-19 than white residents.", "“The data on COVID-19 cases and deaths across many states in the U.S. have clearly shown that across all individuals getting the virus, Black and Brown people are disproportionately affected by and dying from this virus,” Renã A.S. Robinson, an associate professor at Vanderbilt University whose research focuses, in part, on racial health disparities, told us in an email.", "“Biologically, the virus is looking for a host (e.g., a human body) to attack,” she said. “In the U.S., Black and Brown bodies have been disproportionately available for this virus to attack directly due to these communities having less access to equitable healthcare, high risk of exposure occupations, and increased burdens of chronic conditions — all directly related to historic systemic racism and ongoing discrimination and social injustices.”", "The plan for distribution of the vaccines, including which populations should be prioritized, was largely left up to the states, though. So, the specific priorities of each state differed.", "The CDC’s Advisory Committee on Immunization Practices, which issues guidance on vaccine distribution, noted that “some racial and ethnic minority groups” have been disproportionately affected by COVID-19. Those groups are heavily represented in “essential” jobs, which have elevated exposure to the virus, ACIP wrote in its Jan. 1 recommendation, explaining that those jobs include: “first responders (e.g., firefighters and police officers), corrections officers, food and agricultural workers, U.S. Postal Service workers, manufacturing workers, grocery store workers, public transit workers, and those who work in the education sector (teachers and support staff members) as well as child care workers.”", "ACIP did not recommend prioritizing the vaccine on the basis of race, but it did recommend prioritizing the vaccine for “essential workers.”", "In the video, Gold repeatedly cites a report that she describes as “the government’s words,” when she accuses the government of unfairly targeting Black people. But it’s not a government document. It’s a report from Johns Hopkins University’s Center for Health Security issued in August that sought to offer those tasked with making the distribution plan an ethical framework for distributing the COVID-19 vaccine.", "After noting that Black people and Native Americans were hospitalized for COVID-19 at a rate five times higher than white people, the report said, “As a matter of justice, these disparities in COVID-19 risk and adverse outcomes across racial and ethnic groups should be addressed in our overall COVID-19 response.” But, again, that was advice offered more than three months before the first vaccine was authorized for use. It wasn’t binding and it didn’t come from the government.", "Since the vaccines have become available, 16 states have publicly reported data on their usage by race and ethnicity, the Kaiser Family Foundation found. That data showed that “the share of vaccinations among Black people is smaller than their share of cases in all 16 reporting states and smaller than their share of deaths in 15 states,” according to KFF.", "Later, Gold insinuates that Black people are being used as unsuspecting test subjects. “If you take the vaccine, you’re signing up to be in a pharmacovigilance tracking system,” she says.", "It’s worth noting that a popular conspiracy theory had claimed the vaccines would include some kind of tracking device. They don’t.", "Gold says that the government’s plan for distribution was “targeting the Black community,” which she calls “pure racism.” She goes on to say, “It means you’ve enrolled yourself in a medical trial. … Most people are not aware that that’s what they’re doing. This pharmacovigilance tracking system tracks you for two years. It’s set up by the Department of Defense. It was handed off to Oracle and Google to put the data together.”", "Gold’s claims speak to entrenched fears and distrust in Black communities of medical institutions caused by experiments such as the Tuskegee study. Gold actually references this experiment in her speech, but fails to explain the difference between what happened then and what is happening now.", "In 1932, in Tuskegee, Alabama, the U.S. government lied to Black men, telling them they were going to receive treatment for “bad blood,” while they were actually being studied for the effects of untreated syphilis.", "Now, there are two tested and authorized vaccines available to the general public during a global pandemic.", "Susan Rice, who is in charge of White House domestic policy for President Joe Biden, addressed the issue when she was asked at a press briefing about how to overcome vaccine hesitancy in Black communities.", "She noted that Biden’s newly established COVID-19 task force is addressing health equity and said, “there are Americans, and particularly Americans of color, who for very valid historical reasons are skeptical and reluctant.”", "Rice said that the task force “is reaching out directly through targeted campaigns to get to those very communities where the skepticism is highest. And that’s vitally important because as communities of color are suffering disproportionately, may have less access to information about the vaccine, and the ability to easily go online, in some instances, and get an appointment. We have to take those additional steps to ensure that they are aware of its availability, they can get appointments and that they understand that the vaccine is safe.”", "It is also false that, as Gold claimed, by taking the vaccine “you’ve enrolled yourself in a medical trial.” Taking the vaccine after it’s been tested and authorized does not enroll a patient in a trial.", "The “tracking system” that Gold appears to reference is actually an online management system for vaccine distribution and monitoring. One element is v-safe, an online portal to report side effects to the CDC. As we’ve explained before, trial data from the two currently available vaccines show that many people experience pain at the site of injection, fatigue, joint or muscle pain, headache, chills or fever — which, according to the CDC, “are normal signs that your body is building protection.” Use of that portal is optional, not mandatory, Oracle spokeswoman Kris Reeves confirmed to us by email.", "CDC spokeswoman Kristen Nordlund also confirmed to us by email that participation is voluntary.", "Another element of the system acts as a “national clearing house” for the CDC’s anonymized vaccination data, which means that the information doesn’t include patients’ identifying information. That data “will be used for analysis and reporting by authorized agencies and organizations,” Oracle wrote in a press release explaining the system.", "Nothing in Oracle’s description of the system indicates that it would track individual patients.", "As we said at the start, Gold has a history of spreading dubious claims about COVID-19. She started an organization called America’s Frontline Doctors in the summer of 2020, although some of the most visible members of the group didn’t actually practice medicine on the front lines of the COVID-19 pandemic.", "Gold is a licensed doctor in California, although it’s unclear how much she practiced during the pandemic. Gold told us that she worked at two hospitals in 2020, one of which is about 500 miles away from her home in Los Angeles. She also received $154,633 in loans from the Paycheck Protection Program, part of the coronavirus relief package that passed in March 2020, according to a watchdog group tracking those loans, for businesses located at the address of her concierge medical business.", "Also, the church where Gold spoke is run by Rodney Howard-Browne, a pastor who has advanced COVID-19 conspiracy theories and was arrested in March 2020 for holding services in violation of public health laws aimed at curbing the spread of the coronavirus.", "In addition to conspiracy theories, Howard-Browne mixes politics into his religious messaging. He asserted, for example, that President Donald Trump should have remained in power despite having been voted out of office.", "And, three days after she spoke at the church, Gold was filmed in the U.S. Capitol’s Statuary Hall after a mob had overtaken the building in an effort to overturn the election results and keep Trump in power. Gold was arrested on Jan. 18 and charged with violent entry and disorderly conduct.", "Editor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over our editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.", "Hale Spencer, Saranac and Angelo Fichera. “In Viral Video, Doctor Falsely Touts Hydroxychloroquine as COVID-19 ‘Cure.’” FactCheck.org. 28 Jul 2020.", "McDonald, Jessica and Catalina Jaramillo. “Viral Video Makes False and Unsupported Claims About Vaccines.” FactCheck.org. 22 Jan 2021.", "McDonald, Jessica. “Q&A on COVID-19 Vaccines.” FactCheck.org. Updated 7 Jan 2021.", "Ball, Philip. “The lightning-fast quest for COVID vaccines — and what it means for other diseases.” Nature. 18 Dec 2020.", "The National Academies of Sciences. “Framework for Equitable Allocation of COVID-19 Vaccine.” 2020.", "Centers for Disease Control and Prevention. “COVID-19 Hospitalization and Death by Race/Ethnicity.” Updated 30 Nov 2020.", "Egbert, Andi and Kristine Liao. “THE COLOR OF CORONAVIRUS: 2020 YEAR IN REVIEW.” American Public Media. 21 Dec 2020.", "Robinson, Renã A.S. Associate professor, Vanderbilt University. Email responses. 28 Jan 2021.", "Cooper, Rebecca, Ariella Levisohn, Trish Riley and Jill Rosenthal. “With Federal Guidance Evolving and Vaccine Supplies Uncertain, States’ COVID-19 Vaccine Distribution Plans Remain Works in Progress.” National Academy for State Health Policy. 8 Dec 2020.", "Advisory Committee on Immunization Practices. Centers for Disease Control and Prevention. “COVID-19 ACIP Vaccine Recommendations.” Accessed 28 Jan 2021.", "Ndugga, Nambi, Olivia Pham, Latoya Hill, Samantha Artiga, and Salem Mengistu. “Early State Vaccination Data Raise Warning Flags for Racial Equity.” Kaiser Family Foundation. 21 Jan 2021.", "McCaughey, Betsy. “The lunatic drive for racial quotas for COVID-19 vaccines.” New York Post. 16 Jul 2020.", "Rice, Susan. Domestic Policy Advisor. Press briefing. 26 Jan 2021.", "Centers for Disease Control and Prevention. “V-safe After Vaccination Health Checker.” 27 Jan 2021.", "Reeves, Kris. Spokeswoman, Oracle. Email response. 29 Jan 2021.", "Basen, Ryan, Amanda D’Ambrosio, and Kristina Fiore. “Who are the physicians behind America’s Frontline Doctors?” MedPage Today. 29 Jul 2020.", "Marrero, Tony. “Preaching conspiracies: Coronavirus puts Tampa pastor’s beliefs into mainstream spotlight.” Tampa Bay Times. Updated 30 Apr 2020.", "U.S. v. John Herbert Strand, Simone Melissa Gold. Affidavit in Support of Criminal Complaint and Arrest Warrant. U.S. District Court for the District of Columbia. 13 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]