["About this rating", "On 10 December 2018, Canadian blogger Spencer Fernando reported that Canadian Prime Minister Justin Trudeau had turned the country's border security over to the international United Nations organization:", "The Trudeau government has betrayed the Canadian People by signing the UN Global Compact on Migration, dealing a severe blow to Canada’s sovereignty.", "The Compact will be used by the Trudeau government to crackdown on the press (at least the ones he isn’t bailing out), by trying to silence any speech that is critical of ‘migration.’", "Additionally, the Compact begins a transfer of authority from national governments, to the centralized authority of the United Nations, turning migration (AKA control of national borders), into something dominated by supranational institutions.", "It’s a clear step by the global elites and the Trudeau government to wipe out Canada’s borders, and push our nation further in the direction of being a ‘post-national state,’ where Citizenship, borders, and democracy are stripped of all meaning.", "The Trudeau-led Canadian government did sign on to the U.N. Global Compact for Migration on 10 December 2018, along with more than 160 other countries.  But that agreement doesn't usurp the control of national borders and hand it over to the U.N. The agreement states the opposite and makes several references to respecting sovereignty and each nation's control of their own international boundaries. Item 7 of the preamble, for example, states:", "This Global Compact presents a non-legally binding, cooperative framework that builds on the commitments agreed upon by Member States in the New York Declaration for Refugees and Migrants. It fosters international cooperation among all relevant actors on migration, acknowledging that no State can address migration alone, and upholds the sovereignty of States and their obligations under international law.", "And under the \"Unity of Purpose\" section, the agreement again affirms sovereignty of each state:", "National sovereignty: The Global Compact reaffirms the sovereign right of States to determine their national migration policy and their prerogative to govern migration within their jurisdiction, in conformity with international law. Within their sovereign jurisdiction, States may distinguish between regular and irregular migration status, including as they determine their legislative and policy measures for the implementation of the Global Compact, taking into account different national realities, policies, priorities and requirements for entry, residence and work, in accordance with international law.", "Global News similarly noted of the agreement that:", "[T]he pact sets out a “non-legally binding, cooperative framework,” meaning it’s more of a declaration rather than a legally binding treaty.", "Indeed, the pact’s preamble states explicitly that it “reaffirms the sovereign right of states to determine their national migration policy,” meaning governments will not sign away their rights to design their migration policies by signing onto the pact — contrary to [Conservative leader Andrew] Scheer’s criticisms.", "Indeed, Scheer’s characterization of the pact’s legal authority was dismissed as “factually incorrect” by a former Conservative immigration minister.", "Chris Alexander, who served as immigration minister under Stephen Harper, tweeted that the pact “is a political declaration, not a legally binding treaty.”", "The popularity of the blog post was likely the result of its similarities to the popular conspiracy theory that the United Nations is both trying to undermine the sovereignty of nation states and that it is a driving force behind global migration.", "As RationalWiki points out, conspiracy theories about the New World Order, a vague idea that a nefarious secret cabal is plotting to undermine the United States, often incorporate claims about the U.N. erasing national borders:", "Current conspiracy theories about the UN usually portray it as the heart of an alleged \"New World Order\" (NWO), or at least implicate it as a major player in said Order. The UN effectively acts as a Rorschach test for political cranks to project their paranoia onto. Some more recent conspiratorial notions include:", "The first-ever migration pact was signed by the majority of U.N. member states after 18 months of discussion and negotiation, despite \"vociferous\" objection by the United States under the Trump administration.", "United Nations.   \"Global Compact for Migration.\"\r\n    11 July 2018.", "Canada Immigration Newsletter.   \"Canada, More Than 160 Other Countries Adopt UN Migration Pact.\"\r\n    10 December 2018.", "RationalWiki.   \"United Nations.\"\r\n    Accessed 13 December 2018.", "McVeigh, Karen.   \"UN States Agree Historic Global Deal to Manage Migration Crisis.\"\r\n    The Guardian.   10 December 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]