["The 2005 study wasn’t published by the NIH and didn’t prove chloroquine was effective against “COVID-1” because that’s not a real disease.", "The study found that chloroquine could inhibit the spread of Severe Acute Respiratory Syndrome in animal cell culture, and the authors said more research was needed.", "There are currently no approved medications or treatments for COVID-19.", "Chloroquine is back.", "The anti-malarial drug first showed up as a possible COVID-19 treatment around May 2020, when President Donald Trump said he had been taking its chemical cousin, hydroxychloroquine, to prevent getting infected with the virus.", "Since then, some studies have found that the drugs could help alleviate symptoms associated with COVID-19, but the research is not conclusive. There are currently no FDA-approved medicines specifically for COVID-19. (Chloroquine is chemically similar to hydroxychloroquine, but it is a different drug that’s primarily used to treat malaria. Both carry a particular risk for people with heart problems, plus other possible side effects.)", "Now, hydroxychloroquine and chloroquine have been thrust back into the spotlight as misinformation about the drugs’ effectiveness and safety recently reappeared online.", "RELATED: Don’t fall for this video: Hydroxychloroquine is not a COVID-19 cure", "One such post on Facebook falsely claims that Americans have been deceived because health officials at the National Institutes of Health have known all along that chloroquine is effective against \"COVID.\"", "The post reads:", "\"N.I.H. 15 years ago published a study on chloroquine. It is effective against COVID-(1). We are being lied to America!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is flawed.", "First, there’s no such thing as \"COVID-1.\" COVID-19 was named for the year it was discovered, not because it’s the 19th iteration.", "Second, the 2005 study found that chloroquine was effective on primate cells infected with severe acute respiratory syndrome, known as SARS, which is caused by a coronavirus. But while the two share similarities, SARS-CoV and COVID-19 are different diseases, and primate cells are far from human patients.", "Third, the study was indexed by the NIH’s National Library of Medicine, but the NIH was not involved. It was published in the peer-reviewed Virology Journal and conducted by researchers from the Centers for Disease Control and Prevention and the Montreal Clinical Research Institute.", "RELATED: Hydroxychloroquine and coronavirus: what you need to know", "The study was published in August 2005 and found that chloroquine has \"strong antiviral effects on SARS-CoV infection of primate cells\" and that it was effective on cells treated with the drug before and after exposure to the virus.", "The drug was not administered to actual SARS patients, and the study’s authors wrote that more research was needed on how the drug interacts with SARS in animal test subjects.", "\"Cell culture testing of an antiviral drug against the virus is only the first step, of many steps, necessary to develop an antiviral drug,\" Kate Fowlie, a spokesperson for the CDC previously told PolitiFact in an email. \"It is important to realize that most antivirals that pass this cell culture test hurdle fail at later steps in the development process.\"", "Dr. Alex Greninger, assistant director of clinical virology at the University of Washington School of Medicine, told us that a problem in virology is trying to determine the difference of how drugs work in cell culture in comparison to humans.", "\"Data on chloroquine is largely taken from these cell culture studies, but we now have trials in people on hydroxychloroquine that show it’s not as effective,\" Greninger said, \"and there’s new data out in the last week that suggests that some of the reasons could be because of the cell types that SARS coronaviruses grow in, and this original experiment was done on African green monkey kidney cells, which is not the tissue we are really worried about.\"", "The Food and Drug Administration granted emergency use authorizations for some medicines to be used for certain patients hospitalized with COVID-19, but it revoked the authorization for hydroxychloroquine and chloroquine in mid-June due to concerns over the drugs’ serious side effects. There are currently no FDA-approved medicines for COVID-19.", "\"It is no longer reasonable to believe that oral formulations of HCQ and CQ may be effective in treating COVID-19, nor is it reasonable to believe that the known and potential benefits of these products outweigh their known and potential risks,\" FDA Chief Scientist Denise M. Hinton wrote.", "The NIH’s COVID-19 treatment guidelines, which were developed to inform clinicians on how to care for patients with COVID-19, also currently recommend against the use of chloroquine or hydroxychloroquine for COVID-19 treatment, except in a clinical trial.", "But even those trials have been halted. The World Health Organization and the NIH announced in mid-June that they would stop hydroxychloroquine patient trials, citing safety concerns that include serious heart rhythm problems, blood and lymph system disorders, kidney injuries, and liver problems and failure.", "A Facebook post says that the NIH published a study 15 years ago that showed chloroquine was effective against \"COVID-(1)\" and that health officials have been lying to the American people.", "This is wrong. There’s no such thing as \"COVID-1\" and the study cited was not published by the NIH and had to do with animal cells infected with SARS, not COVID-19. The drug was not given to human patients and the study’s authors said more research was needed.", "Health officials caution against the use of chloroquine or hydroxychloroquine to treat COVID-19 patients, citing the possibility of serious side effects. There are currently no approved treatments for the virus.", "We rate this False.", "Facebook post, July 27, 2020", "National Library of Medicine, Chloroquine is a potent inhibitor of SARS coronavirus infection and spread, Aug. 22, 2005", "PolitiFact, Hydroxychloroquine and coronavirus: what you need to know, April 8, 2020", "PolitiFact, Hydroxychloroquine is not proven to treat COVID-19 or radiation sickness, May 19, 2020", "PolitiFact, Don’t fall for conspiracy about Dr. Anthony Fauci, hydroxychloroquine, May 6, 2020", "Food and Drug Administration, FDA cautions against use of hydroxychloroquine or chloroquine for COVID-19 outside of the hospital setting or a clinical trial due to risk of heart rhythm problems, Updated July 1, 2020", "Food and Drug Administration, Letter revoking EUA for chloroquine phosphate and hydroxychloroquine sulfate, June 15, 2020", "National Institutes of Health, Chloroquine or Hydroxychloroquine, Updated June 16, 2020", "Nature, Chloroquine does not inhibit infection of human lung cells with SARS-CoV-2, July 22, 2020", "Email interview, National Institutes of Health spokesperson, July 28, 2020", "Phone interview, Dr. Alex Greninger assistant director of the University of Washington’s Clinical Virology Division, July 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]