["About this rating", "The morning after the Golden State Warriors basketball team defeated the Cleveland Cavaliers in the 2017 NBA Finals, the news was filled with reports about how the newly-crowned NBA champions had unanimously voted to skip the traditional congratulatory trip to the White House. Although this rumor was picked up by a diverse range of outlets, ranging from NBC to Uproxx to Vibe to Raw Story, these reports were all based on a single source: a tweet from CNBC finance reporter Josh Brown:", "NBA champion Warriors skipping the White House visit, as a unanimous team decision per reports.", "— Downtown Josh Brown (@ReformedBroker) June 13, 2017", "Brown did not cite a source for the information, nor did he quote or link to any first-hand accounts of the team's plans.", "Several Warriors members have talked about their dislike for the current administration, but that talk came before the team won the 2017 NBA championship. Head coach Steve Kerr, for instance, said that Donald Trump was \"ill-suited to be President\" in November 2016, while point guard Steph Curry slyly called the president an ass (saying, \"I agree with that description ... if you remove the 'et' from asset.\") Power forward David West was less coy regarding his opinion of President Trump and the president's supporters:", "“The things that he said, the things that he represented, that’s the way that the majority of this nation feels,” West said. “I think he just emboldened them because he’s able to say it publically. He got the platform.\"", "“It is kind of unnerving and unsettling ... The man’s 70 years old, so he is who he is. It’s just a shame that, throughout the process, a lot of these people were in hiding and waited for the cover of the ballot to represent who they are.”", "So although it's true that several members of the Golden State Warriors have openly expressed their dislike for President Trump, reports that the team has unanimously voted to skip the traditional visit to the White House is based on of a single unconfirmed tweet.", "USA Today NBA reporter Jeff Zillgitt tweeted that the Golden State Warriors had neither received nor turned down an invitation from the White House:", "Per multiple NBA sources, reports right now on Warriors not going to White House are untrue; team hasn't received invitation or discussed.", "— Jeff Zillgitt (@JeffZillgitt) June 13, 2017", "The Golden State Warriors released a statement confirming that the reports claiming that the team had rejected the White House's invitation were premature:", "\"Today is about celebrating our championship. We have not received an invitation to the White House, but will make those decisions, when and if necessary,\" the team said in a statement.", "Axson, Scooby.   \"Warriors Say Decision Has Not Been Made About White House Visit.\"\r\n    Sports Illustrated.   13 June 2017.", "Letourneau, Connor.   \"Warriors’ David West Calls Election of Donald Trump ‘Unsettling.\"\r\n    SFGate.   9 November 2016.", "Wolf, Byron.   \"It'd Be Shocking If the Warriors Went to the White House.\"\r\n    CNN.   13 June 2017.", "Feldman, Dan.   \"Rumor: Warriors Unanimously Vote Not to Visit Donald Trump’s White House.\"\r\n    NBC Sports.   13 June 2017.", "Gettys, Travis.   \"Golden State Warriors Refuse to Visit White House After Winning NBA Title: Reports.\"\r\n    Raw Story.   13 June 2017.", "Update 13 June 2017: The status of this article was changed from Unproven to False after the Golden State Warriors released a statement denying the report.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]