["About this rating", "On 4 February 2016 the fake news website Now8News published an article titled \"Police Find Satanic Ritual Dungeon In Chicago Chuck E. Cheese Basement,\" and a virtually identical version of the piece was published by the lesser-known fake news site TMZWorldNew:", "Authorities have identified the skeletal remains found in a Chicago Chuck E. Cheese basement as those of four teenagers that disappeared between 2013–2015. Multiple media outlets report that the teenagers were local residents of the city. Charged in their deaths is the owner, 68-year-old Melvin Wallace. There is another woman being charged as an accessory to the murders.", "Court documents allege that Wallace regularly performed “Satanic rituals” and “animal sacrifices” in the Chuck E. Cheese basement where the bodies were found. The basement dungeon, where the bodies were discovered, was full of mold, garbage, debris, animal feces as several satanic markings ... Police say the children were more than likely abducted from the “family fun center.” Parents, who regularly take their children to the Chicago Chuck E. Cheese say they are shocked at the findings.", "The claim's republication to TMZWorldNews ensured many readers remained unaware it originated with well-known hoax purveyor Now8News. The base image of a Chuck E. Cheese location was swiped from a 2013 article about a fight at one of the family entertainment restaurants, and the attached photograph of an individual was taken from a website collection of sex offender mug shots and depicted an individual arrested in 2000.", "Neither Now8News nor TMZWorldNews carried a disclaimer warning readers their content was fabricated.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]