["About this rating", "In March 2016, photos showing a bottle of Coca-Cola with the words \"share a Coke with the KKK\" written on its label started circulating online:", "This is not a real product sold by Coca-Cola. While the \"Share a Coke\" campaign allows Coca-Cola drinkers to personalize their cans, some words or phrases (such as \"KKK\") are not available:", "The image showing the \"KKK\" bottle was created for an online petition on the web site Color Of Change, asking the company to pull its sponsorship of the Republican National Convention due to Donald Trump's failure to condemn the KKK in an interview:", "Even with Trump refusing to disavow the support of the Ku Klux Klan this weekend and declaring “All Lives Matter” at a rally, Coca-Cola and other companies still have not canceled their sponsorship of the RNC. How can Coca-Cola, a company that heavily markets to and profits from Black people, fund a platform for a presidential nominee that is being bolstered into office by former Grand Wizard David Duke, the KKK, and other white supremacists?", "The petition presupposes both that Coca-Cola will be sponsoring the 2016 Republican National Convention, and that Coca-Cola would be effectively endorsing the Ku Klux Klan by sponsoring the RNC.  On 23 February 2016, representatives from the advocacy groups ColorofChange, America’s Voice, CREDO Action, Million Hoodies, MoveOn, and Presente.org admitted as much in an open letter to Coca-Cola and other alleged sponsors of the 2016 RNC:", "Based on your corporate sponsorship of the 2012 Republican National Convention we have reason to believe that your company is planning to again sponsor the RNC this year. We believe it is a sign of strong corporate leadership for you and your company to refrain from sponsoring Donald Trump’s hateful and divisive rhetoric.", "While Coca-Cola did sponsor the Republican National Convention in 2012, the company also sponsored the Democratic National Convention that year:", "Many of the sponsors of the Democratic convention were also sponsors of the host committee in Tampa for last week's Republican National Convention.", "\"The Coca-Cola Company believes we have a role to play in the political process and that includes helping to make the political conventions a success,\" said Coca-Cola spokeswoman Nancy Bailey.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]