["About this rating", "Islamophobic hysteria broke out on the Internet in July 2016 when anti-Muslim bloggers took notice of news photos detailing a recent security upgrade to the White House fence:", "The security upgrade, which consisted of mounting removable iron spikes atop the existing 6-foot-tall wrought-iron fence, was undertaken in July 2015 by the Secret Service and National Park Service in response to repeated attempts by intruders — some successful — to scale the enclosure:", "It was in reaction to reports such as the above that unreliable web sites like Fury.news began raising the alarm. \"An historical property has been tarnished by a muslim [sic] POTUS,\" opined an article on the site. \"Will the next president find out about this and make changes immediately? Or will this lslamic fence become part of history?\"", "It offered this as proof of Obama's dastardly deed:", "Do you see the design in the fence? It is quite unsettling once you realize what you are looking at. The middle part of that fence looks eerily similar to an lslamic mosque dome. Check out these images for comparison.", "Notice in the fence design the ‘building’ on top with the corner spikes. Exactly like a mosque’s architecture found all over the world. Below it you will see the shape of a dome. If you google image mosque domes, you will find many dome shapes, and the one on the fence is one you will find.", "Someone on the Conservative Tree House web site contributed a supposedly knowledgeable description of the imagery:", "These are traditional Islamic designs. The \"castle like\" item on top of the \"onion dome\" item is an evocation of Mecca, the Dome of the Rock, and the buildings surrounding it. The \"onion dome\" is a traditional Islamic design, seen in mosques, window designs for the Harem, Islamic architecture still exist in Spain. Make no mistake this is just another way to declare Islam.", "What these alarmists failed to notice, however (or they did, but just didn't care), is that the renovation consisted only of adding the removable spikes, nothing else. What they further failed to notice is that most of the photos they used to try to make their case had actually been taken before the changes were made. The \"Islamic\" elements of the design they were concerned about had been in place for at least 100 years. They're visible, for example, in this photo of the National Women's Party picketing the North Portico of the White House in 1917:", "And even more clearly visible in this blow-up:", "So, did our \"Muslim president\" Barack Obama really change the White House fence to incorporate Islamic symbols? No, he did not — although someone very clearly wants you to believe he did.", "Saentz, Arlette.     \"Metal Spikes Installed on White House Fence in Latest Security Renovation.\"\r\n    ABC News.   1 July 2015.", "CBS News.   \"Man Apprehended After Jumping White House Fence.\"\r\n    23 October 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]