["About this rating", "On Aug. 4, 2020, an explosion in the Lebanon city of Beirut left more than 130 people dead, thousands more injured, and many of the surrounding buildings in rubble. As videos of the blast started to make their way around social media, some people started sharing doctored footage that supposedly showed a missile caused this catastrophic event.", "Here's a screenshot from one such video:", "This is not a screenshot from a genuine video of the explosion in Beirut. The screenshot comes from a manipulated video containing a digitally inserted missile. The original video, which can be seen below, does not show a missile:", "After the explosion, U.S. President Donald Trump added confusion to the situation when he referred to the incident as an \"attack.\"", "The explosion in Beirut was not caused by a missile, and there's no indication, as of this writing, that this was any kind of attack.", "The explosion seen in this video shows the detonation of 2,750 tons of ammonium nitrate, a highly volatile explosive material, that had been stored at the Port of Beirut since the arrival of a Russian-owned cargo ship in 2013. For comparison's sake, approximately 2 tons of ammonium nitrate were used in the Oklahoma City bombing in 1995.", "It's not exactly clear what caused this large cache of volatile explosive material to ignite. Videos of the event show a large fire at a warehouse shortly before the blast. The sound of fireworks is also notable in videos.", "Jeffrey Lewis, a missile expert at the Middlebury Institute of International Studies in Monterey, California, told the Associated Press:", "\"It looks like an accident ... First, there was a fire preceding the explosion, which is not an attack. And some of the videos show munitions what I could call popcorning, exploding like ’pop, pop, pop, pop.’\"", "He added that \"it’s very common to see fires detonate explosives.\"", "\"If you have a fire raging next to something explosive, and you don’t put it out, it blows up,\" he said.", "An investigation into the incident is ongoing. The Associated Press reported that investigators will focus on why this large cache of ammonium nitrate was allowed to sit in the Port of Beirut for several years, as well as any possible negligence that led to the unsafe storage of this material.", "Public anger mounted against the ruling elite that is being blamed for the chronic mismanagement and carelessness that led to the disaster. The Port of Beirut and customs office is notorious for being one of the most corrupt and lucrative institutions in Lebanon where various factions and politicians, including Hezbollah, hold sway.", "The investigation is focusing on how 2,750 tons of ammonium nitrate, a highly explosive chemical used in fertilizers, came to be stored at the facility for six years, and why nothing was done about it.", "Associated Press.   \"Fireworks, Ammonium Nitrate Likely Fueled Beirut Explosion.\"     5 August 2020.", "Mroue, Bassem; Karam, Zeina; El Deeb, Sarah.   \"Negligence Probed in Deadly Beirut Blast Amid Public Anger.\"\r\n    Associated Press,/Em>.   5 August 2020.", "AFP.   \"Substance That Reportedly Sparked Beirut Explosions Was Used in the 1995 Oklahoma City Bombing.\"\r\n    6 August 2020.", "New York Times.   \"Anger Rises After Beirut Blast and Evidence Officials Knew of Risks.\"\r\n    6 August 2020.", "Ilyushina, Mary; Polglase, Katie; Younes, Ali.   \"A Russian Ship's Cargo of Dangerous Ammonium Nitrate Was Stranded in Beirut Port For Years.\"\r\n    CNN.   6 August 2020.", "Shields, Bevan.  \"How a 'Floating Bomb' Cargo Ship Lit The Fuse on Beirut's Devastating Explosion.\"\r\n    Sydney Morning Herald.   6 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]