["By Saranac Hale Spencer", "Posted on January 24, 2018", "Q: Did President Donald Trump order the removal of Barack Obama’s name from a Florida highway?", "A: No. That rumor comes from a false headline attached to a 2015 opinion piece critical of the name change.", "Do you know if this is true? The comments suggest it isn’t.", "“Trump Orders to Remove Obama Highway Name and Get Back The Previous Name of `Old Dixie’ Highway”", "A two-mile stretch of the Old Dixie Highway that goes through the city of Riviera Beach, Florida, was renamed President Barack Obama Highway in 2015.", "It is still named President Barack Obama Highway.", "The Riviera Beach City Council had a lengthy discussion about making the change in 2015, according to the official meeting record, and it has not entertained the idea of reversing that decision.", "But, several dubious websites have posted a story with a headline claiming that President Donald Trump has ordered that the original name be restored.", "Facebook users flagged the story as potentially false, and readers have asked us about it.", "The headline is false, but the story itself appears to be the latest version of an opinion piece that has been rejiggered a few times since it first appeared in December 2015, shortly after the change to the highway’s name made news.", "The story first showed up on a website called US Herald, which describes itself as a “real conservative news” outlet, on Dec. 26, 2015. The story lamented the new name and had a headline that said: “Southerners Are OUTRAGED After ‘Old Dixie’ Highway’s Name Changed to BARACK OBAMA!”", "Nearly two years later, the story was recast with an almost identical headline — “Southerners Are OUTRAGED After ‘Old Dixie’ Highway’s Name is Changed to BARACK OBAMA! WHAT DO YOU THINK?” The story remained similar to the original, but got a sharper edge and an updated reference to the recent debate over removing Confederate monuments.", "Now, a website called Journal United has posted a barely modified version of that story with a headline that says: “Trump Orders to Remove Obama Highway Name and Put This New Highway Name? Do you support him?”", "The site has made an effort to look like a credible news source and includes a copyright logo at the bottom of the page, but there is no record of a registration with the U.S. Copyright Office.", "While most of the story is opinion, the newest headline is false.", "The Federal Highway Administration explains that the federal government doesn’t name routes. “Although the Federal Government provided funds to help build the Interstate System, States own and operate the roads. As a result, the Federal Highway Administration (FHWA) does not have the authority to name the routes,” the FHWA says on its website.", "“We have heard the rumors” said Debie Isaacs, chief of staff for the mayor of Riviera Beach. But, she told us, the city has received no directive from the federal government on the issue.", "“The signs are still up and they will remain up,” Isaacs said of the street signs designating the road as President Barack Obama Highway.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Marshall, Barbara. “We take a look back at the road that created Florida.” Palm Beach Post. 13 Jan 2016.", "Izadi, Elahe. “Old Dixie Highway renamed President Barack Obama Highway in Florida city.” Washington Post. 19 Dec 2015.", "“Regular city council meeting minutes.” (See page 97). City of Riviera Beach. 19 Aug 2015.", "“Southerners Are OUTRAGED After ‘Old Dixie’ Highway’s Name Changed to BARACK OBAMA!” USHerald.com. 26 Dec 2015.", "“US Confederate monuments: What is the debate about?” Al Jazeera. 24 Aug 2017.", "“Trump Orders to Remove Obama Highway Name and Put This New Highway Name? Do you support him?” JournalUnited.com. 3 Jan 2018.", "“BREAKING!! HE JUST MOVED IN NEAR MAR A LAGO!!” FreedomDaily.com. 3 Jan 2018.", "Isaacs, Debie, chief of staff for the mayor of Riviera Beach. Interview with FactCheck.org. 24 Jan 2018.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]