["The claim was published on Facebook here May 17, 2020.", "The post reads:\n\t“Here are the survival rates of COVID-19:\n\t\"United States 99.983%\n\t\"Spain 99.956%\n\t\"Belgium 99.944%\n\t\"Italy 99.957%\n\t\"France 99.965%\n\t\"United Kingdom 99.972%\n\t\"Russia 99.975%", "\"Maybe if we look at it this way, we’d realize the panic is out of control.”", "A similar claim also appeared on Facebook here and here. On Twitter, the claim received over 5,000 retweets here, and was published here, here, here, here, and here.", "The claim, however, is misleading.", "Nilanjan Chatterjee, a biostatistics professor at the Johns Hopkins Bloomberg School of Public Health, said it is “misleading to quote the survival rates for a number of reasons.”", "“First, what is survival rate? Is it the rate of death among individuals who have known COVID-19 diagnosis? If that is the case, which is also referred to as case fatality, I don't know what the source is of these numbers,” Chatterjee told AFP via email on May 28, 2020.", "Chatterjee noted that in New York City, for instance, government figures list roughly 20,000 deaths among 200,000 cases, as of May 28, 2020. “This corresponds to a fatality rate of about 10% or survival rate of 90%,” he said.", "Chatterjee added: “Now the actual case fatality rate is likely to be much lower as there are many more asymptomatic cases, but the estimates of case fatality rates I have seen is never as low as 0.1% as your survival rate of 99.9% will suggest.”", "Theo Vos, a professor at the Institute for Health Metrics and Evaluation at the University of Washington, said the claim in the misleading posts “is obviously absurd.”", "“A survival rate is measured with cases of disease in the denominator, not total population. If you would do this for e.g. cancer you would also get fantastic looking survival,” he told AFP via email on May 22, 2020", "Factors affecting 'survival rates'", "While people of all ages can be infected with COVID-19, the World Health Organization (WHO) notes that the elderly and people with pre-existing conditions, such as asthma, diabetes and heart disease, appear to be more susceptible to the virus.", "This vulnerability, experts say, leads to survival rates to differ between demographics.", "“We know that survival has a strong relationship with age and sex,” Vos said.", "“In young children survival rate is in the order of 99.999% ...but this drops to closer to 96-97% in the elderly, a bit lower still in elderly males; and yet again lower in the presence of comorbidities like diabetes.”", "Case fatality rates", "As of May 2020, the fatality rate of COVID-19 also remains unclear, experts say. “Between countries, case Fatality rates vary significantly, and over time, which suggests considerable uncertainty over the exact case fatality rates,” the Centre for Evidence-Based Medicine (CEBM) at the University of Oxford notes here.", "The variability, CEBM says, is largely due to varying testing capacities worldwide and differences in how COVID-19 related deaths are recorded, among other contributing factors.", "“I think to estimate the true case fatality rate, one needs to have a good sense of [the] number of infected people first,” Chatterjee added.", "“While a number of studies have indicated that the number of asymptomatic individuals is very large, and as a consequence the case fatality rate is likely to be lower than it seems, there is still a lot of uncertainty in these estimates.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]