["The photo was published in this Facebook post on November 18, 2019. It has been shared more than 15,000 times.", "The post's Urdu-language caption translates to English as: “Nasir Chinyoti, the man who brings smiles to people's faces is fighting a battle for life. He is severely burnt in a car accident. Please pray for him. Share the post as someone prayers might work.\"", "Nasir Chinyoti is a Pakistani comedian.", "The post includes two photos; one shows Chinyoti, the other shows a man lying on a hospital bed with burns on his face and body.", "Below is a screenshot of the misleading Facebook post:", "The photos were shared thousands of times on Facebook here, here and here alongside a similar claim.", "The claim is false; the photos do not show the same person. The photo of the injured man has circulated in Malaysian media reports since 2018 about a man who was attacked in Malaysia. It has also circulated in misleading posts in Hong Kong, as debunked here by AFP Hong Kong.", "A reverse image search on Google found this article published in Kwong Wah Yit Poh, a Malaysia-based Chinese language newspaper, on September 10, 2018.", "Below is a screenshot of the article that features the photo:", "The article’s simplified Chinese-language headline translates to English as: “Stranger breaks into car, man attacked on the face and fire burnt”.", "The photo caption reads: “The injured was attacked by a male stranger, and then set on fire on the face, and now in the hospital for treatment.”", "The article adds that the incident happened on September 9, 2018 in Jejawi, a town in the Malaysian state of Perlis. The man was reportedly attacked with a flammable liquid and a lighter while in his car.", "Malaysian newspaper Berita Harian also reported on the incident and published the same photo of the injured man here.", "Below is a screenshot of the article and the photo:", "Separately, Chinyoti has refuted the claim in the misleading post, clarifying that he was not injured in a car crash. He posted this video on his Instagram page.", "Regarding the fake news about my accident.", "A post shared by  Nasir Chinyoti (@therealnasirchinyoti) on Nov 18, 2019 at 6:31am PST", "Chinyoti's comments in Punjabi translate to English as: “It's very bad thing to run such news on social media. It is not a good thing to trouble someone, their family. It is a very bad thing, one should always refrain from such things which can ache anyone's heart or make him worry.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]