["About this rating", "In mid-June 2018, a photograph purportedly showing an octopus that had fallen from the sky after a strong storm in Qingdao, China, started making its way around the social networking site Weibo:", "This image soon found its way into articles published by Western news outlets such as the New York Post, Maxim, and the Daily Mail, who proclaimed it to be real:", "These images show the extraordinary moment an octopus and starfish fell from the sky after being sucked up by a powerful storm.", "The sea tornado fizzled out before making landfall on the coastal city of Qingdao, China, but the marine creatures which had been whirling around in the storm cloud were suddenly spat out.", "Qingdao did experience strong winds on 13 June 2018, and multiple social media users did post photographs which they asserted showed random pieces of sea creatures (such as shrimp and starfish) landing on the windshields of their cars:", "The photograph of the falling octopus, however, was a hoax.", "The image was created by editing a stock image of an octopus silhouette onto a photographic rainy background scene. Here's a comparison of the \"octopus\" that fell from the sky in China (left) and the stock image:", "This image doesn't show an octopus falling from the sky in China, but the underlying rumor isn't completely far-fetched. Hurricanes and tornadoes are certainly strong enough to displace small animals, and occasional reports throughout the years have noted the \"raining\" of animals such as tadpoles or spiders.", "Although such stories may sound a bit biblical, they're usually backed with logical, non-mysterious explanations.  In this case, for instance, less sensational news reports suggested that \"the images may have been the result of seafood being blown from stalls at a nearby market into the road.\"", "Knox, Patrick.   \"Sea Creatures Fall from Sky During Insane Storm.\"\r\n    The New York Post.   15 June 2018.", "Nobel, Justin.   \"The Surprising Science of Animal Rain.\"\r\n    The Modern Farmer.   17 March 2014.", "Linder, Alex.   \"Severe Storm Causes Sea Creatures to Rain Down from the Sky on Qingdao Motorists.\"\r\n    The Shanhaist.   17 June 2018.", "Barnes, Todd.   \"Sea Creatures and Giant Hailstones Rain Down on Chinese City During Storm.\"\r\n    The Independent.   17 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]