["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Facebook post wrongly attributes this quote to Hillary Clinton.", "Plenty of people have worried that the world’s growing population will over-tax the earth’s resources, but Hillary Clinton didn't advocate for reducing the number of humans here ASAP. A Facebook post that published on Feb. 14 would have you think otherwise.", "\"This planet might be able to support perhaps as many as half of a billion people who could live a sustainable life in relative comfort,\" reads the text over a picture of Clinton. \"Human populations must be greatly diminished, and as quickly as possible to limit further environmental damage.\"", "This post, which attributes the quote to \"U.S. Secretary of State Hillary Clinton,\" was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We couldn’t find a credible source corroborating that Clinton said this.", "Other websites such as Alex Jones's Infowars and AZ Quotes, among other sources, have reported on a similar quote. But even those websites identified someone else, not Clinton, as the speaker. (And they still didn't get it right.)", "The quote has previously been attributed to Eric Pianka, an evolutionary ecologist who holds the Denton A. Cooley Centennial Professor of Zoology post at the University of Texas at Austin.", "In a June 24, 2011, post about Al Gore and population control, Infowars describes Pianka as a \"very prominent advocate of radical human population control\" and credits Pianka as its source for the quote.", "Pianka's essay, \"What nobody wants to hear, but everyone needs to know,\" speculates that Earth is poised for another population crash a la the Bubonic plague in the 1330s.", "But his essay doesn’t include the statement Infowars and others claim he said.", "Clinton, meanwhile, has addressed population growth before. On Feb. 9, 1999, when she was the first lady, she gave a speech about Cairo at The Hague. Among other things, she discussed reproductive health care and family planning.", "\"The world agreed — for the first time — that smaller families and slower population growth are created by choice and opportunity, not control and coercion,\" she said.", "More recently, Bindi Irwin, the daughter of crocodile hunter Steve Irwin, criticized a State Department e-journal in 2013 for revising an essay she wrote and omitting Irwin’s opinion that the growing population poses the greatest risk to conservation.", "As for the made-up quote in the Facebook post, we rate it Pants on Fire.", "Facebook post, Feb. 24, 2019", "National Geographic, \"As world’s population booms, will its resources be enough for us?\" Sept. 21, 2014", "Forbes, \"How big of a problem is overpopulation?\" July 30, 2018", "The Guardian, \"Why current population growth is costing us the earth,\" Oct. 11, 2011", "United Nations, Address by Hillary Rodham Clinton to the Cairo Plus Five Forum, Feb. 9, 1999", "University of Texas, \"What nobody wants to hear, but everyone needs to know,\" Eric Pianka, visited Feb. 21, 2019", "University of Texas at Austin, Eric Pianka directory page, visited Feb. 21, 2019", "AZ Quotes, Eric Pianka quote, visited Feb. 21, 2019", "Infowars, \"Al Gore, Agenda 21 and population control,\" June 24, 2011", "CBS DC, \"Crocodile Hunter’s daughter ‘saddened’ by Clinton office revisions to essay,\" Jan. 24, 2013", "Yahoo, \"Bindi Irwin expresses frustration over Clinton org’s essay editing,\" Jan. 25, 2013", "Daily Mail, \"Teenage daughter of crocodile hunter Steve Irwin in bizarre spat with Hillary Clinton - over her essay about world’s population,\" Jan. 24, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]