["Senate candidate Rep. Kevin Cramer, R-N.D., speaks during a campaign rally alongside President Donald Trump in Fargo, N.D. on June 27.", "U.S. Rep. Kevin Cramer, R-N.D., said he would oppose a measure to close the government following President Donald Trump’s tweet about a possible government shutdown over immigration.", "Cramer, running to unseat Democrat Sen. Heidi Heitkamp, touted a clean record without any support for shutdowns.", "\"I've always voted for keeping the government open,\" Cramer told Robert Port on July 31. \"I’ve never cast a vote to shut down the government.\"", "We took a closer look.", "Actually, there’s no such thing as a formal \"shutdown vote,\" said Steven Smith, a political science professor at Washington University. Rather, failure to pass appropriations bills by the start of a fiscal year or by the time temporary spending authority expires results in a shutdown.", "And Cramer has cast votes that indirectly resulted in a shutdown. The votes in question are from 2013, when Republicans in Congress fought the implementation of President Barack Obama’s Affordable Care Act by refusing to fund it. As a minority party, Republicans didn't have the numbers to change the law, and Obama and his fellow Democrats refused to agree to gut it. Following a 16-day shutdown in October 2013, lawmakers voted to fund both the government and the Affordable Care Act.", "\"He has voted for bills he knew would force a government shutdown because they defunded Obamacare and had absolutely no chance of passing the Senate or being signed by the president,\" said Josh Ryan, a political scientist at Utah State University.", "Essentially, Republicans would bring a bill to the floor to fund a narrow program or agency, Democrats would offer a motion to change the bill, and Republicans, including Cramer, would reject some of those.", "Most of these were procedural votes, and Cramer voted along party lines.", "There’s an element of the blame game here, too.", "\"Sure, Republicans may have advanced a bill that would fail and shut down the government, but then again, Democrats could vote for the bill and keep the government open,\" said Ian Ostrander, a political science professor at Michigan State University.", "Cramer’s office presented the same argument.", "\"The votes you reference were all procedural gambits to try and reopen the government that Democrats attempted to institute because they did not want to vote on the funding bills Republicans were offering, which would have funded vital parts of the government,\" Tim Rasmussen, Cramer’s campaign spokesman.", "This question is a little easier to answer when it comes to the U.S. Senate, because its rules structure allows for more obvious delaying tactics. We rated Sen. Ted Cruz’s claim he opposed a shutdown Pants on Fire, for example, because he voted against cloture (needed to break a filibuster) on a vote to fund the government.", "A senator can vote for cloture and still oppose the bill at hand, but by opposing even that, Cruz favored a shutdown over compromise. But with no filibuster in the House, it’s harder to disentangle policy positions from efforts to directly cause a shutdown.", "Cramer said, \"I've always voted for keeping the government open. I’ve never cast a vote to shut down the government.\"", "We found multiple instances where Cramer indirectly helped to cause a shutdown by voting for bills that defunded Obamacare -- these bills had no chance of survival in the Senate or of being signed by then-President Obama. While Cramer's actions were not direct votes on keeping the government open, they encouraged the 2013 shutdown.", "We rate this statement Mostly False.", "Email interview with Tim Rasmussen, Cramer campaign spokesman, Aug. 2, 2018", "Email interview with Ian Ostrander, assistant political science professor at Michigan State University Aug. 2, 2018", "Email interview with Josh Ryan, political science professor at Utah State University, Aug. 2, 2018", "HJ Res 59, Vote 478, Sept 20, 2013", "CNN, House GOP launches shutdown battle by voting to defund Obamacare, Sept. 20, 2013", "CNN, Dems, GOP play game of chicken as shutdown looms, Sept. 29, 2013", "HJ Res 59, Vote 498, Sept. 29, 2013", "HJ Res 367, Vote 502, Sept. 30, 2013", "HJ Res 59, Vote 504; Sept. 30, 2013", "HJ Res 368, Vote 505, Oct. 1, 2013", "H Res 370, Vote 509, Oct. 2, 2013", "HJ Res 70, Vote 512, Oct. 2, 2013", "HR 3230, Vote 515, Oct. 3, 2013", "HJ Res 72, Vote 517, Oct. 3, 2013", "H Res 371, Vote 519, Oct. 4, 2013", "HJ Res 85, Vote 521, Oct. 4, 2013", "HJ Res 75, Vote 523, Oct. 4, 2013", "H J Res 77, Vote 527, Oct. 7, 2013", "HJ Res 84, Vote 529, Oct. 8, 2013", "H Res 373,Vote 531, Oct. 8, 2013", "HR 3273, Vote 533, Oct. 8, 2013", "HJ Res 90, Vote 536, Oct. 9, 2013", "HJ Res 79, Vote 539, Oct. 10, 2013", "HJ Res 76, Vote 541, Oct. 11, 2013", "HJ Res 80, Vote 547, Oct. 14, 2013", "HJ Res 80, Vote 549, Oct. 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]