["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump participates in a tour of a Honeywell International plant that manufactures personal protective equipment, Tuesday, May 5, 2020, in Phoenix. (AP)", "President Donald Trump downplayed academic projections that COVID-19 deaths could rise higher than previously expected this summer.", "Trump was asked about new projections multiple times on May 5, the day he traveled to Arizona to tour a mask factory.", "ABC’s David Muir asked Trump about a model by Johns Hopkins University that said the daily death rate could rise to 3,000 a day, as well as a University of Washington update that projected 135,000 deaths by early August.", "Trump criticized the models as \"out of whack.\"", "\"Those models that you're mentioning are talking about without mitigation,\" Trump replied. \"Well, we're mitigating, and we've learned to mitigate.\"", "Mitigation generally refers to steps to reduce the spread of the virus, such as social distancing, requiring people to wear masks and reducing public gatherings.", "In recent days, many states or counties have loosened such restrictions or have announced plans to do so, reopening beaches, restaurants and shops. Medical experts have cautioned that such measures could lead to more cases.", "By saying the new reports don’t factor in mitigation, Trump made it sound like they didn’t reflect ongoing efforts to limit the spread. But Trump is wrong — the University of Washington update does take into account mitigation such as social distancing. The Johns Hopkins data was a draft and was not intended as a forecast.", "RELATED: Donald Trump’s 4 biggest falsehoods on ABC News", "The Institute for Health Metrics and Evaluation at the University of Washington released an updated forecast showing about 134,000 deaths by early August. That was nearly double their forecast in late April.", "The revision reflects the winding down of social distancing measures expected in the majority of states by May 11.", "\"Increases in testing and contact tracing, along with warming seasonal temperatures — factors that could help slow transmission — do not offset rising mobility, thereby fueling a significant increase in projected deaths,\" the university said.", "The \"model includes mitigation and always has,\" Amelia Apfel, a spokeswoman for the institute, told PolitiFact in an email.", "The institute’s published frequently asked questions contains more details about how it factors social distancing into the models.", "Some experts have criticized the model as the numbers have fluctuated.", "The model from Johns Hopkins University caused a stir after the New York Times reported on an internal federal document showing deaths of 3,000 a day by June, compared with 1,750 now.", "The draft slide show, published by the Washington Post, included preliminary information from a Johns Hopkins Bloomberg School of Public Health professor who is contracted with the Federal Emergency Management Administration. Justin Lessler, an associate professor of epidemiology, told the Washington Post that his work contained a range of possibilities. A Johns Hopkins spokeswoman told PolitiFact that it is not a forecast.", "\"The information illustrates that there are some scenarios, including the premature relaxation of social distancing, that are likely to cause significant increases in the number of COVID-19 cases and deaths in the United States,\" the university said.", "We emailed Lessler directly to ask if his 3,000 figure took into account mitigation and did not get a reply. In Lessler’s interview with NPR, he said the various scenarios took into account how effective current measures are, and that his contract with FEMA prevents him from sharing his final projections with the public.", "The White House told media outlets that the numbers had not been vetted or presented to the coronavirus task force.", "The Trump administration has made it clear that even with mitigation the U.S. death toll will grow.", "\"Our projections have always been between 100,000 and 240,000 American lives lost, and that's with full mitigation and us learning from each other of how to social distance,\" said Dr. Deborah Birx, White House coronavirus response coordinator, on Fox News Sunday.", "When Trump was asked about new models projecting COVID-19 deaths, Trump responded that they \"are talking about without mitigation.\"", "The Johns Hopkins data was preliminary, and not designed as a forecast. The researcher told NPR that he assumed some degree of mitigation. Trump is clearly wrong about the University of Washington’s model, which does take into account mitigation efforts.", "We rate this claim False.", "ABC News, Transcript: ABC News anchor David Muir interviews President Trump in Arizona, May 5, 2020", "New York Times, Models Project Sharp Rise in Deaths as States Reopen, May 4, 2020", "U.S Department of Homeland Security, Centers for Disease Control and Prevention Situation Update, May 2020", "Washington Post, Draft report predicts covid-19 cases will reach 200,000 a day by June 1, May 4, 2020", "White House, Remarks by President Trump Before Marine One Departure, May 5, 2020", "CNN transcript, May 5, 2020", "White House, Remarks by President Trump Before Air Force One Departure, May 5, 2020", "NPR, White House Rejects Government Report Projecting Rising Coronavirus Death Toll, May 4, 2020", "NPR, Fact Check: Trump Administration Document And Its 3,000 Deaths A Day Scenario, May 5, 2020", "STAT News, Influential Covid-19 model uses flawed methods and shouldn’t guide U.S. policies, critics say, April 17, 2020", "University of Washington Institute for Health Metrics and Evaluation, New IHME Forecast Projects Nearly 135,000 COVID-19 Deaths in US, May 4, 2020", "University of Washington IHME, Covid projections, May 4, 2020", "University of Washington IHME, COVID-19: What’s New for April 27, 2020", "CBS News, Projections of 3,000 deaths a day represent \"preliminary\" data, not a forecast, researchers say, May 4, 2020", "Email interview,  Amelia Apfel, spokeswoman for the the Institute for Health Metrics and Evaluation (IHME) at the University of Washington, May 6, 2020", "Email interview, Barbara Benham, Johns Hopkins Bloomberg School of Public Health, May 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]