["A photograph showing Prime Minister Narendra Modi and underworld don Chhota Rajan has been shared on social media platforms. The picture shows a young, clean shaven Mr. Modi smiling at the camera. To his right, a person wearing a white shirt is seen standing about two steps behind. He appears to be Chhota Rajan.", "मोदी जी ने दरियादिली दिखाई अपने पुराने गरीब दोस्त छोटा राजन के भाई को विधान सभा की टिकट दी कृष्ण और सुदामा की दोस्ती अमर रहे", "Posted by Devender Wadera on Thursday, October 3, 2019", "The photograph has also been shared with the caption, “मेरे मुन्ना भूल न जाना,मेरे दूध का कर्ज निभाना”, insinuating that PM Modi is obliged to favour Chhota Rajan. It may be noted that Rajan’s brother, Deepak Nikalje will contest the upcoming assembly election on a Republican Party of India (RPI) ticket. RPI is an ally of the BJP.", "Four persons can be seen in the photograph, three of who have been tagged with names. The person on the far right in the background, is claimed to be Maharashtra CM Devendra Fadnavis. The photo, apart from Facebook, has been posted on Twitter.", "Modi with Chota Rajan.", "मेरे मुन्ना भूल न जाना,मेरे दूध का कर्ज निभाना।", "BJP – the party with a difference. pic.twitter.com/ed5THuoUoH", "— 🌠 💲anjeev ❗🌴 (@ChooseGudPerson) October 4, 2019", "The earliest instance found by Alt News dates back to November 2015.", "The image is photoshopped. In the original picture, there is no Chhota Rajan. Upon reverse-searching the image on Google, we found the real photograph in an article published in The Times of India dated September 26, 2014. The write-up chronicled Narendra Modi’s visit to the USA undertaken in the 1990s. The person seen standing to the right of Modi is not Chhota Rajan, but an elderly gentleman.", "The face of the gentleman on the left (to the right of Narendra Modi) has been morphed. The original and photoshopped images are juxtaposed for comparison.", "It may be noted that the image showing Narendra Modi with Chhota Rajan, is photoshopped. The original photograph dates back to 1993 and does not feature the underworld don.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]