["The photo album has been shared 600 times since it was posted here on Facebook on October 9, 2020.", "The album includes one group photo and five individual photos of Philippine youth leaders, including Congress member Sarah Elago; all wearing clothes with the hammer and sickle symbol.", "The group photo is overlaid with text that states in part: \"RED ALERT! COMMUNIST TERRORIST.”", "Identical photos had also been shared alongside a similar claim here, here and here on Facebook.", "But the claim is false: the photos have been digitally altered to include the communist symbol.", "Reverse image and keyword searches on Google found the group photo was originally posted here August 25, 2019 on the Facebook page of Preen.ph, a local women’s lifestyle publication.", "In the original photo, the clothes the five women are wearing do not contain any hammer and sickle symbol.", "Below is a screenshot comparison showing the doctored group photo in the misleading posts (L) and the Preen.ph photo (R):", "A representative for Preen.ph also denied the claim, telling AFP in an email October 19, 2020: “We don't have a formal statement but can confirm that the image is doctored.”", "The individual photos have also been originally published by Preen.ph, and could be found in separate profiles in this page, all without the hammer and sickle symbol.", "Below are screenshot comparisons showing the showing the doctored individual photos (L) and the Preen.ph photos (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]