["About this rating", "On 22 August 2016, the Facebook page \"AMERICAN STRONG\" published the following text and video depicting a young woman seemingly struggling with the feat of opening a can of Spaghetti-O's, suggesting that a generation of young adults have grown up lacking competence in such basic physical tasks as opening cans (at least, ones requiring the use of can openers rather than simply removing pull tab lids):", "WE as a society are completely DOOMED! Somewhere, something went horribly wrong in the last 30 years ...", "The clip was one minute and 27 seconds long and bizarrely suggested that the young woman depicted was (for inexplicable reasons) demonstrating her manual can opening skills for a similarly inexplicably impressed crowd. The clip concluded with a round of applause, apparently offered by the crowd because the subject finally succeeding in her difficult feat of opening a can with a can opener.", "Comments on the \"American Strong\" Facebook post suggested many viewers believed the clip presented an entirely plausible scenario highlighting a plague of \"brain dead millennials\" in America:", "Too all you grown ass people out there people who are actually adults and not overgrown children I'd like to apologize that my generation are nothing but pansy ass bitches who need a safe space I along with what few like mind people of my generation will be doing what we can to retain our teachings as true God fearing gun toting Christian Americans also trying to teach our brain dead\n millennials, it's not easy as seen in said video", "Not many Facebook observers appeared to question why the woman in the video was attempting to perform a rather mundane action in front of a large crowd in the first place, much less ponder whether there was more to the clip than presented.", "Indeed, the meme-tracking web site Know Your Meme offers the following description for an odd video known as \"Interior Semiotics,\" providing a clue that the footage was more likely a truncated version of a performance art piece:", "Interior Semiotics is a video depicting an art student’s performance, in which she opens a can of expired Spaghetti-Os, rubs them on her shirt, and proceeds to finger herself while urinating in a can. The video also depicts a large number of stereotypically hipster-looking audience members and their enthusiastic response to the performance. Consequently, the video became popular for exemplifying the ridiculousness of hipster culture and for personifying the stereotypes of the culturally-imagined hipster phenomenon of the late 2000s and early 2010s.", "The full video of that performance was published to YouTube in May 2010 under the same title and ran more than seven minutes long, of which the \"opening a can of Spaghetti-Os\" segment comprised only a small portion:", "The artist, Natacha Stolz, described her inspiration for the piece as follows:", "What happened was I started thinking about alphabet soup and how I used to eat it all the time as a kid. And I was thinking about what sort of meaning is contained in alphabet soup, in that material. It’s this incredibly processed, condensed consumer product. I thought that was kind of similar to how we process language and how we use words; how we just kind of consume what’s given to us, what’s pre-processed, and just digest that. I really like Carolee Schneemann’s Interior Scroll and I like how the structure of that piece is mirrored in the text that she reads. I wanted to create a piece like that, where the text mimics the overall structure. The poem I read is supposed to be really simple; it’s a simple text that repeats itself, and it’s meant to be a flat, everyday thing. But I wanted there to be a final reveal, like in Interior Scroll.", "I thought [the show] went well. I mean, people were shocked. Some people there knew what was going to happen, but even they seemed shocked by the reveal. It’s not something you see every day, but at the same time I don’t think it’s all that disgusting, or too shocking. But YouTube would disagree. (Laughs)", "The Spaghetti-Os video was misleadingly edited to suggest that millennials (perhaps routinely) struggle with mundane tasks such as using can openers, doing so for large assembled crowds to copious plaudits. But the shortened video was in fact a widely-known (and mocked) March 2010 performance art piece and was not intended to be a genuine depiction of the millennial incompetence. The complete performance went viral in its own right in 2010 and was jeered as an art form that many onlines felt was pretentious and pointless, but the clip did not depict a young woman struggling to open a can of food because she lacked the basic skills to do so.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]