["Florida Sen. Marco Rubio is trying to stamp out criticism from other presidential candidates about his slick, zip-up boots by saying he’s giving American business a leg up.", "Rubio’s ankle boots became the subject of Internet scrutiny after he was photographed wearing them in New Hampshire on Jan. 3, 2016.", "Pundits and fashion columnists commented on them ad nauseam. Rubio drew fire from his GOP rivals for being perhaps a bit too chic for the campaign trail. Some speculated they were to make the 5-foot-10 senator appear taller. Kentucky Sen. Rand Paul called the boots \"cute\" and former Florida Gov. Jeb Bush’s Right to Rise super PAC made a commercial mocking them.", "While Rubio initially called the focus on his footwear \"craziness,\" he’s worked at thinking on his feet. At a Jan. 18 campaign event in Waverly, Iowa, a voter jokingly asked about the boots. Rubio declared his boots, appropriately outfitted with a Cuban heel, are a patriotic choice.", "\"They sold out of those boots online,\" Rubio said. \"They’re made in Wisconsin. Florsheim! You know what that means? That means I did more for American business in one week than Barack Obama did in seven years!\"", "He’s right that Florsheim’s website says some sizes of their $135 Duke boots are out of stock, but they should be available by Feb. 1. A Florsheim spokesman told us sales of that style have \"increased significantly\" since Rubio was shown wearing them.", "As for the part about being made in Wisconsin, well, Rubio probably should have watched his step.", "Like all of the Glendale, Wis., company’s shoes, Rubio’s boots aren’t made in the United States. The company did recently collaborate with designer George Esquivel to create a luxury shoe line that is made in California, but Florsheim said their products are made in Asia, mostly from China.", "That trend goes back to the 1970s, when Florsheim’s then-owner, St. Louis-based International Shoe Co., moved production to India, where Rubio’s Duke boots were manufactured. The company also makes some items in Italy.", "Founded in 1892 in Chicago, Florsheim once had five U.S. factories and 2,500 employees by the 1920s. While at one time holding 70 percent of the men’s shoe market, the company eventually suffered from lackluster sales and a stodgy image, declaring bankruptcy in 2002.", "It was resurrected by Florsheim family scions through Weyco Group, the same company that distributes shoe brands like Nunn Bush and Stacy Adams (also foreign-made). No shoes are made at Weyco’s headquarters in suburban Milwaukee.", "It’s not really surprising that the American company’s boots are imports, as shoe manufacturing in the United States is on shaky footing these days. The American Apparel and Footwear Association said that domestic production has started to increase in recent years, but U.S. boot and shoe sales are still around 98 percent imports.", "Rubio’s campaign didn’t respond when we pointed out the boots were not made in America. There are still bootmakers in Wisconsin, however. Weinbrenner Shoe Company, for example, makes work boots in two central Wisconsin factories, and Allen Edmonds makes most of its high-end shoes and boots in Port Washington, about 20 miles north of Glendale.", "Our ruling", "Rubio said his much-discussed boots are \"made in Wisconsin.\"", "His Florsheim ankle boots aren’t made in the Badger State, where the company is headquartered. Florsheim told us most of their products are made in China, but Rubio’s boots came from India.", "We have to put our foot down on this one. We rate Rubio’s statement Pants on Fire!", "New York Times, \"Boots? Marco Rubio Wants to Talk Guns and Football,\" Jan. 18, 2016", "Chicago Tribune, \"Florsheim files for Chapter 11 protection,\" March 5, 2002", "New York Times, \"The Florsheims, Back in Their Own Shoes,\" June 24, 2007", "Fashion Times, \"Footwear Designer George Esquivel Talks New Collection And Collaborating With Florsheim,\" Dec. 7, 2015", "Vanity Fair, \"How Much Do Marco Rubio’s Boots Cost?,\" Jan. 4, 2016", "New York, \"A Vote for Marco Rubio Is a Vote for Men’s High-Heeled Booties,\" Jan. 5, 2016", "Politico, \"Cruz camp mocks Rubio's 'high-heeled booties',\" Jan. 5, 2016", "Tampa Bay Times Buzz blog, \"Marco Rubio can't believe the attention on his boots, 'This is craziness',\" Jan. 7, 2016", "New York Times, \"Marco Rubio’s Shiny Boots Stir Up the Presidential Race,\" Jan. 7, 2016", "New York Times First Draft blog, \"Marco Rubio Reacts to Those Boots That Were Made for Talking,\" Jan. 7, 2016", "American Apparel and Footwear Association, \"ApparelStats 2014 and ShoeStats 2014 Reports,\" Jan. 9, 2015", "CBS News, \"Marco Rubio's boots make their debut walking the 2016 trail,\" Jan. 6, 2016", "CNN, \"Jeb Bush on Rubio's boots: 'I don't have a height issue',\" Jan. 13, 2016", "Florsheim.com, Duke boots, accessed Jan. 19, 2016", "Florsheim.com, Company history, accessed Jan. 19, 2016", "Interview with Joe Yang, Florsheim spokesman, Jan. 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]