["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker announces his run for president on July 13, 2015 at the Expo Center in Waukesha, Wis. (Michael Sears/Milwaukee Journal Sentinel)", "An anti-Donald Trump Democratic strategist and fundraiser has attacked Wisconsin Gov. Scott Walker by trying to tie him to Russian President Vladimir Putin.", "In a May 23, 2017 tweet that has been retweeted more than 6,500 times ties, Scott Dworkin said this:", "Docs: Wisconsin Governor Scott Walker took $1 million from a pro-Putin Ukrainian businessman—last election cycle.", "It’s a bit of a drive-by attack.", "Dworkin and his group", "Dworkin, who goes by @funder on Twitter, is a senior advisor for the Democratic Coalition Against Trump, which was founded during the 2016 presidential campaign. He gained attention after the election by saying he was filing treason \"complaints\" against Trump and three other officials in connection with Russian interference in the election.", "PunditFact pointed out that only federal prosecutors, not ordinary citizens, can file criminal complaints alleging treason.", "Dworkin has continued hammering on Russia, telling the Washington Post two weeks after his Walker tweet: \"Anybody who says we shouldn’t look into Russia at this point is either in it or a traitor.\"", "The Walker attack", "Dworkin’s attack pertains to Walker’s brief run for the 2016 Republican nomination and to a super PAC which, unlike a presidential candidate, can accept unlimited donations.", "When we asked for information to back up the claim, Dworkin referred us to a Federal Election Commission record showing that Access Industries Inc. of New York City made a $1 million contribution to Unintimidated PAC, a super PAC launched by longtime Walker advisers.", "(The super PAC, by the way, offered perks to $1 million donors, including: twice-a-year retreats, members-only briefings and conference calls, two private dinners with \"VIP special guests\" and a special \"executive board member\" pin.)", "Access Industries actually gave a total of $1.5 million to the super PAC, the nonprofit Center for Responsive Politics told us, although $1.2 million of it was returned after Walker dropped out of the race.", "So, the $1 million figure in the tweet is accurate, except that the money was given to a super PAC supporting Walker, not to Walker or to his campaign.", "The rest of the attack is less on target.", "The company owner", "Access Industries is a New York-based industrial group whose holdings include Warner Music. It was founded by Leonard Blavatnik. According to Forbes, he’s worth $19 billion, having made $7 billion from the sale of TNK-BP, a Russian oil company, in 2013.", "Blavatnik was born in Ukraine and raised in Moscow. But he emigrated to the United States for school in 1978, now lives in London and holds dual citizenship in the United States and the United Kingdom.", "So, calling him a Ukrainian businessman is not accurate.", "As for whether Blavatnik is \"pro-Putin,\" we didn’t find direct evidence of that, although there are connections.", "The Financial Times referred to Blavatnik as one of the \"Kremlin-friendly tycoons\" who made a fortune on the sale.", "In 2015, the London-based Daily Mail reported on controversy over a $75 million donation made by Blavatnik to Oxford University. Academics, human rights activists and Russian dissidents called on the university to \"stop selling its reputation and prestige to Putin’s associates.\"", "And in 2016, the Daily Mail reported that British Prime Minister Theresa May believed that Russian and former Soviet bloc oligarchs with links to Putin had become too close to the Tories and should be barred from party fundraising events. The article cited Blavatnik as one of the oligarchs.", "However, when we checked with Steven Lee Myers, Karen Dawisha and Anne Garrels, each of whom has written a book on Putin, they told us they didn’t know whether Blavatnik was \"pro-Putin.\"", "Blavatnik has pushed back on being tied to Putin.", "In May 2017, The Guardian reported that lawyers for Blavatnik have denied he is an associate of Putin, saying he has had no personal contact with the Russian president since 2000. Similarly, the Telegraph has reported that Blavatnik insists he's a strong believer in democracy who hasn't had any contact with Putin since 2000.", "Our rating", "Tweets made this claim: \"Docs: Wisconsin Governor Scott Walker took $1 million from a pro-Putin Ukrainian businessman — last election cycle.\"\n\nThe businessman was born in Ukraine, but has long lived in London and New York. His company gave $1.5 million not directly to Walker, but to a super PAC that supported Walker’s run for the 2016 GOP presidential nomination. He has ties to Putin, based on his past ownership of a Russian oil company, but whether he is \"pro-Putin\" is unclear.", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "Twitter, Scott Dworkin @funder tweet, May 23, 2017", "Email, Scott Dworkin, June 15, 2017", "Interview, Scott Walker campaign Joe Fadness, June 16, 2017", "Federal Election Commission, itemized receipts to Unintimidated PAC, June 23, 2015", "Forbes, \"The Four Horsemen Of Russia's Economic Apocalypse,\" Jan. 21, 2015", "Daily Mail, \"Oxford, Putin and a row over oligarch's £75million donation: University accused of 'selling its prestige' to Russian President's associates,\" Nov. 3, 2015", "New Yorker, \"The Billionaire'\u0080\u0099s Playlist,\" Jan. 20, 2014", "Daily Mail, \"PM's war on oligarchs who cosied up to Cameron: Theresa May vows to ban those with links to Vladimir Putin from Tory fundraising events,\" Jan. 1, 2017\n\nFinancial Times, \"Putin boosted by defiant tone at top and among people,\" March 21, 2014", "The Guardian, \"Tate Modern names extension after billionaire Len Blavatnik,\" May 4, 2017", "The Telegraph, \"The billionaires, supermarket moguls and tycoons financing your favourite Hollywood movies,\" Dec. 21, 2016", "Email, Steven Lee Myers, June 18, 2017", "Email, Karen Dawisha, June 18, 2017", "Email, Anne Garrels, June 17, 2017", "Email, Center for Responsive Politics staff member Alex Baumgart, June 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]