["About this rating", "A series of peer-reviewed studies published in a new book found that sperm concentration among men from Western countries had halved from 1973 to 2011, with no evidence of “leveling off” in the following years. Penis sizes have also been shown to be shrinking in biological males who had been exposed to a plastic chemical called phthalates. However...", "Sperm levels in biological males from Asia, South America, and Africa were not shown to be drastically decreasing, which could be the result of either lifestyle, chemical exposures, or another undetermined factor.", "What remains unknown is whether similar trends have continued in the decade since the data was collected.", "Sperm concentration among men from Western countries has halved in the last 50 years, with no evidence of “leveling off” in recent years. And if that weren't alarming enough to some, new research indicates that penis sizes in biological males are also shrinking.", "Those are two key takeaways from a new book by Dr. Shanna Swan, an epidemiologist at the Icahn School of Medicine at Mount Sinai who specializes in pollution and its impact on human health. In the weeks following her February 2021 release of “Count Down: How Our Modern World Is Threatening Sperm Counts, Altering Male and Female Reproductive Development, and Imperiling the Future of the Human Race,” Swan’s claims went viral as publications reported that exposure to environmental pollutants, particularly a class called phthalates, have been shown to cause “reproductive havoc.”", "Phthalates are a group of chemicals known as “plasticizers” because of their ability to make plastics more flexible and harder to break, according to the Centers for Disease Control and Prevention. They are found in nearly every plastic product, from hair sprays and nail polishes to raincoats and vinyl flooring. When humans are exposed, phthalates enter the human system to disrupt the endocrine system, which can impact hormones and ultimately result in reproductive issues in both biological males and females.", "Speaking about her book on a panel on March 26, 2021, with the European nonprofit Health and Environment Alliance, Swan noted that her new book was largely based on a series of studies that examined phthalate exposure in humans.", "Research published in 2005 and replicated in 2015 found that fetal exposure to testosterone-lowering phthalates in the womb can lead to a smaller or malformed penis, a condition known as “phthalate syndrome.” In men, this condition can present in low sperm count, reduced testosterone, and a small penis and scrotum, among other things. Females have been shown to exhibit reproductive issues including endometriosis, premature egg depletion, early puberty and miscarriage. Both biological sexes have been correlated with low libido, DNA damage in the sperm and egg, as well as infertility.", "“The changes we’re seeing are occurring in two generations, and dramatic changes of this kind in two generations are unlikely to be caused by genetics,” said Swan. “So that leaves environment and within the environment, we talk about lifestyle factors and chemical exposures.”", "As a follow-up to this work in 2017, Swan and her colleagues at the Researchers from the Hebrew University-Hadassah Braun School of Public Health and Community Medicine and the Icahn School of Medicine at Mount Sinai analyzed sperm count data from 185 studies between 1973 and 2011.", "Published in the journal Human Reproduction Update, the research found a more than 59% decline in total sperm count, which is the average number of sperm present in one sample of semen, among men from North America, Europe, Australia, and New Zealand. And when it came to evaluating the characteristics of sperm like density — or “sperm concentration” — they found that a more than 52% decline. (It is important to note that no significant decline was reported in men from South America, Asia and Africa, though this could be the result of a lack in available data.)", "Notably, there was “no sign” that the decline was expected to level off in the years following the study time frame.", "This “strong and continuing” decline in Western countries may also suggest that lowered semen counts and concentrations may be correlated to chemical exposure, particularly as Swan’s previous studies showed that environmental and lifestyle influences, like chemical and pesticide exposure, may influence reproductive and endocrine health. The researchers call it an “urgent wakeup call” for researchers and health authorities around the world to investigate the causes of conditions like phthalate syndrome, and how it may lead to lower reproductivity.", "“When we expose ourselves, we are exposing our future offspring,” said Swan, adding that phthalate exposure is also linked to reproductive cancers, heart disease, diabetes, and early mortality. “It’s not really just about reproduction, it’s about overall health.”", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]