["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As an Aug. 2, 2011 deadline approaches, debate is intensifying over whether Congress should allow the federal government to go deeper in debt. The head of the nation’s central bank went so far as to say the borrowing limit must be raised in order to avert a \"huge financial calamity.\"\n\nSeeking cuts in spending, many Republicans, including House Budget Committee Chairman Paul Ryan of Wisconsin, have resisted President Barack Obama’s call to raise the debt limit.\n\nIn defending his position, Ryan made a pair of striking statistical claims during a Milwaukee radio interview on July 6, 2011.\n\n\"We borrow 42 cents of every dollar Washington spends today,\" he toldJay Weber, a conservative talk show host on WISN-AM (1130), \"and about half of that comes from countries like China.\"\n\nThe first part of the statement has to do with the federal deficit, while the second has to do with the debt.\n\nAs the U.S. Treasury Department points out, a deficit occurs when the government spends more money than it takes in (through taxes, fees and other income). When there’s a deficit, the government borrows money to cover the difference by selling treasury securities. Debt, meanwhile, is the net amount of accumulated deficits.\n\nLet’s look at the two halves of the statement.\n\n\"We borrow 42 cents of every dollar Washington spends today\"\n\nConor Sweeney, Ryan’s budget committee spokesman, cited two reports:", "That puts Ryan’s claim of 42 cents smack in the middle.\n\nOur PolitiFact colleagues earlier in 2011 twice evaluated statements nearly identical to Ryan’s, using the same approach Sweeney used. They rated both statements True, even though they were off by 3 cents.  \n\nTo check the most recent data, we used the Treasury Department’s May 2011 revenue and spending report, the latest available when Ryan did the radio interview. It indicates that, for the fiscal year to that point in time, the government borrowed 39 cents for every dollar it spends. Ryan is also within 3 cents of that figure, so we’ll judge his first claim as essentially accurate.\n\nNow, to his second claim -- which is more complicated.\n\n\"About half of (the borrowing) comes from countries like China\"\n\nBy saying \"countries like China,\" Ryan meant borrowing the U.S. does from any foreign countries, according to Sweeney. So, for Ryan’s second claim to be accurate, roughly half of the U.S. debt would have to be foreign owned.\n\nThere is no real dispute that the nation’s total debt exceeds $14 trillion.\n\nPolitiFact has twice used that figure in evaluating claims about the proportion of U.S. debt owned by China. In recent days, the New York Times cited the current debt as $14.3 trillion and the Los Angeles Times, in a primer on the debt-limit talks, noted that the debt had reached that level in May 2011. Moreover, the The Debt to the Penny and Who Holds It, a daily debt tracking done by the Treasury Department, also shows the debt at $14.3 trillion.\n\nIndeed, that figure just about equals the nation’s debt limit -- which explains why there is urgency on the part of those who want to see the limit raised before what the Obama administration says is an Aug. 2, 2011 deadline.\n\nBut according to Sweeney, Ryan wasn’t referring to that measure at all.\n\nRather, he said, Ryan was pointing to a portion of the total debt, the far less known \"debt held by the public.\"\n\nCiting a Congressional Budget Office study, Sweeney called that debt measure \"the most significant measure for economic purposes\" because it excludes treasury securities held by Social Security trust funds and other government accounts.\n\nHe then pointed to the Treasury Department’s daily debt tracking, which shows total debt at $14.3 trillion, including $9.74 trillion held by the public.\n\nSweeney also cited a Treasury Department report which said foreign investment accounted for $4.49 trillion of U.S. debt as of April 2011. (China, by the way, was the top foreign debt owner, with $1.15 trillion.)\n\nUsing the $4.49 trillion figure would mean that foreign investors own 46 percent of the debt held by the public, which is the proportion Ryan claimed -- but only 31 percent of the total debt, which is debt measure most familiar to most people.\n\nSo what’s the bottom line?\n\nIn an interview about raising the federal government’s debt limit, Ryan made two claims in one statement: \"We borrow 42 cents of every dollar Washington spends today and about half of that comes from countries like China.\" The first claim is essentially on the money.\n\nBut we believe Ryan owed his listeners more detail if he expected them to accept his second claim. It has long been widely reported that both the nation’s debt and its debt limit are $14.3 trillion. And that’s what the radio discussion was about. So when Ryan said that half of the nation’s borrowing comes from foreign countries -- singling out China for emphasis -- his listeners would assume he meant half of the $14.3 trillion in total debt, not the much smaller debt measure he now says he was referring to, even if that second measure has strong merit in the debt limit discussion.\n\nWe rate Ryan’s statement Half True.", "Interview and e-mail interview, U.S. Rep. Paul Ryan spokesman Conor Sweeney, July 7 and 12-14, 2011\n\nWISN-AM, Jay Weber interview (claim at about 14:00) of U.S. Rep. Paul Ryan, July 6, 2011\n\nWhiteHouse.gov, fiscal 2012 budget summary table S-1\n\nCongressional Budget Office, Monthly Budget Review, June 7, 2011\n\nPolitiFact.com, \"Kent Conrad said we’re borrowing 40 cents of every dollar we spend,\" Jan. 27, 2011\n\nPolitiFact.com, \"Herman Cain says China holds 26 percent of U.S. debt,\" April 22, 2011\n\nPolitiFact Virginia, \"Rep. Scott Rigell says the United States borrows more than 40 cents of every dollar it spendts,\" Feb. 17, 2011\n\nPolitiFact Virginia, \"Allen says China owns more U.S. bonds than Americans,\" July 8, 2011\n\nU.S. Treasury Department, Monthly Treasury Statement of Receipts and Outlays of the United States Government, May 2011\n\nU.S. Treasury Department, Major foreign holders of treasury securities, June 15, 2011\n\nU.S. Treasury Department, \"Monthly statement of the public debt,\" June 30, 2011\n\nU.S. Treasury Department, \"Monthly statement of the public debt,\" May 31, 2011\n\nU.S. Treasury Department, The debt to the penny and who owns it\n\nU.S. Treasury Department, \"Debt versus deficit: What’s the difference?,\" Aug. 5, 2004\n\nCongressional Research Service, Foreign holdings of federal debt, March 25, 2011\n\nCongressional Budget Office, Federal debt and interest costs, December 2010\n\nFactCheck.org, \"Durbin’s debt problem,\" June 21, 2011\n\nThe New York Times, \"In fiscal fight, GOP distrust of Obama runs deep,\" July 12, 2011\n\nAssociated Press, \"U.S. debt tops $14 trillion, nears ceiling,\" Jan. 17, 2011\n\nLos Angeles Times, \"What’s at stake in the debt-limit talks: a primer,\" July 13, 2011\n\nWashington Post, \"Bernanke warns of ‘calamity’ if U.S. defaults; Republicans decry ‘scare tactics,’\" July 13, 2011\n\nWashington Post, \"GOP lawmakers: don’t believe Obama on debt ceiling,\" July 13, 2011\n\nWashington Post, \"Can President Obama keep paying Social Security benefits even if the debt ceiling is reached?,\" July 13, 2011", "Money.com, \"Debt ceiling FAQs: What you need to know,\" May 18, 2011\n\nPolitiFact.com, \"Barack Obama said Social Security and other federal checks may not go out on Aug. 3 if the debt ceiling is not increased,\" July 13, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]