["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Russian President Vladimir Putin hasn’t resorted to releasing lions in order to keep people inside during the COVID-19 pandemic.", "Well, that’s one way to do it.", "Posts online claim that in an attempt to \"ensure\" people stay indoors during the COVID-19 outbreak, Russia has turned to lions. Hundreds of them.", "A now-deleted Instagram post by an account called \"Barstoolnewsnet\" featured what appears to be a screenshot of a news broadcast reporting \"BREAKING NEWS\" that Russia \"unleashed more than 500 lions on its streets to ensure that people are staying indoors during this pandemic outbreak.\"", "Below that a news ticker says, \"Vladmir (sic) Putin released around 500 lions to make people stay indoors.\" Several similar versions of the post have also been shared on Facebook.", "But none of it is true.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Many public gathering spaces in Russia are closed, and Moscow has asked elderly people to stay home for several weeks. But Russian President Vladimir Putin hasn’t threatened people with five years’ jail time for violating stay-at-home orders, as some posts claim. And he hasn’t released lions, tigers or bears to keep people home during the pandemic. The broadcast screenshot was made on a news generator website, and the photo of the lion is from a 2016 movie shoot in South Africa, not Russia.", "We searched for the source of the image and came across the news generator website \"Break Your Own News,\" which allows people to create their own television chyrons. The generator’s configuration is identical to the screenshot in the social media posts, and Check Your Fact reported it found the website’s watermark on one of the postings.", "A reverse-image search showed that the photo of the lion is from an April 2016 movie shoot in Johannesburg. The lion (his name is Columbus) had reportedly been borrowed from a nearby lion park for the filming, and the area was fenced off.", "Lions have not been tapped by Russia to enforce stay-at-home recommendations. Pants on Fire!", "Instagram post, March 22, 2020", "BreakingYourOwnNews, generator, March 24, 2020", "Tin Eye, Reverse-image search, March 24, 2020", "Check Your Fact, FACT CHECK: DID RUSSIA LET OVER 500 LIONS LOOSE TO KEEP PEOPLE INDOORS DURING THE CORONAVIRUS PANDEMIC?, March 24, 2020", "Daily Mail, Paws at the traffic lights! Giant male lion is seen prowling around the streets of South Africa's biggest city (but it's not as dangerous as you'd think), April 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]