["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An alarming number of people are planning to come to the United States from Guatemala, said Sen. Ron Johnson, R-Wis.", "\"There's a survey done in Guatemala. A third of Guatemalans intend to migrate to the United States,\" Johnson said during a July 21 interview on CNN’s State of the Union. \"That's about 5.8 million people. Depopulating Guatemala and Central America, that's not good for Central America. It's not good for us.\"", "Did a survey say that about a third of Guatemalans — or about 5.8 million people — plan to migrate to the United States? No. Johnson’s claim is based on news reports that inaccurately conveyed survey results.", "Johnson’s press office directed PolitiFact to a blog post on the senator’s website headlined \"How many people would come here under open borders?\" It was published the day after the CNN interview.", "\"39.2% of Guatemalans told pollsters they intend to migrate out of the country, and 85% of those said they would migrate to the United States,\" Johnson’s post said, reflecting what Guatemalan newspaper Prensa Libre reported in May. Johnson also cited U.S. versions of the story written by the Washington Examiner and the Daily Caller.", "Johnson has a point: a lot of Guatemalans said they intend to leave their country. \"But the specific numbers are different,\" said professor Elizabeth J. Zechmeister, director of the Latin American Public Opinion Project at Vanderbilt University.", "Her group worked with a Guatemalan research institute and think tank to create the AmericasBarometer Guatemala national survey. It was conducted from Jan. 22 to March 20, 2019 in face-to-face interviews with 1,596 individuals. Zechmeister said the sample is nationally representative of Guatemala’s adult population, 18 years and older.", "The survey asked participants if they had any intention of going to live or work in another country in the next three years. In response, about 25% said yes. That’s much fewer than the near 40% Johnson cited.", "The people who said yes were then asked the likelihood that they will live and work in another country in the next three years; 39.2% said \"very likely.\"", "So the 39% figure is a subset of the 25% of Guatemalans who said they had an intention to leave their country. These specific set of questions did not ask where they’d go.", "In a May 6 tweet, the Vanderbilt research group said it wanted to clarify Prensa Libre’s reporting, noting exactly to what the percentages corresponded.", "ACLARACIÓN: Queremos precisar la información publicada por @prensa_libre. Solo 25.3% de los guatemaltecos tiene intenciones de emigrar. De este 25.3%, apenas 39.2% cree que es muy probable que lo haga en lo próximos 3 años. Más información ver @ASIES_GT: https://t.co/QrgL6yFAnw pic.twitter.com/Bsq3lEvi3X", "Overall, almost 10% of Guatemala’s adult population is estimated to be highly motivated to leave the country, Zechmeister told PolitiFact. \"That is, the percent that both expresses an intention to emigrate in the next three years and reports that it is very likely they will do so,\" she said.", "Guatemalans who said their future emigration was \"very likely\" were not asked if the United States was an intended destination.", "A separate survey question asked if in the last 12 months, respondents considered emigrating; 17.2% responded \"yes.\" Those who said yes were then asked an open-ended question about where they had considered emigrating, and 85% said the United States.", "So about 14.6% of the survey respondents said that in the last 12 months they considered emigrating to the United States, said Zechmeister.", "PolitiFact asked Zechmeister what might be the best estimate of the number of Guatemalans intending to come to the United States — since Johnson said about 5.8 million people.", "\"I'm not comfortable saying that there is a particular number that is ‘correct’,\" Zechmeister said. \"This would be easier if we had asked the question directly — do you intend to emigrate to the U.S. in the next year? But since we did not, attempts to use our data to answer that question will require some assumptions and, depending on what those are, there is a range of answers that one could generate to the question.\"", "Johnson also mentioned the survey in the context of a conversation about illegal immigration. But the survey did not ask people if they intended to migrate legally or illegally.", "Johnson said, \"There's a survey done in Guatemala. A third of Guatemalans intend to migrate to the United States. That's about 5.8 million people.\"", "A survey of Guatemalans showed that many of them intend to leave their country, and some data suggests that the United States is a considered destination.", "But Johnson’s estimates are based on media reports that inaccurately presented survey results. Using the survey in the kind of way that Johnson did requires assumptions that go beyond the evidence.", "Johnson repeated poorly reported information about the survey results. We rate the claim Mostly False.", "YouTube, Sen. Ron Johnson interview on CNN’s State of the Union, July 21, 2019", "CNN Transcripts, State of the Union aired July 21, 2019", "Email interview, Aaren Johnson, press secretary, U.S. Senator Ron Johnson, July 22, 2019", "Email interview, Elizabeth J. Zechmeister, a political science professor and director of the LAPOP research institute at Vanderbilt University, July 23, 2019", "Prensa Libre, El 39.2 por ciento de los guatemaltecos considera migrar a Estados Unidos, May 2, 2019", "Sen. Ron Johnson’s website, How many people would come here under open borders?, July 22, 2019", "ASIES.org, LAPOP presentation on Guatemalan survey", "Daily Caller, Nearly 40 Percent Of Guatemalans Want To Leave The Country, Poll Finds, May 3, 2019", "Washington Examiner, A third of Guatemalans plan to immigrate to the US, May 3, 2019", "International Monetary Fund, 2019 estimate of Guatemala’s population", "Twitter, @Lapop_Barometro tweet, May 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]