["Congress leader Digvijay Singh tweeted a six-second video on October 15. The clip features former Madhya Pradesh BJP president and MP from Khandwa, Nandkumar Singh Chauhan. He can be heard saying, “UP also has women who give birth to a child every week, 52 children a year.”", "Accompanying the clip, Singh’s original caption in Hindi states, “Is what Mr. Nandkumar saying about the women in UP correct? I would also like to know more about these women.” (archived link to the tweet)", "नंद कुमार जी जो इस विडियो पर आपके उत्तर प्रदेश की महिलाओं के बारे में बयान आ रहा है वह क्या सही है? हम भी ऐसी महिलाओं के बारे में जानना चाहेंगे। pic.twitter.com/UacIRc254a", "— digvijaya singh (@digvijaya_28) October 15, 2020", "The video is viral on Facebook with the same claim.", "The video shared by the Congress leader has been taken out of context and does not tell the full story. Alt News had previously debunked the video in April 2019 when it was being circulated to target Chauhan in a similar manner. The viral clip has been trimmed from a longer video.", "A look at the full-length clip establishes that the BJP MP was referring to a viral video featuring Rahul Gandhi. He is claiming that Gandhi said there are women in UP who gave birth to a child every week.", "This claim was also investigated by Alt News in April 2019. Before the Lok Sabha elections, BJP MP RK Sinha had shared a clipped video targetting Rahul Gandhi. The original video was taken in Uttar Pradesh’s Phoolpur where Gandhi was giving a speech in November 2011. Here, he was talking about the issue of corruption in Uttar Pradesh. In the video he cited an RTI reply, saying, “We filed an RTI report. Through the reply, we found that there are women in UP who give birth to a child every week. There are women who are giving birth to 52 children a year. They have the same name and they all received Rs 1400 every week in their pockets, and there exists not just one…but thousands of such women.”", "Gandhi’s speech was in reference to alleged corruption in the Janani Suraksha Yojana under National Rural Health Mission, in which pregnant women get an incentive of Rs 1400 for institutional delivery.", "A cropped video of a nine-year-old speech by Rahul Gandhi set the ball rolling for the recurring misinformation. BJP leader Nandkumar Singh Chauhan had used the speech clip to attack the Congress when it went viral last year. Now, a clip of Chauhan repeating Gandhi’s words is being shared online. The irony is that the statement used by Congress leader Digvijay Singh to target BJP’s Nandkumar Singh Chauhan leader is the same one which Chauhan had earlier used to mock Rahul Gandhi. All of this happened even as the cropped clip had already been debunked in 2019.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]