["Image from an ad by Ernest Almonte attacking Seth Magaziner for allegedly planning to spend billions more dollars if Magaziner is elected General Treasurer.", "In a television ad for Ernest Almonte, independent candidate for treasurer, his campaign tries to compare him and Democrat Seth Magaziner in categories such as fiscal efficiency, protecting employee pensions, and political ties.", "At one point the narrator says, \"Ernie Almonte is an independent who isn't tied to any party and is ready to save tax dollars. Seth Magaziner -- a partisan politician with plans to spend billions more of your money.\"", "Billions?", "That's quite a claim when the current state budget is $8.7 billion.", "When we contacted the Almonte campaign to ask what the \"billions\" claim was referring to, spokeswoman Christine Hunsinger sent a tally of five items that totaled just over $2 billion.", "It turns out that virtually all of that $2 billion is hypothetical.", "In essence, Almonte takes Magaziner’s proposals -- which notably lack specific cost estimates -- and extrapolated his own estimates, taking each to the extreme.", "He assumes that Magaziner plans to finance every school, infrastructure and historic preservation project the state has suggested.", "And he assumes that Magaziner would serve a full eight years, magnifying the potential costs.", "Almonte bases the calculation on Magaziner's website document \"A Blueprint for Rhode Island,\" which offers several proposals to spur economic growth in the state. We'll consider the five items separately.", "Main Street Opportunity Loan Program -- Almonte notes that Magaziner is promising to advocate for $20 million for this loan program for people looking to start a business. Magaziner's campaign counters that it would only cost the state $20 million if every single loan defaults immediately. But, in fact, the state would still be paying $20 million up front to make the loans in the first place.", "Actual cost to taxpayers: $20 million, as Almonte says.", "Rhode Island Venture Pool -- Almonte says Magaziner is calling for investing $15 million from the state's pension fund into a venture capital program that focuses exclusively on new Rhode Island businesses. The goal is to create jobs.", "But the program would cost $15 million only if the entire amount is loaned and the companies pay none of it back. Almonte says it’s reasonable to assume the full amount because investments in new companies carry a high risk.", "Actual cost to taxpayers: Nothing immediately. With bad investments -- up to $15 million. Or it might make money.", "School Building Capital Improvement Authority -- Magaziner says in his plan that he wants to rebuild or renovate Rhode Island's schools using a School Building Capital Improvement Authority. His blueprint mentions no price tag, but says it would be modeled after a successful program in Massachusetts, where 1 penny of the 6.25-percent sales tax goes to school construction and improvement.", "Almonte says that if Rhode Island were to divert a penny when it collects its 7-percent sales tax, that would raise about $127 million a year. But the state would have to find a way to make up for that lost sales tax money, so it would be an extra burden on the taxpayer.", "Almonte estimates the total cost of the proposal would be more than $1 billion -- $127 million per year times the eight years Magaziner could potentially be in office.", "But Evan England, campaign manager for Magaziner, said the candidate has not specified how much of the sales tax should be tapped and is simply proposing that some portion of existing state revenue be earmarked for school construction.", "Actual cost to taxpayers: It depends on how the program is set up and how ambitious it tries to be.", "Infrastructure Bank -- Magaziner proposes a revolving fund for roads and bridges similar to one in Virginia that offers bonds and loans to communities at low-interest rates. Again, he doesn’t specify a dollar figure.", "Almonte, however, says it would cost $430 million over several years. He derives that number from a 2013 General Assembly staff report that said Rhode Island needs to spend hundreds of millions of dollars on its biggest infrastructure projects over five years.", "Magaziner's campaign manager said the assumption that the bank would fund every proposed infrastructure project \"is completely out of left field and does not appear anywhere in the Blueprint.\"", "Actual cost to taxpayers: Once again, it would vary by how the program is set up and how ambitious it is.", "Historic Preservation Tax Credit Trust -- Magaziner's blueprint promises to \"push to restore\" the program, which had been capped to trim costs. Once again, Magaziner doesn't cite a cost.", "Almonte says the program will cost $460 million, a figure he derived by assuming that all 277 projects cited in a 2007 report would be funded.", "England's response: \"Seth has said numerous times that the tax credits should exist, but that the level and the cap should be fluid and responsive to the needs of the economy for that given year,\"", "Actual cost to taxpayers: It depends on how many projects actually are awarded tax credits.", "Our ruling", "Ernest Almonte said Seth Magaziner \"plans to spend billions more of your money.\"", "Almonte is referring to Magaziner’s Blueprint for Rhode Island, which outlines a series of economic development proposals. If any were implemented, there would certainly be a cost, but the lack of specifics in the blueprint make it impossible to calculate.", "Almonte told PolitiFact Rhode Island that he is simply doing what a good general treasurer should do -- evaluate proposals and offer realistic estimates about what they would cost. He said the total eventual price tag could be more than $2 billion.", "But extrapolating worst-case costs from vaguely defined programs, piling assumption onto assumption and extending them over several years is not realistic at all.", "Because the statement contains some elements of truth but ignores critical facts that would give a different impression, we rate it False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "Vimeo.com, \"Compare,\" Ernie Almonte channel, Oct. 17, 2014, accessed Oct. 19, 2014", "Emails, Evan Petrone, spokesman, Almonte for General Treasurer campaign, Oct. 21-22, 2014, and Evan England, campaign manager, Magaziner for Treasurer campaign, Oct. 21, 2014", "Interviews, Ernest Almonte, candidate for Rhode Island General Treasurer, Oct. 22, 2014, and Christine Hunsinger, spokeswoman, Almonte for General Treasurer campaign, Oct. 21-22, 2014", "SethMagaziner.com, \"A Blueprint for Rhode Island,\" undated, accessed Oct. 21, 2014", "MassSchoolBuildings.org, Massachusetts School Buildings Authority website and VirginiaResources.org, Virginia Resources Authority website, both accessed Oct. 23, 2014", "RILIN.state.RI.US, \"Infrastructure and Funding in Rhode Island: Background and Issues,\" report by the House fiscal staff to the Special Legislative Commission to Study the Funding of East Bay Bridges, Sept. 26, 2013, accessed Oct. 23, 2014", "Preservation.RI.gov, \"Rhode Island Historic Preservation Investment Tax Credit: Economic & Fiscal Impact Analysis 2007,\" Sept. 7, 2007, accessed Oct. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]