["House Minority Leader Kevin McCarthy of Calif., speaks during a news conference on Capitol Hill. (AP)", "• McCarthy has spoken about QAnon in at least three previous public appearances. ​", "House GOP leader Kevin McCarthy, R-Calif., has been dealing with a fight in Congress over how to handle freshman Rep. Marjorie Taylor Greene, R-Ga., who has made comments supporting violence against Democrats and promoted the baseless QAnon conspiracy theory.", "The FBI has called the QAnon movement a domestic terrorism threat, and its adherents were among those who stormed the Capitol on Jan. 6, driving McCarthy and other lawmakers out of their chambers as they counted electoral votes.", "But in a press briefing Feb. 3, McCarthy professed ignorance about QAnon, and mispronounced its name.", "Defending Greene, he said: \"I think it would be helpful if you could hear exactly what she told all of us — denouncing ‘Q-on.’ I don’t know if I say it right. I don’t even know what it is.\"", "pic.twitter.com/J2XfuRYVG7", "QAnon’s involvement in the Capitol riot drove a surge in awareness of the movement, whose followers believe former President Donald Trump was on a secret mission to fight a cabal of Satan-worshipping, cannibalistic pedophiles that includes top-ranking Democrats and Hollywood celebrities.", "So can McCarthy fairly claim, less than a month after the riot, that he doesn’t know what QAnon is — or even how to say its name?", "No, he can’t.", "McCarthy has spoken about QAnon publicly at least three times, and appeared to know enough about it to speak out against it. He’s also pronounced the name correctly before.", "In an Aug. 21 press briefing, McCarthy got a question about Greene, who had just won her primary in Georgia. In his answer, he explicitly denounced QAnon, which he called \"the Q organization.\"", "\"She recently came out and denounced the Q organization, whatever beliefs, I do not agree with their beliefs at all,\" he said. At the time, Greene hadn’t denounced QAnon, although she had told Fox News that she had since chosen \"another path.\"", "In an interview with Fox News that same day, McCarthy denounced QAnon a second time and pronounced it correctly. \"Let me be very clear: There is no place for QAnon in the Republican Party. I do not support it,\" he said.", "During a November news conference, a reporter asked McCarthy if he was concerned about new members of Congress like Greene and Rep. Lauren Boebert, R-Colo., who have expressed support for QAnon.", "\"Our party is very diverse. You mentioned two people who are going to join our party, and both of them have denounced Q-on,\" he replied, mispronouncing it again.", "This was also misleading. While Boebert had attempted to distance herself from the conspiracy theory, Greene still had not.", "A McCarthy spokesperson did not respond to a request for comment.", "McCarthy said, \"I don’t even know what (QAnon) is.\"", "McCarthy has spoken about QAnon in at least three public appearances. He has also explicitly denounced the extremist ideology before.", "We rate his claim False.", "NBC News, House GOP candidate known for QAnon support was 'correspondent' for conspiracy website, Aug. 14, 2020", "Media Matters for America, QAnon candidate Marjorie Taylor Greene is a 9/11 conspiracy theorist who claimed that there’s no evidence a plane crashed into the Pentagon, Aug. 13, 2020", "Mediaite, FLASHBACK: Three times Kevin McCarthy denounced QAnon — before now claiming: ‘I don’t even know what it is,’ Feb. 4, 2021", "Daily Beast, HISTORY! Congress poised to get its first QAnon believer, Jun. 11, 2020", "Morning Consult, Belief in QAnon wavers slightly among adults after Capitol riots, inauguration, Feb. 2, 2021", "PolitiFact, Face-painted man in horned fur cap at Capitol riot supports Trump and QAnon, not antifa, Jan. 7, 2021", "PolitiFact, No, the Capitol insurrection was not staged by antifa, Jan. 8, 2021", "PolitiFact, FBI investigation of Capitol riot focuses on far-right groups, Jan. 20, 2021", "Washington Post, QAnon reshaped Trump’s party and radicalized believers. The Capitol siege may just be the start, Jan. 13, 2021", "Yahoo News, Exclusive: FBI document warns conspiracy theories are a new domestic terrorism threat, Aug. 1, 2019", "Fox News, Rep. Kevin McCarthy believes Republicans will retake the House, says there's no place for QAnon in the GOP, Aug. 21, 2020", "CSPAN, House GOP leader McCarthy says freshmen have denounced QAnon, Nov. 12, 2020 ​", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]