["About this rating", "Hobby Lobby is not closing stores during the COVID-19 pandemic in areas that have not issued strict shelter-in-place guidelines.", "It's misleading to suggest Hobby Lobby refuses to close all its stores, because it has closed stores in locations where \"non-essential businesses\" have been required to do so.", "The total number of Hobby Lobby stores that have closed is unclear, as is whether or not CEO David Green sent a letter to employees mentioning that his wife had received a message from God.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, as a number of \"non-essential businesses\" started to close in an attempt to help slow the spread of COVID-19 coronavirus disease, the arts and crafts chain Hobby Lobby seemingly bucked the trend and decided to keep many of its stores open. The company explained on its website that it was taking some precautionary measures, such as increasing the frequency of store cleanings. But a letter supposedly sent by Hobby Lobby CEO David Green to employees suggested the company had other ideas about what would keep employees safe.", "One posting of this letter, shared close to 40,000 times on Twitter, explained that Hobby Lobby stores would stay open in part because Green's wife Barbara had received a message from God:", "The crux of the rumor is based on the letter's third paragraph, which reads:", "In her quiet prayer time this past week, the Lord put on Barbara's heart three profound words to remind us that He's in control. Guide, Guard, and Groom. We serve a God who will Guide us through this storm, who will Guard us as we travel to places never seen before, and who, as a result of this experience, will Groom us to be better than we could have ever thought possible before now.", "Before we get to the origins of this letter, let's address the notion that Hobby Lobby is refusing to close its stores during the COVID-19 pandemic.", "While it's true that, as of this writing, Hobby Lobby is not voluntarily closing stores in cities or states that have thus far not issued shelter-in place orders, the company does appear to be following guidelines in places that have issued such orders.", "CBS News reports:", "The chain appeared to be adhering to restrictions imposed by some states and municipalities. A call to a Hobby Lobby store in Houston, Texas, found it to be open as usual, while calls to stores in North Riverside, Illinois, and Massapequa Park, New York, went unanswered. The person who answered the phone at a Hobby Lobby store in Columbus, Ohio, said the store was open Monday until 8 p.m. for its \"last day\" of operation before closing on Tuesday.", "As for the letter, the above-displayed image appears to have been first posted to the \"Atheism\" section of Reddit by a user who claimed to be a Hobby Lobby employee. That posting included a few brief sentences explaining that the letter was sent to the store's managers:", "Hobby Lobby refuses to close during this pandemic. There are over 40 cases in my area. Store manager refuses to close. I want to share this letter that was sent to managers pleading them to stay open and to have “faith” that everything will be okay in the end because his wife had a vision from god.", "This is the Imgur link to that letter. I’m scared and Coworkers are also scared. Some people have outright walked out. Considering doing the same soon. Why do I have to put up with this?", "The Reddit user who posted the letter responded to dozens of comments and questions in that thread. We reached out to the user directly for more information but have yet to receive a response. But we can say that we found no indication that this was a hoax. In fact, the user seemed personally impacted by this letter and offered additional information, such as details about the store's PTO policies, which leads us to believe that this letter is likely authentic.", "Furthermore, this is not the only photograph of this letter that we've come across. The day before the above-displayed image went viral, another Redditor posted an image showing the same letter allegedly sent by Hobby Lobby:", "We don't see any reason to doubt the veracity of this letter. Hobby Lobby CEO David Green and his family are vocal about their Evangelical Christian beliefs and the company has challenged laws in the past. However, we have not been able to definitively confirm that this letter was written and sent out by Green, nor has Hobby Lobby responded to our request for comment.", "Liptak, Adam.   \"Supreme Court Rejects Contraceptives Mandate for Some Corporations.\"  \r\n  The New York Times.   30 June 2014.", "Gibson, Kate.   \"Hobby Lobby Open During Coronavirus Pandemic, Even as Other Retailers Close.\"\r\n    CBS News.   23 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]