["Adam Putnam, 2005 file photo (Times Photo by Joseph Garnett, Jr.)", "In Florida’s Republican primary for governor, U.S. Rep. Ron DeSantis challenged Agriculture Commissioner Adam Putnam’s credibility on illegal immigration.", "DeSantis cast Putnam as not being conservative enough on immigration in a chat May 2 with radio host John Fredericks, a supporter of President Donald Trump. Trump said DeSantis, a frequent guest on Fox News, would make a \"GREAT\" governor back in December.", "\"Well, we are very different in our approach to illegal immigration,\" DeSantis said of Putnam. \"When he was in the Congress, he supported the McCain amnesty, he even supported the gang of eight Schumer-Obama amnesty when he was ag commissioner. He didn’t even have to vote on it but he supported it. He opposed bringing troops, putting troops on our southern border using the National Guard.\"", "Whether Putnam supported \"amnesty\" is a complicated question. We previously rated that attack as Half True, because he has supported some initiatives that would benefit undocumented immigrants (including the 2013 \"Gang of Eight\" legislation) and others that wouldn’t have.", "For this fact-check, we wanted to know if Putnam opposed \"putting troops on the southern border using the National Guard.\"", "We learned that Putnam did take a similar vote in 2004, but experts said the underlying policy — putting troops on the border — was not a major policy consideration in the early 2000s. More importantly, though, the talking point doesn’t account for Putnam’s general support of Trump’s immigration policy.", "Putnam served in the U.S. House for 10 years before he started two terms as agriculture commissioner in 2011.", "DeSantis’s claim is rooted in Putnam’s 2004 vote against an amendment to the Ronald W. Reagan National Defense Authorization Act.", "The amendment authorized the defense secretary to assign members of the Army, Navy, Air Force and Marine Corps to assist the Department of Homeland Security with border patrol duties, in some circumstances.", "The amendment, sponsored by Rep. Virgil Goode, R-Va., did not say anything about the National Guard, as DeSantis said.", "The amendment ended up passing with a vote of 231-191. Putnam and 19 other Republican lawmakers voted against it (Putnam being the only Republican from Florida to vote no).", "News coverage of this amendment was miminal. Still, some lawmakers went on the record to say the amendment would have stretched military personnel too thin.", "\"Border security is and continues to be a top priority for me and for the Congress as a whole,\" then-Rep. Jim Kolbe, R-Ariz., said at the time. \"But the Goode amendment would militarize our border and stretch the resources of our Army.\"", "In the early 2000s, deploying the military to help control the southern border was not discussed as a major immigration enforcement strategy by either party, said Stephen H. Legomsky, an emeritus professor at the Washington University School of Law in St. Louis who served as chief counsel of U.S. Citizenship and Immigration Services from 2011 to 2013.", "\"The idea has surfaced from time to time, but it has never been a key component of any administration's strategy,\" he said.", "We asked Putnam spokeswoman Amanda Bevis why Putnam voted against the amendment. Instead, she reiterated Putnam’s support for the White House’s policy on immigration, which as of April includes sending National Guard troops to the southern border.", "\"Adam Putnam supports President Trump’s actions to secure our borders, including activating troops for this critical purpose,\" she said. \"Without strong border security to prevent illegal aliens from unlawfully entering our country, the lives of American citizens are endangered.\"", "This is the same quote Bevis gave Florida Politics earlier this year when reporters asked Putnam about his 2004 vote.", "We could not find any recent instances of Putnam speaking directly in support of sending the National Guard to the border. On his campaign website video about immigration, Putnam speaks broadly of supporting Trump’s policies.", "\"As governor we will work with President Trump to cut funding for sanctuary cities, we will support tighter border security and vetting for refugees from Muslim countries,\" he said in a video posted May 2017.", "We also found several votes Putnam took in favor of border security measures and funding enforcement.", "For example, he voted in favor of a border security bill in 2005 that would have required improving surveillance technology, training more agents, and upgrading border infrastructure.", "He was one of multiple cosponsors of the Secure Fence Act of 2006 and voted for the legislation. The law signed by President George W. Bush authorized about 700 miles of fencing between the border of the United States and Mexico.", "Putnam also voted for legislation in 2004 that appropriated $34.2 billion for Homeland Security, including funds to increase the number of border agents.", "DeSantis said Putnam \"opposed bringing troops, putting troops on our southern border using the National Guard.\"", "Context is key. In 2004, Putnam did vote against an amendment that authorized the secretary of defense to assign members of the military under certain circumstances to assist the Department of Homeland Security in securing the border.", "What the claim leaves out is Putnam’s overall support for Trump’s immigration policy. While Putnam has not commented on Trump’s specific plan to send National Guard to the border, he is generally enthusiastic about Trump’s approach to immigration.", "It’s also worth noting that as a member of Congress, Putnam took several votes in favor of border security measures and funding enforcement.", "We rate this claim Half True.", "Email interview, Amanda Bevis, Adam Putnam spokeswoman, May 3", "Email interview, Brad Herold, Ron DeSantis spokesman, May 3", "Email interview, Louis DeSipio, UC Irvine political science professor, interview May 4, 2018", "Email interview, Alex Nowrasteh, an immigration policy expert at the libertarian Cato Institute, May 4, 2018", "Email interview, Stephen H. Legomsky, an emeritus professor at the Washington University School of Law in St. Louis, May 4, 2018", "Email interview, Elizabeth F. Cohen, an associate professor of political science at Syracuse University, May 4, 2018", "Interview, Lina Newton, associate professor of political science at Hunter College, CUNY, May 4, 2018", "PolitiFact, Can President Donald Trump send the military to secure the border? April 4, 2018", "PolitiFact Florida, Was Adam Putnam, candidate for Florida governor, for amnesty on immigration?  July 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]