["An image of a church with the name ‘Lingayath Catholic Church’ has been shared on social media. The text under the name of the church is “Estd: April 16, 2018 Bangalore, Karnataka”.", "ಸರಿಯಾಗಿ ನೋಡಿ ನಾವು ಲಿಂಗಾಯತರು ವೀರಶೈವರು ಅಂತ ಯಾರ ಯಾರು ಬಡಿದಾಡತಾ ಇದ್ದೀರಾ?", "ಇವರುಗಳ ಮಧ್ಯೆ ಮತ್ತೊಬ್ಬರು ಬಂದಿದ್ದಾರೆ ನಾವು ನಿಮ್ಮವರೇ ಅಂತ 🤦😡😠 pic.twitter.com/03wpNmom4w", "— Priya Hp (@PriyaHP45priya) August 11, 2021", "Pro-BJP propaganda website Kreately also shared the image but later took it down.", "“Hey kannadiggas this is the extensive work done by missionaries in Karnatka. Wat is ‘Lingayat Cotholic’. These bloody missionaries are fooling innocent n poor hindus..N they r falling for few money..@SushmaSwaraj hope u r not approving visas 4 these anymore…(sic)” read a tweet by @drshraddha16 sharing the same image in 2018.", "The decision of the former Siddaramaiah government declaring Lingayats as a religious minority in March 2018 was a contentious one. The image was first shared after the government’s move. In 2016, the Gujarat government had accorded minority status to Jains as well. However, accordance of minority status to a religion is not equivalent to declaring a religion as a catholic sect. Therefore, an image claiming to be a ‘Lingayath Catholic Church’ didn’t add up.", "When we reverse-searched the image, we were led to a blog called ‘Beautiful Indian Churches‘.", "The image that is currently being passed off as a ‘Lingayath Catholic Church’ established in April 2018 in Bangalore is actually a church in Dahanu, a coastal town in Thane district in the western part of Maharashtra. The blogger had clicked the picture during his visit to Dahanu and had posted it on the blog. The blog post is dated April 14, 2012. The original image can be seen below.", "As can be seen from the images above, the church is called ‘OUR LADY OF DOLOURS CHURCH’ and not ‘Lingayath Catholic Church’. The text under the name is “दुखी माता चर्च, डहाणू” (Translation: Dukhi Mata Church, Dahanu).", "An image of a church from Dahanu, Maharasthra was photoshopped to portray it as a newly established church in Bangalore belonging to the Lingayat community which was accorded the minority status. This confirms the pattern of disinformation around the Lingayat issue that Alt News has debunked earlier. Fake news website Postcard News had circulated a fake letter addressed to Sonia Gandhi by Karnataka Minister MB Patil in which it was alleged that the Lingayat issue was engineered with the help of the Global Christian Organisation and World Islamic Organisation. As it happens, none of the two organisations quoted in the letter exists. Previously, many including BJP MP Subramanian Swamy shared a fake email about the involvement of the Church in the Lingayat issue.", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]