["About this rating", "A woman in Oklahoma was killed by a pack of dogs, and according to a technician who euthanized the animals, most of them were dachshund mixes.", "The victim was not attacked by a pack of vicious, small, hot dog-shaped purebred dachshunds.", "On 17 May 2018, numerous publications picked up on an odd local news story out of Carter County, Oklahoma, reporting that a woman had been mauled and killed by a pack of small dachshund dogs. People, for example, shared a story with a headline, \"Oklahoma Woman Dies After Being Mauled by Pack of Dachshund Dogs.\"", "Although a woman was attacked and killed by a pack of small dogs weighing under forty pounds and around knee height, the image conjured by such headlines above of vicious hot dog-shaped, floppy-eared wiener dogs mauling someone to death are not totally accurate. Most of the dogs in question were believed to be dachshund mixes, while one was a collie mix.", "Nancy Garcia, 52, of Ardmore, was attacked just before 10 in the evening near her home outside the city of Ardmore by a pack of seven dogs on 10 May 2018. She died of her injuries. According to authorities and local news reports, the dogs belonged to her neighbor. One of the dogs was shot and killed after charging at police, while the other six were euthanized at Ardmore Animal Shelter.", "The shelter's euthanasia technician, Amanda Dinwiddie, told Sherman, Texas, television station KXII that all of the dogs but one were dachshund mixes, saying: \"A predominant breed in these dogs is definitely standard dachshund. They have really noticeable characteristics like their knobby legs, knees, very short legged dogs and their coats.\"", "Initially, one of the dogs was incorrectly identified by law enforcement as a pit bull terrier.", "Dinwiddle said the dogs were covered in fleas and ticks and appeared to have been living out in the woods. Graphic video taken by KXII included images of the deceased dogs, which can be viewed here. According to local news reports, police are investigating whether criminal charges against the dogs' owner are in order. There are no leash laws in Carter County, meaning dogs are allowed to roam.", "People magazine reported that this tragedy was an example of why behavior, not breed or appearance, should be considered an indicator of whether dogs are vicious, because otherwise people could be lulled into a false sense of security:", "Though dachshunds are often perceived as harmless and even ‘goofy’ canines, reputation doesn’t necessarily matter when it comes to dog-related fatalities.", "“Just like people, you judge dogs on their behavior, not on how they look,” Ledy VanKavage, the senior legislative attorney for Best Friends Animal Society, the nation’s largest no-kill animal society tells PEOPLE.", "“That saying don’t judge a book by its cover applies to both dogs and people.”", "Martinez, Crystal.   \"Woman Attacked and Killed by Pack of Dogs Identified.\"\r\n    KXII-TV.   14 May 2018.", "KXII-TV.   \"Woman Killed by Dogs in Ardmore.\"\r\n    11 May 2018.", "Eubank, McKenna. \"Carter County Woman Dies After Being Mauled By Dogs.\"\r\n  KTEN. 11 May 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]