["The claim was published on Facebook by a New Zealand-based user here on August 17, 2020. The post has been shared more than 750 times.", "The Facebook post includes an image that features the logo of Australian TV network Nine Network on the bottom right-hand corner. It also includes a logo for Nine’s breakfast TV show Today Extra in the bottom left-hand corner. A banner, circled in red at the bottom of the image, reads: “COVID-19 CONSPIRACY FINE” and “56% OF AUSSIES SAY POLICE SHOULD FINE VIRUS CONSPIRACY THEORISTS”.", "The text superimposed above the image states in part: “an entire news segment just played on a breakfast / morning news show on Australian TV, talking about how you could be FINED for discussing ‘conspiracy theories’ around COVID-19”.", "The Facebook post's caption adds: “Aussies will be fined if they are found to be talking about conspiracies to do with covid like WTF!”", "A similar claim was shared hundreds of times on Facebook here, here and here.", "The claim, however, is false.", "The image in the misleading post corresponds to the one-minute 33-second mark of this August 6, 2020, episode of Today Extra. During the episode, the show's hosts David Campbell and Sylvia Jeffreys discussed the results of a viewer poll with two guests. The question posed was: “Should the Police be allowed to fine Australians who intentionally spread chaos-inducing conspiracy theories during a pandemic?”", "Should police be allowed to FINE COVID-19 conspiracy theorists?#9Today", "9News, the news service of Nine Network, also reported on the poll results in this August 5 article titled; “Growing number of Aussies believe police should be able to fine COVID-19 conspiracy theorists”.", "In response to the misleading posts, a Nine spokesperson told AFP the August 6 segment was “talking about poll results and not something that was before Parliament or being considered by police”.", "“Any suggestion that Australians are able to be fined for discussing Covid-19 conspiracy theories based on the Today Extra segment is false,” the Nine spokesperson said in an email on August 18.", "Associate Professor Michael Eburn at Australian National University’s College of Law told AFP in an August 18 email that he was not aware of any legislation that made it illegal for people to talk about COVID-19 conspiracy theories.", "“They could be fined or otherwise dealt with if they promoted an unlawful response to the COVID-19 response, e.g. advocated violence against those enforcing public health orders or conspired with or encouraged others to act in breach of public health orders, but that is not the same thing as ‘talking about conspiracy theories’,” Associate Professor Eburn said.", "In an email to AFP on August 19, the Attorney General's Department said: \"The Attorney-General’s Department is not aware of any current laws which specifically penalise talking about COVID-19 associated conspiracy theories.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]