["About this rating", "A short video supposedly showing former Vice President Joe Biden talking about his hairy legs in his youth during a public address went viral in December 2019.", "The video, which quickly racked up millions of views, appears to show Biden saying that kids would approach him while he was working as a lifeguard at the public pool and straighten out his curly leg hair. The clip also shows the presidential candidate making a supposed gaffe by saying \"I love kids jumping on my lap.\"", "This clip comes from a genuine video of Biden speaking at a public event.", "This video was taken in June 2017 as the city of Wilmington, Delaware, renamed a public pool after the former vice president and 2020 presidential contender. Biden served as a lifeguard as a young man at what was then called the \"Prices Run Park Pool\" and said he was honored to see it renamed the \"Joseph R. Biden Jr. Aquatic Center.\"", "NBC News reported at the time:", "As a teenager in the summer of 1962, former Vice President Joe Biden worked as a lifeguard at what was known as the Prices Run swimming pool in Wilmington, Delaware. On Monday, the aquatic facility at Brown-Burton Winchester Park was renamed the Joseph R. Biden Sr. Aquatic Center in his honor.", "\"I was a kid from suburbia,\" Biden, who lived in Mayfield, Delaware, at the time, told the audience during the dedication speech. \"I wanted to get more involved. And I realized I lived in a neighborhood where I'd turn on the television and I'd see and listen to Dr. [Martin Luther] King and others. But I didn't know any black people. No, I really didn't. And you didn't know any white people, either. That's the truth. So I wanted to work here.\"", "This video was originally broadcast on the government public access channel WITN Channel 22. The full video can seen here. The portion of Biden's speech included in the viral clip can be seen around the 30:45 mark.", "https://youtu.be/SvCf1X2es0I?t=1846", "The viral clip of Biden talking about his hairy legs is real but it is missing some context. It comes from a much longer set of remarks that Biden delivered in the summer of 2017 after the public pool was renamed in his honor. Biden mentioned the blonde, curly hair on his legs while talking about his experience as a white man working at a public pool that was predominantly attended by black patrons.", "Interestingly, this isn't the first time a segment from this speech went viral. In September 2019, a portion of the speech involving a story about a man named \"CornPop\" went viral because social media users doubted the veracity of Biden's anecdote. It turned out, however, that Biden was largely telling the truth about his run-in with gang member CornPop:", "Over the weekend, a 2017 video of Biden telling the engrossing tale surfaced on the internet. It met with widespread disbelief. Some questioned whether CornPop ever existed. Others were skeptical about the very idea of a chain-wielding Biden facing off with three armed gang members.", "It turns out, however, that the presidential candidate might have been telling the truth. A former state president of the National Association for the Advancement of Colored People (NAACP) had supported Biden’s yarn. So did a newspaper obituary.", "The footage of the CornPop anecdote was filmed when Biden attended the renaming of a swimming pool and park in Wilmington. The former Delaware senator recalled that, as a young man, he had been a security guard there, one of very few white employees. He then launched into his story.", "“CornPop was a bad dude and he ran a bunch of bad boys,” he said.", "In sum, the viral video of Biden talking about his hairy legs is real. It comes from a much longer set of remarks that Biden delivered in the summer of 2017 after the public pool where he worked as a teenager was renamed in his honor.", "NBC News.   \"Making a Splash: Joe Biden Returns to His Old Lifeguard Chair.\"     26 June 2017.", "Gabbatt, Adam.   \"Why Is Everyone Talking About Biden Confronting a Man Called 'CornPop?'\"\r\n    The Guardian.   16 September 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]