["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton promised to \"connect more Latinos with good-paying jobs that pay good wages\" when she spoke on Sept. 15, 2016, at the 39th Annual Congressional Hispanic Caucus Institute Public Policy Conference and Annual Awards Gala in Washington.", "\"We need to create an economy that works for everyone, not just those at the top,\" the Democratic presidential candidate said. \"There's something wrong when Latinos are 17 percent of our country's population but hold only 2 percent of its wealth.\"", "We decided to fact-check those percentages, recognizing that although the federal government considers Latino to be synonymous with Hispanic, many people make a distinction. Because we'll be using government data, we'll consider the terms comparable.", "First, a bit of history.", "The Great Recession had a much more devastating effect on Hispanics than on whites. The Pew Research Center found that while median wealth for whites fell 16 percent after the collapse of the housing market and the subsequent recession, it fell by 66 percent for Hispanic households.", "Wealth includes all savings, investments and property, minus the value of debt, such as car loans, mortgages and credit card debt.", "In 2009, median net worth for whites was $113,149. It was $6,325 for Hispanics. Four years earlier, the numbers were $134,992 for whites, $18,359 for Hispanics.", "\"Hispanics (were) hit hardest by the meltdown in the housing market,\" the Pew report said.", "When it comes to specific percentages, the Clinton campaign sent us two two reports.", "The first was from the Census Bureau, which pegged the Hispanic population at 17 percent as of July 1, 2014. That confirms the first part of Clinton's statement.", "The second was a 2014 analysis by the Federal Reserve Bank of St. Louis, part of the federal reserve system. It predicts that the wealth owned by Hispanic families in total dollars will triple by 2025, although most of the extra wealth \"would result from the Hispanic population growing faster than other groups\" rather than individual Hispanics gaining more wealth.", "The report uses 2010 data (when Hispanics made up 16.3 percent of the United States population). The St. Louis Fed calculated that in 2010 Hispanics represented about 2.2 percent of the total wealth in the country. That's that 2 percent Clinton was referring to.", "At the time, median wealth for an Hispanic family was $15,000 versus $77,000 for the entire U.S. population.", "We sought newer data by turning to Pew, where Richard Fry, a senior economist, used 2013 household data collected by the Federal Reserve.", "\"The nation’s total wealth was $64.7 trillion,\" he told us via email. \"The nation’s 13 million Hispanic households owned about $1.5 trillion of that $64.7 trillion, so yes, Hispanic households owned about 2 percent of the nation’s wealth in 2013.\"", "The actual ratio: 2.3 percent.", "The current outlook for individual Hispanics is not very good.", "The Fed estimated that the Hispanic share of the economy's total wealth would rise by 2025 to either 2.6 percent or 3.2 percent, depending on the projection used. But that would be because the Hispanic population is growing significantly, not because individual families would be making a lot more money.", "\"If it were not for the faster rate of population growth projected for the Hispanic population,\" the Fed concluded, \"the wealth shares in 2025 would be 2.0 or 2.4 percent — that is, either a small decline or a small increase from their 2010 shares. Thus, relatively rapid population growth in the Hispanic population is likely to be an important contributor to the rising share of total wealth owned by Hispanics.\"", "Our ruling", "Clinton said, \"Latinos are 17 percent of our country's population but hold only 2 percent of its wealth.\"", "Census Bureau data confirm the 17 percent. Federal reserve data from 2010 and more recent data from 2013 show that the 2 percent figure is on target as well.", "We rate the claim as True.", "Email, Josh Schwerin, Hillary Clinton campaign, Sept. 16, 2016", "Interview, Richard Fry, senior economist, Pew Research Center, Sept. 16, 2016", "Federal Reserve Bank of St. Louis, \"Hispanic Population's Share of Wealth Likely to Increase by 2025,\" June 2014", "United States Census Bureau, \"FFF:Hispanic Heritage Month 2015,\" updated Feb. 9, 2016", "Pew Research Center, \"Wealth Gaps Rise to Record Highs Between Whites, Blacks, Hispanics,\" July 26, 2011; \"Hispanics Say They Have the Worst of a Bad Economy,\" Jan. 26, 2012; \"Wealth inequality has widened along racial, ethnic lines since end of Great Recession,\" Dec. 12, 2014; and \"10 facts for National Hispanic Heritage Month,\" Sept. 15, 2016", "The Washington Post, \"The great American Hispanic wealth gap,\" July 1, 2014", "PolitiFact.com, \"Donald Trump offers misleading statistics about Hispanic poverty,\" Aug. 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]