["This 22-second video has been viewed nearly three million times since it was posted to Twitter on March 23, 2020.", "The post’s caption reads: “In #Turkey, people have started to leave food packets on the road for the poor and the needy who cannot earn due to #COVIDー19 lockdown. Love you #Turks for representing us.”", "Below is a screenshot of the misleading post:", "On March 18, 2020, Turkish President Recep Tayyip Erdogan urged residents to remain at home if possible, but no mandatory lockdown was announced. Erdogan announced further travel restrictions on March 27 as the number of COVID-19 cases in Turkey topped 5,600.", "The video was also shared alongside a similar claim on Facebook here, here, here and here; on Twitter here, here, here and here; and on YouTube here, here, here and here.", "The claim is false.", "A combination of keyword and reverse image searches found the footage in fact shows donations for victims of a deadly earthquake that hit the Turkish city of Elazig in January 2020.", "Footage showing similar packets on the same street was broadcast live on Facebook here on January 25, 2020, weeks before Turkey confirmed its first COVID-19 case on March 11, 2020.", "The location of the Facebook Live video corresponds with this Google Street View imagery, which shows the same building with curved surfaces. It also corresponds with the building seen at the beginning of the video in the misleading posts.", "The Facebook user, who geotagged the video to a Turkish volunteer organisation, also uploaded several photos on January 26 in this post about donations the group had collected for the “earthquake area”.", "AFP reported on the earthquake in Elazig here on January 26.", "“Hopes faded Sunday of finding more survivors from a powerful earthquake in eastern Turkey as more bodies were pulled from the rubble and the death toll climbed to 35. Nearly 4,000 rescue workers combed through debris in freezing temperatures, helped by mechanical diggers, in vain hopes of finding anyone alive in the city of Elazig,” AFP reported.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]