["About this rating", "In August 2018, social media users came across a meme featuring a photograph of Robert Kennedy, a speculative question about the nature of God supposedly posed by one of his brothers (John F. Kennedy), and a series of images seemingly showing Christian religious figures with African features:", "This question -- \"But suppose God is black? What if we go to Heaven and we, all our lives, have treated the Negro as an inferior, and God is there, and we loop up and He is not white? What then is our response?\" -- was posed by a Kennedy, but it wasn't President John F. Kennedy. This thought originated with JFK's younger brother, Senator Robert F. Kennedy, as reflected in an article published in the August 1966 issue of LOOK magazine titled \"Suppose God Is Black\":", "Senator (Robert F.) Kennedy visited South Africa during the height of apartheid in the summer of 1966 and delivered a series of speeches to students at universities across that country. His most famous speech, dubbed the \"Ripple of Hope\" address, was delivered at the University of Cape Town and marked the National Union of South African Students' (NUSAS) annual Day of Affirmation:", "The fact that the trip to South Africa even took place could be considered a minor miracle. The senator’s invitation to speak came from South Africa’s Union of Students. The architect of apartheid -- Dr. Hendrik Verwoerd -- was the nation's prime minister, and Nelson Mandela remained in prison on Robben Island. The South African authorities made it clear they would not offer Senator Kennedy any security, many State Department officials were convinced his trip was ill-conceived and doomed to fail.", "In his speech, Robert Kennedy spoke for those who were not free to speak. His gave hope to anti-apartheid student activists who had felt alone in their quest for racial equality, and he showed them how their efforts were connected to other civil rights movements underway around the world.", "When Kennedy returned to the United States, he wrote about his experience in South Africa for  LOOK magazine. In that article, Kennedy related a story about an interaction he had with one of the audience members at the University of Natal in Durban.", "According to Kennedy, the audience member informed him that most of the churches in the area taught apartheid as a \"moral necessity\" and said that black Africans shouldn't be allowed to pray alongside whites since God created blacks \"to serve.\" In his article, Kennedy wrote that he responded by posing the question featured in this meme:", "During five days this summer, my wife Ethel and I visited South Africa, talking to all kinds of people representing all viewpoints. Wherever we went -- Pretoria, Cape Town, Durban, Stellenbosch, Johannesburg -- apartheid was at the heart of the discussion and debate.", "Our aim was not simply to criticize but to engage in a dialogue to see if, together, we could elevate reason above prejudice and myth. At the University of Natal in Durban, I was told the church to which most of the white population belongs teaches apartheid as a moral necessity. A questioner declared that few churches allow black Africans to pray with the white because the Bible says that is the way it should be, because God created Negroes to serve.", "\"But suppose God is black,\" I replied. \"What if we go to Heaven and we, all our lives, have treated the Negro as an inferior, and God is there, and we look up and He is not white? What then is our response?\"", "There was no answer. Only silence.", "Some contemporaneous newspaper reports also republished portions of Kennedy's article:", "The web site for the documentary \"RFK in the Land of Apartheid\"  includes the full text of the LOOK article.", "The University of Cape Town.   \"50th Anniversary of Robert Kennedy's 'Ripple of Hope' Speech.\"\r\n    24 May 2016.", "Hockenberry, John.   \"RFK's 'Ripple of Hope' Speech Still Touches the World, 50 Years Later.\"\r\n    PRI.   6 June 2016.", "The Post Standard.   \"RFK Asks, 'Is God Black?'\"\r\n    8 August 1966.", "Los Angeles Times.   \"But Suppose God Is Black? Kennedy Said.\"\r\n    8 August 1966.", "Kennedy, Robert.   \"Suppose God Is Black.\"\r\n    LOOK.   23 August 1966.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]