["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Intelligence Committee Chairman Adam Schiff, D-Calif., second from right, speaks during a news conference on Capitol Hill in Washington on Oct. 31, 2019. (AP)", "It didn’t take long after the Democratic-led House of Representatives formalized the impeachment inquiry against President Donald Trump for misinformation to start circulating about the rules of the road.", "One post published Oct. 31 makes three claims about the Democrats’ impeachment resolution: that the rules \"do not allow any witness to be called unless the witness is approved by Adam Schiff,\" \"do not allow involvement of the President’s legal counsel,\" and \"do not allow any witness to be questioned unless the question is approved by Adam Schiff.\"", "\"Welcome to the USSR,\" the post reads.", "The post, which has been shared more than 2,300 times, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "As chair of the Permanent Select Committee on Intelligence, Rep. Adam Schiff, D-Calif., has led the House investigation into a July phone call in which Trump asked the president of Ukraine to investigate the business dealings of former Vice President Joe Biden and his son. A key question is whether Trump held up military and State Department aid in exchange for the Biden probe.", "(Screenshot from Facebook)", "Our research shows that the Facebook post about Schiff’s role is flawed.", "We reached out to Trump Rules, a conservative Facebook page with nearly 150,000 followers, for the source of its post and did not hear back.", "Here’s what you need to know from the House impeachment resolution:", "• Witness requests from ranking minority member Rep. Devin Nunes, R-Calif., must go through Schiff first — but the decision to allow them is not Schiff’s alone.", "• Trump gets counsel during Judiciary Committee hearings, but not during Intelligence Committee hearings. The Judiciary Committee leads official impeachment proceedings in the House, while the Intelligence Committee leads the investigation.", "• The Democrats’ resolution does not require questions of witnesses to first be approved by Schiff.", "The House resolution says requests from members to call witnesses to provide testimony must be submitted in writing to Schiff. They have three days to do that after a hearing is announced. But the Facebook post overreaches in saying that the rules \"do not allow any witness to be called\" without his approval.", "Here’s what the resolution says about the power of members in the minority:", "\"To allow for full evaluation of minority witness requests, the ranking minority member may submit to the chair, in writing, any requests for witness testimony relevant to the investigation described in the first section of this resolution within 72 hours after notice is given for the first hearing designated pursuant to paragraph (1). Any such request shall be accompanied by a detailed written justification of the relevance of the testimony of each requested witness to the investigation described in the first section of this resolution.\"", "That means any request from Nunes for additional testimony must go through Schiff.", "RELATED: PolitiFact's Trump-Ukraine-Biden coverage in one place", "The impeachment resolution says that if Schiff were to refuse a request for additional witnesses, Republicans can bring the matter to a vote by the entire Intelligence Committee.", "There are 22 members of the committee, meaning the ultimate decision to call witnesses would not just come down to Schiff. However, in practice, it’s reasonable to assume that the Democratic majority would vote with Schiff.", "Democrats did not come up with these rules out of thin air. They borrowed from House investigation procedures that Republicans passed in 2015, said Frank Bowman, a law professor at the University of Missouri and an impeachment expert, in an email.", "The claim that the impeachment resolution does not permit Trump a lawyer is only partially accurate — the two House committees leading the inquiry have different rules.", "The first is the Intelligence Committee, which has been investigating Trump’s interactions with Ukraine. Under the House resolution, there is no role for the president’s lawyers to cross-examine witnesses, submit new evidence or provide a formal defense during hearings called by that committee.", "However, the Judiciary Committee, which will assess the Intelligence Committee’s findings, is permitted to carry out its work \"as to allow for the participation of the President and his counsel,\" according to the resolution. And the Judiciary Committee has described a clear role for the president’s counsel in those hearings.", "\"The rules do permit participation by (the president’s) counsel, unless (the president) blocks production of evidence requested by (the) Committee,\" Bowman said.", "The House resolution does not say Schiff must approve all questions during impeachment proceedings.", "RELATED: There’s no evidence Schiff helped write the whistleblower complaint", "Here’s what the rules say about questioning witnesses:", "\"The chair and ranking minority member of the Permanent Select Committee shall be permitted to question witnesses for equal specified periods of longer than five minutes, as determined by the chair. The time available for each period of questioning under this paragraph shall be equal for the chair and the ranking minority member.\"", "Per those rules, Schiff and Nunes will each have the opportunity to question witnesses. The resolution says nothing about Schiff approving Nunes’ questions ahead of time.", "\"The questioning rule seems a complete invention,\" Bowman said.", "A Facebook post claimed impeachment rules passed by House Democrats \"do not allow\" Republicans to call and question witnesses without Schiff’s permission, and that the resolution prohibits the involvement of Trump’s lawyers.", "Requests for additional testimony must go through Schiff, but the decision to ultimately allow them is not his alone. Democrats and Republicans are given equal time to question witnesses, and there’s nothing in the resolution saying Schiff must approve questions. Trump is not permitted counsel during hearings held by the Intelligence Committee, but the same is not true for Judiciary Committee hearings", "The post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Email interview with Frank Bowman, law professor at the University of Missouri, Nov. 7, 2019", "Facebook post, Oct. 31, 2019", "House Judiciary Committee, Impeachment Inquiry Procedures, Oct. 29, 2019", "The New York Times, \"Inside Adam Schiff’s Impeachment Game Plan,\" Nov. 5, 2019", "NPR, \"House Passes Resolution Formalizing Impeachment Inquiry,\" Oct. 31, 2019", "PolitiFact, \"How would an impeachment inquiry against Donald Trump work?\" Sept. 24, 2019", "PolitiFact, \"Nancy Pelosi overstates Republican gains in impeachment process,\" Nov. 4, 2019", "PolitiFact, \"Timeline: The Trump impeachment inquiry,\" Oct. 3, 2019", "U.S. Congress, H. RES. 660, Oct. 29, 2019", "U.S. House Permanent Select Committee on Intelligence, Majority Members", "U.S. House Permanent Select Committee on Intelligence, Minority Members", "U.S. House of Representatives, Rules of the House of Representatives, Jan. 6, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]