["On June 16, 2020, the Tanzanian leader dissolved parliament ahead of elections due in October 2020 as per the constitution, which requires that the 393-seat legislature be dissolved ahead of the polls. In a two-hour speech, Magufuli also detailed his government’s actions since he was elected five years ago.", "A Facebook post circulating in Tanzania and written in Swahili -- which was shared more than 1,200 times and garnered more than 3,000 comments -- made a number of bogus claims.", "“YouTube has announced that more than 600 million people globally followed the live speech of president Magufuli as he dissolved Tanzania's Parliament,” it reads.", "It claims that “more than 80 countries and 50 heads of state were online following the speech”, including US President Donald Trump, Russian President Vladimir Putin and British Prime Minister Boris Johnson, who apparently “halted government business for five hours until the address was over”.", "The post also claims that a Thai website named Magufuli “the best 21st-century president” and that a British political magazine “described him as a development genius and problem solver”.", "Similar posts were shared here, here and here.", "In the comments, some online readers appeared to believe the claims while others cast doubts.", "A search of Magufuli’s speech on YouTube with the Swahili keywords “Magufuli avunja bunge” (Magufuli dissolves parliament) and the filter restricted to the past week reveals a dozen videos that were live-streamed on June 16, 2020. The video of the speech with the highest amount of viewership garnered about 158,000 views, far below the 600 million views claimed on the post.", "A spokeswoman for Google, which owns YouTube, confirmed to AFP Fact Check that the video-sharing platform has not made any such announcement.", "“We do not make it a habit of releasing concurrent views (the number of viewers watching a live stream, editor's note),” Dorothy Ooko, Google’s Head of Communications & Public Affairs in Africa, told AFP Fact Check in an email.", "No halting of UK government business", "AFP Fact Check found no reports in reputable British and international media about Prime Minister Boris Johnson shutting down government business to watch the speech. A search on UK government sites and on Johnson’s official Twitter account did not reveal any directive to close government business.", "Following searches in both English and Thai, AFP Fact Check found no evidence to support the claim that “a Thai website” and “UK magazine” named the Tanzanian leader “the best 21st-century president” or a “development genius”.", "President of Tanzania since 2015, Magufuli has steered away from international protocol recommended to tackle the coronavirus pandemic, prompting Tanzanian newspapers to falsely claim that his policies have been applauded by the World Bank. AFP Fact Check debunked the claims here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]