["“Once the herd accepts forcible mandatory vaccination, it’s game over! They will accept anything -- forcible blood or organ donation -- for the ‘greater good,’” posts such as this one quote the former diplomat, who remains a major figure on US foreign policy matters, as saying.", "The claim appears to have first surfaced in 2019 but posts making it continue to circulate on social media, gaining fresh traction in March 2020. All involve memes of Kissinger, a former US secretary of state, and some say he made the speech to the World Health Organization Council on Eugenics on February 25, 2009.", "Posts were shared as recently as April 3, 2020, as well as here and here.", "“It is a complete fabrication,” Courtney Glick, an assistant to Kissinger at New York-based global advisory firm Kissinger Associates, told AFP in an email.", "Eugenics is the study of human population control and techniques to reproduce characteristics that the movement’s advocates consider desirable. However, there is no such entity as the World Health Organization Council on Eugenics, nor has there ever been.", "A search of Kissinger’s speeches and interviews from public records as well as his personal archives found no remarks made on February 25, 2009. Nor are there any media reports of him addressing the topics mentioned in the posts.", "He did speak at the 45th Munich Security Conference, on February 6, 2009, but his main topic was nuclear proliferation, not any of the subjects cited in the posts shared on Facebook.", "AFP Fact Check found dozens of Facebook posts citing the alleged speech from 2009.", "However, some users date the remarks to 1974 and a report by Kissinger on world population growth. The paper was declassified by the White House in 1989. It does not make any of the suggestions the posts claim Kissinger wanted.", "Years of campaigns by anti-vaccination groups are among reasons given by health experts for a rise in some disease infections. The World Health Organization has said that measles cases, for example, have surged in recent years.", "“Control sheep minds and you control the herd,” the posts about Kissinger claim he said. “Vaccine makers stand to make billions, and many of you in this room are investors. It’s a big win-win.”", "The more recent posts coincide with the global spread of the novel coronavirus and the push among scientists for a vaccine, which may explain the spike in claims that Kissinger made the speech.", "On March 4, 2020, AFP Fact Check debunked claims pushed on social media by anti-vaccine advocates that falsely represented a photograph from a British diabetes awareness poster to say that newborns received an outsized number of vaccine injections in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]