["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Election challengers observe as ballots are counted at the central counting board on Nov. 4, 2020, in Detroit. (AP)", "While the Georgia secretary of state has ordered a hand recount of the presidential race, the same cannot be said for Michigan — despite what you may have seen on social media.", "\"BREAKING NEWS: Michigan Judge Kenny orders HAND RECOUNT by an INDEPENDENT COMMISSION in the state of Michigan, following hard evidence of voting fraud by Detroit City Election Commission,\" says a Nov. 10 post shared more than 1,600 times.", "The post, which is a screenshot of a now-deleted tweet from someone named Joel Fischer, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Since Election Day, Michigan has been the subject of numerous false or unproven claims about voter fraud. And this one fits that mold: A hand recount has not been ordered in Michigan.", "\"That is made up,\" said Tracy Wimmer, director of media relations for Michigan Secretary of State Jocelyn Benson.", "Under Michigan law, a recount is triggered if there is a vote differential of 2,000 or less. As of Nov. 11, unofficial results showed that Biden leads Trump in the state by more than 146,000 votes.", "While the Trump campaign has said it will call for a recount in neighboring Wisconsin, it has not said the same for Michigan. One complaint filed in Wayne County, home of Detroit — and cited in a Trump campaign lawsuit — alleges voter fraud and calls for a recount. (There is no evidence of widespread voter fraud in Michigan.)", "Timothy M. Kenny, chief judge of the Third Judicial Circuit Court, has not ruled on the case — nor has he called for a hand recount.", "\"Judge Kenny hasn’t ruled on anything in the Costantino case — the hearing hasn’t even happened yet,\" Wimmer said.", "The Facebook post is inaccurate. We rate it False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Associated Press, \"Biden narrowly wins Wisconsin; Trump to call for a recount,\" Nov. 5, 2020", "CBS News, \"Georgia secretary of state announces hand recount of presidential race,\" Nov. 11, 2020", "Detroit Free Press, \"Michigan was a hotbed for election-related misinformation: Here are 17 key fact checks,\" Nov. 9, 2020", "Email from Tracy Wimmer, director of media relations for Michigan Secretary of State Jocelyn Benson, Nov. 11, 2020", "Facebook post, Nov. 10, 2020", "MICHIGAN ELECTION LAW (EXCERPT), Act 116 of 1954", "Michigan Secretary of State Jocelyn Benson, 2020 Michigan Election Results, accessed Nov. 11, 2020", "MLive, \"Election recount, legal challenges unlikely to overturn Biden’s win in Michigan,\" Nov. 9, 2020", "The New York Times, \"The Times Called Officials in Every State: No Evidence of Voter Fraud,\" Nov. 10, 2020", "PolitiFact, \"List does not show over 14,000 dead people cast ballots in Michigan’s Wayne County,\" Nov. 7, 2020", "WXYZ-TV, \"Trump campaign to file another lawsuit in Michigan citing 'unlawful vote counting,’\" Nov. 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]