["About this rating", "Shortly before the 2016 presidential election, the web site The Good Lord Above published an article reporting that Ivanka Trump had disavowed her father, Republican presidential nominee Donald Trump:", "Holding a press conference one day before the 2016 election, Ivanka Trump publicly disavowed her father, Republican presidential nominee Donald Trump today.", "“It is with great determination that I must officially disavow my father’s presidential campaign today,” said Ivanka Trump. “Before this campaign I was not fully aware of who my father was. Looking back now, the things he has said and done throughout his life are totally unconscionable.”", "“If it’s possible to know your father and not really know him at all, that describes my situation. My father is clearly not qualified to be president. By now that much should be obvious to anyone with a halfway working brain. If he was a contestant on the Celebrity Apprentice he would get fired in the first week. He is not a smart man.”", "There was no truth to this story.  The Good Lord Above is a satirical web site that does not publish factual stories:", "Thou shalt remember that The First Amendment protects satire as a form of free speech and expression. TheGoodLordAbove uses invented names in all of its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental. TheGoodLordAbove is not intended for readers under 18 years of age.", "The Good Lord Above has previously published fabricated articles about a flooded Noah's Ark theme park, the Dalai Lama converting to atheism, and Donald Trump's calling Jesus Christ a loser.", "In reality, Ivanka Trump was actively campaigning for her father the day before the presidential election.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]