["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Kamala Harris suggested President Trump's trade policy would cause hundreds of thousands of auto workers to lose their jobs.", "Democratic presidential candidate Kamala Harris recently attacked President Donald Trump over his trade policy, saying it is hurting American workers.", "The California senator then said as many as \"300,000 auto workers\" were expected to lose their jobs this year, suggesting Trump was to blame.", "\"Donald Trump betrayed a lot of people. He came in office, making all kinds of promises to working people, from farmers to auto workers,\" Harris said in a CNN interview on Aug. 12. \"He said he was going to help working people, and it is estimated that as many as 300,000 auto workers may be out of a job before the end of the year.\"", "Trump’s trade policy, especially the tariffs he’s placed on China, have been blamed by economists for hurting farmers. But are \"as many as 300,000 auto workers\" really expected to lose their jobs by the end of this year as Harris claimed?", "Two recent fact-checks called that figure into question. We’ll review the facts and place a rating on the senator’s claim.", "Checking the facts", "After the interview, Harris’ campaign told CNN the 300,000 number is from a February study by the Center For Automotive Research, CAR.", "The research group examined the impact of a 25 percent tariff Trump proposed on all imported cars and auto parts except on Canada, Mexico and South Korea. It estimated that between about 70,000 jobs and 367,000 jobs would be lost across all sectors of the U.S. economy, but not specifically among autoworkers, under a \"worst-case scenario.\" In May, Trump delayed for six months his decision on whether to impose the tariffs.", "Kristin Dziczek, vice president of industry, labor & economics at the research center, or CAR, told FactCheck.org in an email: \"300,000 auto workers out of a job before the end of the year is NOT what CAR is projecting.\" FactCheck.org added that Dziczek confirmed the figure was an estimate for \"job loss across the economy\" one year after several proposed and implemented trade policies on the auto industry went into effect.", "Auto workers produce vehicles at Volkswagen's U.S. plant in Chattanooga, Tenn. in 2017. (AP Photo/Erik Schelzig)", "The CAR report did not specify how many of the up to 367,000 job losses would come from the auto industry. Dziczek told CNN \"the (auto) sector is starting to shrink,\" but she added that a rapid loss of 300,000 autoworker jobs \"would be orders of magnitude worse than what we're expecting to see.\"", "The only industry specific estimate was for 77,000 job losses at car dealerships. Dziczek told PolitiFact California there would \"an overall net loss\" in auto assembly and parts sectors.", "\"How big of a loss depends on how willing consumers would be to switch brand preference from imports to vehicles made in the United States,\" she wrote in an email.", "FactCheck.org described Harris’ claim as \"wrong,\" while CNN said it was \"false.\"", "Harris’ campaign did not respond to our request for comment, including whether the senator has corrected, or plans to correct, her statement.", "Our ruling", "Sen. Kamala Harris claimed that \"as many as 300,000 auto workers\" may lose their jobs by the end of this year.", "She relied on a study that predicted, in a worst-case scenario, that between 70,000 jobs and 367,000 jobs could be lost across all sectors of the U.S. economy, but in no way all from the auto industry. The losses would take place one year after President Trump imposes a proposed 25 percent tariff on imported cars and auto parts.", "Trump has delayed his decision on those tariffs until later this year, meaning the one-year later impact would not be felt until well into 2020, and not by the end of this year as Harris said.", "Harris’ claim far overestimates potential job losses for the auto industry, the timing of them and ignores the fact that no decision has been made on the tariffs.", "We rated her claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "CNN.com, Fact check: Kamala Harris makes false claim about Trump and auto jobs, Aug. 14, 2019", "CNN.com, transcript of Kamala Harris interview, Aug. 12, 2019", "FactCheck.org, Harris Wrong on Autoworker Jobs, Aug. 14, 2019", "Kristin Dziczek, vice president of industry, labor & economics, Center For Automotive Research, email exchange, Aug. 20, 2019", "Center For Automotive Research, U.S. Consumer & Economic Impacts of U.S. Automotive Trade Policies, February 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]