["About this rating", "On 1 March 2017, a Reddit user posted a picture of two lions bearing manes and a caption indicating that five \"lionesses in Botswana have grown manes, developed a deeper roar to defend off rivals and even fight for territory\":", "This is a factual statement. Though rare, the phenomenon of female lions growing manes and exhibiting other masculine traits has been documented both in the wild and in captivity. The specific group of lions in Botswana discussed in the Reddit thread is the most thoroughly documented example of the phenomenon, with a two-year observational study of these lions having been published in the African Journal of Ecology on 24 August 2016. New Scientist later recounted that report’s context and findings:", "Male lions are distinguished by their mane, which they use to attract females, and they roar to protect their territory or call upon members of their pride. Females lack a mane and are not as vocal.", "But sometimes lionesses grow a mane and even behave a bit like males. However, until now, reports of such maned lionesses have been extremely rare and largely anecdotal. We knew they existed, but little about how they behave.", "The researchers collected data on five lionesses that had developed manes in Botswana’s Okavango Delta. In addition to the physical appearance of a mane, the researchers also documented behavioral differences, including vocal calls and scent-marking behavior more typical of males. Lead author Geoffrey D. Gilfillan, a researcher at the University of Sussex, observed these changes in the primary target of observations, a maned female with the ID SaF05:", "“While SaF05 is mostly female in her behaviour — staying with the pride, mating males — she also has some male behaviours, such as increased scent-marking and roaring, as well as mounting other females.", "Although females do roar and scent-mark like males, they usually do so less frequently “SaF05, however, was much more male-like in her behaviour, regularly scent-marking and roaring.”", "Despite the frequent copulation, however, SaF05 never once became pregnant — an observation that led the researchers to speculate that the behavioral and physical changes were associated with infertility.", "A photograph from Botswana of what appeared to be two male lions mating went viral in April 2016, but this photo was later determined to have captured a lion and a maned lioness mating. In discussing that photograph in National Geographic, Luke Hunter, president of the big-cat conservation group Panthera, suggested it was possible the development of maned lionesses could be either genetic or a fetal development:", "The genetic contribution of the sperm — which determines the sex of the fetus in most mammals — [could be] aberrant, giving rise to a female with some male characteristics.", "Alternatively and perhaps more likely, the problem may have occurred during gestation if the fetus was exposed to increased levels of androgens—male hormones such as testosterone.", "Testosterone is likely a big part of the story. As noted in New Scientist, a captive lioness at the National Zoological Gardens of South Africa developed a mane back in 2011 that disappeared after her testosterone levels were corrected. Infertility, the story pointed out, is a side effect of elevated testosterone in females as well.", "While it is unclear what specifically causes the elevated testosterone, Lead author Gilfillan also thinks the cause is likely genetic:", "Given all five known maned females [in the wild] come from the Okavango region, there must be a genetic component in this population underlying the phenomenon.", "According to New Scientist, this is not an active area of research — so it may be some time before we have more answers about the origin of the phenomenon.", "Tordiffe, Adrian.   \"The Intriguing Case of Emma the Lioness.\"\r\n    National Zoological Gardens of South Africa Newsletter.   May 2013.", "Gilfillan, Geoffery D. et al.   \"Rare Observation of the Existence and Masculine Behaviour of Maned Lionesses in the Okavango Delta, Botswana.\"\r\n    African Journal of Ecology.   24 August 2016.", "Gruber, Karl.   “Five Wild Lionesses Grow a Mane and Start Acting Like Males.\"\r\n    New Scientist.   23 September 2016.", "Dell’Amore, Christine.   “No, Those Aren't Male Lions Mating. One Is Likely a Female.\"\r\n    New Scientist.   18 April 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]