["About this rating", "In late November 2019, the Alex Jones conspiracy trolling site Infowars posted an article originally published by junk news site Natural News that falsely reported the state of Virginia will consider legislation outlawing martial arts and firearms instruction.", "Under the headline, \"PROPOSED VIRGINIA LAW WOULD OUTLAW KRAV MAGA, BRAZILIAN JIU JITSU, KICKBOXING, TAI CHI, FIREARMS INSTRUCTION AND SELF-DEFENSE TRAINING,\" the story reads:", "The law would instantly transform all martial arts instructors into criminal felons. This includes instructors who teach kickboxing, BJJ, Krav Maga, boxing and even Capoeira.", "It would also criminalize all firearms training classes, including concealed carry classes.", "It would even criminalize a father teaching his own son how to use a hunting rifle.", "None of this is true, and oddly enough, the story in question includes not only a link to the bill but copy-and-pasted bill language, so readers can see for themselves that the proposed legislation does not say what Natural News claimed it said.", "Virginia, like nearly all other U.S. states, already had a law on the books restricting unlawful private military-type activity. The current Virginia law renders it a felony if a person:", "1. Teaches or demonstrates to any other person the use, application, or making of any firearm, explosive or incendiary device, or technique capable of causing injury or death to persons, knowing or having reason to know or intending that such training will be employed for use in, or in furtherance of, a civil disorder; or", "2. Assembles with one or more persons for the purpose of training with, practicing with, or being instructed in the use of any firearm, explosive or incendiary device, or technique capable of causing injury or death to persons, intending to employ such training for use in, or in furtherance of, a civil disorder.", "Senate Bill 64 would amend the current law by also making it illegal to, \"[Assemble] with one or more persons with the intent of intimidating any person or group of persons by drilling, parading, or marching with any firearm, any explosive or incendiary device, or any components or combination thereof.\" The amendment makes no mention of martial arts or firearms classes.", "As the Georgetown Law Institute for Constitutional Law and Protection noted, Charlottesville, Virginia, in 2017 was the site of deadly violence resulting from a white supremacist rally at which:", "Several white nationalist groups arrived outfitted in helmets and matching uniforms and deployed shields, batons, clubs, and flagpoles as weapons in skirmishes with counter-protestors that the instigating groups coordinated under centralized command structures. Meanwhile, private militia groups—many dressed in camouflage fatigues, tactical vests, helmets, and combat boots, and most bearing assault rifles—stood guard as self-designated protectors of the protestors and counter protestors. The heavily armed presence and coordinated paramilitary activities of all of these groups not only increased the prevalence of violence at the rally, but also made it more dangerous for state and local law enforcement to maintain public safety. Moreover, the attire and behavior of some of the self professed militia led to confusion as to who was authorized to lawfully keep the peace.", "Although Natural News chalked this amendment up to the fact that voters in November 2019 handed Virginia's state government over to a Democratic majority for the first time in a generation, that characterization is misleading.", "The bill's sponsor, Louise Lucas, is a Democrat, but Lucas is not part of the new Democratic legislative majority; she assumed her Virginia Senate seat in 1992. Furthermore, as we earlier noted, almost all states in the U.S., with both Democratic and Republican leadership, have some type of law outlawing certain paramilitary activities or at least restricting unauthorized private militias. Virginia's law predates its new Democratic state majority.", "Finally, the laws don't make it illegal for martial arts or shooting-range instructors to teach students disciplines like \"krav maga, Brazilian jiu jitsu, kickboxing, tai chi\" or \"firearms instruction.\" The laws restrict people from various military-like activities that result in violence and civil disorder. The amendment to the Virginia law, specifically, prohibits marching with weapons or explosives for the purpose of intimidation. We therefore rate this claim \"False.\"", "Georgetown Law, Institute for Constitutional Advocacy and Protection. \"Prohibiting Private Armies at Public Rallies.\"\r\n  February 2018.", "Gabriel, Trip. \"Virginia Election: Democrats Take Full Control of State Government.\"\r\n  The New York Times. 5 November 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]