["About this rating", "On Jan. 6, 2021, a pro-Trump mob overwhelmed law enforcement and breached the U.S. Capitol, leading to a delay in the certification of the 2020 presidential election and the evacuation of senators, representatives, staff, and journalists from both chambers of Congress. Officers drew their weapons and fired shots as rioters smashed through windows in an attempt to enter the House chamber. One woman was shot, and later died.", "After order was restored to the Capitol, D.C. Police Chief Robert Conte held a news conference providing a first report on the day's casualties. Four people, including the woman who was shot, had died. This number would rise to five by the week's end.", "\"One adult female and two adult males appear to have suffered from separate medical emergencies, which resulted in their deaths,\" Conte said.", "At the time of this reporting, the identities of these four individuals has been publicly confirmed by law enforcement.", "The Washington Post and other outlets had previously identified the woman who was shot as 35-year-old Ashli Babbitt, describing her as \"a California native and Air Force veteran [who] had used her social media to express fervent support for President Trump and echo many of the president’s conspiracy theories and false claims of mass voter fraud.\" This fact was confirmed by Conte during a press conference the following day.", "At that second press conference, Conte identified the other three fatalities as well: Benjamin Phillips, 50, from Greentown, Pennsylvania; Kevin Greeson, 55, from Athens, Alabama; and Roseanne Boyland, 34 of Kennesaw, Georgia. According to reporting from Alabama.com, Greeson's son said his father died of a heart attack.", "There were unconfirmed reports, echoed by at least one journalist who was on the ground (who later deleted the tweet), that one of the adult males included in this tally died of a heart attack after accidentally tasing himself. Snopes has determined that although one man did die of a heart attack, reports that a taser was involved were false.", "On Jan. 8, 2021, the Associated Press confirmed a fifth death: that of Capitol Police officer Brian Sicknick, who died \"from injuries suffered during the riot,\" AP reported. However, a medical examiner's report released in April 2021 said Sicknick suffered strokes and died of natural causes.", "Update [11 January 2021]: Updated title and claim to read \"five\" as opposed to \"four,\" added information about Officer Sicknick, and provided new information regarding an alleged taser-related heart attack.", "Update [May 21, 2021]: Updated to note that the medical examiner's report released in April 2021 said Sicknick suffered strokes and died of natural causes.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]