["About this rating", "In May 2019, a cluster of news reports and social media postings asserted legislators in the state of Georgia had passed a law that could subject women to significant prison sentences for having abortions or miscarriages.", "On 7 May, for example, Slate published an article with the headline \"Georgia Just Criminalized Abortion. Women Who Terminate Their Pregnancies Would Receive Life in Prison,\" reporting that:", "Georgia Republican Gov. Brian Kemp signed a 'fetal heartbeat' bill that seeks to outlaw abortion after about six weeks. The measure, HB 481, is the most extreme abortion ban in the country — not just because it would impose severe limitations on women’s reproductive rights, but also because it would subject women who get illegal abortions to life imprisonment and the death penalty.", "... HB 481 would also have consequences for women who get abortions from doctors or miscarry. A woman who seeks out an illegal abortion from a health care provider would be a party to murder, subject to life in prison. And a woman who miscarries because of her own conduct — say, using drugs while pregnant — would be liable for second-degree murder, punishable by 10 to 30 years’ imprisonment. Prosecutors may interrogate women who miscarry to determine whether they can be held responsible; if they find evidence of culpability, they may charge, detain, and try these women for the death of their fetuses.", "A viral tweet posted by Alexis Isabel claimed that the law had \"imposed life imprisonment and possibly the death penalty for women who obtain abortions or miscarry\":", "So not only has Georgia just criminalized abortion, but they have imposed life imprisonment and possibly the death penalty for women who obtain abortions or MISCARRY. This is an extreme, terrifying and imhumane attack on human rights and EVERYONE should be up in arms about this.", "— alexis isabel (@lexi4prez) May 8, 2019", "Some commentators also claimed that House Bill (H.B.) 481 had also made it an offense for a woman to travel to another state to obtain an abortion:", "One of the many terrifying parts of the Georgia abortion bill is that they will prosecute women who leave the state to get an abortion where it is otherwise legal. This law follows people out of the state. This is codifying residents, specifically women, as property of the state.", "— T-Rex (@PhillyTRex) May 9, 2019", "On 7 May, Georgia's Republican Gov. Brian Kemp signed into law HB 481, the Living Infants Fairness and Equality (LIFE) Act. Its provisions will go into effect on 1 January 2020, barring a successful legal challenge.", "The bill was first proposed in the Georgia House of Representatives on 25 February by Republican members Ed Setzler, Jodi Lott, and Darlene Taylor. The House passed the bill on 7 March, the Georgia Senate followed suit on 22 March, and both chambers passed the reconciled version of the legislation on 29 March, forwarding it for Kemp's signature.", "The bill introduces several changes in Georgia law, the most significant of which is that it codifies an \"unborn child with a detectable human heartbeat\" as a living person with rights, stating that \"It shall be the policy of the State of Georgia to recognize unborn children as natural persons.\"", "Fetal heartbeat", "The bill outlaws abortion when a fetal heartbeat is detected. This can happen as early as six weeks into a pregnancy, meaning HB 481 would effectively prohibit many abortions that would otherwise be carried out in Georgia. \"No abortion is authorized or shall be performed if an unborn child has been determined ... to have a detectable human heartbeat.\" The legislation outlines the following exceptions to this prohibition:", "HB 481 also amends Georgia's \"Woman's Right to Know\" (informed consent) law by requiring that, 24 hours before an abortion is scheduled to be carried out, a woman must be informed that a fetal heartbeat has been detected, along with the existing requirements to inform her of the gestational age of the fetus, as well as the medical risks of both terminating and carrying the pregnancy to term.", "The law also requires that a doctor check for the presence of a fetal heartbeat before performing any abortion, except in cases of medical emergency or a medically futile pregnancy.", "Notably, HB 481 does not state that a woman who self-induces an abortion, under the law, be regarded as having committed murder and therefore liable to prosecution for murder and, upon conviction, life imprisonment or execution.", "HB 481 also does not state that a woman who miscarries as a result of her own actions would be prosecuted for second-degree murder.", "These claims, made by Slate and others, are therefore not statements of fact or a description of provisions that are explicitly outlined in the text of HB 481. Rather, they are inferences drawn from the legislation's recognition of an unborn fetus as a person and its expanded definition of abortion. If HB 481 declares an unborn fetus to be a person, the argument goes, then it must follow that Georgia law will, after the bill is implemented, treat intentionally ending the life of an unborn fetus as murder, recklessly ending the life of a fetus as second-degree murder, and so on.", "However, significant disagreement exists over what the legal effects and consequences of HB 481 might end up being. So we consulted Ronald L. Carlson, a former trial lawyer and the Fuller E. Callaway Chair of Law Emeritus at the University of Georgia School of Law, who has carefully followed the progress of HB 481.", "Could a woman be prosecuted for having an abortion?", "Speaking from his office in Athens, Georgia, Carlson challenged the certainty of claims that HB 481 would cause women to be prosecuted and convicted for having abortions, although he emphasized that the full implications and consequences of the law would need to be resolved in court, \"sooner rather than later.\"", "Georgia currently prohibits \"criminal abortion\" (16-12-140 in the Georgia Code). The law states the following:", "\"(a) A person commits the offense of criminal abortion when, in violation of Code Section 16-12-141, he or she administers any medicine, drugs, or other substance whatever to any woman or when he or she uses any instrument or other means whatever upon any woman with intent to produce a miscarriage or abortion.", "(b) A person convicted of the offense of criminal abortion shall be punished by imprisonment for not less than one nor more than ten years.\"", "Carlson highlighted the \"third person\" dynamic of this law — a criminal abortion entails an individual's administering a substance \"to any woman\" or using an instrument \"upon any woman\" with the goal of inducing a miscarriage or abortion. The legal status quo in Georgia law, he told us, means that it is not women who undergo abortions who are liable to be prosecuted for criminal abortion, but rather the doctors, nurses, and so on who perform and participate in criminal abortions.", "This precedent was cemented in the 1998 case Hillman vs. the State, Carlson told us, in which the Georgia Court of Appeals overturned the conviction of an 18-year-old woman who shot herself in the abdomen while eight months pregnant, causing the death of the fetus she was carrying. The woman was convicted under Georgia's 16-12-140 criminal abortion statute in Walton County Superior Court, but the Court of Appeals overturned that conviction, declaring that \"This statute is written in the third person, clearly indicating that at least two actors must be involved ... By its plain meaning, OCGA § 16-12-140 does not criminalize a pregnant woman's actions in securing an abortion, regardless of the means utilized.\"", "Carlson told us that because HB 481 did not amend 16-12-140, Georgia's criminal abortion statute, it was \"very likely\" that the precedent set in Hillman would remain the status quo, but he noted that any ambiguity surrounding the new legislation could embolden prosecutors to attempt to charge a woman in her own abortion anyway: \"Even though the punishment hasn't been prescribed ... in order to prosecute the woman, that doesn't mean that an aggressive [District Attorney] somewhere will not bring a charge against a woman, just to test this out.\" However, Carlson added, his understanding was that the \"thrust of the law\" still leaned towards protecting the woman from a criminal abortion prosecution.", "The ambiguity to which Carlson alluded could come in the form of the second part of Georgia's \"criminal abortion\" law, as contained in Section 16-12-141 of the Georgia Code, which sets out in detail what constitutes a criminal abortion. This is the section of the law that HB 481 did amend, declaring that, with certain exceptions, \"No abortion is authorized or shall be performed if an unborn child has been determined ... to have a detectable human heartbeat.\"", "However, HB 481 also amended 16-12-141 by including a definition of abortion that, some observers have speculated, could leave women vulnerable to criminal abortion prosecution for inducing their own abortions.", "In Slate, Mark Joseph Stern wrote that \"HB 481 redefines abortion to be 'the act of using, prescribing, or administering any instrument, substance, device, or other means with the purpose to terminate a pregnancy.' That means abortion includes something one person does to herself. A woman who takes misoprostol to induce miscarriage is 'administering' a 'substance' to 'terminate a pregnancy' and is therefore liable under the law.\"", "Stern is right to point out that HB 481 inserts into 16-12-141 the following definition of abortion: \"'Abortion' means the act of using, prescribing, or administering any instrument, substance, device, or other means with the purpose to terminate a pregnancy with knowledge that termination will, with reasonable likelihood, cause the death of an unborn child ...\"", "Viewed in isolation, this definition might suggest that a woman who self-administered abortifacients such as misoprostol and mifepristone after the detection of a fetal heartbeat could be regarded as having performed a criminal abortion. However, Section 16-12-140 still retains the \"third person\" dynamic highlighted in the Court of Appeals ruling in Hillman vs the State, even if the actions in question are deemed to have been \"in violation of Code Section 16-12-141.\"", "Section 140 states: \"A person commits the offense of criminal abortion when, in violation of Code Section 16-12-141, he or she administers any medicine, drugs, or other substance whatever to any woman or when he or she uses any instrument or other means whatever upon any woman with intent to produce a miscarriage or abortion.\"", "It is also worth remembering what the Court of Appeals wrote in their Hillman ruling: \"16-12-140 does not criminalize a pregnant woman's actions in securing an abortion, regardless of the means utilized\" (emphasis added). However, it remains an open question whether 16-12-141, soon to contain HB 481's new definition of abortion, could \"criminalize a pregnant woman's actions in securing an abortion.\"", "Could HB 481 lead to murder convictions for abortions?", "\"Declaring [fetal] personhood, as the heartbeat bill did, does carry significant legal implications,\" Carlson told us, adding that the question of whether performing an abortion could be charged as murder was \"ripe for court interpretation\": \"With the declaration of [fetal] personhood, could, again, an aggressive prosecutor make a successful murder charge? ... There are strongly differing views on that,\" he said.", "Asked whether HB 481's declaration that an unborn child is a person with rights could lead to an interpretation of the law whereby any and all abortion — intentionally ending the life of a fetus — could be treated as murder, Carlson told us: \"I think that argument is going to be made by a [District Attorney] who wants to pursue strongly punishments under the bill. And I think that's why we probably need some court clarification, sooner rather than later, on whether the bill does raise that possibility.\"", "Carlson noted that one of HB 481's authors, Republican State Rep. Ed Setzler, had indicated it was not the intention of the law's authors to bring about murder prosecutions, but rather prosecutions for criminal abortions in circumstances where abortions were performed after the detection of a fetal heartbeat.", "In examining HB 481, Carlson said, a court would take into account the legislative history of the law and could note, as Setzler has publicly stated, that the intention of the authors of the legislation was not to see murder charges brought as a result of their bill. However, Carlson noted, that might not be a deciding factor in the court's deliberations.", "Could HB 481 lead to convictions for miscarriages?", "The text of the legislation provides several exceptions to its relatively expansive definition of abortion, one of which is as follows: \"If the act is performed with the purpose of ... removing a dead unborn child caused by spontaneous abortion [miscarriage].\"", "In other words, actions that would otherwise be treated as characteristic of an abortion would not be treated in that way in the event a woman had already unintentionally miscarried. This text provides a certain level of protection from prosecution for women who have accidentally miscarried.", "The argument that, under HB 481, women could face criminal prosecution for a miscarriage is essentially an extension of the argument relating to murder examined in the previous section of this article. If, under HB 481, Georgia law regards an unborn child as a person, the argument goes, then anyone who acts recklessly (if not intentionally) in a way that leads to the death of an unborn child could be prosecuted for second-degree murder.", "As Stern wrote for Slate, \"A woman who causes her own miscarriage from drinking or drugs may have committed second-degree murder (penalty: 10 to 30 years in prison) ...\"", "We asked Carlson whether it was possible, given the new declaration of fetal personhood, that a woman could face a second-degree murder prosecution in the event that she suffers a miscarriage that appeared to have been caused by her reckless actions, such as drug abuse. He replied: \"I think the odds are in favor of protection of the woman in that situation, but it's certainly possible and not out of the question.\"", "Could HB 481 lead to convictions for women who seek abortions outside Georgia?", "In his analysis of the legislation, Stern claimed that HB 481's assertion of fetal personhood could also leave women open to prosecution for conspiracy to murder if they seek to obtain abortions outside the state of Georgia. He wrote:", "\"Even women who seek lawful abortions out of state may not escape punishment. If a Georgia resident plans to travel elsewhere to obtain an abortion, she may be charged with conspiracy to commit murder, punishable by 10 years’ imprisonment. An individual who helps a woman plan her trip to get an out-of-state abortion, or transports her to the clinic, may also be charged with conspiracy. These individuals, after all, are 'conspiring' to end of the life of a 'person' with 'full legal recognition' under Georgia law.\"", "Prof. Carlson challenged this assessment, writing in an email:", "\"Under most cases, the object of a conspiracy must be a 'crime' in order for the mother's actions to violate conspiracy law. 'The essence of the offense of conspiracy is an agreement to pursue a criminal objective.' (Kurtz, 'Criminal Offenses and Defenses in Georgia' 224, 2017 ed.). Is the woman aiming to accomplish a criminal objective? Because the woman cannot be punished for an abortion under [Code Section] 16-12-140 [as interpreted in Hillman vs. the State), her effort to go out-of-state to do one would not appear to be an action 'in pursuit of a criminal objective.'", "\"Simply stated, the vast majority of decisions require a punishable, substantive offense to be the object of a person's efforts in order to make her liable for a criminal conspiracy. The Hillman case eliminates that needed element when it declares 'the General Assembly has refused to criminalize a pregnant woman's acts in securing an illegal abortion.'\"", "Carlson's overall conclusion about the potential effects and consequences of HB 481 was: \"There are some very important open questions here, and given the passions on both sides, pro and con, I think it's relatively certain that we're going to get court tests down the road in the near future, on some of these critical issues.\"", "Conclusion", "Ultimately, the potential effects and consequences of HB 481 will have to be adjudicated in court. For its part, the American Civil Liberties Union (ACLU) vowed even before Georgia Gov. Brian Kemp signed the law that the organization would challenge HB 481 in court.", "The arguments made by Stern and others certainly have merit, and as Carlson points out, the legislation's declaration of fetal personhood \"carries significant legal implications.\" However, some observers have made several assertions with a level of certainty that simply is not warranted, at this stage. This includes Slate's headline claim that under HB 481 \"Women Who Terminate Their Pregnancies Would Receive Life in Prison.\" That outcome cannot reasonably be stated as fact, before a court has taken even a preliminary look at HB 481, and before the law has gone into effect.", "Similarly, the claim made by Alexis Isabel in her viral tweet that HB 481 had \"imposed life imprisonment and possibly the death penalty for women who obtain abortions or miscarry\" is an overstatement of the reality.", "In fact, Georgia had declared unborn children to be persons, something that may or may not open up the possibility of murder prosecution against those who intentionally end the life of a fetus, or second-degree murder prosecution for those who act recklessly with the result of ending the life of a fetus. And in order for HB 481 to have the effect of leaving women open to prosecution for self-administering abortifacients, a court would likely have to overturn decades of precedent that have interpreted Georgia law to mean women cannot be criminalized for their own actions in securing abortions.", "Stern, Mark Joseph.   \"Georgia Just Criminalized Abortion. Women Who Terminate Their Pregnancies Would Receive Life in Prison.\"\r\n    Slate.   7 May 2019.", "Setzler, Ed et al.   \"House Bill 481 -- Living Infants Fairness and Equality (LIFE) Act.\"\r\n    Georgia General Assembly.   7 May 2019.", "Georgia Code.   \"Title 16, Chapter 12, Section 140 -- Criminal Abortion\"\r\n    Justia.com.   Accessed 16 May 2019.", "Georgia Code.   \"Title 16, Chapter 12, Section 141 -- Restrictions on the Performance of Abortions; Availability of Records.\"\r\n    Justia.com.   Accessed 16 May 2019.", "Eldrige, Frank M.   \"Hillman vs. the State -- Ruling.\"\r\n    Georgia Court of Appeals.   3 June 1998.", "Stern, Mark Joseph.   \"Why Are Activists on Both Sides Rejecting the Reality of Georgia's Horrific New Abortion Ban?\"\r\n    Slate.   13 May 2019.", "Rankin, Bill.   \"Could Georgia Abortion Law Challenge Roe v. Wade?\"\r\n    The Atlanta Journal Constitution.   26 April 2019.", "The ACLU of Georgia.   \"Statement on Abortion Ban Bill Headed to Governor's Desk.\"\r\n    29 March 2019.", "Updated [21 May 2019]: Added section on the possibility of HB 481's giving rise to prosecutions for conspiracy to murder, including comments from Prof. Carlson.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]