["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump reviews border wall prototypes, Tuesday, March 13, 2018, in San Diego. Evan Vucci / AP Photo", "Amid chants of \"Build the Wall!\" at a recent rally in Nevada, President Trump repeated the claim that construction has \"already started\" on the border wall in California.", "Here’s what Trump said, in context, at the Nevada rally on June 23, 2018:", "\"We have to have strong borders. We’re going to have the (border) wall. We’re gonna have the wall. We’ve already started it ....", "(Audience cheers)", "\"We’ve already started it. You know, we started it in San Diego.\"", "(Audience chants: \"Build that Wall! Build that Wall! Build that Wall!\")", "\"Now we’re gonna have the wall. And we started it. We have $1.6 billion. We’ve started it. We’re fixing it. And we’re building new. And we’re starting it. … We’re getting the wall built.\"", "Has construction really started on Trump’s signature campaign promise: Building \"a big, beautiful wall,\" on the U.S.-Mexico border?", "Trump has made similar statements in the past. In this fact check, we’ll focus on his claim: \"We’ve already started (the border wall). We started it in San Diego.\"", "President Trump made his claim during a rally in Nevada on June 23, 2018.", "Projects at the border", "There are projects underway to replace fencing along the border in San Diego and further east in Calexico. Those call for new and taller, bollard-style barriers, which include a comb-like array of steel posts that border patrol agents can see through, some of which were planned long before Trump ran for office.", "A recent appropriation by Congress of $1.6 billion allows for the replacement of the old fencing, but not for the construction of any sort of concrete wall prototype as Trump requested.", "\"The one thing we don’t fund is the one issue we all campaigned on — a border security wall — and that is not in the legislation,\" Republican Rep. Jim Jordan, founder of the House Freedom Caucus, said of the omnibus bill, according to an April article by FactCheck.org.", "In San Diego, the project underway will replace 14 miles of scrap metal fencing that’s now eight-to-10 feet high with the bollard-style barrier.", "That replacement will be 18-to-30 feet in height and include an anti-climbing plate, according to a U.S. Customs and Border Protection news release announcing the start of construction on June 1, 2018. The press release calls it the third \"border wall construction project,\" which is misleading.", "That’s because none of the projects that have already started will produce the solid, 30-foot high concrete barrier Trump promised during his 2016 presidential campaign. More specifically, they won’t include any of the eight border wall prototype designs ordered by the Trump administration.", "\"... this isn’t Trump’s wall\"", "The same goes for the 2.25-mile barrier replacement project east of San Diego in Calexico.", "\"First and foremost, this isn’t Trump’s wall,\" Jonathan Pacheco, a spokesman for the Border Patrol’s El Centro Sector, which includes Calexico, told the Los Angeles Times in March 2018. \"This isn’t the infrastructure that Trump is trying to bring in. … This new wall replacement has absolutely nothing to do with the prototypes that were shown over in the San Diego area.\"", "Plans for the Calexico project, which also include a bollard-style structure, began in 2009 under the Obama administration and were funded in 2017, under Trump, according to the Times.", "A spokesman for the Border Patrol’s San Diego Sector said they could not specify when planning started for the San Diego project.", "\"These were funded under FY2017 so planning was before or during that time,\" Ralph DeSio, the agency’s San Diego-based spokesman, wrote in an email.", "The White House did not respond to a request for evidence supporting the president’s statement.", "The reality of what’s being built at these sites, and how it differs from Trump’s campaign promise, hasn’t stopped the president from distorting the facts.", "In April, PolitiFact National rated Mostly False Trump’s similar statement: \"We’ve started building the wall.\" It found Trump’s words \"leave the impression that construction is underway for the border wall he promised, and that $1.6 billion is helping pay for it. That’s not the case.\"", "It concluded that \"it’s disingenuous to claim\" the projects underway \"amount to the border wall Trump has long promised.\"", "Our ruling", "President Trump recently claimed: \"We’ve already started (the border wall). We started it in San Diego.\"", "His statement gives the wrong impression that border fence replacement projects in California, including those in San Diego and Calexico, are the same as the solid, 30-foot-high concrete wall he promised during his run for president.", "The $1.6 billion authorized by Congress for these projects does not allow for the construction of any sort of wall prototype requested by Trump.", "Instead, the projects underway include arrays of steel posts, between 18 and 30 feet high, that allow border patrol agents to see through.", "The planning for at least some of these projects, which will replace shorter scrap metal fencing, started long before Trump ran for office. Congress, however, agreed to pay for them under Trump’s administration.", "We also grant that Trump at the Nevada rally added: \"We’re fixing it. And we’re building new.\" This could be interpreted as a slight acknowledgement that the projects aren’t exactly what he promised, but they don’t add much clarity to what overall is a misleading statement.", "We rate Trump’s claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Ralph DeSio, spokesman, U.S. Customs and Border Protection, June 25, 2018", "U.S. Customs and Border Protection,  press release, Border Wall Construction Project Starts in San Diego Sector, June 1, 2018", "U.S. Customs and Border Protection,  press release, Border Wall Replacement Project Starts Near Downtown Calexico, Feb. 21, 2018", "U.S. Customs and Border Protection, Environmental Stewardship Plan For Replacement, Operation and Maintenance of Tactical Infrastructure, U.S. Border Patrol San Diego Sector, June 2018", "FactCheck.org, Has the Border Wall Begun? April 13, 2018", "PolitiFact, Donald Trump wrongly claims border wall is under construction, April 4, 2018", "Los Angeles Times, Trump tweets that his border wall construction has started. It hasn't March 28, 2018", "KPBS, Trump Fact Check: San Diego County Did Not Ask For Border Wall, May 10, 2018", "KPBS, Facts To Know About The Border Wall After VP Pence’s Visit, April 30, 2018", "San Diego Union-Tribune, Border construction begins in San Diego, June 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]