["About this rating", "Some Wendy's customers appeared to be able to purchase Frosty Key Tags, enabling them to receive a free Jr. Frosty with every purchase for all of 2016.", "The Frosty Key Tag was available everywhere; bearers were entitled to a free Frosty without purchase; Wendy's customers can purchase a Frosty Key Tag in 2016 for 2016.", "The scope and specific details of the promotion.", "In January 2016, social media users became interested in rumors stating that for $1, individuals could purchase a key tag at Wendy's entitling customers to free Frostys for the entire calendar year.", "Confusion about the promotion was rife, as evidenced by much of the social media chatter about the Wendy's $1 Frosty Key Tag promotion. Clearly, many users were interested in the deal, but few were able to locate any useful information, even from the official Wendy's Twitter account:", "@Wendys i saw something about a frosty key tag being $1 and free frostys for the year, is this true?", "— Michael LaBeau (@michael17x) January 4, 2016", "@Wendys I want to buy the 2016 Frosty key tag but can't find it at any Wendys in my area. Zip is 08527 — Emanuel J Levy (@MannyLNJ) December 24, 2015", "Others had more luck, in a hit or miss fashion similar to an unrelated, botched Sam's Club promotion:", "Got an @Wendys Jr. Frosty key tag today pic.twitter.com/pNvFS71Hss", "— MaryAnGeorge Blog (@MaryAnGeorge_) December 20, 2015", "We contacted Wendy's media relations department by phone, but were unable to get an answer. We e-mailed that department along with their social media relations team, neither of which replied to our query.", "Wendy's social media accounts didn't feature any information on the promotion, nor did its staff respond to customer questions in any posts we could see. We located a press release dated 30 November 2015, which stated:", "Finding a way to give back this Giving Tuesday, a global day dedicated to giving back, has never been sweeter than with Wendy's® National Frosty® Key Tag Program. Until the end of the year,* customers can buy a Frosty Key Tag for $1 and receive a free Jr. Frosty with every purchase until December 31, 2016.", "*Selling period for Frosty Key Tags is 11/23/2015 through 12/31/2015.", "Whether the promotion was offered at all Wendy's locations, specific participating locations, or was regionally limited remained unclear. We obtained photographs of a 2016 Wendy's Frosty Key Tag, obtained at an unspecified Wendy's location on the West Coast:", "It also was not immediately apparent whether Wendy's sold a limited amount per location, or just restricted the promotion to a certain timeframe. On 6 January 2016 Wendy's provided the following response:", "Thanks for reaching out. We appreciate your support of Foster Care adoption. We did sell a limited supply in December for 2016 and we will begin selling Frosty Key Tags at a later date this year. Be sure to follow us on Facebook, Twitter and Linked In as we will update our fans once we’re ready to sell another supply.", "Wendy's Frosty Key Tag for 2017 was confirmed via the brand's Twitter account in November 2016:", "Grab a $2 Frosty Key Tag today! You get a year’s worth of free Jr. Frosty treats & help find forever homes for kids in foster care. pic.twitter.com/zAdxZyJ6Yo", "— Wendy's (@Wendys) November 30, 2016", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]