["About this rating", "Congresswoman Maxine Waters (D-California), an outspoken critic of President Donald Trump, has frequently been the target of online hoaxes that attempt to paint her lazy and ignorant, such as a fake tweet appearing to blame a terrorist attack on climate change, or an article baselessly accusing the lawmaker of missing 90 percent of her meetings.", "In May 2018, another false rumor about the representative appeared, this time accusing Waters of saying that she plans to impeach Donald Trump if she is elected president of the United States:", "Anderson Cooper: If elected what would your first act as president be?", "Maxine Waters: Well Anderson, I would impeach Donald Trump.", "This is not a genuine exchange between Waters and Cooper. Regardless, the meme was promoted on Twitter by Fox & Friends host Brian Kilmeade on 14 May 2018, who reshared it with the caption \"genius\".", "It's unclear whether Kilmeade was aware that this meme contained a fake quote, or if he cared at all. If he was aware, he made no attempt to inform his followers. As such, many people took him at his word, appearing to believe without any further proof that this had been an actual exchange on CNN:", "The fictional exchange appears to have been written by a Washington Free Beacon reporter named Alex Griswold who posted it to Twitter (most likely in jest) on 11 May 2018. The imaginary interview snippet was then added to a still from an old CNN broadcast which had been digitally altered to include a \"Maxine Waters 2020\" banner.", "In reality, the image comes from an interview that Waters gave on CNN in April 2017 about Bill O'Reilly's sudden departure from Fox News after a series of sexual harassment allegations against (and millions of dollars in settlements from) the former television anchor. The genuine interview has nothing to do with Donald Trump:", ".@MaxineWaters on O'Reilly: \"There's something wrong with him psychologically. ... I hope he seeks some help.\" https://t.co/zDEyMNNAqe", "— Anderson Cooper 360° (@AC360) April 20, 2017", "Emily, Steele.   \"Bill O’Reilly Is Forced Out at Fox News.\"\r\n    The New York Times.   19 April 2017.", "Garcia, Carlos.   \"Maxine Waters: There’s Something 'Psychologically Wrong’ with Bill O’Reilly.\"\r\n    The Blaze.   20 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]