["About this rating", "QuikTrip has long partnered with the separate Safe Place initiative, providing assistance to at-risk youth and runaways.", "QuikTrip and Safe Place are separate entities, and the former's locations do not have \"safe rooms\" or other hidden areas to conceal victims at immediate risk. QuikTrip employees are trained to contact shelters and locate other resources, but they are not necessarily equipped to act as first responders in complex situations involving sex trafficking or domestic violence.", "On 22 May 2016 a Facebook user published the above-reproduced photograph and text, reporting that QuikTrip convenience store chain operates a comprehensive program known as \"Safe Place\" which entails providing secure holding areas for any person in imminent risk of physical harm:", "This sign is posted at every QuikTrip. A \"safe place\" sign signifies that, if you are in any danger (domestic violence, sexual assault, lost children, sex trafficking, any fear for your safety) QuikTrip has a secluded and hidden area you can sit in until help arrives. Simply go in and tell any employee you are in need of a safe place. They are trained not to tell anyone you are there until the authorities arrive.", "Please share this for those who don't know what these signs mean or how they can get out. You never know what someone is going through, and hopefully you will never need to find a safe place... but if so, now you know.", "The post implied that each and every QuikTrip location maintains a \"secluded and hidden area\" in which potential victims of violence could await help while safely secreted away from their attackers. The types of persons purportedly eligible for assistance by QuikTrip encompassed victims (or potential victims) of domestic violence, sex trafficking, or sexual assault, lost children, or anyone in \"any fear for [their] safety.\" In short, readers of that post would likely infer that should they ever find themselves in a  dangerous situation, the could be assured that the nearest QuikTrip location would be equipped to immediately deal with complex and possibly violent afety situations through the use of an on-site safe room.", "QuikTrip's web site mentions the chain's involvement with the separate Safe Place initiative on their \"community\" page. According to that information, the ancillary services offered by QuikTrip are a useful and an integral part of the chain:", "QuikTrip shares a vision of safe neighborhoods and communities. That’s why we’ve partnered with Safe Place to designate our stores as Safe Place sites for at-risk youth.", "Safe Place is a national nonprofit organization that provides safety for troubled or threatened youth. Since 1991, QuikTrip has been a designated Safe Place, where runaways and at-risk youth can come in off the street, receive food and drink, and wait for a volunteer from a Safe Place agency partner to connect them with professional help or a place to stay until their situation is resolved. In addition to our stores being Safe Place sites, QuikTrip provides grants to the local Safe Place agencies.", "We’re grateful for the valuable service Safe Place agencies and their volunteers provide. To learn more about Safe Place, visit nationalsafeplace.org.", "However, QuikTrip's own page highlights their initiative as primarily serving \"at-risk youth\" and does not mention victims of domestic violence, sex trafficking, sexual assault, or anyone currently in fear for their safety. Moreover, the page makes no mention of a QuikTrip outlets' operating hidden or secluded spots wherein those in imminent danger may be safely hidden away from possible attackers, nor their employing specially trained employees equipped to handle complicated situations of impending violence or serious criminal activity.", "We contacted QuikTrip's media relations department to ask about the issue, and a company representative confirmed that QuikTrip indeed participates in the Safe Place initiative, and that participation in that program is part of QuikTrip employee training. He also indicated that the program is primarily geared toward runaways and other minors without homes or safe location at which to stay.", "After discussing the basics of that program we asked about other aspects of the program, primarily those pertaining to more severe criminal activity and people in immediate risk of danger (such as domestic violence or sex trafficking victims). He explained that individuals seeking QuikTrip's Safe Place assistance generally wait \"behind the counter\" with an employee for help to arrive, and no \"hidden and secluded\" areas are available at any QuikTrip locations to hide those being chased by attackers. Moreover, he affirmed that the program specifically targets homeless and at-risk youth, not individuals in imminent danger due to partner violence or human trafficking. The latter class of victims are a concern, as their seeking safety at QuikTrip locations which lack facilities and resources to effectively deal with them could itself lead those persons into harm.", "A December 2014 Dallas Morning News article offers a more accurate description of the services QuikTrip is equipped to provide to at-risk youth, a description that may have served as the basis for the misleading information later circulated via Facebook:", "Plano-based City House is working with QuikTrip locations in Collin and Denton counties, which have the yellow Safe Place signs posted prominently at their stores.", "Youths needing help can go to a QuikTrip 24 hours a day, seven days a week and request help. QuikTrip employees will immediately contact City House, which always has someone on call and available to help. The organization can help youths who are runaways or homeless, who are abused or kicked out of the house, or who are in any unsafe situation.", "Youth can also text the word “SAFE” and their current location (address, city, state) to 69866 for immediate help nationwide. They will be provided with the closest Safe Place location.", "Although the QuikTrip Safe Place Facebook post includes some truthful and helpful aspects of QuikTrip's involvement with the Safe Place program, the myriad inaccuracies it contains means those who take it literally might inadvertently be placed at further risk. It isn't true that QuikTrip maintains safe rooms of any description for victims at risk of violence, and directing individuals who \"fear for their (immediate) safety\" to QuikTrip poses a danger not just to potential victims but to QuikTrip employees as well. Specific mentions of domestic violence and sex trafficking in particular conjure up images of people running and hiding from violent and threatening aggressors at QuikTrip outlets, but in almost all the dangerous situations listed in the Facebook post, (potential) victims would be best served visiting a police station rather than a convenience store.", "Wigglesworth, Valerie.    \"Plano-based City House Working with QuikTrips as Designated Safe Place.\"\r\n      The Dallas Morning News.     22 December 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]