["Where does the right to vote come from?", "There was news out of the U.S. Capitol on May 13, 2013 that U.S. Rep. Mark Pocan, D-Madison, proposed to amend the Constitution to ...", "Guarantee the right to vote.", "Wait, what?", "Pocan hasn't been in Congress even half a year. But he knows we have the right to vote, doesn’t he?", "In presenting his bill, which is co-sponsored by U.S. Rep. Keith Ellison, D-Minn., Pocan said he wanted to make it more difficult for states to impose rules on voting, such as having to present a photo identification in order to cast a ballot. We won’t take up here what impact their proposed amendment might have.", "But Pocan gave us pause when he said on the House floor:", "The right to vote \"is so fundamental that most Americans, understandably, assume it is already enshrined in the Constitution\" -- but \"most Americans would be wrong.\"", "\"While the right to vote is inherent throughout our founding document, and there are amendments prohibiting discrimination, nothing in the Constitution explicitly guarantees our right to vote. We, as Americans, possess no affirmative right to vote.\"", "Words matter, and Pocan’s claim -- that \"nothing in the Constitution explicitly guarantees our right to vote\" -- is precisely worded.", "Still, is he right?", "Pocan's evidence", "When we asked Pocan for evidence to back his statement, he told us to go read the Constitution.", "Just kidding.", "But we did wonder how he would try to prove that something doesn't exist.", "The existence of the 15th, 19th and 26th amendments, which prohibit discrimination based on race, gender and age, implies there is no explicit right to vote in the Constitution, Pocan spokesman Samuel Lau told us.", "He also cited the U.S. Supreme Court decision in Bush v. Gore, which effectively resolved the razor-thin 2000 presidential election in favor of George W. Bush over Al Gore.", "\"The individual citizen has no federal constitutional right to vote,\" the high court observed, according to Lau.", "But that was only the first part of the quote -- the rest is: \"for electors for the President of the United States unless and until the state legislature chooses a statewide election as the means to implement its power to appoint members of the Electoral College.\"", "In other words, the Supreme Court declared that the Constitution contains no right to vote for president, Alexander Keyssar, professor of history and social policy at Harvard University, told us.", "That’s OK as far as it goes; let’s go further.", "Other evidence", "A number of other authorities who back an amendment like the one Pocan proposes have cited the lack of the guarantee he cites:", "-- Keyssar, author of The Right to Vote: The Contested History of Democracy in the United States, told us: \"The basic fact is there is no affirmative right to vote in the U.S. Constitution. Never was.\"", "-- FairVote, which seeks to reform elections, says that while constitutional amendments prohibit discrimination based on race, sex and age, \"no affirmative right to vote exists.\"", "-- In a 2012 piece for Salon.com, Yale law professor Heather Gerken wrote: \"The Constitution does not guarantee Americans the right to vote. That always comes as a surprise to non-lawyers.\"", "-- In 2006, University of Baltimore law professor Garrett Epps, critical of photo ID requirements, made almost the same statement Pocan did, saying: \"The U.S. Constitution does not explicitly guarantee a right to vote.\"", "But what do other constitutional scholars say?", "Judith Best, distinguished teaching professor of political science at State University of New York-Cortland, told us the key phrase in Pocan’s claim is \"explicitly guarantees.\"", "\"It seems clear to me that the obvious intent\" of the Constitution, she said, \"is that the people are to choose their governments -- their representatives.\"", "Similarly, Roger Pilon at the libertarian Cato Institute -- who doubts Pocan’s amendment would have much impact, if adopted -- told us that amendments to the Constitution make it clear there is a right to vote.", "\"It’s so implicit as to be all but explicit,\" he said.", "But intending or implying aren’t quite the same as an explicit guarantee. And in Pocan's opinion, an explicit guarantee would make it more difficult to put restrictions on voting.", "We’ll leave the final word to scholar Hans von Spakovsky of the conservative Heritage Foundation and author of Who’s Counting?: How Fraudsters and Bureaucrats Put Your Vote at Risk.", "\"It is correct that there is not an explicit provision in the Constitution guaranteeing the right to vote,\" he said, \"but several amendments guarantee the right to vote at age 18, free of racial discrimination, and protected by the Equal Protection doctrine.\"", "Our rating", "Acknowledging that the right to vote is inherent in the Constitution, Pocan nevertheless called for amending the document and declared: \"Nothing in the Constitution explicitly guarantees our right to vote.\"", "Whether adding such a guarantee would have much impact is debatable. But Pocan’s narrowly constructed claim is accurately stated.", "We rate it True.", "YouTube, U.S. Rep. Mark Pocan speech, May 16, 2013", "U.S. Rep. Mark Pocan, news release, May 13, 2013", "Wisconsin Public Radio, Joy Cardin interview of U.S. Rep. Mark Pocan, May 21, 2013", "Milwaukee Journal Sentinel, \"Pocan, Ellison seek right-to-vote constitutional amendment,\"May 13,2013", "Salon.com, \"You have no right to vote,\"Sept. 21, 2006", "Interview, Stanford University history and American studies and political science professor Jack Rakove, May 24, 2013", "FairVote,\"Right-to-vote amendment\"", "The New York Times, \"The right to vote,\" Aug. 29, 2012", "The Atlantic, \"Voting: Right or Privilege,\" Sept. 18, 2012", "Email interview, State University of New York-Cortland distinguished teaching professor of political science Judith Best, May 24, 2013", "Interview, Harvard University history and social policy professor Alexander Keyssar, May 28, 2013", "Interview, Cato Institute vice president for legal affairs Roger Pilon, May 28, 2013", "Email interview, Heritage Foundation senior legal fellow Hans von Spakovsky, May 28, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]