["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "While recapping his 2020 bid for the presidency with reporters in Wilmington, Delaware, U.S. Democratic presidential nominee Joe Biden said that during his time working as a lifeguard at a country club, he played ball with “a lot of great Black athletes,” and that while he didn’t know them, “it was a great education” similar to the film “The Green Mile.”", "Readers asked Snopes if Biden's remarks were accurately reported in this instance. They were. While speaking with reporters on Nov. 3, Biden said the following, which can be found at the 3:17 mark:", "When I started off as a kid, I had a job at a nice country club kind of pool as a lifeguard. I wanted to work on the east side because I knew I played ball with a lot of great Black athletes, but I knew that I — you know — I didn’t know them. I mean, we knew each other. We were friends, but I didn’t know them, and it was a great education. It was like, The Green Mile, you know. You’ve seen the movie?", "https://www.c-span.org/video/?477776-1/joe-biden-comments-reporters-wilmington-delaware", "Adapted from the 1996 novel written by Stephen King, “The Green Mile” is a 1999 movie that details the disparity in the lives of Black prisoners and white prison guards in a Louisiana penitentiary during the Great Depression. John Coffey, a Black death row prisoner played by Michael Clarke Duncan, is sentenced to die for the rape and murder of two young girls — a crime that he did not commit. Paul Edgecomb, a white man who is the head of the prison guard and played by Tom Hanks, discovers Coffey’s innocence and goes on to defend the prisoner.", "In the interview, Biden went on to say that there were people that he “had known for a long time” that had lived in a middle of a city or county that was white, and they “didn’t know anybody.”", "Correction [Nov. 6, 2020]: A previous version of this article confused the plot of “The Green Mile” with that of “The Shawshank Redemption” and incorrectly stated that Hanks was a “white prisoner.”", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]