["Swedish environmental activist Greta Thunberg recently tweeted a toolkit detailing ways to support the ongoing farmer protests against the three new agricultural laws in India. Bengaluru-based climate activist Disha Ravi was accused by the Delhi police of ‘editing’ the toolkit that allegedly carried information to ‘wage war against India’. Ravi has been in judicial custody since February 14.", "Meanwhile, a picture of Thunberg inside a train compartment is widespread on social networking platforms. The picture shows the 19-year-old consuming food inside a train as African children allegedly watch her through the wondow. Twitter user @bembadep posted this picture and wrote, “India ask these anti forces #AskGretaWhy”. The tweet amassed over 700 retweets as of this writing. (Archive link)", "India ask these anti forces #AskGretaWhy pic.twitter.com/E4vWMMpKPX", "— Bembde Pavan (@bembadep) February 16, 2021", "Twitter user Umesh Singh Tomar also tweeted this photo thanking Zee News Editor-in-Chief Sudhir Chaudhary for exposing Thunberg.", "Several other users have tweeted this picture with the hashtag #AskGretaWhy.", "This slideshow requires JavaScript.", "Alt News performed a simple reverse image search and found the original photo published in an article in the British newspaper Metro from September 27, 2019. Unlike the viral image, this photo shows trees outside the window and not a group of children. Therefore, the image being shared on social media has been edited. The accompanying article states the picture was taken in Denmark.", "It also states that Eduardo Bolsonaro, son of Brazilian President Jair Bolsonaro, had shared the morphed picture of the climate activist.", "Thunberg had herself posted the original photo on January 22, 2019.", "Lunch in Denmark. pic.twitter.com/LWKMQ9AuqR", "— Greta Thunberg (@GretaThunberg) January 22, 2019", "The photograph of the children was found in a Reuters article dated August 23, 2007. It was shot by Reuters photographer Stephanie Hancock in Africa. The article is about people who fled villages and moved to the forests during the Bush War in Central Africa.", "During our research, we discovered that Thunberg’s photo has been edited in different ways and shared on social media since 2019. Some examples of these edits are below.", "This slideshow requires JavaScript.", "The Quint also published a fact-check report on this image on February 17.", "A morphed photo of Greta Thunberg having food during a train journey was circulated online. This picture has been edited and posted online since 2019.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]