["The photo was published here on Weibo on June 1, 2020.", "It shows a group of people kneeling in front of a large Chinese flag as another flies behind them. One person in the group is also seen holding a placard that reads “HELP US CHINA”.", "The caption, written in simplified Chinese characters, translates to English as: “Slogan of US protesters: China, help us breathe! Help us China! #USRiots #USProtestersHasCovered22States32Cities”.", "The photo was published alongside another photo that allegedly shows a US protester calling on China to intervene in the ongoing protests, which has previously been debunked by AFP here.", "Mass protests erupted across the US following the death of George Floyd, an unarmed black man, in Minneapolis police custody on May 25, 2020. Here is an AFP report on the unrest.", "The photo has also circulated alongside similar claims on Twitter here and here; on Facebook here; and on the online forum 4chan here.", "However, the claim is false; this photo has been doctored.", "A combined Google reverse image and keyword search found this original photo published by Reuters on May 30, 2020.", "The photo description reads: “Peaceful demonstrators observe a moment of silence outside the U.S. Bank Stadium during the fourth day of protests after the killing of George Floyd in Minneapolis, Minnesota, U.S. May 29, 2020. Picture taken May 29, 2020. REUTERS/Nicholas Pfosi”", "The Reuters photo does not show the two Chinese flags, or a pro-China placard.", "Below is a screenshot comparison of the photo in the misleading post (L) and the Reuters photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]