["The photos were published here on Facebook on December 2, 2020.", "The post includes two photos of students wearing school uniforms while raising one arm in the air.", "The post’s Thai-language caption translates to English as: “This is the majority, good students of Debsirin Nonthaburi announce a rejection of private uniforms.”", "The phrase “good students” is a reference to the “Bad Students”, an activist group led by high school students calling for reforms to Thailand’s education system.", "In a Facebook post on November 27, 2020, the group called for a show of disobedience by dressing in casual clothes to school, in defiance of Thailand’s student uniform regulations on December 1, 2020, Bangkok Post reported here.", "Since July 2020, Thailand has been rocked by pro-democracy protests demanding a redrafting of the constitution, reforms to the monarchy, and for the resignation of Prime Minister Prayut Chan-o-cha, AFP reported here.", "The same photo alongside a similar claim have been shared on Facebook here, here and here.", "The claim, however, is misleading.", "A reverse image search on Google, followed by a keyword search, found the photo posted here by Debsirin Nonthaburi School Student Committee’s Facebook page on January 31, 2020. It was published almost one year before the Bad Student group organised their protest against school uniforms on December 1, 2020.", "The captions translate to English as: “Declaration of Intent of the Thai Student Council 31/01/2020.”", "The photos were also published on the Office of the Basic Education Commission’s website in an article here on February 5, 2020.", "The article’s title reads in English as - Secondary Education District Office ratifies Thai Student Council’s declaration of intent.", "Parts of the article reads: “On Wednesday January 29, 2020, Mr. Surachat Kruasri Director of the Secondary Education Office District 3 and Ms. Nattapassorn Chotikul Director of Educational Management assigned Mr. Thirapongse Taehopiharn Academic Researcher to participate in the 2020 annual declaration of intent activity from the Thai Student Council. The activity was organized at the Debsirin Nonthaburi School in Nonthaburi Province.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]