["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At the Nov. 3, 2011, meeting of Shelby County’s schools merger Transition Planning Commission, Memphis City Schools Supt. Kriner Cash responded to a statement made by a suburban commissioner, Tommy Hart of Collierville, about Shelby County having \"the highest tax rate in the state of Tennessee.\"\n\nCash didn't quibble with that but claimed the rate is still \"one of the lowest in the country.\"\n\nIn some ways, Cash and Hart were talking past one another. Hart, a real-estate developer, used the more general term \"tax rate\" but clearly was referring to property taxes, which produce 60.1 percent of county revenues, with 30.6 percent of the county’s budget going to public schools budgets. Hart was asking Cash and the merger transition team to keep in mind that people are concerned about keeping local taxes from rising, even as the county moves toward funding a consolidated school system.\n\nThe transition team is charged with creating a plan for merging Memphis City Schools with suburban Shelby County Schools in time for the 2013-14 school year.\n\nCash took the opportunity to push back with a larger point he has emphasized in other settings -- the county and the state actually have an overall education tax burden that is very low compared to the rest of the country.\n\nIs Cash correct? To sort that out, we looked at tax burdens at the state and local levels, as well as education spending at the per-pupil level.\n\nEducation Counts, the research and data center for Education Week, includes a table that shows the percentage of total taxable resources spent on education. By that measure, Tennessee tied for fourth-lowest in the country in 2008, the most recent year included in the database. In terms of per pupil spending, Tennessee ranks sixth-lowest, according to Education Counts.\n\nThe state also rates low in a 2011 U.S. Census Bureau publication that examines school finances from 2009. It is the third-lowest state in the country for per-pupil spending ($8,141 compared to national average of $12,250) ahead of only Idaho and Utah, and, again, third-lowest in terms of education spending per $1,000 of personal income ($36.90 per $1,000 in Tennessee vs. national average of $47.74), ahead of only Florida and Washington, D.C.\n\nIn terms of total state-local tax burdens, the Washington, D.C.-based Tax Foundation shows Tennessee as fourth-lowest in the nation, with 7.6 percent of Tennesseans’ incomes going toward local and state taxes.\n\nSo clearly, Tennessee’s tax burden and spending on education rank among the lowest in the country. But what about Shelby County’s in particular?\n\nIt actually ranks in the middle of pack nationally. The Tax Foundation built a database with census data showing that, in terms of median property taxes paid on owner occupied housing, Shelby County ranks 345th of the 792 U.S. counties with a population of 65,000 or more. The median property tax of $1,902 is just behind Williamson County’s $1,914 and well above the next Tennessee county, Davidson, at $1,562.\n\nSo while property taxes in Shelby County may be high for the state, they fall in the middle nationally -- below many counties in states where residents also pay state income taxes and/or local payroll taxes to help fund public education. However, it’s important to note that the majority of education funding for Tennessee school districts comes from the state, not the county.\n\nOur ruling\n\nSo Cash is right about the state's ranking. The county is more in the middle of the pack nationally, but it accounts for a smaller share of education funding. We rate his claim Mostly True.", "Shelby County schools merger Transition Planning Commission, Audio of meeting, Kriner Cash and Tommy Hart exchange comes in the final 30 minutes, Nov. 3, 2011.", "Education Counts, create table showing percentage of total taxable resources spent on education", "U.S. Census Bureau, Public Education Finances: 2009, published May 2011,", "Tax Foundation, ranking state-local tax burdens using 2009 data, published February 2011.", "Tax Foundation database, Property Taxes On Owner-Occupied Housing, by County, 2005-2009, counties with populations of 65,000 or more, published May 2011.", "Memphis City Schools budgets", "Suburban Shelby County Schools budgets", "Shelby County, Tennessee, 2011-12 budget", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]