["A clip showing police entering people’s homes by force has been shared on social media with many claiming that the incident took place in Kashmir.", "गोदि मीडिया ये दिखाने में लगा है कि कश्मीर में लोग अमन से हैं", "Posted by Md Husen Belim on Tuesday, 27 August 2019", "“गोदि मीडिया ये दिखाने में लगा है कि कश्मीर में लोग अमन से हैं (Godi media wants to show that everyone is at peace.)” – says the message circulated with the clip", "The video is also circulating on WhatsApp.", "This clip was earlier debunked by BBC when it was viral with the claim that it depicts atrocities on Hindus in Pakistan. BBC spoke to one of its correspondents from Islamabad who informed that the video pertains to an incident that took place in Faisalabad in Pakistan’s Punjab province in 2013.", "Pakistani media Dunya News, Geo TV and The Express Tribune had reported the event where citizens were thrashed by personnel of Pakistan’s ‘Elite Forces’.", "According to Dunya News, “…during a protest against electricity load-shedding in Faisalabad, police entered the houses of protesters and manhandled their women.”", "BBC Islamabad correspondent Umar Daraz informed that Faisalabad is prone to electricity shortages but in 2013 the situation turned dire. People took to the streets in protests after complaining of power outages for 14-16 hours a day.", "“They had resorted to throwing stones and had also burned down a FESCO office, after which police officers abused and assaulted the protesters,” per a June 2013 Express Tribune report. Three police personnel Babar Masih, Tauseef Ahmed, Abid Hussain were suspended after police excess on Muslim families.", "Alt News had debunked the video in January 2019 when it was shared with a different false claim. The video has been doing rounds with distorted facts in other countries as well. A Persian website ‘Shia News Association’ in 2014 claimed that it depicted Pakistani police excess on Afghan refugees. In 2015, the video was circulated with the claim that it portrayed Pakistani police brutality on Christians. From a YouTube handle ‘Peace Worldwide’, it attracted over 95,000 views. A Twitter user from Europe, who is followed by Railway Minister Piyush Goyal’s Office, also shared the identical video with the ‘Christian’ narrative, but in 2017.", "Since the revocation of key provisions of Article 370, social media has been brimming with all kinds of misinformation. From the Pakistani social media ecosystem, there has been a visible attempt to portray brutality on Kashmiris. Alt News has debunked a plethora of such claims.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]