["By Rem Rieder", "Posted on May 5, 2020", "A Trump campaign ad misleadingly edits a CNN interview to suggest 2 million people would have died from the novel coronavirus were it not for President Donald Trump’s China travel restrictions.", "In the one-minute ad, Wolf Blitzer, anchor of CNN’s “The Situation Room,” is heard asking chief medical correspondent Dr. Sanjay Gupta, “Is it accurate that if these steps had not been put in place … it could’ve been 2 million people dead here in the United States?” While Blitzer speaks, the ad shows images of an Air China plane and signs saying airline flights had been canceled. “Yes,” Gupta is shown saying.", "The impression is that Trump’s travel restrictions, which went into effect Feb. 2, were responsible for saving those lives.", "But the ad edited Blitzer’s question in a misleading way. In fact, during the March 30 interview, Blitzer asked, “Well, is it accurate that if these steps had not been put in place, the stay at home orders, the social distancing orders, as the president said yesterday, it could have been 2 million people dead here in the United States?” The ad gives no hint that the question was about social distancing, not travel restrictions.", "And while Gupta ultimately gave a positive response to Blitzer’s question, it is much more nuanced than the ad suggests. Gupta answered, “I mean, you know, these are all models, Wolf. It’s a little tough to say, but, you know, if you talk about something that is spreading, you know, very robustly throughout a community. You know, two to three times more contagious than flu, and up to 10 times, perhaps even more than that, more deadly than flu, then yes. I mean, that’s when you start to get those sorts of numbers. I mean, you know, this is a pathogen that obviously is, can cause a lot of disease and death.”", "A lawyer for WarnerMedia, CNN’s parent company, wrote a letter to the Trump campaign asking it to “cease and desist” from airing the ad.", "“The advertisement purposely and deceptively edits the clip to imply that Mr. Blitzer and Dr. Gupta were crediting the President’s travel ban policy issued in January for saving millions of American lives, when in fact Mr. Blitzer and Dr. Gupta were discussing recently implemented social distancing guidelines and stay-at-home orders issued by state and local governments,” said the letter written by WarnerMedia Senior Vice President and Associate General Counsel Rick McMurtry. “Such misuse of CNN content is false, misleading and deceptive.”", "The Trump campaign did not respond to our request for comment. Trump campaign Communications Director Tim Murtaugh has defended the ad. He told CNN, “No discussion of efforts to prevent American deaths from the coronavirus can be had without the understanding that President Trump restricted travel from China in January. Based on that alone, the ad is accurate.”", "The novel coronavirus pandemic began in Wuhan, China, late last year. Health and Human Services Secretary Alex Azar announced the China travel restrictions on Jan. 31. Trump has frequently referred to the action as a “travel ban,” but as we have written, that is a misnomer.", "The policy prohibits non-U.S. citizens who have traveled to China within the previous two weeks from entering the U.S. But the rules don’t apply to U.S. citizens, legal permanent residents and their immediate family members. And they don’t bar importing goods from China.", "A New York Times story on April 4 found that nearly 40,000 people had flown on direct flights from China to the United States in the two months after the travel restrictions went into effect.", "Without evidence, in at least two briefings, the president claimed that his travel restrictions “saved tens of thousands” and even “hundreds of thousands of lives.” We found no support for such figures, and the White House didn’t provide any.", "The few studies that have been done suggest that travel restrictions several countries enacted slowed the initial spread outside of China but did not contain the virus. Past studies also have found travel restrictions could delay the path of the spread of diseases but do little to contain them.", "The ad, titled “American Comeback,” also repeats an inaccurate claim on the U.S. economy that Trump has made many times before.", "In the ad, Trump says, “We built the greatest economy the world has ever seen, and we’re going to do it again.” This echoes a line Trump used at least 11 times at coronavirus briefings in April: that America had “the greatest economy in the history of the world” before the coronavirus pandemic.", "The economy was in good shape before the coronavirus outbreak, with stocks soaring and unemployment low. But it was by no means the greatest economy in history. As we have written, the economy has gone through many periods of more robust growth than it has under the Trump administration. Over the last 39 years — dating to Ronald Reagan’s presidency — the nation’s real economic growth has reached or exceeded Trump’s peak year of 2.9% 19 times.", "The ad features two Democratic governors praising federal efforts to help the states during the coronavirus pandemic.", "In one clip, the ad shows New York Gov. Andrew Cuomo saying, “What the federal government did was a phenomenal accomplishment.” The clip was edited from the original statement, which came during an April 19 press conference: “Look, what the federal government did working with states, as I just said, was a phenomenal accomplishment.” Cuomo did praise the federal government, along with others, in working to help flatten the curve.", "“The federal government stepped up and was a great partner and I’m the first one to say it. We needed help and they were there,” Cuomo went on to say. “State and local governments were fantastic. The hospital system was fantastic. New Yorkers were fantastic. And that is an undeniable fact.”", "In another, California Gov. Gavin Newsom says, “Promise made, promise kept.” Newsom made that comment in connection with a shipment the federal government had sent California of 90,000 testing swabs, which Trump had promised in a conversation with Newsom.", "Cuomo and Trump, who both come from Queens, have had an up and down relationship during the pandemic. Newsom, formerly a Trump critic, has said many positive things about the president of late. Trump has stressed the importance to him of governors expressing appreciation for his help.", "CNN said it learned about the ad on May 1 when it was submitted as part of a campaign ad buy. Television networks routinely review ads to make sure there is no problematic content. The Trump campaign said it is spending “mid-seven figures” on the ad, which is running nationally this week on broadcast and cable outlets. It debuted May 3 before Trump’s Fox News virtual town hall. So far, the campaign has spent nearly $500,000 on the ad, according to Advertising Analytics.", "McMurtry’s letter said the cable news outlet contacted the Trump campaign’s ad agency, Harris Sikes Media, asking that the ad be corrected. “CNN was willing to accept the advertisement if the misuse had been corrected,” McMurtry wrote. “Despite this notice, you refused to correct the advertisement and knowingly proceeded with distributing the advertisement as is with the misleading claim.”", "To sum up, there is no doubt that the ad edited the exchange between Blitzer and Gupta in a way that was misleading.", "FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]