["“कांग्रेस के विधायक अनिल उपाध्याय भी हुए पीएम मोदी के मुरीद, बंधे तारीफों के पूल (Translated: Congress MLA, Anil Upadhyay also becomes a disciple / fan of Modi, lavishes praise on him)”. The Breaking News headlines telecast on April 27th by Republic TV’s Hello Bharat program, carried a video of a person praising PM Modi and saying that only the corrupt want him to lose. The anchors further explained what they called the ‘big news’ saying that not only the common citizens of the country but also PM Modi’s political opponents are full of praise for him. They introduced the person as Anil Upadhyay, a Congress MLA from Madhya Pradesh.", "कांग्रेस के विधायक अनिल उपाध्याय भी हुए पीएम मोदी के मुरीद, बंधे तारीफों के पूल", "कांग्रेस के विधायक अनिल उपाध्याय भी हुए पीएम मोदी के मुरीद, बंधे तारीफों के पूल", "Posted by Republic Bharat on Friday, April 26, 2019", "The video was also viral on social media with a Facebook page of one Kanak Mishra garnering over 10,000 shares. “What will Rahul Gandhi say to his MLA’s act? Make this video so viral that the entire country sees it”, said Mishra in his Facebook post.", "*कोंग्रेस विधायक अनिल* *उपाध्याय की इस हरकत पर क्या कहेगे राहुल जी,* *इस video को इतना वायरल करो की ये पूरा हिन्दुस्तान…", "Posted by कनक मिश्र on Saturday, April 27, 2019", "Who is this Congress MLA from Madhya Pradesh whose video praising PM Modi is not only viral on social media but has been also been telecast on national television?", "Alt News searched the MyNeta database that there is no Congress MLA called Anil Upadhyay. The search throws up two persons by the same name – Dr. Anil Upadhyay, a BSP leader from Jodhpur who contested the Rajasthan polls in 2018, and Anil Kumar Upadhyay, an independent candidate from Lucknow who contested the Uttar Pradesh assembly elections in 2007 and 2012. There was no Congress leader from Madhya Pradesh by this name.", "After it was established that the person in the video was not a Congress MLA from Madhya Pradesh, Alt News tried to establish the identity of the person.", "Alt News has come across several viral videos of the same man, each one with a different claim. In December, 2018 a video of the same man praising Prime Minister Narendra Modi was viral on social media with claims suggesting that he is Rajasthan Deputy CM Sachin Pilot’s father-in-law. Alt News had debunked this fake claim pointing out that Sachin Pilot is married to Sara Abdullah who is the daughter of J&K National Conference chief and ex-Chief Minister of J&K Farooq Abdullah.", "Earlier this month, the same person was seeing crying on video over people being critical of PM Modi. In this video he was sitting with a group of people in open ground doing yoga.", "Rone me to ye apne ustaad Modi aur Yogi ko peeche chorr Diya 😭😭😭😭pic.twitter.com/2ag9ba5Qd0", "— Mohammed Zubair (@zoo_bear) April 16, 2019", "The person in the video was identified by Quint as Mohan (Munna) Pandey. Several videos of Pandey have been shared by twitter user, Tanmay Shankar (@Shanktan). In all these videos, he is seen as making a very spirited and emotional case for supporting PM Modi. Speaking to Quint, Shankar confirmed that the person is Mohan Pandey and is known to him personally.", "मोदी रहा तो भारत जल्द अमेरिका जैसा देश होगा। Views of Munna Pandey ji on @narendramodi governance model … pic.twitter.com/rQ5oPfpvYe", "— Tanmay Shankar (@Shanktan) April 10, 2019", "Just met with Mr. Munna Pandey during walk ! His point is very clear that Opposition only agenda is to remove @narendramodi keeping India's development aside!! And this is what I believe Pan India's opinion wants a good and a strong leader!Plz RT who all agree. pic.twitter.com/QSSkqpbfgj", "— Tanmay Shankar (@Shanktan) March 17, 2019", "It is clear from above that Congress MLA, Anil Upadhyay who was featured in a ‘Breaking News’ by Republic TV is a fictional character. The video is of one Mohan Pandey, who is regularly featured in videos, perhaps due to his impassioned appeals in favour of PM Modi. These videos get viral on social media from time to time with different narrative and often an attempt is made to project him as a Congress leader praising PM Modi. This time, it was not just gullible social media users, but a national television channel like Republic TV who shared the video without any fact check.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]