["A video of a flock of birds flying through a city is viral with the claim that it was shot at Chandigarh’s Kalka road during the nationwide lockdown to tackle coronavirus. “Chandigarh kalka Road… Nature is back to its basics,” reads the message posted along with the video by Facebook user Praveen Chaubey on April 9, 2020. It has been shared close to 800 times so far.", "Chandigarh kalka Road… Nature is back to its basics", "Posted by Praveen Chaubey on Thursday, 9 April 2020", "Many other people on Twitter and Facebook shared the video with the same claim.", "Alt News has also received several requests on its official Android application to fact-check this video.", "Alt News found that the video being passed off as Chandigarh is actually from River Front, Ahmedabad. This phenomenon of birds flying together in coordination is known as murmuration. The video was posted by The Times of India’s official YouTube channel on February 12, 2020. Thus, it is definitely unrelated to the recent nationwide lockdown which the country has been observing since March 24 midnight.", "“Residents of Ahmedabad were taken in for surprise when hundreds of birds flocked together in sky. The spectacular scene from riverfront left viewers spellbound. An undated video of hundreds of birds flocking together is being widely shared on social media. Flocking together is a phenomenon called murmuration wherein birds fly in swooping, intricately coordinated patterns through the sky,” stated the report.", "In conclusion, a two-month-old video from Ahmedabad of birds flying together in coordination was shared as ‘nature coming back to life’ at Chandigarh’s Kalka road during the 21-day nationwide lockdown.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]