["By Angelo Fichera", "Posted on May 22, 2019", "A viral meme attempts to undercut the evidence of climate change by using an edited cover of Time magazine — and regurgitating a misleading claim about “global cooling.”", "A doctored cover of Time magazine casting doubt on climate change has circulated for years — at one point, according to Politico, even reaching the desk of President Donald Trump.", "That supposed cover, warning of an “Ice Age,” appeared again in recent weeks on Facebook, where thousands of users — including the musician Ted Nugent — shared it through a meme.", "“When the exact same group of ‘experts’ who claimed it was global cooling in 1977 now claim it’s global warming you can easily see why I am skeptical,” the meme reads.", "It includes two Time magazine covers — one manipulated and one legitimate. The first, on the left, is falsely identified as being from 1977 and includes a doctored headline reading, “How to Survive the Coming Ice Age.” The cover on the right, which is real, is from 2008 and has a headline that reads: “How to Win the War on Global Warming.”", "The cover falsely purported to be from 1977 was actually published April 9, 2007, and is available on the magazine’s website. Its real headline? “The Global Warming Survival Guide.”", "Time itself attempted to set the record straight in a 2013 post that debunked the fictitious version, but the false cover has persisted online nonetheless.", "The meme’s overarching claim about “experts” warning of a “global cooling in 1977” also isn’t new. We addressed a similar claim advanced by Trump last year, and by Republican Texas Sen. Ted Cruz before him.", "As we’ve written before, there were indeed articles (including in Time) in the 1970s that warned of cooling world temperatures. A 1975 Newsweek story has received considerable attention. But the journalist who wrote that piece criticized it himself in 2014, taking aim at parts that were not fully supported by the research.", "Moreover, the notion of global cooling was not widely accepted among climate scientists — as global warming is today. (NASA notes that studies show that “97 percent or more” of active climate scientists believe human-caused warming is occurring.)", "We’ll again refer to the 2008 study published in the Bulletin of the American Meteorological Society that found there was not a scientific consensus in the 1970s on the cooling idea. The authors, by surveying the peer-reviewed literature between 1965 and 1979, found quite the opposite.", "“A review of the literature suggests that, on the contrary, greenhouse warming even then dominated scientists’ thinking as being one of the most important forces shaping Earth’s climate on human time scales,” they found.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Goldmacher, Shane. “How Trump gets his fake news.” Politico. 15 May 2017.", "Gwynne, Peter. “My 1975 ‘Cooling World’ Story Doesn’t Make Today’s Climate Scientists Wrong.” Inside Science. 21 May 2014.", "Levitan, Dave. “Cruz on the Global Cooling Myth and Galileo.” FactCheck.org. 27 Mar 2015.", "McDonald, Jessica. “The Science Trump Got Wrong in the Post Interview.” FactCheck.org. 28 Nov 2018.", "Peterson, Thomas C., et. al. “The Myth of the 1970s Global Cooling Scientific Consensus.” Bulletin of the American Meteorological Society. 1 Sep 2008.", "“Scientific Consensus: Earth’s Climate is Warming.” NASA. Accessed 21 May 2019.", "Walsh, Bryan. “Sorry, a TIME Magazine Cover Did Not Predict a Coming Ice Age.” TIME. 6 Jun 2013.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]