["“I just returned from Walmart Pharmacy. If anyone wants to know who benefited from Trumps Prescription Bill you can ‘quote’ me,” begins a September 15 Facebook post from Katharine E Wade.", "“I picked up my Insulin (3 month supply) and the cost has dropped from $173.86 down to $42.88….big saving,” the post, which has been shared hundreds more times as a screenshot, continues.", "AFP contacted Wade for more details about her claim, but she did not respond.", "Wade told FactCheck.org “I don’t care where (the cost reduction) came from, I just appreciate it.”", "Trump has not signed a “prescription bill” into law as suggested by Wade.", "On July 24, 2020, the president did sign four executive orders aimed at lowering drug prices.", "These orders require further action by different government agencies, but in the first presidential debate with his Democratic rival Joe Biden, Trump said of insulin, “I'm getting it for so cheap, it's like water.”", "The president has also touted on Twitter and in ads run on Facebook that his orders will provide Americans with lower drug costs, particularly lower insulin costs.", "Rachel Sachs, associate professor at the Washington University in St Louis School of Law, told AFP by phone that because of the way executive orders are structured, “we know that that’s not the case.”", "Trump’s order related to insulin applies narrowly to individuals served by Federally Qualified Health Centers, which help the homeless and other vulnerable groups.", "These centers already provide services on a sliding price scale based on income, so Sachs said the number of people who will ultimately see lower insulin costs hinges on how the administration defines “low income.”", "Sachs said that the Department of Health and Human Services submitted a proposal for how to implement Trump’s order to the Office of Management and Budget, but it’s still under review and is not publicly available.", "“If we see a relatively low threshold for the definition of ‘low income patient,’ it’s possible that this order will not do very much that doesn’t already exist in the law,” Sachs said.", "The US Centers for Disease Control and Prevention estimates that “1.4 million adults aged 20 years or older -- or 5.2 percent of all US adults with diagnosed diabetes -- reported both having Type 1 diabetes and using insulin.”", "A 2020 study in JAMA, The Journal of the American Medical Association, found that between 2007-2018, the list prices of insulin increased by 262 percent, and net prices by 51 percent.", "Study author Inmaculada Hernandez explained that it is important to examine list prices because uninsured patients and people with high deductible insurance plans will often be asked to pay the list price. Those with insurance may see lower out-of-pocket costs because they benefit from manufacturer rebates to their health plan provider.", "When insulin becomes unaffordable, individuals may try to ration it, a practice that advocates decried as having led to several deaths in 2017, 2018 and 2019.", "On September 24, Trump promised that Medicare recipients would receive $200 drug discount cards, a move that surprised many because a deal on drug pricing with pharmaceutical companies had earlier collapsed when they refused to pay for such discount cards.", "Hernandez, an Assistant Professor of Pharmacy and Therapeutics at the University of Pittsburgh, called the proposal “an insult to people’s intelligence.”", "“If you average out-of-pocket costs that Medicare beneficiaries are facing, I don’t see how $200 will fix anything,” she said by phone.", "The source of the funding for that $6.6 billion dollar promise also remains unclear.", "A second claim mainly circulated on Twitter, which does not mention a specific pharmacy, says: “Old price for insulin 600.00$ a month. New price of insulin 35.00$ a month.Thank you @realDonaldTrump.”", "This claim was also shared on Facebook here and here.", "The Twitter user who made the claim did not respond to AFP requests for comment.", "The claim is likely related to a move made by the Centers for Medicare and Medicaid Services in May 2020, which goes into effect in January 2021. This change will affect certain Medicare Part D and Medicare Advantage prescription drug insurance plans and will make available a “broad set of insulins at a maximum $35 copay for a month’s supply.”", "However, patients under other programs could also get insulin for $35 regardless of federal government action.", "In April 2020, the pharmaceutical drug manufacturer Eli Lilly announced that due to economic hardship created by the Covid-19 pandemic, it would offer “anyone with commercial insurance and those without insurance at all to fill their monthly prescription of Lilly insulin for $35.”", "The US state of Maine also passed legislation to cap insulin costs at $35 for a 30-day supply starting in 2021. A cap of $100 went into effect in Colorado in 2020 and will go into effect in 2021 in Washington, West Virginia and New York.", "Hernandez said that while policy addressing insulin affordability is important, it is equally important to address the broader regulatory environment in the US that allows drug prices to rise at rates far faster than inflation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]