["“Indian police beating up Muslims Kashmir”. This message accompanies a video posted on Facebook by a user Hummayu Basharat. The video on this post has been viewed over 155,000 times and shared over 8650 times so far.", "Indian police beating up Muslims Kashmir 😢😢", "Posted by Hummayu Basharat on Sunday, October 27, 2019", "The video has gone viral on Facebook with the identical narrative.", "Alt News broke the clip into several keyframes and reverse-searched some of the frames on Google. We found a longer video of the same incident uploaded on YouTube by Daily Excelsior on November 13, 2017. The relevant portion can be viewed from 0:14 minutes. The video is titled, ‘Protesting against eviction Gujjars block Lal Singh’s residence with livestock’.", "The same video was also tweeted on November 14, 2017 by the account Jammu Link News, which shared it on Facebook as well. The message posted along with the video stated, “A large number of people belonging to the Gujjar community today held protest outside Jammu and Kashmir Forest Minister Chaudhary Lal Singh’s residence in Jammu against eviction of people, especially members of their tribe, from forest belts.”", "WATCH | A large number of people belonging to the Gujjar community today held protest outside Jammu and Kashmir Forest Minister Chaudhary Lal Singh’s residence in Jammu against eviction of people, especially members of their tribe, from forest belts. pic.twitter.com/qwODQ47VUf", "— JAMMU LINKS NEWS (@JAMMULINKS) November 14, 2017", "With the use of relevant keywords, we found reports related to the incident on Rising Kashmir and Greater Kashmir. According to reports, this protest by members of the Gujjar community was held outside the residence of forest minister Chaudhary Lal Singh. The protest was over the alleged eviction of some members of the Gujjar community by Singh. The agitators had attempted to push in their livestock into the leader’s residence following which the police took prompt action.", "A two-year-old video of a protest by Gujjars in Jammu has been shared as Indian police beating up Muslims in Kashmir.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]