["About this rating", "The original letter was actually sent to an Indiana newspaper and published.", "The person who wrote the letter has not said whether it was meant to be taken seriously.", "An old joke runs as follows:", "Late at night, a police officer finds a drunk man crawling around on his hands and knees under a streetlight. The drunk man tells the officer he's looking for his wallet. When the officer asks if he's sure this is where he dropped the wallet, the man replies that he thinks he more likely dropped it across the street. \"Then why are you looking over here?\" the befuddled officer asks. \"Because the light's better here,\" explains the drunk man.", "This jape exemplifies a bit of twisted logic worthy of Gracie Allen: if your problem doesn't fit the location, then make the location fit the problem.  That's the reasoning behind the letter to the editor reproduced above, one which advocates that a \"Deer Crossing\" warning sign should be moved to an area with less traffic because too many of the animals are being struck by automobiles at its current location. (The humor, of course, is that such a sign merely alerts motorists that deer are present in the area — it doesn't lure deer to the area or encourage them to cross the roadway there, so moving the sign elsewhere would do nothing to ameliorate the stated problem.)", "This letter was indeed submitted by Crown Point, Indiana, resident Tim Abbott and published by the Munster, Indiana, Times on 19 August 2011, and the missive garnered a good deal of public attention after it was read on the air by Tonight Show host Jay Leno in September 2011 and again when it was posted on the Facebook page of Star Trek actor George Takei in June 2012.", "In a June 2012 follow-up article about the letter, its author declined to explictly confirm whether he had meant it to be taken seriously or humorously, but the tenor of his response clearly indicated the latter:", "Abbott, 47, said he'd written the letter expecting it might elicit a few raised eyebrows from local readers perusing the paper as they munched their breakfast cereal.", "\"Really all I wanted was to get a little rise out of people,\" Abbott said.", "He wouldn't say whether he intended it to be humorous. \"That would spoil the mood,\" Abbot said.", "All the attention has been a little unsettling for Abbott, a worker at a local oil refinery.", "\"I get letters, and phone calls in the middle of the night,\" he said.", "Online comments were troubling.", "\"Some people seem to think I believe deer can read,\" Abbott said.", "Nearly a year after writing the letter, Abbott's 2012 Toyota Tacoma collided with a deer in the very spot marked by the deer crossing sign.", "Abbott's daughter Julia, apparently a chip off the old block, penned a June 10 letter to The Times asking, \"What is it going to take to get the deer crossing signs removed?\"", "Abbott said he's got a suggestion for officials.", "\"If they don't want to move that sign, maybe they could post another sign, kind of a warning to deer to look both ways before crossing the street,\" he said.", "On 17 September 2012, a woman later dubbed \"Donna the Deer Lady\" called the weekly \"vent line\" feature of Fargo radio station Y94's \"Morning Playhouse\" show  and stated that she had been in three car accidents involving deer in the last few years, all of which had occurred near deer-crossing signs; she then offered seemingly earnest complaints about officials' \"allowing these deer crossings to be in such high-traffic areas\" and questioned \"why we are encouraging deer to cross the interstate.\" The following month, a recording of that call received wide circulation on the Internet via YouTube.", "However, others such as Tampa radio talk show host Todd Schnitt maintain that \"Donna\" was actually a fake caller who has been used by Y94's hosts more than once to stage supposedly real, outrageous phone conversations.  According to Schnitt, she appeared on the station again in October 2013 claiming that she was going to hand out \"fat letters\" on Halloween to trick-or-treaters she did not deem thin enough to deserve candy.", "Acierno, Louis J. The History of Cardiology. Parthenon Publishing Group, 1994.", "Erler, Susan. \"Deer crossing letter read 'round the world.\" Northwest Indiana Times. 13 June 2012.", "Bell, David. \"HOAX: Schnitt Calls BS on Trick-or-Treat \"Fat Kid\" Halloween Letter.\" Web.archive.org. 30 October 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]