["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Amanda Chase urged fellow Republicans to attend a Jan. 6 rally in Washington protesting the results of the 2020 presidential election. She drove to it with personal bodyguards and gave a speech repeating a discredited statement she’d been making for two months - that the election had been \"stolen\" from President Donald Trump.", "Chase left D.C. before demonstrators stormed the U.S. Capitol. But the next day, she  pinpointed blame for the deadly riot, and it was not on the pro-Trump protestors.", "\"Antifa is the culprit,\" she wrote on her Facebook page, referring to a loose collection of activists who rally against fascism and far-right groups.", "Chase was hardly the first election-results denier to blame the violence on far-left activists impersonating Trump supporters. The fabricated charge has saturated social media sites and has been spread by Republican politicians such as U.S. Rep. Mo Brooks of Alabama and Texas Attorney General Ken Paxton. PolitiFact National has rated both of their statements Pants on Fire.", "We add Chase, who is seeking this year’s GOP nomination for governor, to that list. Shortly after making the post, Facebook suspended her account, which has more than 100,000 followers. Majority Democrats in the state Senate have submitted a censure resolution against Chase for \"fomenting insurrection against the United States.\"", "As PolitiFact has reported, mentions of \"antifa\" started to take off on 4chan, an anonymous online forum, around noon on Jan. 6, according to data from the Social Media Analysis Toolkit.", "Shortly after 1 p.m., when rioters pushed past barricades at the Capitol, posts in pro-Trump Facebook groups claimed antifa activists were to blame. They cited a Breitbart live stream that showed rioters brandishing Trump paraphernalia.", "The baseless rumor gained traction on Parler, a social media platform popular with conservatives, and on Fox News programs hosted by Sean Hannity, Tucker Carlson and Lou Dobbs. Rep. Matt Gaetz, R-Fla., suggested during a nationally televised congressional debate that antifa was behind the riot.", "Chase blamed antifa the next day, Jan. 7. She offered no substantial evidence, simply linking her post to a video of protesters at the Capitol - whom she called \"patriots\" - chanting \"No antifa.\"  Her Facebook account was suspended on Jan. 8.", "She told Newsradio WRVA on Jan. 11 that she was merely passing on already-aired information about possible antifa involvement. \"The posts I put up simply said there are reports that antifa had infiltrated those that had gone into the Capitol, breaking the windows and doing the destruction, and there was a company that had some kind of a facial recognition that could identify those people back to antifa,\" she said.", "But Chase’s claim of being a mere conduit of reports from others doesn’t hold up. She said, \"Antifa is the culprit,\" presenting it as fact, even though there was plenty of information that contradicted her claim.", "The supposed smoking gun on Jan. 6 - which Chase referred to on WRVA - was an article in the conservative Washington Times falsely reporting that a New York facial-recognition company had identified antifa supporters among the rioters. The Times retracted the article the same day and apologized to the company - XRVision. All of this happened the day before Chase’s post blaming antifa.", "And, of course, Trump had been urging his backers to attend the rally for several weeks. Trump identified the mob as his own supporters in a Jan. 6 video posted to Twitter amid the Capitol incident, where he asked them to disperse peacefully, adding, \"We love you. You’re very special.\"", "The day after Chase’s post, the FBI said there is no evidence of antifa involvement in the riot. Some of the most visible demonstrators who have since been identified or arrested have long social media records of supporting Trump.", "We should note that Chase is not the only Virginia Republican blaming antifa for the riot without proof. State GOP Chairman Rich Anderson, in a Jan. 7 Facebook post, wrote, \"Last night and this morning, I spoke to Virginia Republicans who were present on Capitol Hill on Wednesday and who personally witnessed the group that led the penetration of the U.S. Capitol... According to these eyewitness accounts from individuals who I know and trust, this group appeared to employ the signature strategies of antifa and other leftist groups.\"", "Our ruling", "Chase wrote, \"Antifa is the culprit,\" in the Jan. 6 riot at the U.S. Capitol. She and other Republicans  who have spread this myth have presented no evidence to back it up. There was an array of easily accessible information that refuted Chase’s claim at the time she made it.", "We rate Chase’s statement Pants on Fire.", "Amanda Chase, Speech at election protest, Jan. 6, 2021.", "Chase, Facebook post, Jan. 7, 2021.", "Chase, WRVA interview, Jan. 11, 2021 (6:46 mark).", "PolitiFact, \"Mo Brooks pushes baseless claim that antifa orchestrated Capitol riots,\" Jan. 7, 2021.", "PolitiFact, \"There’s no proof antifa stormed the Capitol. The rumor spread quickly anyway,\" Jan. 7, 2021.", "PolitiFact Wisconsin, \"No, the Capitol insurrection was not staged by antifa,\" Jan. 8. 2017", "PolitiFact, \"Texas Attorney General advances antifa conspiracy theory after Capitol riot,\" July 8, 2021.", "Legislative Information System, Senate Resolution 91, 2021 session.", "3WEAR TV, \"Gaetz defends President Trump, suggests Antifa could be behind US Capitol attack,\" Jan. 7, 2021.", "The Washington Post, \"Facebook suspends account of Virginia state Sen. Amanda Chase,\" Jan. 8, 2021.", "The Washington Times, \"CORRECTED: Facial recognition identifies extremists storming the Capitol,\" Jan. 6, 2021.", "The New York Times, \"F.B.I. says there is no evidence antifa participated in storming the Capitol,\" Jan. 8, 2021.", "The Washington Post, \"Arizona man charged in Capitol riot appears in court,\" Jan. 11, 2021.", "The Washington Post, \"Man who posed at Pelosi desk said in Facebook post that he is prepared for violent death,\" Jan. 7, 2021.", "Fauquier Times, \"RPV Chairman Rich Anderson's social media post alleging antifa involvement in U.S. Capitol attacks,\" Jan. 10, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]