["By Mitchell Aronoff", "Posted on March 23, 2020 | Updated on April 1, 2020", "The Trump administration and Congress are still negotiating a coronavirus economic stimulus package that will provide direct payments to some Americans. But this much is clear: eligibility will not depend on whether Americans respond to the 2020 census, as recent social media posts claim.", "The Trump administration and the Congress recently announced their intention to send direct cash payments within weeks to U.S. citizens as part of a stimulus package to combat the economic impact of the novel coronavirus.", "But a post being shared on Facebook falsely claims that completing the 2020 census form — which began arriving in mailboxes across the country this month — is a prerequisite for receiving these payments. “Go to 2020census.gov and fill out this census form so you can get your stimulus check. That’s how they going to know where to send the checks,” the post claims, adding: “If you don’t fill it out you will not receive a check in the mail.”", "That’s false. “Your [census] answers cannot be used to impact your eligibility for any government benefits, including any potential stimulus package,” the 2020 census website explains.", "As we’ve reported, the Treasury Department proposed a plan that would provide loans to airlines and small businesses, as well as direct payments to individuals and families.", "The Treasury plan calls for two direct payments to taxpayers totaling $500 billion. The first payment would be issued within three weeks, and a second payment of the same amount in six weeks if the economic disruption caused by the pandemic continues.", "Each payment to individuals “would be fixed and tiered based on income level and family size,” the Treasury plan states.", "The details — including who is eligible and how much they will receive — are still being hashed out by Congress, as leaders of both parties continue to negotiate.", "Under legislation proposed by Senate Republicans, according to the pro-business Tax Foundation, individual adults would receive $1,200 each, plus $500 for each child. At higher incomes, the checks would get smaller. The reductions start at $75,000 in adjusted gross income for individuals and $150,000 for married couples filing jointly.", "The Senate bill would use tax returns — not 2020 census information — as the basis for determining who is eligible and how much they will receive.", "It is important to note that everyone living in the U.S. and American territories should complete the census forms arriving in the mail or go to 2020census.gov to participate. The Constitution mandates that the U.S. population be counted every 10 years in order to determine the number of representatives each state should have and to distribute federal funds.", "But the census will not be used to determine coronavirus-related relief benefits, and failure to complete this year’s census will not preclude an individual from receiving aid through this stimulus package.", "Update, April 1: The president signed the $2 trillion stimulus package into law on March 27. Adults with an adjusted gross income of $75,000 or less will receive $1,200 (married couples with an adjusted gross income of $150,000 or less will receive $2,400, plus $500 per child). The payment amount will scale down by income, phasing out at $99,000 for single individuals and $198,000 for couples without children.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Census Responses Not Tied to Potential Stimulus Packages.” United States Census 2020 website. Accessed 23 Mar 2020.", "Cochrane, Emily, and Nicholas Fandos. “Congress and White House Struggle to Salvage $1.8 Trillion Rescue Bill.” New York Times. 23 Mar 2020.", "Cook, Nancy, and Ben White. “Emergency stimulus to soar above $1 trillion.” Politico. 17 Mar 2020.", "Henney, Megan. “Mnuchin says White House working to send $1,000 checks to most Americans within 3 weeks.” Fox Business. 19 Mar 2020.", "Konish, Lorie. “Here’s how your coronavirus rescue check from the government could be taxed.” CNBC. 20 Mar 2020.", "Restuccia, Andrew, Andrew Duehren, and Lindsay Wise. “U.S. Seeks to Send Checks to Americans as Part of Stimulus Package.” Wall Street Journal. 17 Mar 2020.", "“Stage Three Proposal.” Department of Treasury. Accessed 23 Mar 2020.", "Watson, Garrett, Taylor LaJoie, Huaqun Li, and Daniel Bunn. “Senate Releases Updated Economic Relief Plan (CARES Act) for Individuals and Businesses.” Tax Foundation. 23 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]