["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Did President Trump really say that he thinks suicide bombers should get the death penalty?", "That’s what several social media users are sharing in Facebook posts that have been circulating on the website since at least late April 2019.", "The full post reads, \"Donald Trump just said he thinks suicide bombers should get the death penalty, think about it, take all the time you need.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "No, Trump never said he thinks suicide bombers should be sentenced to death.", "The fabricated statement originated in a May 2017 story published on the satire blog, Breaking Burgh, under the headline: \"Trump Fires Up Base With Call For Death Penalty For Suicide Bombers.\" Besides the social media posts, the claim also recently appeared in a community forum on AARP’s website.", "Breaking Burgh describes its site as \"a satirical blog serving Western Pennsylvania and beyond.\"", "In the old satirical story, President Trump apparently made the suggestion (with no time or place identified) that \"anyone who terrorizes and kills good people by suicide bombing deserves nothing less than the highest penalty, which is to pay with their life,\" and \"If you detonate yourself with high explosives in the United States, I will make you regret it. Believe me.\"", "There is no evidence Trump ever said this, and while the blog has a disclaimer that all of its content is satire, the content has been repurposed in social media posts that do not provide users any information suggesting that the statement was fabricated.", "We rate this Pants on Fire!", "Facebook post, May 28, 2019", "Breaking Burgh, Trump Fires Up Base With Call For Death Penalty For Suicide Bombers, May 2017", "AARP community forum, Trump Wants Death Penalty 4 Suicide Bombers, May 8, 2019", "Breaking Burgh, About, Accessed May 29, 2019", "Snopes, Did President Trump Say Suicide Bombers Should Get the Death Penalty? May 7, 2019", "FactCheck.org, Trump ‘Quote’ Originated as Satire, May 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]