["About this rating", "More than 23,000 Iranian-born individuals were granted citizenship or lawful permanent residency in the U.S. in 2015.", "We found no evidence that 2,500 of those persons were given preferential treatment as a result of nuclear deal negotiations.", "Whether any relatives of Iranian government officials (or the officials themselves) were given preferential treatment to reside or travel in the U.S. in conjunction with nuclear deal negotiations.", "On 3 July 2018, U.S. President Donald Trump repeated via Twitter a story that had been offered by Fox News one day earlier, holding that the administration of Trump's predecessor Barack Obama had granted U.S. citizenship to 2,500 Iranians during nuclear deal negotiations in 2015:", "Just out that the Obama Administration granted citizenship, during the terrible Iran Deal negotiation, to 2,500 Iranians - including to government officials. How big (and bad) is that?", "— Donald J. Trump (@realDonaldTrump) July 3, 2018", "The Obama administration negotiated the Joint Comprehensive Plan of Action (JCPOA), a deal struck with Iran that lifted key sanctions against that country in exchange for Iran's allowing independent monitoring to ensure they were winding down their nuclear program. That plan was signed off on by all members of the United Nations Security Council, but in May 2018 President Trump abruptly backed the U.S. out of the agreement:", "The claim echoed by Trump in his tweet about \"2,500 Iranians\" was initially made by Iranian politician Hojjat al-Islam Mojtaba Zolnour and was quoted by Fars, a Persian-language news outlet with questionable reliability which is often described as a quasi-mouthpiece for the Iranian government. Fox News repeated that quote in their version of the report:", "“When Obama, during the negotiations about the [Joint Comprehensive Plan of Action] JCPOA, decided to do a favor to these men, he granted citizenship to 2,500 Iranians and some officials started a competition over whose children could be part of these 2,500 Iranians,” he claimed.", "“If today these Iranians get deported from America, it will become clear who is complicit and sells the national interest like he is selling candies to America.”", "The conservative Zolnour, who is in Ayatollah Ali Khamenei’s inner circle, added: “It should be stated exactly which children of which authorities live in the United States and have received citizenship or residency.”", "It's unclear where Zolnour, who is a critic of Iranian President Hassan Rouhani and is considered a conservative hardliner, came up with the 2,500 figure (nor did the Fox News story provide any additional information on that front).  The Fox article also referenced the names of two relatives of Iranian officials who now live in the United States (Ali Fereydoun and Fatemeh Ardeshir Larijanibut) but also noted that \"There is no suggestion either of these people received citizenship in the wake of the Iranian nuclear deal.\"", "According to Department of Homeland Security data, 10,344 Iranian-born persons became naturalized citizens of the U.S. in 2015, while 13,114 others gained legal permanent residency. Those numbers don't deviate drastically from preceding years' figures or from those of 2016, the most recent data available.", "Jeffrey Prescott, a senior director on President Obama's National Security Council, responded to the claim with a tweet labeling President Trump's statement as \"absurd and false\":", "This an absurd and false allegation. It shouldn’t be lost on anyone that this is a case of Donald Trump parroting Fox News, which is peddling the claims of an Iranian hardliner. https://t.co/AUacWXLmmC", "— Jeffrey Prescott (@jeffreyprescott) July 3, 2018", "The comment made by Zolnour likely reflects a political reality in Iran, said Alireza Nader, a Washington, D.C.-based specialist on the country. Amidst popular uprisings against a regime that many citizens consider corrupt, a number of high-ranking Iranian officials have sent their children or relatives to live in the United States. This situation has fostered resentment among Iranians who question why a privileged class are free to travel and live in the U.S. while President Trump's travel ban has rendered doing so impossible for most ordinary citizens.", "Nader told us that \"I don’t know if there was a specific policy to let [Iranian officials' families] settle [in the U.S.]. But there is definitely a sense of anger in Iran that the regime basically represses Iranians and says 'death to America,' yet sends its children to study in the U.S. and live good lives while Iranians are suffering.\"", "Zolnour's comment, Nader added, was likely a \"clumsy\" dig at Rouhani. As Washington Post journalist Jason Rezaian noted, both Trump and Zoulnor probably intended it as a slight against their domestic adversaries and not a genuine revelation of truth about an international agreement they consider disagreeable:", "Fars is also regularly used as a vehicle to slander foreign nationals imprisoned in Iran who are denied due process or the right to defend themselves. Me included.", "For Trump that doesn’t seem to matter. Any friend of fictions he’s trying to sell to the American people is a friend of his. Still, it boggles the mind that he would uncritically accept information from such a quarter.", "But Trump — just like Zolnour and his fellow thugs in the Iranian regime — has little interest in factual accuracy. He’s far more interested in assailing his domestic foes (in this case, his predecessor in office). And in this sense, we see a striking overlap between Trump and the mullahs. It’s a sort of call-and-response relationship.", "A CBS News report on this issue similarly concluded by stating that:", "Fox News noted in its story that there's no evidence to support Zolnour's claim. Zolnour is a hard-liner, and was using the claim as a cudgel against his more moderate foes in Tehran. His point was that allies of the comparatively moderate Iranian president, Hassan Rouhani, were benefiting from a secret deal with the U.S. that runs counter to Iranian interests.", "Irvine, Chris.  \" Obama Administration Granted Citizenship to 2,500 Iranians During Nuclear Deal: Iran Official.\"\r\n    Fox News.   2 July 2018.", "Rezaian, Jason.   \"Trump and Iran’s Hard-Liners Read from the Same Playbook.\"\r\n    The Washington Post.   3 July 2018.", "Borger, Julian, and Saeed Kamali Dehghan.   \"Trump Makes Unfounded Claim That Obama Gave Citizenship to 2,500 Iranians.\"\r\n    The Guardian.   3 July 2018.", "CBS News.   \"Did Obama Give Citizenship to Thousands of Iranians During Nuclear Deal Discussions?\"\r\n    3 July 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]