["Posts shared across social media claim Kamala Harris, the Democratic nominee for vice president, said in June 2019 that she did not like Joe Biden, who is now her running mate. The claim is false; the full quote matches text in a blog post written by someone else to review Harris’s performance during a Democratic primary debate.", "“‘I don’t like Joe Biden and do not like his history with certain people or who he’s aligned with, he’s trash to me.’ -- Kamala Harris June 2019,” the screenshot in an October 1, 2020 Facebook post reads.", "Other examples of the post can be found on Facebook, Instagram, and Twitter -- here and here -- as early as August 12, 2020, according to a search on social media analysis tool CrowdTangle.", "Through a keyword search, AFP Fact Check found that Harris did not make the comment which originates from a political blog entry, published on June 28, 2019.", "The author, the lead editor of FinFlam website who goes by “Big John,” was expressing his views on the first primary Democratic debate for the 2020 presidential campaign, held on June 27, 2019.", "The full quote mentioned in the Facebook posts can be found in his analysis of the debate, without quotation marks or being attributed to Harris.", "“I don’t like Joe Biden and do not like his history with certain people or who he’s aligned with, he’s trash to me,” he wrote in the fifth paragraph of the text. He then continued, directly mentioning Harris: “However, with that being said, Biden may be someone I don’t like but he does make a legitimate point when dealing with horrible people. Kamala may be taking shots for political gain and personal ones at that but what happens if she’s president?”", "During that debate, Harris confronted Biden on the issues of race and identity. He had been on the defensive over how he described working closely in the Senate with segregationists with whom he disagreed.", "Harris said she did not believe Biden was racist, but called his comments \"hurtful.\" She went on to pin down Biden on his opposition to 1970s busing programs that forced integration of segregated schools -- eloquently invoking her memory of being bused to school as a little girl.", "Biden's Democratic rivals had called for him to apologize for saying he \"got things done\" with segregationist lawmakers, which he refused.", "On August 11, 2020 Biden picked Harris to be his running mate, drawing attention to her record and making her a target for disinformation.", "The US senator, the daughter of Indian and Jamaican parents, is the first Black woman on a major presidential ticket.", "She is set to debate Vice President Mike Pence in Utah on October 7, a showdown that took on an unusually pressing quality two days after President Donald Trump left the hospital where he was being treated for Covid-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]