["A purported newspaper clipping of popular Bengali daily বর্তমান (Bartaman) is shared on social media with its headline reading, “৪২টা আসন দিন হিন্দু কীভাবে কাঁদা তে হয় দেখিয়ে দেব: মমতা (Give me 42 seats & I’ll show you how to make the Hindus cry: Mamata)”", "Mamta says, Win me 42 seats & I’ll show you how to make the Hindus cry.", "Bengali newspaper BARTAMAN HEADLINES", "Jaago Hindus jaago, abhi nahi to kabhi nahi.", "Go out in big numbers and cast your votes against this Goonda party. pic.twitter.com/qZZXFBWkxw", "— Ameeth Vorra (@ameethvorra) April 29, 2019", "The clipping has been circulated on Facebook as well.", "Mamta says, Win me 42 seats & I’ll show you how to make the Hindus cry. 🤔", "Bengali newspaper ..BARTAMAN HEADLINES", "Posted by Mukesh Bhartiya on Tuesday, 30 April 2019", "Social media users also sent a query about the newspaper cutting to Alt News.", "A careful glance at the clipping is sufficient to reveal that the image has been morphed. The font, size and colour of the words “হিন্দু (Hindu)” and “কাঁদা তে (cry)” do not match the words in the rest of the sentence. They are not in perfect alignment, are larger than the other words and are in a deeper shade of black.", "When we searched for the clipping on Facebook, we found that a user had uploaded the original photograph of the newspaper even though he had shared it with the false claim viral on social media.", "Please guys vote", "Mamta says, Win me 42 seats & I’ll show you how to make the Hindus cry.", "Bengali newspaper BARTAMAN HEADLINES", "Posted by Bhavana Kamdar on Monday, 29 April 2019", "As evident, a few words of the original headline have been replaced. The word “দিল্লি (Delhi)” has been edited to “হিন্দু (Hindu)” and the word “কাঁপাতে (shake)” has been replaced with “কাঁদা তে (cry)”. The original headline reads, “৪২টা আসন দিন, দিল্লি কীভাবে কাঁপাতে হয় দেখিয়ে দেব: মমতা (Give me 42 seats and I will show you how to shake things up in Delhi.)”", "We also found the Bartaman article on the daily’s website. According to the report, West Bengal chief minister Mamata Banerjee made the statement at an election rally for TMC candidate Apurba Sarkar in Berhampur on April 19.", "The newspaper clipping floating on social media is photoshopped. Recently, Congress president Rahul Gandhi was also targeted using a fake newspaper clipping.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]