["“The Keystone pipeline. Cancelled by Biden on first day. Warren Buffet owns the railroad that is now transporting all that oil. Warren Buffet donated 58 million to Biden campaign. Warren Buffet would lose billions in transport fees if the pipeline is completed,” said a January 27, 2021 Facebook post shared more than 63,000 times, which misspelled Buffett’s last name.", "The claim also circulated on Facebook here and here, on Instagram here and on Twitter here.", "Biden signed a flurry of executive orders on his first day in office, including one revoking the permit for Keystone XL construction.", "Keystone XL is a 1,200-mile expansion of the company’s existing pipeline system, linked to refineries on the US Gulf Coast, that from 2023 would have transported up to 830,000 barrels of crude per day from Alberta's oil sands.", "Buffett spoke in favor of the pipeline in 2014, saying in a TV interview that he would “vote ‘yes’” on the project.", "“I think probably that the Keystone pipeline is good for the country,” he added, before then-president Barack Obama blocked the project, citing the fight against climate change.", "Contrary to the claims in the social media posts, Buffett did not donate to Biden’s 2020 election campaign.", "Federal Election Commission records show the investor’s most recent personal donations date to 2019. While Biden’s campaign is not listed as a recipient, Buffett did donate to the Democratic Congressional Campaign Committee (DCCC), which campaigns to elect Democrats to the House of Representatives.", "“Mr Buffett gave no money to the Biden presidency campaign in 2020,” his assistant Debbie Bosanek told AFP by email.", "However, Bosanek added, “I can confirm that he and his wife voted for Biden.”", "With a maximum amount for a donation to a candidate committee set at $2,800, it would also have been illegal for Buffett to personally donate $58 million to Biden.", "Buffett, who is known as the Oracle of Omaha, is a longtime Democratic supporter who very publicly endorsed Hillary Clinton and financially supported Obama. But he was noticeably not vocal about supporting Biden.", "One of the firms owned by Warren Buffett’s holding company, Berkshire Hathaway, could potentially benefit from cancellation of the Keystone XL pipeline.", "BNSF Railway, a freight train company acquired by Buffett, owns train lines across North America. It transports agricultural, industrial and other products, including oil.", "“BNSF and other railroads have the ability to move Canadian crude oil,” Courtney Wallace, a spokeswoman for BNSF, said by email, adding that, “BNSF is ready to respond to market conditions to meet current or future needs for any of the variety of products that we move.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]