["By Eugene Kiely", "Posted on June 27, 2019", "President Donald Trump — without evidence — accused special counsel Robert Mueller of illegally deleting the text messages of two people who had been assigned to the Russia investigation.", "Trump made his remarks about Mueller during a June 26 interview with Fox Business Network’s “Mornings with Maria.”", "The host, Maria Bartiromo, asked Trump about the announcement that Mueller will testify on July 17 before the House intelligence and House judiciary committees. That led to a discussion, at around the 33:17-minute mark, about text messages exchanged between then-FBI agent Peter Strzok and then-FBI lawyer Lisa Page, that were critical of Trump at a time when they were assigned to the FBI investigation into whether Hillary Clinton mishandled classified information while secretary of state.", "Page, for example, referred to Trump as “a loathsome human,” and Strzok called Trump “an idiot” in a March 3, 2016, text exchange, according to a June 2018 report of the Department of Justice’s Office of the Inspector General.", "Bartiromo, “Mornings with Maria,” June 26: Well Peter Strzok and Lisa Page wrote everything down, so we’ve got all the – we’ve got all the texts.", "Trump: Well wait until you see the rest – wait until you see – no, wait until you see the rest of their –", "Bartiromo: There’s more.", "Trump: Now here’s the problem, Robert Mueller, they worked for him, and the two lovers were together and they had texts back and forth and e-mail back and forth.", "Bartiromo: How come we haven’t seen it all? I mean you did – you gave William Barr the authority to —", "Trump: He – you know why? Because Mueller terminated them illegally. He terminated the emails, he terminated all of the stuff between Strzok and Page, you know they sung like you’ve never seen.", "Robert Mueller terminated their text messages together. He would – he terminated them. They’re gone. And that’s illegal, he — that’s a crime.", "There is a lot to unpack here, but let’s start with this: There is no evidence that Mueller — or anyone else — illegally deleted text messages sent or received by Strzok and Page.", "Here’s what happened: In December 2018, the Department of Justice’s Office of the Inspector General issued a report that detailed its efforts to retrieve data from phones that Page and Strzok were given by the FBI (Samsung Galaxy phones) and the special counsel’s office (iPhones).", "As we have written before, the IG’s office said that it had recovered about 20,000 text messages sent and received by Page and Strzok on FBI-issued Samsung phones. That is why Bartiromo said “we’ve got all the texts” between the two former FBI employees.", "However, the IG report also said that Strzok and Page received iPhones from the Department of Justice after they were assigned to the special counsel’s office in the spring of 2017.", "No data could be recovered from the iPhones, because the special counsel’s office reset the phones to factory settings after Page and Strzok turned them in, according to the report. Both FBI employees had the iPhones for less than two months, and they continued to use their FBI-issued phones while working in the special counsel’s office, the IG report said.", "Breitbart, a conservative website, said the special counsel’s office “scrubbed” Strzok’s iPhone before giving it to the IG’s office, but there is no evidence in the IG report of any wrongdoing. The report notes that the DOJ “routinely resets mobile devices to factory settings when the device is returned” by an employee.", "Mueller is not mentioned in the IG report. According to public accounts, Mueller’s only role in the matter was to remove Strzok from the special counsel’s Russia investigation after he learned of the politically charged text messages. Page resigned from her position with the office.", "The IG report said “Page left the SCO on July 15, 2017,” and “Strzok was removed from the SCO investigation in late July 2017.”", "We asked the White House what evidence the president has that Mueller committed a crime, but we have not received a response.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]