["During their first debate on Sept. 29, President Donald Trump charged that Hunter Biden, the son of rival former Vice President Joe Biden, had received $3.5 million from wife of Moscow's ex-mayor and demanded an investigation.", "The president had raised the issue  Sept. 27 in a news conference in which he said the allegations \"are all questions that are very, very big on the internet.\"", "The claim was also posted by a Facebook user on Sept. 26. \"How did Robert Mueller do a 2 yr investigation on Russia and miss a $3.5 million payment to the Biden family?,\" the user wrote, adding \"#askingforafriend.\"", "Trump raised the issue of the purported Moscow payment several times during one segment of the first presidential debate, asking at one point, \"What did he do to deserve it?\"", "Biden responded each time with a series of denials, saying, \"none of that is true,\" \"my son did nothing wrong,\" and \"that is simply not true.\"", "The claim stems from an 87-page report — \"Hunter Biden, Burisma, and Corruption: The Impact on U.S. Government Policy and Related Concerns\" — by the Republican majority on the U.S. Senate Committee on Homeland Security and Governmental Affairs, chaired by Sen. Ron Johnson, R-Wisc., and the Senate Committee on Finance, chaired by Sen. Chuck Grassley, R-Iowa.", "More:GOP-led Senate committees: Hunter Biden work in Ukraine a conflict of interest, impact 'unclear'", "The report, which also raises allegations about Hunter Biden's purported links to Ukraine and China, refers to the claims about Hunter Biden and Moscow at several points, with slight variations.", "In an early section called \"key findings,\" the report says: \"Hunter Biden received a $3.5 million wire transfer from Elena Baturina, the wife of the former mayor of Moscow.\"", "Elsewhere, it says, \"Rosemont Seneca Thornton, an investment firm co-founded by Hunter Biden, received $3.5 million in a wire transfer from Elena Baturina, who allegedly received illegal construction contracts from her husband, the former mayor of Moscow.\"", "At another point, it alleges: \"On Feb. 14, 2014, Baturina wired $3.5 million to a Rosemont Seneca Thornton LLC (Rosemont Seneca Thornton) bank account for a “Consultancy Agreement DD12.02.2014.”", "In 2019, The Financial Times described Rosemont Seneca Thornton LLC as an investment firm co-founded by Hunter Biden.", "According to a footnote in the Senate report, the source of the allegation of the Moscow transaction is \"Confidential Document 6,\" which it says is on file with the committees. It does not elaborate.", "The allegation does not provide any additional detail, including whether the alleged transaction was legal.", "Rosemont Seneca Thornton, LLC, was incorporated in Delaware on May 28, 2013. The records do not name the founders.", "Fact check:No evidence Biden wore wire at Ohio debate", "Sen. Gary Peters, D-Mich., ranking member of the Homeland Security and Governmental Affairs Committee, and Sen. Ron Wyden, D-Ore., ranking member of the Finance Committee, responded to the report by calling it a \"failed effort\" by the Republicans to \"manufacture dirt\" on Joe Biden.", "\"The Republican Chairmen’s use of confidential Treasury documents to justify its unsubstantiated allegations and personal attacks against Vice President Biden’s family is grossly irresponsible,\" the response said. \"The information in the documents cited by the Republicans has not been verified, and we are not aware of any other Congressional committee ever releasing this sort of information in this manner.", "\"Any credible investigation would have sought the underlying financial records at issue and spoken to the involved parties,\" they continued. \"At Chairman Johnson’s request, HSGAC authorized 46 subpoenas across four business meetings related to his current investigations, none of which sought information that could substantiate or verify the information in these documents.\"", "Regarding the specific Moscow allegation, Alison Green, spokesperson for the minority on the Homeland Security Committee, and Keith Chu, spokesperson for the minority on the Finance Committee, issued a joint statement that said, \"Democratic staff has reviewed all known information on file with the Committees, however, including the confidential document cited by the Republicans, and are aware of no information in the Committees’ possession showing Hunter Biden had any financial interest in this entity or transaction.\"", "USA TODAY asked a spokesperson for the Republican majority for a comment but did not get an immediate response.", "Hunter Biden's lawyer, George Mesires, told CNN that his client was not an owner of the firm, Rosemont Seneca Thornton.", "“Hunter Biden had no interest in and was not a ‘co-founder’ of Rosemont Seneca Thornton, so the claim that he was paid $3.5 million is false,” Mesires told CNN.", "USA TODAY asked the Facebook user who posted the claim for a comment but did not get an immediate reply.", "PolitiFact has found the allegation \"unproven.\"", "Fact check:Joe Biden called troops 'stupid bastards,' but only 'jokingly'", "The claim has been denied by Biden's lawyer, who says his client was not a co-founder of the entity purportedly receiving the money. The source, from a Republican majority's Senate committee report, is linked to a confidential document without elaboration. Without knowing what that document contains, the allegation is unproven, therefore we rate it as MISSING CONTEXT.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]