["About this rating", "Approximately 9% of the stimulus bill is aimed at providing funding for vaccine distribution, medical equipment, and other health resources to combat COVID-19.", "However, the \"9%\" figure does not include stimulus checks, unemployment benefits, funding for schools, or other measures directed at providing relief for those impacted by COVID-19 under the relief plan.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On March 11, 2021, U.S. President Joe Biden signed the American Rescue Plan, a $1.9 trillion stimulus package to provide relief to Americans who have been struggling during the COVID-19 pandemic. In the days leading up to this bill's passage, a number of Republican lawmakers and pundits criticized the bill, arguing that only 9% of the relief package had anything to do with COVID-19.", "Conservative author Melisa Tate, for example, wrote on Twitter that the bill \"only gives 9% to the American people\" while the rest went to politicians and their cronies. Sen. Marsha Blackburn, R-Tenn., said that she voted against the \"COVID relief\" bill because \"only 9% of this bill is COVID-related\" while \"the rest is allocated to liberal pet projects and blue state bailouts.\"", "The claim that only 9% of the $1.9 trillion American Rescue Plan is going to COVID relief is largely false. The vast majority of this bill will provide financial relief to people, businesses, and governments who have struggled during the COVID-19 pandemic.", "The argument that only 9% of the measure will go to COVID relief appears to be an exaggeration of the fact that the American Rescue Plan will provide approximately $160 billion (about 8.5% of the total) for testing, protective gear, vaccine production and distribution, and other measures to directly combat the virus.", "While it's true that only about 9% of this bill goes to fighting the virus directly, that figure does not include the vast majority of funds aimed at providing financial relief to those who have struggled through the pandemic. For example, the 9% does not include the most famous part of the American Rescue Plan, the $1,400 stimulus checks for individuals, which is expected to amount to around $400 billion (or about 21% of the total). This 9% figure also doesn't account for items such as unemployment insurance, a child tax care credit, funding for schools to re-open, rent assistance, and other measures aimed at providing relief to Americans.", "Sen. Angus King, I-Maine, told NPR that there were two parts to the American Rescue Plan. The first dealt with combating COVID directly, while the second aimed at dealing with the financial crisis that resulted from the pandemic:", "\"There are really two pieces to this bill. One is directly related to the health crisis, but the other, and the larger piece, is related to the economic crisis that the health crisis has created.\"", "The vast majority of the American Rescue Plan is concerned with providing relief to people, businesses, and governments that have suffered during the COVID-19 pandemic. According to the Committee for a Responsible Federal Budget, about $300 billion (or 15% of the bill) \"is spent on long-standing policy priorities that are not directly related to the current crisis.\" In other words, about 85% of the bill is related specifically to the impacts of COVID-19.", "In short: The American Rescue Plan is a multi-faceted, $1.9 trillion to bill that provides financial relief to those struggling during the COVID-19 pandemic. While it's true that only 9% of this funding will be used to directly combat the virus (via vaccine distribution and other health measures), this bill provides relief to Americans in several other ways. The $1,400 COVID-19 relief checks, for example, account for more than 20% of this $1.9 trillion bill.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]