["About this rating", "Every year on December 25, inhabitants of the Chumbivilcas Province of Peru gather for a festival. But you won't find Christmas lights or eggnog. Instead, residents gather for Takanakuy, an annual tradition where residents settle their differences with a public fist fight.", "A viral meme sums up the basics of the tradition:", "The content in this meme is accurate.", "Takanakuy is a tradition in this region of Peru that features people settling their differences in order to start the year anew. The picture included in this meme was taken by Julio Angulo and shared to Flickr in December 2012 along with the following caption (translated via Google):", "Feast of the fists in the heights of Chumbivilca - Cusco - Peru.", "Protected by his ski mask, Fernando Huamaní feels the bravest of all Chumbivilcanos. For this year he has challenged Ricardo Ugarte to fight in the Santo Tomás bullring, the heart of the province of Chumbivilcas. It will be in public and without anyone intervening, unless their lives are in danger.", "The challenge was met on December 25 at one in the afternoon. They were not the only ones who defended their honor and the name of their family with a bare fist, because that day at least 40 people also did so in the traditional Takanakuy, a pagan-religious festival in which the inhabitants of this Cusco province put to the test his bravery, fitness and courage. And sometimes also his most hidden hatreds and rancor.", "In Cusco, every December 25 and 26, men, women, and children fight each other to settle rivalries or simply win the respect and admiration of their neighbors. They do it spontaneously, following an ancient tradition.", "Suemedha Sood wrote about Takanakuy, which also involves music, dancing, drinking and other more commonplace festivities, for the BBC in 2012:", "Each year, the Peruvian province of Chumbivilcas hosts the vibrant Christmastime festival of Takanakuy. High up in the Andes Mountains, at an elevation of around 3,600m in the well-known Cusco region, communities get together for celebrations involving music, dancing, drinking, eating and brightly coloured costumes. It’s much like any number of festivals in Latin America – except this holiday gathering culminates with a series of public fist fights on Christmas Day (25 December).", "Entire towns congregate around sporting arenas to watch members of the community fight each other. People of all ages enter the ring, from young children to the elderly, and participation is open to women and men alike. The purpose of Takanakuy is to settle grievances built up over the year -- be they civil disputes or personal ones -- in a public forum.", "Takanakuy, which translates to “when the blood is boiling” in Quechua (the primary language in the region), is a sort of more organized version of the comical “Festivus”, a holiday that most people believe was invented by the 1990s US TV sitcom Seinfeld.", "A reporter from Vice Magazine traveled to Peru to experience Takanakuy back in 2012 and spoke to a man named Victor Jaime Mantilla about the tradition. Mantilla said that the fighting helps maintain order in the province and noted that all fights start and end with a hug.", "Mantilla said:", "This is a way to maintain order in Chumbivilcas. A lot of districts around here don't have police stations. It's one of the first things they should have in a zone like this, but there's nothing because this is how laws are regulated here ...", "Before, justice in Chumbivilcas was solely administered by powerful people, people from the community always lost their case. What can I do with a justice like that? I'd rather have my own justice in public ...", "It's a way for the people to speak up. It's like we solve it here and we start something new, but in peace. That's why Takanakus both starts and ends with a hug. It's an important role of Takanakuy.", "Here's a video report from Vice about Takanakuy:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]