["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. John Kasich announced in his State of the State address his decision to not build a psychiatric hospital on Euclid Avenue in the Midtown area of Cleveland.\n\nThe Ohio Department of Mental Health, he said, would scrap \"some sort of an informal commitment to build a building in downtown Cleveland,\" and instead would renovate Northcoast Behavioral Healthcare's \"dilapidated\" facility in Northfield.\n\nKasich said he broke the news to Cleveland Mayor Frank Jackson in a phone call and that Jackson responded that he understood. The result, Kasich said, will be reduced operating expenses, money saved on capital improvements and better care for the mentally ill.\n\nJackson subsequently said he did not acquiesce as Kasich implied. Andrea Taylor, a spokeswoman, said Jackson told Kasich he understood the rationale but that he didn’t agree with the decision.\n\nOther local officials argue that the project was not intended as a building development for Cleveland but as a service for patients and their families, most of whom are from Cuyahoga County.\n\nPolitiFact Ohio is not weighing the merits of the two sites and plans. This item will just consider Kasich's statement about \"some sort of an informal commitment to build a building in downtown Cleveland.\"\n\nWe asked the governor's office for supporting details, and got them from Trudy Sharp, communications director for the Department of Mental Health. The mayor's office connected us with Chris Warren, Jackson's chief of regional development.\n\nBoth sides -- if they can be called sides -- gave essentially the same accounting of events:\n\nAs far back as 2003, the state began looking to replace Northcoast Behavioral Healthcare's facility on West 25th Street in Cleveland. By 2007, the plan expanded to include replacement of the Northfield facility on a single site in Cuyahoga County.\n\nIn 2008, without designating a site, the General Assembly budgeted $83.7 million \"to replace the Cleveland facility, with consideration for expansion that will allow for the merger of the Cleveland and Northfield facilities.\"\n\nAfter considering at least 10 sites, the city and state signed a letter of intent in June 2009 to use property on Cleveland’s Euclid Avenue in the Midtown Corridor, with various conditions. Both had the right to end the agreement without penalty.\n\nTo meet conditions, Warren said, the city spent $4 million assembling and preparing the 14-acre site. The state would have paid the city $2.1 million for it.\n\nSharp said the letter expired at the end of 2009, and the city did not extend it. Warren said the letter did not expire but would have had to be actively terminated. He noted that correspondence and meetings between the city and state continued through 2010, and that the city's work on the hospital site continued.\n\nWarren and Taylor said the city learned of Kasich's decision to instead renovate the Northfield facility, without a chance for discussion, 48 hours before it was announced.\n\n\"Legally they're within their rights,\" Warren said. He said the city had accepted a risk in acquiring and preparing the property, which now is \"very marketable.\"\n\nBut developing the property \"is not what it (the agreement) was to do,\" he said. \"It was to provide mental health services, to keep services in Cleveland. That was the intent of the appropriation.\"\n\nOf the $83.7 million allocated for construction, $60 million will go to renovation in Northfield, Sharp said. The rest will go to other facilities around the state. She said the department would save money because the projected cost of a new facility in Cleveland had climbed to $100 million.\n\nWhere does that leave us?\n\nIt is true that a letter of intent is not a binding, irrevocable agreement. But the letter of intent is also more than just a wink and a nod. A letter of intent is an understanding that often is preliminary to a formal contract.\n\nA story March 19 in The Plain Dealer bought into Kasich’s terminology, describing site work Cleveland did as \"part of an informal agreement with the state.\"\n\nBut is that what an average person would think knowing all the details?\n\nCharacterizing the arrangement as \"some sort of an informal commitment to build a building in downtown Cleveland\" suggests vagueness about the plans. That’s not the case. People in Cleveland and Columbus worked for years on this project.\n\nWe think a listener hearing Kasich's description would be surprised by these details:", "Given those details, we think characterizing the effort as some sort of an informal commitment is not just misleading, but also inaccurate.\n\nOn the Truth-O-Meter, that rates as False.", "Gov. John R. Kasich, State of the State Address, March 8, 2011\n\nThe Plain Dealer, \"Democratic leader Armond Budish, local advocates dispute Gov. John Kasich's remarks on proposed mental health hospital in Cleveland,\" March 8, 2011\n\nThe Plain Dealer, \"Local leaders speak out against decision not to build psychiatric hospital in Cleveland,\" March 19, 2011\n\nThe Plain Dealer, \"Cleveland buying Euclid Avenue land from RTA for state psychiatric hospital project,\" Oct. 20, 2009\n\nThe Plain Dealer, \"State picks Midtown Cleveland for psychiatric hospital,\" July 2, 2009\n\nLetter of Intent between city of Cleveland and Ohio Department of Mental Health, June 30, 2009\n\nOhio Legislative Service Commission, 127th General Assembly Capital Budget Bill, HB 562, May 28, 2008\n\nOhio Legislative Service Commission, Ohio Department of Mental Health, Facilities Improvement Fund\n\nOhio Department of Mental Health, Northcoast Behavioral Healthcare\n\nInterview with Andrea Taylor, press secretary to Mayor Jackson, April 4, 2011\n\nInterview with Cleveland development director Chris Warren, April 4, 2011\n\nEmail interview with Trudy Sharp, Ohio Department of Mental Health communications director, April 5, 2011\n\nInterview with Trudy Sharp, April 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]