["A photograph of Prime Minister Narendra Modi is being circulated in large numbers on social media. It shows PM Modi seated next to a woman. Former Canadian Prime Minister Stephen Harper too can be seen in this photo. The message that accompanies the photograph says, “तो देख लो साहब विदेशी दौरा क्यों करते हैं “(Take a look at what Saheb does on his foreign travels- translated).", "तो देख लो साहब विदेशी दौरा क्यों करते हैं", "Posted by Shakshi Sharma on Sunday, October 14, 2018", "The above post is by a Facebook user Shakshi Sharma, who uploaded it on October 15. At the time of writing, this post had been shared over 6800 times.", "Alt News found that the image has been circulating on the internet for over a year and has been used for representational purposes for many YouTube videos.", "Using the reverse image search tool, Alt News found that the image is photoshopped. The original photograph was found on a website Live Cities which had published an article about the woman seen in the picture, posted below.", "In the above photograph, the woman shown seated next to PM Modi is Dr. Gurdeep Kaur Chawla, who is an interpreter. She is the founder-director of Indian Languages Services, a California-based organisation that provides interpretation and translation services. Dr. Chawla has been seen on numerous occasions with top political leaders and corporate doyens from across the globe. Dr. Chawla has been profiled by more than one news organisation, including Economic Times, ABP Asmita and Punjab Kesari.", "Alt News could not independently verify the identity of the woman in the photoshopped image of PM Modi shared on social media. Image morphing is the simplest and most common technique used for spreading misinformation on social media, and is especially used to malign individuals. It does not require expertise- there are numerous tools for the same. Viewers and readers are encouraged to verify images they may find suspect, through tools like reverse image search.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]