["Neither drinking a lot of water, nor gargling with warm water and salt or vinegar, has been identified as working against the coronavirus.", "There is no remedy yet to prevent or treat the disease.", "One myth making the rounds on social media is that if coronavirus gets in your mouth, you should drink lots of water to get it into your stomach, where acids will kill it. Health officials and media outlets debunked that one, and we rated it False.", "Now comes a supposed remedy that’s a bit more complex: Drinking lots of water and gargling. That’s the recommendation from a viral image of a mannequin-like head and neck with these words:", "\"Corona virus before it reaches the lungs it remains in the throat for four days and at this time the person begins to cough and have throat pains. If he drinks water a lot and gargling with warm water & salt or vinegar eliminates the virus.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s false. And it’s part of a growing body of misinformation about coronavirus on social media.", "\"While staying hydrated by drinking water is important for overall health, it does not prevent the coronavirus,\" the World Health Organization warns.", "Gargling won’t do the trick, either (even if gargling with salt water can ease a sore throat).", "\"No specific treatment for COVID-19 is currently available,\"  the U.S. Centers for Disease Control and Prevention has declared about the coronavirus disease.", "Similarly, the World Health Organization states \"there is no specific medicine recommended to prevent or treat the new coronavirus (2019-nCoV).\"", "Among the tips the WHO offers to contain the spread of the virus:", "Regularly and thoroughly clean your hands with an alcohol-based hand rub or wash them with soap and water.", "Stay at least 3 feet away from anyone who is coughing or sneezing.", "Avoid touching your eyes, nose and mouth.", "Health experts say no coronavirus remedy has yet emerged. So drinking lots of water, or gargling with warm water and salt or vinegar, won’t eliminate it.", "We rate this False.", "Facebook, post, March 13, 2020", "Lead Stories, \"Fact Check: Memes With Advice For Preventing Coronavirus Are Not Accurate,\" March 11, 2020", "Twitter, World Health Organization tweet, Feb. 7, 2020", "U.S. Centers for Disease Control and Prevention, \"Interim Clinical Guidance for Management of Patients with Confirmed Coronavirus Disease (COVID-19),\" March 7, 2020", "Snopes, \"Will Gargling with Salt Water or Vinegar ‘Eliminate’ the COVID-19 Coronavirus?\" March 14, 2020", "Rappler, \"False: Gargling salt water ‘eliminates’ coronavirus,\" March 14, 2020", "World Health Organization, Coronavirus disease (COVID-19) advice for the public: Myth busters,\" accessed March 15, 2020", "AFP FactCheck, \"These 14 claims on COVID-19 are viral, but misleading,\" March 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]