["About this rating", "The black lawn jockey is typically thought of as a piece of racist memorabilia, but a viral Facebook post in January 2016 sought to reverse that image by claiming that these miniature statues were actually used to aid slaves traveling on the Underground Railroad and were therefore the least racist items that could be displayed in front of a home:", "A lot of people don't know the real meaning behind these statues, so they vandalize them, bitch about them being racist, etc. During the US slave era, the image of a black 'footman' with a lantern signified the home was a stop on the Underground Railroad. These are largely a northern thing, and weren't commonly found in the South until after WWII when northerners moved there and brought this custom with them. The clothing of the statue was also coded. A striped jockey's shirt meant that this was a place to swap horses, while a footman in a tailed coat meant overnight lodgings/food, and a blue sailor's waistcoat meant the homeowner could take you to a port and get you on a ship to Canada. I always laugh when I hear folks talk about how racist these are, because honestly, the cats who had them were likely the LEAST racist. Later, these came back into popularity after WWII, and they were again coded to show the white homeowners supported early civil rights efforts, weren't Klan, etc.", "https://www.ugrrf.org/", "This notion isn't a new theory. Charles Blockson, the curator of the Afro-American Collection at Temple University in Philadelphia, believes that the lawn jockey is frequently misunderstood and is actually a positive and supportive figure for African-Americans. Blockson was interviewed for a Feb. 8, 1998, article in the Chicago Tribune:", "Most people shudder at the sight of a black lawn jockey.", "Though sightings are pretty infrequent today, the yard ornaments that portray blacks in subservient roles have the power to gnaw insatiably at the spirit of blacks and to disgust others who are unaware of the furtive and notable role these \"Jockos\" played in the first half of the 19th century.", "But escaping slaves understood then that the jockey statue would guide them to the Underground Railroad and to freedom ...", "\"These statues were used as markers on the Underground Railroad throughout the South into Canada,\" said historian/author Charles Blockson, curator of the Afro-American Collection at Temple University in Philadelphia. \"Green ribbons were tied to the arms of the statue to indicate safety; red ribbons meant to keep going.\"", "\"People who don’t know the history of the jockey have feelings of humiliation and anger when they see the statue,\" he added. \"But this figure which was sometimes used in a clandestine nature, and sometimes without the knowledge of the person who owned the statue, was a positive and supportive image to American-Americans on the road to freedom.\"", "The origin of the lawn jockey figure is often attached to the legend of Jocko Graves. According to the River Road African American Museum, Jocko Graves was the 12-year-old son of a free Black man who wanted to help Revolutionary War commander-in-chief George Washington cross the Delaware River to attack Hessian forces in Trenton, New Jersey, in December 1776. Graves was too young to join Washington on the crossing, so he reportedly volunteered to watch the general's horses instead; unfortunately, young Graves froze to death in the effort. Moved by the boy's sacrifice, Washington supposedly commissioned a statue in Graves' honor which became the prototype for the modern lawn jockey:", "This theory, however, is likely not rooted in fact. In 1987, Ellen McCallister Clark, a Mount Vernon librarian, wrote that historians there had found no record or account of a person named Jocko Graves:", "\"The story is apocryphal; conveying a message about heroism among blacks during the Revolutionary War and General Washington's humanitarian concerns, but it is not based on an actual incident. Neither a person by the name of Jocko Graves, nor the account of any person freezing to death while holding Washington's horses has been found in any of the extensive records of the period. Likewise, the Mount Vernon estate was inventoried and described by a multitude of visitors over the years and there has never been any indication of anything resembling a 'jockey' statue on the grounds. I have put the story in the category with the cherry tree and silver dollar, fictional tales that were designed to illustrate a particular point.\"", "The Jim Crow Museum also pointed out some problematic issues with the idea that lawn jockeys were used to help slaves make their way to freedom through the Underground Railroad:", "A problem with this account, however, is that the use of red and green as signal colors dates back to World War I railroad signals, long after the late-1700s as suggested by Blockson.", "Another potential problem with this story is that runaway slaves often traveled at night and the darkness would have made it difficult to see different shades of cloth ...", "David Pilgrim, curator of the Jim Crow Museum, acknowledged that no consensus explanation existed for the lawn jockey, and that the common legends about their origins are not currently supported by much evidence. Nonetheless, he doubted that those displaying black lawn jockeys were aware of the legends concerning \"Jocko Graves\" or the Underground Railroad:", "I do believe that there is a consensus view in African American communities that black lawn jockeys are demeaning relics of a racist past. They may not have started out with a racist meaning — or always had that meaning — but that is the meaning they have today. There are, undoubtedly, non-racist reasons for owning and displaying black lawn jockeys, but it would be hard for an adult American to claim that he or she does not know that many African Americans find lawn jockeys racially offensive, especially the ones with jet-black skin and oversized lips.", "Lexington Herald-Leader.   \"Jockey Statues Marked Underground Railroad.\"\r\n    22 February 1998.", "Sherrod, Pamela.   \"The Secret Life of the Black Lawn Jockey.\"\r\n    Chicago Tribune.   8 February 1998.", "The National Great Blacks in Wax Museum.   \"The Legend of Jocko.\"\r\n    Retrieved January 2016.", "Jim Crow Museum of Racist Memorabilia.   \"Question of the Month: Lawn Jockeys.\"\r\n    July 2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]