["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this May 2, 2017 photo, Todd Alexander poses at his mobile home in Milton, Vt., that he heats with the help of the Low Income Home Energy Assistance Program. (AP)", "President Donald Trump proposed eliminating a program to help millions of Americans heat or cool their homes, according to a viral story by a liberal website.", "\"Trump vows to end winter heating assistance for elderly and disabled,\" stated the Nov. 26 headline by Democrats Rising, an anti-Trump website.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. We found that this story failed to tell the entire story: while Trump proposed getting rid of a heating assistance program several months ago, the federal government has continued to fund it.", "The Democrats Rising article, written as winter weather was setting in, misleads by stating that millions of households will be at risk of losing heat this winter. But that’s not what the facts show.", "Democrats Rising didn’t name the program, but it appears to be a reference to the Low Income Home Energy Assistance Program (LIHEAP), a program started in 1981. The program provides federal dollars to help poor people pay their home energy bill, energy crises, weatherization and energy-related minor home repairs. On average, the annual heating/winter crisis assistance benefit per household was $371 in fiscal year 2015.", "In March, Trump’s budget blueprint called for cutting money for several programs that help low-income Americans including LIHEAP. The document said that LIHEAP \"is a lower-impact program and is unable to demonstrate strong performance outcomes.\"", "The budget request for the Administration for Children and Families stated that utility companies and state and local governments provide significant heating and cooling assistance and that the majority of states prohibit utilities from discontinuing heat during the winter.", "Trump’s proposal faced pushback from senators, including many in cold weather states.", "A bipartisan group of a few dozen senators wrote a letter in September urging the federal government to release funds for LIHEAP as quickly as possible under the continuing resolution.", "U.S. Sens. Susan Collins, R-Maine, and Jack Reed, D-R.I., led the bipartisan group to push for $3.39 billion, the same amount allocated in the previous fiscal year.", "On Sept. 8, Trump signed the continuing resolution to continue funding appropriations for a few months. That allowed the Department of Health and Human Services in October to release $3.03 billion for states, tribes and territories for the heating program for fiscal year 2018. That represents 90 percent of the funding available under the continuing appropriations act.", "We asked a spokeswoman for Health and Human Services when the remaining 10 percent will be provided. Trump’s proposed budget did not include funding for LIHEAP, Monique Richards said. Funding will be determined by the passage of appropriations legislation from Congress.", "In the past, the federal government has released 90 percent of the funding under a \"seasonability exception,\" said Mark Wolfe, executive director of the National Energy Assistance Directors’ Association.", "\"Because LIHEAP spends so early in the fiscal year, if funding was delayed it would cause a hardship to low-income families,\" he said.", "A spokesman for Trump did not respond to our questions.", "Our ruling", "Democrats Rising said that \"Trump vows to end winter heating assistance for elderly and disabled.\" There is a kernel of truth in that headline, because Trump’s budget blueprint in March proposed eliminating LIHEAP.", "But Democrats Rising omits the final outcome: amid pushback from a bipartisan group of senators, the heating assistance program continued. In October, the federal government released $3 billion for the program.", "We rate this statement Mostly False.", "Democrats Rising, \"Trump vows to end winter heating assistance for elderly and disabled,\" Nov. 26, 2017", "U.S. Sen. Susan Collins, \"Bipartisan group of 39 senators, including Senator King, asks for speedy delivery of funding to those in need as winter approaches,\" Sept. 21, 2017", "U.S. Department of Health and Human Services, Justification of estimates for appropriation committees, May 2017", "Washington Post, \"Support for low-income Americans targeted in Trump's budget proposal,\" March 17, 2017", "Chicago Tribune, \"A cool response to Trump plan to stop heating aid; 43 senators urge key committee to ensure continued funding,\" (Accessed in Nexis) July 4, 2017", "Snopes, \"Does President Trump Plan To 'End' A Program Funding Heating For the Elderly and Disabled?\" Nov. 2, 2017", "Interview, Mark Wolfe, National Energy Assistance Directors' Association executive director, Jan. 2, 2018", "Interview, Monique Richards, U.S. Department of Health and Human Services Administration for Children and Families spokeswoman, Jan. 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]