["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent Facebook post recounts a story by ABC News about a White House event involving supporters of President Donald Trump, but it gets the details wrong.", "\"ABC News has confirmed that attendees toTrump WH Rally were paid. $150. ea and had to sign an NDA,\" the post says.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Hundreds of people gathered on the White House’s South Lawn on Oct. 10 for an event the Washington Post described as resembling a campaign rally. Trump delivered a short speech and attacked his political opponents, saying \"we’ve got to vote these people into oblivion.\" Attendees wore \"Make America Great Again\" hats and \"BLEXIT\" T-shirts, according to the Post.", "The BLEXIT movement was started by the conservative commentator Candace Owens and encourages Black Americans to leave the Democratic Party.", "ABC News reported that some of the event’s guests had their travel and lodging paid for by BLEXIT.", "Supporters were invited by BLEXIT to attend a \"HUGE outdoor rally\" and asked to fill out a form that notified them that the group would cover travel costs, ABC said. Guests were later informed they would receive an invitation from the White House to attend an event with Trump and were required to wear a BLEXIT shirt.", "ABC said it wasn’t \"immediately clear\" how many people attending the event had their travel costs covered. After Trump’s speech, some BLEXIT attendees marched downtown chanting \"back the blue\" and \"blue lives matter,\" the DCist reported.", "In an Instagram post the week before the event, Owens promoted an \"anti-Black Lives Matter event\" and a \"pro-police event,\" noting that BLEXIT would be giving away a limited number of travel stipends to those that really needed them.", "A White House spokesperson told ABC News that the White House wasn’t involved \"in covering any cost.\"", "The ABC News story doesn’t mention $150 or a nondisclosure agreement.", "We reached out to the national director of BLEXIT to ask about the post but did not immediately receive a reply.", "However, this Facebook post gives the impression that every person who attended the event at the White House on Oct. 10 was paid $150 and had to sign an NDA. There’s nothing in the ABC News story to support this, and we didn’t find any other news coverage to corroborate this claim.", "We rate this Facebook post False.", "Facebook post, Oct. 12, 2020", "ABC News, Candace Owens’ BLEXIT groups pays some attendees’ travel to Trump’s White House event, Oct. 10, 2020", "The Washington Post, Trump taps U.S. Marine Band for White House event and raises questions about employing the military for political purposes, Oct. 11, 2020", "The New York Times, Trump makes first public appearance since leaving Walter Reed, Oct. 10, 2020", "DCist, Hundreds gather at White House for ‘BLEXIT’ rally, Trump speech, Oct. 10, 2020", "Candace Owens Instagram post, Sept. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]