["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump addresses the nation from the White House on Jan. 8, 2020, in Washington, as Vice President Mike Pence and others look on. (AP/ Vucci)", "President Donald Trump touted U.S. military might in a White House address responding to Iranian missile strikes launched against U.S. troops in Iraq.", "\"The American military has been completely rebuilt under my administration at a cost of $2.5 trillion,\" Trump said in the Jan. 8 address. \"U.S. armed forces are stronger than ever before.\"", "\"The fact that we have this great military and equipment, however, does not mean that we have to use it,\" he continued. \"We do not want to use it.\"", "RELATED: Fact-checking Donald Trump's speech after Iran missile strikes on US troops", "We wondered if Trump really put that much money toward a rebuild, so we decided to put his claim to the Truth-O-Meter. We found that he overstated the degree to which the United States’ military investments have gone toward restoring the military’s equipment and capabilities.", "The White House did not respond to requests for comment.", "Experts pointed us to the total defense budgets for the last four fiscal years, which run from October through September.", "In the 2017 fiscal year, which began under President Barack Obama and extended into Trump’s term, $606 billion was spent on defense. In the 2018 fiscal year, that number was $670.6 billion.", "The 2019 fiscal year saw $685 billion enacted for defense. And for the 2020 fiscal year, Trump signed a bill in December — three months after the fiscal year began — that authorized $738 billion for the Pentagon.", "So, the total amount of money earmarked for defense under Trump comes out to nearly $2.7 trillion, which is slightly higher than his talking point.", "But counter to Trump’s framing, not all of that money has been spent. Trump lumped the $738 billion for 2020 that he approved in December into his $2.5 trillion cost estimate. At a little more than three months into the fiscal year, that money will take time to serve its purpose.", "Rebuilding the military would also require new equipment that can take years to build and develop; it isn’t likely that the funds just allocated for 2020 have already been used to assemble new ships, submarines, fighter jets and weapons, as Trump’s claim suggested.", "Plus, only some of the money dedicated to defense has gone toward procurement, or buying and upgrading equipment. It hasn’t all been put toward a complete overhaul.", "The Pentagon spent roughly $419 billion on procurement through the first three fiscal years of Trump’s presidency, and Congress appropriated about $143.5 billion more in the spending bill Trump signed for the 2020 fiscal year, bringing that total to about $562.5 billion.", "The rest of the defense dollars over the last four years have been directed toward research and development, military personnel, and operation and maintenance costs, among other things.", "Experts also noted that the bulk of the $2.5 trillion would have been spent anyway, regardless of who was president.", "\"Most of that money was going to be spent under Obama,\" said Michael O’Hanlon, a senior fellow in foreign policy at the Brookings Institution. \"Trump’s net increases have been about $100 billion each year, or $400 billion total compared with earlier expectations.\"", "The administration’s scaled-up defense spending has helped make troops and equipment more ready for combat, O’Hanlon said. But overall, Trump’s claim of a total rebuild is \"hyperbole.\"", "\"Most weapons are the same as before,\" O’Hanlon said. \"There is more continuity than change in defense policy from Obama to Trump.\"", "According to an index of the military’s strength by the conservative Heritage Foundation, the military currently receives a grade of \"marginal.\"", "\"The active component of the U.S. military is two-thirds the size it should be, operates equipment that is older than should be the case, and is burdened by readiness levels that are problematic,\" the report concluded.", "\"The current U.S. military force is likely capable of meeting the demands of a single major regional conflict while also attending to various presence and engagement activities,\" it said. \"It would be very hard-pressed to do more.\"", "Trump said, \"The American military has been completely rebuilt under my administration at a cost of $2.5 trillion.\"", "The military is far from \"completely rebuilt.\" The Trump administration has made some strides in improving the military’s operational readiness, but most weapons and infrastructure are the same as they were before Trump took office.", "The element of truth is in Trump’s $2.5 trillion number, which comes from the total defense budgets for the last four fiscal years.", "Still, not all of that money has been spent, and not all of it has gone toward what would be considered a rebuild under any reasonable definition of the phrase.", "We rate this statement Mostly False.", "C-Span, \"President Trump Address to Nation on Iran,\" Jan. 8, 2020", "Congress.gov, \"S.1790 - National Defense Authorization Act for Fiscal Year 2020,\" Dec. 20, 2019", "U.S. Department of Defense, \"National Defense Budget Estimates for FY2020,\" May 2019", "U.S. Department of Defense, \"Defense Budget Overview,\" March 2019", "The Washington Post, \"Fact-checking Trump’s address on the Iran missile attacks,\" Jan. 8, 2020", "The Associated Press, \"AP FACT CHECK: Trump minimizes IS risk, distorts Iran payout,\" Jan. 8, 2020", "The New York Times, \"Trump’s Inaccurate Statements About the Conflict With Iran,\" Jan. 8, 2020", "USA Today, \"Fact check: Trump discusses escalation of tensions with Iran in televised speech,\" Jan. 8, 2020", "The Washington Post, \"Trump overstates military spending and readiness in face of Iran conflict,\" Jan. 6, 2020", "Todd Harrison on Twitter, Jan. 6, 2020", "The Heritage Foundation, \"An Assessment of U.S. Military Power,\" Oct. 30, 2019", "Breaking Defense, \"Trump’s Claim Of $2.5 Trillion In DoD Dough: Not True,\" Oct. 1, 2019", "Email interview with Christopher Preble, vice president for defense and foreign policy studies at the Cato Institute, Jan. 9, 2020", "Email interview with Michael O’Hanlon, senior fellow and director of research in foreign policy at the Brookings Institution, Jan. 9, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]