["About this rating", "The parents of a student in Kenosha, Wisconsin filed suit against Kenosha Unified School District No. 1 Board of Education alleging (among other things) that the board \"instruct[ed] guidance counselors to issue bright green wristbands to transgender students at the school, to more easily monitor and enforce these students’ restroom usage.\"", "The issue didn't involve schools across the entire state of Wisconsin, and students were not forced to wear Nazi-like \"pink triangles.\"", "Whether the details as stated in the lawsuit are accurate.", "On 20 July 2016, the Daily Beast published an article about a lawsuit filed in Wisconsin by the parents of a transgender boy, alleging that he and other transgender students were forced by their school district to wear \"bright green wristbands\" as a form of identification with respect to bathroom use in particular:", "A federal Title IX lawsuit filed in Wisconsin alleges that the Kenosha Unified School District instructed guidance counselors to have Ash Whitaker, a 16-year old transgender boy, and “any other transgender students at the school” wear “bright green wristbands” so that the school could “more easily monitor and enforce [their] restroom usage.”", "Ash Whitaker made headlines this year when he was allowed to run for prom king after initially being denied the opportunity to run. His mother, Melissa, is a co-plaintiff in the suit and a teacher at his school.", "The article included a link to the lawsuit [PDF], which was filed on 19 July 2016 and alleged that the district and its employees misgendered the student and insisted upon the wearing of wristbands in order to monitor bathroom usage:", "Defendants Kenosha Unified School District No. 1 Board of Education (the “Board”), Superintendent Sue Savaglio-Jarvis, and their agents, employees, and representatives, have repeatedly refused to recognize or respect A.W.’s gender identity and have taken a series of discriminatory and highly stigmatizing actions against him based on his sex, gender identity, and transgender status. The actions, as described more fully herein, have included (a) denying him access to boys’ restrooms at school and requiring him to use girls’ restrooms or a single occupancy restroom; (b) directing school staff to monitor his restroom usage and to report to administrators if he was observed using a boys’ restroom; (c) intentionally and repeatedly using his birth name and female pronouns, and failing to appropriately inform substitute teachers and other staff members of his preferred name and pronouns, resulting in those staff referring to him by his birth name or with female pronouns in front of other students; (d) instructing guidance counselors to issue bright green wristbands to A.W. and any other transgender students at the school, to more easily monitor and enforce these students’ restroom usage; (e) requiring him to room with girls on an orchestra trip to Europe and requiring, as a condition of his ability to participate in a recent overnight school-sponsored orchestra camp held on a college campus, that he stay either in a multi-room suite with girls, or alone in a multi-room suite with no other students, while all other boys shared multi-room suites with other boys; and (f) initially denying him the ability to run for junior prom king, despite being nominated for that recognition based on his active involvement in community service, instructing him that he could only run for prom queen, and only relenting and allowing him to run for prom king after a protest by many of those same classmates.", "In the \"Facts\" portion of the suit, item number 82 maintained that the alleged imposition of the bracelets caused the student significant anxiety and fear:", "Upon learning about the school’s proposed green wristband practice, A.W. felt sickened and afraid. He was aware of the prevalence of violent attacks against transgender people nationwide, and grew very afraid that the school would attempt to force him to wear the wristband on penalty of discipline. If he did wear the wristband, he knew that other students would likely ask him repeatedly why he was wearing it, and he would have to explain over and over that he is transgender. He expected that some students would stare, and others would outright ridicule him. He felt like his safety would be even more threatened if he had to wear this visible badge of his transgender status", "Initially the school district did not comment on the suit, but in an undated statement titled \"KUSD Responds to Lawsuit\" the district asserted that \"some of the factual allegations are patently false\":", "Kenosha Unified was recently made aware of the lawsuit filed against the District alleging discrimination against a transgender student. The District and its legal counsel are reviewing the complaint and all of the allegations asserted in the complaint. Even a cursory review of the complaint shows that some of the factual allegations are patently false. The District does not have a practice or policy requiring any student to wear a wristband for monitoring any purpose or for any reason whatsoever. The District has worked diligently with transgendered students and their families to address their unique needs and accommodations, including the family named in the suit.", "Kenosha Unified's attorney, Ron Stadler, said, \"The District is confident that when the litigation process establishes accurate facts and applies them to the proper legal standards its policies and practices will be found to be in total compliance with all laws.\"", "Kenosha Unified did not specify which particular allegations they disputed in the suit, other than stating they do not require students to wear wristbands. No portion of the lawsuit mentioned armbands or \"pink triangles,\" as some social media rumors held.", "In of April 2016 the district commented on a separate controversy, involving the same student's eligibility to be named prom king. That dispute also involved a lawsuit (which was later dropped), and district spokesperson Tanya Ruder told ABC News at that time that no district policy relating to bathroom access for transgender students was in place:", "The school district has not taken a position on the bathroom question. \"At this time we do not have a policy in place for transgender students,\" Ruder said, adding that they are currently conducting research to reach a conclusion.", "According to the second lawsuit, a guidance counselor introduced the bright green wristband to the student and explained \"the school intended to use [it] to mark students who are transgender.\" That suit is pending and has not yet been settled or adjudicated.", "Allen, Samantha.   \"Trans Student: School Forced Me to Wear Wristband to Use the Bathroom.\"\r\n    The Daily Beast.   20 July 2016.", "Johnson, Annysa.   \"Transgender Student Alleges Bias in Suit Against Kenosha School District.\"\r\n    Milwaukee Journal Sentinel.   19 July 2016.", "Thorbecke, Catherine.   \"Wisconsin Transgender Student Wins Battle to Run For Prom King.\"\r\n    ABC News.   7 April 2016.", "United States District Court Eastern District of Wisconsin.   \"A.W. v. Kenosha Unified School District No. 1 Board of Education.\"\r\n    19 July 2016.", "Kenosha Unified School District.   \"KUSD Response to Lawsuit.\"\r\n    (Undated.)", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]