["The video is published here on YouTube on December 9, 2020. The video has been viewed more than 148,000 times.", "The Burmese-language title of the video translates in English as: “It happened in Labutta. The true story of a woman who turned from a real person into a dog.”", "Labutta is a town located in Ayeyarwady delta region in Myanmar.", "The video shows a photo collage of a humanlike creature and a town entrance sign for Labutta. A Burmese voiceover narrates the alleged story for eight minutes.", "“Ma Khin Hla from Labutta who became a dog after comparing her parents to dogs,” the voiceover says.", "“Her name was Ma Khin Hla and her age was about 16-17. She was a young Buddhist girl but her character is very wild and rude. She was an only child but had no respect for her parents. She was always yelling at her parents. Therefore, she had faced a very tragic event in her life.”", "The voiceover goes on to state: “She complained to her parents for not cooking her dinner when they came back home from the monastery after their fasting. She called her mother ‘bitch’. Then she lost consciousness. When she regained consciousness, she no longer lived as a real person, but as a dog. Despite being human, she leaned on all fours like a dog.”", "The voiceover states the event happened in 2002.", "The same video was also published with a similar claim on Facebook here and here, where it has been viewed more than 1.2 million times.", "The claim, however, is false.", "A reverse Google image search found this image in a report about an art installation by Australian artist Patricia Piccinini, published by Canadian broadcaster CBC News on September 25, 2018.", "The report’s headline reads: “Art installation explores curious and complex relationship between humans and animals.”", "The first two paragraphs of the report read: “The Hyperrealist installation Curious Imaginings is on display in a wing of the 105-year-old Patricia Hotel in Vancouver’s Strathcona neighbourhood.", "“Part of the Vancouver Biennale, some of the shocking yet fascinating sculptures of hybrid animals by Australian artist Patricia Piccinini include a humanoid beaver, a half-human/half-orangutan mother and a family of humanesque pigs.”", "Below are a screenshot comparison of the photo in the misleading video (L) and the photo in the CBC report (R):", "In response to an email from AFP, Roger Moll, studio manager for Paccinini, said the image is “a photograph of Patricia’s work, titled ‘The Young Family’.”", "“Patricia does not endorse the use of unauthorised photographs of her work, especially in these kinds of ridiculous scams,” Moll told AFP by email on December 17, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]