["Soviet leader Mikhail Gorbachev (left) and President Ronald Reagan near Geneva, Switzerland, in 1985. (AP photo)", "As momentum builds for a possible 2016 presidential run, Gov. Scott Walker has spent more time speaking on foreign policy.", "One of his talking points: Leadership trumps experience when it comes to managing affairs overseas. Look at Ronald Reagan.", "That was Walker’s response Jan. 21, 2015 when he was asked on MSNBC's \"Morning Joe\" about the importance of foreign policy experience. First, the governor criticized the secretary of state record of Hillary Clinton, the leading potential Democratic candidate for 2016.", "Then he turned to Reagan, one of his political heroes, and one of the Republican president’s early acts in office -- the mass firing of most of the nation’s air traffic controllers.", "In August 1981, after contract talks between the federal government and the union for the controllers stalled, nearly 13,000 controllers walked off the job. Just seven months into his first term, Reagan called the strike illegal and demanded they return to work. When more than 11,000 didn't, Reagan fired them in what was an unprecedented action.", "In his MSNBC interview, Walker asserted that the move was one of the most important foreign policy decisions \"made in our lifetime,\" showing allies and adversaries around the world \"that we were serious.\"", "Then he added this:", "\"Years later, documents released from the Soviet Union showed that that exactly was the case. The Soviet Union started treating (Reagan) more seriously once he did something like that. Ideas have to have consequences. And I think (President Barack Obama) has failed mainly because he's made threats and hasn't followed through on them.\"", "So, Walker goes beyond stating an opinion about the foreign policy implications of Reagan’s move. He states as fact that there are Soviet documents showing the Soviets treated the Reagan more seriously because he fired American air traffic controllers.", "That’s a bold claim.", "Walker's evidence", "When we asked for evidence to back the claim, both the governor's office and Walker's campaign cited statements from a variety of people. Each essentially said the firings showed Reagan meant what he said, and that he was to be taken seriously.", "Some examples:", "Reagan special assistant Peggy Noonan wrote in her White House memoir that George Shultz, who became Reagan's secretary state a year after the firings, had called the firings the most important foreign policy decision Reagan ever made. Joseph McCartin, the author of a book on the strike, wrote that when House Speaker Tip O’Neill, a Democrat, visited Moscow not long after the strike, \"he learned that the Soviet leaders had been deeply impressed by Reagan’s actions.\" And Reagan biographer Edmund Morris wrote: \"Former Soviet apparatchiks will tell you that it was not his famous 'evil empire' speech in 1983 that convinced them he meant strategic business, so much as photographs of the leader of the air traffic controllers union being taken to jail in 1981.\"", "Those are perceptions of Americans, however. Walker's claim was the Soviets treated Reagan more seriously after he fired the controllers, and that Soviet documents prove it.", "But he did not provide us anything referencing Soviet documents.", "And apparently there are no such documents that have been made public.", "Experts", "Five experts told us they had never heard of such documents. Several were incredulous at the notion.", "McCartin, a Georgetown University labor history expert who wrote the book about the strike that Walker cited, said: \"I am not aware of any such documents.  If they did exist, I would love to see them.\"", "Svetlana Savranskaya, director of Russia programs at the National Security Archive at George Washington University, told us she \"had to listen to the Walker interview twice, so ridiculous is the statement about the air traffic controllers. There is absolutely no evidence of this. I would love to see the released Soviet documents on this subject that he has apparently seen.\"", "James Graham Wilson, a historian at the U.S. State Department, also told us he was not aware of any Soviet documents showing Moscow’s internal response to the controller firings. He speculated that there could be such records, given how some Soviet experts characterized the firings.", "Wilson and other authors have noted the perspective of Richard Pipes, professor emeritus of Russian studies at Harvard University. Pipes said the firings showed the Soviets that Reagan was \"a man who, when aroused, will go to the limit to back up his principles.\"", "But even as the firings gained the attention of the Soviets, there were other U.S.-Soviet matters during 1981 that were also important. With his first budget, Reagan added $26 billion in defense spending, accelerating the placement of new tanks and warplanes, and he embarked on a modernization of the nation’s nuclear weapons. Reagan also wrote to Soviet leaders imploring them to alleviate Cold War tensions and negotiate arms reductions.", "In any case, the lack of Soviet records described by Walker is clear.", "Reagan's own ambassador to the Soviet Union, Jack Matlock, told us: \"It's utter nonsense. There is no evidence of that whatever.\"", "Matlock questioned whether Soviet leaders even paid much attention to the firings, saying: \"At that point, their big question was whether (Reagan) was going to attack them.\"", "Our rating", "Touching on foreign policy issues, Walker said: \"Documents released from the Soviet Union\" show \"the Soviet Union started treating\" Ronald Reagan more seriously after Reagan fired the air traffic controllers.", "There is a view, echoed by Walker, that the firings caught the Soviets’ attention. But Walker cited no Soviet documents showing that the firings made the Soviets treat Reagan more seriously. And experts, several of whom felt Walker’s claim is outrageous, told us they are not aware that any such documents exist.", "For a statement that is false and ridiculous, our rating is Pants on Fire.", "------", "More on Scott Walker", "For profiles and stories on Scott Walker and 2016 presidential politics, go to the Milwaukee Journal Sentinel's Scott Walker page.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "MSNBC, Gov. Scott Walker interview (quote at 4:00), Jan. 21, 2015", "Interview and email interview, Scott Walker campaign spokesman Tom Evenson, Jan. 24, 2015", "Interview and email interview, Jack Matlock, former U.S. ambassador to the Soviet Union, Jan. 26, 2015", "Email interview, New York University retired professor of Russian and Slavic studies Stephen F. Cohen, Jan. 26, 2015", "Email interview, National Security Archive director of Russia programs Svetlana Savranskaya, Jan. 26, 2015", "Email interview, Joseph McCartin, Jan. 26, 2015", "Email interview, U.S. State Department historian James Graham Wilson, Jan. 27, 2015", "Email interview, U.S. State Department historian Tiffany H. Cabrera, Jan. 26, 2015", "Time, \"Ronald Reagan vs. Air Traffic Controllers, 1981,\" July 27, 2011", "Politico, \"Reagan fires 11,000 striking air traffic controllers, Aug. 5, 1981,\" Aug. 5, 2008", "\"Upstream: The Ascendance of American Conservatism,\" page 306", "National Review, \"A lesson in backbone,\" June 7, 2004", "\"When Character Was King,\" page 375", "\"Collision Course: Ronald Reagan, the Air Traffic Controllers, and the Strike,\" by Joseph McCartin, page 329", "\"This Living Hand: And Other Essays,\" by Edmund Morris (page number unknown)", "U.S. State Department Office of the Historian, \"U.S.-Soviet relations 1981-1991,\" Oct. 31, 2013", "CQ Almanac, \"Defense 1981: Overview,\" 1981", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]