["About this rating", "MSNBC, NBC, CBS, and ABC aired no live coverage of a 1 August 2018 repatriation ceremony for the remains of U.S. service members killed during the Korean War, while CNN aired approximately 58 seconds of the ceremony as it was happening.", "None of the above-mentioned networks ignored or failed to cover the return of the U.S. soldiers' remains from North Korea, with some of them airing multiple reports.", "On 27 July 2018, the 65th anniversary of the signing of the armistice that ended active hostilities in the Korean War, an airplane carrying the remains of what were believed to be 55 U.S. soldiers killed in North Korea during the conflict touched down at Osan Air Base in South Korea. An honorary military ceremony was held on the tarmac for the deplaning of the 55 caskets.", "The transfer had been agreed upon during summit talks between U.S. president Donald Trump and North Korean leader Kim Jong Un the month before and marked the first time in more than a decade that the remains of U.S. war dead were handed over by North Korea. On 1 August, Vice President Mike Pence spoke at a repatriation ceremony for the 55 fallen service members held at Pearl Harbor in Hawaii.", "Days later, a social media meme made the rounds conveying the impression that the major cable and network television news outlets had essentially ignored the return of the soldiers' remains in their reporting:", "When the Press don't #respect the #fallen who died serving their country, you know they are against the people. #Q #QAnon #GreatAwakening @POTUS @realDonaldTrump @mikesemple #InGodWeTrust #FakeNews #respect pic.twitter.com/phpVnIIaGs", "— Michael Semple (@mikesemple) August 4, 2018", "That impression was false, however. MSNBC and the other named venues (NBC, CNN, CBS, and ABC) each aired multiple reports on the return of America's Korean War dead:", "MSNBC ran more than a half-dozen segments on various news programs covering the transport, homecoming, and commemoration of the remains. (The meme says the network carried \"no live coverage,\" which is technically correct -- but what, precisely, the phrase \"live coverage\" refers to only becomes clear with additional context.)", "NBC reported on the arrival of the remains in South Korea on the 27 July edition of  NBC Nightly News (including footage of the deplaning ceremony at Osan Air Base), and they featured segments on both the 27 July and 1 August editions of the Today Show, the latter highlighting video of the Hawaii ceremony. (The meme says NBC provided \"no coverage.\")", "CNN aired a number of segments on the return of the war dead, including one live report from the Hawaii repatriation ceremony that lasted approximately 58 seconds (the exact duration of the coverage the meme says CNN devoted to the story). But the cable network also aired several minutes of live coverage of the Osan Air Base ceremony on 27 July. Footage from both ceremonies was used in reports on various CNN programs.", "CBS filed at least two reports over the course of the week on CBS This Morning, with one segment featuring video of Vice President Pence honoring the dead in Hawaii. And although the network didn't cover the 1 August Hawaii ceremony on their evening news show, they did stream the entire event live on social media. (The meme says CBS offered \"no coverage.\")", "ABC also streamed the entire Hawaii ceremony live on social media. They aired a report that lasted approximately 24 seconds on World News Tonight, which corresponds to the duration specified in the meme (although it was not, unlike the 58 seconds attributed to CNN, a live-on-the-scene report). Additionally, ABC provided extensive coverage of the event on three different morning shows.", "Besides the main network coverage, many NBC, CBS, and ABC affiliates ran coverage of the repatriation ceremony before and/or after the networks' news broadcasts.", "(One important factor in the timing of news coverage was that due to time differences between South Korea, Hawaii, and the eastern United States, some of the activity related to the repatriation of Korean War remains took place too late in the day for evening network news programs, leaving it to the morning news shows to pick up the story.)", "One network not mentioned in the meme was the Fox News Channel, which aired the Hawaii ceremony live, from beginning to end, during their evening news slot on 1 August. The meme appeared to be loosely based, in fact, on a 2 August Fox News article that more specifically (and intelligibly) criticized competing networks for failing to provide the same live coverage on their own nightly news programs.", "Fox News.   \"Kurtz: Media Makes 'Wrong Call' with Lack of Coverage of Return of U.S. Soldiers' Remains.\"\r\n    2 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]