["The video, posted here on Facebook where it has been viewed more than 50,000 times since it was published on April 11, 2019.", "The 24-second clip appears to show Indian National Congress party president Rahul Gandhi at a public rally telling the crowd that he will give farmers fields on the moon to grow crops.", "The Hindi audio translates to English as: “You can't make money from your farmlands here, look at the Moon. I will provide you with farmland on the moon. In the future, you will grow potatoes there. I'll put up a machine there and then we will export potato back to Gujarat.\"", "The misleading post’s caption says: “Somebody pls stop him, He is promising he will give fields on moon to grow crop.”", "Below is the screenshot of the misleading post:", "Similar posts have been shared repeatedly on Facebook, for example here, and on Twitter here.", "But the clip in the misleading post is an edited version of a longer video showing a Congress party rally on November 12, 2017 in Patan town in the western state of Gujarat in India.", "The original full video is 2 hours and 23 minutes long and shows a public rally called ‘Yuva Rojgar Khedut Adhikar Navsarjan Yatra’.", "The full-length video, including Rahul Gandhi’s comments, can be seen here on one of Congress’ official Facebook pages, where it was streamed live on  November 12, 2017.", "The original video was also uploaded here on the Gujarat Congress official YouTube channel on November 17, 2017.", "Gandhi starts speaking at 1 hour 58 minutes and 18 seconds and at 2 hours 18 minutes and 11 seconds Gandhi refers to Indian Prime Minister Narendra Modi, saying that Modi has been making false promises to farmers.", "Gandhi says: “I don’t make false promises, even if sometimes you don’t like it. Mr. Modi says: ‘You can't make money from your farmlands here, look at the moon. I will provide you with farmland on the moon. In the future, you will grow potatoes there. I'll put up a machine there and then we will export potatoes back to Gujarat.’\"", "Below is the side by side comparison between the misleading post (R) and the original video (L):", "Rahul Gandhi’s speech from the original video was also uploaded on Rahul Gandhi’s official YouTube channel here on November 12, 2017.", "The misleading clip in this video appears from 19 minutes 57 seconds.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]