["The video was published here on Twitter on August 30, 2020. It has been viewed more than 196,000 times.", "The caption reads: “Meteor shower caught in broad daylight!”", "The same clip was shared with a similar claim on Twitter here, here, here and here; and on Facebook here, here and here.", "The claim is false: the video was created using animation software.", "The video was posted here on Instagram by a France-based user with the handle South Lab.", "Meteor shower ☄️ #meteor #sky #fx #specialeffects #aftereffects #art #3d #makingof #motiongraphics", "A post shared by  South Lab (@southlab) on Jul 30, 2020 at 4:19am PDT", "The video’s caption reads: “Meteor shower ☄️ #meteor #sky #fx #specialeffects #aftereffects #art #3d #makingof #motiongraphics”.", "The next two videos in the post show how the animated clip was created using computer software Adobe After Effects.", "A corresponding YouTube account shared the same video here. The video’s French title translates to English as: “Making of VFX - Meteor shower [After Effects]”.", "The description reads: “Software used: Adobe After Effects", "\"Plug in: Trapcode Particular", "\"Find my other fx videos on my social networks! Instagram: @southlab Tiktok: @south_lab”.", "The false claim was also debunked by Twitter user Hoaxeye here on August 30, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]