["The photo was shared on Facebook here on February 7, 2021.", "They show two Sikh men in army uniform standing alongside two older men. One of the soldiers is seen wiping his eye with a handkerchief.", "“A soldier went straight to meet his farmer father at Delhi border when came home on leave and his eyes filled with tears when he saw him. #WeWillFightWeWillWin #FarmersAreStandingFirm #FarmersProtest,” the post's Punjabi and Hindi caption reads.", "The post circulated as farmers, mainly Sikhs from the northern states of Punjab and Haryana, continue to protest against agricultural reforms proposed by the central government, as AFP reported here.", "The photos were also shared alongside similar claims on Facebook here, here, here and here; and on Twitter here, here and here.", "The photos were also tweeted alongside an identical claim in English on the verified Twitter account of Punjab Pradesh Congress Sevadal, an affiliate organisation of India’s main opposition Indian National Congress party.", "The claim, however, is misleading.", "An analysis of the photos using the InVID image magnifier tool found illegible text in Punjabi -- the regional language of Punjab -- as highlighted in red in the screenshot below:", "Further analysis of the second photo shared in the misleading Facebook post found a red billboard with \"PARKING\", \"BUS STAND\" and “24 HOURS” written in English.", "Further keywork searches found this YouTube video published on December 29, 2020.", "The same red billboard with \"LUDHIANA\" written between \"BUS STAND\"  and \"24 HOURS OPEN\" can be seen clearly at the 18-second mark of the video.", "“A Full Overview Of Ludhiana Bus Stand (ISBT),” says the video description.", "Ludhiana is an industrial city in Punjab and ISBT is an acronym of Inter-State Bus Terminal.", "Geolocation of the \"Ludhiana Bus Stand\" on Google Maps found several images that corroborate with the photos shared in the misleading Facebook post.", "Below is a screenshot comparison of photo shared in misleading Facebook post (L) and Google Maps images (R) with similar elements highlighted in green:", "AFP was unable to verify the identity of the men in the photo.", "Indian fact-check and news website Boom Live have also debunked the misleading claim.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]