["About this rating", "On 30 May 2018, conspiracy blog YourNewsWire.com made a curious claim about volcanic activity in the lower Puna region of Hawaii’s Big Island, which first began on 3 May 2018 and continues unabated.", "YourNewsWire, an outlet not known for its commitment to facts or accuracy, argued that this specific geologic event (which, in reality, is a continuation of an eruptive event that began in 1983) was caused by fracking — the process of injecting fluids into bedrock at high pressures to crack rocks and liberate petroleum products.", "The alleged culprit, counter-intuitively, is a (petroleum-free) geothermal energy plant named the Puna Geothermal Venture (PGV):", "Scientific data has linked the surge in volcanic activity in Hawaii to increased fracking activity at Puna Geothermal Venture.", "The data shows how the fracking may have been deliberately designed to create a geological process by which lava would drain from Kilauea’s summit into the East Rift Zone so as to create large new vents that would destabilize the geology, and trigger a major collapse in the Hilina Fault System.", "Without boring readers with the intentionally onerous and largely fallacious details, the goal of creating a covert fracking operation aimed at generating a massive landslide and/or tsunami under the guise of a green, geothermal power plant (at least, according YourNewsWire’s primary source, Exopolitics.org) is to disrupt the global world order by causing widespread economic collapse, of course:", "The creation of a massive tsunami through a collapse of the Hilina slump was the secret purpose behind the creation of the Puna Geothermal Venture, whose owners are linked to the Rothschild family.", "(Exopolitics is an alleged branch of political science that deals with extraterrestrial influence on human affairs. The link to the Rothschild family, a frequent target of conspiracy theorists and generally deployed as an anti-semitic dog whistle, is that the owner of the PGV since 2004 is a company whose founder was awarded the \"Rothschild Prize for Innovation\" — in 1977.)", "The claims laid out by YourNewsWire and Exopolitics suffer from several factual, scientific, and logical flaws, but chief among them is the fact that fracking — a process utilized by oil companies searching for fossil fuels — does not occur anywhere on Hawaii, as there are no petroleum reserves for which to frack.", "To get around this, Exopolitics claims that the processes employed at PGV are in essence identical to fracking, because the geothermal plant operates in a fashion that requires re-injecting a liquid into the ground. Hawaiian Electric, which had purchased energy from the plant prior to its current closure, described the process:", "PGV is a geothermal energy conversion plant bringing steam and hot liquid up through underground wells.  The hot liquid (brine) is not used for electricity at this time.  The steam is directed to a turbine generator that produces electricity.", "The exhaust steam from this turbine is used to vaporize (heat) an organic working fluid, which drives a second turbine, generating additional electricity. The condensed steam from the organic fluid heat exchanger is re-injected into the ground through reinjection wells along with the brine.", "The primary goal of this reinjection is to stabilize the land from which the water is being extracted. Without the reinjection of water (and the only fluid in this case is water), the reservoir below would dry up, making the geology susceptible to faulting or sinkholes. The primary goal of hydraulic fracturing is to destabilize the rock below and create faults by injecting fluids (many of them organic compounds) at an extremely high pressure. The two processes are simply not comparable save for the fact that they both employ fluids and the word “inject.”", "Exopolitics further muddles its terminology when it cites an environmental group in Hawaii opposed to a type of geothermal energy known as enhanced geothermal energy, a process that could at least in theory involve the pressurized injection of water into the ground to alter the rocks below. The goal of enhanced geothermal energy is to create wells deep enough that they reach some area of hot geologic activity. Water is then actively pumped to depth, where it steams up from the heat of the Earth and returns to the surface as steam to create energy.", "PGV does not employ geothermal fracking — the plant was designed before the technology existed, and regardless there would be be literally no need for it. The location of PGV, next to a fault on a continuously erupting ocean island with porous volcanic ground, has all of the rare characteristics that normally make geothermal energy hard to come by.", "A summary of the potential utility of geothermal fracking published in the MIT Technology Review described these conditions as a way to explain the necessity of the emerging technology. It could also serve as a explanation for why PGV is in the location that it is in:", "The main problem is that conventional geothermal plants rely on a rare combination of geological features. Hot rock has to be accompanied by large amounts of hot water or steam that can easily be pumped to the surface, where it would drive steam turbines to generate electricity. The rock formation needs to be porous enough that the water can be continuously recirculated and reheated to keep a power plant running.", "Aside from the fact that nothing that could factually be described as fracking actually occurs on Hawaii’s Big Island, the evidence presented that the lower Puna lava flows were triggered by the PGV’s \"fracking\" are a textbook cases of circular reasoning. Exopolitics basically attempts to make this three-part argument:", "To Exopoltics.org's credit, it is true that fracking (if it were occurring, which it is not) could cause earthquakes. Unfortunately for their argument, another thing that causes earthquakes is volcanic activity — the very same activity that Exopolitics is trying to blame on PGV. You can’t use the symptom of a lava flow (earthquakes) as as evidence that earthquakes (from fracking) caused that lava flow. That’s not how this works.", "Are there earthquakes in the area of PGV? Certainly. There are earthquakes all over the volcanically active Big Island. Is it shocking that there would be earthquakes focused in the (extremely general) region of PGV? Not at all — recall that PGV’s location was selected due to its proximity to a major fault system, thereby allowing water to flow through the ground and come in contact with the volcanically heated region below.", "You cannot use PGV's location (intentionally placed in an area where earthquakes are common and lava flows likely) as evidence that it caused earthquakes and lava flows. That's not how this works. For these reasons (and so, so many more), claims that credible scientific evidence links Hawaii’s 2018 lower Puna eruption to fracking — a practice that is not, even by any tangentially related definition, occurring on Hawaii’s big island — are false.", "Adl-Tabatabai, Sean.   “Evidence Emerges That Hawaii Eruptions Caused By Fracking.”\r\n    Your News Wire.   30 May 2018.", "Kaplan, Sarah, et al.   “Where the Earth Is Erupting on Hawaii’s Big Island.”\r\n    Washington Post.   17 May 2018.", "Salla, Michael.   “Hawaii Volcanic Eruption Intentionally Triggered to Generate Massive Tsunami?”\r\n    Exopolitics.org.   15 May 2018.", "United States Geological Survey.   \"What is Hydraulic Fracturing?\"\r\n    Accessed 22 June 2018.", "Hawaiian Electric.   \"Puna Geothermal Venture (PGV)\"\r\n    Accessed 22 June 2018.", "Ormat.   \"Puna Geothermal Venture (PGV), Hawaii, USA.\"\r\n    Retrieved from 11 May 2013 archive.", "U.S. Energy Information Administration.   \"Hawaii.\"\r\n    Accessed 22 June 2018.", "National Academies Press.   \"Induced Seismicity Potential in\r\nEnergy Technologies.\"\r\n    2012.", "Cichon, Meg.   “Is Fracking for Enhanced Geothermal Systems the Same as Fracking for Natural Gas?”\r\n    Renewable Energy World.   16 July 2013.", "U.S. Dept. Energy.   \"How an Enhanced Geothermal System Works Animation.\"\r\n    Accessed 22 June 2018.", "Bullis, Kevin.   “Fracking for Geothermal Heat Instead of Gas.”\r\n    MIT Technology Review.   21 October 2013.", "Bullis, Kevin.   “Myths and Facts on Wastewater Injection, Hydraulic Fracturing, Enhanced Oil Recovery, and Induced Seismicity.”\r\n    Seismological Research Letters.   10 June 2015.", "United States Geological Survey.   \"Volcano and Earthquake Hazards Occur Regularly in Hawaii\"\r\n    Accessed 22 June 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]