["About this rating", "It's a truism that politicians lie, and an even more tightly-clung-to truism that the politicians with whom we disagree are the worst liars of the bunch.", "Given that, we were not surprised to find that a widely promulgated statement concerning liars in the government attributed to Thomas Jefferson, the third president of the U.S., has been embraced by people from one end of the political spectrum to the other.", "\"The government will one day be corrupt and filled with liars, and the people will flock to the one that tells the truth,\" Jefferson supposedly said. Here is the statement in a short video tweeted by a supporter of U.S. President Donald Trump, a conservative Republican:", "I love this quote by Thomas Jefferson", "“The government will one day\nbe corrupt and filled with liars\nand the people will flock to\nthe one who tells the truth.”", "And this is why President Trump fills stadiums!", "The Obama Administration was a crime spree?", "RETWEET?If You Agree pic.twitter.com/ZzvXxH8OQL", "— ?heyitsCarolyn? (@heyitsCarolyn) March 25, 2019", "And here it is in a Facebook post by a supporter of U.S. Sen. Bernie Sanders, a Democratic socialist (running as a Democrat) seeking to unseat Trump in 2020:", "We have disappointing news for both factions. Despite our best efforts, we've been unable to locate any instances of the quote's appearing in print (online or off) before October 2015 (when it surfaced, unsourced, in a tweet). It is nowhere to be found in Jefferson's writings, biographies, or anywhere else in the historical record.", "The findings of the Thomas Jefferson Foundation at Monticello were the same: \"This quotation has not been found in the writings of Thomas Jefferson.\" They have labeled it \"spurious.\"", "We expanded our search, with variations in wording and attribution, to try to determine whether someone else might have said it, or something similar, and came up empty-handed. Our ruling: the quote was fabricated and falsely attributed to Thomas Jefferson.", "Berkes, Anna.   \"The Government Will One Day Be Corrupt (Spurious Quotation).\"\r\n    The Thomas Jefferson Foundation.   19 November 2018.", "Jefferson, Thomas and Richard Holland Johnston.   The Writings of Thomas Jefferson.\r\n    Washington, D.C.: Thomas Jefferson Memorial Association of the United States, 1907.", "Founders Online.\r\n   Accessed 10 May 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]