["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former state Sen. John Thrasher was formerly speaker of the House and chairman of Gov. Rick Scott's re-election campaign. (Times photo)", "Long before John Thrasher became president of Florida State University on Nov. 10, students were expressing opposition to his appointment, many of them charging that Thrasher had ties to \"special interests.\"", "As the Republican former state senator begins his presidency, we decided to look back at a comment Thrasher made during a forum with FSU students and faculty on Sept. 15.", "Thrasher became defensive when questioned about his ties to Charles and David Koch, the billionaire libertarian brothers who have spent freely on anti-regulation causes. At one point, a graduate student asked Thrasher about campaign contributions he had received from the brothers. The former lawmaker from St. Augustine denied receiving any.", "\"I don't have a relationship with the Koch brothers,\" Thrasher said. \"You say I've got contributions from them? You go look at my contributions, I've never received any contributions from the Koch brothers.\"", "Did Thrasher get any campaign contributions from the Koch brothers? Here’s the full story.", "The money trail", "Thrasher was approved as president by the FSU Board of Trustees by an 11-2 vote on Sept. 23. On Election Day, he was re-elected to his Senate seat. Two days later, he was confirmed for the presidency by the state Board of Governors and then resigned his Senate seat. (A special election is scheduled for Jan. 27, 2015, which could cost taxpayers as much as $1 million.)", "On Nov. 10, Thrasher was formally installed as the 15th president of FSU. But the possibility that he could become FSU’s president was controversial almost from the very beginning, with students and teachers decrying his lack of academic credentials.", "The controversy is colored by past concerns about the Koch brothers’ attempts to influence FSU. In 2008, the Charles G. Koch Charitable Foundation pledged $1.5 million for economics professors if the organization was granted a say in the screening process -- a power that critics said ran contrary to academic freedom. The university accepted the deal.", "Thrasher, 70, has a business degree and law degree from FSU and served several terms in the Florida House starting in 1992, eventually becoming speaker of the House in 1999 and 2000.", "In 2009, Thrasher won a special election for a state Senate seat in northeast Florida, then won re-election the following year and served as chairman of the Republican Party of Florida. Commentators cited his political connections and fundraising savvy as the reasons he became the frontrunner for FSU’s presidency after applying in May 2014. (Outgoing FSU president Eric Barron was named president of Penn State University.)", "Some at Florida State preferred any of the other three candidates -- all administrators at other universities -- over Thrasher. The FSU Progress Coalition, a group of student leaders and faculty openly opposed to conservatives in the Florida Legislature, peppered Thrasher with questions at the Sept. 15 forum, eventually posting audio of the comment about the Koch brothers online (hear it at about the 2:30 mark).", "Because the recording is audio-only, PolitiFact Florida first set out to verify that the recording was actually Thrasher. The office of the president didn’t respond to our requests, but we found a variety of student, faculty and media sources that confirmed it.", "But is the statement accurate?", "A trip to the Florida Division of Elections website showed that Koch Industries, based in Wichita, Kan., has made four contributions to Thrasher’s re-election campaign since 2012. The multinational group owns interests in manufacturing, energy, textiles, chemicals, paper, ranching, finance and investing, among other things. Current Florida campaign finance laws allow corporations to donate up to $1,000 per election to a legislative candidate.", "Koch Industries has given Thrasher $3,000 over the past three years. Two donations on Jan. 9, 2012, and Oct. 11, 2012, were $500 apiece. Two were $1,000 each, on Feb. 8, 2014, and Oct. 21, 2014. This final donation came after the forum in question, and after the Board of Trustees had voted for Thrasher.", "Thrasher campaign spokesperson Sarah Bascom said those contributions came from Atlanta-based Georgia-Pacific, a pulp and paper subsidiary of Koch Industries that is the largest private employer in Putnam County, part of Thrasher’s old district. Thrasher has received campaign cash from Georgia-Pacific dating back to 1995; Koch Industries acquired the company in 2005.", "The four donations cited above were officially made in the name of Koch Industries. Integrity Florida, a nonpartisan group that tracks campaign-finance issues, told us it was up to the campaign to list where the money came from. The contribution may have come from Georgia-Pacific, but we’ll go by the fact the donation was credited to the parent corporation, not the subsidiary.", "But Thrasher’s camp cautioned against jumping to conclusions about what he meant. He \"was referring to contributions from them (the Koch brothers) personally,\" Bascom said. \"His comments were not referring to all of the companies that they may have a business interest in.\" (Thrasher told the Tampa Bay Times on Sept. 18 that he didn’t know the Kochs. \"I have been saying I've never met them, I've never talked to them and I wouldn't recognize them if they walked into the room,\" he said.)", "The distinction between receiving corporate money from a Koch-owned company and money from the Koch Brothers personally adds some complexity to this question.", "University of Florida professor Dan Smith said it’s appropriate to declare the money came from the powerful siblings. To a reasonable person, crediting the donations to Koch Industries looks like the money comes from the company’s owners.", "\"It’s quite clear that Sen. Thrasher has received contributions from the Koch brothers over the years,\" Smith said. \"Whether or not they come directly from the Koch brothers or the corporations that they control, that is Koch dollars.\"", "But T. Wayne Bailey, a political science professor at Stetson University’s DeLand campus, gave a more nuanced answer.", "Given Thrasher’s influence over the years, Bailey said, it’s probable special interests like the Koch brothers no doubt have taken great interest in \"cultivating\" him. Being chairman of Gov. Rick Scott’s re-election campaign would likely have been a factor as well, Bailey said.", "But whether those donations count as coming directly from the Koch brothers is a question of point of view, he said. If anything, it points out just how much of American industry the Kochs own, and the influence they wield as a result. The circumstances demand that Thrasher \"be open and transparent\" going forward as FSU president, Bailey said.", "There are a few other bits of context worth mentioning.", "First, while Koch Industries’ donations have totaled $3,000, that’s a small fraction of the almost $882,000 Thrasher’s raised since 2011.", "Second, one of the most important Koch Brothers-linked organizations, Americans for Prosperity, has run hot and cold on Thrasher and his agenda in recent years. The group’s Florida affiliate gave him a grade of D in 2014 after having earned an A+ before. Those grades were based on whether Thrasher voted in favor of policy decisions AFP endorsed. Democrats almost universally receive F grades.", "Our ruling", "Thrasher said he has \"never received any contributions from the Koch brothers.\"", "Thrasher says he has never received money personally from the Koch Brothers, and as far as we can tell, that’s correct. However, he did receive four donations totaling $3,000 from Koch Industries, a company they own. That's what we're checking, not whether he knows Charles and David Koch.", "His campaign said those donations specifically came from the subsidiary Georgia-Pacific, a major employer in his district that had donated to Thrasher years before being owned by the Kochs, but the contributions were officially categorized as coming from Koch Industries. Experts say it could be reasonable to equate those donations as coming from the company’s owners.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "FSU Progress Coalition, \"John Thrasher Lies About Koch Donation,\" Sept. 22, 2014", "Wall Street Journal, \"Koch Industries Agrees To Buy Georgia-Pacific,\" Nov. 14, 2005", "Tampa Bay Times, \"Billionaire's role in hiring decisions at Florida State University raises questions,\" May 9, 2011", "Tampa Bay Times Buzz blog, \"John Thrasher makes it official, applies for FSU presidency,\" May 29, 2014", "On Presidents and Politics blog, \"Senator Thrasher's interview,\" Sept. 15, 2014", "Tampa Bay Times, \"Meet the final four in FSU's presidential search,\" Sept. 16, 2014", "FSUNews.com, \"Thrasher raises concerns at forum,\" Sept. 17, 2014", "Tampa Bay Times, \"Thrasher's political links with billionaire Kochs questioned,\" Sept. 19, 2014", "Business Insider, \"FSU Has Picked A Powerful And Controversial Politician As Its Next President,\" Sept. 23, 2014", "Miami Herald, \"In controversial decision, FSU names John Thrasher its new president,\" Sept. 23, 2014", "Tallahassee Democrat, \"Thrasher is choice for FSU, despite loud opposition,\" Sept. 24, 2014", "Inside Higher Ed, \"'UnKoch My Campus',\" Nov. 4, 2014", "Florida Times-Union, \"John Thrasher easily wins; special election likely,\" Nov. 5, 2014", "Tallahassee Democrat, \"Thrasher era begins at FSU,\" Nov. 10, 2014", "WPLG TV, \"Gov. Rick Scott sets special election to replace Sen. John Thrasher,\" Nov. 11, 2014", "Florida Division of Elections, John Thrasher campaign finance records, accessed Nov. 14, 17-18, 2014", "Interview with Ralph Wilson, FSU Progress Coalition co-founder, Nov. 14 and 17, 2014", "Interview with Jennifer Proffitt, FSU communications professor and United Faculty of Florida chapter president, Nov. 17, 2014", "Interview with Sarah Bascom, Thrasher campaign spokesperson, Nov. 17-18, 2014", "Interview with Marc Reichelderfer, Thrasher campaign consultant, Nov. 18, 2014", "Interview with T. Wayne Bailey, Stetson University (DeLand) political science professor, Nov. 18, 2014", "Interview with Daniel Smith, University of Florida political science professor, Nov. 18, 2014", "Interview with Ben Wilcox, Integrity Florida research director, Nov. 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]