["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden and his son Hunter after attending Mass at Holy Trinity Catholic Church on Jan. 24, 2021, in Washington, D.C. (AP)", "• There is no evidence that Joe Biden invested any family money in Ukrainian gas or oil.", "• Hunter Biden, his son, held a directorship for a Ukrainian gas company, Burisma Holdings, while Joe Biden was serving as vice president. And as president, Joe Biden signed an order effectively canceling the proposed Keystone XL pipeline.", "• Biden’s cancellation of the pipeline is consistent with his stated policy to phase out fossil fuels.", "Hunter Biden’s background in the Ukraine energy sector was a recurring target of critics during his father’s 2020 presidential campaign. And today, on social media at least, this son’s history in Ukraine has followed Joe Biden into the White House.", "\"Biden invested the entire family fortune in Ukraine gas and oil. Then shuts down Keystone pipeline. Starting to get the picture,\" said a Jan. 23 Facebook post with white text on a blue background.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns.)", "At root, the post claims that Biden has made a policy move to enrich himself. But the post spins a few unrelated bits of evidence into an inaccurate assertion. (The White House did not respond to an inquiry for this article.)", "Hunter Biden, who co-founded a business consulting firm, held a directorship for a Ukrainian gas company, Burisma Holdings, while his father was serving as vice president.", "In 2015, Viktor Shokin, Ukraine’s top prosecutor general, was in charge of investigating corruption associated with Burisma owner Mykola Zlochevsky. But several Western leaders, activists and institutions argued Shokin was not pursuing corruption aggressively enough. They were largely united in seeking Shokin’s removal.", "As vice president, Joe Biden urged Ukraine to fire Shokin, and threatened to withhold U.S. aid. But we’ve found no evidence to support the idea that Joe Biden advocated with his son's interests in mind. Biden’s position was that of the U.S. government and its allies. It’s not clear that the company would have benefited from Shokin’s ouster anyway, given evidence that investigations into Burisma had long been dormant.", "The episode became part of President Donald Trump’s first impeachment in 2019 after news reports surfaced about a phone call in which he pressured Ukrainian president Volodymyr Zelensky, using U.S. military aid to Ukraine as leverage, to target the Bidens, which would have helped Trump’s reelection campaign. Trump was impeached, but the Senate did not sustain a conviction.", "On Jan. 20, Biden signed an order that revoked the permit for the construction of the Keystone XL pipeline. The Keystone XL pipeline is an international project years in the making. The 875-mile pipeline was intended to carry a heavy crude oil mixture from Western Canada to Steele City, Neb., where it would connect with another leg stretching to Gulf Coast refineries. Environmental groups have long opposed the pipeline, both on its merits and as a symbol of fossil fuel dependency.", "Biden’s order revokes the permit that was granted March 29, 2019, by then-President Donald Trump on the grounds that it is harmful to the environment. Without support from the U.S. government, it’s effectively halted. Backers of expanded petroleum development expressed criticism of Biden’s decision, as well as other actions he’s taken that curb expansion of oil and gas drilling.", "The blocking of Keystone XL fits with Biden’s focus on curbing the long-term use of fossil fuels as a way to reduce climate change.", "By law, presidential candidates need to file financial disclosure forms to give the public a sense of their holdings and, potentially, where conflicts of interest may lie.", "Biden filed such a form in 2020 covering himself and his wife Jill, and the form gives no indication that he’s invested in any specific Ukrainian oil or gas entity, much less that he’s gone all in with his fortune on such an investment.", "On the form, Biden reported income from the University of Pennsylvania as well as a corporation he used as a vehicle for funneling income he made from speeches and appearances. He also listed bank accounts and diversified mutual funds as assets.", "It’s also well known that Biden, throughout his adulthood, has funneled income into real estate. While the properties he owns are not listed on the disclosure form, a Jan. 20 article by Town & Country magazine cited two homes the family owns, one in Greenville, Del., and a second in Rehoboth Beach, Del.", "There is no evidence that any portion of Joe and Jill Biden’s assets are invested in Ukrainian gas and oil, much less that he canceled the pipeline in order to make his investments more valuable. (It’s also not clear that canceling Keystone XL would have had that effect on the Ukrainian oil and gas sector.)", "We rate the statement False.", "Facebook post, Jan. 23, 2021", "Joe Biden, candidate financial disclosure form, 2020", "Town & Country, \"All of Joe Biden's Homes, In Photos,\" Jan. 20, 2021", "Fox45 News, \"Biden's tax returns show he took advantage of a loophole Obama sought to eliminate,\" Oct. 23, 2020", "PolitiFact, \"A look behind the NY Post headline about Joe Biden and a Ukraine meeting,\" Oct. 15, 2020", "PolitiFact, \"Trump’s Ukraine call, a whistleblower and the Bidens: What we know, what we don’t,\" Sept. 23, 2019", "PolitiFact, \"How Biden’s Keystone XL pipeline executive order affects American jobs,\" Jan. 21, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]