["About this rating", "On 21 October 2015, Facebook user John Hucul published the above-reproduced comment to a Facebook page called \"Spirit Airlines Sucks.\" According to Hucul's account, his son traveled with Spirit Airlines out of Detroit on 16 October 2015 for military leave. Hucul's (unnamed) serviceman son reportedly encountered an unexpected charge of $55 for a garment bag containing his dress attire and when the elder Hucul complained to the airline, a rep told him Spirit \"[does] not cater to the military.\"", "While \"Spirit Airlines Sucks\" appeared to be a long-abandoned page created by a once-disgruntled flyer, tens of thousands of users found and shared Hucul's comment. A number of Facebook users subsequently took to the page to express disapproval with the airline's actions (as reported by Hucul) even though it was not officially affiliated with Spirit. We found no official Facebook page linked to Spirit Airlines on which the rumor had yet been officially addressed.", "Hucul's comment wasn't the only social media complaint about Spirit Airlines, military personnel, and bags. Several tweets sent prior to the popular Facebook post referenced the purported policy (or lack thereof):", "@SpiritAirlines charges military for CARRY ONS?!? WTF?!?", "— Patrick Barrantes (@docbarrantes) May 11, 2015", "We booked the one airline that doesn't give military free bags ???? @SpiritAirlines", "— Michael Valdez (@valdez_michael) May 18, 2015", "I'll never fly with @SpiritAirlines ever again in my life worst airline ever! What kind of airline doesn't have free bagged for military!!", "— Raul. (@Hypekills_15) May 26, 2015", "@SpiritAirlines is this airline the only one that charges military baggage fees. I will never fly your joke of an airline again", "— Seth Rice (@Srice_11) June 2, 2015", "A page on Spirit Airlines' web site verifies that the carrier does not offer military discounts (for standard fares):", "Q: Does Spirit offer discounts for bereavement, military, children, students, or senior citizens?", "A: No, our fares are already very low, and we are unable to offer additional discounts.", "An undated page on the carrier's web site confirmed that Spirit Air offered hundreds of free flights for \"wounded warriors and their families,\" adding:", "For active duty military traveling on Spirit, we will provide two free checked bags and a free carry-on, in addition to the already free personal item.  The military member should arrive early enough to have their bags checked at the counter, and present their military ID.", "We contacted both Spirit Airlines and Hucul in an attempt to verify details of the claim and will update this page if we receive responses.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]