["About this rating", "In December 2018, the World News Daily Report (WNDR) website published a provocative article reporting that a man in Texas had confessed to kidnapping 79 people while he was disguised as an alien and subjecting them to anal probes:", "TEXAS MAN ADMITS KIDNAPPING 79 PEOPLE TO ANALLY PROBE THEM WHILE DISGUISED AS AN ALIEN", "A man who was arrested by the FBI Yesterday has confessed to kidnapping and sexually assaulting several dozen people while using costumes, drugs, and special effects to have his victims believe they had been abducted by aliens. 73-year old Arnold White was arrested after a joint investigation led by the Federal Bureau of Investigation, the El Paso Sheriff's Office and the El Paso Police Department.", "Originally interrogated about 4 crimes committed in the region in the 1990s, the retired trucker confessed a total of 79 kidnappings across California, Nevada, New Mexico, and Texas over a period of 40 years. Mr. White confessed to using a mix of hallucinatory drugs containing LSD and PCP to subdue his victims, before approaching them and carrying them inside his truck to assault them. In order to confuse his victims even more, he had set up the inside of his truck to look like an operating room and would wear an alien costume.", "The report was a fabrication. We could find no corroboration for in local El Paso news media or law enforcement statements, and the photograph captioned as showing \"FBI spokesman Darrell Johnson\" actually pictured Emmerson Buie Jr., special agent in charge of the FBI's El Paso division, speaking at a press conference in November 2017.", "The identity of the elderly man shown in a mugshot was not immediately clear. However, the same mugshot appeared in a 2011 blog post, meaning it did not relate to a December 2018 arrest.", "World News Daily Report is a well-known producer of junk news, whose web site features the following disclaimer which describes its articles as \"fictional\" and \"satirical\":", "WNDR shall not be responsible for any incorrect or inaccurate information, whether caused by website users or by any of the equipment or programming associated with or utilized in this website or by any technical or human error which may occur.", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website -- even those based on real people -- are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "World News Daily Report.   \"Texas Man Admits Kidnapping 79 People to Anally Probe Them While Disguised as an Alien.\"     3 December 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]