["About this rating", "On Oct. 3, 2019, the website National File reported a chronologically imperfect and vaguely formulated scoop that U.S. House Speaker Nancy Pelosi’s son, Paul Pelosi Jr., \"was an executive of a gas industry company that did business in Ukraine.\"", "Though the article alleges no specific wrongdoing, an implication of impropriety is suggested by factually stating that the Speaker promoted this company at an event in 2010, perhaps as an act of nepotism, and that Paul Pelosi Jr. went to Ukraine in 2017. The allegation coincides with unsubstantiated claims of corruption leveled against Democratic presidential candidate Joe Biden’s son by President Donald Trump. Similar claims have been leveled against other prominent Democrats and their family members.", "The National File revelation, such as it is, stems from the descriptions of two videos on YouTube promoting the related companies Viscoil Group LLC and NRGLab. In a video filmed during the 2010 X Prize announcement, Nancy Pelosi introduced her son, who then promoted those two companies via video. The description of the video reads, “Paul Pelosi Jr. is a member of [the] management team of Viscoil Group of Companies and NRGLab. Paul Pelosi Jr. is interested in developing clean energy that can replace gasoline and diesel as transportation fuel sources.”", "The first video established Pelosi Jr.’s connection to a “gas industry company,” while a second promotional video created by NRGLab allegedly established a link between that company and Ukraine. The second video, which consists primarily of platitudes about the importance of renewable energy, states in its description that “[Eurovision singer] Mika Newton and other artists are actively involved in promoting the clean technology of Viscoil Group of Companies and NRGLab. ... Newton helped to secure the rights to build a plant for the production of SH-boxes in Ukraine.”", "As such, the entire link to Ukraine rests in the assertion that the company NRGLab built or intended to build a manufacturing plant for something called an “SH-Box” in Ukraine. For several reasons, this is false. An “SH-Box,” according to a 2013 copy of NRGLab’s business plan, is an electrical generator powered by crystal growth that would be capable of “delivering electricity to billions of people throughout the world at a cost so affordable that it was previously unimaginable, as are the potential profits to be realized as the company ... accelerates production.”", "Such a device, billed as scalable and cheap, would indeed change the world. The scientific assertions underlying such a breakthrough rested not on peer-reviewed scientific literature, however, but on a proprietary demonstration witnessed by a handful of non-experts who signed non-disclosure agreements while under the supervision of NRGLab employees. Responding to the company's business plan on the website PESWiki, which says it is run by “a network of 50+ energy professionals who are dedicated to clean energy technology advancement,” a reviewer noted some basic scientific errors in their literature:", "One of the most common and well-founded criticisms of your material is that you give \"volts\" without also giving \"amps\". Either, by themselves, are not an indication of \"power\", which is calculated from volts x amps. The third party test reports only give volts, not amps. This video only mentions volts, not amps. I would strongly recommend that from now on in any data NRGLABS reports that they include both volts and amps.", "Whatever became of the SH-Box? By all indications, nothing. The product was largely pushed by someone named Ana Shell who describes herself as “an environmentalist, business woman, the owner of the private fund of entrepreneurs-inventors [named] Territory of Shell.” She has not mentioned an SH-Box in any of her blogs, websites, or Facebook pages since 2014. NRGLab has since pivoted to selling supplements.", "For what it’s worth, we reached out to her via her website anashell.com. She responded that, “Project SH-Boxed were sold a long time ago to a private company in SEAsia. There was no involvement of Paul Pelosi in that project.” Pelosi Jr. did not respond to our request for comment, but a spokesperson for the Speaker told PolitiFact that “[Viscoil] was based in Southern California and focused solely on U.S. business. The company later reorganized under a different name [NRG Lab], but Paul Pelosi Jr. played no role in the new entity.”", "Pelosi Jr. has involved himself in myriad green corporate ventures that have not always panned out. It is unclear how Pelosi Jr. became involved with Shell, if at all. There are several indications that her operation may not be on the up and up, however. As we reported in an earlier fact check, it does not appear that Newton ever had anything to do with NRG Lab. We reached out to Newton but received no response. Also, at least one individual listed as staff on Shell's website appears to use a re-purposed photograph of a Russian model with a different name for her associated Facebook page. We asked Shell what became of the SH-box, but she told us, “No further information would be provided.”", "Because Pelosi Jr. did not work for NRGlab during the time in which the company is alleged to have done business in Ukraine, and because the product allegedly produced by NRGlab in Ukraine does not exist, we rank the claim that “Nancy Pelosi’s son is an executive at a gas company that did business in Ukraine” as \"False.\"", "Howley, Patrick.   “Nancy Pelosi’s Son Was Exec At Gas Company That Did Business In Ukraine.”\r\n  National File.   3 October 2019.", "Soraghan, Mike.   “X Prize Winner Has Checkered Financial Past.”\r\n    New York Times.   27 October 2010.", "Olsen, Kyle.   “Nancy Pelosi’s Son Appears in Ukraine — To Talk Soccer?”\r\n    The American Mirror.   25 July 2017.", "The Corporate Governance Initiative (CGI).   “The Corporate Governance Initiative Picks Paul Pelosi Jr As Its New Executive Director.”\r\n    15 October 2019.", "AnaShell NRGLab.   “About Ana Shell.”\r\n    Accessed 8 October 2019.", "NRGLabNewTechnology (Youtube).   “NRGLab & New Technology.”\r\n    5 March 2013.", "nrglab.asia.   “NRGLab Strategic Business Plan 2013”\r\n    Archived on 17 August 2016.", "PESwiki.com.   “Directory:NRGLab Pte. Ltd. SH boxes.”\r\n    Archived on 26 September 2016.", "Ana Shell Media Press/em>.   “Team.”\r\n    Archived 11 October 2019.", "Funke, Daniel.   “Pelosi, Romney and Kerry don’t have sons working for companies linked to Ukraine.”\r\n    Politifact.   10 October 2019.", "Thomas, Owen.   “Paul Pelosi, Jr., The Fresh Green Prince of San Francisco.”\r\n    Gawker.   19 December 2008.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]