["Partisan division may be wide in Washington, but bipartisan work does go on. Ohio Sen. Sherrod Brown was joined by Senate colleague David Vitter, Republican of Louisiana, in working on legislation to address the issue of banks \"too big to fail.\"", "Looking to prevent future economic collapse and taxpayer-funded bailouts, they have pushed the Government Accountability Office (GAO) to detail the annual advantage that such banks continue to receive from the U.S. government.", "(Brown, Democrat of Avon, chairs the Senate's Consumer Protection Subcommittee of the Committee on Banking, Housing and Urban Affairs, and has worked for years on the \"too big to fail\" issue. Vitter is ranking member of the Economic Policy Subcommittee of the Committee on Banking, Housing and Urban Affairs.)", "\"Most Ohioans would be surprised to know that the same Wall Street megabanks which received bailouts from taxpayers in 2009 also receive taxpayer-funded advantages today simply because of their 'too big to fail' status,\" Brown wrote in a newsletter to constituents.", "\"This,\" he said, \"gives them access to cheaper funding and more favorable borrowing terms than dependable Main Street institutions, like Huntington Bank or the Peoples Bank in Coldwater, Ohio.\"", "PolitiFact Ohio admits we were also surprised about the \"taxpayer-funded advantages.\" We asked Brown's office for more information.", "His press office cited the explicit and implicit guarantee that the megabanks are, in fact, \"too big to fail\" -- and that the government will step in with a taxpayer-funded safety net during a financial emergency.", "The expectation of financial markets that megabanks have this government protection against failure is a subsidy that amounts to free insurance, Brown's office said.", "Because of this insurance, they said, megabanks can borrow money at lower rates than smaller institutions.", "The sources they cited include a study for the International Monetary Fund, which put the borrowing advantage at about 0.8 of a percentage point; the Federal Reserve Bank of Dallas, which says \"too big to fail\" banks enjoy subsidies that may lower their average funding costs a full percentage point relative to smaller competitors; and an analysis by Bloomberg View. Drawing on the IMF research, Bloomberg said the \"taxpayer subsidy\" for the 10 largest U.S. banks amounts to $83 billion a year.", "We looked further and found questions about Bloomberg's methodology figuring the size of what it referred to as a subsidy. Determining the size was one of the questions that Brown and Vitter put to the GAO.", "While its size may be in question, however, the existence of the implicit \"too big to fail\" guarantee is widely accepted as established fact.", "\"Unsecured depositors and creditors offer their funds at a lower cost to TBTF banks than to mid-sized and regional banks that face the risk of failure,\" Dallas Fed President Richard Fisher said in Washington in January.", "What remains unclear from Brown's citations is whether lower borrowing costs for big banks result in any present-day costs for taxpayers. But PolitiFact Ohio did find an economist who contends that by granting the too-big-to-fail guarantees, the government is \"giving something away of value\" that should be accounted for as lost revenue.", "\"Private entities such as insurance companies and hedge funds would charge a fair value for such options,\" said James Thomson, a vice president and financial economist in the research department at the Federal Reserve Bank of Cleveland. \"But not doing so, the government is forgoing revenues that could be used for other purposes. So yes, the implicit subsidy (or any subsidy) is equivalent to a tax expenditure - like investment tax credits, fair housing credits, and so on.\"", "Economists don't agree on the size of the guarantee, Thomson said, though researchers including economists at the Federal Deposit Insurance Corp. claim to have measured it, in addition to the IMF, Dallas Fed and Bloomberg among others..", "The most telling testimony about \"Too Big to Fail\" might be that of Federal Reserve Chairman Ben Bernanke to the Senate Banking Committee in February.", "Sen. Elizabeth Warren, a Massachusetts Democrat, pressed Bernanke about the \"free insurance policy\" for the biggest banks, using Bloomberg's figure of $83 billion. Video of the exchange is posted online.", "Bernanke readily conceded existence of the implicit guarantee, though he maintained it is built on false expectation.", "\"The subsidy is coming because of market expectations that the government would bail out these firms if they failed,\" he said. \"Those expectations are incorrect.... That's the expectation of markets, that doesn't mean that we have to do it.\"", "\"I understand that we’re all trying to get to the end of 'too big to fail,'\" Warren responded. But until it is ended, she said, \"it is working like an insurance policy. Ordinary folks pay for homeowners insurance. Ordinary folks pay for car insurance. And these big financial institutions are getting cheaper borrowing to the tune of $83 billion in a single year simply because people believe that the government would step in and bail them out. And I’m just saying, if they are getting it, why shouldn’t they pay for it?\"", "\"I think we should get rid of it,\" Bernanke said.", "Finally, we note the final report of the Congressional Oversight Panel on the Troubled Asset Relief Program (TARP), which said that the six biggest U.S. banks received a total of $1.27 trillion in government support during the financial crisis.", "The report notes the moral hazard and \"distortion of the financial marketplace through [TARP's] implicit guarantee of 'too big to fail' banks.\"", "The report says: \"It is not surprising that markets have assumed that ‘too big to fail’ banks are safer than their ‘small enough to fail’ counterparts. Credit rating agencies continue to adjust the credit ratings of very large banks to reflect their implicit government guarantee. Smaller banks receive no such adjustment, and as a result, they pay more to borrow relative to very large banks.\"", "The exact value of the \"too big to fail\" guarantee, or risk premium, or free insurance, remains in question -- and it is a question Brown and Vitter put to the Government Accountability Office.", "But the biggest banks that received bailouts in 2009 clearly do have a cost advantage in borrowing because of the implicit guarantee. And that advantage is not shared by smaller, community banks. That makes Brown’s statement partially accurate.", "However, at PolitiFact, words matter. Even if there is an implicit guarantee, it’s a stretch to call it a taxpayer-funded advantage the banks receive \"today,\" because no money has actually been spent and no dollars change hands. And no money would be spent unless the banks fail. Even then, as Bernanke says, \"that doesn't mean that we have to\" bail them out.", "It might seem like a fine line, but there is a difference between a taxpayer-backed advantage and a taxpayer-funded subsidy.", "We rate Brown’s statement Half True.", "Sen. Sherrod Brown, \"Ensuring Ohio Taxpayers Don’t Pay for Wall Street’s Failures,\" March 4, 2013", "Sen. David Vitter, \"Sens. Brown, Vitter React ...,\" March 11, 2013", "Email with Brown press office, March 6, 2013", "Brown-Vitter GAO Request.pdf", "SAFE Banking Report.pdf", "International Monetary Fund, \"Quantifying Structural Subsidy Values for", "Systemically Important Financial Institutions,\" May 2012", "Federal Reserve Bank of Dallas, \"Ending 'too big to fail,'\" Jan. 16, 2013", "Bloomberg, \"Why Should Taxpayers Give Big Banks $83 Billion a Year?\" Feb. 20, 2013", "Bloomberg, \"Remember That $83 Billion Bank Subsidy? We Weren't Kidding,\" Feb. 24, 2013", "Bloomberg, \"About That $83 Billion Bank Subsidy. We Still Mean It,\" Feb. 27, 2013", "Bloomberg, \"Why You Should Care About That $83 Billion Bank Subsidy,\" Feb. 28, 2013", "Federal Reserve Bank of Cleveland, \"How Big Is the Too-Big-to-Fail Subsidy?\" July 11, 2012", "Interview with James Thomson, March 15, 2013", "Federal Deposit Insurance Corp. via Social Science Research Network, \"Deposit Rate Advantages at the Largest Banks,\" March 1, 2013", "New York Times, \"Bernanke’s Credibility on ‘Too Big to Fail’,\" Feb. 28, 2013", "Sen. Elizabeth Warren, \"Q&A of Ben Bernanke at Senate Banking Committee Hearing,\" Feb. 26, 2013", "Congressional Oversight Panel for TARP, \"Final Report,\" March 16, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]