["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew Cuomo thinks you can win money by making a bet with someone on New York State’s tax rates. Ask people about what the state has done with the rates, and \"everybody’s going to say, ‘raise taxes,’ because it is inconceivable that a government actually lowers taxes,\" Cuomo said.", "At public appearances recently, Cuomo touted what he called the lowest tax rate for the middle class in 70 years.", "\"Wager anyone you know and say, ‘Did New York State raise taxes or lower taxes?’ \" Cuomo said. \"New York State has lowered taxes for everyone in the state and every income level in the state.\"", "Taxes are always a top issue for voters. So does the governor’s claim check out? Are middle-class state residents taxed at the lowest rate in seven decades?", "Who’s in the middle?", "No official state definition exists for the \"middle class.\"", "But in the scope of today’s tax brackets, the middle class are those making between about $40,000 to $300,000 a year.", "Who’s included in the middle class has changed over time with the rate of inflation. A salary today of $80,000 is equivalent to a $9,000 salary in 1953. The tax brackets used today are not the same as those used in past decades.", "In 1946, anyone making more than $9,000 was taxed at a 3.5 percent rate. The next year the rate increased to 4.2 percent. In 1948, the rate jumped to 6.3 percent, and that’s the year the Cuomo administration bases its claim.", "The Department of Tax and Finance says most - if not all - earners in the middle class in 1948 would have paid the top rate. That year the top rate applied to people making about $9,000. That fits what the state has defined as middle class in today’s dollars, and the Department of Tax and Finance says that’s how the middle class would have been defined in that year.", "How low?", "Since 1948, the lowest top tax rate fell to between 6.45 and 6.65 percent for people in the same comparable income bracket. That was in 2014, and remains at that level. That’s higher than the now-scheduled rate for 2025 as part of this year’s resolution.", "Anyone making between $40,000 and $150,000 will see their income tax rate drop to 5.5 percent by that year. The tax rate will drop to 6 percent for those making between $150,000 and $300,000.", "But there are caveats.", "The rates do not factor in tax exemptions or deductions, as pointed out by E.J. McMahon from the Empire Center for Public Policy. The center researches and analyzes the state’s economy, including the tax law.", "To some extent, the tax rates for 2025 and 1948 are like apples to oranges, McMahon said.", "\"It’s much like saying the 2016 Ford Focus has the best headroom since the 1946 Ford Tudor — the two tax codes and the household situations to which they apply are that different,\" McMahon said.", "He wrote recently the new rates will be the largest tax cut since the mid-1990s, when lawmakers passed the Taxpayer Relief Act. At the time, the legislation dropped taxes to the lowest rates since 1954.", "The new tax rates, once fully phased in, will be even lower, according to the Department of Taxation and Finance data.", "An analysis from the Fiscal Policy Institute confirms Cuomo’s claim holds true - but like McMahon, the institute points out the income range that defines the middle class looks different today than it did 70 years ago.", "The 1958 exception", "The Department of Taxation and Finance, in a different report, reveals another interesting historical nugget.", "Employers were not required by law to withhold tax until 1959. According to the document, because this would have required two years of taxes to be paid in just one year, taxes were ‘canceled’ for 1958 - meaning the tax rate for that year was zero.", "Our ruling", "Governor Andrew M. Cuomo claimed new tax rates passed by lawmakers during this year’s state budget process are the lowest in the state in 70 years. Data from the Department of Taxation and Finance backs up his claim.", "Because of an unusual set of circumstances, there was no income tax rate in 1958 as the state implemented a new system. The first year rates will appear lower than the 1948 rates will be in 2019.", "We rate this claim as Mostly True.", "Press Conference from Governor Cuomo, June 22. Accessed June 28", "Press Release: Governor Cuomo and Legislative Leaders Announce Agreement on 2016-17 State Budget, Accessed June 28", "NYS Senate Bill 6409C (Budget Bill With New Tax Rates), Passed March 31, 2016. Accessed June 28", "Email conversation with Ken Girardin from the Empire Center for Public Policy", "Information and analysis from E.J. McMahon from the Empire Center for Public Policy", "Email conversation and analysis from James Parrot from the Fiscal Policy Institute", "Documents Provided by the NYS Department of Taxation and Finance", "Progressive Improvement: Report from Dept. of Taxation and Finance, Published December 1995,  Accessed June 28, 2016", "Morris Peters from the NYS Department of Taxation and Finance", "Inflation Comparison from the U.S. Department of Labor", "Research from Stephen Gersztoff, Law Librarian at the New York State Legislative Library", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]