["The country is infamous for high rates of crime and violence. But a widely reported crime ranking of its cities was based on the perceptions of 2,704 people.", "In February 2021, South African websites reported that six of the country’s cities were in the top 20 of the “most dangerous” in the world, according to the Numbeo.com Crime Index by City 2021.", "Numbeo.com’s crime index only uses the perceptions of visitors to its website. It is not based on any real data.", "Crime statistics contradicts the index and experts say better data on perceptions of crime exist.", "South Africa has a reputation for high rates of crime and violence. And now six of its cities have been named among the most dangerous in the world.", "That’s according to a February 2021 article on the local website Independent Online.", "Pretoria, Durban, Johannesburg, Pietermaritzburg, Port Elizabeth and Cape Town are “ranked among a global top 20 of the most dangerous cities”, the article says, citing the Numbeo.com Crime Index by City 2021.", "South American cities also feature heavily in the list. Caracas, the capital of Venezuela, is in first place, and six Brazilian cities are in the top 20.", "Business Tech, News24, Khaya FM and East Coast Radio also reported on the ranking, with most headlines saying South African cities were among the world’s “most dangerous”.", "What is the ranking based on? And how did South Africa manage to scoop six of the top 20 positions? We took a closer look.", "Numbeo.com publishes data about the cost of living and quality of life in countries across the world. But its Crime Index by City 2021 is not based on actual levels of crime. Instead, it’s ranked by the perceptions of the website’s visitors.", "Survey participants are asked a series of questions about crime and safety in their cities. These include “How serious do you feel the level of crime is?” and “How safe do you feel walking alone in this city during the daylight?” The answers are filtered for “potential spam”, with the rest used to build the list.", "Mladen Adamovic, Numbeo’s chief executive, told Africa Check his company did not claim that the index ranked the world’s most dangerous cities. “For as long as I remember, we haven’t suggested that.”", "The cities in the index are only included as people join the survey and state their perceptions. A rough total of 97,000 people took the survey. Only 2,704 were from South Africa.", "“It is not based on fact or accurate data sources,” Lizette Lancaster, manager of the Crime and Justice Information and Analysis Hub at the Institute for Security Studies, told Africa Check.", "“The study is not meant to be a comprehensive census or even a representative sample of violent cities but rather an indication of the opinions of those who submitted a response,” she wrote in an email.", "Lancaster added that responses could have been skewed towards people with internet access who understood English and had a motive to respond. The motive might be concerns about crime, or that they had been victims of crime.", "Dr Guy Lamb, former director of the Safety and Violence Initiative at the University of Cape Town, had a similar take. “The sample is unrepresentative of each city.” This, he said, “unfortunately means the results are not comparable”.", "Lamb said any attempt to rank cities using Numbeo’s survey method would give questionable results. “Many South African cities are rated as being more unsafe than cities in active war zones, such as Tripoli, Kabul and Baghdad.”", "So how can we find accurate information about crime levels in South African cities?", "Lamb referred Africa Check to the South African Cities Network. This group of cities and partners works to exchange information and experience about the best practice in urban development.", "In 2020, the network published an analysis on the state of crime and violence in nine of South Africa’s major cities. The analysis is based on crime statistics for the 2018/19 financial year, in a report by the South African Police Service.", "The report is by municipality, not city. Durban is in the eThekwini metropolitan municipality. Johannesburg is part of the larger City of Johannesburg municipality. And Pretoria is a city in Tshwane, a large municipality that stretches across the north of Gauteng province.", "The police’s report says that, in 2018/19, crime rates for murder, robbery and property-related crimes were higher in Cape Town than in eThekwini, Johannesburg and Tshwane. Numbeo’s ranking doesn’t reflect this. Cape Town is 19th in the index, while Pretoria, Johannesburg and Durban are way above, in the third, fourth and fifth place.", "And how “dangerous” are South Africa’s cities? What data is there about people’s feelings of safety? Lamb and Lancaster both referred Africa Check to Statistics South Africa’s 2019/20 Victims of Crime Survey. This indicates that 87% of the population felt safe walking alone in their neighbourhood during the day, while 41.8% felt safe walking at night. And the feeling of safety was up since the 2018/19 survey. “It's important to note whether figures are part of an upward or downward trend,” Lancaster told us.", "Lamb pointed out that the Victims of Crime survey was based on a reliable and representative sample, using robust data gathering methods.", "South African websites reported that Pretoria, Durban, Johannesburg, Pietermaritzburg, Port Elizabeth and Cape Town were in the top 20 of the world’s “most dangerous” cities, according to the Numbeo.com Crime Index by City 2021.", "But the index does not reflect levels of crime. Its ranking is based only on the perceptions of people who have visited the Numbeo.com website and chosen to take part in a survey. The survey sample is limited to people who have access to the internet, understand English, and have an opinion about crime in South Africa.", "The ranking is contradicted by rigorous data on crime levels in South Africa’s cities. Reports that the six South African cities are in the top 20 of the world most “dangerous” are incorrect.", "Photo: SAUL LOEB / AFP", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]