["About this rating", "A judge in Pennsylvania ruled that a small number of mail-in ballots, a majority of which are likely votes for Joe Biden, would be disqualified for first-time voters who were unable to confirm their identification by Nov. 9.", "The disqualified mail-in ballots had already been segregated awaiting the judge's decision, meaning they had not yet been counted. It did not appear that this would have an impact on current vote tallies.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 12, 2020, the YouTube channel NewsNOW from FOX uploaded a video with the title: \"TRUMP TEAM WIN: MAJOR Legal Win For President Trump IN PENNSYLVANIA.\"", "In the video, reporter Mike Pache detailed a \"big win\" for the Trump campaign.", "There was a big moment that happened just moments ago that we want to bring your attention to. Some stations might not be covering this. We do, and we bring you everything that's happening in the world of news. It was a big win right now that they are calling it. The Trump campaign is calling this one a big win in Pennsylvania, as the Pennsylvania court secretary of state lacked authority to change the deadline two days before Election Day. A Pennsylvania judge ruled in favor of the Trump campaign today, ordering that the state may not count ballots where the voters needed to provide proof of identification and failed to do so by Nov. 9. State law said that voters have until six days after the election.", "The conservative news and opinion website Newsmax published a similar story, reporting that \"a Pennsylvania judge has ruled that some mail-in ballots belonging to first-time voters in the state who hadn’t confirmed their identity before Nov. 9 will not be counted, in a small victory for the Trump campaign, the Pittsburgh Post-Gazette reports.\"", "However, the NewsNOW from FOX video and the Newsmax story left out one key detail: The small number of mail-in ballots that were ruled disqualified had already been segregated ahead of the judge's decision, meaning that the ruling did not appear to change current vote tallies. People commenting on the YouTube video and Newsmax story seemed largely unaware of this fact. A Google search for the YouTube video title also showed that Google News amplified the somewhat misleading story across other FOX affiliates.", "In Newsmax's story, the author quoted the Pittsburgh Post-Gazette, which reported the key fact in the second sentence of its story.", "The Trump campaign on Thursday won a case that attempted to disqualify a small number of mail-in ballots for first-time Pennsylvania voters who were unable to confirm their identification by Nov. 9.", "These ballots had been segregated pending the judge’s decision and have not yet been counted, so their disqualification will not affect the current vote count in Pennsylvania. Joe Biden won the state, and subsequently the election, on Saturday and currently leads President Trump by more than 54,000 votes.", "Commonwealth Court President Judge Mary Hannah Leavitt ruled that Pennsylvania Secretary of State Kathy Boockvar lacked authority when she issued guidance to county boards of election to count mail ballots so long as voters’ IDs were confirmed by Nov. 12.", "The Post-Gazette also reported that it's not known how many mail-in ballots are included in the segregated portion. However, it is reportedly a \"small number,\" and \"these ballots only applied to first-time voters whose identities had not been confirmed before the Nov. 9 deadline.\" The Associated Press reported that impacted ballots \"may number a few thousand, or less,\" and that \"the ballots affected may not have been tabulated yet and are unlikely to affect the outcome of the presidential race in Pennsylvania.\"", "A writer for the AP also wrote an explainer on why the Associated Press already projected Joe Biden to win the state of Pennsylvania: \"The AP called the race for Biden, who held a 34,243-vote lead, after it determined that the remaining ballots left to be counted would not allow Trump to catch up.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]