["The 31-second video was shared here on Facebook on February 13, 2020.", "Below is a screenshot of the misleading post:", "The post’s Hindi caption translates to English as: “Today in Nagla road locality in Hathras town, a bag full of chicken and lamb meat pieces were thrown near a temple by Muslims. This angered local Hindus, police were informed and they arrived to take appropriate action; yours servant Raju Kaushik, chief of International Hindu Body in Hathras.”", "Hathras is a city in Uttar Pradesh, India’s most populous state.", "The same video was also published here, here and here on Facebook; and here and here on Twitter with a similar claim.", "The claim is false; police in Hathras said they investigated the matter and found that stray dogs had scattered rooster carcasses at the scene.", "“A video on social media is being shared with a claim that Muslims threw pieces of meat near a Hindu temple. Our officer reached the spot and after an investigation found that there were not meat pieces but rooster skin and feathers were thrown in a garbage dump, which was picked by street dogs and scattered all over,” the police department said in a statement on Twitter on February 13, 2020. “The claim on social media is fake and Hathras police refutes all the claims.”", "हाथरस पुलिस द्वारा उक्त खबर का खंडन किया जाता है। pic.twitter.com/Ov0O0thAKe", "The footage shared in the misleading posts shows a pile of rubbish and multiple dogs next to the rooster carcasses, as seen in the screenshot below:", "A closer analysis of the footage found rooster caracasses could also be seen on the street, corresponding with the police report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]