["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidates Ted Cruz (left) and Donald Trump greet each other on stage during a rally to oppose the Iran nuclear agreement on Capitol Hill on Sept. 9, 2015. (AP/Carolyn Kaster)", "Along with Donald Trump and the Tea Party Patriots, U.S. Sen. Ted Cruz, R-Texas, spoke out harshly against a nuclear agreement with Iran at the U.S. Capitol. When the rally was over, Cruz followed up by tweeting out video clips of some of his comments.", "\"The #IranDeal will facilitate and accelerate the nation of Iran acquiring nuclear weapons,\" he said in a tweet on Sept. 9, 2015.", "His comment caught our attention. We wondered whether it was accurate that the agreement would actually make it easier -- not harder -- for Iran to get a nuclear weapon.", "What the deal will do", "First, let’s recap what the deal would do. Broadly speaking, Iran would agree to accept strict curbs on nuclear technologies and intrusive access by nuclear-weapons inspectors for 10 to 25 years, with a pledge to abide by existing international treaties limiting its nuclear ambitions in perpetuity. In exchange, international economic sanctions against Iran would be lifted, as long as Iran doesn’t cheat. If Iran did cheat, sanctions could be reimposed.", "Specifically, the deal requires Iran to give up 97 percent of its stockpile of enriched uranium, as well as most of the centrifuges it can use to enrich uranium. In addition, Iran agrees to only enrich uranium to a level unsuitable for weapons for 15 years, and to cease production of plutonium, the other element that can be used to build a bomb. Known nuclear sites would be monitored for 15 years to confirm compliance, and inspectors would have the ability to enter undeclared sites suspected of nuclear use, though with possible delays of up to 24 days.", "If Iran were to abide by these rules for 10 years, scientists say it would take them at least 12 months to build a weapon.", "Cruz's case", "Cruz’s staff did not respond to inquiries for this story, and we could find only one nuclear-policy expert who thought Cruz’s claim may have some merit.", "Michaela Dodge, a senior policy analyst with the conservative Heritage Foundation, said it depends on whether and when Iran cheats on the deal. \"There’s a some degree of assumption that Iran will cheat in this, which isn’t entirely unreasonable given Iran’s history,\" she said. \"Let’s say Iran abides by the deal just long enough to have sanctions lifted and lucrative contracts signed, and then pulls out, you can make the case\" that Cruz does, she said.", "This might mean Iran sticking with the agreement for two years, then pulling out and pursuing a weapon, Dodge said.", "Still, even this scenario -- problematic though it would be geopolitically -- would enable two years of tight international scrutiny of Iran’s nuclear program that would not otherwise exist without the agreement.", "And it’s not as if today’s economic sanctions against Iran are expected to live on if the agreement fails to be enacted. Most observers assume that U.S. allies will begin loosening key sanctions whether or not the agreement is implemented.", "\"The European Union has already begun the process of suspending its sanctions on Iran, and the U.N. Security Council likewise wasted no time in passing a resolution for sanctions relief, though it delayed implementation for 90 days,\" Suzanne Nossel, a former deputy assistant secretary of state at the U.S. State Department, recently wrote in Foreign Policy. \"While congressional naysayers now trumpet the success of sanctions and demand that they remain in place, experts uniformly affirm that their effectiveness depends on wide multilateral support.\"", "Obstacles to an Iranian bomb", "All the other nuclear-policy experts we checked with said the deal puts roadblocks in the way of Iran's effort to pursue a nuclear weapon -- roadblocks that wouldn’t exist if the deal simply fell apart. They said that Cruz's statement went too far.", "\"The logic is astounding,\" said Richard Nephew, a research scholar and program director for economic statecraft, sanctions and energy markets at Columbia University. \"Fifteen years of restrictions and upwards of 20 years of enhanced inspections will hardly facilitate an Iranian nuclear weapon.\"", "Matthew Bunn, a nuclear specialist at the Harvard Kennedy School, agreed, calling Cruz’s logic \"bizarre.\"", "\"The terms of the deal require Iran to reduce its installed centrifuges by two-thirds, eliminate almost all of its stock of enriched uranium, modify its Arak reactor to drastically reduce its ability to produce plutonium, and to accept much broader inspections,\" Bunn said. \"Those actions would slow and impede any nuclear weapons effort, not facilitate and accelerate it.\"", "This is not to say that there is no case to be made against the agreement. Opponents have argued that it simply delays by a decade or so Iran’s eventual acquisition of a bomb, or that the United States and its allies should have negotiated stronger protections, or that by agreeing to the deal, the United States is giving its tacit approval to Iran moving toward a bomb after the deal’s strongest provisions expire.", "But compared to letting the deal evaporate, it’s hard to see how enactment of the deal makes it easier for Iran to get a bomb.", "Our ruling", "Cruz said, \"The Iran Deal will facilitate and accelerate the nation of Iran acquiring nuclear weapons.\"", "The Iran deal may be less than perfect, but experts say it’s hard to see how implementing the agreement -- rather than doing nothing at all -- would actually \"facilitate and accelerate\" an Iranian nuclear weapon. The worst-case scenario would be that the deal throws up a couple years’ worth of roadblocks that would not exist otherwise. We rate the claim False.", "Correction: The Iran deal requires Iran to reduce its stockpile of enriched uranium by 97 percent. A previous version of this fact-check described the reduction differently.", "Ted Cruz, tweet, Sept. 9, 2015", "Suzanne Nossel, \"This is what will happen if Congress blows up the Iran nuclear deal\" (in Foreign Policy), July 30, 2015", "The Guardian, \"Iran nuclear deal: the key points,\" July 14, 2015", "PolitiFact, \"Deal puts Iran's nuclear program under lock, key and camera 24/7, says Rep. Don Beyer,\" July 16, 2015", "PolitiFact, \"John Kerry says Iran nuclear agreement 'never sunsets. There's no sunset in this agreement,’ \" Sept. 3, 2015", "Email interview with Michaela Dodge, senior policy analyst with the Heritage Foundation, Sept. 9, 2015", "Email interview with Daryl G. Kimball, executive director of the Arms Control Association, Sept. 9, 2015", "Email interview with Angela Canterbury, executive director of the Council for a Livable World, Sept. 10, 2015", "Email interview with Matthew Bunn, nuclear specialist at the Harvard Kennedy School, Sept. 9, 2015", "Email interview with Richard Nephew, research scholar and program director for economic statecraft, sanctions and energy markets at Columbia University, Sept. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]