["About this rating", "The Oklahoma Department of Public Safety has purchased Electronic Recovery and Access Devices (ERADs), allowing them to seize money on gift cards and prepaid debit cards.", "ERADs do not give the Oklahoma Highway Patrol access to people's bank accounts.", "On 8 June 2016, the web site Oklahoma Watch published a report concerning the purchase of Electronic Recovery and Access to Data machines (ERADs) by the Oklahoma Department of Public Safety, which gives the state a new tool to conduct civil forfeitures:", "The Oklahoma Department of Public Safety has purchased several devices capable of seizing funds loaded on to prepaid debit cards to aid troopers in roadside seizures of suspected drug-trafficking proceeds.", "The portable card scanners are designed to be carried in law enforcement vehicles, allow troopers to freeze and seize money loaded onto a prepaid debit card, and to return money to an account whose funds were seized or frozen.", "The vehicle-mounted scanners are also capable of retrieving and storing limited account information from other cards as well, such as banking debit cards, credit cards and “payment account information from virtually any magnetic stripe card,” according to the website and patent documents of the device manufacturer, Texas-based ERAD Group Inc. ERAD stands for Electronic Recovery and Access to Data.", "Shortly after the Oklahoma Watch article was published, a petition was started on ActionSprout.io, which claimed that the Oklahoma Highway Patrol now had a device that could take money out of your bank account:", "Oklahoma Highway Patrol have begun using a new device called ERAD. This device allows cops to scan any credit or ATM cards and seize any money connected with that card.", "How is this legal? A REPUBLICAN state senator has already sounded off on this civil liberties nightmare. \"We've seen single mom's stuff be taken,\" he said, \"a cancer survivor his drugs taken... We've seen innocent people's stuff being taken. We've seen where the money goes and how it's been misspent.\"", "The petition is, whether intentionally or not, misleading. While the state of Oklahoma has purchased ERADs, the devices are not capable of taking money directly out of bank accounts; according to a FAQ section on the Texas-based ERAD group's web site, the devices only work with prepaid cards:", "Fin Cen defines prepaid access as \"access to funds or the value of funds that have been paid in advance and can be retrieved or transferred at some point in the future through an electronic device or vehicle, such as a card, code, electronic serial number, mobile identification number, or personal identification number.\" Open Loop prepaid cash cards, closed loop retailer gift cards and stored-value cards are example of prepaid access devices.", "The ERAD group writes that these devices after customs officials noticed a \"significant number of prepaid cash cards moving across the border\":", "Even with probable cause, they had no way of identifying the card value, freezing the funds or seizing the money at the point of arrest. ERAD-Prepaid solved that problem by condensing a process that takes many days, weeks or months into one that takes a few seconds.", "Civil forfeiture is a major issue in Oklahoma. While law enforcement officials argue that it is a necessary measure to curb drug trafficking, critics claim that these seizures often affect innocent people:", "Law enforcement officials in Oklahoma and elsewhere describe civil asset forfeiture as an important weapon against the drug trade, allowing them to target illicit proceeds that may not be in proximity to contraband. They say ERAD technology is a necessary tool to keep up with criminals who have begun putting money on prepaid cards in order to avoid having cash seized by police.", "“If someone has 300 cards taped up and hidden inside the dash of a vehicle, we’re going to check that,” Lt. John Vincent, public information officer for the Oklahoma Highway Patrol, told Oklahoma Watch.", "[...]", "A hidden stack of hundreds of cash cards may seem inherently suspicious, but critics of civil asset forfeiture say hypotheticals like this obscure concerns that the practice is overused, often in ways that violate people’s due process and property rights.", "“Whether someone has 100 debit cards or one, that in and of itself is not illegal,” state Sen. Kyle Loveless (R), who has spearheaded an unsuccessful push to overhaul Oklahoma’s civil forfeiture laws, told The Huffington Post.", "Officers in Oklahoma can't wipe out anyone's bank account with an ERAD, but they can use these devices, along with current civil forfeiture laws in the state, to check, freeze, and seize funds on prepaid cards.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]