["About this rating", "Peter Neffenger, a U.S. Coast Guard admiral, former chief of the Transportation Security Administration, and chairman of Smartmatic's board of directors, is a member of one agency review team aiding Biden's transition to the White House.", "Neffenger is not the chairman of Dominion Voting Systems. Smartmatic is a competitor, not a subsidiary, of Dominion.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In the wake of the U.S. presidential election in November 2020, a series of unsubstantiated claims about voter fraud were circulated by U.S. President Donald Trump and his supporters in an apparent attempt to sow distrust in the integrity of the election and cast doubt on President-elect Joe Biden's victory. Many of these rumors centered on Dominion Voting Systems, a company that provides election software to several counties around the United States.", "We have already debunked a number of these rumors (no, Dominion did not delete millions of votes; no, the company is not owned or funded by House Speaker Nancy Pelosi or Hillary Clinton; no, a \"glitch\" did not switch votes from Trump to Biden), but new wrinkles are continuously being added to this conspiracy theory.", "One recent rumor claimed that a member of Biden's transition team, Peter Neffenger, sat on the board of Dominion Voting Systems' \"subsidiary\" Smartmatic:", "There are a few kernels of truth to this claim. Neffenger, a U.S. Coast Guard admiral and former administrator of the Transportation Security Administration, is a member of one of the agency review teams aiding Biden's transition to the White House. Neffenger is also the chairman of Smartmatic's board of directors. However, Smartmatic is a competitor of Dominion, not a subsidiary.", "Eddie Perez, a voting technology expert at the Open Source Election Technology (OSET) Institute, a nonpartisan election technology research and development nonprofit, told The Associated Press that there is no connection between the two companies.", "Perez said: \"It appears that Mr. (Rudy) Giuliani is making some wild and unfounded claims that are connecting the dots between companies that appear to be unrelated.\"", "Smartmatic and Dominion have also both published statements to address these rumors. Both companies noted that they are competitors in the election space and do not have any financial interests in the other's success.", "In November 2020, Smartmatic published a \"response to misinformation\" to address some of the claims that had been circulating about the company. Smartmatic wrote:", "In the aftermath of the 2020 general election, there has been a great deal of misinformation being circulated about Smartmatic and other companies that provide election technology to voting jurisdictions in the US. We would like to dispel these incorrect statements with facts.", "Smartmatic has never owned any shares or had any financial stake in Dominion Voting Systems.", "Smartmatic has never provided Dominion Voting Systems with any software, hardware or other technology. The two companies are competitors in the marketplace.", "In another article, Smartmatic addressed some additional claims that circulated in the wake of the 2020 election. We reproduced the portions of the text relevant to this topic below:", "Does Smartmatic own any other voting machine company?\nNo.", "Has Smartmatic owned any voting machine company in the USA?\nSmartmatic owned Sequoia Voting systems and sold it in 2007.", "Is Smartmatic’s software used in other company’s voting machines?\nNo. Smartmatic’s software is not licensed or otherwise used by other companies.", "Were Smartmatic voting machines used in Pennsylvania, Georgia, Arizona, Nevada, Michigan, or North Carolina?\nNo. None of these states used Smartmatic technology.", "Is Smartmatic allied with any political parties?\nNo. Smartmatic has no ties to political parties or groups in any country. Smartmatic’s employees are required to adhere to a strict ethics code that, among other things, prohibits them from making political donations.", "Does George Soros have any involvement in Smartmatic?\nNo. George Soros has never had any ownership stake in, or involvement with, Smartmatic. This fact was confirmed again by The New York Times on November 3, 2020.", "Dominion, too, has addressed these rumors.", "DOMINION IS NOT, AND HAS NEVER BEEN, OWNED BY SMARTMATIC.\nDominion is an entirely separate company and a fierce competitor to Smartmatic.", "Dominion and Smartmatic do not collaborate in any way and have no affiliate relationships or financial ties. Dominion does not use Smartmatic software.", "The only associations the companies have ever had were:", "It should also be noted that, while Neffenger is technically a member of Biden's transition team, this does not mean that he has landed a future position in the White House. In fact, Neffenger is only listed as a \"volunteer,\" as opposed to a \"detailee\" or a \"full-time transition employee,\" with the advisory team dealing with Homeland Security. Here is how Biden's \"Build Back Better\" website describes the purpose of agency review teams:", "Agency review teams are responsible for understanding the operations of each agency, ensuring a smooth transfer of power, and preparing for President-elect Biden and Vice President-elect Harris and their cabinet to hit the ground running on Day One. These teams are composed of highly experienced and talented professionals with deep backgrounds in crucial policy areas across the federal government. The teams have been crafted to ensure they not only reflect the values and priorities of the incoming administration, but reflect the diversity of perspectives crucial for addressing America’s most urgent and complex challenges.", "[...]", "Volunteers: Individuals who are volunteering for the Transition in their personal capacity. For these team members, their current or most recent employer is listed (for informational purposes only), and their source of funding is listed as “Volunteer.”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]