["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An election official checks a voter's identification in Milwaukee on Feb. 21, 2016. (Mike De Sisti photo)", "In a blog post one month before Wisconsin’s presidential primary election -- which was a test for the state’s photo ID law -- U.S. Rep. Mark Pocan called for making it easier to vote in the Badger State.", "But the Madison-area Democrat’s post on Medium, an online publishing platform for sharing information and viewpoints, started by making a claim about voter fraud that we want to check.", "\"First, we need to accept the fact that in-person voter fraud by impersonation is virtually non-existent, with only 10 cases proven nationally out of 1 billion ballots cast since 2000,\" Pocan, who opposes Wisconsin’s newly reinstated photo ID law, wrote in the March 7, 2016 post.", "\"Let’s put it this way, more people are struck by lightning than commit in-person voter fraud.\"", "Getting struck by lightning might actually be more common than what you’d guess.", "What about in-person voter fraud by impersonation -- that is, claiming to be someone else as you cast your ballot?", "We’ll note up front that there are various types of voter fraud, but Pocan is citing one particular type.", "Photo ID laws controversial", "Laws requiring citizens to show photo identification in order to vote have long been controversial across the country, including in Wisconsin. They are praised as a way to prevent fraud and criticized as being a barrier for some citizens, including college students and those who don’t have a valid drivers license.", "But when GOP Wisconsin Gov. Scott Walker said in June 2015 that most Americans support voter ID laws, we rated his statement Mostly True. Polls showed strong support for voter ID laws, including from Democrats.", "Walker signed Wisconsin’s voter ID law in 2011, but the requirement was in place for only the spring 2012 primary election before being blocked by court challenges. Those eventually failed and the requirement was reinstated.", "The April 2016 primary was the first high-turnout election since the reinstatement.", "Similar claim", "A claim similar to Pocan’s was made in August 2015, days after Texas’ voter ID law was ruled unconstitutional by a federal appeals court.", "\"You’re more likely to get struck by lightning in Texas\" than find in-person voter fraud, U.S. Sen. Cory Booker, D-New Jersey, said in a national television interview.", "PolitiFact National rated Booker’s statement, which Booker said was about voter fraud by impersonation, as True.", "The probability of being struck by lightning in Texas was 1 in 1.35 million. Based on the number of in-person voter fraud cases identified in Texas versus the number of ballots cast, those odds were lower -- 1 in 18 million.", "Pocan’s claim is somewhat different -- it is about actual numbers, not odds, and is national in scope.", "Lightning strikes", "The National Weather Service tracks lightning strikes. The most recent figures -- in terms of injuries as well as deaths caused by lightning strikes -- cover the 10-year period from 2004 through 2013.", "On average, the number of deaths and injuries reported each year was 267 -- 33 deaths, plus 234 injuries.", "The weather service believes that total figure is higher, however, because some injuries from lightning strikes are not reported. It estimates that the total number of casualties per year is actually 330 -- 33 deaths plus 297 injuries.", "Documented cases of voter fraud by impersonation are far fewer.", "Voter fraud", "Election administration expert Justin Levitt, who has been tracking allegations of voter fraud since 2000, most recently wrote on the topic in the Washington Post in August 2014.", "Levitt, a professor at Loyola Law School in Los Angeles, said in the piece that dating back to 2000 he found around the country 31 \"credible allegations of potential fraud that might have been prevented by a rule requiring ID at the polls\" -- that is, possible fraud involving impersonation.", "Other election experts, including Lorraine Minnite of Rutgers University, also have used the lightning strike comparison.", "It’s fair to say, however, that impersonation cases can be hard to count in that they are hard to prove -- particularly when no photo ID requirement is in place and a voter can cast a ballot simply by stating the name of a registered voter.", "So the number of cases of in-person fraud by impersonation may be higher than that cited by Levitt, but no independent source suggests it is higher than the number of lightning strikes.", "Our rating", "Pocan said: \"More people are struck by lightning than commit in-person voter fraud\" by impersonation.", "Roughly 300 people per year are struck by lightning in the United States. But cases of voter fraud -- someone impersonating another voter -- are documented even less often.", "We rate Pocan’s statement True.", "National Weather Service, lightning deaths and injuries, 2004-2013, accessed April 4, 2016", "PolitiFact National, \"Lightning strikes more common in Texas than in-person voter fraud, says Cory Booker (True),\" Aug. 18, 2015", "PolitiFact Georgia, \"In-person voter fraud a ‘very rare phenomenon (Mostly True),\" Sept. 19, 2012", "Washington Post Wonkblog, \"A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots case,\" Aug. 6, 2014", "Email, Rutgers University public policy and administration professor Lorraine Minnite, April 4, 2016", "Email, Brennan Center for Justice communications coordinator Rebecca Autrey, April 5, 2016", "Email, U.S. Rep. Mark Pocan staffer Melanie Conklin, April 5, 2016", "Brennan Center for Justice, \"The truth about voter fraud,\" 2007", "U.S. News & World Report, \"The ‘myth’ of voter fraud,\" April 24, 2012", "Heritage Foundation, \"A sampling of election fraud cases from across the country,\" Aug. 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]