["A Facebook post that claims a total of 157,519 “Islamic-inspired terrorist attacks” were carried out between 1970 and 2015 has been shared more than 100 times. It contains a graphic that purports to illustrate the geographical distribution of those attacks. The claim is false; the number is very close to the total number of terror attacks found to have taken place over the same period by an academic study.", "The claim was made in this misleading Facebook post, published on July 18, 2019 by a page called “Guardians of Australia” which has nearly 65,000 followers.", "Its caption reads, in part: \"Since 1970, 157,519 Islamic inspired terrorist attacks have been carried out and the consequences are horrific, with MILLIONS DEAD or injured for life and flee in terror everyday yet the influence goes unnoticed?\"", "It also says: “Islamic inspired terrorist incidents plotted on a map of the world 1970–2015. A total of 157,520 incidents are plotted. Orange: 1970–1999, Red: 2000–2015", "\"All except for one! ONE! ONE! ...the other 157,519 were all Islamic inspired attacks.\"", "Below is a screenshot of the post:", "AFP did a reverse image search on Google and found the same map posted here on the Wikimedia Commons online media repository.", "Below is a screenshot comparison of the map in the misleading post (L) and the one on Wikimedia (R):", "The map on Wikimedia is credited to Global Terrorism Database (GTD).", "According to its webpage, the database is open-source and includes information on terrorist events worldwide. It is maintained by the National Consortium for the Study of Terrorism and Responses to Terrorism (START) at the University of Maryland (UMD).", "The GTD defines terrorist attacks here as \"the threatened or actual use of illegal force and violence by a non-state actor to attain a political, economic, religious, or social goal through fear, coercion, or intimidation\".", "In an email to AFP dated July 21, 2019, GTD Program Manager Erin Miller said \"the claims in this post are not remotely true\".", "“Between 1970 and 2015, we have records of 157,204 terrorist attacks that resulted in 350,552 deaths, including perpetrator deaths. We do not systematically classify all the attacks by ideology, so any claims of ideological classifications made based on the entire GTD were either done by an analyst outside START at UMD, or were entirely fabricated,\" Miller said.", "“We do include information about the perpetrator groups responsible for the attacks. Worldwide, about 45% of all attacks were carried out by unknown/unidentified perpetrator groups.", "“Of the remaining attacks, tens of thousands were carried out by perpetrators having nothing to do with radical Islamism -- Shining Path, Farabundo Marti National Liberation Front, New People's Army, the Irish Republican Army, the FARC, Basque Fatherland and Freedom, to name just a few.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]