["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assembly Speaker Robin Vos (R-Rochester) says his support for a private bail system and bounty hunters in Wisconsin is a fiscal matter.", "The whole point of bond, Vos told a group of Journal Sentinel reporters and editors June 10, 2013, is to guarantee that defendants show up for court.", "\"Anything that increases the ability of people to show up for court is a good thing because a smaller number of no-shows means more effective and efficient courts and hopefully a smaller cost for taxpayers,\" he said.", "Vos added: \"There was a study done by WPRI that showed that Wisconsin has a higher no-show rate than other states. We’re one of only two or four states that doesn’t have bail bonds right now.\"", "With Vos and his Republican colleagues in charge of the Legislature, their move to include a private bail measure in the state budget made its enactment a strong possibility. As it stands, only Wisconsin, Illinois, Oregon and Kentucky bar private bail.", "Gov. Scott Walker vetoed a broader provision in 2011, but Vos has narrowed the plan this time to a five-county experiment (Dane, Kenosha, Milwaukee, Racine and Waukesha) of the type Walker signalled he could support.", "Under the proposed system, defendants would pay a bail agent 10 percent of the full bail amount. The company must pay 3 percent of the bail amount to the court. If the defendant fails to appear in court, the bonding company is liable for the full amount.", "But a bail agent usually has an opportunity to recover a no-show defendant -- often using bounty hunters.", "Bail companies say their work needs no taxpayer funding and enhances public safety by lowering the number of no-shows. Critics say it’s an unfair monetary burden on lower-income people and that elected judges should have primary say over who is held or walks free before trial.", "With that in mind, we wondered if Vos was on the mark claiming a study shows that Wisconsin court defendants fail to appear more often than in other states.", "Digging deeper", "Vos cited a March 2013 report (\"Should Wisconsin Allow Commercial Bail in Pretrial Release?) by the Wisconsin Policy Research Institute (WPRI), a conservative think-tank based in Hartland.", "For the report, which reviewed various studies on bail, the group hired Kate Lind, a Madison lawyer who is Walker’s campaign treasurer and was controller for the state Republican Party. She runs a political consulting firm that helps Republicans comply with campaign finance laws. Lind did an earlier study for WPRI on probation and parole.", "Her report concluded that bringing private bail back to Wisconsin, if integrated with pretrial assessments and services, would create a \"valuable option to prevent failure to appear while protecting the financial and public safety interests of Wisconsin.\"", "We read Lind’s report and found no state-by-state comparisons of no-show rates, and no data for Wisconsin’s statewide no-show rate.", "Lind confirmed she never found any statistics showing that Wisconsin lags behind other states and that it’s probably impossible to do such a comparison due to the lack of data here and elsewhere. Criminal courts typically are county-based, so statewide figures are elusive.", "Vos spokeswoman Kit Beyer agreed the study does not make the case on Wisconsin versus other states.", "Beyer said Vos believes you can infer a disadvantage for Wisconsin because government and academic studies of data from large U.S. counties (including Milwaukee County) have found a lower no-show rate on private bail bonds than on personal-recognizance bonds or most other forms of non-financial release.", "Those studies have limitations but do show that disparity, as we reported in rating False a claim by Democratic state Sen. Lena Taylor of Milwaukee that \"no statistical evidence\" exists that bail bonds increase the likelihood that defendants appear for scheduled hearings.", "Most significantly for evaluating Vos’ claim, those studies are not statewide and rely on data from 1998 and earlier in Milwaukee County, where judges say a 2012 internal study found their felony no-show rate is 16 percent. That is below the national average for large counties cited in various studies.", "Milwaukee County uses a system of methodically assessing criminal defendants’ risk of flight, and judges there say that would protect public safety better than a commercial bail system.", "Our rating", "Vos said a study of private bail bond systems \"showed that Wisconsin has a higher no-show rate than other states\" of defendants skipping court appearances.", "The study doesn’t compare states, and doesn’t include a Wisconsin figure. And while various studies of local municipalities show lower no-show rates for private bail and therefore suggest the same advantage would hold for Wisconsin, Vos spoke as if the question is settled.", "We rate his claim False.", "Milwaukee Courier, \"Legislatively Speaking -- Sausage Making,\" op-ed by Senator Lena Taylor, June 7, 2013", "Interview with Kit Beyer, spokeswoman, Speaker Robin Vos, June 17, 2013", "Email exchange with Eric Peterson, chief of staff, State Sen. Lena Taylor, June 11, 2013", "Email exchange with Alex Tabarrok, Bartley J. Madden Chair in Economics at the Mercatus Center, June 13-17, 2013", "Department of Economics, June 14, 2013", "Email exchange with Brian Reaves, US Bureau of Justice Statistics statistician, June 14, 2013", "Interview and email exchange, Cherise Fanno Burdeen, chief operating officer, Pretrial Justice Institute, June 12-17, 2013", "Interview with Milwaukee County Chief Judge Jeffrey Kremers, June 12, 2013", "Interview with State Rep. Fred Kessler, June 12, 2013", "Milwaukee Journal Sentinel, \"Republican lawmakers may try to resurrect bail bonding,\" May 18, 2013", "Milwaukee Journal Sentinel, \"Bail bondsmen, Lake Michigan among special interest items in budget plan,\" June 5, 2013.", "U.S. Bureau of Justice Statistics, \"State Court Processing Statistics Data Limitations,\" March 2010", "U.S. Bureau of Justice Statistics, \"Pretrial release of felony defendants in state court, 1990-2004,\" November 2007", "U.S. Bureau of Justice Statistics, \"Felony Defendants in Large Urban Counties, 2006,\"  May 2010", "U.S. Bureau of Justice Statistics, \"Commercial Surety Bail and the Problem of Missed Court Appearances and Pretrial Detention,\" Thomas H. Cohen, June 2008", "Journal of Law and Economics, \"The Fugitive: Evidence on Public Versus Private Law Enforcement From Bail Jumping,\"  April 2004", "AIA, \"Taxpayer Funded Pretrial Release: A Failed System,\" undated", "Wisconsin Policy Research Institute, \"Should Wisconsin Allow Commercial Bail in Pretrial Release?\"  March 2013", "Pretrial Justice Institute, \"Responses to Claims About Money Bail for Criminal Justice Decision-Makers,\"  August 2010", "Pretrial Justice Institute, \"Dispelling the Myths: What Policy Makes Need to Know About Pretrial Research,\"  November 2012", "Legislative Fiscal Bureau, summary of bail bond licensing provision in state budget (starts p. 588), 2013", "Interview with State Rep. Robin Vos (R-Rochester), Journal Editorial Board, June 10, 2013", "Interview with George Lightbourn, president, Wisconsin Policy Research Institute", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]