["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tom Hanks’ name does not appear on the flight logs and there is no other evidence to indicate he flew on Epstein’s plane.", "When federal prosecutors went after disgraced financier Jeffrey Epstein for running a sex-trafficking ring before he died in jail, stories about his social circle took off — especially when some well-known names appeared on the flight logs of his private Boeing 727.", "But this information has been a catalyst for false rumors about other public figures and celebrities, with posts wrongly placing them on the private plane without any evidence.", "Now, that target is actor Tom Hanks.", "RELATED: Another Tom Hanks hoax about unfounded criminal allegations", "Social media posts, like this one on Facebook, claim that Hanks’ name can be found in Epstein’s flight logs.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s not true. Neither Hanks’ name nor his initials appear in the flight log documents.", "Epstein used the plane to entertain guests and transport young women to his Caribbean Island, Little Saint James.", "The flight logs, which became public through civil lawsuits by women who said they were sexually abused by Epstein, were handwritten by his pilots. The logs can be found online in a few places, and Business Insider compiled a searchable database for subscribers of every known flight made by his private planes. There are certainly some noteworthy names, such as Naomi Campbell and President Bill Clinton (who issued a statement about the plane rides shortly after Epstein’s arrest), but Hanks’ name is not there.", "Other fake lists of alleged passengers have included President Barack Obama, former Vice President Joe Biden, former U.S. Sen. Hillary Clinton, the late U.S. Sen. John McCain, Canadian Prime Minister Justin Trudeau and even Pope Francis, to name a few.", "As for this claim, we rate it Pants on Fire.", "Facebook post, July 27, 2020", "New York Times, Jeffrey Epstein’s Pilots Are Subpoenaed in Sex Trafficking Case, July 26, 2019", "Wall Street Journal, Jeffrey Epstein’s Pilots Are Subpoenaed in Sex-Trafficking Investigation, July 26, 2019", "PolitiFact, No, the names of CNN anchors were not on the Epstein flight logs, July 29, 2019", "Scribd, Epstein Flight Logs, accessed July 29, 2020", "Reuters, Fact check: Tom Hanks is not recorded in Jeffrey Epstein’s flight logs, July 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]