["About this rating", "Facebook has begun rolling out a 'shake-to-report' feature in their mobile app.", "The feature does not collect reports about abusive posts or other terms-of-service violations and cannot accidentally trigger account suspensions.", "Did you know Facebook's mobile app has a new feature that allows users to report problems by shaking their phones?", "No? Neither did we, until readers alerted us to a viral Facebook post claiming that a new \"shake-to-report\" feature was inadvertently landing some people in \"Facebook jail\" (meaning their accounts had been suspended). Warnings such as this one started to appear online in mid-June 2019:", "Here's the text of the post, minus emojis:", "PSA\nFACEBOOK NEEDS TO STOP\nAVOID FB JAIL", "I shook my phone and it's a REAL thing! It took me a little bit, but it really is a thing! I turned mine off!", "Your public service announcement for today:", "The recent FB update added this new feature for mobile fb users. Since this update - some people have landed in FB jail multiple times (yes, it’s a real place and there’s no fair trial or bail out options!) One has been in & out for over a week now It seems many of us are accidentally ‘reporting a problem’ and getting our friends thrown in jail.", "How can you fix it?", "When you’re in FB, shake your phone around until this shows up. Then slide that ‘shake phone to report a problem’ button to OFF!", "It’s CRAZY that none of us knew this had been added and that it was automatically ON with the update.", "Fix your phones - Let’s keep our friends (and me lol) out of FB jail!", "This is no joke shake your phone! Not fast or hard. I just removed mine.", "With little-to-no fanfare, Facebook began rolling out a new \"shake-to-report\" feature in their mobile app in late May 2019. The tech news website Engadget described the rollout on 28 May:", "Facebook wants to make reporting bugs as easy as shaking your phone. In fact, that's all you'll have to do. Thanks to a new feature, when you encounter a bug, you can simply shake your phone and file a report through a pop-up menu that will appear on the screen.", "The \"shake to report\" method was previously available as an opt-in feature on iOS, and it will soon be a default setting on both iOS and Android. You'll still be able to report bugs through Facebook's Help & Support menu, but the company says it's hoping this new method will be easier to use. In addition to reporting when News Feed doesn't load or a video won't play, Facebook also wants users to report when they can't figure out how to complete an action, like how to delete a story. Facebook is rolling this out to a small percentage of users globally, but within the next two weeks, it should be available to everyone.", "Facebook confirmed all this in an email to Snopes.com, including that \"shake to report\" is enabled by default. The easiest way to find out if you have it is to run the Facebook app, then give your phone a gentle shake. A pop-up screen should appear giving you the option of reporting a problem or disabling the shake-to-report feature altogether:", "(You can access the same screen via the main Facebook app menu, under Help & Support > Report a Problem.)", "There are two more things to notice about the screen \"Shake phone to report a problem\":", "First, it doesn't automatically send a report to Facebook. It provides a link to a report form requiring the user to explain the problem. That means a report can't be sent accidentally.", "Second, it clearly says that the shake-to-report feature is to report \"something isn't working,\" not to report abusive posts or other terms-of-service violations. Note that a link is offered at the bottom to call up instructions for reporting abuse (see Facebook's help page for those instructions). That means you can't use the shake-to-report feature for issues other than technical ones.", "In summary, is the \"shake-to-report\" feature real? Yes, and if it has been rolled out to your app, it's automatically enabled. You can disable it (if you wish to) by shaking your phone to call up the screen and turning it off, or by doing the same via the app's Help & Support menu. Is it possible to inadvertently send reports or suspend someone's account by using the feature? No, that's not how it works. You might want to share this information with friends who are spreading the rumor.", "Fisher, Christine.   \"Facebook Makes Reporting Bugs as Easy as Shaking Your Phone.\"\r\n    Engadget.   28 May 2019.", "Facebook.com.   \"How Do I Report Inappropriate or Abusive Things on Facebook (example: nudity, hate speech, threats)?\"\r\n    Accessed 14 June 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]