["About this rating", "On Sept. 30, 2019, the Snickersee website published an article positing that the population of dolphins in Lake Michigan was on the rise.", "Lake Michigan Dolphin Population On The Rise", "The Freshwater Bottlenose Dolphin is making a comeback in the Great Lakes. The species was listed as endangered in the 1960s as a result of over fishing. Sightings of the rare dolphins are on the rise, and scientists say that the population is nearing 2000 dolphins.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Our platform strives to create articles that are original, and entertaining. Snickersee has a goal of providing an audience experience that provides an escape from life through satire even for a brief moment in time, while at the same time fostering engagement.", "This Snickersee article follows in a long tradition of rumors about whales, sharks, and other ocean animals inhabiting the fresh water Great Lakes. In May 2017, for instance, we encountered a fake photograph of a large whale swimming beneath the Mackinac Bridge, which stretches between the upper and lower peninsulas of Michigan across the Straits of Mackinac. In October 2015, a genuine photograph of a shark caught off the coast of Florida was recaptioned and shared as if the large ocean predator was found off the shores of Muskegon, Michigan.", "But this bit of local (and fictional) lore can be traced back to at least 1985, when a group of people set out on the first annual Great Lakes Whale Watch. No whales were seen during this tour and the event was largely meant to raise awareness about the plight of whales (and the oceans in general), not to spot a whale in Lake Michigan.", "Lastly, it should be noted that the photograph used in the Snickersee article which supposedly shows two dolphins jumping out of Lake Michigan in front of Navy Pier is a fake. Here's a comparison between the doctored image (left) and the original photograph (right):", "According to the Minnesota Sea Grant, \"there are no whales, no dolphins or sharks, and no squid in the Great Lakes.\"", "For background, here is why we sometimes write about satire/humor.", "Snickersee.com.   \"Lake Michigan Dolphin Population On The Rise.\"\r\n    30 September 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]