["The photo was published in this Facebook post on September 17, 2020.", "The post’s Hindi-language caption translates to English as: “I am your father in relation, but I am your slave. An old photo of Amitabh Bachchan with Dawood Ibrahim has been released now. This is why Jaya Bachchan was furious over talks of his drugs-connection. Shame on Amitabh Bachchan.”", "Amitabh Bachchan is a senior Bollywood actor and “I am your father in relation” is a well-known line from one of his Hindi movies.", "Amitabh’s wife Jaya Bachchan is a former Bollywood actress and now lawmaker.", "Dawood Ibrahim is one of India’s most wanted fugitives. He is accused of running major organised crime operations and supporting terrorist acts, including the 1993 serial bomb blasts in Mumbai.", "The photo was also shared alongside a similar claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claim, however, is false.", "Keyword searches found the photo was published in several Indian media reports about Bachchan meeting former Maharashtra Chief Minister Ashok Chavan. It was published by Mumbai-based English-language newspapers Economic Times here on March 25 and here by The Indian Express on March 29, 2010.", "Below is an image comparison of the photo in the misleading post (L) and the photo in the Economic Times report (R):", "A reverse image search on Google also found this video report by Mumbai-based English language newspaper The Times of India. The report is about Bachchan attending the inauguration ceremony for the Banda-Worli Sea Link between west and south Mumbai on March 24, 2010, where he met Chavan.", "Bachchan and Chavan, pictured sitting together, can be seen wearing the same outfits as seen in the misleading posts. Below is a screenshot of the video report with the two men highlighted in green by AFP:", "In response to the misleading posts, Bachchan's son Abhishek Bachchan, also a Bollywood actor, said in a tweet on September 18, 2020 that the image shows his father with Ashok Chavan.", "“Brother, this photo shows my father and former Maharashtra Chief Minister Ashok Chavan,” says the tweet in Hindi, in response to another user’s tweet which has since been deleted.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]