["About this rating", "On 10 September 2017, \"satirical\" web site Last Line of Defense published an entirely fabricated story appearing to report that the daughter of United States Senator \"James Montgomery\" had been charged with a series of murders:", "Anne Marie Scott, Daughter of Democrat US Senator James Montgomery of Delaware, has been charged with 14 counts of first-degree murder by the Delaware District Attorney for Wilmingshire. The victims, all black men in their early 20s, were torn limb from limb and fed to Scott’s impressive collection of deadly reptiles.", "There is no senator named James Montgomery, no serial killer named Anne Marie Scott, and the entire article — including quotes supposedly from Scott's attorney — is a fabrication.", "The article also refers to \"Wilmingshire\", a fictional location presumably inspired by the real Delaware city of Wilmington. The photograph used in the story actually shows Jenessa Rosenbach, a Colorado woman sentenced to 16 years in prison in May 2016 for slashing the throat of a man she had met through Craigslist.", "Furthermore, the Delaware Supreme Court ruled in August 2016 that the state's death penalty law is unconstitutional and suspended the practice, meaning it would be impossible for the state's Attorney General to \"seek the death penalty\", as is claimed in the article, in September 2017.", "Like everything published by the Last Line of Defense, the story is entirely false. The web site describes itself as a \"satirical publication\" in a disclaimer on its site:", "America's Last Line of Defense is a satirical publication that may sometimes appear to be telling the truth. We assure you that’s not the case. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "Pohl, Jason.  \"Woman Gets Prison Time for Craigslist Throat Slashing.\"\r\n  Coloradoan.  6 May 2016.", "Masulli Reyes, Jessica.  \"Top Court: Delaware's Death Penalty Law Unconstitutional.\"\r\n  Delaware Online.  2 August 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]