["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican presidential candidate speaks to voters at a campaign stop in Bedford, N.H., on Sept. 30, 2015. (AP photo)", "Republican presidential candidate Jeb Bush said in his recently released energy plan that the United States should take advantage of its resurgent status as \"a global energy superpower.\"", "Thanks to new means of extracting oil such as hydraulic fracturing and horizontal drilling, there’s been an unprecedented spike in domestic oil production, the former Florida governor said.", "\"Since 2008, U.S. crude oil output has increased by over 80 percent, an increase of over 4 million barrels a day. That is the fastest increase in U.S. history,\" his plan read.", "Has oil production really seen the fastest increase in the nation’s history, topping 80 percent or higher since 2008? It sure has, reversing a decline that began back in 1986.", "We went to the U.S. Energy Information Administration, which keeps monthly and annual statistics for crude oil production. They said that in 2008, the United States produced 5 million barrels per day, a figure that has jumped to more than 9 million per day in 2015. A Bush spokeswoman confirmed to us that was the same data they were using when drawing up the energy plan.", "As you can see, that’s a pretty steep spike in production over a seven-year period:", "The change is largely because of the reasons Bush gave, according to EIA spokesman Jonathan Cogan. Better technology like fracking and horizontal drilling, which makes extraction from geological formations like layers of shale easier, has led to an overall increase in output. Relatively high oil prices (about $140 per barrel in 2008, as opposed to less than $50 recently) also helped lead to the ramp-up in production.", "You may recall that gas prices reached a single-day high in 2008, with a gallon costing $4.11 that July. The highest-ever nationwide annual average of $3.60 per gallon was in 2012.", "Mark Perry, a University of Michigan-Flint economics professor working with the conservative American Enterprise Institute, agreed that Bush’s take is accurate. He said based on EIA numbers through July, U.S. crude production has gone up 83 percent since 2008. That bumps up to 88 percent if you measure the current 2015 average of almost 9.4 million barrels per day.", "(We will note that 2008 includes a storm-related drop in September, when hurricanes Ike and Gustav churned through the Gulf of Mexico and production dropped to less than 4 million barrels per day.)", "\"It’s pretty clear that the production increase from 2008-15 ... has been the largest production increase ever in U.S. history in such a short period of time,\" he said via email.", "From 2009 to 2014, the increase in oil production didn’t bring the price drop economists expected, Perry said. Now that oil prices have dropped so much recently, we’re just starting to see production back off. The latest EIA data showed production has dropped 144,000 barrels per day since July, with estimates saying it’s going to continue to decrease.", "\"It took a while for the price to finally catch up to the increased U.S. production, and now we’re in an adjustment period,\" Perry said. He said the slowdown was temporary and \"will likely be followed by another period of increased production in a year or two when oil prices go back up above $50 and stay there.\"", "Our ruling", "Bush said, \"Since 2008, U.S. crude oil output has increased by over 80 percent, an increase of over 4 million barrels a day. That is the fastest increase in U.S. history.\"", "That’s accurate, as high prices and new extraction methods have led to a significant increase in the amount of crude oil the country produces. Depending on how you calculate it, production has gone up 83 percent through July, or 88 percent if you use the current 2015 average. Production is currently dipping downward, but it’s easily the fastest increase in a seven-year span in U.S. history.", "We rate Bush’s statement True.", "Jeb Bush, \"Energy Plan,\" Sept. 29, 2015", "Wilkes University Institute for Energy and Environmental Research, \"What is horizonal drilling, and how does it differ from vertical drilling?,\" Jan. 14, 2011", "CNN, \"Gas prices hit highest average ever in 2012,\" Dec. 31, 2012", "Wall Street Journal, \"U.S. Oil-Production Rise Is Fastest Ever,\" Jan. 18, 2013", "BBC, \"What is fracking and why is it controversial?,\" June 27, 2013", "American Enterprise Institute, \"Energy milestone: Largest increase in US oil output last year since beginning of commercial crude oil production in 1859,\" Jan. 9, 2014", "Forbes, \"Ongoing Oil Market Turmoil Isn't a 'Crude' Sequel to 2008,\" Nov. 5, 2014", "AAA Daily Fuel Gauge Report, \"Americans Saved $14 Billion on Gasoline this Year Compared to 2013,\" Dec. 31, 2014", "Forbes, \"U.S. Oil Production Forecasts Continue to Increase,\" May 7, 2015", "U.S. Energy Information Administration, \"Short-Term Energy Outlook,\" Sept. 9, 2015", "MarketWatch, \"Oil pulls back as traders weigh demand prospects,\" Oct. 1, 2015", "U.S. Energy Information Administration, U.S. Field Production of Crude Oil annual data, accessed Sept. 30, 2015", "U.S. Energy Information Administration, U.S. Field Production of Crude Oil monthly data, accessed Sept. 30, 2015", "U.S. Energy Information Administration, \"U.S. Petroleum Balance Sheet, Week Ending 9/25/2015,\" accessed Sept. 30, 2015", "U.S. Energy Information Administration, \"Crude Oil Production,\" accessed Sept. 30, 2015", "Interview with Jonathan Cogan, U.S. Energy Information Administration spokesman, Sept. 30, 2015", "Interview with Mark Perry, University of Michigan-Flint economics professor and American Enterprise Institute scholar, Sept. 30, 2015", "Interview with Allie Brandenburger, Bush spokeswoman, Oct. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]