["About this rating", "In January 2016, a fake quote started circulating online, purportedly uttered by Republican presidential candidate Donald Trump about how he would deport Muslims, Mexicans, and Nigerians if he won the presidency:", "American Billionaire and Republican Presidential Front-runner, Donald Trump, has shot a subtle warning to the Nigerian Community in the United States, after he said all Nigerians would be made to leave the country “when he becomes President”. He made the “threat” during a rally at Wichita, Kansas.", "According to Donald Trump, Nigerians ad Mexicans have taken all the jobs meant for honest hard working Americans.", "“To Make America great again, we need to get rid of the Muslims, Mexicans and the Africans, especially the Nigerians. They take all our jobs, jobs meant for honest hard working Americans, and when we don’t give them the jobs, the Muslims blow us up”, Trump said.", "“We need to get the Africans out. Not the blacks, the Africans. Especially the Nigerians. They’re everywhere. I went for a rally in Alaska and met just one African in the entire state. Where was he from? Nigeria! He’s in Alaska taking our jobs. They’re in Houston taking our jobs. Why can’t they stay in their own country? Why? I’ll tell you why. Because they are corrupt.\"", "The above-displayed quote appeared on several disreputable web sites in mid-January 2016, but it was originally published by \"FNN\" on the web site Payges. While Payges does not include a disclaimer labeling this article as a work of fiction, a discussion on the Nairaland Forum revealed that FNN stood for \"Fake Nigeria News.\"", "Additionally, Trump did not have a rally in Wichita, Kansas, as alleged by the above-quoted article, at any point in January 2016. The quote has also not been recorded by any major publications at any point.", "In sum, this is nothing more than yet another fictional quote falsely attributed to a politician.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]