["At the start of September, President Donald Trump took to Twitter to express outrage over speculations that he had \"suffered a series of mini-strokes.\"", "\"Never happened to THIS candidate - FAKE NEWS,\" Trump wrote.", "Now, posts on Facebook have suggested that it's actually his opponent, former Vice President Joe Biden, who has suffered from strokes.", "One user posted a quote, attributed to Jill Biden, about her husband's health: \"I can’t believe people are so mean to make fun of Joe when he gets lost for words, don’t they know he has had 3 STROKES?”", "The user behind the post did not respond to a request from USA TODAY for comment.", "More:Fact check: Claim that Jill Biden will require Americans to learn Spanish began as satire", "The quote in the viral post is fake. There are no reports of Jill Biden making this statement or stating that her husband has experienced strokes.", "She last spoke about her husband's health on Aug. 19.", "On NBC's \"Today Show,\" Jill Biden called attacks on his cognitive abilities \"ridiculous.\"", "\"He doesn't stop from 9 in the morning until 11 at night, so that's ridiculous,\" she said.", "On ABC's \"Good Morning America,\" she said Joe Biden is \"totally engaged.\"", "\"I see Joe every single day and he's writing speeches, he's being briefed, he's making phone calls, he's on the Zoom constantly, he's doing fundraisers,\" she added.", "It is true that Joe Biden has experienced two life-threatening brain aneurysms — but they occurred in 1988, per The Delaware News-Journal.", "The last report from his doctor, Kevin O'Connor, in December 2019, declared that Biden is \"a healthy, vigorous, 77-year-old male, who is fit to successfully execute the duties of the Presidency.\"", "Based on our research, the claim that Jill Biden said her husband, former Vice President Joe Biden, had \"three strokes\" is FALSE. There are no reports of that quote, and Jill Biden said in August that attacks on her husband's cognitive abilities are \"ridiculous.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]