["About this rating", "A Muslim-led collective of religious groups protested against Rihanna's visit to Senegal in February 2018, on the grounds that she was a member of the freemasons and Illuminati.", "Rihanna was not actually banned from Senegal, and the country's president joined her at an NGO event.", "Superstars like Jay-Z, Beyoncé and Katy Perry are the common targets of conspiracy theorists who claim the stars are either secret Satanists or part of the Illuminati — a shadowy, elite (and non-existent) cabal of ultra-wealthy celebrities, bankers and politicians who secretly rule the world.", "So when YourNewsWire.com — a well-known purveyor of fake news and conspiracy theories — reported in February 2018 that Rihanna had been banned from entering Senegal \"because she's 'Illuminati,'\" you could be forgiven for dismissing the story out of hand.", "For once, however, there is something to these claims about dissent against Rihanna's visit to the West African nation. Activists did protest against the singer's appearance at an event in Senegal and did accuse Rihanna of being part of the Illuminati, but the government did not ban her from entering the country and she did ultimately visit.", "\"Protestors have violently blocked Rihanna from entering the West African nation of Senegal,\" YourNewsWire.com wrote, \"because of her 'affiliation with the Illuminati,' according to reports.\"", "The protests turned “violent“, according to local reports, as protestors claimed Rihanna has aligned herself with the Illuminati, a shadowy group of global elites working to establish a New World Order.", "The protestors are backed by politicians and religious leaders in the country who have also been working to block Rihanna’s visit to Senegal, claiming that she flaunts her membership of the Illuminati.", "The post cites a 1 February report by the Paris-based Jeune Afrique (which translates to \"Young Africa\") news web site. That article reads:", "Expected in Senegal on Friday, the singer is not welcome in the eyes of around 30 religious organizations united under the collective name \"No to freemasonry and homosexuality.\" Some members suspect her of being a member of the freemasons.", "The article was published a day before Rihanna's visit to Senegal in early February where she joined other global dignitaries, including French President Emmanuel Macron, at an event promoting education in developing countries. She was due to attend in her capacity as an ambassador for the Global Partnership for Education, a Washington, DC-based group that supports basic schooling in 65 nations.", "According to Jeune Afrique, the protest against Rihanna's visit was prompted, in part, by a YouTube video posted last week which outlined a conspiracy theory around claiming Rihanna's visit to the country \"was orchestrated with the complicity of the government, in order to roll out an educational regime that aims to create future generations of loyal disciples of Satan.\"", "\"Rihanna doesn't hide it,\" said Cheikh Oumar Diagne, a spokesperson for the collective, \"she is part of the Illuminati, which is a branch of the freemasons.\"", "He adds:", "In fact, her visit oddly coincides with the originally scheduled date of the [association of African freemasonry lodges.] From our point of view, this is an attempt at a distraction to hide this freemason meeting from the public.", "The meeting of African freemasons was due to take place between 2 and 3 February in the Senegalese capital of Dakar, but was cancelled after opposition from the same religious collective forced a local hotel to pull out as the venue.", "In the end, Rihanna's visit to Senegal went ahead, and she appeared at the conference with French President Emmanuel Macron, as well as Senegal's president Macky Sall, and gave a short address to the audience.", "Today’s @GPforEducation Replenishment Conference in Dakar, Senegal raised over $2.3B for global education!?✏️? @rihanna @GlblCtzn #FundEducation #CLF pic.twitter.com/FjBMvGHdPJ", "— Clara Lionel Fdn (@ClaraLionelFdn) February 2, 2018", "While the YourNewsWire.com article contains a rare kernel of truth and accurately cites articles by reputable news organizations like Jeune Afrique and The Guardian, it also indulges in its customary touting of conspiracy theories, falsely claiming that Rihanna describes herself as an \"Illuminati Princess\" and that she had been \"caught instructing children to pray to Satan.\"", "Furthermore, the article falsely claimed that the singer had been barred from entering Senegal. Rihanna appears to have been given a warm welcome by the country's government.", "Liffran, Olivier.  \"Sénégal: Rihanna Déclarée 'Personal Non Grata' par des Associations Religieuses.\"\r\n  Jeune Afrique.  1 February 2018.", "Ardehali, Rod; Moore, Charlie.  \"Work Work Work! Rihanna Smartens Up in a Checked Power Suit as She Meets French President Emmanuel Macron to Campaign for Improved Education in Senegal.\"\r\n  Daily Mail.  2 February 2018.", "Maclean, Ruth.  \"Rihanna Not Welcome in Senegal, Religious Groups Say.\"\r\n  The Guardian.  1 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]