["A recent Facebook post takes nepotism in politics to a new level.", "\"PARENTS,\" it reads above photos of Nazi leader Adolf Hitler, Cuban revolutionary and former prime minister of Cuba FIdel Castro, and Aleister Crowley, a British occultist.", "Beneath these photos are three more with arrows connecting them to suggest that Hitler is the father of German Chancellor Angela Merkel, Castro is the father of Canadian Prime Minister Justin Trudeau, and Crowley is the father of the late, former First Lady Barbara Bush.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s take these supposed family units one by one.", "Hitler officially died childless, though a man named Jean-Marie Loret maintained until he died that he was the only son of the German dictator. Merkel, meanwhile, was born in Hamburg, West Germany, in 1954 to Horst Kasner, a Lutheran minister. Her mother, Herlind Kasner, was an English teacher.", "Like his son Justin Trudeau’s father, Pierre Trudeau, was once the Canadian prime minister. Trudeau’s mother, Margaret Trudeau, was an activist and she once visited Cuba and met Castro, but that was several years after Justin Trudeau was born. There’s a conspiracy theory that Justin Trudeau is the product of an alleged affair between his mother and Castro but both Snopes and the Associated Press have debunked it.", "It is believed that Castro had 11 children, but the Canadian prime minister was not one of them.", "Barbara Bush, mother to George W. and Jeb, was born in 1925 to Pauline and Marvin Pierce. Her father was the president of McCall Corporation.", "The claims about her and the other public figures in this post are ridiculous. We rate it Pants on Fire.", "Facebook post, Aug. 3, 2020", "Britannica, Aleister Crowley, visited Aug. 6, 2020", "ABC News, Did Hitler have a secret son? Evidence supports alleged son’s claims, Feb. 21, 2015", "CNN, In photos: The life and career of Angela Merkel, July 10, 2019", "Time, 9 things to know about Justin Trudeau’s parents, Oct. 20, 2015", "Snopes, Is Justin Trudeau Fidel Castro’s love child?, Nov. 30, 2016", "The Associated Press, No, Fidel Castro is not Canada PM Trudeau’s father, Feb. 17, 2018", "The Washington Post, Where are the Castro kids? The next generation of the Cuban dynasty lies low, April 20, 2018", "The White House, Barbara Pierce Bush, visited Aug. 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]