["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this July 19, 2018 photo, President Donald Trump speaks before signing an Executive Order that establishes a National Council for the American Worker during a ceremony in the East Room of the White House in Washington. (AP Photo/Andrew Harnik, File)", "President Donald Trump has recently faced criticism for his decision to authorize $12 billion in programs to assist farmers hurt by tariffs.", "One critic of that decision was The Other 98% in a Facebook post.", "The graphic in the post reads: \"Trump just gave a $12 billion bailout to farmers hurt by his failed tariffs. This will cost every household in the U.S. $95. And by the way, Trump is borrowing the money from China since his tax cuts blew a trillion dollar hole in the deficit. Does this feel like winning yet?\"", "The post has generated a lot of discussion on Facebook — more than 43,000 reactions and 126,000 shares — so we decided to fact-check it.", "It turns out that the post distorts information about how the aid package is being funded.", "Let’s break down each claim in the graphic, one by one.", "\"$12 billion bailout\"", "It’s true that U.S. Department of Agriculture did recently \"authorize up to $12 billion in programs,\" according to a recent press release.", "That money is meant to help farmers who were hurt as a result of China increasing its tariffs in retaliation to Trump’s increase in tariffs on Chinese goods.", "However, one expert we reached out to took issue with the emergency aid package being dubbed a \"bailout.\"", "\"I would not use the term ‘bailout’ … since the term connotes the recipients will be compensated for actions they took,\" said Steve Suppan, a senior policy analyst at the Institute for Agriculture and Trade Policy.", "In the past, we’ve referred to monetary aid packages to Wall Street entities and the auto industry as \"bailouts.\" That’s because those companies were being compensated for risky mistakes they made.", "But unlike those Wall Street workers and automobile companies, \"farmers did not initiate the U.S. tariffs that triggered the Chinese and other tariffs,\" Suppan said.", "\"This will cost every household in the U.S. $95\"", "In tackling this claim, we began with a bit of math.", "Trump’s relief package authorizes up to $12 billion of aid. Divided by the 126 million U.S. households (as reported by the market and consumer data website Statista.com), that works out to roughly $95 per household.", "So from a very simple standpoint, the math checks out.", "But the experts we talked to agreed that the $95-per-household figure has its limits, and won’t affect every taxpayer the same.", "\"The $12 billion must either come from reduced government spending, higher taxes or increased debt,\" said Aaron Smith, a professor of agricultural and resource economics at the University of California, Davis. \"Increased debt suggests that future households will pay for it in the form of higher taxes, reduced spending or higher inflation. Households pay tax at different rates and they would be affected differently by … what, if any, reductions in spending occurred.\"", "Brian Wright, a professor of agricultural economics at University of California, Berkeley, agreed that the monetary burden is likely to be distributed unevenly.", "He told us it will probably \"fall more on the younger part of the population (since they) will have to deal with the deficit for some time.\"", "\"Trump is borrowing the money from China\"", "From there, the post gets more interesting. Would the package spurred by Chinese retaliatory tariffs be financed by money borrowed from China?", "The USDA press release specified that the authority required to administer and fund the aid package comes from a piece of legislation known as the Community Credit Corporation Charter Act.", "The Community Credit Corporation has the authority to borrow up to $30 billion from the U.S. Treasury for this purpose, an amount that more than covers the $12 billion aid package.", "The Facebook group may have been referring to the fact that China holds the most Treasury securities of any foreign country.", "Treasury securities can be purchased by both individuals and other entities, like foreign governments. When someone purchases a Treasury bond or a note, they’re agreeing to hand over their money to the federal government in return for being handed back that same amount at a later date. In between their initial purchase of the bond or note, the purchaser is paid interest at a predetermined rate.", "Because these debt obligations are backed by the U.S. government, many foreign countries purchase a large amount of Treasury securities, since they’re relatively safe investments.", "China, in particular, buys them in order to depreciate its own currency and make its exports cheaper.", "But it’s inaccurate to suggest the aid package is financed specifically by Chinese purchases of Treasury securities.", "That’s because the revenues generated from bond sales \"go into the general fund that finances all U.S. government activity,\" said Suppan, the trade policy analyst.", "Meanwhile, there’s another logical flaw to consider.", "\"It can't be that current households will pay for this bailout and the money will come from increased borrowing from China,\" Smith of UC-Davis said. \"It must be one or the other.\"", "Trump’s \"tax cuts blew a trillion dollar hole in the deficit\"", "After looking at the Congressional Budget Office’s records of the federal deficit by year, we found this claim to be inaccurate.", "The last time the federal deficit exceeded one trillion was in 2012, when it was $1.087 trillion.", "The CBO projects that the 2018 deficit will be $804 billion. That’s a step up from 2017’s deficit, which was $665.4 billion.", "In saying that Trump’s tax cut legislation \"blew a trillion dollar hole in the deficit,\" it’s likely that The Other 98% was referring to a report released by the CBO after the legislation was passed that projected the deficit would rise to over $1 trillion by 2020.", "But that hasn’t happened yet, so the post is imprecise in using the past tense when saying that the tax cuts \"blew\" a \"hole in the deficit.\"", "The Other 98% did not respond to a request for comment.", "Our ruling", "A recent Facebook post calls Trump’s recent announcement of an emergency aid package to farmers a \"bailout.\" It also claims that the package will cost each household $95, and Trump borrowed money to finance it from China because his tax cuts left a trillion dollar hole in the deficit.", "The USDA did recently announce a $12 billion aid package for farmers, but some would consider the labeling of it as a \"bailout\" to be misleading since farmers were not responsible for the tariffs and other factors that led to the aid package being necessary.", "It’s also not fair to declare that the package would cost each household $95, since different households pay taxes at different rates.", "In addition, the government isn’t directly borrowing the money to finance the aid package from China. They’re borrowing the money from the U.S. Treasury. China buys and owns Treasury securities, but those securities have a very remote connection to the aid package.", "Lastly, the federal deficit hasn’t been over $1 trillion since 2012. The CBO doesn’t project it to be over $1 trillion until 2020.", "We rate the claims in the post Mostly False.", "The Other 98%, Facebook post, July 24, 2018", "US Department of Agriculture, \"USDA Assists Farmers Impacted by Unjustified Retaliation,\" July 24, 2018", "CBS News, \"Trump administration announces $12 billion \"bailout\" for farmers hit by tariffs,\" July 24, 2018", "The New York Times, \"How the Trump Tax Cut Is Helping to Push the Federal Deficit to $1 Trillion,\" July 25, 2018", "The New York Times, \"To Ease Pain of Trump’s Trade War: $12 Billion in Aid for Farmers,\" July 24, 2018", "Politico, \"Trump to offer farmers $12B in trade aid,\" July 24, 2018", "Email exchange with Steve Suppan, senior policy analyst, Institute for Agriculture and Trade Policy, July 26, 2018", "Email exchange with Joseph Glauber, senior research fellow, International Food Policy Research Institute, July 26, 2018", "Email exchange with Aaron Smith, professor, agricultural and resource economics, UC Davis, July 26, 2018", "Email exchange with Wallace Tyner, Jamie & Lois Ackerman Professor, agricultural economics, Purdue University, July 26, 2018", "Email exchange with Chad Hart, associate professor of economics, University of Iowa, July 26, 2018", "Email exchange with Brian Wright, professor of agricultural economics, UC Berkeley, July 26, 2018", "Fortune, \"President Trump Has Signed the GOP Tax Bill. Here’s When the Cuts Will Start,\" January 2, 2018", "Congressional Budget Office, \"Budget,\" Accessed July 27, 2018", "Congressional Budget Office, \"The Budget and Economic Outlook: 2018 to 2028,\" April 9, 2018", "Congressional Budget Office, \"Historical Budget Data,\" April 2018", "Congressional Research Service, \"The Commodity Credit Corporation: In Brief,\" April 19, 2018", "Congress, Commodity Credit Corporation Charter Act, August 10, 2012", "Department of the Treasury, Major Foreign Holders of Treasury Securities, July 17, 2018", "Investopedia, \"The Reasons Why China Buys U.S. Treasury Bonds,\" April 6, 2018", "Forbes, \"Trade War Or Not, Beijing Will Continue Buying U.S. Treasuries -- It Has No Choice,\" March 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]