["About this rating", "On July 10, 2019, we examined a claim holding that Google was \"scrubbing\" its search results of any pictures showing President Bill Clinton together with convicted sex offender and billionaire/financier Jeffrey Epstein. While this rumor was false (Google's search results were not notably different than those of Yahoo, Duck Duck Go, Yandex, or Bing), we were left with one unanswered question: Are there any photos of Epstein and Clinton?", "After all, Clinton flew on the private plane of Epstein, a convicted sex offender who was arrested again in July 2019 on new charges related to child-sex-prostitution. The two were also both present at a \"small dinner party\" in 1995 hosted by Revlon mogul Ron Perelman to raise funds for the Democratic National Convention. It seems reasonable to believe that someone at some point took a photograph of these two well-known public figures together.", "On July 22, 2019, Josh Rosner, the managing director of independent research consultancy Graham Fisher & Co, alerted us to his tweet containing a photograph of Epstein and Clinton that was published in a 2003 issue of Vanity Fair:", "Disturbing! The #press wiped all pictures of ⁦@BillClinton⁩ & #JeffreyEpstein from the #internet. Even ⁦@VanityFair⁩ who published this image in ‘03 from their #sex(?) trip to Brunei scrubbed it. #sycophant #power ⁦@CJR⁩ ⁦@theintercept⁩ ⁦@propublica⁩ pic.twitter.com/MmCZZraHai", "— joshua rosner (@JoshRosner) July 22, 2019", "Again, no evidence exists that this image was \"wiped\" from the Internet. In fact, this image is available online in Vanity Fair's digital archive (subscription required).", "This photograph was published in a March 2003 article by Vicky Ward entitled, \"The Talented Mr. Epstein.\" The photograph's caption: \"Epstein with President Clinton in Brunei, 2002.\"", "One possible explanation as to why this photograph doesn't pop up in search engines is that Vanity Fair didn't publish it as a standalone image. Rather, it is embedded in a digital copy of the March 2003 edition of the magazine. While we're not in the business of offering predictions, we'd bet that this image will start finding its way into Google Images and other image-based search engines in the near future (especially if more outlets pick up and publish stories including this image).", "Clinton is mentioned three other times in the Vanity Fair story; each iteration is reproduced below (emphasis ours):", "Lately, Jeffrey Epstein's high-flying style has been drawing oohs and aahs: the bachelor financier lives in New York's largest private residence, claims to take only billionaires as clients, and flies celebrities including Bill Clinton and Kevin Spacey on his Boeing 727. But pierce his air of mystery and the picture changes. VICKY WARD explores Epstein's investment career, his ties to retail magnate Leslie Wexner, and his complicated past.", "In addition to the town house, Epstein lives in what is reputed to be the largest private dwelling in New Mexico, on an $18 million, 7,500-acre ranch which he named \"Zorro.\" \"It makes the town house look like a shack,\" Epstein has said. He also owns Little St. James, a 70-acre island in the U.S. Virgin Islands, where the main house is currently being renovated by Edward Tuttle, a designer of the Aman resorts. There is also a $6.8 million house in Palm Beach, Florida, and a fleet of aircraft: a Gulfstream IV, a helicopter, and a Boeing 727, replete with trading room, on which Epstein recently flew President Clinton, actors Chris Tucker and Kevin Spacey, supermarket magnate Ron Burkle, Lew Wasserman's grandson, Casey Wasserman, and a few others, on a mission to explore the problems of AIDS and economic development in Africa.", "Epstein is known about town as a man who loves women—lots of them, mostly young. Model types have been heard saying they are full of gratitude to Epstein for flying them around, and he is a familiar face to many of the Victoria's Secret girls. One young woman recalls being summoned by Ghislaine Maxwell to a concert at Epstein's town house, where the women seemed to outnumber the men by far. \"These were not women you'd see at Upper East Side dinners,\" the woman recalls. \"Many seemed foreign and dressed a little bizarrely.\" This same guest also attended a cocktail party thrown by Maxwell that Prince Andrew attended, which was filled, she says, with young Russian models. \"Some of the guests were horrified,\" the woman says.", "\"He's reckless,\" says a former business associate, \"and he's gotten more so. Money does that to you. He's breaking the oath he made to himself—that he would never do anything that would expose him in the media. Right now, in the wake of the publicity following his trip with Clinton, he must be in a very difficult place.\"", "In 2002, around the time that this photograph was taken, Clinton told New York Magazine via a spokesperson that, \"Jeffrey is both a highly successful financier and a committed philanthropist with a keen sense of global markets and an in-depth knowledge of twenty-first-century science. I especially appreciated his insights and generosity during the recent trip to Africa to work on democratization, empowering the poor, citizen service and combating H.I.V./AIDS.\"", "Clinton once had a relationship with Epstein and even took multiple trips on his private plane. However, the former president said that he hasn't had contact with Epstein for a decade and knows nothing about the crimes the latter has been accused or convicted of:", "Statement on Jeffrey Epstein. pic.twitter.com/98ha9YYd1l", "— Angel Ureña (@angelurena) July 8, 2019", "Clinton, of course, isn't the only high-profile politician connected to Epstein. U.S. President Donald Trump has also been photographed with Epstein.", "Gold, Michael.   \"Bill Clinton and Jeffrey Epstein: How Are They Connected?\"\r\n    The New York Times.   9 July 2019.", "Thomas Jr., Landon.   \"Jeffrey Epstein: International Moneyman of Mystery.\"\r\n    NY Magazine.   28 October 2002.", "Ward, Vicy.   \"The Talented Mr. Epstein.\"\r\n    Vanity Fair.   March 2003.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]