["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Unlimited soups, salads and breadsticks are what Olive Garden is known for (especially the breadsticks). But is the restaurant also \"funding\" President Donald Trump’s 2020 re-election campaign?", "That’s what one viral Facebook post claims:", "\"Olive Garden is funding Trump's re-election in 2020. It would be terrible if you shared this and Olive Garden lost business.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But it isn’t true. A quick Google search into the rumor turns up several news articles and fact-checks that debunk the claim. We also previously fact-checked an Instagram post that inaccurately included Olive Garden on a list of companies that allegedly donated to President Donald Trump’s re-election campaign.", "The rumors started to circulate on social media in late August after that list went viral. Shortly after a #BoycottOliveGarden hashtag began trending on Twitter, the restaurant’s official account stepped in:", "\"We don’t know where this information came from, but it is incorrect. Our company does not donate to presidential candidates.\"", "We don’t know where this information came from, but it is incorrect. Our company does not donate to presidential candidates.", "When a user responded to the tweet and asked whether Olive Garden’s parent company, Darden Restaurants, donated to PACs, the restaurant responded that Darden \"does not donate to any federal or presidential candidates.\" Darden owns multiple restaurant chains, including LongHorn Steakhouse, Yard House, Cheddar’s and The Capital Grille.", "We went to OpenSecrets.org, a campaign finance database run by the Center for Responsive Politics research group, to examine the numbers.", "The database shows that Darden Restaurants itself has not donated to Trump’s re-election campaign, nor has it made any contributions during the 2020 election cycle. (The same goes for the 2018 and 2016 election cycles.)", "That’s because corporations are prohibited from making contributions to candidates and party committees, according to the Federal Election Commission. Open Secrets includes a similar disclaimer that reads: \"Organizations themselves cannot contribute to candidates and party committees. Totals include subsidiaries and affiliates.\"", "But donations can be made from PACs affiliated with the company, from the organization’s employees, owners or those individuals’ immediate family members. All the money associated with Darden that’s been donated so far in the 2020 cycle has come from individuals, the database shows. Those donations have totaled $17,332, with $11,899 of that going to candidates, all of them Democrats, and $5,000 going to a PAC that says it supports Democratic leadership. Trump is not among the recipients so far, according to the database.", "In recent election cycles, however, contributions associated with the organization went to both Republican and Democratic candidates and committees, and came from both individuals and PACs. In the 2016 election, individuals affiliated with Darden – again, not the organization itself – donated $8,407 to Hillary Clinton and $886 to Donald Trump.", "A viral Facebook post claims that Olive Garden is \"funding\" Trump’s re-election campaign.", "However, campaign finance data shows that Olive Garden’s parent company, Darden Restaurants, has not donated to Trump’s re-election campaign. Corporations are prohibited from making contributions to campaigns or party committees. Meanwhile, PAC’s associated with the company, as well as individual employees and their family members, have made contributions to both Democratic and Republican candidates.", "This rumor is wrong. We rate it False.", "Facebook post, Sept. 7, 2019", "Twitter, Olive Garden tweet, Aug. 26, 2019", "PolitiFact, Instagram post misconstrues food companies’ support for Donald Trump, Aug. 26, 2019", "Center for Responsive Politics, Darden Restaurants 2020, 2018, 2016; Accessed Oct. 28, 2019", "Federal Election Commission, Who can and can't contribute, Accessed Oct. 28, 2019", "Federal Election Commission, Individual contributions - Donald J. Trump for President campaign 2015-2016, 2017-2018, 2019-2020; Accessed Oct. 28, 2019", "Snopes, Is Olive Garden Funding Trump’s Re-Election?, Aug. 27, 2019", "Associated Press, Olive Garden has not donated to Trump’s 2020 campaign, Aug. 26, 2019", "CBS News, Olive Garden disputes claim that it donated to Trump's reelection campaign, Sept. 3, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]