["President Donald Trump ticked off his presidential accomplishments in front of a warm crowd in Youngstown, Ohio, saying he was already keeping his promises to strengthen the military with record defense expenditures.", "\"We've achieved a historic increase in defense spending to get our troops the support they so richly deserve,\" Trump said at a July 25, 2017, rally organized by his campaign.", "This isn’t the first time he’s trumpeted big spending for the military. In an address to Congress in March, Trump said his budget \"calls for one of the largest increases in national defense spending in American history,\" which we rated Mostly False.", "His brag in Youngstown is more overblown, and more inaccurate. The White House did not provide information for this fact-check.", "The increase in defense spending is not historic. Trump’s proposed base spending cap for 2017-18 defense spending is $603 billion, a 9.4 percent increase.", "There have been 10 years since 1977 when the base level has gone up by more than that, and in some years, the increase more than doubled Trump’s.", "In 1981, President Ronald Reagan hiked the spending cap by 24.9 percent and by 20.4 percent the following year. More recently, President George W. Bush bumped spending by 10 percent in 2009.", "The Center for Strategic and International Studies mapped these changes below.", "Base defense budget doesn’t include war-related funding, though. If we were to include that funding, the statistics are less in Trump's favor. Trump’s proposed budget represents a 5.4 percent increase in the total defense budget, but we’ve also had greater increases in the past.", "President Jimmy Carter increased military spending by 25 percent in 1981 and President Ronald Reagan’s added another 20 percent the next year. President George W. Bush raised the defense budget by 27 percent in 2003, 13 percent in 2007 and nearly 12 percent in 2008.", "This time, Trump wasn’t just saying he proposed one of the largest increases; he said he had already \"achieved\" it. The spending has not yet been approved.", "To turn his proposal into a reality, Trump will need Congress to appropriate the necessary funding for fiscal year 2018 as well as change the budget caps currently in effect.", "\"Trump’s defense budget is $54 billion above the budget cap already set in law,\" said Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies. \"And to change the budget cap he needs 60 votes in the Senate, so in some ways it’s actually more difficult to change the budget cap than to pass a health care bill.\"", "In Trump’s defense, Harrison said that his proposed defense budget is among the highest in history (though still not the highest) because the proposed increase comes on top of a defense budget that is already high by historical standards.", "But Trump was talking specifically about an increase.", "Trump said, \"We've achieved a historic increase in defense spending to get our troops the support they so richly deserve.\"", "The defense spending increase Trump laid out in his 2018 budget is not an unprecedented change, regardless of whether it includes war-related spending.", "It’s also not the done deal Trump described. In order to actually increase defense spending, Congress will have to appropriate the funding and raise the budget cap.", "We rate this statement False.", "Time, Trump's Ohio Rally Speech, July 26, 2017", "Whitehouse.gov, A New Foundation For American Greatness Fiscal Year 2018, May 23, 2017", "PolitiFact, \"Trump wrongly claims historic defense increase\", March 1, 2017", "Email interview with Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies, July 26, 2017", "Email interview, Laicie Heeley, defense budget analyst at the Stimson Center, July 26, 2017", "Email interview with Steven Cheung, White House assistant communications director, July 26, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]