["State Sen. Sylvia Garcia, D-Houston, made a Half True claim about existing laws barring people from entering bathrooms to do harm (La Voz de Houston photo).", "A Democratic opponent of a legislative proposal dictating who enters which bathrooms says existing law already bars Texans from slipping into facilities intending to do wrong.", "Houston state Sen. Sylvia Garcia declared in a Jan. 5, 2017 press release: \"All Texans want to go to the bathroom in peace, including transgender people. That’s why it’s already illegal to enter a bathroom to harm someone.\"", "We wondered about that as the Texas proposal, dubbed the Texas Privacy Act by authoring Sen. Lois Kolkhorst, R-Brenham, was assigned to a Senate committee in early 2017.", "Senate Bill 6 primarily would require transgender people to use bathrooms in government buildings, public schools and universities corresponding with the sex they were assigned at birth. The proposal also would prohibit city and county officials from adopting ordinances that prevent private businesses from making policies for their bathrooms and dressing rooms.", "Nationally through the first few weeks of 2017, GOP lawmakers in eight states, including Texas, had proposed bathroom-related legislation, according to tracking by the National Conference of State Legislatures. And over the previous few years, at least 24 states considered \"bathroom bills,\" though North Carolina was the only state to have passed and implemented a measure, according to the group.", "In Texas, Democrats have denounced Kolkhorst’s measure as discriminatory against transgender people and warned that it could harm Texas businesses and tourism. Proponents led by Lt. Gov. Dan Patrick say the measure will keep men from entering women’s restrooms to commit crimes.", "So, is entering a bathroom with plans to hurt someone already against Texas law?", "Asked to appraise Garcia’s claim, a Kolkhorst spokesman, Matthew Russell, said by email it’s incorrect that Texas law already forbids a person from entering a restroom for the purpose of committing a crime. Russell also provided a statement from Kolkhorst conceding that laws \"exist to protect people everywhere from harm,\" but her legislation, Kolkhorst said, \"specifically recognizes that predators often seek to target victims in vulnerable locations such as showers, locker rooms and restrooms.\"", "Garcia's backup", "In contrast, a Garcia aide guided us to a Houston ordinance and a state criminal law pertaining to public bathrooms.", "John Chapa Gorczynski, Garcia’s chief of staff, noted a Houston city ordinance that makes it a crime to enter an opposite-sex restroom without permission. The 1968 ordinance states: \"It shall be unlawful for any person to knowingly and intentionally enter any public restroom designated for the exclusive use of the sex opposite to such person's sex without the permission of the owner, tenant, manager, lessee or other person in charge of the premises, in a manner calculated to cause a disturbance.\"", "Those, of course, are one big city’s restrictions. YetChapa Gorczynski also pointed out sections of state criminal laws forbidding certain behaviors, though in them we saw no general proscription against entering the bathroom designated for an opposite sex.", "Chapter 42 of the Texas Penal Code, prohibits anyone from looking into \"an area such as a restroom or shower stall or changing or dressing room that is designed to provide privacy to a person using the area.\"", "Other parts of the code pointed out by Garcia’s aide:", "Chapter 20.01 and 20.02 – Illegal to restrain a person against their will anywhere", "Chapter 21.07 and 21.08 – Outlaws public lewdness and indecent exposure in public places, including acts of \"deviate sexual intercourse\" or \"act of sexual contact\"", "Chapter 21.15 – Against the law to make invasive visual recordings where someone \"has a reasonable expectation that the intimate area is not subject to public view\" including, the law specifies, bathrooms and changing rooms", "Chapter 21.16 – Voyeurism with the intent \"to arouse or gratify the sexual desire of the actor\" also is against the law", "At the Texas Municipal League, which says it serves more than 16,000 mayors, councilmembers, city managers, city attorneys, and city department heads, an official said by email that Houston’s bathroom entry ordinance might be unique. Bennett Sandlin said: \"I’m not aware of any other ordinances that get into the specifics of bathroom access. Most of the cities that have them are more generic in terms of supporting civil rights,\" meaning access to public services and accommodations regardless of a person’s race, sexual orientation or gender identity, he said.", "Our ruling", "Garcia said it’s already illegal in Texas to enter a bathroom to harm someone.", "In many ways, significantly, Texas laws forbid a person from harming another person. Also, a longstanding Houston ordinance bars a person from entering the incorrect bathroom. But Garcia didn’t show nor did we find similar no-entry restrictions in place statewide or in other cities.", "We rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/da650416-03c9-4e00-86f3-ae0faad4f8f6", "Blog post, \"‘Bathroom bill’ legislative tracking,\" National Conference of State Legislatures, Jan. 25, 2017", "News story, \"Senator says bathroom bill not aimed at the transgender,\" San Antonio Express-News, Jan. 25, 2017", "Press release, \"Senator Garcia Will Fight Job-Flushing ‘Bathroom Bill,’\" state Sen. Sylvia Garcia, Jan. 5, 2017", "Houston Code of Ordinances, Sec. 28-20. - Entering restrooms of opposite sex, municode.com, Accessed Jan. 24, 2017", "Texas Penal Code, Chapter 42, Chapter 21.16, Chapter 21.15, Chapter 21.07 and 21.08, Chapter 20.01 and 20.02, Texas Legislative Council, Accessed Jan. 24, 2017", "Email, Bennett Sandlin, executive director, Texas Municipal League, Jan. 25, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]