["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This meme appears on the New Jersey State AFL-CIO's Facebook page", "The attack ad game for New Jersey’s gubernatorial contest in November has a new player.", "Enter the state AFL-CIO, which has a meme on its Facebook page that links Gov. Chris Christie to big business and paints him as an enemy of education. A meme is an idea or concept shared via social media.", "The meme declares, \"New Jersey's governor cut $1.6 billion from public education while handing out $2.1 billion in corporate tax breaks, more than the entire previous decade,\" with a prominent picture of a dazed-looking Christie in the middle.", "The picture may not be the most flattering, but the claims in it are hard facts: New Jersey’s governor did cut education by a significant amount, and his actions have resulted in tax break largesse for businesses.", "Let’s begin by reviewing the education funding claim.", "Christie cut education funding, but not by $1.6 billion.", "The governor made two cuts to education in 2010 totaling about $1 billion to help close significant budget gaps. The New Jersey Education Law Center, a Newark-based school advocacy group, sued, claiming the cuts violated the law for giving aid to school districts, and put at-risk and poor students at an increased disadvantage.", "Ultimately, a judge agreed with the Education Law Center’s challenge. The judge also found that New Jersey would have needed $1.6 billion to fully fund education in New Jersey in accordance with the state’s funding law, and ordered the state to spend an additional $500 million on public education in poor districts the next year.", "Bottom line? Christie’s cuts totaled $1 billion.", "Next, let’s review the claim about corporate tax breaks.", "New Jersey Policy Perspective, a liberal think tank, released a report in April that the state has given $2.1 billion in tax breaks and grants to companies during the past three years that Christie’s been in office. That exceeds the $1.2 billion in corporate tax breaks given the entire previous decade, according to figures from the state Economic Development Authority.", "At the time of the report’s release, Christie spokesman Michael Drewniak said the group is \"simply not credible,\" and that figures from the EDA show that incentives have created more than 100,000 jobs since 1996.", "What Drewniak didn’t do, however, was question the accuracy of the numbers in the report.", "It’s also worth noting that a month before the report came out, Christie told a commercial real estate group that his administration was on target to deliver $2.3 billion in business tax breaks and supports legislation reauthorizing corporate incentives.", "NJPP used EDA numbers for its study, Deputy Director Jon Whiten said in an e-mail..", "Neither Drewniak nor Christie spokesman Kevin Roberts responded to requests for comment.", "Our ruling", "A meme on the state AFL-CIO Facebook page claims, \"New Jersey's governor cut $1.6 billion from public education while handing out $2.1 billion in corporate tax breaks, more than the entire previous decade.\"", "Christie actually cut $1 billion in state aid from education, not $1.6 billion.", "As for corporate tax breaks, Christie himself has said his administration is on target to deliver $2.3 billion in benefits for business – and that’s nearly double what was handed out in tax breaks in the decade before he took office.", "We rate the meme’s claim Mostly True.", "To comment on this story, go to NJ.com.", "New Jersey State AFL-CIO Facebook page, accessed May 20 and 21, 2013", "E-mail and phone interviews with Lee Sandberg, spokesman, New Jersey State AFL-CIO, May 20 and 22, 2013", "PolitiFact New Jersey, Television ad promotes Chris Christie’s spending cuts, increased education funding, Oct. 6, 2011, accessed May 21, 2013", "PolitiFact New Jersey, State Sen. Jim Whelan says Gov. Chris Christie \"slashed school aid in this budget,\" July 11, 2011, accessed May 21, 2013", "NJ.com, Christie’s budget cuts left N.J. schools unable to provide ‘thorough and efficient’ education, judge rules, March 22, 2011, accessed May 21, 2013", "NJ.com, N.J. judge begins hearing testimony on whether Gov. Christie was allowed to cut school aid, Feb. 14, 2011, accessed May 21, 2013", "NJ.com, N.J. Supreme Court weighs constitutionality of Christie’s education cuts, Jan. 5, 2011, accessed May 21, 2013", "NJ.com, N.J. Supreme Court hears arguments on Abbotts school funding formula, April 28, 2009, accessed May 21, 2013", "NJ.com, Judge says Christie’s school budget cuts violated constitution, fell heavily on high-risk districts, March 22, 2011, accessed May 21, 2013", "NJ.com, Spike in tax breaks awarded to N.J. businesses yields few results, group says, April 1, 2013, accessed May 22, 2013", "NJ.com, NJ businesses praise Christie’s proposal for $690M in tax cuts, Feb. 23, 2011, accessed May 22, 2013", "NJ.com, Christie touts conservative fiscal philosophy in campaign-style speech to business group, March 6, 2013, accessed May 21 and 22, 2013", "Yahoo.com, New Jersey corporate tax breaks surge, but economy lags: study, April 1, 2013, accessed May 22, 2013", "E-mail interview with Jon Whiten, deputy director, New Jersey Policy Perspective, May 22, 2013", "New Jersey Economic Development Authority website, accessed May 21 and 22, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]