["Presidential candidate Ben Carson speaks during the CNBC Republican presidential debate on Oct. 28, 2015. (Getty Images)", "Ben Carson’s tithe-based tax plan became the subject of a computational tussle between him and a CNBC moderator during the third GOP debate.", "Carson, a Seventh-day Adventist, has advocated for the federal government to adopt a tithing system across the board, referring to the Judeo-Christian practice of giving one-tenth of one’s income to the Church. \"I think God is a pretty fair guy,\" he reasoned in the first Republican debate.", "Moderator Becky Quick pointed out that a 10 percent flat tax would bring in a lot less revenue and asked how would that work. Tithing was just an analogy and the rate would actually be closer to 15 percent, Carson responded, adding that he’d fill the gap through \"strategic cutting.\"", "But Quick continued to press him on the numbers. Here’s a snippet of their exchange on Oct. 28:", "Quick: \"You would have to cut government by about 40 percent to make it work with a $1.1 trillion hole.\"", "Carson: \"It's not true.\"", "Quick: \"It is true. I looked at the numbers.\"", "Carson: \"When we put all the facts down, you will be able to see that it's not true. It works out very well.\"", "So true or not true? Carson has yet to release a tax plan, and his spokesman Doug Watts said that Quick \"got several assumptions wrong\" though he didn’t respond when we asked him which ones. But based on what Carson has said so far, Quick’s math is sound.", "The plan", "Carson’s campaign website calls for wholesale tax reform and \"to end the IRS as we know it,\" but includes almost no specifics. That makes the Quick and Carson argument \"really quite pointless\" since there aren’t enough details to properly model, said Scott Hodge of the Tax Foundation, an organization that analyzes tax plans and tends to take a free-market, low-tax approach.", "\"When Dr. Carson releases enough detail of his plan we will model it as well on an apples-to-apples basis as the other plans,\" Hodge said.", "Carson’s formal tax plan will be released sometime within the next 30 days, Watts told us. Until then, we’ll assess what he has proposed so far, according to analysis by the nonpartisan Tax Policy Center and the Tax Foundation, as well as our own research.", "It includes:", "• A flat income tax rate of 10 to 15 percent, phased in over time, with no deductions or loopholes;", "• A six-month tax hiatus for corporate profits overseas, but 10 percent has to be used in enterprise zones;", "• A corporate tax rate of 15 to 20 percent;", "• Eliminate the payroll tax, estate tax and the Affordable Care Act.", "Quick’s math", "Under the current tax system, the United States is expected to collect $3.2 trillion in revenue in 2015, while government spending will reach $3.7 trillion, according to the Congressional Budget Office.", "Quick likely got her numbers by applying Carson’s 15 percent tax rate to the total personal income and the total corporate income ($15.4 trillion and $2.1 trillion respectively, by the latest Bureau of Economic Analysis estimates for 2015). That would generate about $2.6 trillion in revenue.", "So Carson’s plan falls $0.6 trillion short of anticipated revenue, and $1.1 trillion short of spending. To break even, you’d have to reduce spending by about 30 percent annually, not as Quick said, 40 percent.", "We should note that this line of computation assumes that Carson would get rid of all other sources of revenue. Though he hasn’t offered specifics on excise taxes, customs duties, etc., he has proposed to eliminate both the payroll tax (projected to generate $1.1 trillion in 2015) and the estate tax ($20 billion), which alone put him in the hole.", "Carson’s math", "After objecting to Quick’s calculations, Carson himself crunched the numbers a different way during the CNBC debate:", "\"If you talk about an $18 trillion economy, you are talking about a 15 percent tax on your gross domestic product, you are talking about $2.7 trillion. We have a budget closer to $3.5 trillion. But if you also apply that same 15 percent to several other things, including corporate taxes and including the capital gains taxes, you make that amount up pretty quickly. So that's not, by any stretch, pie in the sky.\"", "Experts, however, had a few bones to pick with Carson’s math, starting with its premise.", "First, not all of GDP is taxable, pointed out Roberton Williams of the Tax Policy Center. To apply his rate to all $18 trillion, Carson would have to tax health insurance premiums, pensions and government spending (the $3.7 trillion that Carson wants to cut) to name a few.", "Second, even if we assume that you can tax all of GDP, the 15 percent tax rate still falls short of anticipated revenue and spending, as Carson acknowledges himself.", "Contrary to what he said, however, you can’t \"make that amount up\" by applying the rate to corporate taxes and capital gains. That would be double-counting, since those are already a part of the total GDP figure, a post-debate CNBC article pointed out.", "In short, taxing all of GDP by 15 percent would still create a $1 trillion hole this year.", "\"(That’s) the biggest piece of the biggest pie that we can come up with, and you’d still be short 20 percent of revenue. Good luck with that,\" Williams said.", "Our ruling", "Carson said \"it’s not true\" that his plan would leave us with a $1.1 trillion hole, as moderator Becky Quick said.", "But Quick’s math is sound, based on what's publicly known about Carson's plan. Carson’s 15 percent flat tax would generate a $1.1 trillion hole. By his own math, his plan would create a $1 trillion hole.", "We rate Carson’s claim False.", "CBNC, \"CNBC Full Transcript: CNBC's \"Your Money, Your Vote: The Republican Presidential Debate\" (Part 2),\" Oct. 29, 2015", "Email interviews with Doug Watts, spokesperson for Ben Carson, Nov. 2, 2015", "Email interview with Scott Hodge, president of the Tax Foundation, Nov. 3, 2015", "Interview with Roberton Williams, Sol Price Fellow at the Tax Policy Center, Nov. 2,0 215", "Interview with Bob McIntyre, director of Citizens for Tax Justice, Nov. 2, 2015", "BenCarson.com, \"The American People Deserve a Better Tax Code,\" accessed Nov. 2, 2015", "Tax Foundation, Comparing the 2015 Presidential Tax Reform Proposals, accessed Nov. 2, 2015", "Tax Policy Center, Major candidate tax proposals, accessed Nov. 2, 2015", "CNBC, \"Ben Carson: 6-month tax hiatus for overseas profit,\" Oct. 7, 2015", "Congressional Budget Office, Chapters 4 and 3 of The Budget and Economic Outlook: 2015 to 2025,\" Jan. 26, 2015", "Bureau of Economic Analysis, National Income and Product Accounts Table 2.1, Oct. 29, 2015", "Bureau of Economic Analysis, National Income and Product Accounts Table 6.16D, Oct. 29, 2015", "CNBC, \"GOP debate comes up short on tax, budget solutions,\" Oct. 29, 2015", "Citizens for Tax Justice, \"Ben Carson's 10 Percent Flat Tax is Utterly Implausible,\" Sept. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]