["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Affordable Care Act has become a flashpoint in this year’s battle for the U.S. Senate seat from Iowa. Democratic candidate Theresa Greenfield has honed in on Republican Sen. Joni Ernst’s past votes to repeal and replace the ACA, while Ernst has been adamant that she supports people with preexisting conditions.", "In an Oct. 22 tweet, Greenfield again criticized Ernst’s record on health care.", "\"She’s voted repeatedly to repeal the ACA, and now she supports the lawsuit that’s headed to the Supreme Court that will do just that,\" Greenfield tweeted. Greenfield and Democrats have been critical of the lawsuit, and Greenfield has called on Ernst to publicly oppose it.", "A look at congressional records shows Ernst has cast multiple votes to repeal the ACA, and similar claims have been vetted by other fact-checkers. But here, we’re focusing on Greenfield’s second claim — that Ernst supports the lawsuit coming up in the Supreme Court that could invalidate the Affordable Care Act.", "The lawsuit Greenfield references challenges the ACA’s constitutionality and is under appeal in the case California v. Texas.", "A mandate that required most people to have some level of health insurance or face a penalty tax was zeroed out in the Tax Cuts and Jobs Act of 2017. Twenty states, represented by Texas, are suing the federal government, arguing the mandate is not constitutional and the whole law should be struck down. Iowa is one of 20 states and the District of Columbia that are defending the ACA. Democratic Attorney General Tom Miller joined the defense on appeal in February 2019.", "The Supreme Court is to hear oral arguments in the case soon after the election, on Nov. 10.", "Ernst has not expressed a hard position on the lawsuit during this year’s campaign and has declined to say whether or not she supports or opposes it, saying the decision is up to the courts.", "\"We’ll see what the decision is. But that’s in the court’s hands,\" Ernst told Politico in September.", "When we contacted the Greenfield campaign for evidence to back up its claim that Ernst supports the lawsuit, staffers said that Ernst’s history of opposing the ACA, her lack of a stance on the lawsuit, and her vote to cut the individual mandate are all signs that she supports the lawsuit.", "\"There’s absolutely no doubt that Senator Ernst supports the ongoing anti-ACA lawsuit,\" campaign spokesperson Izzi Levy wrote in an email to Politifact. \"…In fact, Theresa even called on Senator Ernst to oppose this harmful lawsuit on the first day of the general election. But since then, Ernst has consistently refused to speak out or take any meaningful action to stop it.\"", "Ernst has a history of antagonism against the ACA. She campaigned in 2014 on repealing the law. She voted for three measures to replace the ACA in 2017 and also voted to begin debate on a bill that would have eliminated the provision that prevents insurers from dropping coverage for people with preexisting conditions. Two years earlier, she voted to approve the fiscal 2016 federal budget that included provisions for adjustments tied to repealing the ACA. She has criticized the law throughout the 2020 campaign, saying it caused health care prices to go up.", "Ernst has been more careful in her recent criticism and votes related to the ACA. On Oct. 1, she voted with Democrats on a bid to block the U.S. Justice Department from supporting the lawsuit. She was one of six Republican senators who crossed the party line, all of them vulnerable from Democratic challengers in the fall election. Ernst said her vote showed her support for protecting people who have preexisting conditions.", "The vote was called symbolic by both Politico and the Washington Post, and it was seen by political opponents and some political analysts as a decision from Republicans in competitive elections to avoid backlash.", "While it signals opposition and prevents Ernst’s opponents from having another point to attack her on, it doesn’t show that Ernst opposes the lawsuit itself. The lawsuit would have continued whether or not it had backing from the Justice Department because the department is not part of the original lawsuit or ruling.", "When asked whether Ernst supports or opposes the lawsuit, campaign spokesperson Brendan Conley said she hasn’t taken a position on it.", "\"Joni has made clear that this is being taken up by the courts and that her focus is on taking Iowans’ fight to Congress to ensure we maintain protections for those with preexisting conditions,\" Conley wrote in an email to PolitiFact.", "Ernst also supported the law that ultimately led to the lawsuit. The 2017 Republican-led Tax Cuts and Jobs Act, which eliminated the penalty from the individual mandate, set the ground for the constitutionality of the law to be challenged.", "Ernst has continued to promote the Tax Cuts and Jobs Act on the campaign trail in 2020.", "Greenfield said that Ernst supports the lawsuit striking down the Affordable Care Act. But Ernst has failed to give a clear, publicly stated stance on the lawsuit. Greenfield’s claim is based on Ernst’s consistently critical assessment of the ACA and votes in favor of repealing the law. Ernst also voted to cut the individual mandate, which led to the law being challenged in court.", "Even though Ernst hasn’t taken a position on the lawsuit itself, she’s expressed a repeated desire to roll back the ACA. We rate Greenfield’s claim Half True.", "Email exchange with Brendan Conley, Ernst campaign spokesperson", "Email exchange with Izzi Levy, Greenfield campaign spokesperson", "The Gazette, Fact Checker: Ad’s health care claims against Joni Ernst mostly accurate, Sept. 30, 2019.", "U.S. Supreme Court docket, California, et al., Petitioners v. Texas, et al.", "Kaiser Family Foundation, Explaining California v. Texas: A Guide to the Case Challenging the ACA, Sept. 01, 2020.", "Congress.gov, H.R.1 – An Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018.", "Health Leaders Media, 4 States Seek to Join Coalition Defending ACA on Appeal", "Iowa Capital Dispatch, \"Ernst says no one ‘should be surprised’ she voted with Democrats on ACA lawsuit,\" Oct. 2, 2020", "Politico, SCOTUS battle crashes into decisive Senate race in Iowa, by James Arkin, Sept. 30, 2020.", "New York Times, How Each Senator Voted on Obamacare Repeal Proposals, by Alicia Parlapiano, Wilson Andrews, Jasmine C. Lee, and Rachel Shorey, July 28, 2017.", "NBC News, \"Some vulnerable GOP senators break with Trump on anti-Obamacare lawsuit,\" Oct. 1, 2020", "U.S. District Court, Texas, et al., Plaintiffs v. United States of America, et al., Defendants, California, et al. Intervenors-Defendants, Civil Action No. 4:18-cv-00167-O", "Roll call vote on the Conference Report (Conference Report to Accompany S. Con. Res. 11), May 5, 2015.", "Roll call vote on Motion to Proceed to H.R. 1628, July 25, 2017.", "Joni Ernst Senate website, Health Care", "Republicans face major head winds in final stretch to maintain Senate majority, by Rachael Bade and Paul Kane, Oct. 5, 2020.", "Politico, Endangered Republicans back Senate Democrats’ bill opposing Obamacare lawsuit, by Alice Mirando Ollstein, Oct. 01, 2020.", "AZ Mirror, McSally votes to bar DOJ from support of ACA repeal lawsuit by Jeremy Duda, Oct. 01, 2020.", "Roll call vote on passage of the Tax Cuts and Jobs Act, Dec. 2, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]