["A protester holds up a phone as he stands in front of authorities on Aug. 25, 2020, in Kenosha, Wis. (AP)", "Jacob Blake, a 29-year-old Black man, was shot in the back by a white police officer in Kenosha, Wis., on Aug. 23. There is no evidence that Blake is a “child rapist.”", "Court records show that Blake has been charged with one felony count of third-degree sexual assault related to an alleged incident of domestic abuse. Under Wisconsin law, sex with a minor is not one of the offenses included in that charge.", "Demonstrators in Kenosha, Wis., are protesting the shooting of Jacob Blake, a 29-year-old Black man who was shot in the back by a white police officer on Aug. 23 while getting into a car where his children were watching. Two protesters were killed and one injured when police say a counter-demonstrator opened fire two days later.", "Some Facebook users say demonstrators’ concern about the first shooting is misplaced. An Aug. 24 post claims Blake \"is a Child (16 YO Girl) Rapist.\"", "\"Let that sh-- sink in,\" the caption says. \"Had a warrant out for his arrest on 7/20/20.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar allegations about Blake have thousands of likes, shares and comments, according to CrowdTangle, a social media insights tool owned by Facebook.", "(Screenshot from Facebook)", "There is no evidence that Blake is a \"child rapist,\" as the Facebook post claims.", "The post references an active arrest warrant for Blake and a 2015 article from the Racine County Eye, an online news outlet based directly north of Kenosha County. First, let’s take a look at the article — which is unrelated to the warrant.", "In September 2015, police arrested Blake after he pulled a gun at a bar in Racine, Wis. He was charged with one felony count of resisting arrest and \"one misdemeanor count each of carrying a concealed weapon, carrying a firearm while intoxicated, endangering safety-use of a dangerous weapon, and disorderly conduct,\" according to the Racine County Eye.", "Blake was charged in Racine County Circuit Court, but the case is not listed in the state’s database of circuit court records. According to the website, felony and misdemeanor cases that were dismissed or acquitted only display in the database for two years after they were resolved.", "Now, let’s take a look at the warrant for Blake’s arrest.", "The warrant was issued July 7 in Kenosha. According to Wisconsin’s circuit court records database, Blake has been charged with one felony count of third-degree sexual assault and two misdemeanor counts of disorderly conduct and criminal trespassing.", "RELATED: What we know about Jacob Blake's shooting in Kenosha, Wis.", "All those charges are related to an alleged incident of domestic abuse that occurred May 3. The criminal complaint was filed July 6.", "According to Wisconsin law, third-degree sexual assault can include nonconsensual sexual intercourse or other sexual contact, such as ejaculation or urination. Sex with a minor is not listed as one of the offenses included in the charge.", "The Facebook post includes a screenshot of another legal definition of third-degree sexual assault: sexual penetration with someone between the ages of 14 and 16. That definition comes from Rhode Island’s criminal code, which does not apply in Wisconsin.", "The post is inaccurate. We rate it False.", "940.225 - Wisconsin Legislature", "Wisconsin Circuit Court Access", "Facebook post, Aug. 24, 2020", "Racine County Eye, \"Police: K9 Dozer Helps Subdue Man Who Pulled Gun at Bar,\" Sept. 22, 2015", "Rhode Island Code § 11-37-6", "CrowdTangle, accessed Aug. 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]