["A bill that passed the N.C. General Assembly on Wednesday will create statewide rules for police body camera and dash camera footage, if Gov. Pat McCrory signs it into law.", "UPDATE 7/11/16: McCrory signed the bill into law.", "The bill’s main sponsors – two Republican members of the N.C. House who are retired law enforcement officers – have said it strikes a balance between the interests of police and the public.", "But open-government advocates including the state American Civil Liberties Union chapter say the opposite – that this bill would give police inordinate power to keep footage shielded from the public.", "\"Giving law enforcement such broad authority to keep video footage secret – even from individuals who are filmed – will damage law enforcement’s ability to build trust with the public and destroy any potential this technology had to make officers more accountable to the communities they serve,\" said ACLU attorney Susanna Birdsong in a news release.", "We can’t see the future, so we won’t try to say whether keeping video footage secret will damage law enforcement’s public image and accountability.", "But we can look at just how easily footage could be kept secret if the bill becomes law.", "Two levels of publicity", "The bill would establish two ways for members of the public to view police video – disclosure and release.", "1. Disclosure: When people are allowed to watch the video but can’t make copies of it or otherwise show it to the general public. Disclosure would only be available to people who are seen or heard in their video (or people who represent them, like lawyers or guardians). And even then it’s not guaranteed. Like the ACLU said, police can still decide the video requires so much secrecy that even people in the video can’t see it.", "2. Release: The more typical meaning of something being made public. It’s an option for anyone who believes the video footage should be available for the public to see at any time. That includes reporters who wish to show the footage the the public as well as people who want copies of the footage to use as evidence in lawsuits, for example. Under the proposed law, release would only be possible if a judge signs off on the request.", "The status quo", "For any type of police video footage right now, there’s no explicit statewide standard. What’s considered public varies from agency to agency, according to Frayda Bluestein, a UNC-Chapel Hill law and government professor.", "One of the bill’s cosponsors, Asheboro Republican Allen McNeill, argued that the bill will improve transparency since many agencies now make these videos personnel records, which are hard for the public to access.", "Bluestein has studied the issue for years. She said most videos are considered investigative records, although some are classified as personnel records. In either case, she said, it’s still possible for the public to successfully open up those records simply by asking the agency. And if that fails, the courts are there to decide who is right.", "But the proposed law would make a trip to court the only option, even for the most innocuous footage.", "Who gains from transparency?", "Nationwide, police footage of officers shooting, choking and beating people have given rise to civil lawsuits, criminal charges and movements like Black Lives Matter. The Raleigh News & Observer recently used jailhouse video obtained by a public records request in Harnett County to show the official account of an inmate’s death differed from what actually happened.", "Other times, the police themselves have released videos in order to defend their officers’ actions. It’s rare in North Carolina, but not unheard of.", "Greensboro officials released body cam video last month of an officer shooting and killing a woman in 2014. Last year Lincolnton police released body cam footage leading up to an officer shooting a dog. In 2009 Chatham County officials released portions of dash cam video of a car chase that led to a fatal shooting.", "Who watches the watchmen?", "Birdsong said police will have \"broad authority\" to deny people the right to see video, including video of themselves.", "For disclosure requests the bill gives six provisions, saying officials \"may consider any of the following factors in determining if a recording is disclosed.\"", "Those give police a wide range of options for denial: if the video contains otherwise confidential information, if it’s deemed \"sensitive\" or revealing, if it might harm someone’s reputation, if it might harm someone’s safety, or if it’s related to an active, inactive or potential criminal or internal investigation.", "\"The 'may consider' portion of that is the part that is the most concerning to me,\" Birdsong said.", "If denied, people can appeal to a judge. But the law will force the judge to give latitude to the police’s original decision – the judge can only overrule police if he finds an \"abuse of discretion.\"", "Getting the record made public", "All that was just to be able to watch the video one time, without being able to make a copy or show other people. What about people who want to make it fully public?", "That decision would be entirely up to a judge. But one public records attorney we spoke with, Mike Tadych, said it could be difficult to argue to a judge that video should be released if no member of the public has been able to see the video.", "That’s because the law would also require judges to only release the parts of the video specifically described in court.", "\"I don’t know how in the world, without knowing what's on it, you would be able to say you know what's on it,\" Tadych said.", "Furthermore, anytime a judge is deciding whether to make footage public, the law would require that the local district attorney, the head of the agency that took the video and any officer whose image or voice is on the video must be notified and given a chance to testify.", "There are no such rights for the private citizens whose image or voice is in the footage.", "Our ruling", "The ACLU said if the bill becomes law, police will have \"broad authority to keep video footage secret – even from individuals who are filmed.\"", "Police can stop individuals who were filmed by police from viewing the video, using broad and sometimes vague reasoning. And even on appeal, judges have limited authority to overrule the police.", "Police won't be able to decide if a video is made completely open to the public. Only a judge will. But in any given case, a number of law enforcement officials will have rights of notification and testimony that aren’t given to the regular individuals who are also in the video.", "We rate this claim True.", "After The Fact", "Gov. Pat McCrory signed the body cam bill into law on Monday, July 11.", "https://www.sharethefacts.co/share/236400b3-7fa7-47c7-b200-7ff1e8dd16ab", "Email interview with Frayda Bluestein, UNC-Chapel Hill’s David M. Lawrence Distinguished Professor of Public Law and Government", "Email and phone interviews with Mike Tadych, attorney at Stevens, Martin, Vaughn & Tadych", "Phone interview with Susanna Birdsong, ACLU of North Carolina policy counsel", "The News & Observer, June 29, 2016, \"NC Senate votes to regulate release of body-cam footage\"", "WRAL, June 7, 2016, video of House committee hearing on body cam bill", "Text of the body cam bill, N.C. House Bill 792, \"An act to provide that recordings made by law enforcement agencies are not public records\"", "The News & Observer, May 30, 2016, \"Greensboro body cam video shows officer killing woman\"", "The Lincoln Herald, March 13, 2015, \"Officer shoots dog\"", "The News & Observer, May 2, 2016, \"Death by Taser, in a padded cell, caught on camera\"", "WRAL, Sept. 18, 2009, \"Suspect in Chatham County shootout asked deputies to shoot him\"", "Frayda Bluestein, Sept. 17, 2014, \"How Public Are Law Enforcement Vehicle or Body Camera Videos? (Not Very, in North Carolina.)\"", "Frayda Bluestein, June 22, 2016, \"The Latest on North Carolina Body-Worn Camera Legislation\"", "The News & Observer, Jan. 2, 2016 \"Key questions remain before police body cameras widespread in NC\"", "Administrative Office of the Courts, North Carolina Court of Appeals Legal Standards, abuse of discretion definition: \"manifestly unsupported by reason or is so arbitrary that it could not have been the result of a reasoned decision.\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]