["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Minnesota Vikings benched running back Adrian Peterson indefinitely after his indictment by a Texas grand jury on a charge of child abuse and push back from corporate sponsors.", "The furor over Minnesota Vikings running back Adrian Peterson and his admission that he struck his 4-year-old son with a wooden switch has put parenting and corporal punishment in the spotlight. Peterson has said he grew up treated the same way by his parents.", "The Vikings pulled Peterson from the team’s active roster while his case moves through the courts. During a Sept. 17 broadcast on ESPN’s Mike and Mike, billionaire Donald Trump waded into the debate. While saying that he was never a \"spanker,\" which is less severe than Peterson’s offense, Trump said there’s no simple response because many parents physically discipline their kids and they turn out \"good.\"", "\"It's a pretty tough thing because I saw something last night that much more than 50 percent of people out there and parents out there are spankers,\" Trump said.", "We thought it would be worthwhile to check if spanking is as common as Trump said.", "In large measure, the data says it is.", "A 2013 study by Columbia University researchers found that 57 percent of mothers and 40 percent of fathers engaged in spanking when children were age three, and 52 percent of mothers and 33 percent of fathers engaged in spanking at age five.", "Disadvantaged families represented a large share of the survey group but the results are consistent with other studies.", "A 1999 article in Clinical Child and Family Psychology Review reported that 72 percent of parents of children between the ages of two and four said they sometimes spanked their kids. A 2002 poll commissioned by ABC News asked a random sample of adults if they had ever spanked their children. Over half of them said they had.", "That ABC survey showed an interesting regional difference. In the South, 62 percent of parents said they spank their children. For the rest of the country, the fraction dropped to 41 percent.", "We should note that pediatricians as a group strongly discourage spanking. They cite evidence that ties it to behavioral problems and lower school performance. The spanking label covers a lot of ground. Some parents hit harder and more often than others. To talk simply of spanking masks important differences in how parents treat their children.", "Our ruling", "Speaking about the Peterson case, Trump said that much more than 50 percent of parents are spankers. In this fact-check, we’re not judging whether spanking is akin to what Peterson did, we’re simply verifying Trump’s statistic.", "He’s close. We found two polls that put the fraction a bit over half, rather than \"much more.\" But that aside, Trump is largely correct within a broad definition of spanking.", "We rate the claim Mostly True.", "ESPN, Mike and Mike, Sept. 17, 2014", "Pediatrics, Spanking and Child Development Across the First Decade of Life, Oct. 21, 2013", "Clinical Child and Family Psychology  Review, Corporal punishment by American parents: national data on prevalence, chronicity, severity, and duration, in relation to child and family characteristics, 1999", "ABC News, Poll: Most Approve of Spanking Kids, Nov. 8, 2002", "Gallup, Children, February 1997", "Providence Journal, Vikings admit 'mistake,' reverse course on Adrian Peterson, Sept. 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]