["By Angelo Fichera", "Posted on January 6, 2020", "An old tweet from an account impersonating Rep. Rashida Tlaib resurfaced on social media — this time with an erroneous claim that the tweet was her response to the recent attack on the U.S. embassy in Baghdad.", "Rep. Rashida Tlaib, a Palestinian-American from Michigan, has been a frequent target of online misinformation since becoming one of the first two Muslim women elected to Congress in 2018.", "In early 2019, a tweet from an unverified user posing as Tlaib posted anti-American remarks. That tweet was exposed as a fake at the time. But now that same made-up tweet has resurfaced on Twitter and Facebook in connection with the recent conflict between the U.S. and Iran.", "The hoax tweet reads: “Americans have spent decades raping and pillaging my people. What goes around comes around. #FridayFeeling.”", "But, as many outlets wrote in January 2019, that message was not from Tlaib’s account but from a since-deleted Twitter account made to resemble it. The fake Twitter account was not verified (unlike Tlaib’s verified personal and congressional accounts) and its handle — @RashidaTIaib — used a capital “i” rather than an “l” in “Tlaib.”", "The latest viral meme shows a screenshot of another Twitter user sharing the fake Tlaib tweet and calling the congresswoman “anti-american” and someone “who should not be in office.” (That user later apologized upon learning the Tlaib tweet was bogus.)", "The meme also adds the caption: “This was her comment on the Protesters Siege of the U.S. Embassy in Iraqi.”", "As we said, Tlaib didn’t make those comments in a tweet — let alone in response to an attack on the U.S. embassy in Baghdad, in which protesters set fire to a reception building. The Dec. 31 attack was part of escalating aggression between the U.S. and Iran that further deepened after the U.S. killed Iranian Gen. Qasem Soleimani on Jan. 2 with an airstrike in Baghdad.", "Tlaib has used Twitter to speak out against a potential war with Iran, calling it “yet another unnecessary war that puts innocent lives at risk at home.”", "Addressing the spread of the fake tweet, Tlaib wrote on Jan. 6 that such falsehoods “endanger my life.” And she reminded users to verify that tweets purportedly from her are actually hers:", "Quick public servant announcement: If there isn't a checkmark next to my name on the tweet then it's fake!", "To all the foreign countries & reckless commentators out there spreading lies about me: Try to focus on disagreeing with me with facts, instead of making up shit. pic.twitter.com/DPxdZSEKP0", "— Rashida Tlaib (@RashidaTlaib) January 6, 2020", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Moore, Elena and Roberta Rampton. “Timeline: How The U.S. Came To Strike And Kill A Top Iranian General.” NPR. 4 Jan 2020.", "“Remarks by President Trump on the Killing of Qasem Soleimani.” White House. 3 Jan 2020.", "Tlaib, Rashida (@RashidaTlaib). “Quick public servant announcement: If there isn’t a checkmark next to my name on the tweet then it’s fake! To all the foreign countries & reckless commentators out there spreading lies about me: Try to focus on disagreeing with me with facts, instead of making up shit.” Twitter. 6 Jan 2020.", "Tlaib, Rashida (@RashidaTlaib). “We cannot stay silent as this lawless President recklessly moves us closer to yet another unnecessary war that puts innocent lives at risk at home & across the globe. Congress alone has the authority to declare war, & we must reclaim our responsibility & say no to war with Iran.” Twitter. 3 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]