["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A super PAC’s attack ad in the race for Maine’s 2nd Congressional District claims that Democratic candidate Jared Golden voted for people to purchase tattoos, tobacco, alcohol, lottery tickets with with welfare dollars.", "\"Why isn’t Jared Golden looking out for us?\" the ad says. \"In Augusta, Golden voted to let welfare recipients use your tax dollars to buy tattoos, tobacco, alcohol, even lottery tickets.\"", "The ad comes from the Congressional Leadership Fund, a super PAC focused on strengthening and maintaining the Republican majority in the U.S. House of Representatives. Golden, a state representative, is looking to unseat two-term incumbent Republican Rep. Bruce Poliquin in November.", "Golden claims the ad was is false. Let’s find out.", "The super PAC’s claim refers to a state law passed in 2016 that limits people on Maine Temporary Assistance for Needy Families from using Electronic Benefits Transfer cards to purchase a laundry list of items, including tattoos, tobacco, alcohol and lottery tickets.", "This state law passed Maine’s House of Representatives 206-38 with bipartisan support.", "Golden was one of the 38 representatives who voted against the bill. He told the Sun Journal he opposes misuse of welfare funds, but the state-level restrictions were unnecessary because federal rules already prohibit using welfare money for items like tattoos, tobacco and alcohol.", "Golden spokesman Bobby Reynolds said just because Golden voted against that bill, it doesn’t mean he voted in favor of using welfare dollars for controversial purchases.", "Reynolds said that if the bill failed, Mainers would still be barred from using TANF funds to purchase those items under federal rules.", "\"It was a solution in search of a problem,\" Reynolds said. \"To be clear, Jared Golden opposes the use of SNAP and TANF for such purchases.\"", "However, it’s worth noting that Maine’s 2016 law is more restrictive than federal law.", "The federal Middle Class Tax Relief and Job Creation Act of 2012 requires states to maintain policies and practices to keep EBT cards from being used at liquor stores, casinos or adult-oriented entertainment establishments.", "The federal law does not restrict transactions at grocery stores that sell alcohol or that have \"gaming activities.\" It also does not regulate how cash that has been withdrawn with an EBT card can be used. Maine's 2016 law also does not address cash withdrawals.", "\"It would be virtually impossible to effectively monitor and implement such a restriction,\" Schott said.", "The 2012 federal law also does not mention tattoos or tobacco.", "Maine’s 2016 law expanded TANF EBT card purchase restrictions to also include tobacco products lotteries, bail, firearms, ammunition, vacation or travel services, tattoos and obscene materials or entertainment.", "The Poliquin campaign declined our request to comment on the content of the ad, saying the campaign had no control over the ad and no role in its creation.", "The Congressional Leadership Fund claims that Golden voted in favor of welfare recipients using tax dollars to buy tattoos, tobacco, alcohol and lottery tickets.", "Golden voted against a 2016 bill that limited EBT card purchases, saying federal law already covered the issue. Golden did not vote in favor of a measure that would expand EBT card use to those items.", "The statement has an element of truth but leaves out critical context that would give a different impression. We rate it Mostly False.", "Congressional Leadership Fund super PAC, \"(ME-02) Work Hard,\" Aug. 27, 2018", "PolitiFact, Congressional Leadership Fund file, accessed Aug. 29, 2018", "Lewiston Sun Journal, \"New GOP television ad targets Golden's positions — and tattoo,\" Aug. 27, 2018", "State of Maine Legislature, S.P. 384 - L.D. 1097, approved April 16, 2016", "State of Maine Legislature, \"Roll-call details for House roll-call #645 LD 1097,\" April 15, 2016", "USDA, \"What is Electronic Benefits Transfer (EBT)?\", Aug. 23, 2018", "United States Congress, \"Middle class tax relief and job creation act of 2012,\" approved Feb. 22, 2012", "Email interview with Bobby Reynolds, Golden campaign spokesman, Aug. 30, 2018", "Email interview with Brendan Conley, Poliquin campaign spokesman, Aug. 30, 2018", "Interview with Congressional Leadership Fund spokesperson, Sept. 4, 2018", "Email interview with Liz Schott, senior fellow at Center on Budget and Policy Priorities, Sept. 5, 2018", "Center on Budget and Policy Priorities, \"TANF Cash Benefits Have Fallen by More Than 20 Percent in Most States and Continue to Erode,\" Oct. 13, 2017", "United States Department of Agriculture Food and Nutrition Service, \"Supplemental Nutrition Assistance Program,\" accessed Sept. 5, 2018", "Portland Press Herald, \"LePage: Transaction records show welfare cards abused,\" Jan. 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]