["About this rating", "An online tweet-turned-meme attempted to link then-U.S. House Minority Leader Nancy Pelosi, U.S. Rep. Beto O'Rourke, and Mexican drug lord Joaquín Archivaldo Guzmán Loera (commonly known as \"El Chapo\") in a plot to \"keep the USA/Mexico border open\":", "Nothing implied or stated in this meme from January 2019 stands up to scrutiny, though. First off, the suggestion that the featured photograph captured some form of furtive meeting or secret negotiations between El Chapo and Democrats Pelosi and O'Rourke does not reflect reality. This picture was taken in May 2016 — while Guzmán was in custody in Mexico awaiting extradition to the United States — in conjunction with a tour of three Trans-Pacific Trade Partnership countries undertaken by a bipartisan U.S. House delegation. The man standing next to Pelosi is not El Chapo, but then-President Enrique Peña Nieto of Mexico:", "Pelosi and a delegation of representatives met with Mexican President Enrique Peña Nieto, kicking off a three-country tour to discuss security, trade, migration and human rights.", "The delegation also included Democratic Reps. Norma Torres, Lucille Roybal-Allard, Pete Aguilar and Linda Sanchez (Calif.); Beto O'Rourke and Henry Cuellar (Texas); Ruben Gallego (Ariz.); Michelle Lujan Grisham (N.M.); and Republicans Michael Fitzpatrick (Pa.) and Richard Hanna (N.Y.).", "The U.S. delegation will also visit Peru and Chile, two Latin American countries that, along with Mexico, are signatories of the Trans-Pacific Trade Partnership, President Obama's signature trade deal.", "A better version of the photograph was contemporaneously posted to Facebook by U.S. Rep. Henry Cuellar of Texas, who was talking with Nieto at the time the picture was snapped (but was cropped out of the version used in the meme):", "It is true that another drug lord claimed during El Chapo's January 2019 trial that the latter had paid a bribe of $100 million to Nieto, but the alleged bribe was supposed to have been solicited to induce Nieto to call off the authorities' attempts to find and arrest El Chapo, not to \"keep the US/Mexico border open\":", "The former president of Mexico, Enrique Peña Nieto, took a $100 million bribe from Joaquín Guzmán Loera, the infamous crime lord known as El Chapo, according to a witness at Mr. Guzman’s trial.", "The stunning testimony was delivered in a New York courtroom by Alex Cifuentes Villa, a Colombian drug lord who worked closely with Mr. Guzmán from 2007 to 2013, when the kingpin was hiding from the law at a series of remote ranches in the Sierra Madre mountains.", "According to Mr. Cifuentes, Mr. Peña Nieto first reached out to Mr. Guzmán about the time he was elected president in late 2012, asking the drug lord for $250 million in exchange for calling off a nationwide manhunt for him.", "Moreover, the bribe accusation against Nieto as related in court was both unproved and somewhat far-fetched:", "“Did members of the [Nieto] administration take bribes?” says Alejandro Hope, a Mexican security analyst and columnist at the El Universal newspaper. “Yeah maybe. But at the end of the day Guzmán was captured twice, then extradited. So if he did make those bribes they were a very poor investment.”", "Taking handouts from business has become almost expected, especially among members of Peña Nieto’s PRI party, which ruled Mexico for 71 years. Taking a briefcase of cash from the world’s most sought-after drug lord, though, is a brazen, idiotic move, Hope says. You would think someone in that position could at least transfer it through shell companies in the Cayman Islands.", "Finally, O'Rourke did not run a \"$70 million open borders campaign.\" His position on immigration has been to oppose the construction of a border-long wall (of the type U.S. President Donald Trump has called for) as an unnecessary and ineffective measure for improving border security, but not to advocate for \"open borders\":", "Q: Would you accept some compromises here if you want to make changes, including, for instance, funding the president's border wall?", "A: I think this one is going to be on the American people. And I think, when we make the choice clear that we can do the right thing by this country and for those kids, and not do it at the price of a 2,000-mile, 30-foot-high, $30 billion wall; not doing it at the price of deporting people who are seeking asylum, deporting people in some cases back to certain death; not doing it at the cost of ending family migration, which is the story of this country -- certainly of the O'Rourkes -- and millions of families who have fled terror or starvation in their countries to be here. I think the American people are going to force us to do the right thing. That always happens in America. It is frustrating. It's slow. It doesn't happen right away. But, ultimately, we get it right. And I'm confident that the American people this time are going to get it right.", "We already have a border wall that we don't need. Don't need more walls and militarization at a time that the border has never been safer. pic.twitter.com/J6mdMUdyWL", "— Beto O'Rourke (@BetoORourke) April 20, 2017", "Nieto left office in December 2018, and El Chapo was sentenced to life in prison plus 30 years by a U.S. court in July 2019 and is currently serving his sentence at ADX Florence.", "Feuer, Alan.   \"Former Mexican President Peña Nieto Took $100 Million Bribe, Witness at El Chapo Trial Says.\"\r\n    The New York Times.   15 January 2019.", "Phippen, J. Weston.   \"Did Former President Enrique Pena Nieto Take That $100 Million Bribe?'\r\n    Rolling Stone.   16 January 2019.", "Dobuzinskis, Alex.   \"Mexican Drug Lord 'El Chapo' Begins Life Term in Colorado 'Supermax' Prison.\"\r\n    WKZO.   19 July 2019.", "Bernal, Rafael.   \"Pelosi: Mexico Should Not Worry About Trump.\"\r\n    The Hill.   3 May 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]