["About this rating", "It's not clear what exactly the law would require teachers to do. On the one hand, it would require them to \"have the Ten Commandments recited aloud,\" but would also allow them to be \"excused from participating.\"", "The separation of church and state has been the subject of contentious debate in the United States since the country's foundation.", "Proposals to introduce symbols and expressions of Christian faith into public spaces have, in the last few decades, typically come from the Republican side of the aisle. So it was with a certain sense of surprise that news organizations reported in January 2018 that a Mississippi Democrat—State Representative Credell Calhoun—had introduced legislation that would \"require teachers to recite the Ten Commandments every morning,\" as the left-wing web site Think Progress wrote.", "\"In addition to reciting the Ten Commandments at the top of every day,\" Bustle reported, \"teachers would also be required to display the Commandments prominently (at least a poster size of 11x14 inches), along with the U.S. motto 'In God We Trust, in every classroom, school auditorium, and cafeteria.\"", "We received several enquiries from readers about whether Calhoun really was seeking to require public school teachers to read the Ten Commandments aloud each morning.", "The implications of Calhoun's proposal, in that regard, are unclear.", "House Bill 1100, which he introduced in January 2018, would force public school boards in Mississippi to require a period of \"quiet reflection\" in each public school classroom, lasting no more than one minute. Currently, school boards \"may authorize\" such a period, allowing both school boards and schools the freedom to abstain from quiet reflection. Calhoun's bill would change that.", "Strangely, Calhoun has a seemingly competing bill before the Mississippi Legislature, H.B. 783. Unlike H.B. 1100, it would only force school boards to authorize a 60-second period of quiet reflection. We asked the Representative how he reconciled this measure with the more restrictive measure contained in H.B. 1100, but we did not receive a response in time for publication.", "H.B. 1100 would also require public schools to display a copy of the Ten Commandments and the motto \"In God We Trust\" in each classroom, auditorium and cafeteria. Currently, Mississippi public schools are only required to display \"In God We Trust.\"", "Finally, H.B. 1100 also states:", "The school board of each school district shall require the teachers in that school district to have the Ten Commandments recited aloud at the beginning of the first hour of class each day that school is in session.", "However, the bill also appears to give teachers and students an opt-out:", "Any student or teacher who objects to reciting the Ten Commandments must be excused from participating without penalty.", "According to the wording of the legislation, teachers are not explicitly required to recite the Ten Commandments, they are required to \"have the Ten Commandments recited,\" which might suggest that they would be obliged to arrange for a colleague or a student to read aloud or recite the Ten Commandments.", "However, it is conceivable that every available teacher or student could \"object\" to reciting the Ten Commandments, something that the bill itself allows for. We asked Rep. Calhoun how this section of H.B. 1100 could be enforced, if nobody is actually obliged to take part, but we did not receive a response in time for publication.", "Federal courts have repeatedly ruled that the use and display of the phrase \"In God We Trust\" in currency does not violate the Establishment Clause of the First Amendment, the constitutional provision at the heart of the separation of church and state, which reads:", "Congress shall make no law respecting an establishment of religion...", "In the landmark 1970 case Aranow v. United States, the Ninth Circuit Court of Appeals ruled that the inscription of \"In God We Trust\" on U.S. currency did not violate the Establishment Clause, because—in the words of District Judge Bruce Thompson:", "It is quite obvious that the national motto and the slogan on coinage and currency \"In God We Trust\" has nothing whatsoever to do with the establishment of religion. Its use is of a patriotic or ceremonial character and bears no true resemblance to a governmental sponsorship of a religious exercise.", "However, the U.S. Supreme Court has not yet ruled on the constitutionality of displaying \"In God We Trust\" in public schools, specifically.", "By contrast, the court has previously ruled that posting the Ten Commandments in a public school is a violation of the Establishment Clause, and it's questionable whether that section of Calhoun's bill would pass constitutional muster.", "In the 1980 case Stone v. Graham, the court examined a Kentucky state law that required a copy of the Ten Commandments to be posted in every public school classroom.", "The law violated the Establishment Clause, according to the majority opinion, because it had \"no secular legislative purpose.\"", "The section of Calhoun's bill that requires schools to arrange for the Ten Commandments to be read aloud would probably be even more likely to violate the Establishment Clause, since it involves active participation in a uniquely Judeo-Christian ritual, as opposed to the passive display of an object.", "However, its constitutionality would ultimately have to be determined by the courts. House Bills 1100 and 783 had been forwarded to the Mississippi Legislature's Education Committee, as of 25 January 2018.", "Calhoun, Rep. Credell.  \"House Bill 1100.\"\r\n  Mississippi Legislature.  January 2018.", "Mississippi Code of 1972.  \"Title 37, Chapter 13, Section 8 -- Period of Quiet Reflection at Opening of School Day.\"\r\n  State of Mississippi/LexisNexis.  1 July 2001.", "Calhoun, Rep. Credell.  \"House Bill 783.\"\r\n  Mississippi Legislature.  January 2018.", "Mississippi Code of 1972.  \"Title 37, Chapter 13, Section 163 -- Posting or Reading of Historical Documents With Religious References; Display of Motto 'In God We Trust.'\"\r\n  State of Mississippi/LexisNexis.  1 July 2001.", "Roberts, Judge Jack.  \"O'Hair v Blumenthal - Order.\"\r\n  U.S. District Court, Western District of Texas/Leagle.com.  17 April 1978.", "Bea, Judge Carlos T.; Reinhardt, Judge Stephen.  \"Newdow v. Lefevre et al.\"\r\n  United States Court of Appeal for the Ninth Circuit.  11 March 2010.", "Thompson, Judge Bruce.  \"Aronow v United States.\"\r\n  United States Court of Appeal for the Ninth Circuit.  6 October 1970.", "United States Supreme Court.  \"Stone v. Graham.\"\r\n  United States Supreme Court/Legal Information Institute, Cornell Law School.  17 November 1980.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]