["By Vanessa Schipani", "Posted on March 14, 2018", "In observing that “every type of energy has consequences,” Department of Interior Secretary Ryan Zinke claimed the “carbon footprint on wind [energy] is significant.” In fact, wind power’s carbon footprint is among the smallest of any energy source.", "Coal’s carbon footprint is almost 90 times larger than that of wind energy, and the footprint of natural gas is more than 40 times larger, according to the Department of Energy’s National Renewable Energy Laboratory.", "Zinke also said wind energy kills “as many as 750,000 birds a year.” This estimate is high, but not impossible. However, oil fields could kill up to 1 million birds a year, according to the Bureau of Land Management.", "Zinke made his claims in a speech to oil and gas executives during the CERAWeek energy conference in Houston on March 6, according to reporting by Time. We verified his statements using an audio recording of the event sent to us by Time reporter Justin Worland.", "Zinke, March 6: Every type of energy has consequences. … We probably chop up as many as 750,000 birds a year on wind. And the carbon footprint on wind is significant.", "In 2017, wind energy made up about 6.3 percent of the United States’ total electricity generation, according to the Energy Information Administration. That’s compared with about 30 percent each for coal and natural gas and 20 percent for nuclear energy. At 7.5 percent, hydropower contributed the most out of any renewable source. Solar energy made up only 1.3 percent.", "When we contacted the DOI for support for Zinke’s claims, spokeswoman Heather Swift told us by email that, when it comes to wind’s carbon footprint, Zinke “was referring to the life-cycle emissions, manufacturing of materials and component parts, and the transportation and construction of the facilities.”", "It’s true that wind power isn’t a zero emission energy source. Greenhouse gas emissions are produced when wind turbines are manufactured, built, maintained and decommissioned. But the “life cycle greenhouse gas emissions from solar, wind, and nuclear technologies are considerably lower and less variable than emissions from technologies powered by combustion-based natural gas and coal,” says the NREL.", "To be more exact, wind energy produces around 11 grams of carbon dioxide per kilowatt-hour of electricity generated, Garvin A. Heath, a senior scientist at NREL, and colleagues concluded after reviewing the scientific literature. That’s compared with about 980 g CO2/kWh for coal and roughly 465 g CO2/kWh for natural gas, Heath found.", "In other words, coal’s carbon footprint is almost 90 times larger than that of wind. The footprint of natural gas is more than 40 times larger.", "Coal power plants using carbon recapture and storage technology do produce significantly lower emissions than standard coal power plants, though still more than wind power. Just as it sounds, this technology prevents CO2 from being emitted into the atmosphere by capturing it and storing it, often underground.", "Joshua Rhodes, a research associate at the University of Texas, Austin’s Energy Institute, found that, without this technology, coal power plants produce about 870 g CO2/kWh, but with the technology they produce around 156 g CO2/kWh. According to the EIA, there are two coal power plants using this technology in operation in the world – one in Texas and one in Saskatchewan, Canada.", "How did the carbon footprints of plants with carbon recapture technology compare with that of wind?", "Like Heath, Rhodes found that wind power had one of the smallest carbon footprints at 14 g CO2/kWh, second only to nuclear power. That’s a carbon footprint over 11 times smaller than that of coal with carbon capture technology.", "Heath also found nuclear power’s carbon footprint was close to wind’s at 12 g CO2/kWh.", "What about wind compared with other forms of renewable energy?", "Heath and colleagues at the DOE’s Brookhaven National Laboratory found that the footprint of solar power varied from 14 to 45 g CO2/kWh, depending on the type of material used. For example, thin-film solar cells — which can be made into rooftop shingles, glazing for skylights and other building materials — have a smaller carbon footprint than crystalline silicon photovoltaic cells, which are frequently used in commercial energy production.", "Geothermal energy’s footprint was similar to solar’s, ranging from 11.3 to 47 g CO2/kWh, depending on the type of technology used, Heath found. Geothermal energy entails capturing heat from the Earth to turn turbines that generate electricity.", "Heath also told us via email that biopower — which comes from burning organic materials, such as wood, landfill materials or ethanol — had a carbon footprint of about 43 g CO2/kWh.", "On the whole, hydropower and ocean power appear to produce the lowest amount of emissions at 7 and 8 g CO2/kWh, respectively, Heath said. Hydropower is generated from moving water, often from rivers. Ocean power generates electricity from the tides, waves, currents, heat and even salinity of oceans.", "To be clear, all of these figures are median, or midpoint, estimates, among a range of estimates for each type of energy.", "In other words, every single wind turbine, hydroelectric dam or coal plant won’t have the same exact carbon footprint, but the figures cited above can be taken as representative for comparison purposes.", "Wind power, as well as other forms of energy, does take other environmental tolls — a point Zinke also made during the CERAWeek energy conference. He said, “We probably chop up as many as 750,000 birds a year with wind.”", "We wrote about this topic back in 2016, when then presidential candidate Donald Trump claimed wind farms in the U.S. “kill more than 1 million birds a year.”", "In our 2016 article, we pointed out that the highest average estimate is 573,000 bird deaths a year from wind turbines. Gavin Shire, a spokesman for the Fish and Wildlife Service, told us over the phone that the maximum estimate is 679,000 bird deaths.", "However, these numbers are from 2013, which means they may be dated, given increases in wind power since then — a point Shire made and we made in our original piece. So 750,000 bird deaths from wind turbines could be possible today.", "As we also noted back in 2016, the BLM has found that oil fields could be killing up to 1 million birds a year. But even oil fields pale in comparison to domestic cats, which scientists estimate kill billions of birds a year.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]