["Multiple posts on Facebook and Twitter shared thousands of times claim that former US president Ronald Reagan placed a travel ban on Nigeria in 1984, targeting the country’s then military leader Muhammadu Buhari. The posts allege that Donald Trump has now placed a similar ban on Nigeria over Buhari, who was elected president in a democratic ballot in 2015.", "Some of the posts have been archived here, here, here, here, and here.", "Other posts including this one carry misleading headlines alleging that Trump’s visa ban is permanent.", "Another story claims Nigeria was given a two-year notice before the ban became effective -- and the country did nothing. “Diplomatic sources confirmed that the USA government had discussions with Abuja for two years over passport control, issuance and security around immigration,” the post reads. “Six months ago, it told our diplomats in the US that it was going to ban us, we did nothing!”", "On January 31, the United States confirmed it would extend an existing visa ban to six new countries including Nigeria, as AFP reported here. The restrictions are set to come into force on February 22. The White House said the measure was partly aimed at fighting the “terrorism threat” in west Africa.", "The news sparked outrage and disappointment among Nigerians. The leading opposition party blamed the Buhari administration for the ban while former presidential candidate Atiku Abubakar, who lost to Buhari in 2019 polls, asked Trump not to punish Nigerians for the failure of the country’s government.", "AFP found no evidence of Reagan placing a visa ban on Nigeria in 1984 or at any time during his administration. According to the CATO institute, a US-based public policy research organisation, Reagan partially banned about 10.2 million people from Cuba in 1986.", "However, in 1993, then US president Bill Clinton placed a visa ban on the ruling military and their families for impeding the country’s transition to democracy. The ban only affected a few Nigerians.", "The claim that the United States had already informed Nigeria about the banning plans two years ago is misleading.  A White House statement released on January 31, 2020, said the United States in 2019 notified all governments except Iran, Syria and North Korea about the possibility of a visa ban if some issues were not addressed.", "“The process began on March 11, 2019, when the United States Government formally notified all foreign governments (except for Iran, Syria, and North Korea) about the refined performance metrics for the identity-management and information-sharing criteria,” the statement read.", "According to the Trump administration, Nigeria was banned because the country “does not comply with the established identity-management and information-sharing criteria”, and does not “adequately share public-safety and terrorism-related information”.", "The White House added that Nigeria “also presents a high risk, relative to other countries in the world, of terrorist travel to the United States”.", "Based on the criteria above, the US said that “entry into the United States of nationals of Nigeria as immigrants... is hereby suspended”. It added the ban could be lifted if “those countries address their identified deficiencies”.", "US Secretary of State Mike Pompeo, said Tuesday he was  “optimistic” the ban would be lifted, as AFP reported.", "The ban does not affect non-immigrant visa classes like business, tourism and study visas.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]