["About this rating", "Four United States soldiers were killed, two were wounded, and five Nigerien soldiers were killed during an ambush by Islamic militants on American and Nigerien troops near the Niger-Mali border on 4 October 2017, in an incident most Americans — including high-ranking government officials — still knew little about, two weeks after it occurred. The paucity of details about the attack prompted critics such as Sen. John McCain of Arizona to complain that Trump administration officials were not being forthcoming with the facts.", "Some, citing incomplete and conflicting accounts of how the attack unfolded and the twelve-day delay between the deaths of the U.S. soldiers and any acknowledgment by President Trump that the incident had even occurred (and who also had questions about the nature of the U.S. military's mission in Niger), even suggested that the administration might be trying to cover up a debacle they said could be worse than the deadly 2012 attack by militants on U.S. diplomatic facilities in Benghazi, Libya.", "\"This might wind up to be Mr. Trump's Benghazi,\" said Rep. Frederica Wilson (D-Florida) during a CNN interview in which she questioned the administration's competence:", "Rep. Wilson: \"This might wind up to be Mr. Trump's Benghazi\" https://t.co/A76lwYRs8S https://t.co/sy7irBTEf8", "— CNN Politics (@CNNPolitics) October 18, 2017", "A widely shared Facebook post and threaded tweet circulating in mid-October (in some cases falsely attributed to journalist Dan Rather) described Niger as \"Benghazi on steroids\":", "While everyone is so busy talking about Trump's handling of his call to the widow of the soldier killed in Niger, you're all missing the important part of that story — the part about what happened that night in Niger.", "The story that is emerging is so much worse than anything that happened in Benghazi, but the same GOP Congress that investigated Benghazi with a fury seems to have little or no interest in this story.", "Here's what we know so far:", "These soldiers went to a meeting in an area near the border with Mali. This is a well known hot spot for ISIS activity.", "Our soldiers were not backed up by US Military air support. No, they were backed up by the French, who were not authorized to intervene or even fire a shot.", "Our soldiers did not have armored vehicles. They traveled in pickup trucks.", "Our soldiers were given faulty intel that said \"it was unlikely that they would meet any hostile forces.\" Of course, they walked into an ISIS ambush. It was chaotic and they took three casualties.", "It took the French 30 minutes to arrive. When they did, they were not authorized to help. So, a dozen of our Green Berets fought a battle with more than 50 ISIS fighters, without help, for 30 minutes.", "Finally, a rescue helicopter arrived, but it was not a US military helicopter. No, we apparently outsourced that job to “private contractors.” So, these contractors landed and loaded the remaining troops, the injured and the dead.", "Here's where this gets really bad ....", "Because they were not military, they never did a head count. That is how Sgt. La David Johnson was left behind.", "That's right .... they left him behind.", "According to the Pentagon, his locator beacon was activated on the battlefield, which indicates that he was alive when they left him there.", "They recovered his body 48 hours later, but are refusing to say where. According to his widow, she was told that she could not have an open casket funeral. This indicates that he was mutilated after being left behind on the battlefield.", "This is what led to the nonsense we're obsessing over. This is the real story. As usual, you're allowing it to be about Trump's distraction, but this is Benghazi on steroids.", "The Trump Pentagon gave these men bad intel, no support, outsourced rescue people and then tried for more than a week to pretend it never happened.", "In that time, Trump spoke on many occasions and never mentioned it. He tweeted attacks on many but never mentioned these men.", "Only after pressure from the media has he bothered to even acknowledge these men and their service", "Please share, copy and paste.\n#Niger #Benghazi #Outrage #Veterans #DonaldTrump #Pentagon", "Parenthetically, another highly politicized screed capitalizing on how little information there was about the incident appeared on the left-leaning conspiracist web site Palmer Report, which went so far as to speculate — on the basis of no real evidence whatsoever — that the true explanation for Trump's seeming resistance to acknowledging the Niger attack was that United States troops had actually been involved in a secret Russian-controlled military operation, personally approved by the president:", "Follow the timeline: on August 10th, the governments of Niger and Russia signed a military cooperation deal. The press release from Russian news agency TASS described it as being a vaguely defined anti-terrorism partnership (link), but in real world terms, the deal was almost certainly about the exploding oil production in Niger. It’s roughly the same kind of arrangement which Russia has long had with the Syrian government: Russia provides military protection in order to help keep the current regime in power, and in return, the regime sells cheap oil back to Russia. Just seven weeks after the deal was signed, as Russia was moving in to set up shop in Niger, four U.S. soldiers were suddenly killed there.", "Even setting aside Donald Trump's personal allegiance to Russian President Vladimir Putin, from a purely tactical standpoint, there is zero chance that the United States would have been running its own military op inside Niger while Russia was moving in to set up shop. The only logically possible explanation is that the U.S. secretly sent troops to help the Russian military with its efforts in Niger. In other words, those four U.S. soldiers were participating in some kind of Russian military op — and it only became public once they died.", "But apart from the fact that Russia did sign a vaguely-defined \"military-technical agreement\" with Niger on 22 August 2017 (the same day they signed one with Niger's West Africa neighbor, Nigeria), the web site's claim that U.S. troops could only have been sent \"to help the Russian military\" is counterfactual.", "Far from being deployed as an adjunct to the Russian military, at least 800 U.S. soldiers have been in Niger on an ongoing basis since 2011 to \"advise and assist\" in that country's fight against terrorism. President Donald Trump didn't send the troops there; President Barack Obama did. Moreover, air support for the troops attacked in Niger wasn't provided in the form of Russian-flown aircraft (as one would expect if it were a Russian operation), but by the French, whose fighter jets and helicopters were called in after the ambush started. We have seen no reliable reports of any Russian military presence at all in the area.", "'Worse than Benghazi'?", "Circling back to the \"Benghazi on steroids\" scenario, what follows is a fact-check of the individual claims based on the limited information thus far provided by U.S. military officials and in national press coverage as of 29 November 2017.", "Claim: \"These soldiers went to a meeting in an area near the border with Mali. This is a well known hot spot for ISIS activity.\"", "Status: Mixture. A team consisting of 12 U.S. military personnel (an unspecified number of whom were Green Berets) and 30 Nigerien soldiers attended a meeting with local leaders in the southwestern Niger village of Tongo Tongo near the Mali border, and had just departed from that meeting when the ambush occurred. Although two known terrorist groups, al-Qaeda and the Islamic State, have training camps in neighboring Mali, the question of whether Tongo Tongo and the surrounding area is accurately described to as a \"hot spot\" of ISIS activity may boil down to semantics. U.S. Joint Chiefs of Staff Chairman Gen. Joseph Dunford said in a 23 October press conference that the area is \"inherently dangerous\" given that those two groups operate there, but according to the Pentagon's Joint Staff director Lt. Gen. Kenneth McKenzie, U.S. special forces had conducted 29 patrols in the area during the six months prior to the ambush without once encountering hostile fighters.", "Contact did occur in this instance, however, with some fifty militants believed to be members of the Islamic State in the Greater Sahara. The Pentagon described the attackers as \"well-equipped and trained\" with small arms, machine guns, and rocket-propelled grenades. They ambushed the U.S. and Niger troops just after they left the village where the meeting took place. (According to a 20 October report from UPI, American officials suspect the insurgents may have been helped by villagers who purposely delayed the troops' departure from Tongo Tongo; a 21 October Voice of America article said a \"fake terror attack\" was staged outside the village to lure the soldiers into a trap, although the Pentagon has not confirmed these details directly.)", "Claim: \"Our soldiers were not backed up by U.S. military air support. No, they were backed up by the French, who were not authorized to intervene or even fire a shot.\"", "Status: Mixture. Inasmuch as contact with the enemy was thought unlikely, U.S. air support was not planned for this mission. An hour after the attack began, French air support was indeed called in, arriving within 60 minutes in the form of fighter aircraft, armed fighter aircraft, armed helicopter gunships, and a medevac helicopter. However, the French never actually fired on the hostile forces, for which conflicting explanations have been given. Multiple U.S. officials told CNN, for example, that Niger forbids air strikes on its soil, so they were not authorized to engage; Reuters reported being told, on the other hand, that \"the firefight was at such close quarters that the planes could not engage and were instead left circling overhead as a deterrent.\"", "According to a 20 October update from CNN, the latter explanation proved closer to the truth:", "CNN previously reported that the French Mirage jets that arrived overhead within 30 minutes of the firefight to fly low passes in an attempt to disperse the attackers did not have permission to drop bombs.", "But on Friday, US officials said that French jets did have authority to bomb but did not because pilots could not readily identify enemy forces in this firefight and did not want to risk hitting US and Nigerien troops.", "Claim: \"Our soldiers did not have armored vehicles. They traveled in pickup trucks.\"", "Status: True. Every account we've seen says the soldiers were traveling in unarmored non-military vehicles.", "Claim: \"Our soldiers were given faulty intel that said 'it was unlikely that they would meet any hostile forces.' Of course, they walked into an ISIS ambush.\"", "Status: Mixture. U.S. Defense Secretary Jim Mattis did state in a 19 October press conference that \"contact [with militants] was considered unlikely.\" As noted above, no hostile forces had been encountered in the area during the six months prior to the attack, according to the Pentagon. But although the judgment that U.S. troops were given \"faulty intel\" would seem premature based on those considerations, an unnamed senior congressional aide allegedly briefed on the events told NBC News the ambush was the result of a \"massive intelligence failure.\"", "Claim: \"Finally, a rescue helicopter arrived, but it was not a US military helicopter. No, we apparently outsourced that job to 'private contractors.' So, these contractors landed and loaded the remaining troops, the injured and the dead.\"", "Status: Mixture. There have been conflicting reports about whose aircraft transported whom. Sec. Mattis stated in his 19 October press conference that a French medevac helicopter picked up the wounded, and those killed in action were transported in a contractor's helicopter, but according to a 20 October report in the Washington Post, all rescue and transport services were provided by a private company, Berry Aviation. On 23 October, Gen. Dunford confirmed Sec. Mattis's version of events, however, stating that the two wounded U.S. soldiers were evacuated in French helicopters, which he said was \"consistent with the casualty evacuation plan that was in place for this particular operation.\"", "Claim: \"Because they were not military, they never did a head count. That is how Sgt. La David Johnson was left behind. That's right .... they left him behind. According to the Pentagon, his locator beacon was activated on the battlefield, which indicates that he was alive when they left him there. They recovered his body 48 hours later, but are refusing to say where.\"", "Status: Mixture. This is one of the more perplexing components of the incident, given that the Pentagon initially reported on 5 October that only three U.S. soldiers and one Nigerien had been killed in the attack:", "Three U.S. service members and one partner nation member were killed, and two U.S. service members wounded while conducting an advise and assist mission in Niger yesterday, Pentagon officials announced in a news conference today.", "No mention was made of U.S. personnel missing or unaccounted for.", "According to a timeline of events published by CNN, the first time the Pentagon mentioned the missing Green Berets, Sgt. La David Johnson, was on the afternoon of 6 October:", "11:49 a.m. The Pentagon identifies three soldiers who were killed in Niger: Staff Sgt. Bryan C. Black of Washington state, Staff Sgt. Jeremiah W. Johnson of Ohio, and Staff Sgt. Dustin M. Wright of Georgia. Notably, they did not identify Sgt. La David T. Johnson of Florida, who had been unaccounted for.", "3:00 p.m. Multiple US officials tell CNN the body of a US service member who went missing following a deadly ambush Wednesday in southwest Niger has been recovered. The soldier was later identified as Johnson. The discovery of the missing US service member in a remote area of the northwestern African country by Nigerien troops came nearly 48 hours after he was first discovered to be missing in the wake of the attack.", "A press release issued that day by U.S. Africa Command (Africom) gave more detail on the recovery of the missing soldier:", "Two days after DoD notified the public about the three deaths in Niger, [Army Col. Mark R.] Cheadle said that Nigerien security forces found the body of the fourth U.S. service member.", "A joint patrol of about 40 soldiers searched for the soldier, who at the time was thought to be missing, until his body was found by the Nigerians, Cheadle said, adding that there was a full-court press by all of DoD, the Nigerian government, the State Department and the French allies to help recover the lost soldier.", "When they found the soldier’s body, Cheadle said, “they were fully aware of the need to honor [him] and they transported the body to a location far away from the attack, where our special operations forces met them.”", "He added, “And I watched this myself. I watched the brothers carry the fallen soldier to the aircraft and watched it take him away to Niamey, the capital, where [he] was identified.”", "The fourth fallen soldier’s name will be released after next of kin notification procedures are complete, DoD officials said.", "Cheadle said they don’t know where the soldier’s vehicle was hit or where he came under fire.", "Despite the fact that Johnson hadn't previously been reported missing, DoD officials vehemently denied he had been \"left behind.\" During his 19 October press conference, Sec. Mattis stressed:", "One point I would make having seen some of the news reports — the U.S. military does not leave its troops behind, and I would just ask that you not question the actions of the troops who were caught in the firefight and question whether or not they did everything they could in order to bring everyone out at once.", "Lt. Gen. McKenzie said U.S. forces \"never left the battlefield\" until Sgt. Johnson's body was found:", "I'll just amplify a little bit, the comment about leaving someone behind.  The secretary talked a little bit about it earlier this afternoon, and he expressed out position pretty clearly on it, but let me just give you a little bit of detail.", "And this is about as much detail as I'm going to be able to give you, given the fact that there's an investigation ongoing first, and second, we never want to share our tactics, techniques and procedures where the enemy can learn about the way we approach these problems.", "But I'll tell you categorically, that from the moment of contact no one was left behind.  Either U.S., our partner and Nigerian forces, our French forces were on the ground, actively searching for this soldier.", "Now the fact of the matter is, it's a battlefield, we just had a significant engagement, it’s tough country, and it's out in the middle of nowhere.  So, it's not perhaps as clear as it might appear in the bright lights of this briefing room, but we spent a lot of the — a lot of men and a lot of women searched very hard to find him.", "It took us a little while to do that, we didn't leave him behind and we searched until we found him, and we brought him home.", "According to Gen. Dunford, Africom didn't initially publicize the fact that Sgt. Johnson was missing so as not to compromise the search-and-rescue effort. A 20 October CNN report said Sgt. Johnson's body was found nearly a mile from the scene of the ambush. No information has yet been provided about the circumstances of his death.", "As to the claim that no head count was conducted, therefore no one knew until the evacuation was over that Johnson was missing, no information has been released or reported confirming that. In answer to a question about whether or not head counts were taken, Gen. Dunford said during his 23 October press conference:", "I don't have that level of detail in terms of who counted. I know what the procedures would normally be. I can't tell you if those procedures were followed at that particular time. Again, that will be something that will come out in the investigation.", "Regarding reports of a tracking beacon which may have indicated Sgt. Johnson was still alive, a CBS Evening News report on 19 October said:", "After the bodies of three American soldiers were brought out, Pentagon officials believed that Sgt. La David Johnson was still alive somewhere on the battlefield. For several hours, they tracked a locator beacon, which then became intermittent and finally faded out. By the time they found him two days later he was dead...", "But CNN reported that as of 20 October 2017, officials still did not know whether the beacon had actually been in Johnson's possession or whether it was elsewhere, perhaps attached to one of the vehicles.", "Claim: \"According to his widow, she was told that she could not have an open-casket funeral. This indicates that he was mutilated after being left behind on the battlefield.\"", "Status: Mixture. The report that Sgt. Johnson's widow, Myeshia Johnson, was told she wouldn't be able to hold an open-casket funeral for her husband originated from Rep. Frederica Wilson (D-Florida), who was also the source of the revelation that President Trump told Mrs. Johnson during his bereavement call to her (which Wilson was party to via speakerphone) that her husband \"knew what he signed up for.\"", "Regarding Johnson's funeral, Wilson told CNN: \"She was just told that he cannot have an open casket funeral, which gives her all kinds of nightmares how his body must look, how his face must look.\"", "When Joint Chiefs of Staff Chairman Dunford was quizzed about this claim on 23 October (two days after Sgt. Johnson's funeral), he said:", "What typically happens, and again, I've been involved in these cases myself, is there are times when we make a suggestion to the family that they may not want to review the remains. At the end of the day, the policy is it's the family's decision as to whether or not they do that. So I can tell you what the policy is. I don't know what happened in the case of Mrs. Johnson, but we'll certainly find that out.", "During a 23 October interview with ABC News, Myeshia Johnson confirmed certain statements previously made by Rep. Wilson, including the claim that she was told her husband couldn't be laid to rest in an open-casket funeral. In fact, Johnson said, neither she nor other family members were allowed to see or identify Sgt. Johnson's body at all:", "They told me that he’s in a severe, a severe wrap like I won’t be able to see him. I need to see him so I will know that that is my husband. I don't know nothing they won’t show me a finger, a hand. I know my husband’s body from head to toe. And they won’t let me see anything. I don’t know what’s in that box, it could be empty for all I know. But I need, I need to see my husband. I haven’t seen him since he came home.", "As of 10 November, the military's investigation was still underway and officials had released no further details about the circumstances of Sgt. Johnson's death, but the Washington Post reported that two Tongo Tongo villagers credited with finding the remains said it appeared he may have been executed:", "The body of Sgt. La David Johnson, one of four U.S. soldiers killed in an ambush by Islamist militants in Niger last month, was found with his arms tied and a gaping wound at the back of his head, according to two villagers, suggesting that he may have been captured and then executed.", "Adamou Boubacar, a 23-year-old farmer and trader, said some children tending cattle found the remains of the soldier Oct. 6, two days after the attack outside the remote Niger village of Tongo Tongo, which also left five Nigerien soldiers dead. The children notified him.", "When Boubacar went to the location, a bushy area roughly a mile from the ambush site, he saw Johnson’s body lying face down, he said. The back of his head had been smashed by something, possibly a bullet, said Boubacar. The soldier’s wrists were bound with rope, he said, raising the possibility that the militants — whom the Pentagon suspects were affiliated with the Islamic State — seized Johnson during the firefight and held him captive.", "The Post also cited an anonymous military official who confirmed that Sgt. Johnson's body appeared to have been \"viciously battered,\" though the official said his hands were not tied. The Post's source \"cautioned against reaching any conclusions until the probe is completed.\"", "On 21 November, a press release from Pentagon spokeswoman Dana W. White said tests showed that additional human remains investigators found at the site where the body was recovered were Johnson's.", "A 17 December 2017 Associated Press report citing anonymous U.S. officials said the still-yet-to-be-released military investigation had found that Sgt. Johnson was neither bound, nor taken prisoner, nor shot at close range:", "An American soldier killed in an ambush in Niger with three comrades but recovered days later wasn’t captured alive by the enemy or executed at close range, The Associated Press has learned, based on the conclusion of a military investigation. It found evidence he apparently fought to the end.", "Dispelling a swirl of rumors about how Sgt. La David T. Johnson, 25, of Miami Gardens, Florida, died, the report has determined that he was killed by enemy rifle and machine gun fire as he fled the attack by an offshoot of the Islamic State group about 120 miles (200 kilometers) north of Niamey, the capital of the African country.", "Claim: The Niger ambush and the Trump administration's handling of it amount to \"Benghazi on steroids.\"", "Status: Undetermined. With so many details still unknown, questions unanswered, and the Pentagon's own investigation into the attack still underway, it seems premature, as of this writing, to liken the Niger incident to the 2012 Benghazi attacks, which were used as a launchpad for partisan accusations of malfeasance on the part of the Obama administration and minutely dissected in a series of dozens of separate Congressional hearings which ultimately came to the conclusion, essentially, that mistakes were made.", "Stay tuned.", "Barajas, Joshua.  \"Top U.S. General Says Families, Americans Deserve Answers on Niger Ambush.\"\r\n  PBS News Hour.   23 October 2017.", "Browne, Ryan and Starr, Barbara.  \"New Details on Deadly Ambush in Niger that Left 4 Solders Dead.\"\r\n  CNN.  10 October 2017.", "Dilanian, Ken and Kube, Courtney.  \"Niger Ambush Came After 'Massive Intelligence Failure,' Source Says.\"\r\n  NBC News.  21 October 2017.", "Erickson, Amanda.  \"Everything We Know About the Niger Attack that Left 4 U.S. Soldiers Dead.\"\r\n  The Washington Post.  20 October 2017.", "Fall, Idrissa and Bagassi, Koura.  \"New Details Emerge About Attack that Killed U.S. Soldiers in Niger.\"\r\n  Voice of America.  21 October 2017.", "Garamone, Jim.  \"Three U.S. Troops Killed, Two Wounded in Niger.\"\r\n  U.S. Dept. of Defense.  5 October 2017.", "Haltiwanger, John.  \"Is Niger Trump's Benghazi? Four U.S. Soldiers Died and It Took Him 12 ays to Respond.\"\r\n  Newsweek.  18 October 2017.", "Keller, Jared.  \"Niger: The Quiet War on Terror Americans Rarely Hear About.\"\r\n  Task and Purpose.  5 October 2017.", "LaPorta, James.  \"Locals May Have Helped Islamic State Ambush Green Berets in Niger.\"\r\n  UPI.  20 October 2017.", "Lewis, David and Bavier, Joe.  \"U.S. Deaths in Niger Highlight Africa Military Mission Creep.\"\r\n  Reuters.  6 October 2017.", "Merica, Dan.  \"A Timeline of the White House After the Niger Raid.\"\r\n  CNN.  20 October 2017.", "Palmer, Bill.  \"The Real Reason Donald Trump Wouldn't Acknowledge U.S. Soldiers Killed in Niger: It Was a Russian Military Op.\"\r\n  Palmer Report.  18 October 2017.", "Phillips, Kristine, du Lac, J. Freedom, and Siegel, Rachel.  \"Gold Star Widow Myeshia Johnson Said Trump Stumbled Recalling Her Husband's Name.\"\r\n  The Washington Post.  23 October 2017.", "Raghavan, Sudarsan.  \"U.S. Soldier in Niger Ambush Was Bound and Apparently Executed, Villagers Say.\"\r\n  The Washington Post.  10 November 2017.", "Starr, Barbara and Cohen, Zachary.  \"Missing Soldier Found Nearly a Mile from Niger Ambush, Officials Say.\"\r\n  CNN.  21 October 2017.", "BBC.  \"Benghazi U.S. Consulate Attack: Timeline.\"\r\n  16 November 2012.", "U.S. Dept. of Defense.  \"Department of Defense Press Briefing by Pentagon Chief Spokesperson Dana W. White and Joint Staff Director Lt. Gen. Kenneth F. McKenzie Jr. in the Pentagon Briefing Room.\"\r\n  19 October 2017.", "U.S. Dept. of Defense.  \"Remarks by Secretary of Defense Jim Mattis and His Excellency Avigdor Lieberman, Minister of Defense of Israel, During an Honor Cordon at the Pentagon.\"\r\n  19 October 2017.", "U.S. Dept. of Defense.  \"Statement by Chief Spokesperson Dana W. White on Additional Remains Found in Niger.\"\r\n  21 November 2017.", "Updated [23 October 2017]: Added details and clarifications per U.S. Joint Chiefs of Staff Chairman Joseph Dunford's 23 October televised press conference.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]