["By Angelo Fichera", "Posted on March 24, 2020 | Updated on July 14, 2020", "Update, July 14: This story was published before the Centers for Disease Control and Prevention began advising people to wear face coverings in public settings. Many states now have laws mandating masks in public settings. Our most recent coverage on COVID-19 can be found here. We have updated the Quick Take. The original story is as follows.", "As the health care system in the U.S. faces shortages of face masks and other protective gear for workers fighting the novel coronavirus pandemic, some Facebook posts are sending the wrong message by claiming that wearing a face mask is now a requirement for everyone.", "The posts falsely claim that “everyone is required to wear mask everywhere,” because “COVID-19” — the disease caused by the virus — “is confirmed as airborne and remain 8 hrs in air!”", "The U.S. Centers for Disease Control and Prevention does not recommend face masks for healthy people, but says they should be worn “by people who have COVID-19 and are showing symptoms.” It notes that the “use of facemasks also is crucial for health workers and other people who are taking care of someone infected with COVID-19 in close settings (at home or in a health care facility).”", "So there’s no requirement that “everyone” wear a mask at all times.", "The Facebook posts further leave a misleading impression when saying the coronavirus (formally known as SARS-CoV-2) is “airborne and remain 8 hrs in air!” The term “airborne,” we note, is used differently by different people and is the subject of some debate.", "Public health officials have thus far said they do not believe the virus is widely spread through the air. But new studies suggest air transmission could be a factor, especially in health care settings.", "A study published March 17 in the New England Journal of Medicine called aerosol transmission “plausible.” The study involved an experiment using a nebulizer to show that the virus “remained viable in aerosols” for up to three hours. The term “aerosol” refers to virus particles being suspended in the air; more on that shortly.", "But, importantly, the study estimated that the virus had a half-life of approximately 1.1 to 1.2 hours in aerosols — meaning half of the viral particles were no longer infectious after a little over an hour.", "The amount of virus projected into the air would affect the total time that some of it remains infectious, according to Dylan Morris, a Princeton University researcher and co-author of the study. Certain conditions, such as humidity, could also affect how long it remains infectious.", "The Facebook posts, however, leave the unfounded impression that the virus is infectious in the air for “8 hrs.” A CNBC article referenced in the posts does not claim as much.", "Morris told us by email that “the ‘airborne’ question bedevils scientists trying to communicate with the public. It combines a locus of substantial public fear with a question of true scientific nuance — a recipe for a misinformation mess.”", "“Many viruses — from measles to flu, and including SARS-CoV-2 — are ‘airborne’ in the sense that one way of getting sick is to inhale virus particles (‘virions’) sneezed or coughed into the air within respiratory secretions,” he said. Some secretions are bigger (often called “droplets”) and some smaller (thought of as “aerosols”), he said, though there’s a spectrum.", "“The tricky crux of the matter is that when people say ‘airborne’, what they often mean is ‘you’re at risk from virus particles hanging in the air — or being kicked back up into the air after falling to the ground — long, long after an infectious person sneezed them out,'” he said. “That’s much more of a risk for smaller, ‘aerosol’-end-of-the-spectrum secretions. And it turns out that it’s more of a risk for some viruses than for others.”", "Measles is very airborne, he said, but the flu is less so — “even though both measles and flu can in principle be found both in aerosol-like and in droplet-like secretions. So far, scientists mainly think COVID looks more like flu” in that way.", "Linsey Marr, a professor of civil and environmental engineering at Virginia Tech who studies airborne disease transmission, said we don’t have enough evidence of how exactly the coronavirus is being spread between people.", "“We do know transmission is much more likely if you’re close to someone who’s sick,” Marr said. In terms of the virus being potentially transmitted in the air, she uses the analogy of being directly next to someone smoking a cigarette; the farther away you are from someone releasing the virus into the air, the lesser the concentration.", "“The ‘airborne’ term scares people — they envision this cloud of viruses that roams around the neighborhood that can infect them,” she said. “The important thing [to know] is that virus released in the air from a patient is usually quickly diluted unless you’re in a really small space.” And over time, the “level of risk becomes much, much lower.”", "Marr added that larger droplets could also land on the floor or a desk, surfaces which people may touch and then touch their faces or mouths — also putting them at risk of infection. That’s why public health officials stress frequent hand-washing.", "And while the Facebook posts suggest the “airborne” factor necessitates the healthy public at large (“everyone”) wear masks “everywhere,” experts say it’s health care workers who truly need them most.", "“Where nobody disagrees is that there are frighteningly plausible aerosol transmission risks in hospital settings, since medical procedures involved in treating COVID can produce aerosols,” Morris said. “This is a major reason why hospitals are in such critical need of appropriate protective equipment for frontline healthcare workers (e.g. N95 masks).”", "Marr, too, said the limited supply is most needed by health care workers.", "“If there is a shortage of masks, which is the case here, then they should be reserved for health care workers,” she said. “Even coughing, breathing and talking can generate aerosols,” she said, so “health care workers close to patients … should be wearing proper respiratory protection.”", "Morris suggests that members of the public, some of whom could be infected but not show symptoms, can follow online tutorials to create their own surgical masks — covering the nose and mouth — to wear in public settings, like the grocery store. While such masks don’t prevent the person wearing it from becoming infected, they can help those who are unknowingly sick avoid inadvertently contaminating the environment.", "In short, there is emerging evidence that the virus may be “airborne,” but that term requires context and experts say the primary concern is direct contact with people infected with the disease. And the idea that the virus remains infectious in the air for “8 hrs” is not supported — and there’s no requirement that people wear masks at all times.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Brosseau, Lisa. “COMMENTARY: COVID-19 transmission messages should hinge on science.” Center for Infectious Disease Research and Policy, University of Minnesota. 16 Mar 2020.", "“Frequently Asked Questions | Coronavirus Disease 2019 (COVID-19).” U.S. Centers for Disease Control and Prevention. Accessed 23 Mar 2020.", "Khamsi, Roxanne. “They Say Coronavirus Isn’t Airborne—but It’s Definitely Borne By Air.” Wired. 14 Mar 2020.", "Marr, Linsey. Professor of civil and environmental engineering, Virginia Polytechnic Institute and State University. Phone interview with FactCheck.org. 23 Mar 2020.", "Morris, Dylan H., Ph. D. candidate in ecology & evolutionary biology, Princeton University. Email to FactCheck.org. 23 Mar 2020.", "“Q&A on coronaviruses (COVID-19).” World Health Organization. 9 Mar 2020.", "Van Doremalen, Neeltje, et. al. “Aerosol and Surface Stability of SARS-CoV-2 as Compared with SARS-CoV-1.” New England Journal of Medicine. 17 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]