["About this rating", "On 4 June 2019, a video supposedly showing a man leaving his family behind as an avalanche crashed down a mountain toward a ski resort went viral on social media:", "Me watching a bad situation and doing nothing till the final hour: pic.twitter.com/C4HC58sD7y", "— Sgogwana (@zama_mdluli) June 4, 2019", "This video quickly racked up millions of views, and many social media users appeared to believe that they had just witnessed a real near-death moment. A number of people also chimed in to chastise the father for leaving his wife and children behind as the avalanche crashed down.", "Here's an excerpt from an article published by Barstool Sports: \"This father should absolutely be beaten to within an inch of his life. After that, he should be nursed back to health and beaten again. It’s one thing to make a mistake and think that a f*cking avalanche will just be goofin down the mountain and that there’s nothing to worry about. It’s an entirely different thing to see said avalanche barreling toward your family full of small children and to run out of the way without grabbing your kids because you’re the biggest baby-backed bitch the world has ever known.\"", "This video does not show a real-world incident. It is a scene from the 2014 Swedish film Force Majeure, which deals with the aftermath of this man's decision to abandon his family during a moment of danger.", "A synopsis of Force Majeure describes \"A man's selfish reaction to the danger posed by an avalanche causes cracks in his marriage and relationships with his children.\"", "Here's a higher-quality version of the scene:", "The avalanche scene can also be glimpsed in the official trailer for Force Majeure:", "Barstool Sports.   \"World's Worst Father Nearly Lets His Entire Family Die By Avalanche During Dinner.\"\r\n    4 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]