["About this rating", "Images of vintage print advertisements are often met with skepticism, as they frequently embody messaging that doesn't sync up with modern modern social beliefs and viewpoints. This quality has made such ads a favorite template for the digital image editing crowd, who have found humor in swapping out one product for another in decades-old promotional material, making it all the more difficult for viewers to determine whether a given image is real or fake.", "A magazine spread promoting guns for the entire family, for instance, is real. But a pictorial touting the benefits of consuming full sticks of butter? Nope, that's fake.", "So what about an advertisement that seemingly promotes selling beer to children? A purported image of a vintage Heineken ad featuring a depiction a baby drinking from a bottle of beer was posted to Twitter by the \"History Lovers Club\" account in May 2018:", "Thankfully, this is not a genuine old Heineken ad.", "This piece of artwork was a digital manipulation created for a Photoshop contest hosted by the web site Worth1000 (now part of Design Crowd.", "The version of the image seen above was cropped to remove Worth1000's watermark (the remnants of which can still be glimpsed in the bottom-left hand corner), but we did find an uncropped version which clearly shows the Worth1000.com logo:", "A reverse image search traced this fake advertisement to Worth1000's 10th \"Vintage Ad\" contest in 2011, which instructed contestants to \"take modern products and display them in a vintage light through advertisements.\"", "Although modern audiences would find the prospect of advertising beer for babies to be unimaginable, the original ad on which the Heineken spoof was based would probably be met with nearly as much dismay: a 1950s-era magazine spread for 7-Up soda, created to appeal to young consumers.", "The following images come from the September 1955 and November 1956 issues of LIFE magazine:", "Yes, 7-Up was truly advertised as a healthy product for babies in the 1950s. The copy for the image on the left even suggested that mothers mix the soda with milk for a \"wholesome combination\":", "This young man is 11 months old — and he isn't our youngest customer by any means.", "For 7-Up is so pure, so wholesome, you can even give it to babies and feel good about it. Look at the back of a 7-Up bottle. Notice that all our ingredients are listed. (That isn't required of soft drinks, you know — but we're proud to do it and we think you're pleased that we do.) By the way, Mom, when it comes to toddlers — if they like to be coaxed to drink their milk, try this: Add 7-Up to the milk in equal parts, pouring the 7-Up gently into the milk. It's a wholesome combination — and it works! Make 7Up your family drink. You like it ... it likes you!", "Parekh, Rupal.   \"REWIND: '50S Era 7UP Campaign Depicted Soda-Guzzling Babies.\"\r\n    Ad Age.   27 August 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]