["“After seeing the mob’s true intention during the #2020Riots I don’t ever want to hear the question, ‘why does anyone need a high capacity magazine?’ ever again in the U.S.,” said a Facebook post shared 1,200 times since May 31, 2020, the day protests erupted across the United States after the death of Floyd, a black man.", "Below the caption, the post features a screenshot of a tweet -- which contains strong language -- from suspended Twitter account @ANTIFA_US, encouraging “comrades” to “move into the residential areas... The white hoods…. and take back what’s ours.”", "Various Facebook pages and individual accounts, as well as Instagram accounts, shared screenshots of the same tweet starting on May 31.", "However, the Twitter account behind it is unrelated to Antifa, short for anti-fascist, a leftist political movement that aims to suppress expressions of fascism, both by monitoring far-right organizations online and through actions including protests by autonomous groups.", "The account @ANTIFA_US is linked to members of a white nationalist group, Identity Evropa, according to Katie Rosborough a Twitter spokeswoman, who said by email that other fake accounts tied to the group were also suspended this week, most of which were focused on hateful conduct around issues of race, religion, and sexual orientation.", "“We took action after the account sent a Tweet inciting violence and broke the Twitter rules,” Rosborough said. Specifically, the account violated the platform’s manipulation and spam policy around the creation of fake accounts.", "Mark Bray, a historian at Rutgers university and author of “Antifa: An Anti Fascist Handbook,” told AFP by phone that the account was clearly fake because “the kind of language and values that it promotes are antithetical to what anti-fascists say and do.”", "Bray added that several legitimate Antifa accounts denounced the @ANTIFA_US account as fake.", "“Often anti-fascists will be the first ones to identify that these accounts are fake,” Brian Friedberg, a researcher who focuses on far-right disinformation at Harvard’s Shorenstein Center on Media, Politics, and Public Policy, told AFP by phone.", "The @ANTIFA_US account layout used the same header and profile image as another fake Twitter account suspended in January 2020, but Twitter did not confirm that the @RichmondANTIFA account was connected to Identity Evropa by the time of publication.", "Posing as an anti-fascist organization online is commonplace, according to Friedberg, who calls this particular tactic “keyword squatting.”", "Keyword squatters will jump “on keywords like Antifa before accounts can be created and vetted, to pollute the information ecosystem,” Friedberg said, adding that Black Lives Matter groups -- which work to oppose white supremacists and violence against black communities -- have also been recently impersonated online using this technique.", "“Sharing of the decontextualized screenshot when an account has been deleted is a tactic to muddy public opinion because people are unable to go back to verify for themselves whether this is real or not,” he added.", "Antifa impersonation in the US has been going on since the organization became a matter of public interest around early 2017, according to Bray.", "In August of that year, investigative journalist Eliott Higgins exposed a far-right smear campaign promoting the idea that the Antifa movement promotes violence against white women.", "Pre-existing misconceptions about what Antifa is facilitates online impersonation and disinformation, according to Bray.", "He said the main misunderstanding is the idea that Antifa is a united and coordinated organization with a leadership.", "“Instead, it is a kind of politics that is practised by autonomous groups sometimes participating in loose networks, sometimes not, so in that sense it is impossible to speak of Antifa as an organization,” Bray said.", "President Donald Trump amplified this misconception by tweeting on May 31 that he intended to designate Antifa as a terrorist organization, a threat that Bray wrote in The Washington Post seemed “impossible to enforce.”", "Both Bray and Friedberg pointed out that horizontal and structureless groups such as Antifa are particularly prone to online impersonation because members remain anonymous to protect themselves from police and far-right backlash.", "“This is a prime space for manipulators to play in,” Friedberg said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]