["By Chloe Wilson", "Posted on September 14, 2018", "Q: Was Colin Kaepernick arrested during an NFL game on Sept. 9?", "A: No. That story was originally published on a self-described satirical website.", "Colin Kaepernick has been back in the news since Nike released a new “Just Do It” ad campaign featuring the former NFL quarterback who started kneeling during the national anthem at football games in 2016 to protest police brutality and racial injustice.", "Nike’s ads drew both backlash and support from the public.", "One story falsely states that Kaepernick was arrested on Sept. 9 after rushing the field during a game between the Minnesota Vikings and his former team, the San Francisco 49ers. It was originally posted on worstpot.us, which claims to only publish satire.", "A disclaimer on that website states: “Everything on this website is fiction. It is not a lie and it is not fake news because it is not real.” But the story was presented as news on conservativepaper.us, which did not notify readers that the story was intended as satire.", "There are clues the story is false, though.", "It claims Kaepernick “decided that he would crash the field during the national anthem in San Francisco, this afternoon, running to the 50-yard line to take a knee, ‘black power’ fist in the air.” But Sunday’s game was played in Minneapolis, not San Francisco.", "Also, the photo used in the story on the satire site, which shows a man on the ground, surround by five officers, comes from a 2013 incident when a fan was tackled by an Oklahoma Highway Patrol trooper after he ran onto the field during a college football game between the University of Oklahoma and Iowa State University.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Carroll, Roy. “NFL’s Kaepernick kneels during national anthem, continuing protest.” Reuters. 1 Sep 2016.", "“BREAKING: Kaepernick Arrested for Publicity Stunt During Anthem in San Fran.” Worstpot.us/ever. 9 Sep 2018.", "“BREAKING: Kaepernick Arrested for Publicity Stunt During Anthem in San Fran.” Conservativepaper.us. 9 Sep 2018.", "“Trooper Makes Tackle of the Game When Taking Down Unruly OU Fan.” KFOR. 18 Nov 2013.", "Nike. “A Crazy Dream Becomes Reality When You Just Do It.” Press release. 5 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]