["About this rating", "A meme purportedly relaying the heroic exploits of James Doohan, who is best known as the actor who played Scotty in the original Star Trek series, was shared by the \"Meanwhile in Canada\" Facebook page in June 2018, in remembrance of D-Day:", "The story presented in this meme is largely accurate. Doohan was one of some 14,000 Canadian soldiers who landed in Normandy, France, in June 1944 during World War II. He did suffer several gunshot wounds during the invasion, which ultimately resulted in the loss of his middle finger. It's also true that one of these bullets was stopped by a cigarette case in his pocket.", "However, this meme doesn't identify the likely source of these gunshots: A nervous Canadian sentry.", "Doohan was a commissioned lieutenant with the 14th Field Artillery Regiment of the 3rd Canadian Infantry Division, and was tasked with invading an area of Normandy code-named Juno Beach. As the meme states, Doohan successfully led his men across the beach littered with anti-tank mines, and also managed to take out two German snipers:", "The first Canadians reached Juno Beach at 7:35 AM and were cut down. Fortunately for them, the HMS Ajax had bombed Juno earlier, doing more damage to the coastal defenses than the planes had. After two hours, they had swept aside most of the Germans on their stretch of the beach.", "Doohan led his men across the sands and got lucky. Despite the anti-tank mines beneath their feet, none went off, as the men were not heavy enough to activate them. As they made their way to higher ground, Doohan managed to take out two German snipers – his first kills of the war.", "By noon, they had secured their positions. They could rest, as well as deal with their dead and wounded. There was, however, a problem.", "Although Doohan escaped the initial moments of the invasion relatively unscathed, his luck didn't last:", "At about 11:20 that evening, Doohan finished a cigarette and patted the silver cigarette case he kept in his breast pocket. It had been given to him by his brother as a good luck charm… and a good thing, too.", "Some ten minutes later, he was walking back to his command post when he was shot. Six times. By a Bren Gun. The first four bullets slammed into his leg, the fourth whacked him in the chest, while the sixth took off his right middle finger.", "It was not a German sniper. He had been shot by a nervous, trigger-happy Canadian sentry. Fortunately, the cigarette case stopped the bullet aimed at his chest. Doohan later joked it was the only time being a smoker saved his life.", "Doohan attempted to hide his missing finger in episodes of Star Trek (a hand double was even used in some close-up scenes), but he wasn't always successful. For example, Doohan's injury can be briefly glimpsed in the famous episode \"The Trouble with Tribbles\":", "There is at least some debate over the provenance of the bullets that wounded Doohan. Although books such as D-Day: The Essential Reference Guide and Fight to the Finish: Canadians in the Second World War state that Doohan was wounded by friendly fire, Doohan's mother was told, at least initially, that her son had been hit by German bullets. We have also encountered varying reports about the number of times Doohan was shot (ranging from six to eight.)", "We attempted to locate accounts from Doohan himself about the incident, other than the one presented in his autobiography, but didn't turn up much additional information. The most revealing report appears to come from a New York Times article that centered around a letter Doohan sent director Steven Spielberg shortly after the release of the film Saving Private Ryan in 1998 (which mentioned Doohan being hit by \"German\" bullets):", "\"When I wrote Spielberg I told him I'd landed on Juno on D-Day, which was nothing as horrid as the Omaha disaster.\"", "Not horrid, perhaps, but bad enough. He and his men landed unscathed on Juno then fought their way successfully into the Normandy peninsula as far as the town of Courseulles that first day. But Artillery Lt.  James Doohan of D Company, Winnipeg Rifles, 13th Field Regiment, Royal Canadian Army, ended up just before midnight plugged by eight German bullets.", "Four hit his left knee, three took out the middle finger of his right hand, and one was deflected from killing him by a sterling silver cigarette case in the breast pocket of his jacket. \"I still have that cigarette case today,\" the husky 78-year-old Doohan said through his walrus mustache, shooting his eyebrows.", "Doohan also downplayed his heroics, saying that the mines on the beach were anti-tank mines and that his men were not heavy enough to trigger them. Doohan also said that he wasn't sure if he had truly killed two German snipers and added that he didn't notice the gunshot wounds in his legs until he got to the medic:", "\"We landed safely, thank God, through those Y-shaped steel barriers you see in the film, tracer bullets, all that, none of our men hurt, and dashed 75 yards to the 7-foot tall dunes,\" Doohan said.", "\"Crossed a minefield, found out about it later: It was meant to blow up tanks, and we weren't heavy enough. Moved up through a down - hardly a town just a village - called Graye Sur Mer, saw a church tower that was a machine-gun post, firing off to our left.", "Doohan took out the machine-gun post with a couple of shots. \"I don't know if they were killed or wounded, but it shut them up,\" he said.", "His mother was told that German bullets had hit him at 11:30 p.m. on D-Day as he was returning from a forward gun position. He waled a quarter-mile - \"the adrenaline lets you do it\" - to the regimental aid post, Doohan said. He know about his right hand and the wack on his chest against that cigarette case, but that was all.", "\"The medic said: 'You also have four bullets in your left knee.' I said: 'Well, I walked here.'\"", "Russell, Shahan.   \"Star Trek star Shot Two Snipers on D-Day and Was Shot Seven Times in WWII.\"     War History Online.   29 November 2016.", "Tucker, Spencer.   D-Day: The Essential Reference Guide..     ABC-CLIO, 2017.   (p. 76).", "Talmer, Jerry.   \"'Scotty' Praises Spielberg for 'Private Ryan.'\"     Star Tribune.   19 August 1998.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]