["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "All told, some 2,700 people are on death row at the state level. A little more than 60 are in federal prisons awaiting the death penalty.", "Wisconsin was one of the first states to abolish capital punishment, on July 10, 1853.", "The move followed the 1851 execution of John McCaffary, the first and last person to be executed under Wisconsin state law.", "More than 2,000 people witnessed the execution by hanging of McCaffary in Kenosha. He had received the death penalty for drowning his wife, Bridgett McCaffary, on July 23, 1850, in a backyard cistern. The hanging turned into a gruesome spectacle, as McCaffary struggled on the end of the rope for some 20 minutes as he was slowly strangled, according to the MurderPedia.org website. The uproar over the slow public strangulation of McCaffary prompted Wisconsin to ban the death penalty.", "While there is no death penalty in Wisconsin, the issue resonates nationwide -- particularly since the Trump administration moved in July 2019 to reinstate the federal death penalty.", "U.S. Rep. Gwen Moore, D-Wis., slammed the reinstatement in a July 26, 2019 tweet:", "\"The death penalty is a discriminatory policy. More than half of death row prisoners are people of color. The Trump administration isn’t fooling anyone by reinstating the federal death penalty and executing a white supremacist first. Distraction & deflection is their goal.\"", "Is Moore right that \"more than half of death row prisoners are people of color\"?", "Establishing the terms", "Before we jump in, some background on the issue.", "As of August 28, 2019, there are 30 states that currently allow the death penalty. They include Alabama, Colorado, Louisiana, Texas and Utah. Most of the death penalty states are in the west and south, with the nearest ones to Wisconsin being Indiana, Ohio and Kansas. Capital punishment was abolished in Illinois in 2011.", "All told, some 2,700 people are on death row at the state level. A little more than 60 are in federal prisons awaiting the death penalty.", "Meanwhile, according to a March 30, 2014, National Public Radio article, \"The Journey from ’Colored’ to ‘Minorities’ to ‘People of Color,’\" the definition of \"person of color\" has varied over the years.", "\"In U.S. history, ‘person of color’ has often been used to refer only to people of African heritage,\" the article states. \"Today, it usually covers all/any peoples of African, Latino/Hispanic, Native American, Asian or Pacific Island descent, and its intent is to be inclusive.\"", "With that in mind, how does Moore’s death-row claim stack up?", "The evidence", "When asked to back up the claim, Moore’s staff referred PolitiFact Wisconsin to two reports.", "The first is a September 2011 report by the American Civil Liberties Union, \"Race and the Death Penalty.\" It asserted that \"People of color have accounted for a disproportionate 43% of total executions since 1976 and 55% of those currently awaiting execution.\"", "The second report Moore’s office cited was from the Equal Justice Initiative, a non-profit organization based in Montgomery, Alabama, that provides legal representation to prisoners.", "Its report also said more than half of the people on state death rows in the United States are people of color: \"Of the more than 2,700 people currently under a death sentence, 42 percent are black, 13 percent are Hispanic, and 42 percent are white.\"", "The data in the Equal Justice Initiative report came from a May 31, 2019, report from the Death Penalty Information Center, which compiled data from the death penalty states and found that as of May 2019, there are 2,721 inmates on death row.", "It included the same racial statistics cited by the Equal Justice Initiative, but with an additional 3% listed as \"other.\"", "Those reports, however, only cover state-level death penalty cases.", "Federal data", "To get a handle on the makeup of federal prisoners, we turned to the Death Penalty Information Center, which is a Washington, D.C.-based non-profit organization that provides the media and the public with analysis and information about capital punishment.", "As of April 1, 2019, it found there were 62 inmates with the following racial background:", "White -- 27 (43.5%)", "Black -- 26 (41.9%)", "Latino -- 7 (11.3%)", "Native American -- 1 (1.6%)", "Asian -- 1 (1.6%)", "So, people of color make up a majority of death row inmates at both the state and federal levels.", "Our ruling", "Moore said  \"More than half of death row prisoners are people of color.\"", "Reports from organizations, including the American Civil Liberties Union, Equal Justice Initiative and the Death Penalty Information Center confirm the death row racial population claim, both at the state and federal level.", "We rate her claim True.", "Twitter. U.S. Rep. Gwen Moore, July 26, 2019", "United States Department of Justice, \"Federal government to resume capital punishment after nearly two decade lapse,\" July 25, 2019.", "Email, Samara Sheff, press secretary, U.S. Rep. Gwen Moore, August 6, 2019.", "Email, Death Penalty Information Center, Sept. 12, 2019.", "Email, Communications Department, ACLU of Wisconsin, Sept. 23, 2019.", "Equal Justice Initiative \"Race and Poverty.\"", "CNN \"Why are Hispanics identifying as white?\" May 30, 2014.", "Wisconsin Historical Society, \"The Death Penalty in Wisconsin\"", "Murderpedia \"John McCaffary\"", "General Accounting Office (GAO) \"Death Penalty Sentencing: Research Indicates Pattern of Racial Disparities,\" February 1990.", "Death Penalty Information Center, \"Facts About the Death Penalty,\" updated May 31, 2019.", "The Hill, \"GOP lawmaker: ‘I’m a person of color. I’m white,’\" July 17, 2019.", "National Public Radio, \"The Journey from ’Colored’ to ‘Minorities’ to ‘People of Color,’\" March 30, 2014.", "World Population Review \"Death Penalty States 2019.\"", "MurderPedia.com John McCaffary", "ExecutedToday.com 1851: John McCaffary, the last hanged by Wisconsin", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]