["About this rating", "On June 3, 2020, a video supposedly showing two segments from Laura Ingraham's Fox News show \"The Ingraham Angle\" dealing with athletes expressing their political opinions started to circulate on social media.", "Both of the clips featured in this video are genuine.", "The first segment aired on Ingraham's show in February 2018 and shows the Fox News host telling NBA stars LeBron James and Kevin Durant, both black men, to \"shut up and dribble\" after they criticized U.S. President Donald Trump and spoke out about racism in the United States.", "Ingraham said at the time:", "Must they run their mouths like that? Unfortunately, a lot of kids and some adults take these ignorant comments seriously. Look, there might be a cautionary lesson in LeBron for kids: This is what happens when you attempt to leave high school a year early to join the NBA. And it's always unwise to seek political advice from someone who gets paid $100 million a year to bounce a ball. Oh, and LeBron and Kevin? You're great players but no one voted for you. Millions elected Trump to be their coach. So keep the political commentary to yourself, or as someone once said, shut up and dribble.", "Here's a longer version of the clip:", "The second clip comes from June 3, 2020, and shows Ingraham defending Drew Brees after the NFL star, a white man, said that he would \"never agree with anybody disrespecting the flag\" when he was asked about football players kneeling during the National Anthem in protest of police brutality and racial injustice.", "Ingraham said:", "Well he's allowed to have his view of what kneeling and the flag means to him. I mean, he's a person. He has some worth, I would imagine. This is beyond football though. This is totalitarian conduct. This is Stalinist. And by the way on the streets of New Orleans they are shouting 'F Drew Brees.' That's what this moment has done to the beautiful team spirit of the New Orleans Saints... He's giving $5 million to charity by the way.", "A longer clip of this segment is viewable at The Daily Beast.", "While Ingraham defended Brees' remarks, the NFL player later apologized to his teammates, his fans, and the people of New Orleans, writing: \"I would like to apologize to my friends, teammates, the City of New Orleans, the black community, NFL community and anyone I hurt with my comments yesterday. In speaking with some of you, it breaks my heart to know the pain I have caused. In an attempt to talk about respect, unity, and solidarity centered around the American flag and the national anthem, I made comments that were insensitive and completely missed the mark on the issues we are facing right now as a country.\"", "Ingraham addressed the controversy stemming from comparisons of her comments on Brees and James in a follow-up segment on June 5, in which she noted a \"nuance between the two instances\" and said, \"Every American, every American has the God-given right to speak his mind on any issue.\"", "Sources: The Daily Beast / Instagram / USA Today / CBS Sports / Sports Illustrated / Fox News", "Chaves, Chris.   \"Fox News' Laura Ingraham: LeBron Should 'Shut Up And Dribble' After Criticism of President Trump.\"\r\n    Sports Illustrated.   16 February 2018.", "Breech, John; Dajani, Jordan.   \"Drew Brees Faces Backlash From Saints Teammates and Beyond for Comments About Kneeling During the Anthem.'\"\r\n    CBS Sports.   4 June 2020.", "Curtis, Charles.   \"Fox News Host: LeBron Should 'Shut Up and Dribble.'\"\r\n   USA Today.   16 February 2018.", "Baragona, Justin.   \"Laura Ingraham Claims Criticism of Drew Brees Is ‘Stalinist.'\"\r\n    Daily Beast.   4 June 2020.", "Update [10 June 2020]: Added link to follow-up segment on Ingraham's show.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]