["Republican Mike DeWine says Democrat Richard Cordray is soft on drug dealers in Ohio, a state hit hard by the opioid crisis.", "\"Cordray’s plan would allow drug dealers to remain on our streets,\" says DeWine’s TV ad. \"Even when they are caught with enough fentanyl to kill 10,000 people. The same drug that is killing Ohioans every day. Cordray’s plan would create a safe haven for drug dealers.\"", "The ad refers to Corday’s support for Issue 1, a constitutional amendment that would reduce possession offenses to misdemeanors. DeWine, the attorney general, opposes the amendment. The question will appear on the November ballot when DeWine and Cordray face off for governor.", "We found that DeWine miscasts what the amendment would do and omits what Cordray has said about drug dealers.", "• This isn’t \"Cordray’s plan,\" although he supports the amendment.", "• Cordray has said drug dealers should serve long sentences.", "• The amendment reduces possession of drugs to a misdemeanor.", "• The amendment states that drug trafficking would remain a felony.", "If adopted, the amendment would reclassify drug possession -- including fentanyl -- as a misdemeanor and prohibit jail time until an individual's third offense within two years. Also, those already convicted of possession could ask a court to reduce their conviction to a misdemeanor. Felons, with some exceptions for certain offenses, could get a 25 percent reduction in prison time if they participate in rehabilitative, work or educational programs.", "Money that is saved from imprisonment would go toward rehabilitation and crime victim funds.", "But the amendment doesn’t let drug traffickers, a.k.a. dealers, off the hook. It states that the misdemeanor provisions \"do not apply to convictions for the sale, distribution, or trafficking of drugs\" or for convictions based on volume or weight that were classified as a first-, second-, or third-degree felony offense.", "That leaves fourth- and fifth-degree felony possessions to be reclassified misdemeanors, which the DeWine campaign says would include fentanyl, which is deadly in small amounts.", "DeWine’s campaign points to an op-ed against the amendment by Chief Justice of the Ohio Supreme Court Maureen O’Connor who said an offender charged with possession of 19 grams of fentanyl would only receive a misdemeanor. Since the lethal dose of fentanyl is just 2 milligrams, 19 grams of fentanyl is enough to kill about 10,000 people, she wrote.", "But the key here is the word \"possession.\"", "Defendants who deal drugs can still be charged with felony trafficking, said Ohio State University Law professor Doug Berman, executive director of the Drug Enforcement and Policy Center.", "\"This is not about giving drug dealers a break; this is about freeing up resources to provide treatment to reduce the demand for the drugs,\" Berman said.", "The amendment will make prosecutors jobs harder -- they will no longer be able to only charge defendants with possession and send them to prison. Instead, they will have to prove trafficking, which involves additional elements beyond just merely possession -- and would mean that prosecutors would be putting their undercover officers on the stand.", "Ohio Prosecuting Attorneys Association argues the amendment may prevent felony charges for traffickers \"who deliberately deal in small amounts so that they can assert simple possession as a defense.\"", "Kenneth R. Bailey\u2028, president of the Ohio Association of Criminal Defense Lawyers, said someone caught with a small amount of fentanyl could be charged with misdemeanor possession. But DeWine still isn’t telling the full story.", "\"In practice, trafficking is an often used companion charge to possession,\" Bailey said. \"If Issue 1 passes, there is nothing that prevents a prosecutor from bringing the misdemeanor possession count with a companion felony trafficking (charge).\"", "Generally, trafficking is not defined by the amount of the drug, but the purpose for which the possessor is going to use the drug, he said. In one case, a defendant was charged with trafficking for 10 grams of heroin and aggravated trafficking for possessing a bag containing less than a gram of heroin and fentanyl.", "The defense lawyers association is supporting Issue 1 with reservations, including the form of its implementation as an amendment and the removal of judicial discretion.", "DeWine’s ad says it is \"Cordray’s plan\" to let the drug dealers go free.", "While Cordray has stated support for Issue 1, it isn’t his plan. Advocates collected signatures to place it on the ballot.", "Also, DeWine is ignoring that Cordray has distinguished between penalties he wants to see for users and drug dealers.", "Cordray has said, \"As governor, I will work with law enforcement to make sure drug dealers are convicted and serve long prison sentences, while people who need substance abuse treatment can get it in our communities.\"", "At least 11 states as of January 2018 have lowered some drug possession crimes from a felony to a misdemeanor, said Alison Lawrence, who tracks drug laws for the National Conference of State Legislatures.", "DeWine’s ad says Cordray’s \"plan would allow drug dealers to remain on our streets.\"", "Issue 1 would lower possession to a misdemeanor and prohibit jail time until an individual's third offense within two years. That could apply to someone in possession of fentanyl, which is deadly in small amounts. Cordray supports the amendment, but it's a far stretch to call it his plan. Most importantly, the amendment still leaves drug trafficking as a felony, and that includes trafficking of fentanyl. Nothing about the proprosal allows drug dealers to remain on the streets if prosecutors prove the charge in a court of law.", "We rate this claim False.", "Mike DeWine, Ad, Sept. 12, 2018", "Ohio Secretary of State, Issue 1, Accessed Sept. 13, 2018", "Mike DeWine campaign, Statement on Issue 1, Sept. 10, 2018", "Policy Matters Ohio, \"Issue 1: Reducing incarceration, improving communities,\" Aug. 23, 2018", "National Conference of State Legislatures, Drug sentencing trends, July 30, 2018", "Dayton Daily News, \"What is State Issue 1 on the Ohio ballot this fall?\" Sept. 10, 2018", "Ohio Supreme Court Chief Justice Maureen O’Connor, \"The hidden disaster of state Issue 1,\" Aug. 29, 2018", "Ohio Prosecuting Attorneys Association, \"State Issue 1: A Safe Harbor for Drug Traffickers and Violent Offenders,\" 2018", "Ohio Court of Appeals, State v Graves, Sept. 8, 2015", "Akron Beacon Journal op ed by Dennis Baker, \"Issue 1 gets at crime and addiction,\" Sept. 9, 2018", "Columbus Dispatch, \"Ad Watch: DeWine TV spot lies about drug issue, Cordray position,\" Sept. 12, 2018", "Columbus Dispatch, \"DeWine says Issue 1 impact ‘devastating,’ Cordray calls it smart policy,\" Sept. 10, 2018", "Columbus Dispatch, \"Issue 1 splits gubernatorial hopefuls,\" Sept. 11, 2018", "Columbus Dispatch, \"Drug-penalty issue makes November ballot,\" July 24, 2018", "Columbus Dispatch, \"Cordray favors diversion from prison in drug cases,\" July 27, 2018", "Cincinnati Enquirer, \"What is Ohio Issue 1? Separating fact from fiction on divisive drug ballot initiative,\" Sept. 23, 2018", "Rich Cordray and former U.S. Attorney General Eric Holder, July 2018", "Bill Cunningham Podcast, Interview with Mike DeWine, Sept. 17, 2018", "Ohio Legislative Service Commission, SB 1, 2018", "PolitiFact, \"Richard Cordray casts some blame on Mike DeWine for opioid overdoses in Ohio,\" June 12, 2018", "PolitiFact, \"Sherrod Brown credits Obamacare for helping pay for opioid treatment,\" April 20, 2018", "Interview, Joshua Eck, Mike DeWine campaign spokesman, Sept. 14, 2018", "Interview, Mike Gwin, Rich Cordray campaign spokesman, Sept. 14, 2018", "Interview, Kenneth R. Bailey\u2028, president of the Ohio Association of Criminal Defense Lawyers, Sept. 20, 2018", "Interview, Louis Tobin, Ohio Prosecuting Attorneys Association executive director, Sept. 21, 2018", "Interview, Reggie Wilkinson, former director of the Ohio Department of Rehabilitation and Correction, Sept. 20, 2018", "Interview, Doug Berman, Drug Enforcement and Policy Center director and law professor at the Ohio State University Moritz College of Law, Sept. 20, 2018", "Interview, Jonathan Witmer-Rich, Cleveland|Marshall College of Law, Cleveland State University, Sept. 20, 2018", "Interview, Dennis Willard, spokesman for the Yes campaign, Sept. 20, 2018", "Interview, Chan Cochran, President Cochran Group Inc. and spokesman for the No campaign, Sept. 20, 2018", "Interview, Alison Lawrence, National Conference of State Legislatures program director, Sept. 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]