["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Democratic group reacted to Republican Gov. Rick Perry bringing his move-to-Texas pitch to Maryland by airing an ad on Baltimore radio stations.", "In the ad from the Texans for America’s Future PAC, two men twang about Texas starting with one reminding listeners of Perry’s \"oops\" when during a 2011 Republican presidential debate he did not come up with the name of the third agency he intended to eliminate.", "Perry similarly has forgotten that one in four Texas children \"lives in poverty,\" the fellow says in the ad. In 2011, some 26 percent of the state’s children lived in households with incomes below the federal poverty line, according to a Sept. 12, 2012, Austin American-Statesman news article.", "In the ad, the second man intones: \"And thanks to Perry's bad budgeting, the highway department has to convert some modern paved state roads back to gravel.\"", "The Texas Department of Transportation has revealed plans to convert to gravel some paved roads battered by heavy trucks traveling to oil and gas fracking sites.", "And did this decision result from Perry’s \"bad\" budgeting?", "Jeff Rotkoff, Austin spokesman for the group, reminded us by email that as governor, Perry signs lawmaker-advanced state budgets into law. More specifically, Rotkoff said, news accounts show that TxDOT cited finances as a reason to gravel the selected roads.", "On July 25, 2013, TxDOT’s chief engineer, John Barton, told the agency’s oversight commission that a dozen short farm-to-market road segments, adding up to 83 miles of pavement, were in such poor shape that they were not worth repairing, the Statesman reported in a news article posted online that day. The story said that concurrently, speed limits on the roads would be reduced from a typical 55 mph to 30 mph. The paper quoted Barton as saying TxDOT also planned to post weight limits on an additional 518 miles of roads, some to as low as 20,000 pounds, and restrict vehicles widths to 10 feet or less on an additional 517 miles of road.", "\"We’re at a point where it’s really not safe to have them be asphalt,\" Barton told the Texas Transportation Commission.", "A Texas Tribune news story posted that day said that the chosen roads were in four South Texas counties — Live Oak, Dimmit, LaSalle and Zavala — and two West Texas counties — Reeves and Culberson — and that they included a three-mile stretch of frontage road for Interstate 37 in Live Oak County.", "A month later, though, the agency announced a pause, saying that aside from more than three miles of damaged roads that had already been converted to \"high-end gravel,\" it would enter a two-month review period for the other proposed conversions to see if county governments stepped forward to pay for maintaining the paved roads, the Statesman said in a news story posted online Aug. 29, 2013.", "Several news accounts said budgetary pressures played into the initial decision to gravel roads.", "A July 26, 2013, Houston Chronicle news story, for example, quoted Barton as saying: \"Our resources are being strained to the point we are having to make difficult decisions.\"", "The July Statesman story said that \"TxDOT, thanks to more than $20 billion of borrowing, has had a several-year surge of road building, but that bubble of money is due to pop in the next couple of years.\" The newspaper described TxDOT executive director Phil Wilson as saying that unless lawmakers found new TxDOT funding sources, the agency’s existing level of road contracts, about $6.2 billion this year, would fall to $2.5 billion by the 2015-16 fiscal years and stay there.", "A Sept. 11, 2013, San Antonio Express-News news article quoted Barton as telling residents at a community meeting about the asphalt-to-gravel plans: \"If resources were different, different decisions would be made.\" The story also quoted Wilson as saying the intent is to repave the roads in the future when funding is available.", "But none of that news coverage referred to Perry as being to blame for TxDOT’s budget crunch.", "Perry has long opposed pitches to raise the state’s gas tax, which would generate more money for roads. But he’s also called for money for building and keeping up roads.", "In his Jan. 29, 2013 State of the State address, Perry urged lawmakers to shift $3.7 billion from the state’s rainy day fund to make one-time investments in road and water projects. Perry also called for ending the diversion of tax revenue from the state’s highway fund, which he said would free up $1.3 billion every two years for road maintenance and construction.", "Lawmakers later agreed to prevent the diversion of $400 million from the highway fund through 2014-15 and also sent voters a proposed constitutional amendment that, if approved by voters, would shift $1.2 billion a year in \"rainy day\" funds to building and maintaining roads and acquiring related right-of-ways.", "By email, TxDOT spokeswoman Veronica Beyer sent figures indicating that during Perry’s governorship, the agency has annually committed at least $3 billion a year to build and maintain highways. More than $9 billion in commitments occurred in the fiscal year running through August 2009, Beyer said. Over all of Perry’s years, she said, expenditures came from the highway fund, bond funds approved by lawmakers and/or voters and federal aid.", "Beyer said bringing the 83 miles of roads slated for gravel up to highway strength would cost more than $40 million.", "Separately, we reached Tim Lomax, a senior research engineer at the Texas Transportation Institute, which says it annually works on hundreds of transportation-related research projects.", "Lomax, who said he has worked on projects for TxDOT, said by phone he doubts budgetary moves by Perry drove the roads-to-gravel decision. Instead, he suggested, TxDOT rationalized that keeping the particular roads paved didn’t make sense.", "\"Those roads are difficult to maintain,\" Lomax said. \"They could keep pouring money into those roads and still struggle to keep them up… The specifics are (that) if this oil and gas development is going to continue; they’re going to have to keep going out there to repair those roads or they’d have to spend a whole bunch of money to keep those roads in good shape… Why would you invest a whole bunch of money in a road to make it solid and then five years from now, it isn’t being used or not being used for what it was designed?\"", "Our ruling", "The PAC said that thanks to \"Perry's bad budgeting, the (Texas) highway department has to convert some modern paved state roads back to gravel.\"", "TxDOT indeed cited financial pressures as a reason for not repaving 83 miles of rural roads that it wants to convert to gravel. But we saw no sign of Perry playing more than his role of signing budgets into law. Those actions don’t strike us as sufficient to blame Perry for the gravel plans, which also reflect the agency’s judgment that it doesn’t make sense to repave certain roads only to have them repeatedly buckle under big trucks part and parcel of the fracking boom.", "Significantly, too, Perry sought billions of dollars in additional road funding from the 2013 Legislature; some funding came through and voters could approve more.", "While this claim has a pebble of truth, we stripe it as Mostly False.", "------------------------------------------------------------------------------------------", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "News articles, \"TxDOT: Some paved roads could return to gravel in oil patch,\" Austin American-Statesman, July 25, 2013; \"Cities, counties won’t have to shoulder upkeep costs to urban highways, TxDOT says,\" American-Statesman, Aug. 29, 2013 (accessed Sept. 18, 2013)", "State-of-the-state speech, Gov. Rick Perry, Jan. 29, 2013", "News article, \"Rocky roads ahead for parts of Texas,\" the Houston Chronicle, July 26, 2013 (Nexis search)", "News articles, \"TxDOT Plans to Convert Some Roads to Gravel,\" the Texas Tribune, July 25, 2013; \"Plan to Convert Roads to Gravel Begins Despite Pushback,\" Tribune, Aug. 19, 2013; \"A New Boom for Oil, but a Bust for State's Rural Roads,\" Tribune, Sept. 13, 2013 (accessed Sept. 18, 2013)", "News article, \"Gravel plan seen by some as a road to ruin,\" San Antonio Express-News, Sept. 11, 2013 (accessed Sept. 18, 2013)", "Telephone interview, Tim Lomax, senior research engineer, Texas Transportation Institute, Texas A&M University, College Station, Sept. 19, 2013", "Email, Veronica Beyer, director of media relations, Texas Department of Transportation, Sept. 19, 2013", "Emails, Jeff Rotkoff, treasurer, Texans for America’s Future PAC, Sept. 24, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]