["Jared Kushner, with wife Ivanka Trump, sits in the White House’s East Room in June. (Carolyn Kaster/AP)", "Jared Kushner, President Donald Trump’s son-in-law and senior adviser, suggested Special Counsel Robert Mueller’s investigation into Trump campaign ties to Russia and whether the president obstructed justice was more disruptive to the country than Moscow’s election interference.", "\"The whole thing is just a big distraction for the country,\" Kushner said at a Time magazine event. \"You look at what Russia did — buying some Facebook ads to try and sow dissent. And it's a terrible thing, but I think the investigation and all the speculation that's happened over the past two years has had a much harsher impact on our democracy than a couple of Facebook ads.\"", "Kushner’s entitled to his opinion on impact, but his characterization of Russia’s activity during the 2016 political season is wrong. \"Buying some Facebook ads to try and sow dissent\" is starkly at odds with the U.S. government’s description of the Kremlin’s \"active measures\" campaign, which officials concluded was carried out to help Trump and hurt Democratic candidate Hillary Clinton.", "Ultimately, Mueller did not establish there was an illegal relationship between the Trump campaign and Russia. But the notion that Moscow’s efforts amounted to \"a couple of Facebook ads\" is belied by the factual record Mueller compiled, as well as the U.S. intelligence community’s assessment.", "Russia’s active measures campaign comprised two major efforts. The first was a multi-platform social media campaign, which Kushner downplayed as the purchase of \"a couple of Facebook ads.\" The second was the hacking and disseminating of Democratic materials to harm Clinton’s electoral chances.", "\"The investigation established that the Russian government perceived it would benefit from a Trump presidency and worked to secure that outcome,\" Mueller’s report notes.", "Mueller’s conclusion came after the U.S. intelligence community publicly announced a similar conclusion after the 2016 vote.", "\"We further assess Putin and the Russian Government developed a clear preference for President-elect Trump,\" the Jan. 2017 U.S. intelligence assessment states. \"When it appeared to Moscow that Secretary Clinton was likely to win the election, the Russian influence campaign then focused on undermining her expected presidency.\"", "The scope of Russia’s social media campaign went vastly further than Kushner’s claim of \"a couple of Facebook ads.\"", "A Kremlin-backed entity called the Internet Research Agency, or IRA, ran the social media campaign out of St. Petersburg, Russia. Mueller found that by the end of the 2016 U.S. election, \"the IRA had the ability to reach millions of U.S. persons through their social media accounts.\"", "The IRA purchased over 3,500 Facebook advertisements and spent some $100,000 on the political ads, the report states. The group also controlled multiple Facebook groups and Instagram accounts that \"had hundreds of thousands of U.S. participants,\" Mueller said.", "About a year after the election, a Facebook executive told Congress that the IRA controlled some 470 accounts that generated 80,000 posts between January 2015 and August 2017.", "But the biggest statistic concerns the length of its reach.", "\"Facebook estimated the IRA reached as many as 126 million persons through its Facebook accounts,\" the Mueller report states.", "Their effort went well beyond Facebook. Additionally, the IRA controlled Twitter accounts with \"tens of thousands of followers,\" Mueller said, adding that among the followers were \"multiple U.S. political figures who retweeted IRA-created content.\"", "Twitter later revealed the IRA controlled more than 3,800 accounts, and likely reached nearly 1.5 million Twitter users.", "Kushner’s description also ignored the Russian intelligence operation to steal and release documents.", "To help Trump’s odds, Russian hackers controlled by the GRU, Russia's military intelligence service, stole emails belonging to Democratic organizations and Clinton campaign chairman John Podesta and relayed them to several publishers, including WikiLeaks, Mueller concluded.", "Two WikiLeaks dumps of damaging Clinton material came at pivotal moments during the campaign.", "In late July 2016, Democrats selected Clinton as their presidential nominee at the Democratic National Convention. But days before the nominating convention, a ceremony meant to foster party unity, WikiLeaks began publishing stolen Democratic Party emails.", "The first tranche — nearly 20,000 emails — revealed an embarrassing glimpse at internal deliberations among the Democratic National Committee. The correspondence appeared to show the party apparatus conspiring to boost Clinton and undermine her rival Bernie Sanders.", "The emails sparked Democratic infighting just as the party sought to coalesce support for Clinton.", "The next big WikiLeaks dump of damaging Clinton information came the month before the election, on Oct. 7.", "That afternoon, the Washington Post published video of a 2005 interview with Access Hollywood in which Trump boasted that his celebrity status enabled him to grope women.", "Less than an hour after the Trump tape went public, WikiLeaks revealed it had received 50,000 of Podesta’s emails. It released an initial dump of around 2,000 of the Clinton campaign chairman’s messages.", "The timing of the Podesta email release fueled suspicions that WikiLeaks wanted to distract from the Access Hollywood news. Nearly all of the Mueller report’s findings about WikiLeaks’ role is redacted.", "Kushner said Russia’s interference in the 2016 election amounted to \"a couple of Facebook ads.\"", "This claim grossly mischaracterizes Russia’s active measures campaign, which comprised both social media efforts to help Trump’s candidacy and a hack-and-dump operation aimed at hampering Democrats’ electoral chances.", "On Facebook specifically, the tech company estimates Kremlin-controlled accounts reached as many as 126 million people around the election.", "We rate this Pants on Fire.", "Jared Kushner interview during Time magazine event, April 23, 2019", "Special Counsel Robert Mueller’s redacted report, April 18, 2019", "U.S. intelligence community, \"Assessing Russian Activities and Intentions in Recent US Elections,\" Jan. 6, 2017", "PolitiFact, \"The Russia investigation and Donald Trump: a timeline from on-the-record sources (updated),\" March 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]