["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The United States must have a prepared military, but it’s not unpatriotic to say the country is spending too much money on its defense, according to Newark Mayor Cory Booker.\n\nHow much money? It’s more than the military spending of up to the next 12 countries combined, the Democratic mayor said.\n\nBooker made that point on the Feb. 1 episode of HBO’s \"Real Time with Bill Maher\" during a panel discussion about the recent Senate hearing on Chuck Hagel’s nomination to be U.S. Defense Secretary.\n\n\"The reality is we have to make sure that we have a military that’s prepared, but right now, we have more military spending than the next 10, 11, 12 countries combined, and we’ve got to start realizing that we can secure and protect ourselves, but also be responsible in the way that we do that,\" Booker said.\n\n\"And it’s not unpatriotic to say that we’re spending too much money,\" the mayor added. \"In fact, to me, that’s the patriotic thing to say.\"\n\nBooker’s claim is on target: The United States spent more on defense in 2011 than the combined total of other high-spending nations, according to data from two organizations considered to be leading authorities on worldwide military spending.\n\nThe first set of figures comes from the Stockholm International Peace Research Institute, an independent institute dedicated to research into conflict, armaments, arms control and disarmament. The institute maintains an online database of military expenditures since 1988 for 172 countries.\n\nIn 2011 -- the most recent year available -- the United States led the world in military spending at $711 billion, marking 41 percent of the world total, according to the institute. The next top 12 spending nations accounted for a combined total of $670.9 billion, according to the institute.\n\nU.S. expenditures were nearly five times higher than China, the second-highest nation with an estimated $143 billion in military spending. Russia was in third place with estimated spending of $71.9 billion.\n\nWe found similar results when we reviewed the data released by The International Institute for Strategic Studies, a London-based think tank which tracks military spending in 170 countries for its annual \"Military Balance\" report.\n\nAccording to IISS figures released last year, the United States’ defense budget in 2011 was $739.3 billion, making it the largest in the world. The combined total of the next top 9 nations was $486.7 billion, according to IISS figures.\n\nReferring to U.S. military spending, Michael O’Hanlon, a defense expert with the nonpartisan Brookings Institution, explained in an e-mail: \"It is large because we have overseas interests all over the world, and we put a high premium on responsiveness and qualitative superiority.\"\n\nBut the United States is poised to restrain its defense expenditures in the coming years.\n\nIn addition to reduced costs from winding down the war in Afghanistan, the Budget Control Act of 2011 contains provisions that limit spending increases in defense and other areas over the next decade.\n\nIt’s worth noting that calculating military expenditures for worldwide comparisons is inherently challenging, in part because there is no single definition of what constitutes military spending.\n\nAs the Stockholm International Peace Research Institute points out on its website, \"the lack of sufficiently detailed data makes it difficult to apply a common definition of military expenditure on a worldwide basis.\"\n\nOur ruling\n\nIn a panel discussion on HBO’s \"Real Time with Bill Maher,\" Booker claimed that \"right now, we have more military spending than the next 10, 11, 12 countries combined.\"\n\nThe mayor’s statement is accurate, according to data from two leading authorities on worldwide military spending. One set of figures shows that, in 2011, military spending by the United States exceeded the combined total of the next 12 highest nations by roughly $40 billion.\n\nWe rate the statement True.", "To comment on this ruling, go to NJ.com.", "HBO, Real Time with Bill Maher, Feb. 1, 2013\n\nPolitiFact Ohio, Alan Simpson says U.S. military spending outpaces totals from the next 14 largest nations, combined, Dec. 5, 2011\n\nPolitiFact, Jon Huntsman says the U.S. spends more than all other countries combined on defense, Dec. 13, 2011\n\nU.S. Department of State, World Military Expenditures and Arms Transfers 2005, accessed Feb. 6, 2013\n\nStockholm International Peace Research Institute, Background paper on SIPRI military expenditure data, 2011, April 17, 2012\n\nStockholm International Peace Research Institute, The 15 major spender countries in 2011, accessed Feb. 6, 2013\n\nCouncil on Foreign Relations, Trends in U.S. Military Spending, Aug. 23, 2012\n\nBrookings Institution, The Defense Budget and American Power, March 6, 2012\n\nThe International Institute for Strategic Studies, Military Balance 2012: Comparative Defence Statistics - Defence Budgets and Expenditures, March 7, 2012\n\nThe International Institute for Strategic Studies, Military Balance 2012, March 7, 2012\n\nBrookings Institution, The Implications of Military Spending Cuts for NATO’s Largest Members, July 2012\n\nPeter G. Peterson Foundation, The U.S. spent more on defense in 2011 than did the countries with the next 13 highest defense budgets combined, April 12, 2012\n\nStockholm International Peace Research Institute, International comparisons of military expenditures: issues and challenges of using purchasing power parities, 2006\n\nCongressional Research Service, Comparisons of U.S. and Foreign Military Spending: Data from Selected Public Sources, Jan. 28, 2004\n\nUnited Nations Office for Disarmament Affairs, Promoting Further Openness and Transparency in Military Matters: An assessment of the united nations stardardized instrument for reporting military expenditures, November 2010\n\nWashington Post, America’s staggering defense budget, in charts, Jan. 7, 2013\n\nE-mail interview with Michael O’Hanlon, director of research in foreign policy for the Brookings Institution, Feb. 7, 2013\n\nCongressional Budget Office, The Budget and Economic Outlook: Fiscal Years 2013 to 2023, February 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]