["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A CNBC story touted a misleading headline that said the CDC reported that the coronavirus survived on cruise ship cabins for up to 17 days.", "A recent CDC report found that traces of the virus were found on the ship for that long, not a live sample.", "A CNBC story circulating on Facebook displayed a misleading headline that claimed the Centers for Disease Control and Prevention said the coronavirus \"survived\" in cruise ship cabins for up to 17 days.", "The headline, which has since been changed, led some Facebook users who shared the story to believe that the CDC now says the virus can survive on surfaces that long.", "The organization has made no such statement.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Knowing the facts has never been more important. Please consider donating to PolitiFact today.", "The World Health Organization says it’s not certain how long the virus that causes COVID-19 survives on surfaces, but it seems to behave like other coronaviruses:", "\"Studies suggest that coronaviruses (including preliminary information on the COVID-19 virus) may persist on surfaces for a few hours or up to several days. This may vary under different conditions (e.g. type of surface, temperature or humidity of the environment).\"", "New CDC research conducted on the Diamond Princess cruise ship found traces of the coronavirus on some of the ship’s surfaces up to 17 days after passengers disembarked. But traces are not the same thing as live viruses.", "The report doesn’t conclude that the virus \"survived\" on any of the surfaces that long and the CDC hasn’t issued an official statement that gives that assessment, either.", "Dr. Akiko Iwasaki, a professor of immunobiology and molecular, cellular and developmental biology at Yale University, also told us it was the presence of the virus that was found, not a live sample.", "\"The CDC report examined the presence of viral RNA on various surfaces of the cruise ship. They found viral RNA up to 17 days after cabins were vacated on the Diamond Princess,\" Iwasaki wrote in an email. \"A piece of viral RNA is not the same thing as a live infectious virus. In order for a virus to be infectious, it has to have intact membrane, spike protein and the whole intact genome (there are close to 30,000 bases of genetic code in the viral genome).\"", "We previously looked at how long the virus can survive on certain surfaces in a recent fact-check and found research suggesting it can live for up to three hours in the air, four hours on copper, 24 hours on cardboard and three days on plastic and stainless steel. It’s important to note that the study hasn’t been peer-reviewed and more research is needed.", "The WHO and other health experts recommend that people disinfect surfaces often and wash their hands to avoid contracting or spreading the virus.", "More research needs to be done, but there is no evidence that the coronavirus can surive for up to 17 days on various surfaces. We rate this False.", "Archive.is, CNBC CDC says coronavirus RNA found in Princess Cruise ship cabins up to 17 days after passengers left, March 23, 2020", "Facebook post, March 24, 2020", "PolitiFact, Novel coronavirus could live up to 3 days, depending on the surface, March 20, 2020", "Centers for Disease Control and Prevention, Public Health Responses to COVID-19 Outbreaks on Cruise Ships — Worldwide, February–March 2020, March 23, 2020", "World Health Organization, Q&A on coronaviruses (COVID-19), March 9, 2020", "Email interview, Dr. Akiko Iwasaki professor of immunobiology and molecular, cellular and developmental biology at Yale University, March 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]