["By Katie Busch", "Posted on June 23, 2020 | Updated on June 25, 2020", "A Facebook post posing as a news story falsely claims that NASCAR driver Bubba Wallace had mistaken an automotive belt in his garage for a noose, citing a June 21 NASCAR statement as its source. The NASCAR statement issued that day didn’t say that. Two days later, the FBI said Wallace was not the victim of a hate crime because the noose had been in that garage before it was assigned to him. NASCAR said it was a “garage door pull fashioned like a noose.”", "A Facebook post inaccurately claims that the noose found in the garage of NASCAR driver Bubba Wallace was an automotive belt, and falsely blames Wallace for mistaking it for a noose.", "Wallace — the “only fulltime Black driver in NASCAR’s elite Cup Series,” according to the Associated Press — has faced threats in light of the organization’s recent decision to ban Confederate flags at its events. In a June 8 interview on CNN, Wallace called on NASCAR to ban the flags, and two days later the racing organization announced that “display of the confederate flag will be prohibited from all NASCAR events.”", "On June 21, NASCAR announced the discovery of a noose hanging in Wallace’s garage, calling it a “heinous act” and promising an “immediate investigation.”", "NASCAR, June 21: Late this afternoon, NASCAR was made aware that a noose was found in the garage stall of the 43 team. We are angry and outraged, and cannot state strongly enough how seriously we take this heinous act. We have launched an immediate investigation, and will do everything we can to identify the person(s) responsible and eliminate them from the sport. As we have stated unequivocally, there is no place for racism in NASCAR, and this act only strengthens our resolve to make the sport open and welcoming to all.", "The Facebook post altered that statement to falsely claim that the investigation “determined Bubba Wallace had mistaken a 26″ serpentine automotive belt for a noose.” The bogus post poses as a news story with a dateline from Talladega, Alabama, and claims the NASCAR statement on the conclusion of the investigation was issued June 21.", "“In a statement released Sunday night, NASCAR said, ‘Late this afternoon, Nascar was made aware that something that resembled a noose was found in the garage stall of the 43 team. We were angry and outraged, and cannot state strongly enough how seriously we took this allegation,” the Facebook post reads. “We launched an immediate investigation, and determined Bubba Wallace had mistaken a 26″ serpentine automotive belt for a noose.”", "In fact, the NASCAR statement did not say it completed its investigation or that it found Wallace was “mistaken.”", "A day after NASCAR issued its statement promising to investigate, NASCAR drivers and others escorted Wallace’s car to the front of the line at the Talladega race track in a show of support for the driver. Wallace shared a video of it on Twitter with the words, “My family.”", "Despite the false information that it contains, this post has been shared numerous times on Facebook, with one user falsely accusing the “main stream media” of “spreading lies.”", "Update, June 24: The FBI closed its investigation on June 23, issuing a statement that said “no federal crime was committed.”", "“The FBI learned that garage number 4, where the noose was found, was assigned to Bubba Wallace last week. The investigation also revealed evidence, including authentic video confirmed by NASCAR, that the noose found in garage number 4 was in that garage as early as October 2019,” the statement said. “Although the noose is now known to have been in garage number 4 in 2019, nobody could have known Mr. Wallace would be assigned to garage number 4 last week.”", "In a separate statement issued on June 23, NASCAR said, “The FBI report concludes, and photographic evidence confirms, that the garage door pull rope fashioned like a noose had been positioned there since as early as last fall. This was obviously well before the 43 team’s arrival and garage assignment.”", "Update, June 26: We added a photo, released June 25 by NASCAR, of “the noose found in the garage stall of No. 43 driver Bubba Wallace at Talladega Superspeedway last weekend.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Blackburn, Pete and McCarriston, Shanna. “NASCAR rallies around Bubba Wallace following noose incident, drivers push car to front of pack.” CBSSports.com. 22 Jun 2020. Accessed 23 Jun 2020.", "“Bubba Wallace wants Confederate flags removed from NASCAR tracks.” ESPN.com. 9 Jun 2020.", "Macur, Juliet. “Bubba Wallace Thankful for Flag Ban, but NASCAR’s Fans Might Not Be.” New York Times. 13 Jun 2020.", "“NASCAR issues statement on ‘heinous act’.” NASCAR.com. 21 Jun 2020. Accessed 23 Jun 2020.", "“NASCAR statement on confederate flag.” NASCAR.com. 10 Jun 2020. Accessed 23 Jun 2020.", "Wallace, Bubba (@BubbaWallace). “My family.” Twitter. 23 Jun 2020.", "Zenor, John. “Noose found in stall of Bubba Wallace at Alabama NASCAR race.” Associated Press.  21 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]