["Joe Biden says that President Donald Trump has a \"morally bankrupt re-election strategy\" that relies on \"vilifying immigrants.\"", "\"Under Trump, there have been horrifying scenes at the border of kids being kept in cages, tear-gassing asylum seekers, ripping children from their mothers’ arms — actions that subvert American values and erode our ability to lead on the global stage,\" he said in a Miami Herald op-ed before the June debate.", "But a viral essay by a Sen. Bernie Sanders supporter portrays Biden’s own record as extraordinarily harsh on illegal immigration. Among other claims, the essay says Biden \"voted to expand deportations and indefinite detention for immigrants multiple times.\"", "The essay by writer Weston David Pagano drew more than 120,000 interactions on Facebook and has a long list of criticisms of Biden, Pete Buttigieg, Kamala Harris and Beto O’Rourke.", "We found that the essay refers to votes Biden took in 1996 to expand detention and deportation of immigrants.", "What the essay omits is that Biden’s record of supporting border enforcement puts him in line with other Democrats during his tenure. It’s only recently that some Democrats have promoted more lenient border policies amid reports about conditions at detention sites, such as abolishing Immigration and Customs Enforcement or severely curbing deportation.", "Biden, along with the vast majority of the Senate, voted for bills to make it easier to detain, and then deport, more immigrants. But calling it \"indefinite detention\" lacks context because the goal was ultimately deportation, not to keep massive numbers of immigrants detained with no end in sight.", "\"It really was a watershed moment in the expansion of detention system,\" said Donald Kerwin, director of the Center for Migration Studies. \"It had more to do with mandatory detention than indefinite detention.\"", "The bills in question represented a pendulum swing one decade after President Ronald Reagan legalized the status of 1.7 million people.", "In 1996, the Democratic Party took a harsher stance against illegal immigration amid a rapid increase in arrivals and public opinion polls showing the majority of Americans wanted immigration levels to decrease.", "The Senate approved tough immigration measures by large bipartisan majorities as Bill Clinton was running for re-election.", "\"We are still dealing with the consequences of the laws passed in 1996,\" said Rick Su, an immigration law professor at the University of North Carolina School of Law. \"And Democrats, from Clinton to Biden, are still dealing with the legacy of supporting these bills today from critics on the left. But at that time, with the right-wing ascendency and popular anger, I think Democrats felt they needed to move rightward and act on these issues.\"", "As a senator, Biden voted in favor of two key bills: the Antiterrorism and Effective Death Penalty Act  and what ultimately became the Illegal Immigration Reform and Immigrant Responsibility Act (IIRAIRA, or \"ira ira\"). They passed by overwhelming margins with bipartisan support.", "The antiterrorism bill, which passed about one year after the Oklahoma City bombing, gave the federal government more tools to combat terrorism, to limit death-row appeals and to make it easier to deport immigrants who had committed crimes.", "The latter bill called for mandatory detention and deportation of immigrants who were subject to deportation due to a criminal conviction, even if the offense happened years ago.", "Andrew \"Art\" Arthur, a former Immigration and Naturalization Service official and immigration judge, said the measure created expedited deportation, limited ways for relief and expanded the aggravated felony definition.", "\"It largely took away the rights for aliens who entered illegally to see an immigration judge prior to being removed,\" said Arthur, who is now a fellow for the Center for Immigration Studies, which advocates for low levels of immigration.", "Combined, the laws led to a massive increase in deportations, wrote Princeton immigration experts Douglas Massey and Karen Pren.", "\"Prior to the mid 1990s the annual number of deportations had not exceeded 50,000 for decades, but with the passage of the 1996 legislation, this threshold was breached, and by the turn of the century deportations were running at just under 200,000 annually,\" they wrote.", "Peter Margulies, a Roger Williams University law professor, said there is no question that the laws increased deportation and detention as part of their main purpose. We heard agreement from other immigration law experts on that same point.", "The ACLU said the number of immigrants in detention rose from 8,500 in 1996 to nearly 16,000 in 1998.", "Su said that the language in the 1996 law seemed to assume that removal would eventually happen for immigrants detained.", "\"What they were focused on was expediting and ensuring removal. The impetus was not ‘we want to indefinitely detain people,’\" he said.", "\"Indefinite detention\" isn’t a technical legal term in the 1996 laws, but it is a term that has been used in court decisions and news articles since then.", "In 2001, the U.S. Supreme Court ruled in Zadvydas vs. Davis that the government couldn’t indefinitely hold individuals beyond six months if it’s unlikely that ICE can actually deport them soon. Legal experts pointed to this ruling to argue that the 1996 law didn’t allow for indefinite detention.", "In the 2018 case Jennings vs. Rodriguez, the Supreme Court ruled that detained immigrants don’t have the right to periodic bond hearings during removal proceedings. In March, the court ruled in Nielsen vs. Preap  that the government can hold immigrants without bail even if the crimes they committed were years ago.", "The Biden campaign pointed to measures that Biden supported that were intended to help immigrants, including the 1986 amnesty law, and then later a 2007 bill that included a path to citizenship.", "The Obama-Biden administration focused on both border enforcement and a call to change immigration laws to benefit some immigrants. He also announced Deferred Action for Childhood Arrivals to help some immigrants avoid deportation. The number of people removed reached an all-time high at 409,849 in 2012, less than Trump’s record, although later in Obama’s presidency he focused on deporting criminals.", "Biden has not released a detailed policy plan.", "Pagano said Biden \"voted to expand deportations and indefinite detention for immigrants multiple times.\"", "Biden voted for bills in 1996 that gave the federal government more power to detain and deport immigrants. Biden wasn’t an outlier in the Senate; these measures passed with wide majorities with significant Democratic support and were signed by Clinton.", "\"Indefinite detention\" is a tricky term that obscures the goal of the legislation. It was meant to detain immigrants until they were deported — not to detain them with no end in sight. It would be more precise to refer to the legislation as requiring mandatory detention.", "We rate this statement Half True.", "Weston David Pagano, A Guide to the 2020 Democratic Candidates You Should Not Vote For, June 24, 2019", "Congress.gov, S.735 - Antiterrorism and Effective Death Penalty Act of 1996, April 1996", "Congress.gov, H.R.2202 - Immigration Control and Financial Responsibility Act of 1996, September 1996", "Senate.gov,  S. 1348 (Comprehensive Immigration Reform Act of 2007), June 2007", "Congress.gov, S.1200 - Immigration Reform and Control Act of 1986, October 1986", "Joe Biden, Campaign website, Accessed July 9, 2019", "Congressional Research Service, Expedited Removal of Aliens: Legal Framework, Sept. 19, 2018", "CNN, Joe Biden once said a fence was needed to stop 'tons' of drugs from Mexico, May 10, 2019", "Cornell University school of law, ZADVYDAS v. DAVIS et al., 2001", "Cornell University school of law, Jennings v Rodriguez, 2018", "U.S. Supreme Court, Nielsen v Preap, March 19, 2019", "Reuters, Trump gets a U.S. Supreme Court victory on immigration detention, March 19, 2019", "NPR, Supreme Court Ruling Means Immigrants Could Continue To Be Detained Indefinitely, Feb. 27, 2018", "Douglas Massey and Karen Pren, Unintended Consequences of US Immigration Policy: Explaining the Post-1965 Surge from Latin America, 2012", "Vox, The disastrous, forgotten 1996 law that created today's immigration problem, April 28, 2016", "Newsday, Compromise Time / GOP leaders OK anti-terror bill; Clinton on board, (Accessed in Nexis) April 16, 1996", "Christian Science Monitor, Antiterrorism Bill Creates New Tools To Blot Out Crime, (Acccessed in Nexis) April 18, 1996", "New York Times, The Law That Keeps People on Death Row Despite Flawed Trials, July 17, 2015", "New York University School of Law Immigrant Rights Clinic, Dismantle, Don’t Expand, April 28, 2017", "Miami Herald op-ed, Biden: Our Latin America policies are morally bankrupt. Mine reflect American values, June 24, 2019", "Florida Times-Union, Clinton says he will sign terrorism bill; (Accessed in Nexis) April 12, 1996", "Tulsa World (Oklahoma)Terrorism Bill OK'd By Senate, (Accessed in Nexis) April 18, 1996", "Miami Herald, INS to review cases of detainees with records, (Accessed in Nexis) July 13, 1999", "Seattle Times, Criminal Aliens\" lifers’ in limbo, March 28, 1999", "San Diego Union Tribune, Feds get broad powers to hold migrants, (Accessed in Nexis) March 20, 2019", "New York Times, Immigrants Facing Deportation Must Be Detained After Release From Criminal Custody, Justices Rule, March 19, 2019", "SCOTUS blog, Opinion analysis: Court tees up issue of the constitutionality of indefinite immigration detention for the 9th Circuit,", "Dallas Morning News, Clinton vows perpetrators won't escape, (Accessed in Nexis) April 21, 1995", "NPR, Democrats Used To Talk About 'Criminal Immigrants,' So What Changed The Party? Feb. 19, 2019", "Washington Examiner, Castro and Harris want Biden to answer for past positions on immigration, June 1, 2019", "ACLU, Analysis of immigration detention policies", "Washington Post Jeh Johnson op-ed, Trump-era politics are drowning out consensus on immigration. It’s time for some straight talk. July 6, 2019", "Politico, Biden under fire for mass deportations under Obama, July 12, 2019", "PolitiFact, No, Bill Clinton did not pass a law separating families, June 21, 2018", "PolitiFact, Alexandria Ocasio-Cortez said the U.S. is running concentration camps. Many historians are skeptical, June 20, 2019", "PolitiFact, The facts behind the detention of immigrants, July 8, 2019", "PolitiFact, Yep. Reagan did the A-word, Jan. 6, 2008", "PolitiFact, Matt Gaetz said Democrats' platform once said illegal immigrants were committing felonies, Feb. 13, 2019", "PolitiFact, Jim Renacci says Chuck Schumer voted for the wall in 2006, Feb. 13, 2018", "PolitiFact, Barack Obama's top 25 campaign promises: How'd he do? Jan. 5, 2017", "Email interview, Weston David Pagano, July 9, 2019", "Email interview, Peter Margulies, Roger Williams University law professor, July 9, 2019", "Email interview, Kevin Johnson, UC Davis Dean, Mabie-Apallas Professor of Public Interest Law, and Professor of Chicana/o Studies July 9, 2019", "Email and telephone Interview, Rick Su, University of North Carolina law professor, July 9, 2019", "Telephone interview, Donald Kerwin, Center for Migration Studies director, July 9, 2019", "Telephone interview, Andrew \"Art\" Arthur, Resident Fellow in Law and Policy for the Center for Immigration Studies, July 9, 2019", "Email interview, Andrew Bates, Joe Biden campaign, July 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]