["By Angelo Fichera", "Posted on December 18, 2019", "Memes spread on Facebook falsely purport to quote a passage about lying from President Donald Trump’s 1987 book, “The Art of the Deal.”", "President Donald Trump’s 1987 book, “The Art of the Deal,” includes a passage about how he uses “truthful hyperbole” — or exaggeration — to promote his interests.", "But the book does not contain a quote that explicitly advocates lying to people, as memes circulating on Facebook claim.", "The memes purport to quote the book when stating: “You tell people a lie 3 times, they will believe anything. You tell people what they want to hear, play to their fantasies, and then you close the deal.” Some of the posts refer to Trump as “DON The CON,” others compare the supposed quote to one that is often linked to Nazi leaders Adolf Hitler and Joseph Goebbels.", "We searched Trump’s book and didn’t find the quote in question — and, it turns out, the fact-checking organization Snopes debunked the same claim in 2016.", "The quote is at best an exaggeration of the actual passage we mentioned earlier about Trump’s use of exaggeration.", "“The Art of the Deal,” 1987: The final key to the way I promote is bravado. I play to people’s fantasies. People may not always think big themselves, but they can still get very excited by those who do. That’s why a little hyperbole never hurts. People want to believe that something is the biggest and the greatest and the most spectacular. I call it truthful hyperbole. It’s an innocent form of exaggeration — and a very effective form of promotion.", "The book’s notion of “truthful hyperbole” has drawn renewed interest in light of Trump’s political career. The author Tony Schwartz, who served as a writer for the book and whose name appears alongside Trump’s on the cover, has since publicly spoken out about regretting his role in creating the book — and writing that particular section.", "In an interview with the New Yorker in 2016, Schwartz said that “truthful hyperbole” was a euphemism for deceit.", "“‘Truthful hyperbole’ is a contradiction in terms. It’s a way of saying, ‘It’s a lie, but who cares?’” Schwartz said.", "This isn’t the first time a president’s book has been misrepresented: In 2008, we wrote about a chain email that twisted quotes, and made up others, from then-presidential candidate Barack Obama’s book, “Dreams from My Father.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Kolawole, Emi. “Obama’s ‘Dreams of My Father.’” FactCheck.org. 3 Jun 2008.", "Mayer, Jane. “Donald Trump’s Ghostwriter Tells All.” The New Yorker. 18 Jul 2016.", "Trump, Donald J., with Tony Schwartz. “The Art of the Deal.” Penguin Random House, 1987.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]