["About this rating", "A video showing a man carrying a horse on his back went viral in May 2018, thanks in part to a fictional backstory about a medical emergency involving a snakebite:", "This man carried his horse 3 miles after he was bitten by a snake. Fortunately the horse was saved.", "The video does accurately show a man carrying a horse. However, rather than showing a heroic effort to save a working animal in danger, the footage actually shows Ukrainian strongman Dmytro Vasilievich Khaladzhi carrying a horse because, well, because he can carry a horse.", "Khaladzhi — a power-lifting champion and owner of several Ukrainian power records — has made a name for himself by performing unique feats of strength, such as using his hands to hammer nails into a board of wood during a performance on Ukrayina Maye Talant (Ukraine's Got Talent), getting run over by trucks, having giant timbers broken across his back, lifting vehicles with his legs, and, of course, carrying horses.", "The viral video purportedly showing a man carrying his injured horse can be glimpsed in the first few seconds of this compilation of Khaladzhi's feats of strength:", "It's unclear how far he actually carried the horse.", "While researching this Ukrainian strongman, we encountered several web sites claiming that he holds 63 Guinness World Records, a faulty factoid that appears to be the result of poor or incomplete translations. Khaladzhi holds dozens of titles in the Ukrainian Book of Records, but we were unable to locate any of his feats of strength listed on the Guinness Book of World Records' web site.", "A biography on the web site for the film Ivan the Powerful (Khaladzhi played title character Ivan Firtsak) provided some more information about the strong man:", "At age 15 he became the champion of Ukraine in hand-to-hand combat. Later he won the title of Ukrainian champion in folk wrestling, the title \"Strongest in Donbass\", eventually became the record holder of the Guinness Book of Records of Ukraine and Russia.", "﻿", "The video of a man carrying a horse is real. However, the story frequently attached about a man rescuing the animal after it was bitten by a snake was invented simply to increase its chances of going viral.", "CityNews.Net.UA.   \"Украинский силач Дмитрий Халаджи побил 300-летний мировой рекорд в Донецке и повторит его в Луганске\"\r\n    Retrieved 14 May 2018.", "Ivan-Film.UA.   \"ПРО АКТОРА\"\r\n    Retrieved 14 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]