["The screenshot was shared in this blog post on December 2, 2020.", "It appears to show a screenshot of a television report by Philippine media organisation GMA News. The text overlay states: \"FAKE BOOKINGS: DELIVERY DRIVER DID NOT EXPECT TO BE DELIVERING SEVERED HEAD! POLICE ON THE HUNT FOR SENDER!”", "The blog’s header text reads in part: “GMA News TV Blog”", "Identical screenshots were also shared alongside a similar claim in separate blog posts here, here, here and here.", "The claim is false.", "A reverse image search on Google, followed by keyword searches, found the screenshot in the posts corresponds to the 22-second mark of this GMA News report on October 20, 2020.", "The text overlay in the original GMA News report was digitally altered to include the reference to the severed head. It originally states: \"FAKE BOOKINGS: SOME FOOD DELIVERY DRIVERS VICTIMISED BY FAKE BOOKINGS OF PEOPLE WHO COULD NOT BE FOUND\".", "Below is a screenshot comparison of the doctored photo in the misleading posts (L) and the original GMA News report (R):", "In response to the misleading posts, GMA News editor-in-chief Jaemark Tordecilla said the blogs that shared the doctored photos are not connected to the news organisation.", "“This is an imposter site,” he said in a text message to AFP on December 21, 2020. “Our official website is at www.gmanetwork.com”.", "The misleading claim was also debunked here by Philippine news organisation Vera Files.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]