["Two different claims about Maharani Radhika Raje Gaekwad of Baroda have been making the rounds on social media recently. The first is that Forbes declared her the most beautiful woman out of all the Indian royal families. The second is about her making the decision to leave behind her royal life to become a Jain Sadhvi. A few photos of Maharani Radhika Raje along with a video of a woman are being circulated along with these claims. In the video, a woman wearing a white-coloured sari and gold ornaments. Her hair is being shaved off in what looks like a religious ceremony. Facebook user Anil Chetan claimed in an August 12 post that the clip featured none other than Raje. By the time this article was written, his post had been shared 1,600 times and the video had been viewed more than 2 lakh times. (link to the archived post)", "*महारानी के त्याग को बारम्बार नमन*", "बड़ौदा की महारानी राधिका राजे गायकवाड़ हैं जिन्हें फोर्ब्स मैगज़ीन ने भारतीय राज्य…", "Posted by Anil Chetan on Tuesday, 11 August 2020", "A longer version of the same video of a woman’s mundan (head shaving ceremony) is also being shared on Facebook by other users. A man named Udayam Ajanna had shared this via a Facebook Live stream. By the time this article was written, it had been viewed more than 5,700 times. (link to the archived post)", "🙏🚩*महारानी के त्याग को बारम्बार नमन* 🚩🙏", "बड़ौदा की महारानी राधिका राजे गायकवाड़ हैं जिन्हें फोर्ब्स मैगज़ीन ने भारतीय राज्य वंश की सबसे खूबसूरत महिला घोषित किया है। लक्ष्मी विला पैलेस बड़ौदा 700 एकड़ और बकिंघम पैलेस के 4 गुना आकार में फैला है। यह दुनिया का सबसे बड़ा निजी निवास है। सब छोड़कर जैन साध्वी की दीक्षा ली साथियों जब विरक्ति के बादल मन के आसमान में छाते है तो संसार का वैभव पेड़ के सुखे पत्तों की तरह मुरझाया हुआ लगता है , साथियों सिर्फ धन व नाम के पीछे न दौड़े , चिता में कुछ साथ नहीं जाएगा । बारंबार प्रणाम है ऐसे महान त्याग को 🚩🙏", "Posted by उदाराम आजंणा on Sunday, 16 August 2020", "A video story by India Today from August 17 claimed that Forbes magazine had dubbed Maharani Radhika Raje Gaekwad the most beautiful woman in the Indian royal families. The website of News Today Chhattisgarh had also shared the news of the Maharani becoming a Jain Sadhvi.", "This slideshow requires JavaScript.", "This information is being shared widely across Twitter and Facebook.", "Alt News will put before you the reality of the two claims about Baroda’s Maharani Radhika Raje on social media.", "The claim of Forbes magazine declaring Maharani Radhika Raje Gaekwad as the most beautiful woman in Indian royalty is completely false. Radhika Raje had also rejected this claim through an Instagram post.", "A post shared by Radhikaraje Gaekwad (@radhikaraje) on Aug 16, 2020 at 3:27am PDT", "The Indian edition of MillionaireAsia Magazine had put the Maharani on their cover in December 2019 alongside a feature story about her. The publication had given Radhika Raje the nickname of ‘The Modern Day Maharani’. No information about her was found on the Forbes website.", "After doing some digging on Maharani Radhika Raje’s Instagram, we discovered a post dated August 19. This post contained an official statement on this matter issued by the Lakshmi Vilas Palace. The statement makes it clear that the claims suggesting Radhika Raje is leaving her property to become a Jain Sadhvi are completely false.", "A post shared by Radhikaraje Gaekwad (@radhikaraje) on Aug 18, 2020 at 10:11pm PDT", "After doing a keyword search on YouTube, we discovered the viral video. It had been uploaded on June 16, 2018. According to the channel, the video shows a ritual that is carried out before the Jain ‘Deeksha’ ceremony. We did not get any additional details about the woman appearing in the video. Furthermore, the face of the woman featured here does not resemble Maharani Radhika Raje’s features.", "Apart from this, the pictures being shared with these false claims have been taken from her Instagram account.", "This slideshow requires JavaScript.", "Ultimately, the claims being made about Maharani Radhika Raje of Baroda are nothing but a hoax. Neither has she decided to become a Jain Sadhvi nor has Forbes magazine declared her the most beautiful woman among the Indian royal families. The video being shared on social media with these claims is actually two years old.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…"]