["The video was published here on Facebook on December 19, 2019. It has been viewed more than a million times, according to data provided by the social network.", "The four-and-a-half-minute footage shows a man surrounded by uniformed men, pointing and yelling at a foreigner holding a hard hat for extending the perimeter of a construction site to the state road.", "“The owner of this property must be arrested immediately. The contractor, all those working here, must be arrested immediately. You have destroyed the public road. In which country can this be allowed? In your own country, can anybody do this? It is madness!”, the man shouts.", "He then tells the uniformed men to arrest the foreigner, who is handcuffed, and orders all remaining builders to halt their work.", "The post’s caption reads: “We need this man in naija, Ghana President got mad wt the contractor.!!! (sic).”", "The video clip has also been shared here and here on Facebook, as well as here and here on Twitter alongside a similar claim.", "Minister, not president", "But while the clip was indeed shot in Ghana, it doesn’t show President Nana Akudo-Addo but the country’s roads and highways minister Kwesi Amoako Atta.", "His outburst came months after about 1.56 billion Ghanaian Cedi ($290 million) worth of funding was approved for the reconstruction, rehabilitation, and upgrading of 14 road networks across different regions in Ghana.", "Multiple Google searches for keywords in the Facebook post led us to this version of the footage with higher quality.", "Reports published on December 18, 2019 on leading  Ghanaian news websites, including JoyOnline and TheGhanaReport, say Atta ordered the arrest of some contractors over their failure to secure a building permit and extending the construction of the barricade of a 22-storey building which led to the destruction of a public road in Accra.", "The reports, along with building structures and paintings seen in the footage, provide clues to the location of the construction site.", "Using Google Street View, AFP confirmed that the video was shot at Senchi Street, Accra.", "Background buildings, natural features and other visual clues are seen in both the video and on Google Street View, including wooden electric poles, balcony railing, and palm trees.", "In addition, comparing images of the president and roads minister, the man in the video is identifiable as the latter.", "AFP has contacted Atta as well as the Ghana Highway Authority for comment but has not yet heard back.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]