["The one-minute, 32-second clip was published here on Facebook on March 15, 2020. It has been viewed more than 8,200 times.", "The post’s Indonesian-language caption translates to English as: “Donald Trump left the meeting room to go to the toilet to defecate, but ...he forgot to turn off the microphone on its tie so his fart can be heard from the meeting room's speaker....”", "Below is a screenshot of the misleading post:", "Donald Trump is the current president of the United States.", "The video also appeared with a similar claim on Facebook here, here and here, where it has been viewed more than 3,600 times; on Twitter here and here; and on YouTube here.", "The video was also shared in Malaysian language here, here and here; and in English here and here with a similar claim.", "The claim is false; the video has been manipulated; the original video actually shows a city council meeting in Texas in 2015 that was interrupted after the local mayor took a toilet break.", "A Google reverse image followed by a subsequent keyword search found the original video published by American media New York Daily News here on YouTube on May 4, 2015, titled: “Texas mayor leaves mic on during bathroom break.”", "The caption of the two-minute, 16-second video reads: “A Texas city council meeting was interrupted after the city’s mayor took a bathroom break - but left his microphone still switched on.”", "Below is a screenshot comparison between footage in the misleading post (L) and the New York Daily News video (R):", "From the 44-second mark  to the one-minute 27-second mark of the video, the mayor can be heard urinating and flushing the toilet.", "In the misleading video, however, the audio was changed to include a farting sound.", "US-based news site Time published a report about the meeting here on May 4, 2015, headlined: “See the Hilarious Moment When a Mayor Leaves His Mic on During a Bathroom Break.”", "The repor'ts first two paragraphs read: “Everything about this April 28 city council meeting in Georgetown, Texas, sounded completely civilized and serious — until the mayor forgot to turn off his mic when he went to the bathroom.", "“It all starts when Mayor Dale Ross gets up from his seat at the beginning of this clip from the live-stream of the meeting. Thirty seconds later, as Mayor Pro Tem Rachael Jonrowe talks about friends and family members who have contracted antibiotic-resistant infectious diseases, the man can be heard urinating and then flushing afterward.”", "Dale Ross is mayor of Georgetown, Texas.", "Austin American-Statesman, a Texas-based newspaper, interviewed Ross about the incident and published this article dated September 24, 2016, headlined: “Georgetown mayor: I’m not embarrassed about bathroom video.”", "The manipulated video was previously also shared on Twitter on February 15, 2020, here, with a claim about a Texas mayor who forgot to switch off his microphone. The post, as reported by The Washington Post, was later retweeted by Trump.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]