["Multiple photos in the collage show elderly people who were attacked in South Africa, some several years ago.", "There’s no evidence the images were taken in the U.S. or have any connection to the Black Lives Matter movement.", "Disturbing photos showing badly beaten elderly people are being misrepresented in a Facebook post that claims they depict people who were attacked by a Black Lives Matter group \"for being white.\"", "The images are legitimate, but the claim that the injuries were inflicted by Black Lives Matter activists is wrong.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "All the images in the collage have been circulating online since at least 2015 and are predominantly used in posts and blogs to claim that white South African farmers are under attack. Some have also been misused to claim that immigrants in Europe are violent.", "The image in the top left of the post dates back to Oct. 3, 2014, when 75-year-old Anne Els from Bloemfontein, South Africa, was attacked and robbed in her home. A Facebook page called \"'Stop White South African Genocide\" shared the image and claimed Els was attacked by a Black man.", "In 2019, Norweigan fact-checking organization Faktisk debunked another false claim about the photo that said it showed a Swedish rape victim. The organization found a report about the incident by Volksblad, a South African newspaper, but said no information about the attacker was given.", "The woman pictured in the bottom right shows 75-year-old Renske Cowan in October 2010 — three years before the Black Lives Matter movement began  — when she was beaten by an intruder in her home in Primrose, Germiston South Africa, according to an Africaans news website.", "We weren’t able to track down the other photographs, and while the news stories didn’t identify the women as farmers, their photos, along with the others in the post, have appeared in collections of images that claim to show attacks on farmers in South Africa.", "None of the photographs were identified as being from the United States or connected to members affiliated with the Black Lives Matter movement outside of unsourced social media posts.", "We rate this False.", "Facebook post, Aug. 22, 2020", "Tin Eye, reverse image searches, Sept. 2, 2020", "Faktisk, This is not a Swedish woman who has been raped by immigrants, May 2, 2019", "Lead Stories, Fact Check: These Photos Do NOT Show Seniors Beaten By BLM, Aug. 29, 2020", "FactCheck.org, Social Media Posts Use Graphic, Unrelated Photos to Smear BLM Protesters, Aug. 28, 2020", "Yahoo News, South African farmers protest attacks, Aug. 19, 2020", "News24.com, Old man's fear: 'Just not raped', Oct. 28, 2010", "Vnnforum.com, April 2015 post", "Defend-europe.com, Farm attacks in South Africa, July 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]