["“Hundreds of thousands Kashmiris took street yesterday in Pak occupied Kashmir to liberate their land from Pak.. One of Kashmiris requested to spread this video all over the world as Indian media did not cover such a huge rally….”", "The above message has been shared on social media and messaging platforms, accompanied by a video which shows a gathering of members of the Muslim community. The video clip is 1:25 minutes long. In the video, the men can be seen burning a green-coloured flag and shouting the slogans Hindustan Zindabad (Long live India) and Pakistan Murdabad (Death to Pakistan). According to the narrative, this video is from Pakistan occupied Kashmir (PoK) where Kashmiris have risen against the Pakistani state, after the Indian Government’s drastic move on Article 370.", "Fwd as received", "Hundreds of thousands Kashmiris took street yesterday in Pak occupied Kashmir to liberate their land from Pak.. One of Kashmiris requested to spread this video all over the world as Indian media did not cover such a huge rally…. pic.twitter.com/r53Mp2SDs9", "— Uma garghi⤴️🇮🇳 (@umagarghi) August 12, 2019", "Apart from Twitter, the video and message have been posted widely by individual Facebook users on their timelines.", "Alt News found that the video has also been shared by several users in Tamil with the identical claim.", "To fact check this claim, Alt News searched Google with the key words ‘Indian muslims burn Pakistani’ flag, and found that the same video had been posted earlier on YouTube in 2017. On further probing, we found an even earlier instance of the video posted on YouTube in September, 2016.", "Alt News could not find further information about the video or ascertain the narrative with which it was posted, except that the earliest instance of it appearing online is September 30, 2016. It may be noted that in September 2016, 17 Indian army soldiers were killed in a suicide terror attack in Uri, Kashmir.", "Alt News found that in 2016, the same video had been circulated with the claim that these are members of the Islamic theological centre Darul Uloom Deoband. However, this claim was rubbished by Darul Uloom Deoband which had released a statement in this regard, denying that the institution had anything to do with the burning of the Pakistani flag.", "In conclusion, it may be stated that the video in question is not recent, and has nothing to do with the Union Government’s recent move to repeal provisions of the controversial Article 370 which granted special status to J&K. The video dates back to September 2016.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]