["About this rating", "In February 2016, the transcript of a speech Hillary Clinton purportedly gave to Goldman Sach's on 4 June 2013 started circulating online:", "The following is a leaked transcript of Hillary Clinton’s 1st speech to Goldman Sachs delivered on 6/04/2013. Two other speeches are also rumored to be in circulation. This is the full transcript. Secretary Clinton received $225,000 for this speech.", "HILLARY CLINTON: Thank you. Thank you so much. Thank you very much, Lloyd [Blankfein], and thanks to everyone at Goldman Sachs for welcoming me today. I’m delighted to be back among friends, colleagues, collaborators, supporters, kindred spirits…", "Let me jump right in. You know, over the past few months, there have been popular concerns about an economy that still isn’t delivering for the majority of Americans. It’s not “delivering” the way that they feel it should, that they feel entitled to. Most Americans that you speak to, speak a populist rhetoric that claims it is stacked for those at the top, that those of you here have it too good.", "(Laughter)", "But we know the hopes that the little people have for their future — things like school, job, food, clothing on their backs– all of those little things would not be possible without your leadership and innovation.", "Several publications, such as BSNews, CounterPunch, and Dissident Voice, lent credence to the transcripts when they published them in full. These web sites all attributed its text to author K.J. Noh, who is not affiliated with the Clinton campaign.", "While the aforementioned web sites are not exclusively satirical publications, they do occasionally (as is the case above) publish satire:", "BSNews, in stark contrast, is here to tell you the truth. We pride ourselves on covering the news stories the corporate media won’t dare touch. We will from time to time take satirical side swipes at journalists within the MSM (see Special Reports) and we will be producing spoof media animations (see Podcast) but we will never deliberately lie or mislead OUR audience about the most important news stories of the day.", "While we couldn't find any indication that BSNews had labeled the above-quoted story as satire, Counter Punch featured a \"satire alert\" at the top of its article and the Dissident Voice (where the purported transcript of Clinton's speech first appeared) filed the story as piece of fiction:", "The transcripts of Hillary Clinton's speeches to Goldman Sachs have not been leaked or published anywhere on the internet. When the Democratic presidential candidate was asked about the speeches she made during a town hall meeting on 18 February 2016, she said that she would release them when the other candidates did the same:", "At another town hall, on Feb. 18, a man in the audience pleaded, “Please, just release those transcripts so that we know exactly where you stand.” Mrs. Clinton had told him, “I am happy to release anything I have when everybody else does the same, because every other candidate in this race has given speeches to private groups.”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]