["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Greg Murphy talks about the novel coronavirus in a video that he posted on Twitter on March 16, 2020.", "As the nation tries to slow the spread of the novel coronavirus, politicians are offering tips of their own.", "U.S. Rep. Greg Murphy, a North Carolina Republican, is one of them.", "Murphy is a physician who won the seat in a special election last year after longtime congressman Walter Jones passed away. Murphy has been posting videos on Twitter, wherein he explains the effects of the virus and the federal government’s response.", "In a video posted March 16, Murphy stands next to a white board wearing his scrubs.", "Most of his tips are on-point. He says cold weather won’t kill the novel coronavirus (true). He says gargling hot water doesn’t kill coronavirus (also true).", "But Murphy also says this.", "\"Sunlight actually can kill the virus. But we have to be cautious about that. It’s good to be out in the sun, but away at a distance from each other,\" Murphy says.", "Is that true?", "We reached out to Murphy but didn’t receive a response. So we did our own research.", "As it turns out, PolitiFact has already reported on a variation of this claim. Sunlight has not been proven to kill the novel coronavirus, also known as COVID-19.", "This is one of many unverified claims about the novel coronavirus.", "At first, the reasoning might make sense. There is, in fact, some evidence that viruses don’t like heat.", "\"The droplets that carry viruses do not stay suspended in humid air as long, and the warmer temperatures lead to more rapid virus degradation,\" Elizabeth McGraw, director of the Center for Infectious Disease Dynamics at Pennsylvania State University, recently told Time Magazine.", "But, at this point, the U.S. Centers for Disease Control isn’t sure the sun or heat will affect COVID-19 the same way. CDC physician and researcher Nancy Messionnier said on Feb. 12 that \"it’s premature to assume\" the heat and sunlight will temper the virus. \"We haven’t been through even a single year with this pathogen,\" she told NPR.", "Sun exposure can also raise a person’s vitamin D levels, potentially reducing the incidence of acute respiratory infection, Harvard University professor Marc Lipsitch wrote in his recent paper: \"Seasonality of SARS-CoV-2: Will COVID-19 go away on its own in warmer weather?\"", "But, Lipsitch wrote, \"On the other hand, we found that this effect was unlikely to be a large factor in the variation in influenza incidence between summer and winter.\"", "Neither the World Health Organization nor the U.S. Centers for Disease Control list sunlight exposure as a method for preventing the coronavirus. In fact, on its \"mythbusters\" webpage, the WHO says COVID-19 can be transmitted in all climates, \"including areas with hot and humid weather.\"", "One reason people might believe sunlight can kill the virus is because sunlight contains ultraviolet light. In Rep. Murphy’s video, he stands next to a white board that mentions UV light from the sun.", "High-intensity UV light can indeed kill viruses. But natural sunlight doesn’t provide the UV light intensity needed to kill the virus, according to Rachel Graham, assistant professor of epidemiology at the UNG Gillings School of Global Public Health.", "\"Exposing surfaces to plain sunlight should not be considered sanitation,\" she said, adding: \"I would never ever, ever rely on sunlight to kill coronavirus.\"", "Graham’s claim about UV light is supported by Sally Bloomfield, a professor at the London School of Hygiene and Tropical Medicine.", "To kill a virus, temperatures must rise to about 140 degrees fahrenheit, Bloomfield told the BBC.", "Murphy said \"sunlight actually can kill the virus.\" This claim has not been proven true.", "His whiteboard mentioned UV light in sunlight. But experts claim the UV rays in sunlight aren’t intense enough to COVID-19.", "We found no conclusive evidence that someone could prevent the virus by exposing themselves to the sun for long periods of time. And we found no evidence that sunlight exposure could help an infected person defeat the virus. We rate this claim False.", "Tweet from U.S. Rep. Greg Murphy, a Republican representing North Carolina’s 3rd District.", "Fact checks by PolitiFact, \"Gargling with salt water can ease a sore throat, but it won’t kill the coronavirus,\" posted March 13, 2020; \"Sun exposure does not kill the coronavirus,\" posted March 11, 2020.", "Telephone interview with Rachel Graham, assistant professor of epidemiology at the UNG Gillings School of Global Public Health.", "Story by Time Magazine, \"Will Warmer Weather Stop the Spread of the Coronavirus? Don't Count on It, Say Experts,\" posted Feb, 28, 2020.", "Story by NPR, \"Can Coronavirus Be Crushed By Warmer Weather?\" posted Feb. 12, 2020.", "Story by the BBC, \"Coronavirus: The fake health advice you should ignore,\" posted March 8, 2020.", "The U.S. Centers for Disease Control webpage on frequently asked questions about the novel coronavirus; webpage on how to protect yourself from the virus.", "The World Health Organization’s webpage featuring advice for the public on combating the novel coronavirus.", "Article by Marc Lipsitch, professor of Epidemiology and Director, Center for Communicable Disease Dynamics, Harvard T.H. Chan School of Public Health, \"Seasonality of SARS-CoV-2: Will COVID-19 go away on its own in warmer weather?\"", "Article by the Columbia University Irving Medical Center, \"Can UV Light Fight the Spread of Influenza?\" published Feb. 9, 2018.", "Fact check by China Daily, an English-language newspaper that serves as a propaganda arm for the country’s Communist Party, \"Can sun exposure kill the novel coronavirus?\" posted Feb. 8, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]