["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Elaine Marshall is North Carolina's Secretary of State. Her office is not in charge of counting ballots. (WRAL photo)", "North Carolina is one of the last states to count all of its ballots.", "And that has led some pundits to speculate about suspicious activity in the Tar Heel State. The Students for Trump Twitter account, which has 287,000 followers, suggested North Carolina’s Democratic secretary of state might have something to do with the slow counting.", "\"It’s going to take North Carolina 9 days to get in the final results. It took Florida a little less than 2 hours. Democrat Secretary of State vs. Republican Secretary of State,\" the account tweeted on Wednesday. Students for Trump is part of the conservative Turning Point Action organization.", "The post was shared more than 1,400 times.", "It’s accurate to say North Carolina Secretary of State Elaine Marshall is a Democrat. In her first campaign for the office in 1996, she defeated racing legend Richard Petty. The secretary of state does not, however, count votes or control the election process.", "The confusion prompted the N.C. Secretary of State account to tweet about the confusion.", "\"Unlike many states, North Carolina's election process is administered by the N.C. State Board of Elections (@NCSBE), not the NC Secretary of State's Office. All questions or comments concerning election-related matters should be directed to the Board of Elections,\" the account tweeted on Wednesday.", "Ballots are counted by each of North Carolina’s 100 county elections boards, and then validated by the North Carolina State Board of Elections. North Carolina’s elections board has five members, three of whom are Democrats.", "Not only is the tweet wrong about North Carolina’s election process, it wrongly suggests there’s evidence of fraud or wrongdoing by North Carolina’s ballot counters. So far, there is none.", "It may seem like this year’s vote is taking longer than previous years, and there’s a reason for that.", "In previous elections, the officials stopped counting mail-in ballots three days after Election Day.", "This year, the elections board pushed the deadline to Nov. 12.", "That decision didn’t sit well with Republicans.", "The North Carolina elections board’s two Republicans resigned, and were replaced with two different Republicans last month.", "Republican groups, including Donald Trump’s re-election campaign, challenged the move in court. But the U.S. Supreme Court voted 5-3 to allow the later date, with Chief Justice John Roberts and conservative Justice Brett Kavanaugh joining the court’s three liberal justices in the majority.", "That’s all beside the point. To summarize what we’re waiting on, state election officials cannot get an accurate picture of the total tallies until Nov. 12. A mail-in ballot will be counted in North Carolina so long as it was:", "Properly filled-out and witnessed,", "Postmarked on or before Election Day, and", "Received by 5 p.m. on Nov. 12.", "The deadline for ballots may be new. But it isn’t evidence of wrongdoing.", "The Students for Trump account suggested that North Carolina’s \"Democrat Secretary of State\" played a role in the state’s prolonged ballot-counting process. That’s not the case.", "We rate this claim False.", "Tweet by Students for Trump on Nov. 4, 2020.", "Tweet by the North Carolina Secretary of State on Nov. 4, 2020.", "Information about the elections boards in North Carolina on the North Carolina State Board of Elections website.", "Story by CNN, \"North Carolina can count votes received 9 days after Election Day, Supreme Court says,\" posted Oct. 28, 2020.", "Story by the Associated Press, \"Supreme Court leaves NC absentee ballot deadline at Nov. 12,\" posted Oct. 28, 2020.", "Story by the News & Observer, \"NC Gov. Cooper appoints two Republicans to replace elections board members who quit,\" posted Oct. 6 and updated Oct. 22, 2020.", "Story by New York Times, \"The King recovers from defeat,\" posted Dec. 6, 1996.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]