["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on December 11, 2019", "During his first campaign rally after Democrats announced two articles of impeachment and the Justice Department inspector general released a report on the FBI’s Russia investigation, President Donald Trump distorted the facts on both topics.", "Trump’s campaign rally was held Dec. 10 in Hershey, Pennsylvania.", "The president continued to rattle off a string of false claims about his July 25 phone call with Ukrainian President Volodymyr Zelensky and the whistleblower complaint. We’ve written about all of these before.", "Trump released the White House memo on the phone call on Sept. 25. The following day, the House intelligence committee released a redacted copy of the whistleblower complaint, which includes an account of the phone call that largely mirrors the White House memo. Also, on Sept. 26, Rep. Adam Schiff, the chairman of the House intelligence committee, gave an embellished version of the call memo before a committee hearing.", "But Trump scrambles the timeline of events to make the false claim that his release of the memo came after Schiff’s comments and “screwed up the whole works” for the Democrats. The memo corroborates the whistleblower complaint.", "Trump said: “When a guy like shifty Schiff, here’s a corrupt politician. He made up my statement, because see, I did one thing very good. As soon as I heard about this deal, I released my statement immediately, but he had already made horrible statements and, by the way, the whistleblower, the whistleblower defrauded our country, because the whistleblower wrote something that was totally untrue and we broke up the game.”", "Again, Schiff’s version of the call — which he acknowledged later in the hearing “was meant to be at least part in parody” — came the day after Trump released the memo. (We previously went through how Schiff’s version and the memo compare.)", "The president went on to repeat his false claim that the whistleblower report was “something totally different from what I said.” The whistleblower complaint included three main points about the call that were indeed in the White House memo: that Trump asked Zelensky to “initiate or continue an investigation” into former Vice President Joe Biden and his son, Hunter Biden; assist the U.S. in investigating allegations that “Russian interference in the 2016 U.S. presidential election originated in Ukraine”; and “meet or speak” about these matters with Trump’s personal attorney, Rudy Giuliani, and Attorney General William Barr.", "On Sept. 26, Acting Director of National Intelligence Joseph Maguire testified that the whistleblower’s complaint “is in alignment with what was released yesterday by the president.”", "Trump also wrongly said, again, that the White House memo on the call was “professionally transcribed word-for-word.” The memo specifically includes a “caution” note saying it “is not a verbatim transcript.”", "The president further claimed the whistleblower had “disappeared, he’s gone.” But the whistleblower filed an anonymous complaint, as allowed under the law. (See this Sept. 23 report by the nonpartisan Congressional Research Service.) And the whistleblower’s lawyers have said their client wishes to remain anonymous. “Because our client has no additional information about the president’s call, there is no justification for exposing their identity and all the risks that would follow,” they wrote in an Oct. 25 op-ed for the Washington Post.", "Finally, the president claimed releasing the transcript “gummed it up. Now, all of a sudden, we never heard from the second whistleblower.” But the second whistleblower, who works in the intelligence community, did not come forward until the first week of October — more than a week after Trump released the memo. One of the attorneys representing the original whistleblower said a second whistleblower had not filed a complaint but had spoken to the intelligence community’s inspector general.", "Trump accused the FBI of framing his campaign, stretching the facts to fit his narrative.", "Trump: The inspector general found that FBI spying application contained 17 errors and omissions – commonly known as lies and deceit. … When the FBI uncovered evidence showing that we did absolutely nothing wrong, which was right at the beginning, they hid that exonerating. You know that, they hid it. They hid it so nobody could see it, so they could keep this hoax going on for two years. They knew right at the beginning that it was all a frame up, a setup, but they hid it so that nobody could see it.", "It’s true the inspector general found at least 17 “significant inaccuracies and omissions” in the FBI’s applications for a surveillance warrant of campaign aide Carter Page under the Foreign Intelligence Surveillance Act, or FISA.", "For example, when it filed its first FISA application in October 2016, the FBI omitted that Page had served as an “operational contact” for another federal agency from 2008 to 2013, and had provided information to that agency about his “past contacts with certain Russian intelligence officers.” That information was also not included in FISA renewal applications. In gathering information for the Department of Justice’s renewal of the FISA application, a lower-level FBI attorney altered an email to make it appear that Page was not a confidential source.", "Also, the first FISA application alleged Page was an intermediary between Paul Manafort, Trump’s then-campaign manager, and the Russian government as part of a “well-developed conspiracy.” But the application omitted Page’s statements to the FBI two months earlier denying this alleged conspiracy.", "So, the president is right that the IG found “17 errors and omissions,” including some “exculpatory information,” in the FISA application process that resulted in court-approved surveillance of Page. But the IG report found no evidence that these errors were intentional or that the FBI “knew right at the beginning that it was all a frame up, a setup,” as Trump said.", "The report said that “we did not find documentary or testimonial evidence of intentional misconduct on the part of the case agents who assisted OI [the National Security Division’s Office of Intelligence] in preparing the applications, or the agents and supervisors who performed the Woods Procedures,” referring to the FBI process of verifying facts included in FISA applications.", "“In most instances, witnesses told us that they either did not know or recall why the information was not shared with OI, that the failure to do so may have been an oversight, that they did not recognize at the time the relevance of the information to the FISA application, or that they did not believe the missing information to be significant,” the report said. “On this last point, we believe that case agents may have improperly substituted their own judgments in place of the judgment of OI to consider the potential materiality of the information, or in place of the court to weigh the probative value of the information.”", "Trump, as he has in the past, described the intelligence surveillance as “spying” on his campaign. But inspector general investigators found no evidence of illegal “spying” — either before or after the FBI on July 31, 2016, opened the Crossfire Hurricane investigation.", "The report says the IG found “no evidence” that the FBI used confidential sources or undercover employees “to interact with members of the Trump campaign” before launching the investigation.", "After the FBI opened an investigation, the FBI used four confidential human sources and “a few” undercover employees that “resulted in interactions with Carter Page, George Papadopoulos, and a high-level Trump campaign official who was not a subject of the investigation.”", "However, the report said the interactions between the Trump campaign aides and the FBI’s confidential sources “received the necessary FBI approvals” and were “consensually monitored and recorded by the FBI.”", "Trump claimed that with the articles of impeachment filed on Dec. 10, Democrats are “now admitting there was no collusion, there was no obstruction of justice and there were no crimes whatsoever” related to the Russia investigation, and that there were “no crimes” in the impeachment articles either.", "But the articles of impeachment do not exonerate Trump of alleged criminal behavior related to the Russia investigation.", "Trump: Today the House Democrats announced these two flimsy, pathetic, ridiculous articles of impeachment. The House Democrats are walking back from everything they claimed with today’s announcement. They’re now admitting there was no collusion, there was no obstruction of justice and there were no crimes whatsoever. There were no crimes. It says it. There were no crimes. They’re impeaching me, and there are no crimes. This has to be a first in history.", "The Mueller report issued in March concluded that “the evidence does not establish that the President was involved in an underlying crime related to Russian election interference.” But it did not clear the president of the potential charge of obstruction of justice. “[I]f we had confidence after a thorough investigation of the facts that the President clearly did not commit obstruction of justice, we would so state,” special counsel Robert Mueller wrote. “Based on the facts and the applicable legal standards, we are unable to reach that judgment.”", "The report continued: “Our investigation found multiple acts by the President that were capable of exerting undue influence over law enforcement investigations, including the Russian-interference and obstruction investigations. The incidents were often carried out through one-on-one meetings in which the President sought to use his official power outside of usual channels. These actions ranged from efforts to remove the Special Counsel and to reverse the effect of the Attorney General’s recusal; to the attempted use of official power to limit the scope of the investigation; to direct and indirect contacts with witnesses with the potential to influence their testimony.”", "The articles of impeachment announced by House Democrats did not include an obstruction of justice charge related to the Russia investigation.", "But that doesn’t mean the Democrats have “admitted” there was no obstruction, as Trump put it.", "During the Democratic press conference announcing the two articles of impeachment against Trump, Rep. Jerry Nadler, chairman of the House Judiciary Committee, said that the actions underpinning the charge of “abuse of power” in the Ukraine investigation “are consistent with President Trump’s previous invitations of foreign interference in our 2016 presidential election.” When describing the second article, obstruction of Congress, Nadler said, “Here too, we see a familiar pattern in President Trump’s misconduct.”", "In the articles themselves, it states, after the “abuse of power” charge: “These actions were consistent with President Trump’s previous invitations of foreign interference in United States elections.” And as part of the obstruction of Congress charge, it states: “These actions were consistent with President Trump’s previous efforts to undermine United States Government investigations into foreign interference in United States elections.”", "On CNN, Jeffrey Toobin, a former federal prosecutor, said he “was struck by what Jerry Nadler said, the chairman of the Judiciary Committee about the 2016 election that what he said that there was pattern evidence. So, yes, it is true that there is not a separate article of impeachment for obstruction of justice in connection with the Mueller investigation. But he did say very clearly that the evidence of what went on in the Trump campaign in 2016 when he welcomed Russian assistance, and when he instructed his aides like Don McGahn to fire — to fire Robert Mueller. That is part of this story. And as this trial now almost certainly moves to the Senate you can be sure that the House managers, that is the members of the House who will be bringing the case will certainly mention what went on in 2016, even if it is — even if it is not a formal article of impeachment.”", "As for whether Trump committed any crimes related to the Ukraine investigation, Roll Call wrote: “The strategy to focus on constitutional violations rather than the criminal violations they had discussed — such as bribery, extortion, campaign finance or obstruction of justice — highlights how Democrats contend that a president does not have to commit a crime to be impeached.”", "“We didn’t need to name specific crimes in the articles because what we did encompasses all of that,” Democratic Rep. Mary Gay Scanlon told Roll Call.", "During a House hearing on the constitutional framework for impeachment, constitutional scholars brought by the Democrats and Republicans said a crime is not necessarily required for impeachment.", "Norman Eisen, House Judiciary Committee Democratic counsel: Now, Professor Gerhardt, does a high crime and misdemeanor require an actual statutory crime?", "Michael Gerhardt, a Democratic witness: No, there–it–it plainly does not. Everything we know about the history of impeachment reinforces the conclusion that impeachable offenses do not have to be crimes, and again, not all crimes are impeachable offenses. We look at, again, at the context and gravity of the misconduct.", "Eisen: And Professor Turley, you recently wrote in theWall Street Journal, and I quote, there is much that is worthy of investigation in the Ukraine scandal, and it is true that impeachment doesn’t require a crime.", "Jonathan Turley, a Republican witness: That’s true, but I also added an important caveat. First of all–", "Eisen: Sir, it was a yes or a no question. Did you write in the Wall Street Journal there is much that is worthy of investigation in the Ukraine scandal and it is true that impeachment does not require a crime? Is that an accurate quote, sir?", "Turley: That’s–you’ve read it well.", "Trump — admitting that he didn’t know if it was true or not — said he “heard” that former FBI lawyer Lisa Page had requested a restraining order against former FBI senior counterintelligence agent Peter Strzok, with whom Page had an affair.", "Trump: This poor guy, did I hear he needed a restraining order after this whole thing, to keep him away from Lisa? That’s what I heard. I don’t know if it’s true, the fake news will never report it, but it could be true.", "We don’t know where Trump got his information, but Page has denied that Strzok was ordered to keep away from her.", "“This is a lie. Nothing like this ever happened,” she wrote on Twitter the morning after the rally.", "Page’s tweet was in response to one from a Vox reporter who posted a video clip of Trump and wrote, “Trump spreads unsourced rumors about Lisa Page taking out a restraining order on Peter Strzok.”", "Since learning that Strzok and Page exchanged anti-Trump text messages while assigned to investigate Hillary Clinton’s use of personal email for government business while she was secretary of state, the president has accused both of bias in their handling of the Clinton and Russia investigations.", "Prior to repeating what he purportedly heard about a restraining order, Trump told the rally crowd: “We also know from a previous inspector general investigation that many of these same high-ranking officials were consumed with anti-Trump and anti-Trump people hatred and bias, texting about an insurance policy.”", "In its June 2018 report, the inspector general’s office said it was “deeply troubled” by the text messages sent by Strzok and Page, but the report said the IG found no evidence that their personal views about Trump influenced decisions that were made in the Clinton email investigation. The inspector general’s Dec. 9 report about the origins of the Russia probe similarly said that the messages between Strzok and Page “raised serious questions about the propriety of any investigative decisions in which Strzok and Lisa Page played a role.” However, the IG found neither was in a position to drive the investigation.", "The IG found that while Page “attended some of the discussions regarding the opening of the investigations, she did not play a role in the decision to open” them. And while Strzok was directly involved in decisions to open the cases on four Trump campaign officials, the report stated “he was not the sole, or even the highest-level, decision maker as to any of those matters.”", "Besides, Trump is ignoring the fact that the most recent IG report also said that there were anti-Clinton FBI investigators who traded messages, as well.", "According to a footnote in the report, one example included an agent who sent an instant message on Nov. 9, 2016, saying he was “so elated with the election,” comparing the election coverage to “watching a Superbowl comeback” and commenting about Clinton that he “didn’t want a criminal to be in the White House.”", "Still, the report said the inspector general reviewed the text messages of all of the FBI officials who participated in the decision to open the investigations and “did not identify any statements in those communications that indicated or suggested the decision could have been affected by political bias or other improper considerations.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]