["Tweet is from a fake account that used Meghan Markle's name and called itself \"parody.\"", "In her blockbuster interview with Oprah Winfrey, Meghan Markle disclosed extraordinary details about her experiences before and after departing royal life.", "But an image circulating on Facebook would have you believe Markle also tweeted a disclosure about Winfrey: \"Oprah was gagged, okay?\" reads a picture of what looks like a March 7 tweet from Markle that was published at 8:56 p.m. and included three images of Winfrey during the interview.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Markle didn’t tweet this. The screenshot shows a tweet from a parody account with the handle @MeghanMarkleHRH that appears to have since been taken down. When it was still in operation, its account profile noted that it was \"#parody.\"", "We find no evidence that Markle has her own public Twitter account.", "News reports around the interview did reference a nondisclosure agreement that Winfrey’s crew and staff had to sign, vowing not to reveal any information from the pre-recorded interview before it aired. But this parody tweet is unrelated to those reports.", "We rate this post Pants on Fire!", "Facebook post, March 7, 2021", "Video: \"CBS Presents Oprah with Meghan and Harry: A Primetime Special,\" March 7, 2021", "New York Times, \"Oprah, Meghan and Harry Draw 17.1 million viewers on CBS,\" March 8, 2021", "PolitiFact, \"A fake in 140 characters: How not to get tripped up by hoax Twitter accounts,\" March 14, 2017", "Newsweek, \"Why Doesn't Meghan Markle Have a Twitter Account? What We Know For Sure,\" Aug. 5, 2020", "Express, \"It’s watertight’ Meghan and Harry’s interview staff signing gagging orders.\" March 12, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]