["The photo was published here in a Facebook post on October 1, 2019.", "It has been shared more than 650 times since it was posted to a Facebook page with more than 10,000 followers on October 1, 2019.", "The traditional Chinese-language caption translates to English as: “Junius Ho has made a great effort to act pro-Communist, when in fact he is an American flag guard, so moved.", "“Flags flying on October 1, share and inform the 1.4 billion Chinese people!”", "Junius Ho is a pro-Beijing politician in Hong Kong.", "Tens of thousands of people marched through Hong Kong's streets on October 1 as China celebrated its 70th anniversary of Communist Party supremacy. Pro-democracy activists clashed with police, according to this AFP report published the same day.", "The term “national flag guard” emerged when Hong Kong celebrities, such as martial arts star Jackie Chan, pledged their loyalty to China in the face of rising anti-government and anti-Beijing sentiment in Hong Kong.", "Below is a screenshot of the misleading post:", "Some Facebook users appeared to recognise that the photo was doctored, but others suggested in comments on the post that they believed it was genuine.", "Some of the comments in traditional Chinese language translate to English as: “Traitor to Hong Kong colluding with foreign powers, feeling self-important because of that. I'm disappointed with lawyer Ho”; “So smart! Ho is pro-US”; and “Can't believe it when watching the livestream. But it's indeed true. I'm startled.”", "Below is a screenshot of these comments:", "The photo has also been shared dozens of times here and here on Twitter and here and here on Instagram alongside a similar claim.", "The claim is false; the image has been doctored from a photo of Ho waving the Chinese flag in Beijing.", "A search on Junius Ho’s verified Facebook page found this photo of him waving a Chinese flag on the Great Wall of China published in this post on October 2.", "The post’s Chinese-language caption translates to English as: “The real cannot be fake, the fake cannot be real! American cockroaches obviously really like this five-star-red-flag-raising look of mine and ‘borrowed’ it specifically to promote their flag!", "“Right now Chinese people all over the world are hoisting the Chinese flag out of patriotism, which knows no boundary!”", "The same photo was also published here on September 30 by Chinese news site imecchina.com, credited to Junius Ho.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo from Ho’s Facebook page (R):", "Ho talked about his trip to Beijing for China’s National Day in this September 30 video published by Chinese state media channel People’s Daily.", "Ho also published these photos of his visit to Tiananmen Square on October 1 on his Facebook page.", "A reverse image search on Google led to the photo that was used as the backdrop for the doctored image in the misleading posts. It was published by AFP here on September 8.", "Below is a screenshot of the AFP photo:", "The photo’s caption states: “Protesters wave US national flags as they march from Chater Garden to the US consulate in Hong Kong on September 8, 2019, to call on the US to pressure Beijing to meet their demands and for Congress to pass a recently proposed bill that expresses support for the protest movement. Pro-democracy activists planned to rally outside the US consulate in Hong Kong on September 8 as they try to keep international pressure on Beijing following three months of huge, sometimes violent, protests. Vivek Prakash / Afp”.", "AFP reported on the march to the US Consulate here on September 9.", "The AFP photo has been mirrored in the misleading posts. Below is a screenshot comparison of the photo in the misleading posts (L) and the AFP photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]