["A picture of an emaciated elderly man lying on a cot has been shared on social media with users identifying him as Bapu Surat Singh. Claims suggest that he has been on a hunger strike in solidarity with the protesting farmers. Facebook page ‘K9media’, which has shared misinformation several times in the past, posted this picture. (Archive link)", "Another Facebook page named ‘Kanhaiya Kumar – Youthicon‘ also shared the image and accompanying claim.", "So did Facebook user Manojsinh Parmar.", "The photo is viral on Facebook with the Hindi hashtag #बापूसूरतसिंह (#BapuSuratSingh).", "We performed a simple reverse image search and found a blog post from October 20, 2015 carrying the image. The man was identified in the post as 82-year-old human rights activist Bapu Surat Singh who had been on a hunger strike for 277 days. He was demanding the immediate release of political prisoners from minority communities, including Sikhs, who were behind bars despite having served their full sentences.", "A Facebook page titled ‘Bapu Surat Singh Khalsa – Sangharsh Jaari Hai’ shared this image on September 23, 2015.", "Sikh Relief – SOPW, a charity working for the civil rights of political prisoners, had also posted the image on their Facebook page on October 6, 2015. It also shared a second picture of the activist on September 21, 2015. According to the post, this picture was taken on the 250th day of his hunger strike.", "This slideshow requires JavaScript.", "According to a report by The Indian Express, dated December 6, 2015, an alleged video of Bapu Surat Singh consuming food had gone viral on social media. The report said that his son Ravi Indarjit Singh Gogi explained that his father’s condition had worsened considerably. He was taken to the hospital and given some injections following which did not remember that he was on a hunger strike. The reason that he was fed was due to his rapidly deteriorating health.", "On July 8, 2020, Sikh news portal Sikh 24 reported that the senior citizen had completed 2,000 days of his peaceful hunger strike on July 7, 2020. It also mentioned that he had originally begun fasting on January 16, 2015, and was being monitored at Ludhiana’s DMC Hospital. We also found a YouTube video from April 25, 2015 which stated that his hunger strike was motivated by the fight for human rights.", "Therefore, a 2015 picture taken during Punjab activist Bapu Surat Singh’s hunger strike for the release of political prisoners was recently shared in connection with the ongoing farmers’ protests. Similar photographs and videos of old and unrelated incidents have been falsely linked to these demonstrations multiple times.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]