["By Angelo Fichera", "Posted on April 8, 2020", "Viral posts wrongly suggest that the COVID-19 death toll is exaggerated because “the state” has instructed that “anyone who didnt die by a gun shot wound or car accident” be listed as a coronavirus victim. Experts say there is no such default classification — and that the U.S. death count is probably underestimated.", "Many experts believe the number of deaths linked to the novel coronavirus in the U.S. is likely higher than the figures available — due to factors such as an insufficient number of tests and inconsistent reporting across locales.", "One Facebook user has claimed the opposite, erroneously suggesting the count is being inflated by unrelated deaths, and copies of that claim have gone viral on the social media platform.", "The repeatedly shared posts — citing the user’s purported recollection of a woman’s claim on a “live broadcast” — argue that “the state” has instructed “that anyone who didnt die by a gun shot wound or car accident” should be “listed as covid 19 victims.” It claims “the numbers are a lie” and calls for an investigation.", "We attempted to contact the user responsible for the original post, to no avail, so we don’t know what “state” was being referenced. But there’s no evidence that any state has adopted a policy to classify all deaths, regardless of the individual circumstances, as being related to COVID-19.", "Sally Aiken, the president of the National Association of Medical Examiners, called the allegation “ridiculous.”", "“Death certificates are basically federal, and each state has a public health division that answers to the [U.S. Centers for Disease Control and Prevention] for death certification,” Aiken, the Spokane County, Washington, medical examiner, told us in an email. “For all practical purposes death certification is directed by the feds, via health departments.”", "Contrary to the Facebook posts, Aiken said, “Medical Examiners and Coroners certify hundreds to thousands of deaths each year, using investigation, autopsies, and medical tests as required, and do not choose a ‘default diagnosis’ such as COVID-19.”", "Aiken pointed out that CDC offers guidance to public health officials on the certification of COVID-19 deaths. The latest guidance was issued April 2.", "“If COVID–19 played a role in the death, this condition should be specified on the death certificate. In many cases, it is likely that it will be the [underlying cause of death], as it can lead to various life-threatening conditions, such as pneumonia and acute respiratory distress syndrome (ARDS),” the guidance says. “In these cases, COVID-19 should be reported on the lowest line used in Part I with the other conditions to which it gave rise listed on the lines above it.”", "The CDC advises that officials should report deaths in which the patient tested positive for COVID-19 — or, if a test isn’t available, “if the circumstances are compelling within a reasonable degree of certainty.” It further indicates that if a “definitive diagnosis cannot be made … but it is suspected or likely … it is acceptable to report COVID-19 on a death certificate as ‘probable’ or ‘presumed.'”", "One hypothetical example cited by the CDC is an 86-year-old woman dying after exhibiting symptoms such as a high fever, severe cough, and difficulty breathing, “after being exposed to an ill family member who subsequently was diagnosed with COVID-19.” The CDC says that “probable COVID-19” may be listed as the underlying cause of death — a deduction made “given the patient’s symptoms and exposure to an infected individual.”", "There was renewed attention given to the theory of the death toll being inflated after Dr. Deborah Birx, coordinator of the White House Coronavirus Task Force, said during an April 7 press conference that “if someone dies with COVID-19, we are counting that as a COVID-19 death.”", "Michael Baden, a former chief medical examiner of New York City and a high-profile pathologist, told Fox News that it’s reasonable to include people with the virus, who also had other health issues, in the count.", "“In the normal course, autopsies would then determine whether the person died of the effects of the COVID virus, whether the person had a brain tumor or brain hemorrhage for example that might be unrelated to it and what the relative significance of both the infection and the pre-existing disease is,” he said. Even if the number of autopsies being conducted are low because of concerns of infection, he said, “then you will include in those numbers some people who did have a pre-existing condition that would have caused death anyway, but that’s probably a small number.”", "Likewise, Marc Lipsitch, a professor of epidemiology at Harvard University, told us in an email: “There are going to be some people who die of something else, happen to have COVID and get tested, and get counted as COVID deaths but would die anyway. It would be wrong to say that number is zero. However given current testing shortages and protocols, the number of such cases will be small.”", "“A greater issue is errors in the other direction — deaths caused by COVID that are not counted as such,” he said.", "Lipsitch cited at least two reasons for that underreporting: Someone having and dying from clear COVID-19 respiratory symptoms but never being tested (especially early in the epidemic, when tests were scarce). Or, he said, someone dying from causes, such as a heart attack or stroke, triggered by the infection — with no one ever suspecting or testing for the disease.", "This is not an isolated issue: A 2013 study of the 2009 H1N1 pandemic in the U.S. found that lab-confirmed tests accounted for only about 1 in every 7 deaths attributable to the disease.", "“So overall it seems likely that while a few individuals who would have died anyway are getting called COVID deaths, there are [many] more deaths caused by COVID that are not being attributed to COVID,” Lipsitch said. And it is “simply not true that anyone who dies of something other than a car accident or gunshot wound is attributed to COVID.”", "In New York City, an epicenter for the outbreak with more than 4,000 reported deaths, Mayor Bill de Blasio said the city had not been counting the many deaths happening at home if the individuals had not been confirmed to have the disease. After a WNYC and Gothamist report on a sharp increase in the number of daily deaths happening at home in the city — and the suspected undercounting of cases — city officials said they would begin to include suspected cases in their counts.", "Gary Watts — the coroner for Richland County, South Carolina, and president of the International Association of Coroners & Medical Examiners — also told us that the notion that the numbers of COVID-19 deaths are somehow being inflated didn’t make sense to him.", "Watts said in a phone interview if an individual with a pre-existing condition, such as a heart disease or COPD, gets the virus, “COVID-19 is going to be a very detrimental complication to your already existing disease.” Someone could live for years with COPD, for example, then die within weeks after getting COVID-19. In such cases, when the person is confirmed to have the virus, COVID-19 would be listed as a contributing factor.", "In terms of known COVID-19 related deaths in hospitals, Watts said hospitals certify deaths and report that information. He said his office is only conducting postmortem tests for COVID-19 in limited cases — if the decedent was healthy, for example, and family indicated he or she had COVID-19 symptoms, such as fever, cough, or shortness of breath.", "Watts said the purpose is to determine the cause of death but also “as a safety precaution for the first responders” who had contact with the individual. But if there was a clear cause of death — say, a stabbing — with no relation to COVID-19, Watts said he would not include the disease, even if the decedent tested positive.", "“If it was not related to the cause of death, then I’m not going to list it,” he said.", "As of April 8, there have been more than 14,000 COVID-19 related deaths reported in the U.S., according to a count compiled by Johns Hopkins University.", "“The true facts are that COVID-19 deaths will likely be underreported on death certificates and not over-reported,” Aiken said. “This will be especially true as deaths that occur in homes, and not the hospital, mount. Not all jurisdictions are able to test home deaths with typical symptoms for COVID-19.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Aiken, Sally. President, National Association of Medical Examiners. Email to FactCheck.org. 7 Apr 2020.", "Brown, Emma, et. al. “Coronavirus death toll: Americans are almost certainly dying of covid-19 but being left out of the official count.” Washington Post. 5 Apr 2020.", "Casiano, Louis. “Birx says government is classifying all deaths of patients with coronavirus as ‘COVID-19’ deaths, regardless of cause.” Fox News. 7 Apr 2020.", "Charu, Vivek, et. al. “Mortality burden of the 2009‐10 influenza pandemic in the United States: improving the timeliness of influenza severity estimates using inpatient mortality records.” Influenza and Other Respiratory Viruses. 19 Feb 2013.", "“Coronavirus COVID-19 Global Cases.” Center for Systems Science and Engineering, Johns Hopkins University. Accessed 7 Apr 2020.", "“Guidance for Certifying Deaths Due to Coronavirus Disease 2019 (COVID–19).” Vital Statistics Reporting Guidance. National Center for Health Statistics, U.S. Centers for Disease Control and Prevention. 2 Apr 2020.", "Hogan, Gwynne. “Death Count Expected To Soar As NYC Says It Will Begin Reporting Probable COVID Deaths In Addition To Confirmed Ones.” WNYC/Gothamist. 8 Apr 2020.", "Lipsitch, Marc. Professor of epidemiology, Harvard University. Email to FactCheck.org. 8 Apr 2020.", "“Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing.” White House. 7 Apr 2020.", "Watts, Gary. Coroner, Richland County, South Carolina. Phone interview with FactCheck.org. 6 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]