["By Angelo Fichera", "Posted on February 5, 2021 | Updated on February 10, 2021", "Headlines shared on social media distort the facts of a recent order by the Centers for Disease Control and Prevention that mandates face masks be worn on public transportation. The order doesn’t require that individuals wear two masks. CDC guidance issued with the order does say that cloth masks should be made of at least two layers.", "Multiple lines of evidence back the use of face masks to protect against the coronavirus, although some uncertainty remains as to how effective mask interventions are in preventing spread in the community.", "Lab tests, for example, show that certain masks and N95 respirators can partially block exhaled respiratory droplets or aerosols, which are thought to be the primary ways the virus spreads.", "Observational studies, while limited, have generally found mask-wearing to be associated with a reduced risk of contracting the virus or fewer COVID-19 cases in a community.", "A few randomized controlled trials have found that providing free masks and encouraging people to wear them results in a small to moderate reduction in transmission, although these results have not always been statistically significant.", "Masks should not be viewed as foolproof, as no mask is thought to offer complete protection to the wearer or to others. The Centers for Disease Control and Prevention recommends that people wear the most protective mask that fits well and can be worn consistently. Loosely woven cloth masks are the least protective. Layered, tightly woven cloth masks offer more protection, while well-fitting surgical masks and KN95 respirators provide even more protection and N95 respirators are the most protective.", "Link to this", "Some independent experts are now advising that wearing two masks — such as a cloth mask paired with a surgical mask — in some situations could provide greater benefit when it comes to controlling the spread of the novel coronavirus. The advice to improve masks comes as the U.S. documents cases of more transmissible variants of the virus.", "Whether the Centers for Disease Control and Prevention will officially endorse the advice of double-masking isn’t yet known. Officials have said they are currently exploring relevant data, and a CDC spokesperson told us the agency hopes to offer additional insight next week.", "(Update, Feb. 10: The CDC has now posted the results of a lab experiment that found that a cloth mask worn over a medical procedure mask can significantly improve the fit and effectiveness of the masks. The CDC’s website now suggests that form of double-masking as one modification for better protection.)", "But the federal agency has not issued a “demand” that the public wear two masks, as a headline shared on social media claims.", "A recent video by the “Ron Paul Liberty Report” on YouTube, viewed more than 18,000 times, was titled: “CDC Now Demands TWO Masks – Science…Or Tyranny?”", "That’s wrong. And those who watch the video are presented with a muddied take on a recent order by the CDC that stipulates that those using public transportation must wear a mask. The order went into effect Feb. 1.", "More than seven minutes into the video, a co-host of the show, Daniel McAdams, shows a headline from ZeroHedge, an unreliable website with a history of peddling misinformation, that reads: “Medical Tyranny: CDC Announces All Travelers Must Wear Two Masks, Threatens Arrest.”", "(In an example of how misinformation spreads, ZeroHedge actually credits the faulty report to another website, “Planet Free Will.” And that website had republished the story after it appeared on the conspiracy theory website InfoWars.)", "The “Liberty Report” video then points to a CNN report about the CDC’s order. That article said, in part, “[t]he coverings need to be at least two or more layers of breathable fabric secured to the head with ties, ear loops or elastic bands — and scarves and bandanas do not count, the order says.”", "The actual text of the order simply defines “masks” as “a material covering the nose and mouth of the wearer, excluding face shields.” A footnote adds that, “Masks can be either manufactured or homemade and should be a solid piece of material without slits, exhalation valves, or punctures.”", "The CNN report was referencing the CDC’s guidance issued with the order. That guidance says that cloth masks, among other attributes, “should be made with two or more layers of a breathable fabric that is tightly woven (i.e., fabrics that do not let light pass through when held up to a light source).” (Emphasis is ours.)", "But a mask “made with two or more layers” is not the same as two masks, as the video and headlines claim.", "Dr. Monica Gandhi, an infectious diseases doctor and professor of medicine at the University of California, San Francisco, told us the recommendation that cloth masks be made with at least two layers has been around “for some time as one layer is not very efficient at filtering virus.”", "In fact, the CDC’s own website instructed as much months before President Joe Biden took office — so it isn’t some new guidance related to the transportation order. A CDC page about face masks archived on Aug. 27, 2020, advised: “Wear masks with two or more layers to stop the spread of COVID-19.”", "Many face masks available for purchase are made with more than one layer.", "The CDC spokesperson, Jason McDonald, reiterated to us in an email that the CDC website “recommends wearing masks with 2 or more layers of washable, breathable fabric. If you’re wearing a cloth mask, the layers of fabric should be tightly woven and you should not be able to see light through it.”", "He added: “If the mask you have is a single layer of fabric, you could wear another one on top to achieve the recommended level of protection.”", "In other words, you could double-up a cloth mask that only has one layer to create a covering that meets the two-layer recommendation.", "Gandhi said in an email that her recommendation — through her work with Linsey Marr, a professor of civil and environmental engineering at Virginia Tech — “is to use a cloth mask with a filter inside when indoors in areas where high rates of transmission are occurring. So, two pieces of cloth with a filter inside since the filter blocks the virus electrostatically and the cloth blocks it physically.”", "It’s worth noting that while the text of the CDC order on wearing masks on public transportation says it “reserves the right” to enforce the order through criminal penalties, it said it “does not intend” to rely on such penalties — and instead anticipates voluntary compliance.", "The “Liberty Report” video goes on to present a video clip of Dr. Anthony Fauci saying, “There are many people who feel, you know, if you really want to have an extra little bit of protection, maybe I should put two masks on. There’s nothing wrong with that. But there’s no data that indicates that that is going to make a difference.”", "That was during a Jan. 28 live-stream video with the American Federation of Teachers and the National Education Association.", "Fauci, director of the National Institute of Allergy and Infectious Diseases, went on to say that while the CDC had not changed its mask guidance, the agency would continue to review data on the issue. “But the bottom line is, the minimum thing you need to do is always wear a mask under circumstances when you’re in settings, where you’re with people, or you’re in congregate settings,” he said.", "During a Feb. 3 briefing (at 23:15), he made a similar point, saying that the CDC would continue to update recommendations based on data. CDC Director Rochelle Walensky agreed, saying her agency was “actively looking” at the matter and “more data will be forthcoming from the CDC with regard to the value of double-masking.”", "Editor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over our editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.", "“Dr. Fauci joins AFT and NEA for vaccine discussion.” American Federation of Teachers. YouTube. 28 Jan 2021.", "“Federal Register Notice: Wearing of face masks while on conveyances and at transportation hubs.” Centers for Disease Control and Prevention. Updated 2 Feb 2021.", "Gandhi, Monica. Infectious diseases doctor and professor of medicine, University of California San Francisco. Email to FactCheck.org. 4 Feb 2021.", "Godoy, Maria. “5 Hacks And Tips To Make Your Face Mask More Protective.” NPR. 3 Feb 2021.", "“How to Select, Wear, and Clean Your Mask.” Centers for Disease Control and Prevention. Archived 27 Aug 2020.", "Hanna, Jason, and Madeline Holcombe. “Maryland becomes 2nd state to report coronavirus variant first identified in South Africa.” CNN. Updated 31 Jan 2021.", "McDonald, Jason. Spokesperson, Centers for Disease Control and Prevention. Email to FactCheck.org. 4 Feb 2021.", "McDonald, Jessica. “What Do the New Coronavirus Variants Mean for the Pandemic?” FactCheck.org. Updated 28 Jan 2021.", "Reddy, Sumathi. “Double Face Masks? N95? Protect Yourself Against New Covid-19 Variants With These Mask Upgrades.” Wall Street Journal. 4 Feb 2021.", "“White House COVID-19 Response Team Holds Briefing.” C-SPAN. 3 Feb 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]