["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As thousands of Floridians faced the threat of a massive flood insurance hike in 2014, a deluge of protests from homeowners led Congress to delay some of the heftiest increases.", "Now U.S. Rep. Joe Garcia, D-Miami, says in a Sept. 5 Web ad that his Republican opponent Carlos Curbelo \"supported raising flood insurance rates.\"", "That’s a serious charge in Garcia’s district, which includes many homeowners in flood-prone Miami-Dade and Monroe counties. A few days later, the Garcia campaign unveiled a TV ad that makes a similar charge that Curbelo would let rates \"skyrocket.\"", "We dove right in to search for the facts: Has Curbelo supported raising flood insurance rates?", "Federal and state flood insurance laws in 2014", "Congress and the Florida Legislature have taken action on flood insurance during the past few years. But Curbelo, a Miami-Dade school board member, hasn’t participated in those votes.", "Curbelo told PolitiFact Florida in an interview that he does not want to get rid of the National Flood Insurance Program but does agree with a new Florida law that made it easier for private companies to step in.", "The Garcia campaign argues that Curbelo’s comments during two GOP primary debates show he supports raising flood insurance rates. Curbelo’s statements relate to federal and state bills about flood insurance -- we’ll recap both pieces of legislation.", "The Biggert-Waters Flood Insurance Act of 2012 overhauled the National Flood Insurance Program, which insures more than five million properties nationwide, including about two million in Florida. The bill sought to avoid insolvency for the program -- as of July 2013, it owed about $24 billion.", "For some policyholders, the bill translated to skyrocketing rates. Residents, well, flooded Congress with complaints, and lawmakers reversed much of their earlier reforms. In March 2014, Obama signed the  Homeowner Flood Insurance Affordability Act, which lowered the rate increases on some policies and prevented some future increases.", "The Florida Legislature sought its own solution in 2014. Some private companies were already offering flood insurance, but SB 542 made it easier for them to offer more flexible and potentially cheaper plans. Gov. Rick Scott signed the bill in June, but no new companies have started selling policies, and the vast majority remain through the federal program.", "Experts predict slow growth in the private sector as it will take time for companies to figure out where they can profitably write policies.", "\"It will take a decade well past this November for the private market to emerge slowly,\" said Jay Neal, president of the Florida Association for Insurance Reform.", "The two main companies offering private flood insurance in Florida are currently offering cheaper rates than the federal program, said Richard Koon, Florida’s deputy insurance commissioner. But the situation remains in flux -- the national program is expected to revise rates, and some companies might want to see if Congress will make future changes.", "Curbelo’s debate statements about flood insurance", "Flood insurance laws emerged as topics in GOP primary debates in Congressional District 26. Here was part of Curbelo’s statement in the June debate:", "\"Our rates here in this district are going up because of things that are happening in other parts of the country. So like with everything else I am for a market-driven solution. We should allow the private sector to step in. Florida already started doing that because Congress failed to address this issue with its supposed fix that Mr. Garcia is going around town talking about. They failed so the state of Florida stepped in and has encouraged private companies to fill this need. So we should continue allowing that process to grow. And again -- when the market fails and only when the market fails -- the federal government should step in to help.\"", "During a debate moderated by CBS4’s Jim DeFede, Curbelo (and all the participating candidates) said they would have voted in favor of the Biggert-Waters fix passed by Congress that capped certain annual increases at 18 percent.", "Curbelo: \"I would have voted yes recognizing that it is a bandaid and that it does not solve the long term-problem.\"", "DeFede: \"I thought though you had given some comments you didn’t think it was Congress’ place to interfere win the market which is essentially what this is doing by capping the increases.\"", "Curbelo: \"My position is Congress should not interfere with the market unless the market fails. If the market fails, that’s when government intervention is acceptable.\"", "A couple minutes later, Curbelo added some criticisms of the federal program: \"Florida is a major donor state. We make investments in infrastructure, we prepare for storms in this state and we don’t get a whole lot of credit for it. Florida shouldn’t be treated unfairly under NFIP and that should have been one of the reforms that Congress passed.\"", "(A study concluded that several states, including Florida, pay more into the program than they receive in claims.)", "Curbelo clearly talked about allowing private companies to provide flood insurance. So how does Garcia reach the conclusion that that would raise rates?", "Garcia points to news articles that explain that historically the federal program kept rates artificially low for homeowners, while private insurance was prohibitively expensive.", "But some of the articles also showed that it remains to be seen what will happen in the future as private companies enter the market.", "The Palm Beach Post wrote in March 2014 that supporters of the state bill \"portray it as the start of a new era of more flexible, affordable private options.\"", "Evan Hecht, CEO of a Gainesville business representing Lloyd's of London syndicates, told the Wall Street Journal  that \"the proposed (federal) legislation appears to allow potentially millions of people to continue to pay below-market rates, which the private sector wouldn't want to compete with.\"", "But the article also paraphrased Paresh Patel, the chief executive of HCI Group in Tampa as saying \"that by carefully selecting homes to cover and pairing the protection with a homeowners' policy, HCI could charge less than the new rates and still make a profit.\"", "Our ruling", "Garcia’s ad says that \"Curbelo supported raising flood insurance rates.\"", "It’s a stretch to imagine a candidate campaigning in Miami and the coastal Keys who would tell voters that he wants to raise their flood insurance bill -- and in reality, Curbelo hasn’t done that. For starters, Curbelo hasn’t taken a vote on federal or state flood insurance.", "The Garcia campaign says that if Curbelo supports private companies providing flood insurance, that means he supports higher rates. That’s a huge distortion. Curbelo says he supports private companies and in hopes that competition will lower rates.", "Pushing competitively priced private insurance is not pushing for higher premiums. We rate the statement False.", "U.S. Rep. Joe Garcia campaign, Web ad about Carlos Curbelo and flood insurance, Sept. 5, 2014", "U.S. Rep. Joe Garcia campaign, Clip of Carlos Curbelo at Congressional 26 GOP primary debate, June 23, 2014", "GOP TV Miami, Congressional 26 GOP primary debate Part 4, June 23, 2014", "CBS4, Congressional 26 GOP primary debate, Aug. 24, 2014", "Florida House, Senate Bill 542 Flood insurance, Signed by Gov. Rick Scott June 13, 2014", "FEMA, National Flood Insurance Program policies in force, 2013", "FEMA, National Flood Insurance Program, Accessed Sept. 10, 2014", "FEMA, Flood Insurance Reform, Accessed Sept. 10, 2014", "Florida Office of Insurance Regulation, Flood insurance writers in Florida, Accessed Sept. 11, 2014", "U.S. Government Accountability Office, National Flood Insurance Program, Sept. 18, 2013", "TIME, \"Should the federal government be subsidizing flood insurance?\" Oct. 30, 2012", "New York Times, \"Cost of flood insurance rises, along with worries,\" Oct. 13, 2013", "Wall Street Journal, \"Private insurers start to offer flood coverage,\" Feb. 25, 2014", "Palm Beach Post, \"Florida woos private flood insurance, but trickle likely,\" March 29, 2014", "PolitiFact, \"Rick Scott says Floridians pay far more into flood insurance than they get back in claims,\" Sept. 25, 2013", "PolitiFact’s Scott-O-Meter, \"Reform Citizens Insurance to consistently operate on actuarially sound rates,\" Last update Sept. 27, 2013", "Interview, Carlos Curbelo, Republican candidate for Congress, Sept. 9, 2014", "Interview, Wadi Gaitan, spokesman for Carlos Curbelo’s Congressional campaign, Sept. 8, 2014", "Interview, Miguel Salazar, spokesman for U.S. Rep. Joe Garcia’s campaign, Sept. 8, 2014", "Interview, Michael Runestad, FEMA spokesman, Sept. 9, 2014", "Interview, Amy Bogner, Florida Office of Insurance Regulation spokeswoman, Sept. 9, 2014", "Interview, Richard Koon, Florida Office of Insurance Regulation deputy commissioner, Sept. 12, 2014", "Interview, Donovan Brown, Property Casualty Insurance Association of America counsel for state government relations, Sept. 11, 2014", "Interview, Jay Neal, Florida Association for Insurance Reform president, Sept. 11, 2014", "Interview, John Hennelly, U.S. Rep. Joe Garcia campaign spokesman, Sept. 12, 2014", "Interview, Don Griffin, Property Casualty Insurers Association of America vice president of personal lines, Sept. 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]