["About this rating", "Historically, some vaccines and other injections have contained a mercury-based preservative called thimerosal. An early and scientifically unsubstantiated anti-vaccine talking talking point includes the claim that the compound’s presence in childhood vaccines is responsible for an increase in autism rates. The fact that autism rates are still climbing (despite the fact that childhood vaccines no longer contain this ingredient) has hindered this specific interpretation of thimerosal risk, but not its general use as a scare tactic.", "Thimerosal is included in a handful of specific flu vaccine formulations packaged in multi-use vials; despite this, mercury from thimerosal is still frequently cited in efforts to make children’s vaccines sound like a health risk. A recent example of this guilt-by-spurious-association came from Robert F. Kennedy Jr., a long-time sower of vaccine safety fears, who said on a 20 April 2017 appearance on \"Tucker Carlson Tonight\":", "[Mercury] is the most potent neurotoxin known to man that is not radioactive. How can we inject that into a child? If you take that vaccine vial and break it, you have to dispose of that as hazardous waste. You have to evacuate the building.", "We attempted to contact Mr. Kennedy through multiple avenues to ask him what on information he based that statement. After sending a message to the e-mail address listed for him on the Pace University Law School web site (where Kennedy holds a professorship), we received a response from a different individual named who identified himself as Frederick Spendlove, whose email did not appear to be associated with Pace University.", "Spendlove did not respond to our questions about his role in Kennedy’s work or his authority to speak on Kennedy’s behalf, but he did send us four loosely connected documents that, he said, demonstrated that an evacuation would be the common protocol.", "Two of the documents regarded mercury’s classification as a hazardous chemical. One was a memo from the North Dakota Department of Health from January 2010, addressed to various local immunization providers. The second was a flyer from the Wisconsin Department of Natural Resources:", "According to state and federal hazardous waste management requirements, discarded Thimerosal-preserved vaccines need to be managed as hazardous waste, using the waste code D009 (mercury).", "Spendlove, as well, sent us a link to Missouri State University’s “Hazardous Waste & Hazardous Materials Contingency Plan” in defense of the claim that a building need be evacuated if a vaccine vial breaks. This document states that spills equal to or smaller than the amount of mercury found in a fever thermometer could be handled with a mercury spill kit:", "A spill of elemental mercury, such as with the breaking of a thermometer, may result in the release of harmful mercury vapors. Environmental Management has a vacuum that is specifically designed to clean up mercury spills and eliminate the release of mercury vapors. Only the aforementioned recovery system should be used in response to mercury spills involving more than a small thermometer. For spills involving small thermometers, mercury spill kits are available in the chemistry stockroom at Temple Hall.", "Both the MSU document and the last document sent by Spendlove, a Centers for Disease Control and Prevention poster titled “Don't Mess With Mercury” both make the case that a thermometer-scale spill would require a spill kit and the necessity to allow the room to ventilate for 24 hours. This is a far cry from a building-wide \"evacuation\":", "Ignoring the fact that the ethylmercury in thimerosal differs chemically from the elemental mercury in thermometers in significant ways, the relevance of these documents to Kennedy’s claim hinge on the assumption that that the amount of mercury contained in a vaccine is an anyway comparable to the amount of mercury contained in a thermometer. It is not. A small fever thermometer typically contains about 610,000 micrograms of mercury. For comparison, a broken 10 dose multi-use flu shot vial would contain about 250 micrograms of mercury — about 0.04 percent of that in the broken thermometer.", "For further comparison, this puts the amount of mercury released by a broken 10-dose flu shot vial at an order of magnitude above the amount of mercury found in a three-ounce can of tuna (around 65 micrograms), but an order of magnitude below the amount released from a broken CFL light bulb (around 3000-5000 micrograms). Neither events would necessitate evacuating the building, no matter how pungent the tuna may be.", "We reached out to the CDC to see if these broader guidelines regarding elemental mercury spills apply, at least on a federal level, to a broken vaccine vial containing thimerosal. While acknowledging that state and local regulations may differ, a representative told us that there is no federal requirement that a building be evacuated if a vaccine vial breaks.", "We are in no way arguing that mercury is not a neurotoxic substance, nor are we disputing that it is classified as a hazardous chemical. What we do dispute is that its classification as a hazardous chemical makes its spill a large-scale emergency that necessitates a building wide evacuation, specifically when talking about the amount found in a multi-use flu vaccine vial.", "We rank this aspect of the claim as false, as the CDC itself disputes the characterization of its own document when used to make the argument and because Mr. Kennedy’s claims rest on comparing two things of completely different scales without providing any relevant context.", "Centers for Disease Control and Prevention.   \"Thimerosal in Vaccines.”\r\n    Accessed 15 May 2017.", "Taylor, Luke. E., et al.   \"Vaccines Are Not Associated With Autism: an Evidence-based Meta-analysis of Case-control and Cohort Studies.\"\r\n    Vaccine.   17 June 2014.", "Pediatrics.   \"Joint Statement of the American Academy of Pediatrics (aap) and the United States Public Health Service (usphs).\"\r\n    1 September 1999.", "Centers for Disease Control and Prevention.   \"Understanding Thimerosal, Mercury, and Vaccine Safety.”\r\n    Accessed 15 May 2017.", "Mnookin, Seth.   \"How Robert F. Kennedy, Jr., Distorted Vaccine Science.\"\r\n    Scientific American.   11 January 2017.", "Fox News Video.   \"RFK, Jr: I'm Not Anti-Vaccine, But We Need More Analysis\"\r\n    20 April 2017.", "Wisconsin Department of Natural Resources.   \"Managing Excess Vaccines.\"\r\n    March 2014.", "Missouri State University.   \"Hazardous Waste & Hazardous Materials Contingency Plan.\"\r\n    Accessed 15 May 2017.", "Centers for Disease Control and Prevention.   \"Don’t Mess With Mercury”\r\n    Accessed 15 May 2017.", "Food and Drug Administration.   \"Afluria Package Insert.”\r\n    Accessed 15 May 2017.", "Food and Drug Administration.   \"Flulaval Package Insert.”\r\n    Accessed 15 May 2017.", "Food and Drug Administration.   \"Fluvirin Package Insert”\r\n    Accessed 15 May 2017.", "Food and Drug Administration.   \"Fluzone Package Insert.”\r\n    Accessed 15 May 2017.", "Lee, Cheng-Shiuan, et al.   \"Declining Mercury Concentrations in Bluefin Tuna Reflect Reduced Emissions to the North Atlantic Ocean.\"\r\n    Environmental Science and Technology.   10 November 2016.", "Stemp-Morlock, Graeme.   \"Mercury: Cleanup for Broken CFLs.\"\r\n    Environmental Health Perspectives.   September 2008.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]