["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Posts around the nation warn people not to open their doors to imposters who say they are doing coronavirus testing but actually want to rob the residents.", "Like other such claims, this one about an alleged scam in Stockton, Calif., is false, according to police.", "We’ve knocked down false Facebook posts claiming that criminals are going door to door posing as coronavirus testers as a ruse for robbing people inside their homes.", "Now comes an image shared on a Facebook post that adds a new wrinkle.", "It appears to be a photograph of a flyer for residents of an apartment complex. The headline on the flyer, with a grammatical error, says: \"Do no open your door!!!\" Below it are illustrations of two people in hazmat suits.", "The flyer says people in hazmat suits are going door to door in Stockton, California, posing as health department officials who want to check the temperatures of residents or check them for COVID-19. \"They will enter your home and physically attempt robbery, or they may ask you important personal information to steal your identity,\" the poster says.", "Stockton, in California’s Central Valley, has a population of more than 300,000.", "The flyer advises people to call Stockton police if they witness such a scam. The phone number listed is the main non-emergency number for the department.  In smaller print at the bottom of the poster, it reads \"Thank you — Courtyards Management and Staff.\" It is dated March 18, 2020.", "The image was posted on Facebook the next day by a person who wrote: \"This is happening in Stockton.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On the same day this claim was posted, Massachusetts State Police announced in response to a similar claim on Facebook \"that at least one such incident may have occurred in central Massachusetts.\"", "But Stockton Police public information officer Joe Silva told PolitiFact on March 26, 2020, that police are aware of the social media rumors about his town and that they are false.", "\"No reported incidents of that happening in our city,\" he said.", "Police departments around the country have warned citizens that coronavirus testing is not being done door to door, so people who encounter strangers offering testing this way have reason to be suspicious. But several of the online posts warning about robbers going door to door in various cities have proven to be just rumors.", "So, why are such posts being made, and shared?", "Many social media users respond to news that brings \"high levels of anxiety and fear,\" said Niklas Myhr, a marketing and economics professor at Chapman University in Orange, California, who calls himself the social media professor. \"Their motives could range from a genuine willingness to help those in need, to more opportunistic ones such as taking advantage of emotionally vulnerable people.\"", "The algorithms of social media platforms \"quickly pick up on signals of content being engaging and makes it more available in broader circles,\" Myrh said.", "The person who posted the flyer image on Facebook told PolitiFact that he did so after a friend sent him a picture of the flyer; the friend had seen the flyer on the door of a house he was working on.", "\"Anyone in their right mind would do the same thing as a precaution to protect others from harm,\" he said via Facebook Messenger.", "A Facebook post shows an image of a flyer claiming that people wearing hazmat suits are offering coronavirus tests as a ruse to get in homes and rob people in Stockton, Calif.", "Police in Stockton say they’ve received no such reports.", "We rate the statement False.", "Facebook, post, March 19, 2020", "Interview, Stockton police public information officer Joe Silva, March 26, 2020", "Reuters, \"Partly false claim: People are offering scam door-to-door coronavirus tests to rob people,\" March 24, 2020", "Twitter, Davie, Florida, police tweet, March 20, 2020", "Nixle, Montville, New Jersey, police alert, March 23, 2020", "Post Bulletin, \"CDC is not going door-to-door: Law enforcement warns of scams,\" March 18, 2020", "Email, Chapman University clinical associate professor of marketings and economics Niklas Myhr, March 26, 2020", "NBC News, \"Door-to-door 'coronavirus tester' hoax circles the globe, boosted by local media and police departments,\" March 23, 2020", "Facebook, Massachusetts State Police post, March 19, 2020", "Email, University at Buffalo geography professor Monica Stephens, March 26, 2020", "WHDH-TV, \"Massachusetts State Police warn of potential scammers amid coronavirus pandemic,\" March 20, 2020", "U.S. Centers for Disease Control and Prevention, \"Testing for COVID-19,\" accessed March 26, 2020", "Facebook Messenger, Facebook poster messages, March 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]