["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late July 2020, Snopes readers began inquiring about news reports that a person killed in a motorcycle crash had been listed as a COVID-19 death in Florida.", "Florida was among states experiencing a surge in COVID-19 cases amid the ongoing pandemic, but political leaders including U.S. President Donald Trump and Trump supporters such as Florida Gov. Ron DeSantis were criticized for downplaying the virus.", "During a press conference July 20, DeSantis pointed to the case of the motorcyclist, saying:", "The other thing I’ve asked the Department of Health to look at is there was a case here in Central Florida where somebody, I think they were in their twenties, and they were in a motorcycle accident, and that was counted as a coronavirus death. And a lot of people are like, \"How is that possible? You get hit by a car and then you’re attributing it to coronavirus?\" And so I want them to go back and look. I think though, the reason that’s the case is because what [Centers for Disease Control and Prevention] has said is anybody that tests positive, if they then die, that’s a death amongst cases.", "Contrary to what DeSantis stated, Centers for Disease Control and Prevention (CDC) guidance doesn't direct caregivers to list all deaths as COVID-19 deaths simply because the disease was detected in the decedent. Instead, it instructs caregivers to list various factors contributing to death in appropriate sections of death certificates. In other words, it does not state that anyone who suffers an unnatural death such as a traffic accident should be listed as a COVID-19-caused death if they also happen to test positive, even if the disease didn't cause to their death.", "It does appear to the case, however, that a motorcyclist who was killed in a traffic accident also tested positive for COVID-19, and was initially listed among Florida's COVID-19-related deaths. But officials from the Florida Department of Health said that person has since been removed from the count.", "The story about the motorcyclist was initially reported by WOFL, an Orlando-based TV news station, which learned the information in a phone conversation with Orange County Health Officer Dr. Raul Pino. In the July 17 article, WOFL reported:", "A person who died in a motorcycle accident was added to Florida’s COVID-19 death count, according to a state health official.", "FOX 35 News found this out after asking Orange County Health Officer Dr. Raul Pino whether two coronavirus victims who were in their 20s had any underlying conditions. One of his answers surprised us.", "“The first one didn’t have any. He died in a motorcycle accident,” Pino said.", "Dr. Pino was asked if the man’s data was removed.", "“I don’t think so. I have to double-check,” Pino said. “We were arguing, discussing, or trying to argue with the state. Not because of the numbers -- it’s 100…it doesn’t make any difference if it's 99 -- but the fact that the individual didn’t die from COVID-19…died in the crash. But you could actually argue that it could have been the COVID-19 that caused him to crash. I don’t know the conclusion of that one.”", "WOFL updated the story two days later to indicate that the motorcyclist death had been removed from the COVID-19 death tally. Kent Donahue, a spokesman for Pino's office, confirmed that to be the case in a phone interview with Snopes. We therefore list this claim as \"Outdated.\"", "Pipitone, Tony.   \"As Death Toll Soars, Fla. Governor Questions Accounting.\"\r\n    WTVJ.   20 July 2020.", "Lama, Danielle.   \"FOX 35 INVESTIGATES: Questions Raised After Fatal Motorcycle Crash Listed As COVID-19 Death.\"\r\n    WOFL.   17 July 2020.", "WESH.   \"Coronavirus: Florida Records Highest One-Day COVID-19 Death Toll.\"\r\n    23 July 2020.", "Swisher, Skyler.   \"As COVID-19 Cases Pile Up, Gov. Ron DeSantis Follows Trump’s Virus Playbook. Will It Cost the GOP in 2020?\"\r\n    Sun Sentinel.   10 July 2020.", "Palma, Bethania.   \"Are CDC Guidelines for Reporting COVID-19 Deaths Artificially Inflating Numbers?\"\r\n    Snopes.com.   20 April 2020.", "Centers for Disease Control and Prevention.   \"Guidance for Certifying Deaths Due to Coronavirus Disease 2019 (COVID–19).\"\r\n    April 2020.", "PBS Newshour.   \"WATCH: Florida Governor Ron DeSantis Gives Coronavirus Update -- July 20, 2020.\"\r\n    YouTube.   20 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]