["The misleading photo collage was published in this Facebook post on July 11, 2019. It was shared more than 560 times before it was deleted.", "The post's caption states: “The Camera man after MS Dhoni's wicket,” while the text above the photos reads “Heart Breaking Picture”.", "\"MS Dhoni\" refers to batsman and former captain of India’s cricket team Mahendra Singh Dhoni. He can be seen in pictured in the top right-hand corner of the misleading Facebook post. A tearful photographer can be seen pictured in the other three images in the misleading post.", "Below is a screenshot of the misleading Facebook post:", "The same photo montage has been shared elsewhere on Facebook, for example here, here and here with a similar claim.", "The claim is false; the images of the photographer have circulated online since January 2019 in reports about an Iraqi photographer after the Iraq national football team lost to Qatar in the 2019 Asian Cup.", "A reverse image search on Google found the first image in the misleading photo collage published here on the official Facebook page of the AFC Asian Cup on January 24, 2019. A second photo in the comments section, published the same month, shows the same photographer with a tear rolling down his cheek.", "Below is a screenshot of the AFC Asian Cup post:", "Qatar won 1-0 in the match against Iraq on January 22, 2019, according to official highlights published here on the website for the Asian Champions League.", "The photo was also tweeted here on the Asian Cup’s official account with the text “AFC Asian Cup UAE 2019” written in white in the top-right corner and #ASIANCUP2019 in the bottom-left corner. The tweet's caption states: Passionate. Emotional moment for an Iraqi photographer during the Round of 16 clash against Qatar! #AsianCup2019.\"", "Passionate. Emotional moment for an Iraqi photographer during the Round of 16 clash against ?? ! #AsianCup2019 pic.twitter.com/KZoXsp1N4U", "A Twitter user posted another photo of the photographer in a comment next to the same tweet that shows an Iraqi flag on the left side of his jersey. It has been shown in the following screenshot, circled in green.", "All three photos were published on Twitter in January 2019 here. The caption states: \"An Iraqi photographer the moment his country got knocked out of the Asian Cup.\"", "Below is a screenshot of that post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]