["Demonstrators marched in front of the Milwaukee Secure Detention Facility in 2014 to call attention to prison reforms, including the use of probation revocations. (Rick Wood/Milwaukee Journal Sentinel)", "Reports have documented that each year, thousands of people in Wisconsin who have previously been convicted of crimes are locked up again even without having been convicted of a new crime.", "They are people who violate rules of what is generally known as community supervision, which includes probation, parole or extended supervision.", "Another side of that coin -- people living in the community on supervision who commit new crimes -- is what riles state Sen. Leah Vukmir. The suburban Milwaukee Republican is running in the 2018 race for the seat held by first-term U.S. Sen. Tammy Baldwin, a Democrat.", "Vukmir addressed the issue during an Oct. 12, 2017 interview with conservative talk show host Vicki McKenna on WISN-AM in Milwaukee. Touting a bill pending in the Legislature that is aimed at offenders who are on supervision, Vukmir stated:", "\"In 2016, there were 5,570 people who committed crimes on probation and they were not revoked.\"", "Probation is often used as a blanket term that also includes parole and extended supervision.", "Taking that into account, Vukmir is partially on target:", "But the number is an estimate, not an actual count.", "And the estimate refers to people on probation who have only been charged with another crime -- not convicted, as she suggested.", "The law, the bill", "Under current law, if people are suspected of violating a condition of supervision, a state probation-parole agent has discretion on whether to recommend the supervision be revoked. If revocation is recommended and a state administrative law judge agrees, the person goes to prison.", "Under the plan advanced by Republican lawmakers, if the person on supervision is charged with a new crime, the state would require probation-parole agents to recommend revocation.", "The state public defender’s office has raised concerns, saying the bill would remove the ability of probation-parole agents to review cases based on individual circumstances.", "There is also concern about a change in the burden of proof: A person on supervision charged with a new crime could be sent to prison based on probable cause -- the standard for charging a crime -- rather than based on guilty beyond a reasonable doubt, the standard for a criminal conviction.", "The number", "As for the number part of Vukmir’s claim, it comes from a memo on the bill from the state Department of Corrections.", "The department estimates that in fiscal year 2016, which ran from July 1, 2015 to June 30, 2016, there were 5,570 people on supervision who were charged with a new crime but were not revoked.", "The department said it made the estimate based on data from the Circuit Court Access Program (CCAP) on the number of people on supervision who were charged with a new crime during that one-year period.", "The memo said the department also assumes that if it had recommended revocation in those 5,570 cases, revocation would be approved for half of them, and the cost to the state prison system would be about $149 million per year.", "Our rating", "Vukmir says that in 2016, there were 5,570 people in Wisconsin \"who committed crimes on probation and they were not revoked.\"", "Vukmir’s probation reference appeared to include people who are on other forms of community supervision -- parole and extended supervision. Her claim is partially on target, but goes too far.", "The 5,570 figure is a state Department of Corrections estimate, not an actual count. And, importantly, it is for the number of people charged with a crime, not convicted.", "We rate her statement Half True.", "div class='artembed'>", "WISN-AM, Vicki McKenna interview of Leah Vukmir (24:30), Oct. 12, 2017", "Email, Leah Vukmir campaign spokesman Ben Nesvold, Oct. 18, 2017", "Wisconsin Legislature, Senate Bill 54, accessed Oct. 19, 2017", "Wisconsin Legislature, Department of Corrections memo on Senate Bill 54, accessed Oct. 19, 2017", "Fox6Now, \"High-risk criminals on state supervision often avoid revocation despite serious or ongoing violations,\" July 26, 2017", "Email, Wisconsin Department of Corrections spokesman Tristan Cook, Oct. 19, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]