["The photo was published in this Facebook post on October 6, 2019.", "The post’s traditional Chinese-langauge caption translates to English as: “[Expletive!] So ‘grateful’ to the church that shelters rioters! Come forward and explain! Talking above peace while covering up crime! [Expletive!] Circulating on the internet, borrowed to share here.", "“‘Cockroach’ hideout! 317-318 Lok Hin Terrace, 350 Chai Wan Road”.", "Below is a screenshot of the misleading post:", "The post was published on the same day that violent protests broke out again in Hong Kong. Tens of thousands of demonstrators marched in defiance of a government ban on face masks at public gatherings, as reported by AFP here on October 7.", "The photo was also shared hundreds of times here, here, here and here alongside a similar claim in multiple Facebook groups with tens of thousands of followers.", "The claim is false; the photo actually shows homeless people sheltering in a church in Vancouver, Canada in 2009.", "A reverse image search on Google found the same photo published in this article on December 5, 2011 by Vancouver street magazine Megaphone.", "The article’s headline states: “Cold Winds Blow: Winter weather raises questions about the future of Vancouver’s city shelters”.", "The article states the First United Church opened its doors to the homeless during a very cold winter.", "The photo’s caption states: “FIRST UNITED CHURCH IN 2009. THE PEWS HAVE SINCE BEEN REMOVED TO MAKE ROOM FOR MORE BEDS. PHOTO BY JAY BLACK”.", "Below is a screenshot of the photo on the Megaphone website:", "In an email to AFP on October 7, photographer Jay Black said he took the photo.", "\"Yes, I am the photographer who took the photograph,\" he said.", "\"The people seen sleeping in the church are homeless. As Vancouver's 2010 Olympic Games were approaching, the local government was trying to manage the city's growing homelessness problem. I was a freelance photographer at the time and provided photos to a variety of news outlets.", "\"The claim that the church is in Hong Kong and is being used to shelter protesters is 100 per cent false.\"", "On its website here, the Vancouver-based First United Church states: “Our programs and services aim to meet the needs of street-involved people on the Downtown Eastside. Our work increases wellness in body, mind, and spirit whether it’s a warm and nourishing meal, assistance getting caught up on taxes, a dry pair of socks, or a hot foot soak.”", "The same photo was published here by the Vancouver Sun on October 13, 2009.", "The headline states: “Performers hold concert for amazing United Church homeless shelter”.", "The report’s introduction states: “Each night more than 200 homeless people sleep in the pews of Vancouver’s long-standing First United Church. It is a ministry that is both amazing and shocking.”", "Below is a screenshot of the report:", "A similar photo of homeless people sleeping at the church in 2008 was published here by CBC on December 24, 2008. The report’s photo caption states: “About 200 homeless people have been spending their nights at the First United Church in Vancouver's Downtown Eastside since the cold snap began.”", "A bubble tea shop called Xiangcha, not a church, currently operates at the address listed in the misleading post, according to this page published on the website for Hong Kong restaurant directory OpenRice.", "There is also no church listed at the address mentioned in the misleading post according to Google Maps.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]