["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Mark Warner is pitching a plan that would allow some Bush-era tax cuts to expire as scheduled and apply the additional tax revenue toward business tax cuts and incentives to spur the economy.\n\nLaying out his plan in an Op-Ed in the Financial Times, Warner notes that a Republican-Democrat compromise is being considered by the Obama administration that would temporarily extend all the tax breaks for two more years.   \n\n\"However, this latter approach has problems beyond the $65bn that would be added to the deficit if we keep the cuts for people on the highest incomes,\" Warner writes. \"In Washington such ‘temporary’ benefits also have a strange way of becoming permanent.\"\n\nSince Warner’s own plan hinges on reapplying the $65 billion in additional tax revenue that would come from allowing the tax breaks for the wealthy to expire, we thought it prudent to check the figure.\n\nAsked for the source, Warner’s communication director Kevin Hall pointed to estimates by the U.S. Treasury.\n\nThose projections show that allowing the cuts to expire along with adjustments to the capital gains and dividends would amount to $74.4 billion over two years.\n\nHere’s why we mention that factor: If the Bush tax cuts are allowed to expire as scheduled, the top tax rate on long-term capital gains would rise from 15 percent to 20 percent. Dividends, which are currently taxed at 15 percent, would be taxed at the same rates as ordinary income with a top rate of 39.9 percent.\n\nBut if we look exclusively at allowing the Bush cuts to expire, it’s $62.5 billion for the two years.\n\nHall said Warner excludes the capital gains and dividends change because they might not be enacted, \"and capital gains isn’t really what people talk about when they say ‘income taxes.’\"\n\nGerald Prante, senior economist with the nonpartisan Tax Foundation, disagreed on that point. He also  suggested looking at more recent figures from the Office of Management and Budget, noting that the Treasury numbers are based upon estimates that have since been revised.\n\nThe OMB figures show that allowing the cuts for the wealthy to expire would generate more than $66 billion in tax revenue over two years. But that’s including the adjustment to the capital gains.\n\nWithout it, the two-year total is closer to $57 billion.\n\nIts worth noting, however, that the numbers from both sources look at the revenue to be gained from repealing the tax cuts permanently as opposed to eliminating them after a two-year extension.\n\n\"If there was only a two-year extension, the cost may not be $66 billion as [the] Joint Committee on Taxation/Treasury would assume tax planning that could change the costs, moving income between years,\" noted Prante. \"But overall, Warner's claim is fine...the $65 billion figure is not an exaggeration.\"\n\nSo, if we use the Treasury’s numbers, and look exclusively at the tax revenue raised by the two years worth of repealed cuts for the wealthy, then Warner is very close.\n\nUsing the more recent OMB figures, he’d be nearer  by including the capital gains adjustment, but is still in the neighborhood.\n\nAccepting that pinpointing a number using evolving projections is not an exact science, we find Warner’s claim to be Mostly True.", "Financial Times, Obama’s alternative to repeal of Bush tax cuts, \"Obama’s alternative to repeal of Bush tax cuts\", Nov. 11, 2010.\n\nDepartment of the Treasury, General Explanations of the Administration’s Fiscal Year 2011 Revenue Proposals, February 2010.\n\nOffice of Management and Budget, Mid-Session Review, July 23, 2010.\n\nCongressional Budget Office, The Budget and Economic Outlook: An Update,  Aug. 18, 2010.\n\nJoint Committee on Taxation, \"Present Law And The President’s Fiscal Year 2011 Budget Proposals Related To Selected Individual Income Tax Provisions Scheduled To Expire Under The Sunset Provisions Of The Economic Growth And Tax Relief Reconciliation Act Of 2001\" (report), July 12, 2010\n\nTax Policy Center, 2011 Budget Tax Proposals, accessed Nov. 5, 2010.\n\nEmail interview with Gerald Prante, senior economist, The Tax Foundation, Nov. 12, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]