["About this rating", "In January 2017, a popular story about Winston Churchill reappeared in meme form after reports that U.S. President Donald Trump planned to cut funding to the National Endowments for the Arts and Humanities.", "The anecdote goes as follows: The prime minister was once asked to cut funding for art programs in order to support the war effort. Churchill refused, according to the story, and said that preserving the arts was the only reason that the war was worthwhile.", "Churchill's exact quote varies depending on where you encounter the story (a hint at its apocryphal nature), but when it became a meme, Churchill's purported response was a short question: Then what are we fighting for?", "This alleged quotation was raised some few years ago in the Village Voice and is all over the web, but it is not among Churchill’s 15 million published words in speeches, papers, letters, articles or books.", "A spokesman for the International Churchill Society confirmed to us that the quote was fake, but added that Churchill did express a similar sentiment about the importance of the arts in 1938:", "I've seen [this quote] all over the place, but it's quite bogus.", "Not that Churchill lacked interest in the arts--in 1938 he uttered the following:", "\"The arts are essen­tial to any com­plete national life. The State owes it to itself to sus­tain and encour­age them….Ill fares the race which fails to salute the arts with the rev­er­ence and delight which are their due.\"", "But this was, of course, before Britain was engaged in a war for national survival.", "Langworth, Richard.   \"Safeguarding the Arts.\"\r\n    RichardLangworth.com.   7 March 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]