["The picture was posted by the Facebook page Ogun State on April 21 and has since been shared more than 12,000 times. We’ve archived the post here.", "“Australian Prime Minister breastfeeding her baby while delivering a speech at the Parliament. ??good mothers can do anything for their babies,” the caption reads.", "Australia has only had male prime ministers since June 2013. The current prime minister, in office since August 2018, is Scott Morrison. Australia’s last female prime minister -- and only female leader to date -- was Julia Gillard, who was in office from June 2010 until June 2013.", "This is Julia Gillard:", "As for the woman pictured in the Facebook post, a Google reverse image search identifies her as Larissa Waters, a senator with the Australian Greens. In June 2017, Waters breastfed her 14-week-old baby in parliament while moving a motion on black lung disease, a condition affecting coal miners in the country.", "First time I've had to move a Senate motion while breastfeeding! And my partner in crime moved her own motion just before mine, bless her", "Here is a video of Waters moving the motion while breastfeeding.", "Waters had made history the previous month by becoming the first woman to breastfeed a child in the Australian parliament, as reported here in the New York Times.", "Waters received a wave of support around the world from mothers, who are often still publicly shamed for breastfeeding in public.", "She is not the only female lawmaker to have breast-fed a baby in parliament. As reported by AFP, Icelandic MP Unnur Bra Konradsdottir made similar headlines in 2016, as did Spanish MP Carolina Bescansa.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]