["About this rating", "In April 2020, a rumor started to circulate that CNN deleted from Google Play an old episode of \"Larry King Live\" that featured the mother of Tara Reade, the woman who accused presumptive Democratic presidential nominee Joe Biden of sexual assault.", "The conspiratorial website Infowars, for instance, published an article titled \"CNN Removes 'Larry King' Episode with Biden Accuser's Mother From Google Play Archive\" and accused CNN of \"running cover\" for the Biden campaign.", "CNN did not remove this episode from the Google Play streaming service. This false rumor is entirely based on incorrect assumptions made from looking at a single screenshot posted by Twitter user J.L. Hamilton. The image of the Google Play store (see below) showed a \"Larry King Live\" episode for Aug. 10 and Aug. 12, 1993, but not Aug. 11. In a tweet that was later deleted, Hamilton accused CNN of \"actively colluding with the Biden Campaign to cover up evidence of Biden's sexual assault.\"", "The above-displayed screenshot is genuine. If you go to the Google Play store, you will not find an episode of \"Larry King Live\" listed for Aug. 11, 1993. However, the claim that CNN removed the episode quickly falls apart when we take a look at the available information.", "Some of the confusion may stem from the fact that Google Play lists shows and episodes on its website that aren't actually available for viewing there. While Google Play lists hundreds of \"Larry King Live\" episodes, for instance, these episodes are not available to view on the service, but users can add them to their \"watch list.\" A Google spokesperson told us that Google does this to gauge viewer interest.", "As of this writing, if you click on any episode of \"Larry King Live\" you will be greeted with the text: \"This show is currently unavailable.\" This, of course, raises the question: Why would CNN remove an episode from a service where it was already unavailable for viewing?", "Furthermore, although Google Play provides a list of episodes, they do not provide a description for each individual episode. The store instead provides a brief biography of Larry King and a short summary of the \"Larry King Live\" show. In other words, even if this episode had been listed, it would have made no mention of Tara Reade, which, again, would give CNN little incentive (if, that is, the unfounded notion that CNN was \"running cover\" for Biden was accurate) to remove the episode.", "Shortly after this rumor went viral, Matt Dornic, head of CNN Communications, took to Twitter to state that \"CNN did not remove anything,\" that the network did not have a distribution deal for \"Larry King Live\" with Google Play, and that Google did not source its listing through CNN:", "The rumor that CNN was \"running cover\" for the Biden campaign is undercut by the fact that CNN drew attention to this episode during an April 25, 2020 segment. In the accompanying article, CNN wrote:", "(CNN)Newly surfaced video from 1993 appears to feature the mother of Tara Reade, a woman who accused presumptive Democratic presidential nominee Joe Biden of sexual assault, calling into a cable TV show to seek advice around the time of the alleged assault.", "In a \"Larry King Live\" segment that aired on August 11, 1993, on CNN, an unnamed woman calls in to the show with her location identified on the screen as San Luis Obispo, California. The show was about the cutthroat nature of Washington, DC, politics and media.", "\"Yes, hello. I'm wondering what a staffer would do besides go to the press in Washington?\" she asks. \"My daughter has just left there after working for a prominent senator, and could not get through with her problems at all, and the only thing she could have done was go to the press, and she chose not to do it out of respect for him.\"", "It isn't clear exactly how Google populates its list of \"Larry King Live\" episodes, but the list is not comprehensive. For instance, the first episode of \"Larry King Live\" aired on CNN back in 1985. The earliest episode listed on Google Play, however, is from 1987 (and features Donald Trump).", "We have yet to see any evidence that an Aug. 11, 1993, episode of \"Larry King Live\" was ever listed on Google Play. Since Google Play's \"Larry King Live\" catalog is missing several episodes, it's possible that no episode for this date was ever listed on (and therefore never removed from) Google's streaming service.", "Lee, MJ.   \"Biden's Accuser Says Mother Called Into 'Larry King Live' in 1993 for Advice After Alleged Sexual Assault.\"\r\n    CNN.   25 April 2020.", "White, Jamie.   \"CNN Removes ‘Larry King' Episode With Biden Accuser's Mother From Google Play Archive.\"\r\n    Infowars.   26 April 2020.", "Wulfsohn, Joseph.   \"CNN 'Larry King' Episode Featuring Biden Accuser's Mother Disappears From Google Play Catalog.\"\r\n    Fox News.   26 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]