["The 56-second video has been viewed more than 62,000 times after being published here on YouTube on March 25, 2020.", "Below is a screenshot of the video:", "The Tamil-language title translates to English as: “The image of the devil on the top of the Italian church”.", "A series of hashtags were added to the description box underneath the YouTube video: “#Italy #Italycoronavirus #Italybird”.", "The video was posted as Italy continues to fight the novel coronavirus pandemic after losing more than 19,000 lives to COVID-19 as of April 13, according to the World Health Organization.", "The video and similar claims were also shared here, here, here, here and here on Facebook.", "The claims are false.", "A reverse image search on Yandex using keyframes extracted from the footage by InVID-WeVerify, a video verification tool, led to a longer version of the video, which was published here on the YouTube channel “JJPD Producciones” on June 3, 2019.", "The video in the misleading posts corresponds with the JJPD video from its one-minute 12-second mark.", "The Spanish-language title of the JJPD video translates to English as: “Demon terrifies in Granada city - Nicaragua 2019 - Gargola?”", "The video description reads, in part: “In the city of Granada, one of the biggest tourist attractions in Nicaragua, the impressive sighting of a creature never seen before; it is rumored among the locals that the demon lives in the Cathedral of the Immaculate Conception of Mary. A tourist climbed one of the tallest towers of the cathedral to get better shots of the landscape, but to his surprise, something or someone also climbed one of the towers; the tourist did not hesitate to record the creepy event which I will show you.\"", "The YouTube channel added that the video is not genuine: “These are paranormal videos created by us to entertain. All images shown are fiction. CGI Video (Computer Generated Image).”", "The Iglesia Catedral Inmaculada Concepción de María, or Cathedral of Granada, can be seen in the video and in this photo geotagged to the location on Google Maps.", "Below is a screenshot comparison of keyframes from the JJPD video (L) and the video in the misleading post (R) :", "JJPD Producciones is a YouTube channel run by two Nicaraguans who describe themselves as creators of \"videos with special effects, fictional paranormal encounters, short films and horror tales”.", "The channel also uploaded this video in September 2019 titled “Demonic Gargoyle caught on camera - How it was created !!! 2019”, which describes how the Granada church video was produced.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]