["By Eugene Kiely, D'Angelo Gore, Saranac Hale Spencer and Lori Robertson", "Posted on October 16, 2020", "At a televised town hall in Philadelphia, Democratic presidential nominee Joe Biden made false and misleading claims on COVID-19, health insurance, the 1994 crime bill and more:", "The town hall, which aired on ABC, was held in place of the second presidential debate, which was canceled after President Donald Trump refused to participate in a virtual debate. The debate commission decided to switch to a virtual debate after Trump contracted COVID-19 and was hospitalized for three days, leaving Walter Reed National Military Medical Center on Oct. 5.", "At the National Constitution Center in Philadelphia, Biden fielded questions from socially distanced audience members and moderator George Stephanopoulos. The topics included COVID-19, Trump’s tax cuts, race relations, the Supreme Court, LGBTQ rights, health insurance, restoring bipartisanship, fracking, foreign affairs and the crime bill that Biden sponsored in 1994.", "Meanwhile, the president was on NBC News for a one-hour town hall, which we also fact-checked.", "Biden falsely claimed the Trump administration recalled all the members of a Centers for Disease Control and Prevention team in China.", "“All the way back in the beginning of February, I argued that we should be keeping people in China,” Biden said. “And we had set up in our administration a pandemic office within the White House. There were 44 people on the ground [in China]. I suggested that we should be seeking … to have access to the source of the problem. And to the best of our knowledge, Trump never pushed that. All those 44 people came home, never got replaced.”", "As we’ve written before, Biden was referring to a March 25 Reuters report that said the Trump administration had reduced the CDC’s staff in China. But the whole team didn’t come home, as Biden said.", "That story, citing CDC documents, said CDC’s Beijing office “has shrunk to around 14 staffers, down from approximately 47 people since President Donald Trump took office in January 2017.”", "Reuters said the majority of the CDC staffers let go were actually Chinese nationals on the U.S. payroll. There were only eight Americans assigned to the CDC’s Beijing office, and five of them were cut at the start of the Trump administration. A fourth American, a deputy director, was later added.", "Biden misleadingly said: “The government initially said they were going to provide masks for every student and every teacher and then they said … the president or whomever said, ‘No, no. That’s not a national emergency.'”", "In September, the Federal Emergency Management Agency said it would stop reimbursing states for the costs of masks for schools, but the Department of Health and Human Services said it would provide up to 125 million cloth masks for schools.", "NPR reported on Sept. 1 that Keith Turi, FEMA assistant administrator for recovery, told state and tribal emergency managers that FEMA would stop on Sept. 15 reimbursing states for cloth masks and other personal protective equipment for places, such as schools, that are deemed nonemergency locations.", "“The changes narrow what constitutes an ’emergency protective measure’ and is thus eligible for FEMA’s Public Assistance Program,” according to NPR, which obtained a recording of the call.", "But another federal program will still provide masks to schools. HHS’ Public Health Emergency webpage says: “The U.S. Department of Health and Human Services will be providing up to 125 million cloth masks to states for distribution to schools. The Administration intends for these masks to support students, teachers, and staff in public and private schools reopening, with an emphasis on students who are low-income or otherwise with high needs and schools providing in-person instruction.”", "NPR also noted that nothing prevented states from stockpiling such protective equipment before the FEMA policy went into effect.", "When asked about the 1994 crime bill he had championed at the time as chairman of the Senate Judiciary Committee, Biden said the bill contained “both bad and good” things, but he stretched the facts on at least one point.", "“I wrote the Violence Against Women Act, that was part of it. Assault weapons ban and other things that were good,” he said. “What I was against was giving states more money for prison systems that they could build – state prison systems.”", "Biden did support $6 billion in funding for state prison construction, but not the $10 billion that was part of the final bill. When we wrote about a similar claim in July 2019, his campaign told us the $4 billion difference is what he meant when he said he didn’t support “more money” for state prisons.", "The prison funding went to states that had “truth-in-sentencing” laws requiring that people convicted of violent crimes serve at least 85% of their sentences. According to the Department of Justice, 11 states adopted such laws in 1995 and three years later, 27 states and Washington, D.C., met the criteria for the prison construction grants.", "This is one of the measures experts have cited in saying the 1994 legislation contributed to already increasing incarceration. “Although incarceration was already rising steadily before the crime bill, several of its provisions helped increase incarceration even further,” experts with the Brennan Center for Justice said in 2016.", "The authors said: “On their own, states passed three-strikes laws, enacted mandatory minimums, eliminated parole, and removed judicial discretion in sentencing. By dangling bonus dollars, the crime bill encouraged states to remain on their tough-on-crime course.”", "In the town hall, Biden also said the crime legislation “had three strikes and you’re out, which I voted against in the crime bill.”", "We found there’s evidence supporting Biden’s claim that he didn’t back the final legislation’s three-strikes provision, but he did vote in favor of one version, a Republican amendment that was added to the Senate legislation. Biden is on record at the time as saying he supported a three-strikes provision for “serious [violent] felonies against a person,” but he was against including nonviolent offenses and expressed concern that minor crimes could get swept up in the measure.", "The provision in the final bill said anyone with at least two prior convictions for serious violent felonies, or one of those being a drug distribution or trafficking offense, who then committed a federal serious violent felony would be sentenced to life in prison without the possibility of parole.", "One DOJ-funded research report published in 2000 found that, with the exception of California, the state and federal three-strikes laws had “virtually no impact on the courts, local jails or state prisons.” The report said this type of legislation was “carefully crafted to be largely symbolic,” but also that courts and prosecutors had minimized the impact.", "Biden gave a bleak assessment of what it would mean for millions of people if the Affordable Care Act — perhaps better known as Obamacare — were struck down.", "The Supreme Court is scheduled to hear arguments in a case aimed at nullifying the ACA a week after the election, and the Trump administration has backed the suit.", "“Ten million people have already lost their insurance from their employer and [Trump] wants to take 20 million out of system as well, plus 100 million people with preexisting conditions,” Biden said, suggesting that would be the effect of ending the ACA.", "But those numbers need some explanation.", "The first figure — 10 million — is a reference to the number of people who are expected to lose their employer-based health insurance during the COVID-19 recession. The former vice president cited the same figure during the first presidential debate on Sept. 29. It comes from an Urban Institute study — but that study also said that most would regain insurance from another source, leaving 3.5 million uninsured.", "The study estimated that job losses would cause 10.1 million people to lose their health coverage from April through December. But many would switch to insurance through another family member, Medicaid or the individual market.", "The 20 million figure reflects the number of people who had gained coverage by 2016 — two years after the major provisions of the ACA went into effect in 2014.", "The Congressional Budget Office estimated in 2017 that if the ACA were repealed and not replaced with new legislation, the uninsured would increase by 32 million over 10 years.", "As we’ve written before, it’s unclear what a Republican replacement plan for the ACA might be. The president backed a 2017 GOP health care bill that would lead to 24 million more uninsured in 2026, according to an analysis by the CBO and Joint Committee on Taxation.", "So, projecting a loss of 20 million people from the insurance system if the ACA were dismantled may actually underestimate the potential effect.", "The third figure — 100 million — is an estimate of the number of Americans, outside of Medicare and Medicaid, who have preexisting conditions. Without the ACA, they would lose the preexisting condition protections in that law, which prohibits insurers from denying coverage, charging more or excluding coverage of certain conditions based on health status.", "But, as we’ve written before, to be at risk of being denied insurance, they would have to seek coverage on the individual market, where those without employer or public insurance buy plans. Before the ACA, employer-based plans couldn’t deny insurance, but they could decline coverage for some preexisting conditions for a limited period if a new employee had a lapse in coverage.", "Only 6% of the population gets coverage on the individual market, while 49% have employer-based plans.", "So, suggesting that 100 million people may be denied coverage due to preexisting conditions overstates the potential effect of doing away with the ACA.", "Trump has said he would require insurers to cover preexisting conditions, but it’s unclear what those protections would be since the president hasn’t offered a health plan to replace the ACA.", "When Stephanopoulos asked Biden about comments made by a member of a Pennsylvania boilermakers’ union who was skeptical of Biden’s claims that he won’t ban fracking, Biden responded by saying, “Tell him the boilermakers overwhelmingly endorse me, OK.”", "But it’s not clear which union(s) Biden was claiming has endorsed him.", "Boilermakers Local 154, the Pittsburgh-based union Stephanopoulos mentioned, has endorsed Trump for president. And the website of the International Brotherhood of Boilermakers, which claims to represent 60,000 workers in the U.S. and Canada, says: “The International Brotherhood of Boilermakers has not endorsed any U.S. Presidential candidate for the 2020 Election, and the information contained on this webpage in no way serves as an endorsement by the International Brotherhood of Boilermakers for any U.S. Presidential candidate.”", "In attempting to distance his climate change plan from the Green New Deal, a nonbinding resolution introduced in 2019, Biden made confusing remarks about the latter.", "“The difference between me and the New Green Deal, they say automatically, by 2030, we’re going to be carbon free, not possible,” Biden said.", "Actually, the Green New Deal — not the “New Green Deal” — doesn’t call for banning all fossil fuels or carbon emissions by 2030. As we’ve written before, its primary climate change goal is to reach net-zero greenhouse emissions in a decade. “Net-zero” means that after tallying up all the greenhouse gases that are released and subtracting those that are sequestered, or removed, there is no net addition to the atmosphere.", "When Stephanopoulos pushed back on Biden’s criticism of the proposal and noted that Biden’s own website called the Green New Deal a “crucial framework,” Biden said, “my deal is a crucial framework, but not the New Green Deal.” That’s not what his campaign website says.", "“Biden believes the Green New Deal is a crucial framework for meeting the climate challenges we face,” the website says. “It powerfully captures two basic truths, which are at the core of his plan: (1) the United States urgently needs to embrace greater ambition on an epic scale to meet the scope of this challenge, and (2) our environment and our economy are completely and totally connected.”", "Editor’s note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]