["Pakistan-based journalist Bashir Chaudhary tweeted an image of policemen attacking a Sikh man. “This picture will shake the foundations of #India. #JaagPunjabiJaag #IndianRepublicBlackDay #TractorMarchDelhi #KisanTractorRally #FarmersProtest,” he wrote linking the image to police violence during farmers’ tractor parade on January 26.", "Facebook user Ajay Tiwari posted the image on the group ‘Prof. Gourav Vallabh Fan’s Club’. It gained close to 5,000 shares.", "Alt News performed a reverse image search on TinEye and found the same on Getty Images. It was clicked by Shekhar Yadav in 2013. The caption reads, “Sikh community members scuffle with policemen as they shout anti-government slogans during a demonstration against the acquittal of Congress politician Sajjan Kumar, in New Delhi.” We also found other images by Yadav related to the same incident on Getty Images. (1, 2)", "As per a 2013 Livemint report, Sikh protestors attempted to march towards the Prime Minister’s residence protesting against Congress leader Sajjan Kumar’s acquittal in the 1984 riots case.", "Yadav currently works at The Indian Express. He quote-tweeted Chaudhary’s tweet and debunked the claim.", "This photo of mine is from the 1984 sikh riots anniv protests at the jantar mantar from 10 years ago. Kindly stop using this as propaganda. दुकान के नाम पे कुछ भी ? https://t.co/qg6aPAqUu7", "— Shekhar Yadav (@Shekharyadav02) January 29, 2021", "Therefore, a 2013 image was shared on social media with the false claim that it is from the clashes between farmers and Delhi police. It is noteworthy that police violence has been reported during the ongoing farmers’ movement.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]