["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump arrives to speak to a campaign rally at Pittsburgh International Airport, Tuesday, Sept. 22, 2020, in Pittsburgh. (AP Photo/Evan Vucci)", "President Donald Trump warned supporters at a rally in Pittsburgh this week that if Joe Biden wins the presidency, the future of the natural gas and coal industries looks bleak.", "Trump said Biden’s plan for net-zero emissions \"would instantly shut down all fracking and all mining immediately in Pennsylvania.\"", "Here’s what Trump said:", "\"Biden reiterated his pledge to require net-zero carbon emissions. That’s basically saying, do you know what that is? There’ll be no more oil, there’ll be no more gas, there’ll be no more nothing, there’ll be no more industry, there’ll be no more country. That’s what it’s saying really. And that would instantly shut down fracking and mining immediately in Pennsylvania, sending your jobs overseas, sending your money to somebody else, not you.\"", "We wondered whether the president accurately characterized Biden’s net-zero emissions plan.", "Trump is right that Biden wants to shift toward clean energy, but he’s got the timeline wrong. Biden wants the country to reduce its reliance on fossil fuels over the next 15 years, not right away like Trump said.", "Net-zero emissions is what scientists and many world leaders agree is needed to stop climate change from spiraling out of control. The term describes the process of substantially reducing greenhouse gas emissions and then offsetting what can’t be eliminated through activities like forest restoration.", "In July, Biden released a sweeping $2 trillion plan to tackle climate change that he said would set the United States on \"an irreversible path\" to net-zero emissions by 2050. Twenty countries and regions around the world have adopted similar targets.", "To achieve that goal, Biden wants to create a pollution-free power sector by 2035; increase energy efficiency by upgrading 4 million buildings and weatherizing 2 million homes; and shift major cities toward public transportation.", "The first plank in that plan, creating a pollution-free power sector by 2035, would require phasing out coal in western Pennsylvania over the next 15 years. The plan does not, however, call for ending hydraulic fracturing — the controversial drilling technique known as fracking — instantly, or at all.", "We’ve examined Biden’s position on fracking several times now, so we know he hasn’t called for banning the practice.", "He wants to block the federal government from issuing new permits for drilling on public land, but would allow existing fracking operations to continue. The Biden campaign has also noted previously that 90% of fracking today takes place on private land.", "Biden’s position on fracking became muddled earlier this year when he misspoke during a March debate with Bernie Sanders, who was then his last opponent standing in the Democratic primary.", "Here’s an excerpt of their exchange:", "\"I’m talking about stopping fracking as soon as we possibly can,\" Sanders said. \"I’m talking about telling the fossil fuel industry that they are going to stop destroying this planet — no ifs, buts, and maybes about it.\"", "\"So am I,\" Biden replied.", "\"Well, I’m not sure your proposal does that,\" Sanders said.", "\"No more — no new fracking,\" Biden said.", "Biden seemed to be saying he wanted to ban fracking — a sharp departure from his official position. And the former vice president’s opponents pounced.", "Republican operatives quickly cut a short video of Biden’s remarks to use as a cudgel in races against moderate House Democrats, the Washington Post reported.", "The Biden campaign retracted his remarks the night of the debate, but that hasn’t stopped conservative media outlets or the Trump campaign from inaccurately claiming that Biden supports a total ban on fracking.", "Trump said Biden’s net-zero emissions plan would shut down the fracking and coal mining industries \"instantly\" and \"immediately.\" Biden’s plan calls for a gradual transition to clean energy. We rate this statement False", "Pittsburgh post-Gazette, \"Rallying at Pittsburgh International, Trump gives rundown of nation’s political tenor,\" Sept. 23, 2020", "Rev, \"Donald Trump Pittsburgh Campaign Rally Transcript September 22,\" Sept. 22, 2020", "Biden Harris, \"The Biden Plan for a Clean Energy Revolution and Environmental Justice,\" accessed Sept. 24, 2020", "Bloomberg, \"Biden to Call for $2 Trillion in Spending on Clean Energy,\" July 13, 2020", "World Resources Institute, \"What does ‘Net-Zero Emissions Mean? 6 Common Questions, Answered,\" Sept. 17, 2019", "NPR, \"Biden Outlines $2 Trillion Climate Plan,\" July 14, 2020", "The Philadelphia Inquirer, \"Fact-checking Joe Biden in Pennsylvania on his fracking policy,\" Sept. 1, 2020", "The Houston Chronicle, \"Did Joe Biden just pledge to ban fracking in debate against Bernie Sanders?\" March 16, 2020", "The Washington Post, \"Fact-checking the Biden fracking fracas,\" March 19, 2020", "Axios, \"Clearing up the Biden-Bernie fracking tussle at the debate,\" March 16, 2020", "The Washington Free Beacon, \"Biden Promises ‘No More Drilling’ Under His Presidency,\" March 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]