["The original Facebook post from June 7, 2020, shows pictures of President Cyril Ramaphosa and other politicians gathered together and embracing.", "“On the 6th June 2020 it was totally permissible for President Ramaphosa and over 50 ANC members not to wear a mask at a birthday party,” the caption reads.", "“NO social Distancing and they were hugging each other...But the South African public is instructed to wear a mask?????? It really doesn't make sense.”", "That post, shared more than 200 times, was screenshot and republished here on June 8, 2020. By way of an answer, the person who posted it claims: “Because they know you can't transmit the 'virus', but the bacteria was injected via the flu vaccine...  So no, there is no reason to wear a mask, and they know it…”", "Gatherings are prohibited under level three of South Africa’s lockdown regulations except for places of worship with 50 people or fewer allowed.", "A reverse image search on Google shows some of the pictures were shared in a personal tweet by Ramaphosa on June 6, 2020 in a birthday message to political activist Andrew Mlangeni, who turned 95.", "Mlangeni, an anti-apartheid activist, is the last living defendant of the 1963-1964 Rivonia trial of former president Nelson Mandela and nine others, who faced the country’s erstwhile death penalty on charges of plotting guerrilla warfare and acts of sabotage against South Africa's apartheid regime.", "Earlier in the day, the president's office also tweeted some of the pictures from its Twitter account while announcing that Ramaphosa would be delivering a speech via webinar in celebration of Mlangeni.", "The pictures, however, were not recent and predated the novel coronavirus outbreak.", "As verified by Africa Check, two of the images were used by Ramaphosa a year earlier in a tweet from June 6, 2019, again wishing Mlangeni a happy birthday, this time his 94th.", "Warmest wishes to Isithwalandwe/Seaparankoe Tata Andrew Mlangeni on the occasion of his 94th birthday. Tata Mlangeni continues to play an active and immeasurable leadership role in ensuring that our movement adheres to the principles and values on which it was founded. pic.twitter.com/HUvvq5pM7h", "The remaining two pictures are even older, from Mlangeni’s 93rd birthday party in 2018, as can be seen by the black tie, grey suit and badge he is wearing in this video of the event.", "An Independent Online article on June 6, 2020, shows Mlangeni at home for his latest birthday, wearing a blue sash in the company of United Democratic Movement leader Bantu Holomisa and Johannesburg's mayor, Geoffrey Makhubo. All were wearing face masks in the picture.", "The image was corroborated in an earlier tweet by Holomisa. “In Soweto on our way to Greet & Drive ceremony in honour of Tata Andrew Mlangeni’s birthday.”", "With Jhb Executive Mayor Geoffrey Makhubo & Nino Zama In Soweto on our way to Greet & Drive ceremony in honour of Tata Andrew Mlangeni’s birthday . Happy Birthday Sithwalandwe . You have been a good ambassodor for the struggle whilst others continue to loot. pic.twitter.com/FCjfQ9rKFg", "According to News24, Mlangeni had a “drive-through” birthday this year because of national lockdown regulations.", "“The occasion was marked by a ‘dignified drive-through’ at his home in Dube, Soweto. Each car was given 30 seconds to wish Mlangeni a happy birthday and drop off a present outside the house. The drive-through celebration was led by a fire engine and the mayor's motorcade,” said the article.", "The event was captured in a thread here by the City of Joburg’s Twitter account.", "The claim that COVID-19 is caused by bacteria has been debunked here, here and here by AFP Fact Check.", "“By Jan 7, 2020, Chinese scientists had isolated a novel coronavirus (CoV) from patients in Wuhan,” states this study published in The Lancet, one of the world’s top peer-reviewed scientific journals.", "On February 11, 2020, the International Committee on Taxonomy of Viruses (ICTV) named the new virus “severe acute respiratory syndrome coronavirus 2”, or SARS-CoV-2, owing to its genetic relation to the coronavirus responsible for the SARS outbreak of 2003.", "As the disease rapidly spread across the world, scientists working independently isolated the new virus. The World Health Organization and national health agencies -- for instance in the United States, the United Kingdom and the Philippines -- all state that the disease is viral.", "Studies on COVID-19 patients in countries such as  Australia, Italy, Malaysia, Nepal, Korea and France also confirm the disease is not bacterial.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]