["About this rating", "In June 2017, a rumor appeared that the Ku Klux Klan had started a petition for a yearly \"purge\" (a 24-hour pause of all laws) in order to kill black people in the United States:", "The social media postings about this alleged petition did not provide a link to a source, but they all contained the same two claims: That the petition was started by the KKK and that it had received 2 million signatures. The Twitter account @Colossill posted an image purportedly showing this petition on Change.org:", "We were unable to locate this petition on Change.org. We reached out to the web site, who told us in no uncertain terms that they had never hosted this or any other petition from the Ku Klux Klan:", "To answer your question, no, we've never hosted a petition from the KKK on our site. Such a petition would be in violation of our petition guidelines, and we would've promptly removed it.", "So where did this petition come from? We managed to locate an uncropped version of the image showing the alleged petition, and found that it originally included the logo for the fake news web site CreamBMP.com:", "Cream BMP published a hoax article in 2014, shortly after the release of the movie The Purge, appearing to report that the Klan had started a petition on Change.org for a yearly \"purge\" of all African Americans. Although the site has since deleted its article, a contemporary piece published by TheEpochTimes.com documented some of its contents:", "The bogus article, published on \"satire\" website Cream Bmp Daily, had a few thousand shares on Facebook as of Wednesday. It claimed the KKK petition has 2 million signatures. It goes on to say, \"Producers of the movie 'The Purge' deeply apologize for what their movie has caused and claim you will not find their signature anywhere on the petition, but a quick scan of the petition revealed at least five of their relatives agree with purging on African Americans.\"", "CreamBMP.com carried a disclaimer at the time that their article was published, saying that the web site was a mixture of \"satire and parody of current news and urban culture.\"", "Phillips, Jack.   \"KKK Petition ‘Purge’ Hoax: Ku Klux Klan ‘Purge of African Americans’ Fake; 2 Million Signatures Change.org Petition 100% Not Real.\"\r\n    Epoch Times.   23 July 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]