["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a 30-second television ad airing across the country, Texas Gov. Rick Perry lashes out at President Barack Obama by using the president's words.", "The ad, which debuted Nov. 16, 2011, opens with a video clip of Obama saying, \"We've been a little bit lazy, I think, over the last couple of decades.\" Perry then appears, saying: \"Can you believe that? That's what our president thinks is wrong with America? That Americans are lazy? That's pathetic.\"", "Perry made a similar claim a day earlier during an Iowa speech, according to the text of his remarks. Referring to the United States' economic troubles, Perry said: \"In recent weeks, our president has taken to pointing the finger of blame instead of taking responsibility. He has called us soft and lazy.\"", "We'd heard the \"soft\" charge before. In an Oct. 14 speech unveiling his energy policy proposals, Perry said Obama \"has labeled Americans as soft.\" We rated that statement, which amped up a statement Obama had made about the country getting soft in the past, Half True.", "Former Massachusetts Gov. Mitt Romney, a Perry rival for the Republican presidential nomination, has also accused Obama of calling Americans lazy. According to a Nov. 16, 2011, post on a MSNBC.com political blog, Romney said this while campaigning a day earlier in South Carolina: \"Sometimes, I just don't think that President Obama understands America. I say that because this week — or was it last week — he said that Americans are lazy. I don't think that describes America.\"", "In his ad, Perry accuses Obama of thinking Americans are lazy. We can’t test what anyone, including Obama, is thinking. So, in this article, we're gauging whether Obama really indicated that he thinks Americans have been lazy.", "We traced Obama's comment to a question-and-answer session with the head of Boeing on Nov. 12, 2011, at a meeting of business leaders during the Asia-Pacific Economic Cooperation summit in Honolulu.", "The conversation between Jim McNerney and Obama touched on the regional economy, world trade and what the president characterized as a \"re-engagement\" by the United States with Pacific Rim countries. Obama said that there is no area he considers more vital and that the United States wants to work with other Pacific Rim countries to \"enhance job growth, economic growth, prosperity and security for all of us.\"", "\"I think we spent a decade in which, understandably, after 9/11, we were very focused on security issues, particularly in the Middle East region,\" Obama said. \"And those continue to be important. But we've turned our attention back to the Asia-Pacific region, and I think that it's paying off immediately in a whole range of improved relations with countries, and businesses are starting to see more opportunities as a consequence.\"", "The conversation soon turned to the complicated relationship that the United States has with China. Obama made his \"lazy\" comment in response to a question from McNerney about impediments that China might see to investing in the United States.", "\"Well, this is an issue, generally,\" Obama said. \"I think it's important to remember that the United States is still the largest recipient of foreign investment in the world. And there are a lot of things that make foreign investors see the U.S. as a great opportunity — our stability, our openness, our innovative free market culture.", "\"But, you know, we’ve been a little bit lazy, I think, over the last couple of decades. We’ve kind of taken for granted — well, people will want to come here — and we aren’t out there hungry, selling America and trying to attract new business into America. And so one of the things that my administration has done is set up something called SelectUSA that organizes all the government agencies to work with state and local governments where they're seeking assistance from us, to go out there and make it easier for foreign investors to build a plant in the United States and put outstanding U.S. workers back to work in the United States of America.\"", "Two days later, a reporter asked White House spokesman Josh Earnest to explain what Obama meant by his \"lazy\" remark. Earnest said Obama \"was making the case\" that it's time for U.S. foreign policy to focus on the Asia-Pacific region because there's \"an enormous economic opportunity\" there.", "Earnest continued: \"And so that is why the president has made this a focus of his foreign policy moving forward. I don't think that — it's the president's view that this region has not been the focus in recent history, and that's what the president was alluding to, that we are in a circumstance where we need to redouble our efforts to be engaged in this region.\"", "So where does that leave us? Partly pondering who Obama meant by \"we.\"", "In the MSNBC.com blog post, Mark Murray, deputy political director for NBC News, says Obama \"wasn't calling Americans lazy; rather, he was calling U.S. business practices to attract foreign investors lazy.\"", "Another possibility: Speaking with McNerney, Obama often used \"we\" to refer to the U.S. government or his administration. So the president may have been criticizing the federal government's efforts to help attract investment from abroad. After all, in his next sentence, Obama points to a Commerce Department website (SelectUSA) that says it \"seeks to highlight the many advantages the United States offers as a location for business and investment.\"", "Our ruling: Obama said America had acted lazily in some regard. Exactly whom he considers lazy, we're still not sure. But it’s clear that he was not wagging his finger at the American public at large. Perry's presentation distorts the president's remark by taking it out of context. We rate his claim Mostly False.", "Rick Perry presidential campaign, press release, \"Perry campaign releases new ad: 'Lazy,' \" Nov. 16, 2011", "Rick Perry presidential campaign website, \"Text of Gov. Perry's 'Uproot and Overhaul Washington' speech,\" Nov. 15, 2011", "PolitiFact Texas, \"Rick Perry says Barack Obama labeled Americans as soft,\" Oct. 23, 2011", "MSNBC.com, First Read blog, \"A 'lazy' attack,\" Nov. 16, 2011", "White House, video, \"President Obama at the APEC Business Summit,\" Nov. 12, 2011 (comment at about 27:30)", "White House, transcript, \"Remarks by President Obama at APEC CEO Business Summit Q&A,\" Nov. 12, 2011", "White House, press briefing by deputy press secretary Josh Earnest, Nov. 14, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]