["About this rating", "The phrase \"under God\" was omitted from at least two recitations of the Pledge of Allegiance at individual caucus meetings during the DNC in 2020.", "The DNC did not issue any guidelines forbidding the use of the phrase. On the national stage, the phrase \"under God\" was used during the recitation of the Pledge of Allegiance at the start of each night of the 2020 DNC.", "A rumor circulated on social media during the Democratic National Convention (DNC) in August 2020 alleging that the DNC had omitted the phrase \"under God\" from the Pledge of Allegiance. The following text (also shown in the above-displayed meme), for instance, was copied and pasted to multiple accounts on Facebook:", "The fact that the DNC omitted “under God” from the pledge of allegiance on a national platform should worry every believer!", "This statement is misleading at best. The DNC did not omit \"under God\" from the pledge, nor did they forbid its use. In fact, during every recitation of the pledge before each night's events — the 2020 DNC lasted four nights — the phrase \"under God\" was included.", "Here, for example, is a video of Cedric Richmond Jr., the son of Rep. Cedric Richmond, D-La., reciting the pledge (and saying \"under God\") during the final night of the DNC.", "Here are links to videos of \"under God\" being said during the pledge on nights one,  two, and three.", "Political conventions are sprawling events. In addition to the \"main events\" that take place during the nationally televised program each night, individual caucuses and councils also meet throughout the week.", "On Aug. 17, for instance, the first day of the DNC, the Hispanic Caucus, the Labor Council, the AAPI Caucus, the Black Caucus, the Interfaith Council, the Ethnic Council, the Youth Council, and the Women's Caucus all held meetings prior to the night's nationally televised program. In at least two of these meetings of smaller individual caucuses — the LGBTQ caucus meeting and the Muslim Delegates Assembly on Aug. 18 — the phrase \"under God\" was omitted from the pledge.", "David Brody of the Christian Broadcasting Network brought attention to both of these instances on Twitter. Here's one of the videos posted by Brody:", "The phrase \"under God\" was omitted from at least two recitations of the pledge during the DNC in 2020. Both of these instances occurred during individual council meetings. On the national stage, however, the phrase \"under God\" was spoken during the recitation of the pledge during each of the DNC's four nights.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]