["By D'Angelo Gore", "Posted on February 9, 2021", "In a press conference in which they called on President Joe Biden to use his executive authority to cancel up to $50,000 in federal student loan debt for individuals, Senate Majority Leader Chuck Schumer and Democratic Sen. Elizabeth Warren misstated a racial disparity statistic.", "Schumer, who conferred with Warren on the figures, wrongly said “after 20 years, only 5% of whites have student debt, but 95% of African Americans have debt.” But the 2019 Brandeis University study the senators were trying to cite found that 51% of white student-loan holders and 74% of Black student borrowers still had debt 20 years after they started college.", "In addition, Warren imprecisely said their debt cancellation plan “would help close the Black-white wealth gap by 28 points for African Americans and by a similar number for Latinos.” Another 2019 analysis from Brandeis researchers found that racial wealth gaps among borrowing households only would be reduced by about that much. The reduction in the overall wealth gaps for all households would be much lower.", "At the Feb. 4 press conference, Schumer and Warren were joined by Democratic Reps. Ayanna Pressley, Alma Adams, Ilhan Omar and Mondaire Jones in reintroducing a bicameral resolution pushing for the new president to use his power under the Higher Education Act to address student loan debt.", "Warren and Democratic Rep. Jim Clyburn previously introduced the Student Loan Debt Relief Act in July 2019, but it never received a vote in the House or Senate.", "A study released in September 2019 by Brandeis University’s Institute on Assets and Social Policy found that, respectively, 49% and 26% of white and Black student-loan borrowers had paid off their loans after 20 years.", "But Schumer and Warren incorrectly relayed the study’s findings about the percentage of white and Black loan recipients who still had debt after that time period.", "Schumer, Feb. 4: And there’s an amazing statistic that shows that something like, and Elizabeth will give me the exact numbers, she knows this stuff inside out. But something like only of white student-debt holders — only 15% have debt after 10 years, is it?", "Warren: It’s after 20 years, only 5%.", "Schumer: And after 20 years, only 5% of whites have student debt, but 95% of African Americans have debt.", "That’s not what the IASP reported.", "Its study looked at student debt for a cohort of undergraduates who were tracked for 20 years after they started college in 1995-1996. The authors concluded: “Black students are more likely than their White peers to take on student debt, to take larger amounts of loans, and to have debt decades after pursuing higher education.”", "Specifically, they found: “Two decades after beginning their degrees, the median Black student borrower has $18,500 in loans remaining, while the median White borrower holds just $1,000 in loans. In other words, in 20 years, the median debt of White borrowing students has been reduced by 94 percent — with almost half holding no student debt — whereas Black borrowers at the median still owe 95 percent of their cumulative borrowing total.”", "The amount of debt still owed — not the percentage of people with debt — is what the senators intended to reference, the offices of Schumer and Warren told FactCheck.org.", "As for the disparity between individuals who were debt free within 20 years, the report said: “In that time, nearly half of White borrowers were student debt free (49 percent), while just a quarter of Black borrowers were able to pay off all of their loans (26 percent).”", "So Schumer and Warren would have been correct to say, after 20 years, 51% of white borrowers have student debt while 74% of African American borrowers do, or that white borrowers had reduced their median debt by 94% while Black borrowers had reduced their median debt by 5%.", "Later in the press conference, Warren said that their plan for “canceling student loan debt would help close the Black-white wealth gap by 28 points for African Americans and by a similar number for Latinos.”", "But that’s about how much the gap would narrow among borrowing households only, which are about a third of all U.S. households.", "Warren’s office told us her claim was based on an April 2019 analysis of a previous proposal to cancel up to $50,000 in student debt for households making less than $100,000.", "According to a letter the authors sent to Warren: “Projected relative wealth gap closure and wealth gains among borrowing households only would be formidable. Among borrowing households, the relative White-Black wealth gap would be reduced by a considerable amount, from 2.5% to 27.6%, and the White-Latino wealth gap closes from 53.7% to 81.0%,” with those figures referring to the percentage of white household median wealth held by those racial groups. “The wealth gains among Black borrowing households is projected at $15,700 and at over $27,000 for Latino households.”", "That would be a 25.1 percentage-points reduction in the wealth gap between Black and white borrowing households, and a 27.3 percentage-points reduction in the wealth gap between Latino and white borrowing households.", "Overall, however, the racial wealth gaps wouldn’t change much, the analysis showed.", "“The policy also has a moderately positive effect on both the relative and the absolute racial wealth gap,” the authors wrote. “Wealth for Black and Latino households represents 10.2% and 12.2% of White household wealth at the median. The proposed policy would increase these proportions moderately to 14% for both groups. For both groups, absolute wealth gaps relative to White households would decrease slightly (by $5,121 for Black households and $1,660 for Latino households).”", "That means that, at the median, the wealth gap for all households would be reduced by 3.8 percentage points for Blacks and 1.8 percentage points for Latinos.", "Warren actually provided the appropriate qualifier for her wealth gap claim during a Jan. 28 Senate banking committee hearing.", "“If the president cancelled up to $50,000 in student loan debt, as Leader Schumer and I have called for, it would close the racial wealth gap among people with student loan debt by about 25 points,” she said.", "Her office told us that her press conference remarks intended to emphasize the impact of canceling debt for Black and Latino borrowers.", "In an email, a Warren spokesperson said: “As Senator Warren has said many times and reiterated at this event, student loan debt is disproportionately crushing Black and Latino borrowers and that reality is backed up by both an avalanche of data and the individual experiences of millions of borrowers. Cancelling up to $50,000 in student debt would decrease the wealth gap between Black and white borrowers by 25 points and for Latino borrowers by 27 points and would increase overall Black wealth, including non-borrowers, by up to 40 percent — it would be life changing for tens of millions of Americans.”", "That 40% figure comes from an August report by the Roosevelt Institute, which said: “[O]verall Black wealth is also projected to increase substantially in relative terms (up to a nearly 40 percent increase at the highest cancellation amounts modelled) while the relative impact on average white wealth remains modest.” The highest debt cancellation amount studied was $50,000.", "“Given the many advantages wealth confers in the contemporary U.S. context, the substantial increase in Black net worth is a very significant positive contribution of student debt cancellation, one with potentially transformative positive impacts for Black families overall,” the report concluded. “As a tool to reduce wealth inequality specifically, however, estimates show that student debt cancellation alone is not a sufficient approach. … However, we still believe there is ample reason to pursue student debt forgiveness for reasons of racial equity.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]