["About this rating", "During a speech about reducing incarceration and recidivism in 2014, then-California Attorney General Kamala Harris made a comment stating that 18- to 24-year-olds are \"stupid.\"", "However, Harris was not referring to voters. Rather, when you consider the context of her remark, she was actually taking a sympathetic view of young people and illustrating a larger point about how the criminal justice system treats young adults in that age range when they are developmentally prone to making \"really bad decisions.\"", "In early August 2020, Snopes readers asked about social media posts stating that U.S. Sen. Kamala Harris, D-Calif., had referred to 18- to 24-year-old \"potential voters\" as \"stupid.\" Here's a screen shot of one such post, which was widely seen on Facebook:", "It's true that Harris made a remark calling people in the 18-24 age range \"stupid\" during a speech in 2014, when she was attorney general of California.", "But she wasn't directly talking about \"voters.\" The missing context from this claim is that as Harris recounted various efforts to reduce incarceration and recidivism among young adults, she wryly commented on the decision-making tendencies of those newly entering adulthood.", "The comment came as she was describing Back on Track, a program she launched in 2005 when she was district attorney of San Francisco. The program allowed young people facing first-time, low-level drug sale charges to have their cases dismissed if they met intensive educational and career achievement goals. Here is the quote with more context included:", "So we designed this program around the 18 through 24 [age range] mostly but it was usually up to 30 [years old]. First time, low-level drug sales offender... And here's what we did. We recognized the fact that 18 through 24 — when I was at Howard University and we were in college, we were 18 through 24, and you know what we were called? College kids. But when you turn 18 and you're in the system, you are considered an adult, period. Without any regard to the fact that, that is the very phase of life in which we have invested billions of dollars in colleges and universities knowing that, that is the prime phase of life during which we mold and shape and direct someone to become a productive adult. What's the other thing we know about this population? And it's a specific phase of life, remember, age is more than a chronological fact. What else do we know about this population of 18 through 24? They are stupid. [Crowd laughs.] That is why we put them in dormitories, and they have a resident assistant. They make really bad decisions. So we focused on that age population.", "Harris did refer to 18- to 24-year-olds as \"stupid\" during a speech in 2014. However, she wasn't talking about voters in that age range so much as she was talking about a developmental stage of life for all young adults. And she seems to have used the tongue-in-cheek jab to illustrate a broader need for empathy when it comes to how bad decisions can lead some young people to be prosecuted as adults at a time in their lives when what they need instead is guidance.", "The speech can be viewed here:", "Ford Foundation.   \"California State Attorney General Kamala D. Harris on the Importance of Prison Education.\"\r\n    YouTube.   20 May 2014.", "Hakim, Danny, et al.   \"'Top Cop' Kamala Harris’s Record of Policing the Police.\"\r\n    The New York Times.   9 August 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]