["By Angelo Fichera", "Posted on July 31, 2019", "A meme on Facebook falsely claims that Democratic Rep. Elijah Cummings “wrote a bill to keep all of Obama’s record sealed.” That distorts bipartisan legislation dealing with the federal records of all presidents that Cummings introduced, which became law in 2014.", "A false claim about Rep. Elijah Cummings has circulated on social media in recent days, following President Donald Trump’s Twitter attack on the Maryland Democrat.", "The claim, spread through a popular meme, posits that “Cummings wrote a bill to keep all of Obama’s record (sic) sealed.”", "“But he insists that Congress must see all of President Trump’s financial records,” it continues.", "Cummings — who heads the House Oversight Committee, which has been probing the Trump White House — did indeed sponsor a bill introduced in 2013, and signed by President Barack Obama in 2014, that dealt with presidential records. But it did not “keep all of” Obama’s records “sealed,” and the provisions applied to all presidents’ records — including Trump’s — not just those of the Obama White House.", "The bill — the Presidential and Federal Records Act Amendments of 2014 — made updates to the Presidential Records Act and to the Federal Records Act.", "Among the amendments, the bill requires that the U.S. Archivist “promptly provide notice” in writing to a former president when deciding to publicly disclose records of that president that were not previously publicly available; the incumbent president and the public also must be notified. The Archivist must then make such records public within 60 days, but is prohibited from doing so if the president in question claims a constitutional privilege over the material — unless the incumbent president withdraws that privilege or a final court order directs otherwise.", "The Presidential Records Act defines “presidential records” as “documentary materials” — such as books, correspondence, memos, documents, photographs and more — created or received by the president, immediate staff and others “in the course of conducting activities which relate to or have an effect upon the carrying out of the constitutional, statutory, or other official or ceremonial duties of the President.”", "Many open-government and historical associations supported the legislation, noting that it created specific time limitations for former and current presidents to object to the disclosure of certain records — and that it made changes to reflect modern-day records realities.", "For example, it redefined federal “records” to include “all recorded information, regardless of form or characteristics” (therefore including electronic material) and restricted the president, vice president and others in federal government from using non-official email accounts for government business unless they copy or forward the records to their official accounts.", "The measure received overwhelming bipartisan support at a time of gridlock in Washington: It passed the Republican-led House 420-0 and was then approved, with amendments, by the Democrat-controlled Senate by unanimous consent.", "Media outlets at the time noted that Obama had been silent on the legislation before signing it.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Committee Approves Subpoena to White House for Emails Sent on Personal Accounts in Violation of Federal Law.” Press release, U.S. House Committee on Oversight and Reform. 25 Jul 2019.", "“National Archives Welcomes Presidential and Federal Records Act Amendments of 2014.” Press release, National Archives and Records Administration. 1 Dec 2014.", "“Presidential & Federal Records Act Enacted into Law.” The National Coalition for History. 18 Mar 2015.", "Presidential and Federal Records Act Amendments of 2014. Pub. L. 113 – 187. 128 Stat 2003-2015. 26 Nov 2014.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]