["Sen. Kelly Loeffler, R-Ga., and the Rev. Raphael Warnock, her Democratic challenger in a Jan. 5, 2021, runoff election, at a debate in Atlanta on Dec. 6, 2020. (AP)", "GOP Georgia Sen. Kelly Loeffler supports a 2017 tax law that cuts taxes for individuals and corporations.", "While most of those 2017 tax cuts for middle-class individuals expire at the end of 2025, Loeffler has said she backs making the tax cuts permanent.", "Fighting to oust GOP Sen. Kelly Loeffler in one of the two Georgia elections that will decide which party controls the Senate, Democrat Raphael Warnock put out an ad titled, \"The Cayman Islands.\"", "Most of the spot sullies Loeffler for what it says was her previous work, helping banks set up offshore accounts to avoid paying U.S. taxes. Near the end, the narrator adds, \"but Loeffler’s for raising taxes on Georgia’s middle class.\"", "The reference is to Loeffler’s support of the 2017 tax cuts law signed by President Donald Trump, according to a citation in the ad. But the ad’s characterization of Loeffler’s stance is wrong. For individuals, most of the cuts enacted by the Tax Cuts and Jobs Act expire at the end of 2025 — meaning, after that, taxes will rise. But for the middle class, Loeffler supports making the cuts permanent.", "The law reduces taxes on individuals — through lower tax rates and other measures — and on corporations. While most of the cuts for individuals expire at the end of 2025, the cuts for businesses are permanent.", "The vast majority of middle-income taxpayers are getting tax cuts in the initial years of the law and even after the tax cuts expire, the net effect is roughly zero, according to estimates by the conservative-leaning Tax Foundation and the centrist Tax Policy Center.", "By 2027, though, every income group below $75,000 will see a tax increase.", "Loeffler has been in the Senate a year, having been appointed to fill a vacancy. Her Senate and campaign offices did not reply to our requests for information. But she has stated support for making the tax cuts \"for working and middle class families\" permanent. In April, Loeffler proposed what she called a framework for economic growth that would include making the tax cuts permanent and other efforts, such as aiming to make and grow more products in the U.S., reducing business regulations and expanding eligibility for the Paycheck Protection Program.", "Warnock’s campaign pointed out that Loeffler has not introduced legislation to make the tax cuts permanent.", "\"I haven’t seen extensions featured in much of the discussion yet, but that’s not surprising, as Congress usually waits until the very last minute to decide on policies,\" said Erica York, an economist with the Tax Foundation’s Center for Federal Tax Policy. \"I imagine we will see negotiations over how to handle the expirations really take off closer to 2025.\"", "Warnock said Loeffler supports \"raising taxes on Georgia's middle class.\"", "Loeffler supports a law that contains tax cuts for the middle class that expire at the end of 2025, but she has been clear that she supports making the cuts permanent.", "We rate the statement False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "AdImpact.com, Raphael Warnock ad, December 2020", "Email, Raphael Warnock campaign spokesman Michael Brewer, Dec. 13, 2020", "Email, Erica York, economist, Tax Foundation’s Center for Federal Tax Policy, Dec. 14, 2020", "New York Times, \"Republicans, Not Biden, Are About to Raise Your Taxes,\" Oct. 31, 2020", "Facebook, WLBB radio interview of Kelly Loeffler, Dec. 30, 2019", "FactCheck.org, \"Warnock’s False Ad on Taxes,\" Dec. 9, 2020", "PolitiFact, \"False claim GOP tax plan ‘nothing more than a middle-class tax increase,’\" Feb. 5, 2018", "Sen. Kelly Loeffler, \"USA RISE Plan,\" April 28, 2020", "Kelly Loeffler campaign, \"USA RISE Plan Summary,\" May 17 2020", "PolitiFact, \"Who wins and who loses from the tax bill?\", Dec. 19, 2017", "PolitiFact, \"Will the Republican tax law raise middle-class taxes?\", Dec. 22, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]