["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump claimed former Vice President Joe Biden and the \"radical left\" want to \"abolish the suburbs,\" shut down charter schools, and release \"criminals onto our streets,\" during a recent speech in Pennsylvania.", "He also took aim at New York Gov. Andrew Cuomo and mentioned New York City Mayor Bill de Blasio.", "\"Look at what happened in New York,\" Trump said. \"Cuomo ended cash bail. Cuomo. That wasn’t even DeBlasio that did it. It was Cuomo, the governor. He ended it in New York, and now the crime rate has gone through the roof.\"", "We were curious whether changes to state laws governing cash bail could be linked to an increase in crime.", "Trump claims Cuomo \"ended cash bail.\"", "Statutory changes over how and when New York judges can impose cash bail took effect in January, with the intent of keeping people accused of certain crimes out of jail while they await trial, regardless of their ability to afford bail.", "The changes allow judges to set bail for mostly violent crimes but not for lesser crimes. Further changes were included in the state budget, finalized in April. These changes allow for more situations in which judges can set bail, and more crimes are eligible for bail, such as sex trafficking offenses, first-degree grand larceny, and escape from custody. The newer changes followed some cases in which people who were released under the new law went on to be charged with other crimes.", "Trump also claims that crime rates in New York are \"through the roof.\"", "Those who study crime rates said that compared with last year, there has been an increase in certain violent crimes, including shootings and homicides in New York City, while occurrences of other crimes, such as sex offenses, have fallen.", "The New York City Police Department reported earlier this month that shootings, homicides, burglaries and car thefts were on the rise. Murder is up 30 percent in New York City in the first seven months of 2020, compared with the same period in 2019, while shootings are up 72 percent during the same period.", "In Buffalo, the homicide rate for the first six months of 2020 was higher than it’s been since at least 2007, according to an analysis by The Buffalo News.", "But the increases in murders year-over-year have been happening in many other cities across the country, not just in those in New York state, and in places where there hasn’t been bail reform. Meanwhile, other categories of violent and non-violent crime are down.", "Trump made a connection between New York’s bail reforms and the crime rate.", "We reached out to four people who study crime data and a top official at a statewide organization that represents prosecutors, and they told us that it is too early to say whether there is a link between bail reform and more crimes.", "More data is needed, they said. They also cautioned this year's upheavals in the economy, education, and housing caused by the COVID-19 pandemic could be affecting crime rates. Also unrelated to bail reform, some people being held in jails and prisons were released because of the threat of the new coronavirus.", "It’s going to be \"very difficult to parse what is driving crime rates if indeed they remain high in the coming years,\" said Erica Bond, policy director at the Data Collaborative for Justice at John Jay College.", "An accurate analysis would look at crimes committed by people who have been released under the new bail laws, and any analysis would cover at least six or 12 months, though the pandemic complicates this year’s data, they said. They also said that the increase in murders is likely not due to low-level offenders being released into the community before trial.", "\"The people out on bail reform should be low-level offenders,\" said Christopher Herrmann, a former member of the NYPD who analyzed statistics there and now teaches and does research at John Jay College of Criminal Justice.", "Insha Rahman writes about bail reform, including New York’s new laws, and is director of strategy and new initiatives at the Vera Institute of Justice, which favors reducing the use of jails. Rahman said the best data-driven analysis of the relationship between the new bail law and crime rates that she has read was done by reporters at the New York Post.", "The Post looked at reports from the New York City Police Department, and found that people who were released from jail under bail reform did not contribute to the city’s rising number of shootings.", "\"Though the city logged 528 shooting incidents through June 30 — a 46 percent spike from the 362 tallied at the same point last year — just one person released under the statewide bail reform laws passed Jan. 1 has been charged with a shooting, according to a breakdown provided by the NYPD,\" the Post reported in July.", "Less than 1 percent of the people released from Rikers Island under bail reform were involved in any shootings, and more than half of those are not accused of any wrongdoing, they were identified as witnesses or victims, the Post found.", "We reached out to the White House three times for evidence of Trump’s claim but did not receive a reply.", "NYPD officials, including Commissioner Dermot Shea, have pointed to bail reform as a reason for an increase in crime. In March, the department reported that more than 480 people who were released under the new law committed other crimes. We asked the NYPD twice for any evidence of a link between bail reform and crime rates but did not receive a reply.", "The New York Times, earlier this month, reported that a confidential city analysis of police data found little if any link between bail reform and an increase in violence.", "Trump said that Cuomo \"ended cash bail\" and now the crime rate has gone up. The White House offered no evidence in support of this claim.", "Cuomo signed changes to cash bail into law, but many violent felonies and other crimes, such as sex offenses, are still eligible for bail.", "In New York City, some violent crimes have increased, but not all violent crimes.", "Crime researchers we spoke with said that more analysis is needed to determine whether the changes to cash bail have led to any increase in crime, but there is not strong evidence suggesting that. In fact, preliminary analyses do not support Trump's claim.", "We rate Trump’s claim False.", "Rev.com, \"Donald Trump Speech Transcript August 20: In Joe Biden’s Hometown,\" Aug. 20, 2020. Accessed Aug. 23, 2020.", "Brennan Center for Justice, \"New York’s Latest Bail Law Changes Explained,\" April 16, 2020. Accessed Aug. 23, 2020.", "Phone interview, Insha Rahman, director of strategy and new initiatives, Vera Institute of Justice, Aug. 27, 2020.", "Phone interview, Erica Bond, policy director, Data Collaborative for Justice at John Jay College, Aug. 27, 2020.", "Phone interview, Preeti Chauhan, Ph.D., director, Data Collaborative for Justice at John Jay College, Aug. 27, 2020.", "Email, phone interview, Christopher Herrmann, Ph.D., assistant professor, John Jay College of Criminal Justice, Aug. 26, 27, 2020.", "New York Post, article, \"NYPD’s own stats debunk claims of bail reform leading to spike in gun violence,\" July 8, 2020. Accessed Aug. 27, 2020.", "City and State, commentary, \"Did bail reform really cause a crime wave?\" Lindsay Beyerstein, Feb. 17, 2020. Accessed Aug. 27, 2020.", "New York Times, article, \"Spike in Crime Inflames Debate Over Bail Law in New York,\" Feb. 4, 2020. Accessed Aug. 27, 2020.", "New York Times, article, \"Gun Violence Spikes in N.Y.C., Intensifying Debate Over Policing,\" June 23, 2020. Accessed Aug. 27, 2020.", "New York Times, article, \"The Mayor Blames the Virus for Shootings. Here’s What Crime Data Shows,\" Aug. 4, 2020. Accessed Aug. 27, 2020.", "New York Times, article, \"It's Been 'Such a Weird Year.' That's Also Reflected in Crime Statistics,\" July 6, 2020. Accessed Aug. 28, 2020.", "Email interview, Jonathan Sterne, spokesperson, Gov. Andrew Cuomo, Aug. 27, 2020.", "Email interview, Morgan Bitton, executive director, District Attorneys Association of the State of New York, Aug. 27, 2020.", "PolitiFact New York, \"Police union criticizes new bail law,\" Dec. 22, 2019. Accessed Aug. 27, 2020.", "New York City Police Department CompStat crime statistics report, Vo. 27, No. 34, Aug. 17, 2020 through Aug. 23, 2020. Accessed Aug. 28, 2020.", "The Buffalo News, \"Shootings, homicides increase in Buffalo over first six months of 2020,\" July 9, 2020. Accessed Aug. 28, 2020.", "NYC.gov, \"NYPD Announces Citywide Crime Statistics for July 2020,\" Aug. 3, 2020. Accessed Aug. 28, 2020.", "New York Post, article, \"Tiffany Harris indicted on felony hate-crime charges — but still won’t face bail,\" Jan. 14, 2020. Accessed Aug. 28, 2020.", "New York Daily News, article, \"Many suspects freed under bail reform go on to commit major crimes: NYPD,\" March 5, 2020. Accessed Aug. 28, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]