["By Angelo Fichera", "Posted on September 14, 2018 | Updated on August 28, 2019", "Q: Is California registering noncitizens to vote?", "A: No. A state motor-voter program and a San Francisco school board measure have fueled that false claim.", "A text-based photo on Facebook asks whether “all votes from California should be nullified and Federal Representatives from the State be removed from Congress for the benefit of all the States?”", "The state’s purported offense? “California is registering non-citizens to vote and has refused to Cooperate with the Federal Election Integrity Program.”", "But that text — the same that appeared in a July tweet by the chairman of a national group called Students for Trump — is rooted in false and misleading information. California is not registering noncitizens to vote, save for one city allowing certain illegal immigrants to vote only in school board elections.", "The Sept. 10 photo was shared more than 22,000 times on Facebook, and the original tweet was retweeted nearly 17,000 times.", "Some websites posted a story this summer with the misleading headline that San Francisco was giving “illegal aliens the right to vote in elections” — when in fact the measure only affords certain noncitizens the right to vote in school board elections, as we wrote in July.", "The measure, which voters approved in 2016, gives all immigrants living in the city who are of legal voting age and who are parents, guardians or caregivers of a child under the age of 19 permission to vote in school board elections. The local policy doesn’t permit noncitizens to vote in any other elections, including federal contests — which is the subject of the Facebook photo.", "Earlier this year, we debunked a similar false assertion about California’s New Motor Voter Program. That program is an effort to increase voter turnout by automatically registering people to vote when they renew or obtain a new license, unless they opt out.", "Critics claimed California would therefore register illegal immigrants to vote because the state also has a measure in place that allows noncitizens to obtain special driver’s licenses.", "But California officials maintain that only eligible voters would be automatically registered. A spokeswoman for the state’s DMV told us in March that “undocumented Californians are not eligible to register to vote and [the] DMV has programming measures to prevent that from occurring.”", "“One example is the technician is unable to enter information that would allow the undocumented customer to register. It is automatically greyed out and cannot be bypassed,” Jessica Gonzalez told us in an email.", "We could also find no record of the “Federal Election Integrity Program” mentioned in the text of the image. That is likely a reference to the short-lived Presidential Advisory Commission on Election Integrity.", "The federal commission, created in 2017 to examine “fraudulent voting” and other issues, faced opposition in obtaining voter data from California and other states, some citing concerns over voters’ privacy. The panel was dissolved in January, about eight months after it was created.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Update, Aug. 28, 2019: In late 2018, the California Secretary of State’s office said roughly 1,500 people — including noncitizens — were erroneously registered to vote through the state’s motor-voter program. The office has said those registrations have since been cancelled, but this month it announced that six people who were erroneously registered “due to DMV errors” actually voted in the 2018 elections. Paula Valle, a spokeswoman for the office, told us none of the individuals wrongly registered were licensees under the AB-60 program, which allows immigrants in the country illegally to obtain a license.", "“Executive Order on the Termination of Presidential Advisory Commission on Election Integrity.” WhiteHouse.gov. 3 Jan 2018.", "Hale Spencer, Saranac. “Noncitizens Get Narrow Access to Polls in San Francisco.” FactCheck.org. 26 Jul 2018.", "“Presidential Advisory Commission on Election Integrity.” WhiteHouse.gov. Accessed 13 Sep 2018.", "“Responses to the ‘Voter Fraud’ Commission’s Voter File Data Request.” Brennan Center for Justice. 5 Oct 2017.", "“Secretary of State Alex Padilla Responds to Presidential Election Commission Request for Personal Data of California Voters.” Press release, California Secretary of State’s Office. 29 Jun 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]