["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama made multiple claims about the improving U.S. economy during his 2014 State of the Union address, touting the nation’s resilience.", "After making claims about jobs, energy and the deficit, Obama had this to say about international business:", "\"And for the first time in over a decade, business leaders around the world have declared that China is no longer the world’s No. 1 place to invest; America is.\"", "It was one of only two times during the speech the president mentioned China, long considered the ascendant rival of the U.S., and the second-largest economy in the world. (The other mention was about using export partnerships to create jobs.) Considering the breakneck growth of China’s economy, the claim piqued our curiosity.", "A White House spokesman said the comment referred to the 2013 A.T. Kearney Foreign Direct Investment Confidence Index, a survey of corporate executives from 302 companies in 28 countries that measured where companies are looking to make global investments. The top highlight: The United States took the No. 1 spot for the first time since 2001.", "Country", "Index value (0-3)", "2013 rank", "2012 rank", "2010 rank", "United States", "2.09", "1", "4", "2", "China", "2.02", "2", "1", "1", "Brazil", "1.97", "3", "3", "4", "Canada", "1.86", "4", "20", "9", "India", "1.85", "5", "2", "3", "Australia", "1.83", "6", "6", "7", "Germany", "1.83", "7", "5", "5", "United Kingdom", "1.81", "8", "8", "10", "Mexico", "1.77", "9", "-", "8", "Singapore", "1.77", "10", "7", "-", "Note: A.T. Kearney did not conduct a survey in 2011", "This index -- in its 13th edition since 1998 -- is not a measure of actual dollars being brought in, but rather the confidence global companies have investing in certain nations in the future.", "A.T. Kearney, a global management consulting firm, said in its June 2013 report that foreign direct investment -- injecting money into a country’s economy by either buying a company or expanding an existing company -- in the United States is still down from the 2008 high of $306 billion, bringing in $167.7 billion in 2012.", "The index’s outlook is based on business leaders’ attitudes toward political, economic and regulatory changes and their potential effects on foreign investments. Corporate, regional and local business managers responding to the survey said China’s rising labor costs and focus on shifting to a consumer economy took some of the shine off the economic powerhouse, although 73 percent of the respondents said they would maintain holdings in the country.", "Meanwhile, partisan brinksmanship in the U.S. government made investors wary, but they were optimistic thanks to a favorable dollar, a slow but steady recovery and increasing U.S. manufacturing productivity. In all, 63 percent of respondents expected some growth in America’s economy. Even as the survey was taken amid the 2012 elections and budget fight, the U.S. was considered \"a bedrock of stability among developed nations,\" the 2013 index report said.", "Is saying the U.S. is now the \"No. 1 place to invest\" an accurate portrayal of the results? A.T. Kearney director of communications Doug MacDonald said yes.", "\"In terms of our index, it does,\" he told PolitiFact. \"Ours actually asks business leaders what markets they’re looking forward to investing in.\"", "But what about other indices?", "A comparable study -- albeit with different measurement criteria -- is the Milken Institute’s Global Opportunity Index, which lists the United States as 22nd among 98 countries. That study tracked nations’ abilities to attract foreign direct investment by measuring factors across \"economic fundamentals, regulatory barriers, ease of doing business, regulatory quality, and the rule of law.\" Released in March 2013, the Milken Institute’s report was created with 2011 data, and lists China as No. 1.", "There are also similar rankings from business media outlets. In December, Forbes ranked the United States 14th out of 145 nations in its \"Best Countries for Business\" list. The annual rating placed Hong Kong at No. 3 and Ireland at No. 1, based on \"11 different metrics including property rights, innovation, taxes, technology, corruption, freedom (personal, trade and monetary), red tape, investor protection and stock market performance.\"", "Bloomberg rated the United States second, behind leader Hong Kong, in its own \"Best Countries for Business 2013.\" That ranking, based on \"six broad criteria that included the cost of starting a business, the cost of labor and materials and the cost of moving goods,\" placed China a distant 24th.", "Our ruling", "Obama said that \"for the first time in over a decade, business leaders around the world have declared that China is no longer the world’s No. 1 one place to invest; America is.\"", "He was referring to the 2013 A.T. Kearney Foreign Direct Investment Confidence Index, which surveys global business leaders to determine their investment attitudes toward nations across the world. The United States did top the list this year, for the first time since 2001, knocking China out of the top slot.", "The president is accurate by citing one particular study, and that study did ask business leaders what they thought about investing in the United States. A broader look at other rankings doesn’t make the United States seem like such a powerhouse, even if it does still best China in some lists. We rate Obama’s claim Mostly True.", "Barack Obama State of the Union Address, January 28, 2014", "A.T. Kearney, \"Back to Business: Optimism Amid Uncertainty: The 2013 A.T. Kearney Foreign Direct Investment Confidence Index,\" accessed Jan. 29, 2014", "United Nations Conference on Trade and Development, \"Global Investment Trends Monitor No. 15,\" accessed Jan. 29, 2014", "Organization for International Investment, \"Foreign Direct Investment in the United States 2013 Report,\" accessed Jan. 29, 2014", "Reuters, \"U.S. at top spot on FDI confidence index,\" June 26, 2014", "International Business Times, \"US Tops China As Most Favored Nation For Foreign Direct Investment,\" June 26, 2013", "PR Newswire, \"A.T. Kearney FDI Confidence Index Shows the U.S. Surging to Top Destination for Expected Foreign Direct Investment for the First Time Since 2001,\" June 26, 2013", "The Milken Institute, \"Global Opportunity Index, March 2013,\" accessed Jan. 29, 2014", "Forbes, \"Ireland Heads Forbes' List Of The Best Countries For Business,\" Dec. 4, 2013", "Bloomberg, \"Best Countries for Business 2013,\" Jan. 22, 2013", "Interview with Bobby Whithorne, White House assistant press secretary, Jan. 29, 2014", "Interview with Doug MacDonald, A.T. Kearney director of communications, Jan. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]