["About this rating", "A rumor holding that the Bill and Melinda Gates Foundation had been kicked out of India has been circulating online since at least May 2017, when an article pushing this claim was published on the website Steemit:", "BILL AND MELINDA GATES FOUNDATION KICKED OUT OF INDIA", "Yes, the Microsoft founder and the icon of the Third-World Humanitarianism has been kicked out of India as his fraud was called out. He came to India posing as a philanthropist and humanitarian helping the Third-World poor people by alleviating their conditions and yes, of course, “VACCINATING” their children.", "This simply wasn't true. The Gates Foundation was not kicked out of India in 2017 when the Steemit article was published, and as of this writing in 2019, the Gates Foundation continues to work in that country.", "The foundation is one of the largest private foundations, with offices all over the world. In India, the organization is primarily focused on the Uttar Pradesh and Bihar regions, where they are working to reduce poverty and improve access to healthcare:", "More than a decade ago, the Government of Bihar made the decision to prioritize healthcare for mothers and children, and this focused effort has started to show impact. The child mortality rate in India's third-biggest state has declined since then by one third.", "As part of this investment in its people's well-being, the state government sought partners who could provide technical support. Our foundation already had a team working on maternal, newborn, and child health, the area where Bihar wanted to focus, so in 2010 we started working together.", "The public health system in Bihar consists of hundreds of thousands of health workers, from doctors and auxiliary nurse midwives in primary health facilities to ASHA and Anganwadi workers who provide basic advice and care to women in communities. We began by helping the government test new techniques and technologies to improve the quality of these providers' services in eight pilot districts. For example, to help frontline workers advise women about healthy practices like breastfeeding, we developed next-generation teaching aids based on digital technology. In facilities, we established a nurse-mentoring program that has, among other successes, doubled the number of nurses who wash their hands and wear gloves before and during procedures.", "When rumors started to circulate that the Foundation had been kicked out of India in 2017, the country's Ministry of Health and Family Welfare released a statement disputing those reports which stated that \"Some media reports have suggested that all health related collaboration with the Gates Foundation with National Health Mission (NHM) has been stopped. This is inaccurate and misleading. BMGF continues to collaborate and support the Ministry of Health and Family Welfare.\"", "The Bill and Melinda Gates Foundation's website has several pages dedicated to the group's work in India. The government of India has also dispelled the rumor that the foundation was kicked out. So, was this claim simply made up out of the blue?", "The rumor can be traced back to a study by the global health organization PATH (Program for Appropriate Technology in Health) to see if it could reduce the number human papillomavirus (HPV) infections by providing cost-effective vaccines to impoverished communities. This trial was conducted in Uganda, Peru, and Vietnam, but it was the group's efforts in India that caused controversy.", "Beginning in 2009, PATH worked with the Indian government's Council of Medical Research as well as local governments to provide more than 20,000 girls between the ages of 10-14 with HPV vaccines donated by Merck & Co. (Gardasil®) and GlaxoSmithKline (Cervarix®). India's government halted the effort in April 2010, however, when local news reports claimed seven of the girls involved in the trial had died after receiving their vaccines.", "The government of India also opened an investigation into the matter. While the government accused PATH of a few ethical lapses (such as improperly filed consent forms), investigators concluded that the deaths were not related to the vaccines. For instance, one of the deaths related to a girl who drowned in a quarry, and another was linked to a snake bite.", "Science Magazine reported:", "State investigations absolved the trial’s managers—PATH and the Indian Council of Medical Research (ICMR) in New Delhi—of responsibility in the deaths. Five were evidently unrelated to the vaccine: One girl drowned in a quarry; another died from a snake bite; two committed suicide by ingesting pesticides; and one died from complications of malaria. The causes of death for the other two girls were less certain: one possibly from pyrexia, or high fever, and a second from a suspected cerebral hemorrhage. Government investigators concluded that pyrexia was “very unlikely” to be related to the vaccine, and likewise they considered a link between stroke and the vaccine as “unlikely.” ICMR’s director general, microbiologist Vishwa Mohan Katoch, categorically rejects a connection: “Based on the enquiry, it is certain that causality of the seven deaths was not at all related to the HPV vaccine,” he insists. Other experts say that in the absence of autopsies, it is impossible to pinpoint the actual cause of death.", "So, what does the Bill and Melinda Gates Foundation have to do with this? The Gates Foundation is one of PATH's global partners and reportedly provided funding for this HPV study.", "The Parliament of India released a report in 2013 that chastised PATH for \"irregularities\" with the studies. While the report recommend the government take action against PATH, this global health organization was never banned from India. In fact, as of this writing, both PATH and the Gates Foundation continue to work in the country.", "Bagla, Pallava.   \"Indian Parliament Comes Down Hard on Cervical Cancer Trial.\"\r\n    Science Magazine. 9 September 2013.", "Bill and Melinda Gates Foundation.   \"India: Our Priorities.\"\r\n    Retrieved 23 October 2019.", "Press Information Bureau Government Of India.   \"Press Note.\"\r\n    8 February 2017.", "PATH.   \"Update: PATH's HPV vaccine project in India.\"\r\n    27 April 2010.", "Reddy, Akhil.   \"Bill & Melinda Gates Foundation ‘Reportedly’ Funded the 2009 HPV Studies in India, But It Was Not Kicked Out.\"\r\n    Factly.   20 August 2019.", "Reddy, Akhil.   \"Bill & Melinda Gates Foundation ‘Reportedly’ Funded the 2009 HPV Studies in India, But It Was Not Kicked Out.\"\r\n    Factly.   20 August 2019.", "Steemit.   \"Bill and Melinda Gates Foundation Kicked Out of India.\"\r\n    18 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]