["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This combination of 2019 file photos shows House Speaker Nancy Pelosi, Sen. Bernie Sanders and House Financial Services Committee Chair Maxine Waters. (AP)", "A viral post on Facebook tried to rewrite three Democratic lawmakers’ congressional records.", "The post, which was published Nov. 17 by the popular conservative page Trump Rules, includes photos of House Speaker Nancy Pelosi, D-Calif., Rep. Maxine Waters, D-Calif., and Sen. Bernie Sanders, I-Vt. Text written over the images claims the trio has not been very productive during their government careers.", "\"67 combined years. 6 bills passed,\" the post reads.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It has been shared thousands of times by several different users and pages.", "Like past social media posts, this one is inaccurate.", "(Screenshot from Facebook)", "Let’s look at the first claim — that Sanders, Pelosi and Waters have served a combined 67 years in Congress.", "Sanders was first elected to Congress in 1991 and has served as both a representative and senator. Pelosi was elected in 1987 and has served as both a representative and speaker of the House. Waters has served as a representative since 1991.", "When combined, the three lawmakers have served 88 years in Congress — actually more than the Facebook post claims.", "On the second claim, the Facebook post also falls flat. According to GovTrack, a website that keeps tabs on congressional legislation, the lawmakers mentioned in the post have passed more than six bills.", "For this fact-check, we first used the most stringent definition of the word \"passed\" — legislation that is \"enacted,\" or signed by the president — to assess the validity of the post. Then we looked at how many sponsored bills had passed at least one chamber of Congress.", "Here is each lawmaker’s legislative record as of Nov. 17:", "Sen. Bernie Sanders, I-Vt.", "Passed: 2", "Enacted: 3", "Rep. Nancy Pelosi, D-Calif.", "Passed: 9", "Enacted: 7", "Rep. Maxine Waters, D-Calif.", "Passed: 23", "Enacted: 3", "That puts the lawmakers’ combined enacted bills at 13 — not six, as the Facebook post claimed.", "However, experts have told us that counting enacted bills is not the only nor the best way to measure lawmaker productivity.", "\"Very few bills are ever enacted — most legislators sponsor only a handful that are signed into law,\" reads a notice on the GovTrack site. \"But there are other legislative activities that we don’t track that are also important, including offering amendments, committee work and oversight of the other branches, and constituent services.\"", "Additionally, Pelosi has served as House speaker for seven years, nonconsecutively. That role is more focused on setting the party’s agenda than actually introducing bills, according to GovTrack.", "The Facebook post is inaccurate. We rate it False.", "Facebook post, Nov. 17, 2019", "GovTrack, accessed Nov. 21, 2019", "PolitiFact, \"Social media posts mislead on Democratic senators’ records,\" Sept. 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]