["The photo was published on Facebook here on February 4, 2021. The post reads: “The most clear picture of the sun surface published by NASA”.", "The photo was also shared alongside a similar claim in Facebook posts around the world, for example in Pakistan here; in the Philippines here, here and here; in Iraq here and here; in Bangladesh here; and in New Zealand here.", "The claim, however, is false.", "A reverse image search on Google found the photo was taken by Jason Guenzel, a US photographer. Guenzel published the photo in January 2021 on his Facebook account here; on his Twitter account here; and on his Instagram account here.", "Belows is a screenshot comparison of Guenzel’s photo on his Facebook page (L) and the photo shared in the misleading post (R):", "\"This session on the Sun was marred by sub-par atmospheric conditions leaving a loss of contrast and detail. I took this opportunity to heavily process the resulting image into a stylized rendition of the visible surface of the sun,” Guenzel’s Facebook post read.", "In response to an enquiry from AFP, NASA’s heliophysics communications lead Karen C. Fox said in an email on February 9, 2021, that the photo is “not a NASA image.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]