["“35000\\- का चालान करने पर लडके ने अपनी कार में आग लगा दी और बीवी बच्चो को सडक पे पिस्तौल देके बिठा दिया । आगे पूरा विडियो देखे ।” (A man set his car on fire on being fined Rs.35000, and made his wife and children sit on the road with a pistol. Watch the entire video- translated).", "A video which shows a tense standoff between police and an armed person, has been shared widely on social media along with the above message. The video, which also shows a burning vehicle, has been circulated with the narrative that a person set ablaze his own car after being fined Rs.35,000 for traffic rule violations.", "#Mathura :- 35000\\- का चालान करने पर लडके ने अपनी कार में आग लगा दी और बीवी बच्चो को सडक पे पिस्तौल देके बिठा दिया । आगे पूरा विडियो देखे ।", "Posted by सुमित सरीन on Thursday, October 10, 2019", "The above video, posted by an individual users, has been viewed over 540,000 times so far, and shared over 15,000 times since it was posted on October 10. As can be seen, the video is a broadcast by the Hindi channel ABP News. The incident took place in Mathura, UP.", "Another video of the incident, shot by a bystander, shows the police attempting to communicate with the armed person via microphone, while the latter warns the police against coming any closer. In the distance, a burning car can be seen, as also a woman and child squatting on the road. A gun is handed over to the female by the armed person. The video has also been posted on Twitter.", "35000\\- का चालान करने पर लडके ने अपनी कार में आग लगा दी और बीवी बच्चो को सडक पे पिस्तौल देके बिठा दिया।", "चाय बनाने वाला चीखता रहा कि वह चौकीदार बनने के ही काबिल है, परन्तु अंधभक्तों ने उसे PM बना दिया, मानसिक संतुलन खोता नौजवान, अभी तो यह ट्रेलर है… 👇👇 pic.twitter.com/QURGTMOKgR", "— Jagdish Parkash (@jagdish_parkash) October 13, 2019", "The video has been posted on Facebook by several users, with identical text.", "While it is true that the person did set his own car on fire, Alt News found that the narrative accompanying the video on social media is false. The incident had occurred in September 2019. It is NOT related to imposition of heavy penalty for traffic violation, as claimed.", "Clarifying over the incident, Mathura police had put out a video on Twitter, wherein SSP Mathura Shalabh Mathur explained that the standoff and the ensuing drama was the outcome of a domestic matter. He said, “The entire incident was orchestrated by one Shubham Choudhary along with his female friend, over a domestic matter. He had informed his family about creating a scene, so that he could get attention. The role of his family is also being probed. Investigation is currently on, and the man along with his female friend have been charged under relevant sections of the IPC.” (translated from Hindi). The video is posted below.", "मथुरा कचहरी रोड पर अपनी ही कार में आग लगाने वाली घटना के पीछे के कारण व पुलिस द्वारा की गयी कार्यवाही के सम्बन्ध में वरिष्ठ पुलिस अधीक्षक मथुरा #ShalabhMathur द्वारा दी गयी बाईट।@Uppolice @adgzoneagra @igrangeagra pic.twitter.com/F2Qz3N3qMl", "— MATHURA POLICE (@mathurapolice) September 26, 2019", "The incident was reported by News18 in September. The report stated that the accused had planned the incident to grab attention.", "It may be noted that the video in question has been shared with a false narrative. The man seen in the video did not set his car ablaze over Rs.35,000 fine, but over a personal matter. Ever since the Motor Vehicles (Amendment) Act 2019 came into effect from September 2019, there has been a spate of misinformation on social media.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]