["About this rating", "In a \"gotcha\" moment that wasn't, conservative internet commentators posted incorrect claims on Twitter that 2020 Democratic presidential candidate Joe Biden said he had personally amassed $280,000 in college debt. Biden made no such claim.\n Biden was in fact referring to educational debt associated with his children, a fact that could be gleaned by listening to his comments in their entirety.", "The former U.S. vice president's original remark came during a campaign stop on Aug. 24, 2019, at Keene State College in New Hampshire. He was approached by a woman who spoke about the cost of her education and asked him to promise that, if elected, he wouldn't forget about college students.", "Biden responded by stating he would not forget and said that he is affected by the issue himself, having accumulated $280,000 in debt by putting three of his children through college and graduate school.", "Crowder, a Twitter and YouTube personality, later deleted the above tweet and noted the mistake, but not before the misinformation spread on the platform.", "Deleted a tweet about Joe Biden's college debt. There is now video which proves the initial reporting was false. Video is here: https://t.co/lMOAIwSSgI", "— Steven Crowder (@scrowder) August 27, 2019", "C-SPAN. \"Joe Biden in Keene, New Hampshire.\"\r\n  24 August 2019.", "Berman, Jillian. \"Where the 2020 Candidates Stand on Student Debt and College Affordability.\"\r\n  Marketwatch. 30 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]