["The one-minute video was published in this Facebook post on June 23, 2019.", "It has been viewed more than 18,000 times and shared more than 480 times.", "Below is a screenshot of the misleading post:", "The post’s caption states: “Genting Highland bus couldn't brake, driver abandoned & jumped from the bus to save his own life ..”", "\"Genting Highland\" refers to Genting Highlands tourist resort in Malaysia.", "A logo on the top-right corner of the video states; “RPM Chanel”.", "The same video was shared in other Facebook posts, for example here and here, with a similar claim.", "The claim is false; the video has previously circulated online in reports about a bus accident in Indonesia; Google Street View images of the same junction cited in the media reports directly corresponded with the video.", "The video was taken from this video on the YouTube channel Riki Putera Minank, which was published on June 16, 2019.", "The three-minute, 49-second video's title states: “The Moment the Bus Brake Fails in sitinjau lauik.”", "Translated to English, the Indonesian-language caption reads:\n\t“Location: Sitinjau lauik, padang\n\tSunday, June 16, 2019, time: 2:30pm \n\tOriginal video recorded and owned by: Riki Putera Minank", "\"The medan tour bus was taking a group to Padang but its brake failed at the descent of sitinjau lauik. It crashed into a wall at sitinjau road and 2 units of pertamina tank trucks. Alhamdulilahh, no casualties only slight injuries.”", "Padang is the capital city of West Sumatra province in Indonesia.", "The video in the misleading posts directly corresponds with the YouTube video from from the 21 seconds mark to the one minute 20 seconds mark.", "Below are screenshot comparisons of the video in the misleading posts (L) and the YouTube video (R):", "The accident was also reported by local Indonesian media TVOneNews here on its official YouTube channel on June 18, 2019.", "The Indonesian-language title of the video translates to English as: “Tour Bus Hits Fuel Tank Trucks in West Sumatra”.", "The YouTube caption translates to English as: “The tour bus was involved in an accident with a Pertamina tanker on the Sitinjau Lauik ascent, Padang City, West Sumatra. The cause of the accident was allegedly due to the tour bus experiencing brake failure.”", "Pertamina is an Indonesian state-owned oil and natural gas corporation.", "A keyword search found the location of the accident here on Google Street View.", "Below is a screenshot of the location on Google Street View:", "Fajar Sumbar.com, a Padang-based news site, also published this report on June 17, 2019, about the accident. The Indonesian-language headline translates to English as: “Tour Bus Crashes Into Pertamina Tank Trucks, Brake Failure Suspected.”", "The report’s first paragraph translates to English as: “Due to suspected brake failure, a tour bus crashed into two pertamina tank trucks at Sitinjau Lauik, Lubuk Kilangan district, Sunday (June 16) around 2:15 pm. Luckily there were no casualties in the incident.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]