["About this rating", "In July 2016, an old, debunked e-mail chain asserting that the cost of ammunition was about to skyrocket due to President Obama and the EPA\nshutting down the last lead smelting plant in the U.S. was recirculated. The lengthy message is largely based off of an article published by Right Wing News in October 2013, which claimed that Obama was employing \"back door gun control\" by closing the plant and thereby forcing U.S. residents to purchase ammunition from overseas manufacturers:", "Obama and the EPA just shut down the last lead smelting plant in the US. They raised the EPA regulations by 10 fold and it would have cost the plant $100 million to comply. You can own all the guns you want, but if you can't get ammo, you are out of luck.", "The Doe Run Company has shuttered its lead smelting plant, but that action occurred in 2013, had little to do with Obama administration policies, and did not lead to a massive ammunition shortage.", "The closure of Doe Run Company’s primary lead smelter in Herculaneum, Missouri, was the result of the business' failure to meet existing air quality standards (set by the EPA in 2008, before Barack Obama took office). Doe Run reached a settlement of the issue with the EPA in 2010 and agreed to close the lead smelting plant by the end of 2013:", "In 2010, Doe Run reached a comprehensive settlement with the U.S. Environmental Protection Agency and the state of Missouri. As part of that settlement, the Company agreed to discontinue its smelting operations in Herculaneum by the end of 2013. Over the operating life of the smelter, the Company spent millions of dollars in environmental and other upgrades. Continuing to upgrade the aging smelter to attempt to meet the increasingly stringent environmental regulations imposed on primary lead smelters was not economically feasible given the many other requirements of our business.*", "*In 2008, the National Ambient Air Quality Standard for lead was reduced from 1.5 µg/m3 (micrograms of lead per cubic meter of air) to 0.15 µg/m3.", "When the closure date (31 December 2013) approached, web sites such as Right Wing News published misleading articles asserting that President Obama and the EPA had colluded to shut down the plant in an effort to limit the availability of ammunition in the U.S. But the closure was driven by air quality regulations established during the presidency of George W. Bush and had nothing to do with Barack Obama or any furtive move on his part to effect \"back door gun control.\"  Additionally, fears about the closure's effect on the availability of ammunition were vastly overblown.", "Most manufacturers employ secondary plants that use recycled materials to make ammunition. Primary plants, such as the aforementioned lead smelter in Missouri, use mined resources and typically produce batteries:", "More than 80 percent of all lead produced in the U.S. is used in either motive batteries to start vehicles, or in stationary batteries for backup power (particular in military, telecom and medical applications). In the U.S., the recycle rate of these batteries is approximately 98 percent, making lead-based batteries the most highly recycled consumer product. These batteries are recycled at secondary lead smelters. We own such a smelter in southern Missouri.", "Lead is used in numerous other products, including ammunition and construction materials, as well as to protect against radiation in medical and military applications. While most applications can use secondary lead, those applications that require primary lead will need to import the lead metal in the future. Any additional demand for lead (above that which can be met through recycling at secondary smelters) will also have to be met through imports.", "Several ammunition manufacturers commented on the controversy when it was relevant in 2013. For instance, Sierra (The Bulletsmiths) said that the Doe Run plant's closure would not affect their business:", "The main question asked is “Will this shut down your supply of lead?”  The answer to that is no. First, Sierra buys lead from several different vendors to maintain constant supply.  Second, this facility only smelts primary lead or lead ore. This is lead ore that has just been brought out of the earth.  Sierra uses no primary lead at all and never has, so we use nothing directly from this facility.; The lead we buy from Doe Run comes from their recycling facility in Boss, MO that is about 90 miles away from the smelter that is closing.", "The facility we buy from is still going strong and delivering to us as scheduled.  The lead from this facility is from recycled lead, mostly coming from car batteries. This is a continuing “in and out” cycle for them and the smelter closing will not affect this facility.", "The National Rifle Association (NRA) also issued a statement noting that \"lead usage in ammunition makes up only about three percent of lead consumption in the United States\" and that the domestic ammunition industry would survive the closure of the Doe Run lead smelter plant just fine:", "We previously reported on the closure of the nation's last primary lead smelter due to tightened EPA standards on ambient air quality. As the date for closure of the smelter approaches, there has been a significant amount of speculation concerning the effect of the smelter's closure on the availability and price of ammunition.", "According to the United States Geological Survey, lead usage in ammunition makes up only about three percent of lead consumption in the United States. Lead-acid batteries make up the vast majority of U.S. lead consumption, and these batteries are readily recycled. This recycled lead, which will still be able to be smelted in the United States at secondary smelters even after the Herculaneum smelter closes, is the type most often used by ammunition manufacturers.", "Speculation about the effect of the Herculaneum smelter's closure has caused a number of ammunition manufacturers, including Sierra and Federal, to issue public statements on their ability to continue to source lead for ammunition production. As Lawrence Keane, the senior vice president and general counsel for the National Shooting Sports Foundation, pointed out to Emily Miller of the Washington Times, ammunition producers have known for some time of the impending closure of the Herculaneum smelter and do not believe that the closure will affect production of lead ammunition components.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]