["Union Minister of State for AYUSH, Shripad Naik claimed in a press briefing on April 2 that ayurvedic and homeopathic medicines helped Prince Charles, the apparent heir to the British throne, to be cured of COVID19. Naik was quoted as saying that this recovery “validates our age-old practise since thousands of years”. The source of information for the minister was a Bengaluru-based Ayurvedic doctor. In the press briefing, Naik said, “I received a phone call from Dr Isaac Mathai, who runs the Soukya Ayurveda Resort in Bengaluru. He told me that his treatment of Prince Charles through Ayurveda and Homeopathy has been successful. This is just one example of how the system can work”. Prince Charles had tested positive for coronavirus last month and has since recovered.", "The news was carried by news agencies and prominent media outlets in India. Below is a tweet by news agency IANS.", "#UK‘s #PrinceCharles was cured of #Covid19 through ayurveda and homeopathy treatment from a #Bengaluru-based holistic resort, Union Minister of State for AYUSH Shripad Naik claimed on Thursday. #COVID19Pandemic pic.twitter.com/7SRVWARfBL", "— IANS Tweets (@ians_india) April 2, 2020", "Manish Tewari, MP and National Spokesperson of Congress, also tweeted the same and suggested if homeopathy worked for Prince Charles, we start looking for cures in traditional Indian medicines more efficaciously.", "If homeopathy worked for Prince Charles-COVID -19 we should also start looking for cures in Traditional Indian Medicine more efficaciously. I appeal to @moayush to redouble it’s efforts & incentive those Indian Institutions for eg. @SoukyaOfficial that are doing pioneering work pic.twitter.com/0Ysv16OTDR", "— Manish Tewari (@ManishTewari) April 1, 2020", "Prince Charles is known for his support to homeopathy and is the royal patron of the Faculty of Homeopathy (facultyofhomeopathy.org in the United Kingdom but is there any truth behind the claim that homeopathy cured him of COVID19?", "It is worthwhile to note that while the claim has been published extensively by Indian media, it has found no mention in the British papers. The BBC report that was included in the Faculty of Homeopathy post shared by Manish Tewari makes no mention of Prince Charles’s homeopathy treatment.", "The post tagged two other pages, namely ‘British Homeopathic Association’ and ‘Homeopathy Worked for Me’. It is possible that Tewari mistook ‘Homeopathy Worked for Me’ to be a statement made by Prince Charles.", "The Faculty of Homeopathy, of which the prince is the royal patron, had congratulated him on his recovery but had made no claim about his recovery being linked to any form of alternative medicine.", "#HRH Prince of Wales #RoyalPatron message today following his recovery after Coronavirus https://t.co/Qwi5swUo1Y we are pleased to see he is in #goodhealth #WednesdayThoughts", "— Faculty of Homeopathy (@fohhomeopathy) April 1, 2020", "The Faculty has published a piece of advice from the UK Homeopathic community on COVID-19 which clearly states that “there are no scientific trials available for homeopathic, or any other, treatment of Coronavirus disease– COVID 19”. The advisory warns that “Homeopathic medicines have been used extensively for flu-like symptoms and in epidemics around the world. If you decide to take homeopathic medicine, this should be in addition to the various measures outlined above and should not be your only approach.”", "Hindustan Times approached a spokesperson for the Prince of Wales in London to confirm whether Prince Charles’s recovery from COVID-19 was aided by advice from an Ayurveda practitioner in Bengaluru. The spokesperson told HT, “This information is incorrect. The Prince of Wales followed the medical advice of the National Health Service (NHS) in the UK and nothing more.”", "The NHS position on Homeopathy is clear. In answer to the question, “Does Homeopathy work?”, NHS has stated on its website that, “There’s been extensive investigation of the effectiveness of homeopathy. There’s no good-quality evidence that homeopathy is effective as a treatment for any health condition”.", "During the course of Prince Charles’s recovery, multiple prominent media organisations reported how the Duke of Cornwall was following government guidance and medical advice. As seen above, the government guidance in the UK as illustrated on the NHS website clearly discounts homeopathy as a possible cure.", "In conclusion, there is no evidence to suggest that Prince Charles’s recovery had anything to do with Homeopathic or Ayurvedic medicine. The same has been denied by his office. Alt News Science had earlier debunked Ministry of AYUSH’s false propagation that homeopathic medicine ‘Arsenicum Album 30’ can prevent the spread of coronavirus infection. Our science section also carries an extensive report on the ineffectiveness of homeopathy. This can be read here.", "Note: The number of positive cases of the novel coronavirus in India is over 3,700 and more than 100 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 12 lakh confirmed cases and over 64,000 deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "Nobody's cheerleader, I tweet at @samjawed65", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]