["U.S. Rep. Jim Sensenbrenner, R-Wis., speaks as the House of Representatives debates the articles of impeachment against President Donald Trump at the Capitol in Washington, Dec. 18, 2019. (AP)", "On Dec. 18, 2019, the U.S. House of Representatives took a step it has only taken twice before in the history of the nation: impeaching the president.", "The impeachment grew out of a whistleblower complaint filed Aug. 12, 2019 that described a July 25 phone call between President Donald Trump and Ukrainian President Volodymyr Zelensky, in which Trump asked Zelensky to look into activities in Ukraine by Democratic presidential contender Joe Biden’s son Hunter.", "The complaint surfaced publicly in late September, and House Speaker Nancy Pelosi asked for a formal impeachment inquiry just days later.", "But U.S. Rep. Jim Sensenbrenner, a Republican who has represented a suburban Milwaukee district in Congress since 1979, claimed that more than 100 Democrats took an earlier vote to impeach.", "On Dec. 11, 2019, Sensenbrenner tweeted an image that read: \"104 House Democrats voted for impeachment before the Ukraine call took place.\" He captioned it #ShamImpeachment.", "Many Republicans — and Trump himself — have argued Democrats made up their minds long ago on whether to impeach the president. But Sensenbrenner’s claim puts an entirely new framework on it, saying many had already voted for impeachment.", "Is he correct? Let’s unpack his argument.", "Early impeachment talk", "The first proposed article of impeachment related to Trump was introduced by U.S. Reps. Brad Sherman, D-California, and Al Green, D-Texas, on July 12, 2017.", "It focused on Trump’s firing of FBI director James Comey, who was overseeing an examination looking into Russian interference in the 2016 U.S. presidential election.", "The measure never moved further than its introduction, but the tide turned when Democrats took over the House after the 2018 midterm elections.", "Sherman reintroduced the bill Jan. 3, 2019 — the day the new Congress was sworn in.", "It was the same day freshman Rep. Rashida Talib, D-Michigan, made headlines when she declared — at a party hosted by the liberal group MoveOn — that \"we’re going to impeach the motherf*****.\"", "Green would bring a similar measure back several more times, but Democrats — including Pelosi — generally resisted calls to launch an impeachment inquiry.", "The impeachment votes that never were", "When asked to provide backup for Sensenbrenner’s claim, his communications director Christopher Krepich pointed to three roll call votes in the House as evidence.", "The first, which took place Dec. 6, 2017, was on a motion to table a measure from Green calling for Trump’s impeachment for \"high misdemeanors.\" The motion passed 364-58, with four voting \"present\" and six not voting, meaning any debate on the bill was suspended.", "The second vote, on Jan. 19, 2018, was nearly identical: A bill from Green to impeach Trump was tabled again.", "The third vote took place just days before the Ukraine call, on July 17, 2019. Yet again, Green’s bill was tabled, this time by a 332-95 vote, with one voting \"present\" and four not voting.", "Indeed, tallying the \"no\" votes from each of those roll calls and excluding those who either left or lost their seats in the 2018 midterm elections, that number comes to 103 Democrats. So, numerically, Sensenbrenner is basically right.", "But his characterization is, well, basically wrong.", "His spokesman, Krepich, argued a \"no\" vote on postponing the bills equals a vote to proceed on impeachment.", "Experts we consulted told us voting against a motion to table isn’t actually a vote in favor of a resolution.", "\"In voting to oppose tabling a measure, that is literally an expression of support for continuing consideration of a measure,\" said Sarah Binder, a professor of political science at George Washington University and a senior fellow at the left-leaning Brookings Institute, in an email. \"It is not technically a direct vote on the substance of the resolution.\"", "That is, there never was a vote on the merits of any of Green’s measures.", "Frank Bowman, a law professor at the University of Missouri, said it’s more likely the votes against tabling the measures were a way of signalling support for an inquiry — not a vote \"for impeachment.\"", "To be sure, all of the Democrats cited by Sensenbrenner ultimately voted for both articles of impeachment, which now move to the U.S. Senate for trial.", "Ilya Somin, a law professor at George Mason University, said the fact that prior to the Ukraine call Democrats were thinking about impeachment doesn’t have any bearing on the validity of the current impeachment.", "\"People who supported impeaching him for his previous wrongdoing are not somehow debarred from doing so in the present case,\" Somin wrote in an email.", "Our rating", "Sensenbrenner said \"104 House Democrats voted for impeachment before the Ukraine call took place.\"", "His point was that some Democrats had previously made up their minds on whether Trump’s conduct in prior affairs, such as Comey’s firing, were grounds for impeachment.", "But reality gets in the way of the rhetoric. The votes were on motions to table, not the merits of the measures. There was no actual vote on impeachment until the one that ultimately passed.", "The definition of Mostly False is the statement contains an element of truth but ignores critical facts that would give a different impression.", "That fits here.", "Twitter, Jim Sensenbrenner account, Dec. 11, 2019", "Email exchange with Sarah Binder, professor at George Washington University, on Dec. 17, 2019", "Email exchange with Ilya Somin, professor at George Mason University, on Dec. 17, 2019", "Email exchange with Frank O. Bowman III, professor at the University of Missouri, on Dec. 17, 2019", "House roll-call vote 483, July 17, 2019", "House roll-call vote 35, Jan. 19, 2018", "House roll-call vote 658, Dec. 6, 2017", "House resolution 438, July 12, 2017", "House resolution 13, Jan. 3, 2019", "NPR, Impeachment timeline: From early calls to a full House vote, Dec. 17, 2019", "Washington Post, Rep. Rashida Tlaib profanely promised to impeach Trump. She’s not sorry, Jan. 4, 2019", "New York Times, Impeachment results: How Democrats and Republicans voted, Dec. 18, 2019", "New York Times, Document: Read the whistle-blower complaint, Sept. 26, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]