["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Connie Mack, R-Fort Myers, says he’s hardly the only politician to miss a bunch of votes while running for office. In fact, Democratic U.S. Sen. Bill Nelson -- had a year about two decades ago when he missed more than any other member of Congress, says Mack.\n\nMack has taken a beating in the press for missing votes while running statewide including on hot topics such as repealing part of \"Obamacare\" and on Rep. Paul Ryan’s budget plan. Mack campaign manager Jeff Cohen fired back at Tampa Bay Times political editor Adam C. Smith in a July 24 letter:\n\n\"What you didn’t mention is that when Bill Nelson was in Congress and running statewide for governor in 1990, he had the absolute worst voting record of anyone in Congress. He missed a whopping 56 percent of his votes.\"\n\nWe previously fact-checked a claim from Mack's Republican primary opponent, former U.S. Rep. Dave Weldon, that Mack missed \"almost half\" of his votes in Congress this year. We ruled that claim Mostly False because Mack didn't miss quite that many votes.\n\nWe’ll leave it to voters to decide the relevance of Nelson’s voting record from 22 years ago. Here, we wanted to see if the Mack campaign was accurate in its attack.\n\nMissed votes by Mack and Nelson in 2012 and full career\n\nBefore we travel back in time to 1990, let’s look at more recent data: the number of missed votes this year so far. GovTrack.us shows quarterly missed votes for members using voting information from the official websites of the U.S. House of Representatives and Senate -- and during a quarter the numbers can continuously change as more votes are taken. We will cite the numbers so far this year as of July 25 -- a day after the Mack campaign letter:\n\nNelson missed 1 vote out of 182, or less than 1 percent.\n\nMack missed 145 out of 502 votes, or about 29 percent.\n\nGovTrack.us also shows historical data between January 2001 and late July 2012. That shows that Nelson missed 2 percent of recorded votes while Mack, starting when he joined the Senate in 2005, missed 6 percent.\n\n Nelson’s missed votes in 1990\n\nIn 1990, Nelson was in the U.S. House of Representatives and faced an uphill battle in a Democratic primary for governor against Lawton Chiles, who ultimately won.\n\nWe turned to Congressional Quarterly for our research on missed votes. CQ shows that in 1990 Nelson voted 44 percent of the time, which means he missed 56 percent of the votes. A CQ ranking showed that placed him dead last that year.\n\nNelson’s office sent us a 1990 Associated Press article in which Nelson explained that on important missed votes he went on record about how he would have voted.\n\nNow let’s return to 2012.\n\nWe were unable to get an answer from Mack’s campaign or office if he issued statements explaining how he would have voted when he was absent. Campaign spokesman David James responded in an email: \"A missed vote for Connie is a missed vote -- according to you. Same standard for Nelson, irrelevant of statements.\"\n\nNelson’s one missed vote this year was to confirm the nomination of a federal judge in Illinois, which passed 86-1 on May 14.\n\nOne final note about Nelson’s voting record: In addition to 1990, CQ shows that he only dipped below 88 percent voting participation one other year. In 1985 he voted 73 percent of the time -- the year he was training for a January 1986 shuttle flight.\n\nOur ruling\n\nMack’s campaign manager said that in 1990, when Nelson was running for governor, he missed 56 percent of his votes -- the worst record in Congress. CQ data confirms that 22 years ago, Nelson missed 56 percent of his votes, placing him last in voter participation.\n\nIt is worth noting, however, that Nelson went on record with his position on some votes rather than simply skipping the vote.", "We rate this claim True.", "PolitiFact, \"Dave Weldon says Connie Mack missed \"almost half\" his votes in Congress this year,\"July 25, 2012\n\nPolitiFact, \"Fact-checking George LeMieux,\"  June 20, 2012\n\nTampa Bay Times The Buzz blog, \"Connie Mack campaign really dislikes Adam Smith,\"  July 24, 2012\n\nCQ Vote Studies, House and Senate service for Bill Nelson, 1979-1990 in House and 2001-2011 in Senate\n\nCQ  Vote Studies, House service for Connie Mack, 2005-2011\n\nCQ, Floor Votes by Sen. Bill Nelson (D-FL) in the past 12 months, July 25, 2012\n   \nCQ, Floor Votes by Rep. Connie Mack (R-Fort Myers) in the  past 12 months, July 25, 2012\n\nCQ Weekly, \"Voting participation: House chart,\" Dec. 22, 1990\n\nCQ Weekly, \"Voting participation: Despite election campaigning, members vote at record pace,\" Dec.  22, 1980\n\nCongressional Research Service report,  \"Pairing in Congressional voting: The House,\"Updated Feb. 2, 2007\n\nSen. Bill Nelson, Biography, Accessed July 25, 2012\n\nTampa Bay Times The Buzz blog,Weldon robocall rips Mack for missing votes, July 22, 2012\n\nTampa Bay Times The Buzz blog,\"Missed votes could be an issue for U.S. Rep. Mack as U.S. Sen. campaign heats up,\"Feb. 3, 2012\n\nTampa Bay Times The Buzz blog,\"Connie Mack competing with Charlie  Rangel for most missed votes,\"July 24,  2012\n\nTampa Bay Times, \"Senate primaries give voters few options,\"July 15, 2012\n\nNaples Daily News, \"Editorial: U.S. Senate scenario,\" July 25, 2012\n\nMiami Herald, \"Connie Mack disses Paul Ryan budget as ‘a joke,’\"April 4,  2012\n\nMiami Herald, \"Campaign pressures McCollum candidate: Senate run restricts voting in House,\" Accessed in Nexis, Oct. 16, 2000\n\nPolitico,\"Connie Mack skips out on big votes, hits trail instead,\"April 17, 2012\n\nGeorge LeMieux for U.S. Senate,Radio ad, March 14, 2012\n\nGovTrack.us, Missed votes for U.S. Rep. Connie Mack (R-Fort Myers), Accessed July 25, 2012\n\nGovTrack.us, Missed votes for U.S. Sen. Bill Nelson (D-Florida), Accessed July 25, 2012\n\nNew York Times Inside Congress,Top house vote missers, Accessed July 23, 2012\n\nInterview, Joshua Tauberer, president of Civic Impulse which created the GovTrack.us website, July 23, 2012\n\nInterview, David Meyers, CQ Roll Call, July 25, 2012\n\nInterview, David James, spokesman for Connie Mack’s campaign, July 25, 2012\n\nInterview, Dan McLaughlin, spokesman for U.S. Sen. Bill Nelson,  July 25, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]