["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Workers carry boxes at Oklahoma's Strategic National Stockpile warehouse in Oklahoma City, Tuesday, April 7, 2020. (AP)", "The director of the national stockpile described it as an $8 billion enterprise in November.", "While the stockpile had a lot of goods, it didn’t have all the needed supplies for the nationwide 2020 pandemic.", "Reports show that N95 masks were depleted as a result of H1N1 in 2009, and experts warned they should be replenished.", "Budget figures going back to 2009 show overall funding for the stockpile dropped to its lowest in 2013, to about $477 million. Allocations have grown steadily since then to a 2020 budget of $705 million.", "President Donald Trump has repeatedly claimed that the Obama administration left him with an empty national stockpile for emergencies.", "\"But they also gave us empty cupboards. The cupboard was bare. You’ve heard the expression, ‘the cupboard was bare.’ So we took over a stockpile with a cupboard that was bare,\" he said in an April 6 White House briefing. In previous briefings Trump described the stockpile as \"empty.\"", "Trump is exaggerating. While the COVID-19 pandemic has highlighted shortcomings in the nation’s stockpile of emergency supplies and equipment, Trump did not inherit bare inventory.", "It was full of supplies, but not enough to handle this particular pandemic. Most notably, the stockpile was short of N95 masks, the supply of which was depleted following the 2009 H1N1 outbreak during President Barack Obama’s tenure.", "RELATED: Fact-checking Jared Kushner’s comments on the national stockpile", "The Strategic National Stockpile was created in 1999 to prepare for chemical, radiological, biological or nuclear attacks. It expanded to respond to terrorism attacks, hurricanes, the H1N1 flu and ebola.", "While the locations of the stockpiles’ warehouses are secret, some reporters have been allowed inside, including journalists from the Washington Post in 2018. The Post wrote that there were \"hundreds of thousands of shrink-wrapped boxes of medicines\" and that if the medical countermeasures were laid flat they would cover more than 31 football fields.", "But Dara Alpert Lieberman, director of government relations for the nonprofit Trust for America’s Health, said that as large as the stockpile is, it’s always been lacking. \"The Strategic National Stockpile has never been funded at adequate levels to invest in new medical countermeasures, replenish expiring products, and purchase other needed medical supplies,\" she said.", "A 2017 Health and Human Services report showed $324.5 million in replenishment contracts, more than half of that money for anthrax response and only $7 million earmarked for influenza.", "In November, the director of the stockpile described it as an $8 billion enterprise. \"Even if the needed products are not currently held in house, stockpile experts have purchasing power to get what is needed to protect Americans,\" wrote Greg Burel, who retired in January.", "But two months later, it became clear that the stockpile didn’t have all the supplies needed for the current pandemic.", "One thing the stockpile clearly doesn’t have enough of is face masks. News reports found that the N95 face masks were not substantially replenished after H1N1 in 2009, the first year of the Obama administration.", "The Obama administration distributed 85 million N95 masks, 12.5 million regimens of antiviral drugs and 19.6 million pieces of personal protective equipment (PPE) for H1N1, also called swine flu.", "\"The 2009 H1N1 response was the largest known response of a national stock of drugs and medical material, and it was successful,\" Burel wrote in 2019.", "But experts warned after H1N1 that the supply of masks should have been replenished. Burel told Vice News in March that federal officials were left with \"horrible decisions\" about how to triage spending after H1N1.", "\"We had to trade off those funds that we had, and we chose to invest in those lifesaving drugs that would not be available from any other source, in the quantity needed, and in time,\" he said. \"I definitely want to see my health care workers protected; that's very important. But if I'm thinking, 'Do I buy this many masks to protect this many workers, or do I buy this many medicines to keep people safe that we can't get elsewhere?' There's no easy answer here.\"", "Burel told CBS News in March that the stockpile was \"very stressed.\"", "\"We didn't receive funds to replace those masks, protective gear and the antivirals that we used for H1N1,\" he said.", "ProPublica found that the budget battles during Obama’s tenure after the Republicans won the 2010 election hurt the stockpile’s budget.", "In early 2011, Obama’s administration released a budget request for $655 million for the stockpile, an increase of $59 million including to acquire new products. But Congress ultimately allocated $534 million for the 2012 fiscal year, a 10% cut from the prior year, ProPublica found.", "Across-the-board cuts hit the CDC, which managed the stockpile at the time.", "In its budget request for 2013, for example, the administration called for a cut of about $48 million to the stockpile. The stockpile \"is a key resource in maintaining public health preparedness and response; however, the current fiscal climate necessitates scaling back,\" the request stated.", "Budget figures going back to 2009 show overall funding for the stockpile dropped to its lowest in 2013, to about $477 million. Allocations have grown steadily since then to a 2020 budget of $705 million.", "Despite the Obama-era cuts, Ellen Carlin, a professor at Georgetown University’s Center for Global Health Science and Security, said it’s an exaggeration to state that the \"cupboard was bare.\"", "Appropriations to the stockpile during Obama’s presidency, when adjusting for inflation, went up a little, down a little, and then ended up about where they started.", "\"But those numbers don’t just reflect Obama’s requests. They also reflect congressional appropriations — under Congresses that at times were partially controlled by Republicans,\" she said.", "It’s difficult to determine what budget cuts meant for PPE since federal officials closely hold the details of the inventory, she said.", "While the Trump administration points the finger at Obama, Democrats have pointed the finger back at Trump, who also could have taken steps to replenish the stockpile before the current pandemic.", "But because of the shared executive branch-legislative branch responsibility, Carlin said, \"almost everything about COVID-19 reflects a bipartisan failure across two branches of government.\"", "The Associated Press reviewed federal purchasing contracts and found \"federal agencies largely waited until mid-March (of this year) to begin placing bulk orders of N95 respirator masks, mechanical ventilators and other equipment needed by front-line health care workers.\" While HHS said early in the pandemic that the stockpile had 13 million masks, that was only a fraction of what hospitals needed, the AP found.", "Masks are not the only items that federal officials sought to obtain more of for the stockpile in past years. The New York Times reported on efforts that began 13 years ago — before the Obama administration —  to buy more ventilators. That effort stalled when the company that the federal government secured to design new ventilators didn’t come through, leaving the government to start over with a new company in 2014.", "Trump said the Obama administration left him with a \"stockpile with a cupboard that was bare.\"", "In one specific way, he has a point: N95 masks were depleted after the H1N1 outbreak in 2009, and experts warned years ago that the supply should have been replenished.", "However, Trump made a sweeping generalization and exaggerated when he described the stockpile as a bare cupboard. The former director of the stockpile, just a couple of months before COVID-19 cases appeared in the U.S., described it as an $8 billion enterprise, with extensive holdings of many needed items.", "We rate this statement Mostly False.", "Rev.com, Transcript of White House briefing, April 6, 2020", "White House Briefing, April 3, 2020", "White House Briefing, March 26, 2020", "Greg Burel, Evolving the Scope of the Strategic National Stockpile, November 2019", "U.S. Department of Health and Human Services,  Public Health Emergency Medical Countermeasures Enterprise (PHEMCE) Strategy and Implementation Plan, 2017-18", "Factcheck.org, Trump Falsely Claims He Inherited ‘Empty’ Stockpile, April 3, 2020", "USA Today, Fact check: Did the Obama administration deplete the federal stockpile of N95 masks? April 3, 2020", "ProPublica, How Tea Party Budget Battles Left the National Emergency Medical Stockpile Unprepared for Coronavirus, April 3, 2020", "AP, US ‘wasted’ months before preparing for coronavirus pandemic, April 6, 2020", "ASTHO, Assessing policy barriers to effective public health response in the H1N! Influenza pandemic, June 2010", "U.S. Department of Health and Human Services, Budget document, Feb. 11, 2011", "VICE News, The U.S. Has a Classified Stockpile of Ventilators and Masks, But It Won’t Save Us From Coronavirus, March 17, 2020", "CBS News, Largest U.S. stockpile of medical supplies is \"very stressed,\" former director says, March 30, 2020", "National Academies, The Nation's Medical Countermeasure Stockpile: Opportunities to Improve the Efficiency, Effectiveness, and Sustainability of the CDC Strategic National Stockpile: Workshop Summary, Oct. 24, 2016", "Washington Post, Inside the secret U.S. stockpile meant to save us all in a bioterror attack, April 24, 2018", "Washington Post, Face masks in national stockpile have not been substantially replenished since 2009, March 10, 2020", "New York Times, The U.S. Tried to Build a New Fleet of Ventilators. The Mission Failed. March 29, 2020", "Emergent BioSolutions, Press release, July 30, 2019", "Bloomberg, Hospital Workers Make Masks From Office Supplies Amid U.S. Shortage, March 17, 2020", "Los Angeles Times, A disaster foretold: Shortages of ventilators and other medical supplies have long been warned about, March 20, 2020", "PolitiFact, Barack Obama says Congress owns sequestration cuts, Oct. 24, 2012", "PolitiFact, Federal pandemic money fell for years. Trump’s budgets didn’t help, March 30, 2020", "PolitiFact, Fact-checking Jared Kushner’s comments on the national stockpile, April 3, 2020", "Email interview, Ellen Carlin, a professor at the Georgetown University’s Center for Global Health Science and Security, April 7, 2020", "Email interview, Ned Price, Obama administration National Security Council spokesman, April 7, 2020", "Email interview, Dara Alpert Lieberman, director of government relations for the nonprofit Trust for America’s Health, April 7, 2020", "U.S. Department of Health and Human Services, Centers for Disease Control and Prevention Fiscal Year 2018 Justification of Estimates for Appropriation Committees, accessed April 8, 2020", "U.S. Department of Health and Human Services, Assistant Secretary for Preparedness and Response Budget and Funding, accessed April 8, 2020", "Email interview, Stephanie M. Bialek, Stockpile Communication Services Section chief at the Division of Strategic National Stockpile in the HHS Office of the Assistant Secretary for Preparedness and Response, April 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]