["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Members of the U.S. House voted Tuesday to fund the Department of Homeland Security through September. The vote was a blow to a GOP-led threat to strike back at President Barack Obama for his executive action on immigration.", "All 10 Georgia Republicans voted \"No\" on the funding bill, which passed 257 to 167.", "Some Republicans wanted to add provisions to the bill to gut the legal protections that the president, by executive order, called to provide to as many as five million illegal immigrants.", "But after threat of a partial agency shutdown created a backlash, House Speaker John Boehner and the majority quietly capitulated Tuesday. They passed a ''clean'' funding bill with no immigration provisions.", "U.S. Rep. Doug Collins, R-Gainesville, was among those who voiced frustration.", "\"It’s not what I would like to see,\" Collins said.", "Why, Collins asked, was the president willing to jeopardize funding for the Department of Homeland Security for \"a proposal that frankly he himself has said 22 times he couldn’t do?\"", "Sound familiar?", "It’s a claim PolitiFact has checked more than once and one that Republicans have repeated multiple times. The 22 citations were included in a blog posted by Boehner’s office in November and shared with us this week by Brendan Thomas, Collins’ spokesman.", "On Nov. 20, Obama announced he would delay deportations of illegal immigrants who have lived in the country more than five years, have children who are citizens or who have green cards. This would allow more than 4 million people to qualify for work permits and avoid deportation for three years, provided they each pass a background check and pay a fee.", "The president’s decision, which the GOP has denounced as an abuse of power, is on hold based on a temporary injunction from a federal judge in Texas.", "Our PolitiFact Texas colleagues checked the list for claims by politicians from that state.", "All of the citations in Boehner’s post were compared by PolitiFact Texas to transcripts and news stories. The majority of the examples are of Obama saying he did not have power to do more on immigration without Congress. Others, as we’ll explain in a moment, say something more nuanced or aren’t specific to immigration.", "We won’t go through every quote that supports Boehner’s point here, but here are a few we culled from a document created by PolitiFact Texas:", "In September 2012, Obama was asked if he would follow up his recent protective move for students by doing something similar for non-criminal immigrants such as the parents of U.S.-born children. Obama replied that \"as the head of the executive branch, there’s a limit to what I can do… we’re still going to, ultimately, have to change the laws in order to avoid some of the heartbreaking stories that you see coming up occasionally,\" as in parents deported. (No. 13 on Boehner’s list.)", "At a presidential debate in October 2012, Obama and Mitt Romney were asked: \"What do you plan on doing with immigrants without their green card that are currently living here as productive members of society?\" Obama said: \"I've done everything that I can on my own.\" (No. 14 on Boehner’s list.)", "In a January 2013 Telemundo interview, Obama was asked why he couldn’t protect mothers living here without authorization from deportation as he had served law-abiding students. \"I’m not a king,\" Obama replied, akin to his response the same month to a similar query from Univision. \"You know, my job as the head of the executive branch ultimately is to carry out the law. And-- you know, when it comes to enforcement of our immigration laws-- we’ve got some discretion. We can prioritize-- what we do. But we can’t simply ignore the law.\" (No. 16 on Boehner’s list.)", "So clearly there are examples of Obama saying he couldn’t do more with executive action, then later doing exactly that. That’s why PolitiFact previously rated Obama’s claim that \"my position hasn’t changed\" as False.", "What should not be counted", "Also included on the list of 22 are quotes where Obama was either suggesting his executive powers did not have hard limits or was silent on his executive power on immigration. Here are a few problems with quotes included on Boehner’s list.", "In two instances during his 2008 presidential campaign, Obama criticized \"signing statements\" used by President George W. Bush that interpret laws, but he did not bring up immigration. Immigration was also not part of his reply to a question at a 2010 MTV/BET event when he said, \"I can’t simply ignore laws that are out there,\" in response to a question about \"don’t ask, don’t tell.\"  (Nos. 1, 2 and 5.)", "In September 2011, with his deferred-action plan on the horizon, Obama reiterated that he cannot just change laws unilaterally in response to a question about possible administrative relief for students who don’t have legal residency. But he hinted that there might be room within his authority, saying, \"what we can do is to prioritize enforcement, since there are limited enforcement resources.\" (No. 12 on Boehner’s list.)", "Stephen W. Yale-Loehr, a New York immigration attorney, reviewed the GOP citations for PolitiFact Georgia and concluded a number referred to \"deferred action,’ which, he said, ‘is not changing the law.", "\"It is simply prioritizing who should be targeted for deportation, for example serious criminals,\" he said.  \"... most legal scholars believe that these executive actions fall within the limits; they do not exceed them.\"", "Kennesaw State University political science chair Kerwin Swint said the 22 statements \"do indicate the president felt, at the time, that immigration authority should go through Congress.", "‘But, funny how circumstances change change one's principles,\" Swint said. ‘When his party lost control of the Senate in 2014, he felt like he had no other choice but to use executive authority.\"", "Our ruling", "Collins  said this: President Obama said \"22 times\" he could not authorize immigration reform by executive order.", "Obama did say that more than a dozen times. Other times it was something more nuanced or not specific to immigration.", "The broader point -- that Obama said one thing about executive action but did another -- is accurate.", "We rate Collins’ statement as Mostly True.", "Email with Brendan Thomas, spokeamn for Congressman Doug Collins, R-Gainesville", "Email with Kerwin Swint, professor and chair, Department of Political Science & International Affairs\nKennesaw State University", "Email with Stephen W. Yale-Loehr, Miller Mayer, LLP\nAlso Adjunct Professor, Cornell Law School and co-author, Immigration Law & Procedure Treatise", "Blog post, \"22 Times President Obama Said He Couldn’t Ignore or Create His Own Immigration Law,\" House Speaker John Boehner, Nov. 19, 2014", "PolitiFact Texas, \"Michael McCaul says Obama said 'over 20 times' he lacked authority to act alone on immigration,\" Dec. 5, 2014", "PolitiFact Texas, \"Greg Abbott says 22 times Barack Obama said he couldn't shield immigrants, then said 'I changed law',\" Feb. 23, 2015", "PolitiFact, \"Boehner: Obama said '22 times' that he couldn't do immigration executive action,\" March 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]