["The claim was published on Facebook here on March 10, 2021.", "The post features a text graphic that reads: “80% of Australian navy members who took the vaccine recently have experienced severe side effects the other 20% are mild. They are down about 50% of their members from healthy men and women it’s a bit concerning…”", "The post’s caption reads: “Just received this testimony from a wife of an Australian Navy member.", "I have also verified myself that the gentlemen is fact a member of the Australian Navy, which most likely substantiates this statement. Now you decide…”", "Similar claims were also shared on Facebook here and here and on Instagram here.", "The claim, however, is false.", "In a statement published here on March 17, 2021, the Australian Department of Defence directly refuted the claim, calling it “incorrect social media commentary”.", "The statement explains how some members of HMAS Sydney who were vaccinated did experience “mild side effect symptoms that did not require medical care.”", "“All symptoms experienced were within the broad range of routine side effects associated with receiving any vaccination,” the statement adds.", "The statement explicitly notes that the claims about members experience severe side effects and that 80 percent of members were affected are “not true.”", "The Therapeutic Goods Administration (TGA), Australia’s medical regulatory body which tracks Covid-19 side effects, also noted in its most recent weekly report that “no new safety concerns have been identified.”", "The report, published on March 17, 2021, added that “Safety data collected on the COVID-19 vaccines used in Australia is consistent with the known side effects” and that “side effects, if they occur, are usually mild and temporary.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]