["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "A photograph of a group of people in white hoods standing next to pickup trucks has gone viral, leading to rumors that the Ku Klux Klan -- known for their signature garb -- gathered in Mississippi in late May 2020 on the heels of unrest in Minneapolis after the death of a black man while in police custody. The group, which has existed in various forms in the United States since 1865, is known for its long history of organized violence and campaigns against black people, including cross burnings, lynchings, and marches.", "As protests continued around the United States in response to the May 25 death of George Floyd, who was handcuffed and pinned to the ground for several minutes by a white Minneapolis police officer, this image spread across social media:", "But this photograph is not from May 2020, nor was it taken in Mississippi. This photograph initially went viral in early February, at which time social media users were claiming it depicted a gathering of the KKK in Caroline County, Maryland.", "A reporter from the Maryland newspaper The Star Democrat spoke to police there in February to confirm it was a hoax. Michael McDermott, police chief of Federalsburg, a town in Caroline County, agreed with their findings, adding that \"Maybe whoever is responsible for this is just trying to stir up trouble.\"", "Before making its way to Facebook, the photo reportedly originated on Snapchat:", "... McDermott said the picture was also posted on the Federalsburg Police Department Facebook page with the poster making disparaging comments about the town.", "The post circulated first on SnapChat before making its way across Facebook. Police do not believe the photo was taken in Federalsburg or in Caroline County or even anywhere near the area. But, after being screenshot multiple times, a caption had been added across the picture making reference to “burg” or Federalsburg and with the additional caption, “We from the south of the county our #1 enemy them racist...white people.”", "The actual origins of the photograph are undetermined. Snopes has reached out to the chief of police in Federalsburg to learn more, and we will update this story with more information as it becomes available.", "Here's what we do know: This photograph does not show a KKK gathering in Mississippi in May 2020, and, according to Maryland police, the claim that such a gathering occurred in or around Caroline County was a hoax. We are unable to determine the actual origins and location of the picture, leading to the rating of \"Miscaptioned.\"", "History.com.   \"Ku Klux Klan.\"\r\n   21 February 2020.", "Marshall, Phil.   \"KKK photo a hoax, police say.\"\r\n   The Star Democrat.   12 February 2020.", "The New York Times.   \"Protests Continue to Rage After Death of George Floyd.\"\r\n   28 May 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]