["“We will totally ban Beef in Goa, North-East & South India, if BJP comes to power. Manohar Parrikar died of cancer because he allowed the consumption of beef in Goa.”", "The above statement has been attributed to controversial BJP candidate, Sadhvi Pragya Thakur. Thakur has been in the eye of the storm after the BJP fielded the terror accused from Bhopal for the Lok Sabha election. Following her nomination, Pragya Thakur has been making news through a slew of controversial statements. Now, she has purportedly said that former Defence minister and Goa CM Manohar Parrikar died of cancer because he allowed beef consumption in the state. She has also supposedly said that her party will ban beef in Goa, Northeast and South India.", "The above tweet by a handle, @DigitalAtheist_ has been retweeted over 460 times since it was posted in the morning of April 29. It has now been deleted. It has been quote-tweeted by journalist Swati Chaturvedi, whose tweet has in turn been retweeted over 430 times.", "Chaturvedi later tweeted a clarification.", "Am deleting this after Vivek has pointed this out https://t.co/TUSuZSzKCJ", "— Swati Chaturvedi (@bainjal) April 29, 2019", "On Facebook, the same was posted by a page News Today Channel on April 27.", "We will totally ban Beef in Goa, North-East & South India, if BJP comes to power. Manohar Parrikar died of cancer…", "Posted by News Today Channel on Saturday, April 27, 2019", "Alt News did not come across a single credible news article which had reported this statement supposedly made by Sadhvi Pragya Thakur. The source of the statement in question, wherein Sadhvi Pragya speaks ill of Manohar Parrikar, is a website called IndiaScoops.", "A report published on the website on April 26, 2019 had mentioned,", "“Hitting out at former CM the late Manohar Parrikar for his soft stance on the consumption and sale of beef in Goa, Pragya Thakur said that Parrikar died of cancer because he allowed the consumption of beef in Goa.”", "IndiaScoops is a website which came under the scanner in June last year, when it published a fake report that Rs. 35 lakh had been spent by the PMO for PM Modi’s photo and video shoot on International Yoga Day on June 21.", "In another instance, IndiaScoops had published an article in the midst of the Rafale controversy, when it had ‘reported’ that “the entire technical staff team at Dassault Aviation were unhappy with the move to drop the Indian PSU Hindustan Aeronautics Ltd(HAL) and go ahead with Reliance Defence Ltd.” This too was a figment of imagination. Alt News had found that IndiaScoops is run by a person named Flynn Remedios, who also operates IndiaScribes, IndiaWyre and other such websites which mostly deal with gossip and fake news. Alt News’ article can be read here.", "In conclusion, Sadhvi Pragya Thakur has not made any such statement saying that the BJP will ban beef in Goa, Northeast and South India; nor has she said that Manohar Parrikar died of cancer because he did not disallow beef consumption in his state.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]