["By D'Angelo Gore", "Posted on September 26, 2017", "Republican gubernatorial candidate Ed Gillespie is airing a misleading TV ad in Virginia that says Democrat Ralph Northam was the “deciding vote” in “favor of sanctuary cities that let dangerous illegal immigrants back on the streets.”", "It’s true that Northam, as the state’s lieutenant governor, cast a tie-breaking vote against a Republican-sponsored bill banning the establishment of so-called sanctuary cities. But the ad doesn’t tell the whole story of the bill, which ultimately passed the Senate despite Northam’s “deciding vote.”", "It also ignores the fact that Gillespie himself has said the state doesn’t have sanctuary cities — the very thing that the bill was designed to stop.", "Gillespie, a former Republican National Committee chairman, is running against Northam in the race to succeed Democrat Terry McAuliffe as governor of Virginia.", "The ad, titled “Safer Communities,” was released on Sept. 20.", "“MS-13 is a menace, yet Ralph Northam voted in favor of sanctuary cities that let dangerous illegal immigrants back on the street, increasing the threat of MS-13,” a narrator says, referring to a criminal gang in Virginia and other states. A graphic shown on screen says Northam’s was the “deciding vote in favor of sanctuary cities.”", "This isn’t the first time the Gillespie campaign referenced Northam’s vote.", "On Aug. 30, the campaign released its first ad claiming that Northam “cast the deciding vote in favor of sanctuary cities that let illegal immigrants who commit crimes back on the street.” A day later, the Northam campaign responded with a TV ad saying that Gillespie’s attack ad was “not true.”", "It’s true, however, that Northam voted against the bill in question. But his was hardly the final say in the matter.", "The ads from Gillespie’s campaign refer to HB 2000, which was introduced by Republican state Del. Charles Poindexter in January. The one-sentence bill states: “No locality shall adopt any ordinance, procedure, or policy that restricts the enforcement of federal immigration laws.”", "As lieutenant governor, Northam only votes in the case of a tie in the state Senate. That happened when Thomas Norment, the Republican majority leader, voted with Democrats against the bill, causing a 20-20 split. (Republicans have a 21-19 majority.)", "After Northam’s subsequent “nay” vote momentarily killed the bill, Norment moved to hold another vote. The bill proceeded to pass when Norment switched sides and voted with his fellow Republicans. The bill, which also passed in the House of Delegates, was later vetoed by McAuliffe, the Democratic governor.", "Northam’s team accused Norment of plotting to force the lieutenant governor to make a vote that would later become irrelevant.", "“Norment declined to comment, and later grinned as a reporter tried to coax out information on whether the Senate majority leader was colluding with the Gillespie campaign to set up the lieutenant governor,” according to the Richmond Times-Dispatch.", "But all of that information would not be clear to viewers of the ads. It was McAuliffe, not Northam, who stopped the bill outlawing sanctuary policies from becoming law. Northam and other Democrats voted against the bill because, they said, it was unnecessary.", "“The fact is, Ed Gillespie and Richmond Republicans know there are no sanctuary cities in Virginia,” Northam said about attacks on his vote, according to the Times-Dispatch.", "As Virginia Public Radio wrote in late August: “People define sanctuary cities a variety of ways. If the definition is a city that defies immigration law, then Virginia has no sanctuary cities. If the definition is that a city refuses to detain some immigrants until federal officials can pick them up, Virginia has several of those. But they’re not violating any law by refusing to hold suspects without a warrant.”", "Indeed, in a 2015 opinion, Virginia Attorney General Mark Herring, a Democrat, wrote that state law enforcement officials were not required by law to honor requests from U.S. Immigration and Customs Enforcement to detain, longer than necessary, any immigrants federal authorities believe to be in the U.S. illegally.", "“It is my opinion that an ICE detainer is merely a request,” Herring wrote. “It does not create for a law enforcement agency either an obligation or legal authority to maintain custody of a prisoner who is otherwise eligible for immediate release from local or state custody. For that reason, an adult inmate or a juvenile inmate with a fixed release date should be released from custody on that date notwithstanding the agency’s receipt of an ICE detainer.”", "Even Gillespie has said that Virginia doesn’t actually have sanctuary cities.", "“I agree we don’t have any,” Gillespie said when talking about immigration at a Virginia Bar Association debate with Northam in July. That was after Gillespie said he doesn’t “believe that cities or counties should be free to pick and choose, you know, what [federal immigration] laws they enforce, and declare themselves a sanctuary city.”", "Gillespie has said that, if he were governor, he would have signed HB 2000.", "That said, his ads give the impression that Northam’s vote was the final word on a bill to prevent Virginia localities from adopting sanctuary policies that Gillespie has said they don’t currently have.", "In fact, Northam wasn’t able to keep the bill from passing, and he would have never been able to vote had Norment, the Republican leader, supported the bill on the first vote.", "In the end, it was McAuliffe, the Democratic governor, who vetoed the bill, and Republicans didn’t have enough votes to overturn his decision.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]