["This video has been viewed hundreds of thousands of times since it was posted on July 25, 2019, to a Facebook group with more than 260,000 followers.", "Below is a screenshot of the post:", "The title of the lengthy Chinese-language post translates as: “A ‘Lennon Wall’ erected by Hong Kong students in Australia has caused controversy. Local police arrested a masked protester.", "It continues, in part: “Scuffles broke out and a heated row in Cantonese and Mandarin erupted between the two groups. Campus security and local police were notified.", "“A masked protester was arrested as wearing face masks in protests is illegal in Australia.\"", "The University of Queensland (UQ) is located in the city of Brisbane, in the state of Queensland.", "The ‘Lennon Wall’ refers to a display of pro-democracy messages in the form of colourful sticky-notes that have sprung up across Hong Kong, as explained in this July 2019 AFP report.", "The text embedded on the video repeats the information in the post, then adds, at the bottom:", "A. You should know the international rules and standards for policing. A mask doesn’t imply immunity", "B. Don’t embarrass Hong Kong", "C. Australian police won’t go easy on you", "D. The outside world isn’t your playground", "Hong Kong has been hit by two months of protests, triggered by a controversial bill that would have allowed extraditions to mainland China, which have evolved into a call for wider democratic reforms and a halt to sliding freedoms. Here is an AFP report on the situation.", "There was a campus protest on July 24, 2019 over Hong Kong which led to clashes at the University of Queensland, according to this AFP report.", "But the claim that a protestor was arrested for wearing a facemask is false; the footage showing an arrest was actually filmed at an unrelated protest in Berkeley, California, in April 2017; Queensland police said they had not made any arrests during the July 24, 2019 protest; it is not illegal to wear a facemask at a protest in Queensland, authorities told AFP.", "The misleading Facebook video is made up of two separate clips, filmed in different times and places -- the first, from the start to the 38 second mark, shows scuffles that occurred at the University of Queensland on July 24, 2019.", "It can be found here on Twitter, posted the day the scuffles broke out on July 24, 2019 -- and was partially reproduced by the ABC, Australia’s public broadcaster, here a day later.", "Footage of the same incident was posted by user “Australia-Hong Kong link” here on Facebook also on July 24.", "The second clip, from the 00:39 to 1:41 mark, shows the alleged arrest of a masked protester.", "It has been viewed tens of thousands of times here on Facebook and here and here on YouTube alongside an identical claim.", "However, this clip was actually filmed during a rally in the northern Californian city of Berkeley in April 2017.", "A reverse image search on Google led to the same video in much higher quality uploaded here to YouTube on April 27, 2017.", "The video, entitled “Police Remove Antifa power at Berkeley by forcing them to remove masks or go to jail”, has been viewed more than 860,000 times.", "Antifa is an abbreviation for anti-fascist, according to US anti-hate organisation ADL.", "A uniformed officer wearing a University of California Police Department (UCPD) arm badge can be seen on the left-hand side in the video.", "The badge is identical to this one seen in photographs of police officers posted by UCPD, Berkeley, on Facebook.", "Below is a screenshot comparison of the video in the misleading post (L) and the 2017 YouTube video (R):", "AFP photos of the April 27, 2017 protest in Berkeley can be seen here and here on AFP's Image Forum website.", "The caption of the first AFP photo states: “A man is arrested during a conservative rally in Berkeley, California on April 27, 2017. Conservative firebrand Ann Coulter on April 26, 2017 canceled a planned appearance at the University of California, Berkeley, saying she had lost the backing of the groups that had sponsored her talk. The right-wing commentator had insisted she would show up at Berkeley, a famously progressive campus, on Thursday even though the university said it could not provide a suitable venue because of security threats. But Coulter said she was forced to reconsider her decision after the conservative Young America's Foundation and the Berkeley College Republicans, which had sponsored her talk, backed out, accusing the university of creating a 'hostile atmosphere.'\"", "Berkeley Police Department said in an advisory released on April 27 that at least two arrests were made during the rally.", "Following the on-campus clashes between Hong Kong and mainland Chinese students on July 24, 2019, UQ released this statement addressing the incident.", "The statement reads, in part: “The University has zero tolerance for violence and intimidation, which is why on 24 July our security staff at the St Lucia campus asked for police assistance to disperse protestors.", "“An investigation commenced last week into the circumstances that led to the unacceptable actions by a small number of individuals against our students and staff at the 24 July protest. We have offered support to students and staff who were affected.”", "Queensland Police confirmed with AFP in an email dated July 30, 2019: “We can confirm there were no arrests during the incident.", "“It’s not illegal to cover your face during a protest in Queensland.”", "“It’s not illegal to cover your face during a protest in Queensland.”", "In an email to AFP on July 30, the office of Queensland’s Attorney-General and Minister of Justice Yvette D'Ath states: “If the claim is that it is illegal to wear a mask during a protest in Queensland, then that is not correct. There’s no legislation to that effect.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]