["About this rating", "In June 2018, a number of genuine photographs showing children who have been forcibly separated from their families at the border of the United States and Mexico stirred up considerable outrage online. As these images made their way around the Internet, a few fakes were slipped into the mix.", "For example, the following image was shared as if it showed a Border Patrol agent acting on orders to forcibly separate an immigrant child from his family in 2018:", "This is actually an infamous Pulitzer Prize-winning photograph that was captured on 22 April 2000, nearly two decades earlier, by the Associated Press's Alan Diaz:", "Cuban refugee Elian Gonzalez and Donato Dalrymple, one of the two men who rescued the boy from the sea, in a bedroom closet as federal agents enter the Little Havana home of Elian's relatives. (Alan Diaz, April 22, 2000)", "Elián González was five years old in November 1999, when he was found three miles off the coast of Ft. Lauderdale, Florida by a group of fishermen. His mother had drowned with eleven other people while trying to cross the ocean to the United States from Cuba to seek political asylum, and Elián was placed into the custody of his uncle, Lazaro González, in Miami.", "That was just the beginning of the Elián González saga. Over the next few weeks, an international crisis unfolded as the little boy's family, Cuban officials, and legislators in the United States argued over his fate. This photograph shows the dramatic moment that federal agents seized Elián González from his Miami relatives at gunpoint in order to return the child to his father in Cuba.", "CBS revisited the saga in a April 2016 article:", "The raid started at 5:15 a.m. on a small Miami street on the morning of April 22, 2000. By 5:18 a.m., it was over.", "Elian Gonzalez was removed from the home of relatives to be reunited with his father, and a chapter of the family's bitter custody battle was closed.", "The custody fight came to a dramatic head on that April morning, with Elian being whisked away in the arms of a Spanish-speaking federal agent assigned to the case to provide the child comfort.", "[...]", "By the end of the day, Elian was back with his father under military guard at a U.S. Air Force base near Washington. His relatives also flew to Washington to fight for him to stay Miami, but when it was all said and done Elian returned to Cuba with his dad in June of 2000.", "The photograph has nothing to do with Donald Trump or the 2018 crisis at the border of the United States and Mexico perpetuated by his administration. Although this image truly does show a federal agent separating a child from family members (the man in the photograph is actually not a relation), Elián González was then reunited with other members of his family. He is now an adult.", "Adams, Cydney.   \"April 22, 2000: Elian Gonzalez Raid Transfixes the Nation.\"\r\n    CBS News.   Retrieved 22 April 2016 2018.", "PBS.   \"A Chronology of the Elian Gonzalez Saga.\"\r\n    Retrieved 21 June 2018.", "Bragg, Rick.   \"The Elian Gonzalez Case: The Overview; Cuban Boy Seized by U.S. Agents and Reunited with His Father.\"\r\n    New York Times.   23 April 2000.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]