["“Boy oh boy, there finding thrown away Trump ballets everywhere now, California, Texas, n Pennsylvania. How does the USPO explain this??” reads the misspelled September 27, 2020 tweet with the image.", "The tweet was later removed for violating Twitter rules.", "More versions of the claim are available on Twitter here and here.", "A reverse image search for the picture shows it appeared at least as early as September 30, 2018, when it was posted by a Facebook user with the caption: “If your looking for your mail it maybe on river road by 36st station...share this post ppl information is out on the street”. The post was tagged in Pennsauken, New Jersey.", "Trump was not on the ballot in 2018, when midterm elections for Congress took place. US presidents face voters every four years.", "Newsweek -- along with several other news sources --  published the photo in 2018 and reported that bins of mail were dumped in New Jersey by a Postal Service employee who quit and abandoned the mail.", "United States Postal Service Office of Inspector General spokeswoman Agapi Doulaveris confirmed over the phone that the mail in the photo was later delivered to the proper recipients.", "“I cannot say if there are any ballots… I don’t know the mail mix specifically,” Doulaveris said.", "“All I can say is the mail was delivered.”", "Mail dumping is not a regular issue in the Postal Service, Doulaveris said. USPS has hundreds of thousands of employees, and “the majority are trustworthy and honest. But if we hear about this, it’s our duty to look into any type of dumping.”", "As the presidential election approaches and tens of millions of voters opt for mail-in ballots as a safer alternative to in-person voting during the coronavirus pandemic, USPS has been plagued by online misinformation -- much of it driven by Trump himself.", "Trailing in polls, the president has repeatedly claimed mail-in voting carries a major risk of fraud. Officials and experts dispute this.", "AFP Fact Check has debunked other false and misleading claims about the US Postal Service and mail-in voting here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]