["About this rating", "A 2013 study published in Pain Medicine studied the hands of 24 female patients and discovered an excess number of specific nerves surrounding a specific kind of blood vessel, hinting at a possible physical and identifiable cause for the disease.", "The study is no longer new, despite its having been billed as such for the past five years, nor has it changed the prevailing scientific view about the disease, which most argue is caused by an heightened sensitization of the nervous system.", "Since at least June 2013, a nearly identical article has appeared on a number of websites with the headline “Fibromyalgia Mystery Finally Solved!” These stories, which continue to appear online, begin with the same claim:", "Researchers have found the main source of pain in Fibromyalgia patients, and contrary to what many believe, it does not stem from the brain. The findings mark the end of a decades-old mystery about the disease, which many doctors believed was conjured in patients’ imaginations. [...]", "Up until recently, many physicians thought that the disease was “imaginary” or psychological, but scientists have now revealed that the main source of pain stems from a most unlikely place — excess blood vessels in the hand, legs and foot.", "Fibromyalgia is is an enigmatic condition that disproportionately affects women; it is associated with clinically unexplained pain, potentially combined with other symptoms of unknown medical origin. As reported in a 2014 review paper in the Journal of the American Medical Association:", "Fibromyalgia may be considered as a discrete diagnosis or as a constellation of symptoms characterized by central nervous system pain amplification with concomitant fatigue, memory problems, and sleep and mood disturbances.", "Before diving into the research claims made in this \"fibromyalgia solved\" brand of clickbait, it is important to mention that framing the issue as a debate between those who think the pain is \"imaginary\" and those who think it is \"real\" is an extremely reductive description of the medical hypotheses surrounding fibromyalgia, and, indeed, of pain itself.", "The most common explanation for the symptoms that present as fibromyalgia in the scientific literature is a phenomenon dubbed \"central sensitization\", in which the central nervous system (either through physical trauma or another cause) lowers its threshold for registering external signals as pain. As described in a 2009 review:", "Instead [of being caused by an external factor], central sensitization represents an abnormal state of responsiveness or increased gain of the nociceptive system [the part of the sensory nervous system that sends pain signals]. The pain is effectively generated as a consequence of changes within the [central nervous system] that then alter how it responds to sensory inputs, rather than reflecting the presence of [a physical source of pain].", "While central sensitization may not have an external source, the pain is no more \"real\" or \"imaginary\" than any other pain caused by an actual physical stimulus.", "The study referenced in the viral stories, published in 2013 in the journal Pain Medicine, makes an argument for a physical, detectable source of the condition. The study focused on a specific kind of blood vessel in the hand — arteriole venule shunts — that can direct blood flow to bypass the hands in response to temperature, as described in a 2013 press release from the University of Albany, where the research was conducted:", "In humans, these types of shunts are unique to the palms of our hands and soles of our feet which work like the radiator in a car. Under warm conditions, the shunts close down to force blood into the capillaries at the surface of the skin in order to radiate heat from the body, and our hands get sweaty. Under cold conditions, the shunts open wide allowing blood to bypass the capillaries in order to conserve heat, and our hands get cold and put on gloves.", "The researchers, who were also associated with a biotech company (INTiDYN) that developed the imaging technique used in the study, analyzed biopsies from 24 female patients with fibromyalgia and compared them to a number of healthy control subjects. The authors found that there was a significant excess number of nerves around these shunts in the fibromyalgia patient’s hands. The senior author on the paper, Frank Rice, explained the potential significance of the findings in their press release:", "\"Instead of being in the brain, the pathology consists of excessive sensory nerve fibers around specialized blood vessel structures located in the palms of the hands,\" said Dr. Rice, President of Intidyn and the senior researcher on the study. \"This discovery provides concrete evidence of a fibromyalgia-specific pathology which can now be used for diagnosing the disease, and as a novel starting point for developing more effective therapeutics.\"", "Outside of providing an explanation for fibromyalgia pain, the authors suggest this mechanism could also relate to other symptoms commonly associated with the condition:", "In human and nonhuman primates, the [hair-free skin found on the hands and feet] plays a major role in thermoregulation and the maintenance of core body temperature as well as the apportionment of blood to other organs such as skeletal muscle during periods of high metabolic demand.", "Therefore, [an excess of nerves near arteriole venule shunts in the hair free skin on the hands of fibromyalgia] patients may contribute to extreme tenderness and pain in the hands, but may also contribute to the chronic widespread deep pain, fatigue, sleep disturbances, and cognitive dysfunction associated with [fibromyalgia].", "While the study is real, it was limited in its scope due to its low sample size. Further, it does not appear to have shifted the debate away from hypotheses that revolve primarily around central sensitization, despite claims that the mystery had been \"solved\". A 2015 review on the condition released by the Mayo Clinic describes the state of the field:", "Earlier there was some doubt about whether there was an “organic basis” for these related conditions, but today there is irrefutable evidence from brain imaging and other techniques that this condition has strong biological underpinnings, even though psychological, social, and behavioral factors clearly play prominent roles in some patients. The pathophysiological hallmark is a sensitized or hyperactive central nervous system that leads to an increased volume control or gain on pain and sensory processing.", "While the study is real and their specific results are not in question, it was neither new as of 2017, nor did it substantively change the debate on the cause of fibromyalgia, much less \"solve the mystery\". As such, we rank the claim as mostly false.", "Savasito, Rebecca.   \"Fibromyalgia Mystery Finally Solved!\"\r\n    Liberty Voice.   20 June 2013.", "Clauw, D.J.   \"Fibromyalgia: A Clinical Review.\"\r\n    Journal of the American Medical Association.   April 2014.", "Latremoliere, Alban, and Woolf, Clifford J.   \"Central Sensitization: A Generator of Pain Hypersensitivity by Central Neural Plasticity.\"\r\n    Journal of Pain.   September 2009.", "Dubine, Adrienne E., and Patapoutian, Ardem.   \"Nociceptors: the Sensors of the Pain Pathway\"\r\n    Journal of Clinical Investigation.   November 2010.", "Albrecht, P.J., et al.   \"Excessive Peptidergic Sensory Innervation of Cutaneous Arteriole-venule Shunts (AVS) in the Palmar Glabrous Skin of Fibromyalgia Patients: Implications for Widespread Deep Tissue Pain and Fatigue.\"\r\n    Pain Medicine.   June 2013.", "University at Albany News Center.   \"University at Albany's East Campus Biotech Company Makes Major Fibromyalgia Discovery.\"\r\n    20 June 2013.", "Clauw, D.J.   \"Fibromyalgia and Related Conditions\"\r\n    Mayo Clinic Proceedings.   May 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]