["“যে কাজটা পারবেন না সেটা করতে যাবার দরকার নেই ইসরো কে বললেন মমতা,” reads the headline of a Bengali blog post which attributes a statement to West Bengal Chief Minister Mamata Banerjee. It claims that she mocked ISRO saying, “Don’t undertake work that you cannot do.”", "The URL of the blog in question reads – “https://indiatodaydailynews.blogspot.com” and also carries a logo of India Today.", "The blog post claimed that Banerjee made ‘anti-India’ comments at a time when the entire country is mourning that the ISRO lost communication with Vikram Lander. “She has been making anti-India remarks on everything. From the martyrdom of the Indian army in Pulwama to the sending of Chandrayaan to ISRO,” alleges the article.", "The blog post has been shared on many pages and by individual users on Facebook.", "At the time of writing, it had a Facebook engagement count (likes, comments and shares) of 17,000.", "India Today has an existing website with the URL ‘indiatoday.in’, and the blog in question has a ‘blogpost.com’ domain.", "Given below are all the organisations under the conglomerate India Today Group and the blog does feature on the list.", "The statement ascribed to Banerjee mocking ISRO was not found in any media reports. A similar sentiment was, however, expressed by Pakistani Federal Minister for Science and Technology Fawad Hussein. He tweeted on September 7, “Don’t undertake work that you cannot do (translated).”", "Awwwww….. Jo kaam ata nai panga nai leitay na….. Dear “Endia” https://t.co/lp8pHUNTBZ", "— Ch Fawad Hussain (@fawadchaudhry) September 6, 2019", "On the contrary, Banerjee had congratulated ISRO for Chandrayaa-2 mission.", "A testimony to the scientific temper they ingrained in us, and their unmatched caliber and dedication. My sincere gratitude and congratulations to @isro . We are all with you. May you continue to make us proud! (2/2)", "— Mamata Banerjee (@MamataOfficial) September 7, 2019", "A blog impersonating as media outlet India Today attempted to portray Mamata Banerjee as unsupportive of ISRO and its scientific accomplishments. The West Bengal Chief Minister is one of the favourite targets of the misinformation ecosystem on social media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]