["With less than 15 days to go for the first phase of Lok Sabha polls, political campaigning is expectedly in full swing. On March 26, BJP President Amit Shah was in Moradabad, Uttar Pradesh to address a campaign rally. Addressing the rally, he took a jibe at the erstwhile UPA regime for being soft against terrorists. He said, “Friends, you tell me, elections are going to be held in the country. Can anybody give a jaw-breaking response to terrorists other than Modiji?…. Can anybody give a jaw-breaking reply to Pakistan? The country wants a Prime Minister, who just by taking an oath will send shivers down enemies’ spine. For 30 years, you (Congress) have been feeding them (terrorists) biryani and I can say without any hesitation that the time when terrorists were given biryani is over now -translated)”", "WATCH | “Days of serving ‘biryani’ to terrorists are over,” says BJP president Amit Shah pic.twitter.com/pWpYHxYm2f", "— NDTV (@ndtv) March 26, 2019", "While targeting the Congress party for feeding biryani to terrorists, the BJP President was referring to a fabricated story propagated by the public prosecutor of the 26/11 trial, Ujjwal Nikam. During the trial, Nikam, who had argued on behalf of the state, had manufactured a story about Ajmal Kasab being fed biryani in jail to counter an emotional wave supposedly being created in Kasab’s favour. “Kasab neither asked for biryani nor it was served by the government. I concocted it just to break an emotional atmosphere which was taking shape in favour of Kasab during the trial of the case”, Nikam said, speaking to the media in 2015.", "According to a 2012 report, Nikam had earlier said, “On Raksha Bandhan, he had inquired from his lawyer whether some girl would come to tie a Rakhi on his wrist, while on another occasion he threw tantrums for mutton biryani to be served to him in jail”.", "Despite an admission by Nikam himself that the biryani story was a fabrication, BJP leaders on multiple occasions have reiterated the same claim. In November 2018, UP CM Yogi Adityanath had also used the same line of political propaganda.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]