["About this rating", "The use of deadly force by police officers is the subject of long-standing concern in the United States, and the internet is often the venue for debates about the causes of fatal encounters between law enforcement agents and members of the public.", "In September 2018, a meme shared on Facebook pointed the finger at one cause in particular for the relatively high rate of police killings in the United States: the length of time required to become a police officer.", "The meme compared the duration of police academy training and the number of police killings in recent years, in each of three Nordic countries (Norway, Finland, and Iceland) and the United States:", "This is our overview of the accuracy of those claims:", "Candidates become police officers in Norway after completing a three-year Bachelor's degree in Police Studies, administered centrally by the Norwegian Police University College in the capital city Oslo. The college's web site describes the training as follows:", "The training is professionally orientated and is intended to provide a broad theoretical and practical foundation for police work. The training is based on the principle that all newly qualified policemen/women must be generalists. A generalist is a policeman/woman who possesses basic knowledge and skills pertaining to the police’s preventative, crime prevention and civil order work. In solving assignments, generalists shall be able to perform basic police duties, make overall assessments of situations, view their work in a broader social context and engage relevant specialist expertise and partners as required. Generalists shall acquire a basis for continued learning and development through the execution of their profession.", "In order to be accepted into training, the applicant must meet certain requirements: must be a Norwegian citizen, speak good Norwegian, have a high school degree, and be physically fit and healthy.", "According to multiple sources, Norwegian police fatally shot four people between 2002 and 2016.", "In their 2014 annual report, the Norwegian Bureau for the Investigation of Police Affairs wrote that:", "Since 2005, the Bureau has investigated 15 cases where injury to a person has occurred as a result of the use of firearms by the police. A total of 16 persons have been injured in such incidents and, in two of these cases, the injuries resulted in death.", "A further two fatal shootings took place in 2015 and 2016, as detailed by the English-language news website The Local in November 2016:", "Norwegian police shot and killed a 35-year-old man in Kristiansand, an incredibly rare incident in a nation where fatal police shootings are nearly non-existent ... [The] incident marked just the fourth time that police in Norway have been involved in a fatal shooting since 2002. The most recent incident was in September 2015 when police killed a man in Stange Municipality who shot at officers. That marked the end of a nine-year stretch with no police killings.", "We did not find any evidence of another police killing in Norway since November 2016.", "In fact, a three-year Bachelor's degree is required to become a police officer in Finland. The country's Police University College (\"Poliisiammattikorkeakoulu\" in Finnish) outlines the course of study on their web site:", "The 180 credit point qualification qualifies a person to the positions of police officer, such as a Senior Constable. It takes about three years to complete the studies. Students learn practical knowledge and skills needed in police work. Upon graduation, the student has the skills to act as an expert in police work both independently and as a member of multiprofessional teams and has the necessary skills to develop police operations.", "Although this particular claim in the meme is not fully true, the reality (i.e., a three-year college degree is required, not just a two-year course) even more strongly supports the underlying argument in the meme, that police officers in the Nordic countries undergo longer training programs than their American counterparts.", "A spokesperson for the National Police Board in Finland provided us a list of nine fatalities attributed to police actions between 2000 and 2018. However, one of those nine deaths involved a tazer, and another involved a police officer's accidentally shooting a prison guard, so seven members of the public were killed (all shot dead) due to actions taken by police since 2000 in Finland.", "The National Police Board spokesperson also provided somewhat extraordinary figures for the use of firearms in Finland in recent years: \"Between 2003 and 2013, there were a total of 385 gunfire situations where 122 rounds where fired altogether. The number of weapon use situations ranged from 26 to 44 on an annual basis.\"", "So in the decade between 2003 and 2013, the entire national police force in Finland fired an average of 12 bullets per year, between them.", "Up until 2016, police training in Iceland was conducted at the country's police academy, but for the past two years becoming a member of the Icelandic police requires a two-year college diploma in Police Science from a program run exclusively by the University of Akureyri in the northern part of the island.", "The university's web site describes the two-year program as follows:", "Police Science is a practical academic discipline that studies the foundations, nature, and practice of policing. Students learn about the sources of consensus, conflict, and crime; personal freedom, diversity, and human rights; ethics, social control, and laws; the structure of the criminal justice system and its connection to other institutions; the aims, organizations, and tasks of the police; knowledge-based police approaches and techniques; police investigations; prioritizing of daily tasks; communication with other first responders and suspects, victims, witnesses, and the public.", "In addition, prospective police officers receive extensive practical training with the Centre for Police Training and Professional Development in cooperation with the University of Akureyri. The practical training involves, among other things, learning how to deal with difficult and dangerous individuals, unarmed police tactics and arrest techniques, the use of firearms and other police equipment, first on scene help and emergency driving of police vehicles. The training also involves fieldwork where students become familiar with the day-to-day work of the police under the guidance of tutors who are also active police officers.", "Multiple news articles corroborate this claim, that only one person in Iceland has ever been killed by police there. The English-language Iceland Review reported in 2013 that Icelandic police had shot dead a member of the public for the first time on record, citing the Dagblaðið Vísir newspaper. Of that death, the Guardian wrote:", "The 59-year-old was reported to have been shot after firing on police as they entered [a] building in the east of the Icelandic capital, Reykjavik. Teargas canisters had initially been fired through the windows after the man continued shooting and two police officers are reported to have been slightly injured after they entered.", "The gunman was brought to hospital but was pronounced dead there at around 10am local time. The case will be investigated by Iceland's state prosecutor. The country's national police chief, Haraldur Johannessen, told a press conference in Reykjavik that the incident was \"without precedent\".", "﻿We could find no record of Icelandic police having killed anyone else since 2013.", "Unlike the centralized national training and accreditation used in Norway, Finland, and Iceland, policing in the United States is broken up into semi-autonomous federal, state, and local forces, with training length and requirements varying across the country.", "However, according to data compiled by the federal Bureau of Justice Statistics, the average basic training for a police officer in the U.S. in 2013 was 843 hours, or around 21 weeks (based on a 40-hour work week). However, this figure encompasses only classroom instruction, with the average field training consisting of another 521 hours, or about 13 weeks. This means that, on average, the training time required to become a police officer in the United States in 2013 was 34 weeks, or just short of eight months.", "The figure of \"21 weeks\" training appears to derive from the classroom instruction component, but that measurement misses field training, which increases the total training time required significantly. Furthermore, it's unclear whether these numbers have changed significantly since 2013, which is the most recent year for which the Bureau of Justice Statistics has data.", "The U.S. does not maintain an official national database of incidents in which police officers' actions have led to the death of civilians, so we can't know for certain the number of people killed by police between 2001 and 2018, as Vox noted in 2015:", "Criminal justice experts have long known that these measures are flawed. [Bureau of Justice Statistics's Arrest-Related Deaths] collects police-caused homicide data through state reporting coordinators, but the methods of collecting data can greatly vary from state to state, often depend on differing access to technology, and sometimes don't directly involve police departments or coroner's offices. [FBI's Supplementary Homicide Reports] relies on reports submitted by police agencies, but these reports are voluntary — and some states, like Florida, don't participate.", "\"The available data (FBI, Vital Stats, Bureau of Justice Statistics) are worse than miserable,\" David Klinger, a criminologist at the University of Missouri St. Louis, wrote in an email. \"They suck and no one should do any sort of analysis with them beyond using them to say that we have some floor [regarding] shootings and perhaps note that there are all sorts of circumstances involved when shootings occur.\"", "However, commendable and methodologically rigorous efforts have been undertaken to create an unofficial database, notably by the Fatal Encounters website, which has been used as a data source in academic research.", "According to the Fatal Encounters database, 23,977 deaths took place at the hands of police between 2001 and 2018, which suggests that the figure of \"more than 8,000\" may be a significant underestimation.", "<!--\nThis reckoning is supported by another robust source, the Guardian's database of police use of deadly force for 2015 and 2016, which tallied 1,146 and 1,093 deaths in 2015 and 2016, respectively. Those figures suggest that the meme's tally of about 450 persons killed on average per year by police  over the last 18 years is probably on the low side.\n-->", "The factual claims in the meme are mostly accurate, but the underlying implication behind the meme, that shorter training programs cause the relatively high number of police killings in the United States, is questionable.", "Several unmentioned factors are likely to be more relevant and prominent as causes. According to a 2015 article by the sociologist and criminal justice professor Paul Hirschfield, these include: the arming of police (which is not routine in Norway and Iceland, though it is in Finland), a higher prevalence of guns among the general public (\"American police are primed to expect guns\"), decentralized and under-resourced police training (although Hirschfield does not mention the duration of training as a factor), and racial biases (whether conscious or unconscious) among law enforcement officers.", "Although it's true that the United States has a vastly higher population than any of the Nordic countries mentioned in the meme, it has a much higher prevalence of police killings, even when population is taken into account.", "We counted the total number of police killings in each country between 2002 and 2017 (using Fatal Encounters' data for the U.S.), then adjusted for each country's average population over the course of that 16-year period. That method equated to 71 police killings per million people in the U.S., over that time period; 3.2 per million people in Iceland; 1.5 per million people in Finland, and 0.8 police killings per million people in Norway.", "Norwegian Bureau for the Investigation of Police Affairs.   \"Annual Report 2014.\"\r\n    2015.", "Polisstyrelsen (National Police Board, Finland).   \"Fatalities Resulting from the Use of Force by the Police in the 2000s.\"\r\n    7 September 2018.", "Hafstað, Vala.   \"Akureyri University to Educate Police.\"\r\n    The Iceland Review.   24 August 2016.", "The Iceland Review.   \"First Fatal Police Shooting in Iceland.\"\r\n    30 January 2014.", "Ólason, Samúel Karl.   \"Fyrsta Sinn Sem Maður Fellur Fyrir Skoti Islenskrar Lögreglu.\"\r\n    Dagblaðið Vísir.   2 December 2013.", "Quinn, Ben.   \"Iceland's Armed Police Make First Ever Fatal Shooting.\"\r\n    The Guardian.   2 December 2013.", "Reaves, Brian A.   \"State and Local Law Enforcement Training Academies, 2013.\"\r\n    The Bureau of Justice Statistics/U.S. Department of Justice.   July 2016.", "Hirschfield, Paul J.   \"Lethal Policing: Making Sense of American Exceptionalism.\"\r\n    Sociological Forum; Vol. 30, No. 4.   December 2015.", "The Guardian.   \"The Counted -- People Killed by Police in the U.S.\"\r\n    Accessed 11 September 2018.", "Hirschfield, Paul J.   \"Why Do American Cops Kill So Many Compared to European Cops?\"\r\n     The Conversation.   25 November 2015.", "The Local.   \"Norwegian Police Involved in Just Fourth Fatal Shooting in 14 Years.\"\r\n    28 November 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]