["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida gubernatorial candidates, Republican Ron DeSantis, left, and Democrat Andrew Gillum fist bump after a debate, Wednesday, Oct. 24, 2018, at Broward College in Davie, Fla. (AP)", "Ron DeSantis accused Andrew Gillum of changing his message to Florida voters about his plans for the future of charter schools.", "At their final debate, moderator Todd McDermott asked Gillum to elaborate on his charter school plan.", "\"You’ve said ‘we’ve got to end this for-profit education’ in reference to charter schools in this state,\" McDermott said. \"Ten percent of students in Florida attend charter schools that provide an alternative to traditional public education. Are you saying you would cut any dollars away from what funds charter schools in the state?\"", "Gillum replied, \"No, I am not proposing any change to the current status quo. But what we are saying is that we are going to put money into our public system where over 90 percent of our kids are still being educated.\"", "DeSantis accused Gillum of \"singing a different tune.\"", "\"In the Democratic primary, he said that charter schools would be done,\" said DeSantis, who defended the rights of parents to choose charter schools.", "We looked back at Gillum’s statements about charter schools to see if he had called for any change to the status quo, and found he has been consistently critical of the involvement of for-profit entities in charter schools. (He has also called for a $1 billion increase in corporate taxes for education.)", "DeSantis wants to continue many Republican school initiatives, including supporting charter schools.", "Gillum has been a critic of for-profit involvement in charter schools throughout his campaign.", "Charter schools are public schools but operated by an entity other than a school district. They must be operated or controlled by a nonprofit organization by law, but some nonprofit charter school boards enter into contracts with for-profit companies. (It is hard to say exactly how many, due to murky state data however charter schools affiliated with for-profit firms are a large and growing sector of Florida’s charter schools.)", "A Miami Herald investigation in 2011 found charter schools are \"controlled largely by for-profit management companies and private landlords — one and the same, in many cases — and rife with insider deals and potential conflicts of interest.\"", "That distinction is at the heart of Gillum’s critique. He couches his opposition to say he is a critic of for-profit charter schools.", "When asked on WPTV in February if he supports the charter school concept, Gillum said \"my issue is not with charters. My issue is with for-profit charter schools who take money away from the public system badly needed in the public system.\"", "Gillum made some of his most forceful comments against for-profit involvement in charter schools in a June primary debate.", "\"What we’ve got to do is end this for-profit regime that the Republicans have entered into the public education system here in the state of Florida,\" Gillum said. \"We’ve got to do it immediately. ... I would be completely against for-profit charters in this state.\"", "During an August primary debate, Gillum said the governor and Legislature \"have moved more and more of our public dollars out of public schools and into for-profit charter schools. We need to end that.\"", "After Gillum won the primary, he continued to criticize for-profit charter schools.", "In September, the AP paraphrased Gillum as stating that it was time to stop siphoning off public money into privately run schools. Gillum said he would seek to bring the state's current voucher programs to a \"conclusion.\"", "While Gillum hasn’t provided a detailed road map to the steps he would take if elected to crack down on for profits, he has made it clear these schools are in his crosshairs, and he views the involvement of for-profit entities as a problem.", "We asked his campaign to clarify whether he would try to shutter existing charter schools managed by for-profit entities, something that would require buy-in from the state Legislature.", "Campaign spokeswoman Carlie Waibel said Gillum \"will not shut down charter schools,\" saying he wants to bring them more \"transparency and standards.\"", "Lynn Norman-Teck, executive director of the Florida Charter School Alliance, disagrees with a blanket condemnation of charter schools that are managed by for profit entities. For some schools, the for profit entity does back office type of work while in others they have a larger role.", "\"We should be looking at the value of a school whether it is a district school or private school or charter,\" she said. \"Let’s look at the return on investment -- are they reaping results? Are those children moving forward?\"", "DeSantis says Gillum was \"singing a different tune\" about charter schools at the Florida debate.", "That was a reference to Gillum’s answer to a question about whether he would cut any dollars from charter schools.", "But Gillum was downplaying his previous comments on charters, saying he would not propose any change to the \"current status quo.\" He went on to say he was \"going to put money into our public system where over 90 percent of our kids are still being educated.\"", "During the primary, Gillum had tougher words. He said Florida should \"end this for-profit regime\" immediately, in regard to charter schools managed by for-profit entities, and he called for an \"end\" of moving more public dollars to for-profit charters.", "What DeSantis omits is that Gillum hasn’t called for an end to all charter schools — he is targeting those that are managed by for-profit entities.", "We rate this claim Mostly True.", "Ron DeSantis campaign website, Education, Accessed Oct. 25, 2018", "Andrew Gillum campaign website, Education, Accessed Oct. 25, 2018", "Florida Department of Education, Fact sheet, September 2018", "WPTV To The Point, Interview with Mayor Andrew Gillum, Feb. 11, 2018", "WPBF, Debate, Aug. 2, 2018", "Orlando Sentinel, \"Governor's race: DeSantis, Gillum tout very different education agendas,\" Oct. 22, 2018", "Tampa Bay Times The Buzz, \"Miss that fiery Democratic gubernatorial debate? Here it is,\" June 11, 2018", "Miami Herald, \"Florida charter schools: big money, little oversight,\" Sept. 19, 2011", "Tallahassee Democrat, \"Gillum criticized over tax hike to fund schools,\" Sept. 19, 2018", "Miami Herald, \"$200 million incentive for charter schools is not the answer, Democrats say,\" April 12, 2017", "AP, \"Florida Democratic governor candidates call for 2018 unity,\" July 17, 2018", "Miami Herald, \"Praising Florida's 'innovation,' DeVos avoids traditional public schools,\" Aug. 29, 2017", "Tallahassee Democrat, \"Visit sparks criticism from Graham, Gillum,\" Aug. 30, 2017", "Dayton Beach News Journal, \"Gillum brings pitch for governor to Volusia Democrats,\" March 27, 2018", "Florida Consortium of Public Charter schools A Close Look at Florida’s Public Charter Schools 2018", "Naples Daily News, Democrats' gubernatorial candidates spar in second debate, June 11, 2018", "Tallahassee Democrat, \"Gillum, Graham funds boosted by friends, family,\" July 13, 2018", "National Education Association, \"Five reasons why Florida’s Andrew Gillum is public education’s pick for governor,\" Sept. 142018", "Miami Herald, \"Andrew Gillum announces plan to improve Florida’s education,\" Sept. 18, 2018", "Herald Tribune, \"Florida Governor: Q&A with Andrew Gillum,\" Aug. 2, 2018", "WTSP, \"Where does Andrew Gillum stand on key issues?\" July 1, 2018", "Tampa Bay Times, \"School plans in sharp contrast,\" Sept. 19 , 2018", "AP, \"School days: Florida candidates differ widely on education,\" Sept. 18, 2018", "WPTV West Palm Beach, Interview with Andrew Gillum, Feb. 11, 2018", "Florida Politics, \"Andrew Gillum ‘slams’ Special Session,\" June 7, 2017", "The Ledger, \"Gubernatorial candidates Gillum, DeSantis differ widely on state education views,\" Sept. 18, 2018", "U.S.News and World Report, Mater Academy and International Studies Charter and Florida charter rankings, 2018", "PolitiFact, \"Are all Florida charter schools not-for-profit?\" April 27, 2017", "PolitiFact, \"Graham in error on Florida charter school teacher certification,\" Aug. 15, 2018", "Interview, Stephen Lawson, Ron DeSantis campaign spokesman, Oct. 25, 2018", "Interview, Carlie Waibel, Andrew Gillum campaign spokeswoman, Oct. 26, 2018", "Interview, Ben Wilcox, Integrity Florida research director, Oct. 25, 2018", "Interview, Lynn Norman-Teck, executive director of the Florida Charter School Alliance, Oct. 25, 2018", "Interview Gary Bitner, Florida Consortium of Charter Schools spokesman, Oct. 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]