["Mike Pence told Tim Kaine at the vice presidential debate that Donald Trump will release his tax returns -- once an audit of the GOP presidential candidate has concluded. But the Democratic vice presidential candidate responded that explanation didn’t meet the \"Nixon standard.\"", "\"Richard Nixon released tax returns when he was under audit,\" Kaine said.", "Kaine often invokes Nixon in calling for Donald Trump to release his tax returns. Back in August, we checked a statement Kaine made where he said that Nixon made his tax returns public \"when he was running for president.\"", "We found that statement was Mostly False, because while Nixon made his tax forms public as president, he never did so while running for the country’s highest office. Kaine worded his statement differently this time around, so let’s take another look.", "You can find Nixon’s tax returns for 1969 through 1972 at the website for the Presidential Tax History Project, which is run by Tax Analysts, a Falls Church-based nonprofit that specializes in tax issues.", "That group has compiled tax returns online for past presidents and major-party presidential nominees. Nixon’s returns were released in December 1973, a year after he was re-elected.", "At the time, the 37th president was embroiled in the Watergate scandal, and questions were being raised about whether something also was amiss with his tax filings.", "Reports had surfaced that Nixon had been paying a small amount of federal tax for several years, Joseph J. Thorndike, a historian at Tax Analysts told us in August. To quell lingering concerns, Nixon released tax returns to the public as well as to the Joint Committee on Taxation.  Nixon was under an IRS audit at the time, Thorndike told us.", "In an April 2016 blog post, Thorndike wrote that the IRS audit found Nixon owed almost $500,000 in unpaid taxes and interest.", "\"Nixon released his returns even though he was under audit. Ultimately, the audit didn’t go well for him-- it was unpleasant, embarrassing, and ultimately very expensive,\" Thorndike wrote. \"But it was also necessary, given the persistent questions about Nixon’s returns.\"", "Thorndike says Nixon’s disclosure started a tradition where presidents and candidates seeking the highest office release their returns to the public. His successor, President Gerald Ford, didn’t make his returns public, although he did release a summary of his returns. Every president since Jimmy Carter has made their tax forms public.", "Our ruling", "Kaine said, \"Richard Nixon released tax returns when he was under audit.\"", "That is accurate. We rate his claim True.", "https://www.sharethefacts.co/share/07d727d8-606f-4b56-b78f-9f6d04911142", "Tim Kaine’s comments at the vice presidential debate, Oct. 4, 2016.", "PolitiFact Virginia, \"Tim Kaine wrongly says Richard Nixon released tax returns during campaign,\" Aug. 22, 2016.", "Email from Josh Schwerin, spokesman for Hillary Clinton’s campaign, Oct. 4, 2016.", "Tax Analysts, \"Donald Trump won’t release his tax returns while under audit. But Richard Nixon did,\" April 4, 2016.", "Tax History Project, \"President Nixon’s troublesome tax returns,\" April 11, 2005.", "Tax Analysts Tax History Project, \"Presidential tax returns,\" accessed August 16-18, 2016.", "United States Capitol Historical Society, \"JCT investigation of Nixon’s tax returns,\" February 2016.", "CNN, \"Nixon released his tax returns under audit. Why can’t Trump?\" May 11, 2016.", "FactCheck.org, \"Kaine muffs Trump-Nixon comparison,\" Sept. 2, 2016.", "NBCNews, \"Richard Nixon released tax returns while under audit,\" May 12, 2016.", "Interview with Joseph J. Thorndike, historian at Tax Analysts, August 16, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]