["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The image shows a tradition that takes place at the Indianapolis Speedway called “kissing the bricks.” NASCAR doesn’t force its athletes to take part in religious activities.", "NASCAR recently announced that it would ban the Confederate flag from being displayed at its events and properties to provide a \"welcoming and inclusive environment\" for fans. The move comes amid protests against police brutality and a national outcry to remove Confederate statues and symbols around the country.", "Now, a Facebook post is sharing an outrageous claim that the racing association \"forces\" its drivers to participate in Muslim prayer. It features a photo of a row of drivers kneeling down, bent over with their heads touching the floor.", "The caption reads: \"So NASCAR bans the confederate flag but FORCES all their drivers to do Muslim prayer? I wouldn’t have believed it if I didn’t see it with my own eyes. Unacceptable!!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is bogus. NASCAR does not force its drivers to participate in Muslim prayer, or any other religious activity, and the photo displayed shows drivers taking part in a tradition called the \"kissing the bricks.\"", "The tradition takes place at the Indianapolis Motor Speedway's yard-length section of bricks called the \"Yard of Bricks\" and was started in 1996 by Dale Jarrett.", "After his Brickyard 400 victory, Jarrett and his crew walked out to the start-finish line and kissed the bricks. Since then, winners of various races at the speedway have done the same.", "A reverse-image search shows that the photo in the post was taken on July 24, 2016, when Kyle Busch won the Combat Wounded Coalition 400 at the speedway. Busch, his wife, and others took part in the tradition.", "A Facebook post that displays a photo of NASCAR drivers kneeling down kissing the floor claims that the racing association forces its athletes to participate in Muslim prayer, yet banned the confederate flag.", "This isn’t true. NASCAR doesn’t force or require drivers to partake in any religious activities. The image shows drivers taking part in a longstanding tradition called the \"kissing the bricks\" at the Indianapolis Speedway.", "This is Pants on Fire!", "Facebook post, June 13, 2020", "Twitter, NASCAR tweet, June 10, 2020", "Tin Eye, reverse-image search, June 17, 2020", "Getty Images, NASCAR Sprint Cup Series Crown Royal Presents the Combat Wounded Coalition 400, July 24, 2016", "Indianapolis Motor Speedway, Yard of Bricks & Pagoda, Accessed June 17, 2020", "Associated Press, Viral photo shows NASCAR drivers ‘kissing the bricks,’ not doing a Muslim prayer, June 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]