["The video has been posted on Instagram and Facebook with text below it that translates to English as: “Immigrants from China in Jakarta are being deported by Anies Baswedan to their origin country”.", "Below is a screenshot of one of the misleading Instagram posts, where the video has been viewed more than 53,000 times since February 3, 2019:", "Another version of the video has been viewed more than 24,000 times after being posted on Twitter here on February 1, 2019, with a caption that translates to English as: “When will other regions follow suit??? Chinese immigrants in Jakarta being deported by Mr @aniesbaswedan”.", "Below is a screenshot of that tweet:", "The video has also been posted at least a dozen times on Facebook since February 3, 2019, including here, where it has been viewed more than 4,600 times.", "The caption on that Facebook post translates to English as: “Reposted from @rezim_laknat -- @aniesbaswedan has integrity, is decisive, brave and brilliant. The people in April 2019 wish to have a leader like @aniesbaswedan, a leader who is honest. The hope is only on #prabowosandi.”", "“April 2019” refers to Indonesia’s presidential election, set for April 17, 2019 in which Prabowo Subianto is the sole challenger against incumbent Joko Widodo.", "“#prabowosandi” refers to the challenger and his running mate Sandiaga Uno -- who stepped down as Jakarta’s deputy governor last year to join Subianto’s ticket.", "The video has been taken from a television news report from Indonesian television station CTV NETWORK that was published to Youtube on September 18, 2015.", "The CTV NETWORK clip is a news report about a raid on illegal Chinese immigrants in Jakarta.", "The caption in the Youtube video translates into English as: “Some 53 Chinese nationals have been arrested by officials in an immigration raid at Mediterania Apartment in Gadjah Mada, West Jakarta. They have been apprehended because they did not have proper identity documents and had violated staying permit in Indonesia”.", "The video in the misleading posts has the CTV watermark over it, and the footage in both clips shows exactly the same scenes. The captions at the bottom of the CTV video can also be seen in the footage in the misleading posts.", "Below are screenshots from the misleading posts and the CTV Youtube clip:", "Below is the CTV NETWORK clip on Youtube:", "The original television clip pre-dates his inauguration by more than two years. Baswedan became governor of Jakarta on October 16, 2017. Here is a report in The Jakarta Post about him becoming governor.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]