["About this rating", "In an April 2017 post on an anarchist web site, a group claimed to have poured concrete on train tracks in Washington to prevent the shipment of fracking materials.", "Whether the group actually poured concrete on train tracks is unknown, the claimed site of the sabotage was 15 miles away from where the Amtrak accident actually occurred, and officials have found no evidence that vandalized rails were the cause of the crash.", "On 18 December 2017, an Amtrak passenger train derailed south of Seattle, Washington, killing several people. Shortly afterwards, conspiratorial web sites and Internet personalities began pointing to a now-deleted April 2017 post on the anarchist web site ItsGoingDown.org in which an anarchist group claimed to have poured concrete on train tracks 15 miles away from the accident scene to prevent the shipment of fracking materials.", "Sites such as the Gateway Pundit, InfoWars and Internet personality Mike Cernovich dug up the eight-month-old post, suggesting a link to the Amtrak derailment with statements like the following:", "While law enforcement is still investigating the cause behind the train’s derailment, ANTIFA reportedly sabotaging the tracks and then deleting the post raises serious question about there potential involvement in Monday’s incident.", "Anti-fascists or \"antifa\" are a loose collective of leaderless groups mostly made up of anarchists or people with far-left political views. There's no credible information to support the claim that any of these groups were involved in the train derailment. Hours after the incident, the National Transportation Safety Board (NTSB) reported that when Train 501 left the tracks, it was going 80 miles per hour in a 30-mile-per-hour zone during its inaugural run on the new route between Seattle and Portland, Oregon. Investigators have found no evidence that vandalized tracks were the cause of the accident.", "In a phone interview, Cernovich pushed back against the criticism that he had spread unverified information to his hundreds of thousands of followers, telling us that he had made it clear that the theory was mere speculation:", "I was clear to say it could be something, it could be nothing, and nobody knows anything. But if there’s going to be a blanket rule that nobody’s allowed to speculate about anything then I’ll follow that rule if everybody else does.", "Cernovich acknowledged his large following gives his words a long reach:", "One criticism that is legitimate is, [I] need to word things precisely because of the size of [my] platform. That’s a criticism that I take to heart. Most people would agree I’ve toned thing down considerably.", "A source from It's Going Down who provided only the name \"James A.\" told us that \"Puget Sound Anarchists\" had sent in the April post after receiving it from another group. The group claimed to have poured cement on BNSF-owned tracks \"that lead out of the Port of Olympia,\" which is actually about 15 miles from the site of the Amtrak train derailment:", "Early in the morning of April 20th we poured concrete on the train tracks that lead out of the Port of Olympia to block any trains from using the tracks. We took precautions to notify BNSF (the train company) – we called them and we used wires to send a signal that the tracks were blocked. We did this not to avoid damaging a train, nothing would bring bigger grins to our faces, but to avoid the risk of injuring railway workers.", "None of It's Going Down, BNSF, or the Olympia Police Department would confirm or deny whether the sabotaging incident boasted of in April 2017 actually occurred. In an email, James A. told us that:", "It is important to note that this site receives and reposts anonymous communiques (with the level of discernment that comes from a group of anarchists who have been a part of many movements for several decades / fact checking (when possible)). In this instance we relayed a transmission that PSA [Pugent Sound Anarchists] had received. It should be noted that \"Puget Sound Anarchists\" did not claim the action, they were just the online outlet where such a message was received and posted, it was not signed by them.", "We removed the article on our site some months ago because it was too laborious for us continue dealing with the spam it generated. We have no reason to believe April's action did not happen, but also have no evidence, at this particular moment, to suggest that it did. In any case it was removed well before this latest tragedy.", "Our reading of the communique is that individual(s) stopped a train (not derailing it). They took precautions to protect human life and reach their goal, by both signalling the company and sending a message on the tracks. This seemed synchronous with the spirit and intention of their goal - stop natural gas fracking.", "A spokeswoman for BNSF referred us to Olympia police. Lt. Sam Costello wouldn't confirm whether police had any reports of such vandalism, saying:", "I do understand that many are beginning to look back at things historically in the Olympia area today, likely due to the incident this morning. We have had instances of people engaging in protest-type activity on rail tracks in Olympia but I cannot say that those protests have anything to do with today's tragic derailment.", "Port of Olympia spokeswoman Jennie Foglia-Jones said port workers were aware of the blog post when it was published but couldn't confirm whether any concrete was actually poured at that time. If it was, it wouldn't have been the first vandalism of its type. In August 2014, a Tacoma Rail train crashed into a concrete block that was placed on the track, resulting in a punctured fuel tank and massive spill. The collision financially crippled publicly-owned Tacoma Rail. No suspect was ever identified.", "It's true the port has been the target of anti-fracking activists angry that materials shipped from there on freight trains are used in natural gas exploration. But the train involved in the Monday morning derailment was a passenger train that doesn't appear to have anything to do with the port, which is miles away from the site of the accident.", "The amorphous antifa have gained notoriety in 2017 by physically fighting white supremacists at rallies in places like Berkeley and Charlottesville. Increasingly, the group has become the subject of rumors and false claims — it was falsely blamed for the 1 October 2017 mass shooting in Las Vegas and falsely accused of plotting a violent uprising on 4 November 2017. No such uprising ever took place.", "Blankstein, Andrew, et al. \"Amtrak Derailment: Three Dead in Train Crash Near Tacoma, Washington.\"\r\n  NBC News. 18 December 2017.", "Associated Press. The Latest: Authorities: 3 Confirmed Deaths in Derailment.\"\r\n  18 December 2017.", "Brunner, Jim. \"Lakewood Mayor Had Predicted New Amtrak Rail Line Would Lead to Fatalities.\"\r\n  The Seattle Times. 18 December 2017.", "Hobbs, Andy. \"Vandalism Threatens Tacoma Rail Service in Olympia and Tumwater.\"\r\n  The Olympian. 15 May 2015.", "Swenson, Kyle. \"Anti-Fracking Activists and Anarchists Are Blocking Rail Tracks in Olympia, Wash. They Don’t Plan on Leaving.\"\r\n  The Washington Post. 29 November 2017.", "Hobbs, Andy. \"Tacoma Rail to End Short-Line Service to Thurston County.\"\r\n  The Olympian. 8 January 2016.", "Hayden, Michael Edison. \"Antifa Falsely Linked to Amtrak Train Derailment By Right Wint Conspiracy Peddlers.\"\r\n  Newsweek. 18 December 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]