["The state of Georgia, as does most governments, keeps a reserve or \"rainy day fund\" in case it needs extra money.", "During his State of the State address, Georgia Gov. Nathan Deal's Twitter page offered some specifics.", "\"The 'rainy day' fund has increased by 226 percent\" since he took office, Deal's staff tweeted.", "Amid budget cuts and a sluggish economy, we wanted to know if the governor and his staff were correct.\n\nGeorgia had to borrow from its revenue shortfall reserve fund in 2009, after the Great Recession began. Georgia’s fund went from nearly $1.5 billion in 2007 to about $104 million two years later, according to state budget records. Most states also had significant declines in their reserves, according to the Washington-based Center on Budget and Policy Priorities.\n\nDuring the 12-month fiscal year when Deal took office, Georgia’s reserve fund was $116,021,961. During fiscal year 2012, which ended June 30, 2012, the reserve fund was $377,971,440, records show. The increase, as the governor said, was approximately 226 percent.\n\nCarolyn Bourdeaux, the former director of the Georgia Senate Budget and Evaluation Office, reviewed the numbers against the most recent annual state audit report and saw an even higher figure for the reserve, which was about $520 million. The current state budget is about $19.3 billion.\n\nBourdeaux, who teaches in the public management and policy department at Georgia State University, noted that Deal has made cuts in various areas and the state has seen modest economic growth in the past two years. Deal asked most state agencies last year to cut their budgets by at least 3 percent due to concerns about the economy. The governor said he wants to find $553 million in reductions through June 2014.\n\nSome budget experts, such as the Georgia Budget & Policy Institute’s executive director, Alan Essig, say the budget cuts and midyear revenue adjustments have helped Deal increase the rainy day fund. Essig, though, believes the rainy day fund is still \"dangerously low\" and that the state needs to raise taxes. He believes the fund should be near 10 percent of the state budget, which would be close to $2 billion.\n\nMost states currently have about 2 percent of their entire budget set aside for a rainy day fund, according to the Center on Budget and Policy Priorities. Georgia has about 2 percent of its budget set aside in reserves.\n\nWe found nothing that contradicts the governor’s claim. Our rating: True.", "State of the State address, Jan. 17, 2013.", "Atlanta Journal-Constitution, \"More budget cuts ahead for state health care, universities,\" Aug. 3, 2012.", "Center for Budget and Policy Priorities, \"2013 is a Good Year to Repair (if not replenish) State Rainy Day Funds,\" accessed Jan. 24, 2013.", "Georgia Budget & Policy Institute, \"Overview of Georgia’s 2014 Fiscal Year budget,\" January 2012.", "Georgia Office of Budget and Planning, budget documents.", "Telephone interview with Carolyn Bourdeaux, associate professor, Georgia State University, Jan. 17, 2013\n\nTelephone interview with Alan Essig, executive director, Georgia Budget & Policy Institute, Jan. 28, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]