["By Jessica McDonald", "Posted on February 12, 2021 | Updated on May 14, 2021", "A video falsely claims that people receiving authorized COVID-19 vaccines are taking part in a deadly clinical trial and that those administering the doses are war criminals under the Nuremberg Code. That’s bogus. People getting the vaccines, which have been shown to be safe and effective, consent to receive them and aren’t participating in research.", "No vaccine or medical product is 100% safe, but the safety of vaccines is ensured via rigorous testing in clinical trials prior to authorization or approval, followed by continued safety monitoring once the vaccine is rolled out to the public to detect potential rare side effects. In addition, the Food and Drug Administration inspects vaccine production facilities and reviews manufacturing protocols to make sure vaccine doses are of high-quality and free of contaminants.", "One key vaccine safety surveillance program is the Vaccine Adverse Event Reporting System, or VAERS, which is an early warning system run by the Centers for Disease Control and Prevention and FDA. As its website explains, VAERS “is not designed to detect if a vaccine caused an adverse event, but it can identify unusual or unexpected patterns of reporting that might indicate possible safety problems requiring a closer look.”", "Anyone can submit a report to VAERS for any health problem that occurs after an immunization. There is no screening or vetting of the report and no attempt to determine if the vaccine was responsible for the problem. The information is still valuable because it’s a way of being quickly alerted to a potential safety issue with a vaccine, which can then be followed-up by government scientists.", "Another monitoring system is the CDC’s Vaccine Safety Datalink, which uses electronic health data from nine health care organizations in the U.S. to identify adverse events related to vaccination in near real time.", "In the case of the COVID-19 vaccines, randomized controlled trials involving tens of thousands of people, which were reviewed by multiple groups of experts, revealed no serious safety issues and showed that the benefits outweigh the risks.", "The CDC and FDA vaccine safety monitoring systems, which were expanded for the COVID-19 vaccines and also include a new smartphone-based reporting tool called v-safe, have subsequently identified only a few, very rare adverse events.", "For more, see “How safe are the vaccines?”", "Link to this", "More than half a billion doses of COVID-19 vaccines have now been administered in the U.S. and only a few, very rare, safety concerns have emerged. The vast majority of people experience only minor, temporary side effects such as pain at the injection site, fatigue, headache, or muscle pain — or no side effects at all. As the Centers for Disease Control and Prevention has said, these vaccines “have undergone and will continue to undergo the most intensive safety monitoring in U.S. history.”", "A small number of severe allergic reactions known as anaphylaxis, which are expected with any vaccine, have occurred with the authorized and approved COVID-19 vaccines. Fortunately, these reactions are rare, typically occur within minutes of inoculation and can be treated. Approximately 5 per million people vaccinated have experienced anaphylaxis after a COVID-19 vaccine, according to the CDC.", "To make sure serious allergic reactions can be identified and treated, all people receiving a vaccine should be observed for 15 minutes after getting a shot, and anyone who has experienced anaphylaxis or had any kind of immediate allergic reaction to any vaccine or injection in the past should be monitored for a half hour. People who have had a serious allergic reaction to a previous dose or one of the vaccine ingredients should not be immunized. Also, those who shouldn’t receive one type of COVID-19 vaccine should be monitored for 30 minutes after receiving a different type of vaccine.", "There is evidence that the Pfizer/BioNTech and Moderna mRNA vaccines may rarely cause inflammation of the heart muscle (myocarditis) or of the surrounding lining (pericarditis), particularly in male adolescents and young adults.", "Based on data collected through August 2021, the reporting rates of either condition in the U.S. are highest in males 16 to 17 years old after the second dose (105.9 cases per million doses of the Pfizer/BioNTech vaccine), followed by 12- to 15-year-old males (70.7 cases per million). The rate for 18- to 24-year-old males was 52.4 cases and 56.3 cases per million doses of Pfizer/BioNTech and Moderna vaccines, respectively.", "Health officials have emphasized that vaccine-related myocarditis and pericarditis cases are rare and the benefits of vaccination still outweigh the risks. Early evidence suggests these myocarditis cases are less severe than typical ones. The CDC has also noted that most patients who were treated “responded well to medicine and rest and felt better quickly.”", "The Johnson & Johnson vaccine has been linked to an increased risk of rare blood clots combined with low levels of blood platelets, especially in women ages 30 to 49. Early symptoms of the condition, which is known as thrombosis with thrombocytopenia syndrome, or TTS, can appear as late as three weeks after vaccination and include severe or persistent headaches or blurred vision, leg swelling, and easy bruising or tiny blood spots under the skin outside of the injection site.", "According to the CDC, TTS has occurred in around 4 people per million doses administered. As of early April, the syndrome has been confirmed in 60 cases, including nine deaths, after more than 18.6 million doses of the J&J vaccine. Although TTS remains rare, because of the availability of mRNA vaccines, which are not associated with this serious side effect, the FDA on May 5 limited authorized use of the J&J vaccine to adults who either couldn’t get one of the other authorized or approved COVID-19 vaccines because of medical or access reasons, or only wanted a J&J vaccine for protection against the disease. Several months earlier, on Dec. 16, 2021, the CDC had recommended the Pfizer/BioNTech and Moderna shots over J&J’s.", "The J&J vaccine has also been linked to an increased risk of Guillain-Barré Syndrome, a rare disorder in which the immune system attacks nerve cells. Most people who develop GBS fully recover, although some have permanent nerve damage and the condition can be fatal.", "Safety surveillance data suggest that compared with the mRNA vaccines, which have not been linked to GBS, the J&J vaccine is associated with 15.5 additional GBS cases per million doses of vaccine in the three weeks following vaccination. Most reported cases following J&J vaccination have occurred in men 50 years old and older.", "Link to this", "A popular video from a British conspiracy theorist and anti-vaccine activist makes a slew of false claims about government-authorized COVID-19 vaccines, including the incorrect notion that they are “experimental” and that the clinicians administering them are violating the Nuremberg Code.", "That’s wrong on both counts. While phase 3 clinical trials of the vaccines are continuing as planned to collect additional data, that doesn’t mean the immunizations are experimental or that people who are now getting vaccinated are participating in a trial.", "Moreover, nothing about the Nuremberg Code applies to the situation, as people getting the vaccines are doing so as part of their own medical care, not research. They also consent to receive the jabs and information about the vaccines is widely available.", "The video also baselessly claims that the authorized COVID-19 vaccines are dangerous and tantamount to a “global genocide,” citing deaths that have not been proven to be from vaccines.", "The claims are made in a 15-minute video by Dr. Vernon Coleman, a former general practitioner in the U.K. who is no longer registered to practice medicine. Coleman has a history of peddling discredited medical information and has argued that the COVID-19 pandemic is a hoax and that AIDS does not exist.", "The video has been shared on multiple Facebook pages and appears on various websites, including a site run by Charlie Ward, a man who has previously made false claims about COVID-19 vaccines.", "The U.K.’s Medicines and Healthcare products Regulatory Agency has authorized three COVID-19 vaccines for use during the pandemic: Oxford University and AstraZeneca’s viral vectored vaccine, Pfizer/BioNTech’s mRNA vaccine and Moderna’s mRNA vaccine. The U.S.’s Food and Drug Administration has authorized the latter two for emergency use. (See SciCheck’s guides to those here and here.)", "In the video, Coleman claims the COVID-19 vaccine is “experimental” and says because the vaccine trials are still ongoing, “Everyone having the vaccine is therefore taking part in an experiment.”", "He then goes on to claim that people giving the vaccines are legally war criminals under the Nuremberg Code.", "“The Nuremberg Code on medical experimentation written in 1947 … stated that explicit, voluntary consent from patients is required for human experimentation,” he says. “That means that patients must be told that they’re taking part in a trial and they must be warned of all the possible adverse events. That’s what informed consent means. … And so legally, all those people giving vaccinations are war criminals.”", "“Everyone giving the COVID-19 vaccines without explaining that … it’s an experiment and without listing all the possible adverse events is a war criminal,” he continues. “That’s not rhetoric. It’s not opinion. It’s fact.”", "Except that it’s not fact. People receiving the authorized vaccines are not participating in clinical trials. And because it’s not research, the Nuremberg Code has no bearing on anything — even though ethically, everything is still above board. No one is in danger of being a war criminal.", "Holly Fernandez Lynch, an assistant professor of medical ethics at the University of Pennsylvania’s Perelman School of Medicine told us the claims were “ridiculous.”", "The Nuremberg Code, as we’ve explained before, is a code of research ethics created in the wake of the Nazis’ horrific treatment of human subjects in experiments during the Holocaust. One of its primary principles is that individuals participating in research should do so voluntarily and with adequate information about the experiment to make an informed decision.", "Fernandez Lynch confirmed that Nuremberg only pertains to research and would have nothing to do with any COVID-19 vaccines given outside of a trial. But even if it did, the claim is bogus.", "“People are consenting to get the vaccine,” she said. So even if Nuremberg was applicable here, “it’s not non-consensual. And no information is being hidden. It’s all very front and center.”", "In the U.S., the FDA, for example, provides fact sheets for vaccine recipients that clearly state the findings of the clinical trials — including the potential risks and benefits — and a description of an emergency use authorization. An EUA is a bit different than full FDA approval, although the agency required a high level of evidence from a large, phase 3 randomized controlled trial.", "Fernandez Lynch acknowledged, as the FDA does, that not everything is known about the vaccine, but noted that no one was being forced to be vaccinated and that there was full transparency.", "“We ideally would be able to watch for longer to gather more safety information about these products, but we have to make tradeoffs when we’re in the middle of a pandemic,” she said. “And each individual person is going to have to decide whether those tradeoffs are acceptable to them.”", "As our colleagues at Reuters have written, people in the U.K. give informed consent to be vaccinated, as outlined in the country’s Green Book. The consent forms for the COVID-19 vaccines are available on the government’s website.", "In making his argument, Coleman focuses on the fact that the COVID-19 trials are still ongoing, referring viewers to the U.S. government’s clinical trial registration page for the Pfizer/BioNTech vaccine, which says the completion date for the trial is nearly two years away, on Jan. 31, 2023.", "That’s true, but misleading. The trial won’t technically end until it follows participants for two years, but that neglects the reality that the main trial results are already available and have demonstrated the vaccine’s basic safety and efficacy in tens of thousands of individuals.", "Based on that phase 3 trial information, which is publicly available and has been reviewed by multiple panels of experts, the U.S. and U.K. governments concluded the benefits outweigh the potential risks and decided to authorize the vaccine for emergency use. People getting the vaccines now are not trial participants.", "Coleman also suggests that the U.K. government’s efforts to monitor people who are vaccinated is somehow suspicious.", "“They advertise for special software so that they could keep track of the high number of adverse events they were expecting — for two years,” he says.", "That, too, is misleading. The government is not necessarily expecting adverse events, but does want to be able to detect them if they occur. This is standard practice after the release of a new vaccine and the U.S. has similar efforts underway.", "As we’ve explained before, these vaccine safety monitoring systems are important because while large phase 3 trials can show that there are no common safety concerns, rare events might only be observed once the vaccine is given to millions of people.", "A prevailing theme throughout Coleman’s video is the baseless idea that the available COVID-19 vaccines are dangerous to large numbers of people.", "“Thousands of people who’ve had the vaccine have died or been seriously injured by it,” he says. “That’s an undeniable fact. Elderly people in care homes are dying in huge numbers. We’re told it’s the infection, but it’s not, of course, it’s the damned vaccine they’re being given.”", "Coleman later claims there is a “horrifying avalanche of evidence showing that these damned vaccines are killing and maiming people” and says, “This is genocide.”", "As his supposed proof, Coleman rattles off headlines from dubious websites proclaiming that people have died, without mentioning that the deaths have not been shown to be caused by the vaccine — and very likely are completely coincidental.", "For example, Coleman cites an article from Health Impact News, a website known for spreading misinformation about vaccines, that misleadingly claims “181 Dead in the U.S. During 2 Week Period From Experimental COVID Injections.” The number comes from the Vaccine Adverse Event Reporting System, which as we’ve written before, does not imply that the vaccine was necessarily responsible. Anyone can report through an online form and there is no vetting of the report.", "In another case, Coleman reads off a headline from another vaccine misinformation website about a man and woman in South Dakota dying a day after getting a vaccine. But he doesn’t mention that the state’s department of health concluded that immunization didn’t contribute to those deaths.", "There is no evidence that authorized COVID-19 vaccines are harming people on any kind of wide scale. While many people have the expected sore arms or temporary flu-like symptoms following vaccination, serious side effects are uncommon.", "A review of the vaccine safety monitoring data in the U.K. through the end of January found that the “overall safety experience” with the Oxford/AstraZeneca and Pfizer/BioNTech COVID-19 vaccines “is so far as expected from the clinical trials,” with the expected benefits “far outweigh[ing] any currently known side effects.”", "According to the report, severe allergic reactions occurred in a small number of people, but these are very rare and have not resulted in death.", "In the U.S., the vaccine safety monitoring data also is very encouraging. Dr. Paul Offit said in a Feb. 11 interview with JAMA that a recent review by the CDC’s Advisory Committee on Immunization Practices had not revealed any safety signals from the two authorized COVID-19 vaccines.", "One potential issue raised by the trials was that the vaccines might very occasionally trigger a usually temporary form of facial paralysis known as Bell’s Palsy. But so far, Offit said, there’s no sign that the condition is any more likely in people who get vaccinated. Data from the U.K. also support that finding.", "According to a paper the CDC published in JAMA Insights, cases of anaphylaxis, a potentially life-threatening allergic reaction, following the vaccines in the U.S. are also very unusual  — 2.5 cases per million doses of the Moderna vaccine and 4.7 cases per million of the Pfizer/BioNTech vaccine, as of Jan. 18.", "Officials in the U.S. are investigating a few instances of thrombocytopenia, or a lack of blood-clotting platelets, following vaccination, including one death. But it is still unknown whether that type of reaction can be due to COVID-19 vaccination. Even if it is, it would be an extremely rare event and experts say it would pose less risk than the chance of getting COVID-19 and suffering severe health consequences.", "Update, May 14: After investigating 15 cases of a rare clotting condition out of nearly 8 million Johnson & Johnson vaccinations, the CDC and Food and Drug Administration are warning of a suggested increased risk of the dangerous condition, which occurred in women and resulted in three deaths as of April 21. The CDC says “women younger than 50 years old especially should be aware of the rare risk of blood clots with low platelets after vaccination, and that other COVID-19 vaccines are available where this risk has not been seen.” As of May 11, 28 cases had been identified out of more than 9 million J&J vaccines administered. For more, see “Q&A on the Rare Clotting Events That Caused the J&J Pause.”", "It’s true, of course, that people have died after receiving a vaccine — but this doesn’t mean the vaccine is to blame for the deaths. Every day, around 8,000 people in the U.S. die from a variety of causes. And as the University of California, San Francisco’s department of medicine chair Dr. Robert Wachter has pointed out, if 10 million people are vaccinated, in the following two months you’d expect 4,025 of those people to have a heart attack, 3,975 to have a stroke and 14,000 to die. “And the vaccines will have zero to do with any of them,” he wrote.", "“There are always going to be these temporal associations, and you read about them in the newspaper,” said Offit. “But at least right now, those temporal associations have not been found to be causal associations.”", "This is especially the case when vaccines are being given to older people who may not be in good health.", "“Older age and chronic underlying illnesses make it more likely that coincidental adverse events will occur, especially given the millions of people vaccinated,” the U.K.’s Medicines and Healthcare Products Regulatory Agency explains in its report. “It is therefore important that we carefully review these reports to distinguish possible side effects from illness that would have occurred irrespective of vaccination.”", "Throughout the video, Coleman makes a series of other false claims, including the long-debunked notion that COVID-19 “has been proved to be no more dangerous than the annual flu.” That’s wrong.", "While scientists are still trying to pin down how deadly COVID-19 is, studies estimate that between 0.5% and 1.0% of people who are infected with the coronavirus will die — much more than influenza’s usually well below 0.1% mortality rate, as we’ve written.", "And the sheer number of deaths from COVID-19 far outstrip those for influenza. As of Feb. 11, more than 470,000 Americans have died from COVID-19, according to the CDC. That’s more than the estimated number of flu deaths from the past 10 flu seasons combined — and more than 20 times the number of deaths estimated to have occurred during the 2019-2020 flu season.", "Coleman also cites statements from the World Health Organization to undermine and distort the facts on the efficacy of COVID-19 vaccines.", "“The fact is that even the World Health Organization only expects these vaccines to help reduce the extent of the symptoms,” he says. “They’re not promising that the vaccine will stop people getting COVID-19 and they’re not expecting the vaccine to stop people spreading the infection if they do get it.”", "No one can promise that a vaccine will prevent disease in all people, as no vaccine is 100% effective. But data from the trials for the Pfizer/BioNTech and Moderna vaccines, for example, found that vaccinated people were 94% or 95% less likely to develop symptoms of COVID-19 than those who were unvaccinated.", "It’s true that the vaccines may not prevent infection with the SARS-CoV-2 virus, as the trials were primarily designed to show that the vaccines kept people from falling ill with COVID-19, the disease caused by the virus. (See our video on the distinction between virus and disease.)", "But it’s incorrect to say that the WHO is not expecting the vaccines to do anything for transmission. On webpages dedicated to the Moderna and Oxford/AstraZeneca vaccines, the agency simply says that there isn’t data or that it’s not known yet if vaccination will protect against onward transmission. The WHO has also said the same more broadly in press briefings.", "In fact, many scientists do expect COVID-19 vaccines to keep people from spreading the virus to at least some degree. That’s because it’s likely an infected but mildly ill or asymptomatic person would shed less virus and therefore be less contagious than a sicker unvaccinated person. But because this has not been demonstrated or known to what degree viral spread might be halted, public health officials have been upfront that it’s possible the vaccines may only prevent disease.", "Editor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over our editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.", "General Medical Council search for Vernon Edward Coleman. GMC reference no: 6121681. Accessed 12 Feb 2021.", "Long, Katherine Khashimova. “Amazon algorithms promote vaccine misinformation, UW study says.” Seattle Times. 28 Jan 2021.", "“Fact check: Video contains false claims about COVID-19 vaccine.” Reuters. 10 Dec 2020.", "“Moderna vaccine becomes third COVID-19 vaccine approved by UK regulator.” Press release. Medicines and Healthcare products Regulatory Agency. 8 Jan 2021.", "“AstraZeneca’s COVID-19 vaccine authorised for emergency supply in the UK.” Press release. AstraZeneca. 30 Dec 2020.", "“Pfizer-BioNTech COVID-19 Vaccine.” FDA. Accessed 12 Feb 2021.", "“Moderna COVID-19 Vaccine.” FDA. Accessed 12 Feb 2021.", "Fernandez Lynch, Holly. Assistant Professor of Medical Ethics, Department of Medical Ethics and Health Policy, Perelman School of Medicine, University of Pennsylvania. Phone interview with FactCheck.org. 10 Feb 2021.", "Spencer, Saranac Hale. “Nuremberg Code Addresses Experimentation, Not Vaccines.” FactCheck.org. 8 Jun 2020.", "McDonald, Jessica. “Q&A on COVID-19 Vaccines.” FactCheck.org. 18 Dec 2020, updated 29 Jan 2021.", "“Fact check: Staff administering COVID-19 vaccines are not war criminals.” Reuters. 4 Feb 2021.", "“COVID-19 vaccination: consent form and letter for adults.” Public Health England. 8 Dec 2020, updated 21 Jan 2021.", "“Study to Describe the Safety, Tolerability, Immunogenicity, and Efficacy of RNA Vaccine Candidates Against COVID-19 in Healthy Individuals.” ClinicalTrials.gov. NCT04368728. Accessed 12 Feb 2021.", "“The Facts About Pfizer and BioNTech’s COVID-19 Vaccine.” Pfizer.com. 6 Jan 2021.", "“Regulatory approval of Pfizer/BioNTech vaccine for COVID-19.” Medicines and Healthcare products Regulatory Agency. 2 Dec 2020, updated 28 Jan 2021.", "“COVID-19: vaccine surveillance strategy.” Public Health England. 11 Jan 2021.", "“COVID-19 vaccines: development, evaluation, approval and monitoring.” European Medicines Agency. Accessed 12 Feb 2021.", "“Ensuring the Safety of COVID-19 Vaccines in the United States.” CDC. Updated 28 Jan 2021.", "Kasprak, Alex. “Pinterest Removes Three Prominent “Natural Health” Pages for Peddling Health Misinformation.” Snopes.com. 18 Dec 2018.", "McDonald, Jessica. “Instagram Post Falsely Links Flu Vaccine to Polio.” FactCheck.org. 18 Oct 2019.", "Holland, Deb. “Vaccine not the cause of two South Dakota deaths.” Black Hills Pioneer. 21 Jan 2021.", "“Coronavirus vaccine – weekly summary of Yellow Card reporting.” Medicines & Healthcare products Regulatory Agency. Updated 11 Feb 2021.", "“Coronavirus Vaccine Update With Paul Offit.” JAMA Network YouTube video. 11 Feb 2021.", "Shimabukuro, Tom. “COVID-19 vaccine safety update.” Powerpoint slides for Advisory Committee on Immunization Practices meeting. 27 Jan 2021.", "Shimabukuro, Tom T. et al. “Reports of Anaphylaxis After Receipt of mRNA COVID-19 Vaccines in the US—December 14, 2020-January 18, 2021.” JAMA Insights. 12 Feb 2021.", "Grady, Denise. “A Few Covid Vaccine Recipients Developed a Rare Blood Disorder.” New York Times. 8 Feb 2021, updated 10 Feb 2021.", "“Idiopathic Thrombocytopenic Purpura.” Johns Hopkins Medicine. Accessed 12 Feb 2021.", "Pallarito, Karen. “A Small Number of People Developed This Rare Blood Disorder After Getting a COVID Vaccine—Here’s What to Know.” Health. 10 Feb 2021.", "Szabo, Liz. “Anti-Vaccine Activists Peddle Theories That Covid Shots Are Deadly, Undermining Vaccination.” KFF. 25 Jan 2021.", "“Daily number of coronavirus (COVID-19) deaths compared to influenza and all causes in the United States as of January 20, 2021.” Statista. Accessed 12 Feb 2021.", "Wachter, Robert (@Bob_Wachter). “13/ 3rd concern: misinformation. Below: if we vaccinate 10M Americans, how many will develop a serious illness in 2 months after they got their shots. Answer: many thousands (& I’ve only included 4 illnesses, plus death). And the vaccines will have zero to do with any of them.” Twitter. 1 Dec 2020.", "McDonald, Jessica et al. “Trump’s COVID-19 Misinformation Since Testing Positive.” FactCheck.org. 6 Oct 2020.", "“COVID Data Tracker.” CDC. Accessed 12 Feb 2020.", "“Past Seasons Estimated Influenza Disease Burden.” CDC. Last updated 1 Oct 2020.", "McDonald, Jessica. “Video Misinterprets Fauci’s Comments on COVID-19 Vaccine.” FactCheck.org. 26 Jan 2021.", "“The Moderna COVID-19 (mRNA-1273) vaccine: what you need to know.” WHO. 26 Jan 2021.", "“The Oxford/AstraZeneca COVID-19 vaccine: what you need to know.” WHO. 11 Feb 2021.", "“WHO Daily press conference on novel coronavirus.” WHO press briefing. 28 Dec 2020.", "McDonald, Jessica and Catalina Jaramillo. “Viral Video Makes False and Unsupported Claims About Vaccines.” FactCheck.org. 22 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]