["The video was shared in a Facebook post here on May 21, 2019.", "Below is a screenshot of the misleading Facebook post:", "The misleading post’s Sinhala language caption translates to English as: \"Keep eating from Muslim shops, even the big shots eat there.", "“There you go, keep eating from Thambi shops. This is where the big shots also eat from… Are you all content now, watching how the plates you eat from, being washed in dirty drainage water? Share for everyone to see...”", "“Thambi” is an ethnic slur for Muslims in Sri Lanka.", "The Sinhala language text on the video translates to English as: “Pilawoos located near the Chatham Street Sampath Bank, washes its plates in a dirty drain nearby.”", "“Pilawoos” refers to a restaurant in Colombo. It is listed here on TripAdvisor.", "The same video was also shared on Facebook here and on Twitter here with a similar claim.", "This claim is false; the video has circulated online since March 2018 in multiple reports about an Indian restaurant in Malaysia.", "A reverse image search on Google using keyframes of the 30 second video, found the same video posted on YouTube here on May 29, 2018.", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "Below is the video on YouTube:", "The YouTube video title and caption states: \"Workers at Raj Banana Leaf restaurant in Bangsar caught washing dishes with dirty water. The management of a top Indian banana leaf restaurant in Bangsar has apologised for the hygiene practised at its outlet after staff were filmed washing plates with dirty water.”", "The same video was used in this report by Malaysian news site The Star Online on May 30, 2018.", "Below is a screenshot of the report:", "The report states in part: “KUALA LUMPUR: An uproar sparked by a video showing the workers of a banana leaf rice restaurant in Bangsar washing dishes in a puddle of murky water has forced it to close its doors until further notice.”", "Raj’s Banana Leaf in Bangsar was closed due to hygiene concerns in May 2018, according to this report published by Malaysian news site The Malay Mail on May 30, 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]