["About this rating", "Readers responded with bemusement and skepticism in June 2019 after an \"Official 2020 Trump vs Democrat Poll\" emerged online and on social media, appearing to pose questions framed in a heavily anti-Democrat way.", "For example, one survey question asked, \"Who would you rather see fix our Nation's shattered immigration policies? President Trump // A MS-13 loving Democrat,\" while another somewhat tautological question asked: \"Who would you trust to NOT raise your taxes? President Trump // A High Tax Democrat.\"", "Such bias in the questions, as well as some clear nods to Trump's go-to insults against his political opponents (the poll referenced \"a Lyin' Democrat\" and \"a Low IQ Democrat\"), prompted inquiries from Snopes readers who were uncertain whether they were reading a parody or hoax or an official Trump 2020 campaign poll. One reader asked, \"Oh my gosh, is this really from the Trump campaign? Or some satire site?\" while another wrote, \"Is this for real? It sounds too crazy ...\"", "The survey was indeed published by Trump's official re-election campaign committee, on that campaign's official website. An archived version can be read here. The site on which it appeared, donaldjtrump.com, is run by two formally registered, pro-Trump committees and the Republican National Committee (RNC). The website contains the following disclaimer, which makes clear the official nature of the June 2019 survey and all other content featured on the site:", "\"Paid for by the Trump Make America Great Again Committee, a joint fundraising committee authorized by and composed of Donald J. Trump for President, Inc. and the Republican National Committee.\"", "The poll's true purpose may not have been to create a set of results that reflected in a misleadingly positive way on the president but rather to harvest contact information —  respondents were required to enter their name, zip code and email address in order to submit their answers.", "The full list of questions was as follows:", "The \"Trump vs Democrat\" poll bore similarities to another survey on the subject of \"mainstream media accountability,\" which Trump's website published in February 2017, and that included heavily slanted questions such as. \"Do you feel that the media is too eager to slur conservatives with baseless accusations of racism and sexism?\"", "DonaldJTrump.com.  \"Official 2020 Trump vs Democrat Poll.\"\r\n  June 2019.", "DonaldJTrump.com.  \"Mainstream Media Accountability Survey.\"\r\n  February 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]