["The notice falsely locating Anibe in Texas has recently been doing the rounds in Kenya, including this version posted on Facebook on March 1, 2019.", "When Anibe was kidnapped from her home in Abuja’s Gwarimpa district in December 2016, her parents reported her missing to authorities and the news was also shared on Facebook, via a December 12 post that was shared around 1,200 times.", "Forunately, just a day later on December 13, friends of the family put word out on Facebook that she had been found and thanking everyone who had helped with the search.", "But in 2017, new posts started appearing on social media, calling for prayers for Anibe and stating that she had gone missing in Texas. The earliest post we could find locating her there was found on a US website called Not in My World, dedicated to fighting child abuse.", "The post, uploaded on May 7, 2017, claimed that “someone rang the doorbell and Anibe answered the door and was taken”. It called on “Veterans, Active Service Members, Fathers, Brothers, Explorers, Boy Scouts, Hunters, Fishermen, Scuba Divers” to work together with “Law Enforcement and reunite this Dear Family”.", "A few days later Cherokee Simpson also shared the same post to her contacts via her Google+ account, asking them to “Please HELP! FORWARD TO AS MANY PEOPLE AS YOU CAN. All it takes is a minute to care. We can find her with social media!!!”. Her post was shared 109 times.", "As you can see, it’s the same image that is currently doing the rounds in Kenya. It’s been shared on a range of social networks since 2017, including Instagram and Pinterest.", "Pleas for information about Anibe also continued to circulate in Nigeria months after she was found. The Twitter account Giditraffic, which provides Nigerian road traffic updates and other information, shared a post in February 2017 reporting that she had been kidnapped “last night”. Several Twitter users pointed out in replies to the post to Giditraffic, which currently has 1.63 million followers, that the information was out of date.", "Several months later, in September 2017, columnist Sonnie Ekwowusi wrote in the influential newspaper THISDAY that he got the message on WhatsApp and “to this day, nobody, including her parents, could account for her whereabouts”. As per the Facebook update on December 13, 2016 announcing that she was safe, this was not true.", "AFP was able to contact Anibe’s father, who identified himself simply as Mr. Odoma. Reached by telephone on March 7, 2019, he confirmed that his daughter is now “fine and safe”.", "“This happened since 2016, but you know this social media thing keeps going. I don’t know what people are talking about now, I have not come across it recently,” he said.", "You’ll notice that the text on the posts falsely locating Anibe in Texas include the words “forwarded as received”.", "This is one of the fastest ways in which misinformation spreads in Nigeria, among other places.", "By adding these words, the sender is trying to say: “I didn’t write this, I’m just passing on a message. I don’t have any responsibility for this information.”", "Before you share any message marked “Forwarded as received”, ask yourself the following questions:", "​​1. What is the original source of this information?", "2. What is the interest of the sender?", "3. Can it be confirmed by credible media?", "4. How long has this information been in circulation?", "5. Is there an update anywhere?", "An online search for key words in the post is a good place to start. In the case of little Anibe, a simple search for “Anibe Alexandra Odoma” quickly reveals that fact-checking website Snopes had ruled out any link to Houston back when the posts first started spreading in 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]