["By Saranac Hale Spencer", "Posted on June 8, 2020 | Updated on May 17, 2021", "A bogus claim that “[v]accines are in direct violation of The Nuremberg Code” has been circulating on social media. Actually, the Nuremberg Code addresses the treatment of human subjects in medical experiments and says nothing about the use of tested and authorized vaccines on patients.", "The code of medical ethics created in response to Nazi experiments during the Holocaust has been misrepresented by those pushing an anti-vaccine message during the COVID-19 pandemic.", "This is just the latest example of a falsehood aimed at discrediting vaccines during the outbreak of the novel coronavirus, or SARS-CoV-2. Since April, we’ve debunked at least three other claims aimed at the same thing.", "Now, Facebook pages dedicated to conspiracy theories and the anti-vaccine movement are posting claims that say, in part: “Vaccines are in direct violation of The Nuremberg Code.”", "That’s not true.", "The Nuremberg Code was written in 1947 during the trial in Nuremberg, Germany, of doctors who conducted medical experiments on more than 7,000 concentration camp prisoners during World War II. They tested ways to improve the chances of survival for Nazi soldiers in the field. They tested medical procedures and drugs. They conducted experiments to support their ideological view of racial superiority.", "All of these experiments were done without the consent of the subjects.", "That’s what the Nuremberg Code addressed — the treatment of human subjects in medical experiments.", "“It’s about human experiments,” Jonathan Moreno, a medical ethics professor at the University of Pennsylvania, said of the Nuremberg Code in an email to FactCheck.org, emphasizing that the claim is false.", "The code says nothing about the use of tested and authorized vaccines or treatments on patients.", "“The purpose of the code was to say that what the Nazi doctors did would never happen again,” George Annas, director of the Center for Health Law, Ethics & Human Rights at Boston University School of Public Health, said in an interview with FactCheck.org.", "Both Moreno and Annas said that the code could not be interpreted to bar vaccination.", "The basis for this claim goes back much further than the pandemic, though. As is often the case with false claims like this, it appears to have evolved from a more vague suggestion made years ago.", "In the 1990s, a prominent vaccine critic, Barbara Loe Fisher, cited one of the core principles stated in the Nuremberg Code — informed consent — to support her argument that parents should have more freedom to choose whether or not to vaccinate their children. All 50 states require children to be vaccinated in order to start school, according to the National Conference of State Legislatures. All 50 states also have medical exemptions, while 45 states and the District of Columbia offer religious exemptions.", "But Loe Fisher appears to have mixed up two different lineages of informed consent — the one that applies to subjects of medical experimentation (as in the case of the Nuremberg Code) and the one that applies to patients in a regular health care setting (as in the case of vaccines).", "In a television appearance in 1997, Loe Fisher said: “Informed consent has been the gold standard in medical practice ever since the Nuremberg Codes were passed after World War II. There should be no exception for vaccination.”", "The website for her organization — the National Vaccine Information Center, which we’ve written about before — has a post that acknowledges that the code “speaks most specifically to the use of human beings in medical research.” But it goes on to claim that the code “has been viewed by bioethicists and U.S. courts as the basis for the right to informed consent to medical procedures carrying a risk of injury or death.”", "That’s not true.", "The Nuremberg Code has “only been used by courts in the human experimentation context,” Annas told us. And the principle of informed consent in the regular doctor-patient relationship, outside of medical experimentation, doesn’t come from the Nuremberg Code, he said. That developed separately.", "The concept of informed consent in medical research grew largely out of unethical research projects conducted in the early 20th century, including the experiments during the Holocaust and the syphilis study done on black men without their consent in Tuskegee, Alabama, according to a paper from the Presidential Commission for the Study of Bioethical Issues, which distinguishes between the idea of informed consent for medical research and regular treatment.", "The concept of informed consent in the health care setting, however, “developed from the intentional tort of battery, which protects individuals from an unwanted physical touching of the body by others having neither express nor implied consent of the person touched,” according to a paper published in the Mayo Clinic’s peer-reviewed journal.", "In support of the bogus claim that the Nuremberg Code would apply to the use of vaccines, the National Vaccine Information Center’s post includes out-of-context quotes from two bioethicists.", "One of them, Arthur Caplan, a professor of bioethics at New York University, told us in an email that the use of a quote from his 1992 article is “[c]ompletely erroneous” and is a “[f]lat out Reflection of both ignorance of history and ethics.”", "It is “a gross disservice to the victims of brutal Nazi experiments to distort my words for lame anti-science that will kill people if this bilge is taken seriously,” Caplan said.", "Jay Katz, the other professor whose work was cited by the National Vaccine Information Center, died in 2008. But his article was about the informed consent of human subjects in medical research. It had nothing to do with vaccines or informed consent among ordinary patients.", "We asked the National Vaccine Information Center about the claims in its post, but it responded with the same information given on its website.", "Despite the dubious claims it makes, the National Vaccine Information Center’s post is still being shared on social media and has been used to support other, related falsehoods about vaccines over the years.", "As we’ve explained, the Nuremberg Code says nothing about the use of already tested and authorized medicine or prevention, like vaccines. The full text is below:", "1. The voluntary consent of the human subject is absolutely essential.", "This means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision. This latter element requires that before the acceptance of an affirmative decision by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is to be conducted; all inconveniences and hazards reasonable to be expected; and the effects upon his health or person which may possibly come from his participation in the experiment.", "The duty and responsibility for ascertaining the quality of the consent rests upon each individual who initiates, directs or engages in the experiment. It is a personal duty and responsibility which may not be delegated to another with impunity.", "2. The experiment should be such as to yield fruitful results for the good of society, unprocurable by other methods or means of study, and not random and unnecessary in nature.", "3. The experiment should be so designed and based on the results of animal experimentation and a knowledge of the natural history of the disease or other problem under study that the anticipated results will justify the performance of the experiment.", "4. The experiment should be so conducted as to avoid all unnecessary physical and mental suffering and injury.", "5. No experiment should be conducted where there is an a priori reason to believe that death or disabling injury will occur; except, perhaps, in those experiments where the experimental physicians also serve as subjects.", "6. The degree of risk to be taken should never exceed that determined by the humanitarian importance of the problem to be solved by the experiment.", "7. Proper preparations should be made and adequate facilities provided to protect the experimental subject against even remote possibilities of injury, disability, or death.", "8. The experiment should be conducted only by scientifically qualified persons. The highest degree of skill and care should be required through all stages of the experiment of those who conduct or engage in the experiment.", "9. During the course of the experiment the human subject should be at liberty to bring the experiment to an end if he has reached the physical or mental state where continuation of the experiment seems to him to be impossible.", "10. During the course of the experiment the scientist in charge must be prepared to terminate the experiment at any stage, if he has probable cause to believe, in the exercise of the good faith, superior skill and careful judgment required of him that a continuation of the experiment is likely to result in injury, disability, or death to the experimental subject.", "Update, May 17: After this story was written, the Food and Drug Administration gave emergency use authorization to three COVID-19 vaccines – a review process that is typically less stringent than full licensure. We changed the wording in this story to refer to vaccines as authorized, not approved, to avoid confusion. We thank the reader who brought this to our attention.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Sources", "Fichera, Angelo. “No Evidence That Flu Shot Increases Risk of COVID-19.” FactCheck.org. 27 Apr 2020.", "Hale Spencer, Saranac. “Conspiracy Theory Misinterprets Goals of Gates Foundation.” FactCheck.org. 14 Apr 2020.", "Fichera, Angelo. “False Claim of Deadly Coronavirus Vaccine Trial in Africa.” FactCheck.org. 10 Apr 2020.", "Nuremberg Code. Lillian Goldman Law Library, Yale Law School. Accessed 4 Jun 2020.", "United States Holocaust Memorial Museum. “The Doctors Trial: The Medical Case of the Subsequent Nuremberg Proceedings.” Accessed 4 Jun 2020.", "Moreno, Jonathan. Medical ethics professor, University of Pennsylvania. Email exchange with FactCheck.org. 3 Jun 2020.", "Annas, George. Director, Center for Health Law, Ethics & Human Rights at Boston University School of Public Health. Telephone interview and email exchange with FactCheck.org. 4 Jun 2020.", "Skinner, Erik. “State Vaccination Policies: Requirements and Exemptions for Entering School.” National Conference of State Legislatures. Dec 2017.", "NVICstandup. “Barbara Loe Fisher and Neil Halsey M D debate.” YouTube. Posted 28 Jan 2009.", "Presidential Commission for the Study of Bioethical Issues. Informed Consent Background. 30 Sep 2016.", "Paterick, Timothy, et al. ” Medical Informed Consent: General Considerations for Physicians.” Mayo Clinic Proceedings. Mar 2008.", "Caplan, Arthur. Bioethics professor, New York University. Email exchange with FactCheck.org. 4 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]