["A new television ad taking aim at U.S. Rep. Eric Cantor’s position on Social Security gives us a sense of deja vu.\n\nThe Campaign for America’s Future, a liberal advocacy group, has aired the television ad this month in Cantor’s 7th District saying the congressman is a threat to the retirement dreams of Americans younger than 55.\n\n\"Congressman Eric Cantor wants to eliminate Social Security,\" the narrator intones in the 31-second spot, based on a comment the majority leader made in a March 21 appearance before the conservative Hoover Institution.\n\nThe ad supports the claim with an audio snippet of Cantor’s response to a question from the audience. Speaking about entitlement programs such as Social Security, Cantor said it’s important to protect benefits for those 55 and older.\n\n\"But for the rest of us, listen, we’re going to have to come to grips with the fact that these programs cannot exist if we want America to be what we want America to be,\" Cantor said.\n\nIn recent weeks, scads of liberal politicians, organizations and bloggers have been pouncing on the same statement to argue it’s evidence the GOP is showing its true intentions to end Social Security.\n\nOne of groups, Americans United for Change, used the comment to argue Cantor wanted to eliminate Social Security and Medicare.\n\nIn an April 1 Truth-O-Meter, PolitiFact national rated that claim False, pointing out that in other public appearances Cantor has called for changing, not abolishing entitlement programs like Social Security.\n\nSeconds after making the Hoover statement that sparked the frenzy, Cantor added:\n\n\"We’re going to have to accept some changes as far as the rest of us, and what we’re saying is for those 55 and older (they) do not have to worry about changes in benefits, but for the rest of us we will,\" Cantor said.\n\nThere are other statements showing Cantor envisions a future with Social Security:\n\n*In a Feb. 19 op-ed in Politico, he said the country’s entitlement programs \"will not be available for our children unless they are modernized and reformed.\"\n\n*In a March 16 interview with CNBC, he said, \"If you look at these entitlement programs, what we’ve got to admit to ourselves is they’re not going to be around in their current state unless we significantly alter who we are as a country.\" He said that for workers 54 and younger, Republicans were going to insist on dealing \"with the fact that if these programs are going to be around, they’re going to have to look a lot different.\"\n\n*In the April 13 Richmond Times-Dispatch, Cantor again said if programs like Social Security are to remain viable, they must change for those under 55. \"We want them to be around because we care about those who need our help,\" Cantor said. \"We want a safety net in place that actually is there for people who need it, not for those who don’t.\"\n\nRobert L. Borosage, the co-director of the Campaign for America’s Future, sent us an email insisting Cantor does want to end Social Security and saying his comment at Hoover isn’t the only proof.\n\nBorosage sent us a link to a portion of an April 10 appearance Cantor made on Fox News Sunday. While talking about the Republican 2012 budget plan and entitlements, Cantor said \"I know those programs are not going to be there for me when I retire, just like everyone else 54 and younger. They can’t. We can’t sustain that kind of trajectory.\"\n\nBut a review of the full interview on Fox showed that as Cantor talked about the House GOP 2012 budget, he also said Republicans are \"talking about changing the way that the entitlements work in this country for the future while protecting today’s seniors.\"\n\nCantor has been short on specifics about how he would reform Social Security.\n\nLet’s recap:\n\nThe Campaign for America’s Future used part of a comment Cantor made at the Hoover Institution to argue the congressman wants to eliminate Social Security for those under 55..\n\nBut Cantor had a made a number of statements, previous to the ad, which show that is not his position. The Majority Leader has said the program must be changed  to remain viable, not eliminated, even though he has been short on specifics about how he would reform Social Security.\n\nIt would have been easy for the Campaign for America’s Future to find those statements before they ran the ad. Instead, they cherry-picked a Cantor comment and gave it no context. We rate their statement Pants on Fire.", "Campaign for America’s Future news release, April 8, 2011.\n\nCampaign for America’s Future advertisement, accessed April 1, 2011.\n\nPolitiFact, \"Americans United for Change says Eric Cantor wants to abolish Social Security,\"  April 1, 2011.\n\nTalking Points Memo, \"Dems Inaccurately Attack Cantor for Calling for Elimination of Social Secuirty,\" March 31, 2011.\n\nInterview with Liz Rose, spokeswoman with the Campaign for America’s future,  April 11, 2011.\n\nE-mail from Robert L. Borosage, co-director of the Campaign for America’s Future, April 11, 2011.\n\nInterview with Robert L. Borosage, April 12, 2011.\n\nEric Cantor’s appearance on Fox News Sunday, April 10, 2011.\n\nEric Cantor’s appearance at the Hoover Institution, March 21, 2011.\n\nYouTube video of Eric Cantor’s appearance on CNBC , March 19, 2011.\n\nEric Cantor’s House website, accessed, April 11, 2011.\n\nPolitico Op-Ed by Eric Cantor, \"Mr. President, We can’t do it alone,\" Feb. 19, 2011.\n\nE-mail from Ray Allen, Jr., Cantor’s campaign spokesman, April 13, 2011.\n\nRichmond Times-Dispatch, \"Cantor says he’s eager to hear Obama views on entitlements,\"  April 13, 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]