["About this rating", "A Pennsylvania resident indeed received two ballots in the mail in 2020 — in fact, a group of residents did due to a computer glitch that caused an error during the ballot printing process.", "However, anyone who received two ballots would not be able to vote twice because the ballots would have identical scanning codes. Only one vote per scan is counted. Any subsequent votes with the same scanning code are rejected by the county.", "In the months before the 2020 U.S. presidential election between President Donald Trump and Democratic rival Joe Biden, an image allegedly showing two mail-in ballots for one Pennsylvania resident circulated online among social media users who deemed it photographic evidence of the vote-by-mail system's susceptibility to fraud.", "Their underlying notion was this: Two ballots for one American could easily allow that person to vote twice in an election, breaking one of the core principles of democracy.", "The image, which appeared too blurry to distinguish the wording on the alleged ballots, was paired with the caption: \"Two mail in ballots in PA sent to the same person with their names on both a week and a half apart. FB keeps deleting this. Make it go viral.\"", "More than 25,000 Facebook accounts shared a variation of the meme with the added comment — \"These are not ballot applications! They are actual ballots! — since May 27, 2020.", "Although no evidence proved or debunked the allegation that the papers depicted in the image were indeed official mail-in ballots and only one resident's name was listed on both, we can summarize the main claim of the phenomenon to be this: One Pennsylvania resident received two mail-in ballots that could be used in an upcoming election.", "The viral posting did not make clear where in the state the alleged mailing error occurred. However, we found evidence that showed Pittsburgh's Allegheny County had indeed sent some residents multiple mail-in ballots in spring 2020 before the state's June 2, 2020, primary election.", "According to a May 14 news release from the county, the state's computerized registry for addressing and mailing ballots to eligible voters experienced a glitch that caused \"the printing of duplicate labels for mail-in and absentee ballots.\" The release stated:", "When there is a large volume of labels processed and printed, the ... system is timing out (meaning that the state server is no longer replying or fulfilling the data request). An error message pops up and, when acknowledged, the queue clears indicating that the labels are being sent to print. All of the labels are printing, but at some point, the system moves the records that were in the queue when the system timed out back into the queue resulting in the labels being printed a second time.", "In other words, at some point while printing mailing labels for ballots in the primary election, the system paused and presented an error message that resulted in the queue of labels to appear empty. But even though the queue looked clear, the labels were in fact printing, so when the system restarted again and resumed where it had left off, some labels printed twice.", "The news release said the county was in the process of notifying residents affected by the error and asking them to destroy the duplicated ballots, though it did not say how many people were in that group of voters. It also said the county was going to start printing labels in smaller batches to avoid the error in the future.", "To recap, like the claim stated, a Pennsylvania resident had indeed received two mail-in ballots in 2020 — in fact, a group of them did. (The issue was cited in a June 29, 2020, lawsuit on behalf of Trump's re-election campaign against Pennsylvania elections officials, alleging that they have created a voting system that invites fraud.)", "Less affirmative, however, was whether those duplicate ballots could both be used in an upcoming election. The Allegheny County news release stated:", "Even if a person receives multiple ballots, only one return ballot can be counted. This is because the barcode on the label that is being used for tracking is exactly the same. When voted ballots are returned to the office, they are scanned. If another ballot was returned from that same voter, it would show as a duplicate vote when scanned and would be rejected by the system.", "That meant each of the duplicate ballot labels not only had the same voter listed as a recipient but also the exact same scanning code. So if somebody tried to vote twice by filling out the extra ballot, elections officials would notice when they scanned the second vote for tallying. \"Staff would mark the ballot as rejected. Those ballots are kept but are not sent to the warehouse to be counted or opened,\" the release stated.", "In sum, we rate this claim a \"Mixture\" of truth and fallacy; it was true to state at least one Pennsylvania resident received two mail-in ballots in 2020, though it was erroneous to claim that that person would be able to vote twice in one election due to a ballot-tracking system that uses one scan code for each voter.", "Allegheny County.  \"Elections Division Statement on State SURE System Issue Impacting Count.\"\r\n    14 May 2020.", "Civil Action.  \"In the United States District Court For The Western District Of Pennsylvania.\"\r\n    Accessed 6 August 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]