["“BJP ministers and MPs donate for Kerala, don’t say that you have not received anything (translated),” reads a post shared by one Sreekumar Sreedharannair on Facebook. The caption is accompanied with an image of Kerala Chief Minister Pinarayi Vijayan accepting a Rs 25 crore cheque. He is surrounded by several people, including BJP MP V. Muraleedharan and Alphons Kannanthanam, Union Minister of State (Independent Charge) for Tourism. The post has been shared over 10,000 times.", "മുഖ്യമന്ത്രിയുടെദുരിതാശ്വാസ നിധിയിലേക്ക് BJP കേന്ദ്ര മന്ത്രിമാരും MP മാരും സംഭാവന കൊടുക്കുന്നു ഇനി കിട്ടിയില്ല എന്നു മാത്രം പറയരുത്", "Posted by Sreekumar Sreedharannair on Sunday, 26 August 2018", "A few individual users on social media have also circulated the image with the identical narrative of BJP ministers donating money to CM Vijayan toward Kerala flood relief.", "The Rs 25 crore cheque was not donated by BJP ministers, but central petroleum public sector companies on August 21. Since the cheque was presented to the Kerala CM by BJP MPs, they have been photographed together. This has assisted the narrative floating on social media that it is BJP MPs who have donated this sum to the flood-ravaged state.", "BJP MP Muraleedharan had tweeted that he “handed over the cheque on behalf of oil marketing companies.” The same was also tweeted by Hindustan Petroleum Corporation Limited.", "Sh. @alphonstourism Hon. MoS Tourism (I/C), handed over contribution cheque of Rs. 25 crore from Oil Marketing Companies in Kerala for Chief Minister’s Distress Relief Fund to Sh. @vijayanpinarayi @CMOKerala#KeralaFloodRelief #KeralaWeAreWithYou@dpradhanbjp @PetroleumMin pic.twitter.com/lU0IhzCZB5", "— Hindustan Petroleum Corporation Limited (@HPCL) August 21, 2018", "With Kerala reeling under devastating floods, a lot of misinformation related to relief work is circulating on social media, including a hoard of images and videos, often with the objective of political one-upmanship. It would be prudent to cross-check claims on social media with mainstream media reports.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]