["With the number of positive cases of the novel coronavirus in India exceeding 500 and hundreds of districts in the country in complete lockdown, there is a growing sense of fear among citizens at large. Globally, there are more than 3 lakh confirmed cases and close to 15,000 deaths. This has caused people to fall for a variety of misinformation floating online – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "A photograph of several people fallen on the road has been linked to COVID-19 and shared on social media. These images have been posted with texts in Telugu, Hindi and Bengali.", "A Facebook user posted the viral image with a Hindi text, “People are taking corona lightly but there aren’t people who can get up in Italy. (Translated from: लोगो को कोरोना मजाक लगता है देखे इटली में इसे उठाने वाला कोई नही.)” A user also tweeted the viral image along with a Telugu text, “Look what’s happening in Italy via this satellite image. Ignoring the requests of their prime minister, they went out. Now, the situation is such that their bodies can’t even be buried. Be careful. (Translated from ఇటలీ లో ఏం జరుగుతుందో శాటిలైట్ చిత్రం ద్వారా చూడండి పిట్టల రాలిపోయిన జనాలు చూడండి వారి ప్రధాని చెప్పిన మాట వినకుండా విచ్చలవిడిగా తిరిగిన దానికి కలిగిన ఫలితం కనీసం శవాలను పూడ్చి పెట్టడం కూడా సాధ్యం కాని పరిస్థితి … తస్మాన్ జాగ్రత్త.)”", "Alt News also received several requests asking us to check if the image is a satellite image from Italy on WhatsApp (+91 76000 11160) and on our official Android application.", "Fact-check", "In the first week of February, this viral image was circulated with the claim that it shows the repercussion of the coronavirus outbreak in China.", "Alt News’s report found that viral image was published on March 24, 2014, by Reuters. According to the caption, “People lay down in a pedestrian zone as part of an art project in remembrance of the 528 victims of the Katzbach Nazi concentration camp, in Frankfurt, March 24, 2014. The inmates of the Katzbach concentration camp, a part of the former Adler industrial factory, were forced into a death march to the concentration camps of Buchenwald and Dachau on March 24, 1945. Some 528 victims of Katzbach are buried at Frankfurt’s central cemetery.”", "The people are therefore lying on the road as part of an art project in remembers of the Katzbach Nazi concentration camp.", "Along with the viral image in the first claim, this Facebook page posted two other images. The second viral photo is a collage of three images which shows multiple coffins. The user wrote in Bengali, “Italy’s condition is very bad. If you use work as an excuse and unnecessarily step out of your house, keep this scenario in your mind. (Translated from খুবই করুণ পরিস্থিতি ইটালির কাজের দোহাই দিয়ে বাড়ি থেকে অকারনে বেরোনোর আগে এই দৃশ্যটা একটু মাথায় রাখবেন.)”", "Fact-check: Image 1 and 2", "Alt News performed a reverse image search on all the three images and found that the coffins are of African migrants who were killed in a shipwreck near Lampedusa, Italy on October 3, 2013.", "The first image was published in a 2013 report by The Guardian.", "The second image was carried in a 2014 report by International Business Times and the third image was carried in a 2013 report by The Star. According to a 2013 BBC report, at least 130 African migrants died after a boat carrying them to Europe sank off the southern Italian island of Lampedusa. The report added that most migrants were from Eritrea and Somalia.", "Fact-check: Image 3", "The third image posted by Bengali social media users is of a burial site surrounded by military and medical staff. It also shows several dead bodies being buried by medical staff dressed in a white coloured protective gear. After performing another reverse image search, we found that the viral image is a still is from the 2011 Hollywood film Contagion. It can also be viewed in the film’s official trailer at 2:19 mark. Several articles have been published which draw parallels about the global coronavirus pandemic crisis with the film.", "Thus, the social media claims associated with all the images are false. None of them is related to COVID-19.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…"]