["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "A video showing election workers collecting ballots from a drop box was widely circulated on social media in the days following Election Day, Nov. 3, 2020, along with claims that it showed some sort of nefarious activity. One posting, for instance, was accompanied by the text: \"I thought there was no evidence mail in voting was prone to fraud?\" Another posting was shared with the claim that \"Nicaragua and Senegal could do a better job at compromising the people’s trust in the electoral system. RIP USA.\"", "On Nov. 11, 2020, U.S. President Donald Trump shared the video to social media, writing: \"You are looking at BALLOTS! Is this what our Country has come to?\"", "This video does show election workers collecting ballots. However, this video was not taken on Nov. 11, and any insinuations that this video documents illegal or fraudulent activity are false.", "This video was taken on Nov. 4, 2020, in Los Angeles, California, and shows election workers collecting ballots that were delivered to a drop box the night before. This is in line with California law.", "California, like many states, accepts mail-in ballots as long as they are postmarked on or before Election Day. California residents can deliver mail-in ballots via a drop box, as shown in the above-displayed video, up until \"the close of polls at 8:00 p.m. on Election Day.\"", "Mike Sanchez, a spokesman for the L.A. County Registrar-Recorder/County Clerk (RR/CC) told Reuters:", "\"[These] are valid ballots and will be processed and counted in our Official Election Canvass ... All vote by mail ballot drop boxes were closed and locked at 8 PM on Election Day. Ballots from all boxes throughout the County were picked up the following day.\"", "While this viral video does not show the illegal collection of ballots (this video actually shows election workers picking up mail-in ballots that were delivered to a drop box the night prior), it does show ballots being collected after news outlets called the race in California. But, again, that is not indicative of fraud or illegal activity.", "The Associated Press explains that it called the race in California as soon as polls closed because data from early voting statistics confirmed that the longstanding blue state would remain blue in 2020.", "The Associated Press wrote:", "The AP declared Democrat Joe Biden the winner of California as soon as polls closed in the state, even though election officials there had yet to release any results from Tuesday’s presidential contest.", "The news agency did so after results from AP VoteCast and an analysis of early voting statistics confirmed expectations that the state’s longstanding political trend in favor of Democratic presidential candidates will hold.", "VoteCast, the AP’s wide-ranging survey of the American electorate, captures voters’ choices and why they made them.", "Hillary Clinton beat Trump in California by 30 percentage points in 2016, and a Republican presidential candidate hasn’t carried the state since George H.W. Bush in 1988.", "California is the most populous state in the U.S. and its 55 electoral votes make it the biggest Election Day prize.", "The Associated Press' projection certainly proved accurate. As of this writing, a week after Election Day, Joe Biden is leading in the state with 10,268,890 votes (or 64.3%), compared to Trump's 5,368,263 votes (33.6%).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]