["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is one of the billboards Pro-Life Wisconsin is using in Milwaukee", "Using 13 billboards in Milwaukee, Pro-Life Wisconsin says it wants to raise awareness of what it calls the disproportionate abortion rate among African-American women in Wisconsin.\n\nAccording to the organization, which works to outlaw abortion, the billboards appeared Nov. 29, 2010, and will stay up for 30 days. They feature one of two messages: \"Black children are in danger\" or \"Black & Beautiful.\" \n\nEach billboard shows a picture of an African-American infant and lists a website -- TooManyAborted.com/WI. That website, and an announcement about the billboards issued by Pro-Life Wisconsin, make the same claim:\n\nIn Wisconsin, \"6.2 percent of the population is black, yet 24 percent of all state abortions are on African-Americans.\"\n\nOn the face of it, that seems like a large disparity. And it suggests race is a determining factor in abortion rates.\n\nWe decided to take a look.\n\nPro-Life Wisconsin’s claim is based on figures cited by the Georgia-based Radiance Foundation, which is co-sponsoring the Milwaukee billboards. The foundation accurately cites U.S. Census figures on the percentage of Wisconsin’s population that is African-American, and the state’s annual abortion report on the percentage of Wisconsin abortions that are performed on African-American women.\n\nBut in doing so, it is setting up a false comparison.\n\nIt compares the number of abortions obtained by black women to the entire black population. Obviously, only females in a certain age range can become pregnant.\n\nNationally, the federal Centers for Disease Control and Prevention looks at abortions by comparing the number each year per 1,000 women ages 15 to 44.\n\nThe most recent CDC figures show the national rate abortion rate generally declined between 1997 and 2006. But the 2006 rate of 16.1 abortions per 1,000 women ages 15 to 44 was up 3.2 percent over the previous year.\n\nThe abortion rate for black women, meanwhile -- 33.4 abortions per 1,000 black women ages 15 to 44 -- was more than twice the overall rate.\n\nAbortion rates for black women have been higher for years, \"and have been attributed to high unintended pregnancy rates,\" according to the CDC.\n\nIn making its claim, Pro-Life Wisconsin is suggesting that race is somehow the determining factor in people seeking an abortion. Experts say there are many other factors at play.\n\nLike the CDC, Jacquelyn Paykel, an OB/GYN at the Medical College of Wisconsin, points to the higher unintended pregnancy rate among black women. She said unintended pregnancies tend tend to occur among women with less education, lower socioeconomic status and less access to reproductive health care.\n\nAnd those factors are more likely to be present among black women, she said.\n\nSo, the construction of the statement can lead to another false impression.\n\nNow, on to the Wisconsin figures, which are more current than the national ones.\n\nIn Wisconsin, the estimated overall abortion rate for 2009 was seven abortions per 1,000 women ages 15 to 44 -- less than half of what national figures have shown. The rate was the same in 2008, according to the state’s annual abortion report.\n\nThat report doesn’t provide statistics by race for the 15-to-44 age group. But we were able to make calculations, for 2009, using abortion and population statistics from the Wisconsin Department of Health Services:", "Using this approach, which focuses on child-bearing years, the disparity among black women isn’t quite as large as what Pro-Life Wisconsin stated.\n\nWe asked the group, which is based in the Milwaukee suburb of Brookfield, the purpose of the billboards. They are located mainly on Milwaukee’s north and northwest sides, the areas of the city where the largest numbers of African-Americans live.\n\nSpokeswoman Virginia Zignego said the organization wants to publicize the disparity in the abortion rate among black women and highlight abortion alternatives such as adoption. The website listed on the billboards, which is run by the Radiance Foundation, mentions adoption, but most of the material criticizes Planned Parenthood and other organizations.\n\nZignego said the campaign also aims to show that Planned Parenthood of Wisconsin is racist because it locates many of its facilities -- some of which perform abortions -- in areas with the heaviest concentrations of African-Americans.\n\nAmanda Harrington, spokeswoman for Planned Parenthood of Wisconsin, said its services are geared toward pregnancy prevention -- and its sites are in areas where women need access to health care.\n\nLet’s return to the claim itself.\n\nThe group accurately stated cited census and abortion numbers. But it used an approach that takes in the entire African-American population, not just women between age 15 and 44 -- the approach used by federal and Wisconsin authorities. By that measure, the actual disparity is smaller than what Pro-Life Wisconsin claimed.\n\nThe group’s claim also leaves out important details -- namely, that socioeconomic factors, rather than race, have been identified as key contributors to the higher abortion rate among black women.\n\nWe rate the statement Half True.", "Centers for Disease Control and Prevention, Abortion surveillance -- United States, 2006\n\nInterview with Pro-Life Wisconsin communications director Virginia Zignego, Dec. 1, 2010\n\nInterview with Radiance Foundation chief creative officer Ryan Bomberger, Dec. 1, 2010\n\nInterview with Jacquelyn Paykel, Medical College of Wisconsin, Dec. 2, 2010\n\nInterviews with Planned Parenthood of Wisconsin spokeswoman Amanda Harrington, Nov. 30 and Dec. 2, 2010\n\nPro-Life Wisconsin news release, Nov. 29, 2010\n\nPro-Life Wisconsin website, Who Are We page\n\nRadiance Foundation, TooManyAborted.com website, Wisconsin page\n\nReproductive Health Reality Check, African-American anti-abortion billboards come to Wisconsin? blog post, Nov. 30, 2010\n\nU.S. Census Bureau, Wisconsin quick facts\n\nWisconsin Department of Health Services, Reported induced terminations of pregnancy in Wisconsin 2009\n\nWisconsin Department of Health Services, Wisconsin Interactive Statistics on Health", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]