["On its daily show ‘Sau Baat Ki Ek Baat’, News18 India anchor Kishore Ajwani highlighted the ‘failure’ of the Imran Khan-led Pakistani government to control floods caused by heavy downpour in the country. During the 9:50 am broadcast on August 25, the channel aired footage of an area drowned in water to depict the calamitous situation in Pakistan’s Karachi. This can be watched from 18:10 minutes into the show.", "“After heavy rainfall in Pakistan’s Karachi, a video of a shocking stunt by a man became viral. He can be seen jumping off a four-storied building in the video and he pulled off this stunt to showcase the failure of Imran Khan’s government. The place where this incident took place experienced waist-deep flooding. The streets and lanes resembled a swimming pool hence the man jumped from a four-storied building into the water,” narrated Ajwani.", "While visuals of a man diving into floodwater were played, a ticker on the screen read, “पाकिस्तान सरकार की पोल खुली” which roughly translates to “Pakistan government exposed” in English.", "The same video was picked up by The Times of India on September 1 with the same claim that it’s from Karachi.", "A day after the show was aired, Twitter user Shahnawaz Ansari took to the micro-blogging platform to inform that News18 India ran a three-day-old video of his brother’s friend “Bhura Bhai” from Indore as Pakistan.", "ये 3 दिन पहले की इंदौर की वीडियो है, जिसमे मेरे जानने वाले भाई के एक दोस्त \"भूरा भाई\" बारिश के पानी छत कूदकर गोता लगा रहे हैं।", "देश की गोदी मीडिया NEWS18 इंडिया ने भूरा भाई की इस वीडियो को, कराची पाकिस्तान का बताकर न्यूज़ चला दी है।@RoflGandhi_ pic.twitter.com/y6Wo2JsW0z", "— Shahnawaz Ansari (@shanu_sab) August 26, 2020", "Alt News spoke with Ansari who connected us with Jafar, popularly known as “Bhura Bhai” in his locality. “That’s me in the video News18 aired as scenes from Pakistan. I had jumped into the water after we heard that a teenaged boy was drowning. But he was already rescued by the municipal corporation by the time I plunged into the water,” said Jafar. He also sent us the original footage of the clip aired by News18.", "The incident took place in Sikandrabad Colony and a mosque’s minaret is visible in both clips—the one aired by News18 (left) and the original sent by Jafar (right).", "Jafar informed that the mosque is Sikandrabad Masjid located in the same colony. The Google Maps screenshot below shows that the mosque is barely 50 metres from Sikandrabad Colony.", "The area floods almost every year during the monsoons as the Sirpur Lake, located about 5.5 km from the colony, overflows due to incessant rains. Jafar sent us another clip where he is diving into the water from a different building. He jumped a second time to show that the location is the same.", "News18 India, therefore, picked up a video from Madhya Pradesh and aired it claiming a man dived into floodwaters in Pakistan’s Karachi to send a message to PM Imran Khan for his ‘failure’ to tackle flooding in the country. The man had jumped into the water in Indore’s Sikandrabad Colony to save a drowning boy.", "[Update: On September 2, four days after this fact-check was published, The Times of India also carried the video claiming it’s from Pakistan.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]