["By Angelo Fichera", "Posted on August 25, 2020", "Facebook posts falsely claim that under Joe Biden, the “tax rate on a family making 75000 dollars would go from 12% to 25%.” Biden’s proposal does not call for a tax increase on those making less than $400,000, though analysts say an increased corporate tax rate could effectively result in a small tax increase for middle-income earners.", "Former Vice President Joe Biden has outlined a tax policy proposal that has been the subject of distortions before.", "A claim now circulating on Facebook is falsely telling users that, if the Democratic presidential nominee wins the election, the “tax rate on a family making 75000 dollars would go from 12% to 25%.”", "Currently, the 12% rate applies to individuals making between $9,875 and $40,125 — and married joint-filers earning between $19,750 and $80,250, according to the IRS. So the 12% rate does apply to a “family making 75000,” as the Facebook post suggests.", "But Biden’s plan does not call for a tax hike on those earners.", "As we’ve explained before, Biden’s tax plan includes provisions such as imposing a payroll tax on earnings over $400,000; increasing the top corporate tax rate from 21% to 28%; and restoring a top income tax rate of 39.6% for income above $400,000. It says nothing about raising the 12% bracket for individual taxpayers.", "That said, independent analyses do indicate Biden’s policies could effectively result in small tax raises on middle-income earners, assuming that employers pass a portion of the increased tax burden onto workers. But those estimates are nowhere near the magnitude alleged in the Facebook post.", "Kent Smetters, a professor of business economics and public policy at the University of Pennsylvania’s Wharton School, confirmed to us in an email that the Facebook post is wrong.", "Smetters is the faculty director of the Penn Wharton Budget Model, whose analysis of Biden’s plan estimated that households reporting $75,000 income would see an after-tax income reduction of 0.4% in 2021 — again, not as the result of a direct tax increase, but because of the increased corporate tax rate.", "The Tax Policy Center also estimated that households making $75,000 would see an average after-tax income reduction of 0.4% due to the corporate tax increase; the estimate assumes that 20% of the corporate tax increase would fall on workers.", "“In 2021, the proposals would increase taxes on average on all income groups, but the highest-income households would see substantially larger increases, both in dollar amounts and as a share of their incomes,” the center noted. “[Biden’s] plan would raise taxes on households in the top 1 percent of the income distribution (those with income more than $837,000) by an average of about $299,000, or 17.0 percent of after-tax income. By contrast, taxpayers in the middle-income quintile (those with income between about $52,000 and $93,000) would experience an average tax increase of just $260, or 0.4 percent of after-tax income. Taxpayers in the bottom quintile (those with income less than $26,000) would see an average tax increase of only $30, or 0.2 percent of after-tax income.”", "The center added that, “[i]n total, almost 93 percent of the tax increases would be borne by taxpayers in the top quintile of the income distribution.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Farley, Robert. “Trump Distorts Biden’s Tax Plan.” FactCheck.org. 13 May 2020.", "Huaqun, Li, et. al. “Details and Analysis of Former Vice President Biden’s Tax Proposals.” Tax Foundation. 29 Apr 2020.", "Mermin, Gordon B. “An Analysis of Former Vice President Biden’s Tax Proposals.” Tax Policy Center. 5 Mar 2020.", "Smetters, Kent. Professor of business economics and public policy, Wharton School, University of Pennsylvania. Email to FactCheck.org. 24 Aug 2020.", "“The Updated Biden Tax Plan: Budgetary, Distributional, and Economic Effects.” Penn Wharton Budget Model. 10 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]