["About this rating", "After Prince was found dead on 21 April 2016, several bridges and monuments in his home state were illuminated with purple lights to honor him.  Not long after that, photographs began to circulate that purported to showing major landmarks across the world lit with purple in Prince's memory.", "While many of these images are authentic, others have been digitally manipulated or shared with misinformation.", "The Chicago River: FALSE", "While the Chicago River has a reputation of changing colors every March for St. Patrick's Day, the city did not turn the river purple in honor of Prince. The above photograph was altered to turn a green river into a purple one:", "While a photograph showing a purple Niagara Falls is real, Prince was not the reason for the color change. Before Prince's death, the Niagara Falls Illumination Board announced that they would be turning the falls purple in honor of Queen Elizabeth II's birthday:", "The Niagara Falls Illumination Board will acknowledge the 90th birthday of Queen Elizabeth II on April 21 by bathing the Horseshoe and American Falls in purple — the colour of royalty — for 15 minutes beginning at 10 p.m.", "Queen Elizabeth has sat on the throne as Queen of the United Kingdom, Commonwealth and Canada since 1953.", "Toronto's CN Tower also was lit purple on the same day, creating additional confusion, but both the tower and Niagara Falls were commemorating the Queen's birthday, not Prince's death.", "Flickr user Tony Webster snapped the above-displayed photograph on 21 April 2016, showing the Lowry Avenue Bridge in Minneapolis, Minnesota, lit purple for Prince.", "The Super Dome turned purple in 2014, when the musician performed a show during the Essence Festival in New Orleans. The city put on a similar display the day after the musician's passing.", "The Forum in Los Angeles, which hosted a memorable Prince concert in 2011, paid its purple respects to the musician.", "San Francisco City Hall: TRUE", "San Francisco City Hall lights up purple for #Prince https://t.co/lApxybX05D pic.twitter.com/5uJydvkRzt", "— Joe Vazquez (@joenewsman) April 22, 2016", "Los Angeles City Hall: TRUE", "The buildings washed purple for Prince weren't just venues he had played. San Francisco's and Los Angeles' City Hall buildings were also lit in his honor.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]