["A video is being shared on Twitter with the claim that a Dalit man was fed water from a shoe by upper-caste men.", "South Asian Human Rights Watch (@SAHR_Watch), which according to its Twitter bio is a London-based NGO, tweeted the video on April 4, saying “The plight of the Dalit community in India continues to be a cause for concern, as incidents of caste-based discrimination and violence continue to occur with alarming frequency.” (Archive)", "The plight of the Dalit community in India continues to be a cause for concern, as incidents of caste-based discrimination and violence continue to occur with alarming frequency. pic.twitter.com/f08maHXhd1", "— South Asian Human Rights Watch (@SAHR_Watch) April 4, 2023", "The video was also shared by user Jas Oberoi (@iJasOberoi). (Archive)", "State of Dalits in India.pic.twitter.com/glLc3fCpoV", "— Jas Oberoi | ਜੱਸ ਓਬਰੌਏ (@iJasOberoi) April 5, 2023", "Last year, Twitter user @kanishksinghASP shared this video with the caption “हिन्दू धर्म मे पैदा होने वाले जो अपने आप को ऊंची जाती का मानते हैं और अपने समाज को सभ्य सामाज कहते हैं। ऐसे लोगो के दिमाग मे दीमक लगा पड़ा है, हज़ारों साल से। यह इसका treatment भी नहीं कराना चाहते हैं। जिसके कारण पूरा देश नफरत की आग मे झुलस रहा है। इंसान को इंसान नहीं समझते।” (Translation: People who are born as Hindus, who consider themselves to be upper caste and belong to a “civilized society” have termites stuck in their minds for thousands of years. They don’t even want to treat it, which is why the whole country is burning in the fire of hatred).", "The tweet garnered almost 4000 likes and over 2000 retweets.", "Twitter user @newswaseemzaidi shared the same video with the same claim and garnered almost 4000 likes.", "Users @Banwari60103223 and @Golden_0786 also shared the video with similar claims.", "This slideshow requires JavaScript.", "The video has also been shared multiple times on Facebook.", "The same video had also gone viral two years ago in October 2020 with similar claims of caste-based violence. Twitter user @anita_goutam1 tweeted the clip and subsequently took it down. Her tweet was quote-tweeted by @bkarwadiya who also deleted it later.", "The video had been shared with similar claims by several Twitter users.", "देखें जातिवाद का एक और घिनौना चेहरा। कहते है जातिवाद नहीं है इससे शर्मनाक कुछ हो नहीं सकता।😡😡 pic.twitter.com/TCb9bSFfl5", "— Amit Kumar (Sound of Democracy)🇮🇳 (@AmitKum57479658) October 14, 2020", "“This video puts an end to the class difference between upper and lower castes. An upper-caste Hindu feeding his Dalit brother water from a shoe with love. He is setting an example of brotherhood by breaking barriers of casteism and untoucability. This is today’s new India, my country is indeed changing. (उच्च और नीच की भेदभाव को दूर करती यह वीडियो एक उच्च जाति का हिन्दू भाई अपने एक दलित भाई को प्यार से जूते में पानी पिलाते हुवे। जातपात छुआछूत के बंधन तोड़ आपसी भाईचारे की मिसाल देते हुए। ये है आज का नया भारत वाकई मेरा देश बदल रहा है।)” – read the sarcastic message shared with the clip on Facebook.", "People can be heard speaking in a Rajasthani dialect in the video. A search based on this led us to a report by Dainik Bhaskar published on June 16, 2020. According to the report, this incident is from Sumerpur in Pali district of Rajasthan. The youth was kidnapped and brought to Suparna (Sardarpura) village, Sirohi on June 11, 2020, on the accusation of getting involved with a married woman in the village. He was beaten, forced to drink urine from a liquor bottle and fed water from shoes. The accused also called the youth’s brother and uncle and kept them tied to a tree overnight. They took Rs 5000 from them.", "According to the report, the police filed a complaint on June 15, 2020, after a video of the incident went viral on social media. Five people were subsequently arrested – Laxmanram Dewasi, Jawanaram, Bhimaram, Navaram and Dargaram Dewasi. A minor was also taken into police custody. The report stated that the accused threatened the victim’s family.", "News18 had also reported on the incident.", "A report by Patrika dated June 17, 2020, identifies the victim as Kaluram Dewasi. It is noteworthy that some of the accused hailed from the same caste. Free Press Journal also reported that the victim was Kaluram Dewasi.", "Dainik Jagran uploaded a video report on the arrests made by the police which carries the statement of Kota SP Rahul. He informed that the victim was in love with a woman which enraged the accused who took him to Sirohi. He was beaten up and fed water with shoes in the village. A total of six people were arrested in this connection.", "Rajasthan में युवक को जूते में भरकर पिलाया पानी", "Rajasthan के सिरोही में युवक को जूते में भरकर पिलाया पानी, आरोपियों को पुलिस ने किया गिरफ्तार", "Posted by Dainik Jagran on Wednesday, 17 June 2020", "Alt News had contacted Pali police to know if there were any updates on the case. A senior police inspector of Pali informed, “This case is 3-4 months old. The youth was beaten up after accusations that he was in a relationship with a woman. The incident has nothing to do with casteism. These people belong to the Dewasi community who usually work in animal husbandry.” The officer further told us that 11 accused had been arrested in the case.", "To sum up, a video of a youth beaten up and fed water from a shoe for being in love with a woman is circulating again on social media as caste-based violence on a Dalit individual.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]