["A set of two photographs of the Jammu and Kashmir civil secretariat building is floating across social media platforms. While the image on the top shows both the Indian flag and the flag of J&K hoisted on the building, the image on the bottom shows only the Indian flag. It attempts to suggest that the state flag has been removed from the civil secretariat building. Indian wrestler Geeta Phogat was among those who shared the images. Her tweet drew nearly 5,000 likes at the time of writing this article.", "भारत एक है 🇮🇳🙏 pic.twitter.com/kikeheOKDs", "— geeta phogat (@geeta_phogat) August 6, 2019", "From a Facebook page ‘Modi Mania’, the post received over 7,600 likes and 2,300 shares.", "Posted by MODI MANIA on Monday, 5 August 2019", "Another page ‘హిందూ హిందుత్వం – Hindu Hindutvam‘ also shared the photographs. They have been circulated on Twitter as well.", "Alt News also received verification requests of the post on its mobile app.", "The first clue which debunks the claim is that apart from the flags, nothing else in the images is different. This is most apparent by the placement of cars and the people walking around which is exactly the same in both photographs.", "A Google reverse-image search led us to a 2016 article in Kashmir News Observer which carried the same image.", "Furthermore, an August 4, 2019 report in Dainik Jagran published a recent image of the civil secretariat building where the state flag is visible.", "The article also quoted BJP Kashmir spokesperson Altaf Thakur who dispelled the rumours.", "An associate editor with ABP News Neeraj Rajput tweeted images of the civil secretariat building on August 4 where both the Indian flag and the J&K flag can be seen.", "Dont go by rumours, both Indian and J&K flags flying on secretariat building in #Srinagar today#Kashmir pic.twitter.com/Z7ymd1dok3", "— Neeraj Rajput (@neeraj_rajput) August 4, 2019", "Social media rumours claiming that the Jammu and Kashmir flag has been removed from the civil secretariat building are thus being furthered using a photoshopped image.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]