["“‘REPORT: DOMINION DELETED 2.7 MILLION TRUMP VOTES NATIONWIDE. DATA ANALYSIS FINDS 221,000 PENNSYLVANIA VOTES SWITCHED FROM PRESIDENT TRUMP TO BIDEN. 941,000 TRUMP VOTES DELETED. STATES USING DOMINION VOTING SYSTEMS SWITCHED 435,000 VOTES FROM TRUMP TO BIDEN.’ @ChanelRion @OANN,” Trump tweeted on November 12, 2020.", "Trump attributed the claim to the right-wing One America News Network.", "Trump has insisted that he is the winner of the 2020 presidential vote -- which major media organizations called for Biden on November 7 -- and has refused to concede, while making unfounded allegations of election fraud.", "Biden’s success in Pennsylvania was key, pushing him over the 270 total electoral votes he needed to secure the presidency.", "Federal and state election officials issued a statement rejecting the assertions in Trump’s tweet.", "“There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised,” the members of the Election Infrastructure Government Coordinating Council Executive Committee and the Election Infrastructure Sector Coordinating Council said.", "And a spokesperson for Pennsylvania’s Department of State rejected the claim that 221,000 votes were switched.", "“There is no factual basis for this claim. Allegations of fraud and illegal activity have been repeatedly debunked and dismissed by the courts. Those attacks against the core values of Americans are intended to undermine our democracy, and we must reject them,” the spokesperson said.", "“Pennsylvania is going to fight every single attempt to disenfranchise voters. We will protect this election and the democratic process. Pennsylvania will count every vote, and we will protect the count of every vote.”", "Election technology company Dominion Voting Systems -- which was blamed in Trump’s tweet -- also pushed back against the allegations.", "“Dominion categorically denies any claims about any vote switching or alleged software issues with our voting systems,” it tweeted.", "AFP Fact Check has debunked a series of false claims of fraud in the 2020 election, which are available in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]