["Democratic vice presidential candidate Sen. Kamala Harris, D-Calif., speaks at Headliners Barbershop in Detroit on Sept. 22, 2020. (AP/Sancya)", "Sen. Kamala Harris has interviewed with several local and national news outlets since Democratic presidential nominee Joe Biden named her his vice presidential pick.", "Harris has sat down with national news organizations such as ABC News and CNN and local outlets in key swing states such as Florida, Pennsylvania, and Wisconsin.", "The claim that Harris “has not formally taken questions from the press a single time” appears to have originated with an NBC News reporter’s tweet. The reporter later clarified that she was talking specifically about press conferences and gaggles.", "Conservative commentator Dinesh D’Souza took aim at Sen. Kamala Harris in an Instagram post for allegedly dodging the press since former Vice President Joe Biden, the Democratic nominee for president, tagged her as his running mate in mid August.", "\"Kamala Harris was picked to be Joe Biden’s VP 42 days ago,\" said the Sept. 23 post. \"There are 41 days until the election. She has not formally taken questions from the press a single time.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim appears to have originated with NBC News reporter Deepa Shivaram, who tweeted a day earlier that \"the senator has not once formally taken questions from the press.\"", "The tweet racked up thousands of likes and retweets and was shared by a number of news reporters. Eric Trump and other allies of President Donald Trump also picked it up. And it made the jump to Instagram when D’Souza shared it to his more than 900,000 followers.", "But Harris hasn’t shunned the media, as D’Souza’s Instagram post suggests. The California senator sat down for her first interview as a vice presidential candidate with the 19th News on Aug. 14, three days after Biden announced her as his running mate.", "Since then, Harris has done interviews with national organizations such as People, ABC News, NBC, Univision, BET and CNN. She also interviewed with the Grio, a site targeting African American readers, and she appeared on Showtime’s late-night talk show, \"Desus and Mero.\"", "On Sept. 21, two days before D’Souza’s post, Harris spoke with Urban Radio Networks reporter and CNN political analyst April Ryan and joined radio host Russ Parr for his show. She is slated to appear Sept. 28 on MSNBC’s \"The Last Word with Lawrence O’Donnell.\"", "Harris has also interviewed with a number of local news outlets. The outlets PolitiFact identified include: three TV stations and two radio stations serving south Florida; a TV station in Charlotte, N.C.; two TV stations in Milwaukee; a TV station in the San Francisco Bay Area; two TV stations in Phoenix; a TV station in Las Vegas; two TV stations in Philadelphia; a TV station in Detroit; and a TV station serving the Flint and Tri-Cities region of Michigan.", "When a reporter asked Biden why they hadn’t \"seen her out very much\" during a Sept. 4 press conference, Biden said Harris has been busy campaigning on his behalf.", "\"She’s been on the road,\" Biden said. \"She’s out herself. The role is that, just like when Barack and I campaigned, we try to cover as much territory as we could, and both of us out campaigning.\"", "Shivaram, the NBC News reporter, clarified her original point in a second tweet, which was posted in response to a question and received significantly fewer shares. She said Harris has, in fact, done interviews with both national networks and local outlets in states she’s visited.", "What Harris hasn’t had, Shivaram wrote, is an informal briefing where reporters covering her campaign stops can ask questions, aside from a \"few shouted questions.\"", "\"Just to be clear, she's taken questions,\" Shivaram tweeted in response to another reporter’s retweet. \"But it's us shouting them out as we're moving in and out of rooms, or as she's walking in and out of events. Nothing more established than that.\"", "D’Souza did not respond to a request for comment.", "An Instagram post says Harris \"has not formally taken questions from the press a single time\" since Biden named her as his vice presidential pick. That’s inaccurate. Harris has made numerous media appearances and interviews since the Aug. 11 announcement.", "We rate this Instagram post False.", "Dinesh D’Souza on Instagram (archived here), Sept. 23, 2020", "Deepa Shivaram on Twitter (archived here), Sept. 22, 2020", "Deepa Shivaram on Twitter (archived here), Sept. 22, 2020", "Media Matters for America, \"Viral claim that Kamala Harris hasn't taken questions as VP nominee isn't exactly true,\" Sept. 23, 2020", "Fox News, \"Kamala Harris criticized for lack of press availability: ‘What are they afraid of?’\" Sept. 23, 2020", "Associated Press on YouTube, \"Harris: Breonna Taylor's family deserves 'justice,'\" Sept. 23, 2020", "Click On Detroit | Local 4 | WDIV on YouTube, \"Kamala Harris 1-on-1: How she, joe Biden hope to earn support,\" Sept. 22, 2020", "WNEM.com, \"Kamala Harris addresses voting, infrastructure, pandemic concerns in one-on-one with TV5,\" Sept. 22, 2020", "BETNetworks on YouTube, \"Sen. Kamala Harris Answers HBCU Students’ Questions About Voting, Student Loan Debt & More,\" Sept. 22, 2020", "April D. Ryan on Instagram, Sept. 21, 2020", "ABC6, \"Kamala Harris talks gun violence, COVID-19 in one-on-one interview with Jim Gardner,\" Sept. 18, 2020", "Joseph Khalil on YouTube, \"Joe Khalil Interview with Sen. Kamala Harris Full,\" Sept. 17, 2020", "NBC10 Philadelphia, \"Kamala Harris Discusses Potential COVID-19 Vaccine During Philly Visit,\" Sept. 17, 2020", "Univision Noticias, \"Exclusiva con Kamala Harris,\" Sept. 18, 2020", "AZFamily.com, \"RAW INTERVIEW: Kamala Harris talks with Arizona's Family,\" Sept. 14, 2020", "8NewsNow Las Vegas, \"WATCH: Sen. Kamala Harris discusses pandemic, recent protests, wildfires in interview with 8 News Now,\" Sept. 14, 2020", "Telemundo Arizona, \"Kamala Harris promete frenar las deportaciones masivas,\" Sept. 14, 2020", "Desus & Mero on Showtime on YouTube, \"Sen. Kamala Harris on Reforming Police & Prosecutors | Ext. Interview | DESUS & MERO | SHOWTIME,\" Sept. 13, 2020", "NBC Bay Area, \"NBC Bay Area Exclusive: Interview With Kamala Harris,\" Sept. 13, 2020", "Univision Miami on Facebook, \"Kamala Harris entrevista,\" Sept. 11, 2020", "WSVN-TV, \"Kamala Harris attends Miami Gardens roundtable on race relations, discusses campaign,\" Sept. 10, 2020", "WISN12 News, \"One-on-one with U.S. Sen. Kamala Harris,\" Sept. 8, 2020", "Fox6 Milwaukee, \"'My 1st trip on the ticket:' 1-on-1 with Kamala Harris in Milwaukee,\" Sept. 7, 2020", "CNN on YouTube, \"Kamala Harris' exclusive interview with CNN (part 2),\" Sept. 6, 2020", "CNN on YouTube, \"CNN Exclusive interview with Sen. Kamala Harris (part 1),\" Sept. 6, 2020", "CNN on YouTube, \"Kamala Harris visits Howard University, her alma mater, with CNN,\" Sept. 6, 2020", "Riddims Marketing on SoundCloud, Sept. 5, 2020", "WSOCTV.com, \"Sen. Kamala Harris says she has faith in USPS; warns against playing politics with COVID vaccine,\" Sept. 4, 2020", "CNBC Television on YouTube, \"Democratic presidential nominee Joe Biden speaks on economic crisis — 9/4/2020,\" Sept. 4, 2020", "WCMQ (Z92FM)/Miami, \"WCMQ (Z92FM)/Miami, MegaTV Simulcast Kamala Harris Interview,\" Aug. 31, 2020", "Local10.com, \"This Week in South Florida: Kamala Harris,\" Aug. 30, 2020", "Today, \"Kamala Harris on call for nationwide mask mandate: 'This is a sacrifice we have to make,'\" Aug. 28, 2020", "ABC News, \"TRANSCRIPT: Joe Biden, Kamala Harris' first joint interview with ABC's Robin Roberts,\" Aug. 23, 2020", "People, \"Joe Biden and Kamala Harris' First Joint Interview: 'Audacity' of Partnering & Their 'Modern Family' Values,\" Aug. 18, 2020", "The Grio, \"Kamala Harris has a message for voters who aren’t feeling her and Joe Biden,\" Aug. 16, 2020", "The 19th News on YouTube, \"The 19th Represents keynote conversation with Sen. Kamala Harris,\" Aug. 14, 2020", "Email correspondence with the Biden campaign, Sept. 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]