["The misleading claim was made in this Facebook post published on September 12, 2019, which has been shared more than 690 times after being published by a Facebook page with more than 4,000 followers.", "The post includes a photo of General Angus J. Campbell, the Chief of the Australian Defence Force, who was appointed in July 2018.", "Below is a screenshot of the misleading Facebook post:", "The post’s caption states: “Angus Campbell, the general who stripped our Diggers of their iconic inherited unit badges and has done his best to vilify and delegitimise our Anzac fighting spirit, is at it again. This time with the help of Dept of Defence secretary, Greg Moriarty, he has decreed that every ADF base and facility be renamed with aboriginal place names and has ordered that the primary position of the Australian flag be downgraded to a shared position on all ADF publications.”", "Greg Moriarty became Secretary of the Department of Defence in September 2017.", "A similar misleading claim was published in this Facebook post.", "The same photo of General Campbell was shared here on Twitter alongside a similar claim.", "But the posts are misleading; the Australian Defence Force has said Australia’s military bases will retain their existing English names, but their Aboriginal names will also be added.", "In an email on September 17, a Department of Defence spokesperson told AFP that “the names of Defence bases and establishments are not being changed.”", "“As part of Defence’s commitment to fostering genuine and meaningful relationships with Indigenous Australians, and the unique skill set that they bring to strengthen and enhance Defence, we will be commissioning dual-names. This means bases and establishments will have one name in the traditional language alongside the existing base or establishment name,” the statement reads, in part.", "Dual-naming of bases and establishments was announced in the fourth Defence Reconciliation Action Plan (D-RAP) on 14 August 2019. All major Defence bases and establishments will have dual-names in traditional Aboriginal languages by December 2022.", "According to the Permanent Committee on Place Names (PCPN), a dual-naming system may be “used as a management and educative tool for naming physical and environmental features of significance to the local Aboriginal or Torres Strait Islander community when an official name already exists and when a name change is not possible or acceptable.”", "An example of dual-naming is Uluru, also known as Ayers Rock, which was changed to include dual names in 1993, according to Parks Australia.", "The misleading Facebook post also claims it has been ordered that “the primary position of the Australian flag be downgraded to a shared position on all ADF publications.”", "AFP asked the Department of Defence whether it was true the Australian flag was being “downgraded” on ADF publications.", "In response, the DoD said in an email on September 24 it planned to: \"develop a strategy to review Defence corporate publications with the intent to incorporate Aboriginal and Torres Strait Islander flags together with the Australian flag.\"", "The strategy is listed here as the 27th deliverable in the fourth Defence Reconciliation Action Plan, and is set to be completed by January 2021.", "Both the Aboriginal and Torres Strait Islander flags are recognised as official flags of Australia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]