["The photo was published here on Facebook on December 13, 2020.", "The post's Punjabi-language caption translates to English as: “He doesn't have time to visit the farmers who have been protesting in this cold weather, but he has time to visit hospital to congratulate Ambani on the birth of his grandchild.”", "The photo has been shared as Indian farmers protested against new agriculture laws. AFP reported on the protests here.", "Ambani refers to Reliance Industries Chairman and Managing Director Mukesh Ambani, who became a grandfather last week after his daughter-in-law gave birth to a baby boy on December 10, 2020.", "The photo was also shared here, here, here and here on Facebook and here, here, here and here on Twitter, alongside an identical claim.", "The claim, however, is false.", "A reverse image search on Google found the original photo was published here in a report by India Today on October 25, 2014.", "The photo's caption reads: “Prime Minister Narendra Modi with Maharashtra Governor C Vidyasagar Rao, Reliance Foundation Chairperson Nita Ambani and industrialist Mukesh Ambani after the inauguration of HN Reliance Foundation Hospital in Mumbai on Saturday,” with credit to the Indian news agency PTI.\"", "Below is screenshot comparison of the image in the misleading Facebook post (L) and the photo published alongside the India Today report (R):", "The event was widely reported in Indian media, for example here by The Indian Express and here by the Aaj Tak TV channel.", "The event was also streamed live on PM Modi’s personal and official YouTube channels, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]