["About this rating", "Eric Trump, U.S. President Donald Trump's second-eldest son, has a large presence on Instagram, with 1 million followers. So his posts have a wide reach, including those that contain inaccurate information.", "In early September 2019, Eric Trump published a post on Instagram with a quote attributed to actor and comedian Tim Allen, stating that the 45th president's promised border wall will cost less than the website for Obamacare, referencing the site used to administer the health care policy of President Trump's predecessor, Barack Obama.", "#True", "A post shared by  Eric F. Trump (@erictrump) on Sep 10, 2019 at 4:51am PDT", "The exact source of this quote is unclear, but it does not appear to have originated with \"Home Improvement\" star Allen. The quote has been on social media, in the form of various memes, since at least January 2019. The earliest version we found was posted to a pro-Trump Facebook page on Jan. 27.", "Months later, the statement was attributed to Allen, but that appears to be because an unrelated Virginia man by the same name posted it amid a longer Facebook screed on Aug. 25, 2019, which was itself a copy-and-pasted collection of other various Facebook memes. After he did so, Facebook users began sharing his post with the added disclaimer that it was written by the actor Tim Allen.\nThat appears to be how an anonymous meme ended up on the Instagram page of the president's son, bearing the likeness of Tim Allen and crediting the actor with a spurious quote. We reached out to the private citizen who wrote the Aug. 25 Facebook post for comment, but have not received a response.\nSo what about the claim that the Obamacare website, HealthCare.gov, cost taxpayers more than the U.S.-Mexico border wall? That statement is just as factually challenged as the claim that the actor Tim Allen said it. And it's a strange one, considering President Trump has made an unprecedented display of fighting with Democrats in Congress to get more money for wall construction in the amount of billions of dollars.\nThe Trump administration estimated in 2017 the wall will cost $21.6 billion. A year later, Trump stated the cost would be as low as $15 billion. Democratic legislators on the other hand estimate the wall will cost $70 billion, plus the costs of maintenance.\nThe Pentagon on Sept. 4, 2019, announced it would divert $3.6 billion from 127 military projects to pay for Trump's border-wall construction. Months prior, Trump oversaw the longest partial shutdown of the federal government in U.S. history over his demand for $5.7 billion toward border-wall funding.\nThese numbers alone are larger than the biggest available estimated cost of the Obamacare website. In August 2014, the Inspector General's office for the U.S. Department of Health and Human Services reported that the original estimate for the cost of contracts associated with developing HealthCare.gov totaled $1.7 billion. In its own September 2014 investigation, Bloomberg Government, in an independent analysis, tallied the cost of the website at $2.1 billion.\nBecause the actor Tim Allen did not make the comment attributed to him in Eric Trump's Instagram post and also because estimated costs for the Obamacare website are far lower than the expected total cost of border-barrier construction, we rate this claim \"False.\"", "Months later, the statement was attributed to Allen, but that appears to be because an unrelated Virginia man by the same name posted it amid a longer Facebook screed on Aug. 25, 2019, which was itself a copy-and-pasted collection of other various Facebook memes. After he did so, Facebook users began sharing his post with the added disclaimer that it was written by the actor Tim Allen.", "That appears to be how an anonymous meme ended up on the Instagram page of the president's son, bearing the likeness of Tim Allen and crediting the actor with a spurious quote. We reached out to the private citizen who wrote the Aug. 25 Facebook post for comment, but have not received a response.", "So what about the claim that the Obamacare website, HealthCare.gov, cost taxpayers more than the U.S.-Mexico border wall? That statement is just as factually challenged as the claim that the actor Tim Allen said it. And it's a strange one, considering President Trump has made an unprecedented display of fighting with Democrats in Congress to get more money for wall construction in the amount of billions of dollars.", "The Trump administration estimated in 2017 the wall will cost $21.6 billion. A year later, Trump stated the cost would be as low as $15 billion. Democratic legislators on the other hand estimate the wall will cost $70 billion, plus the costs of maintenance.", "The Pentagon on Sept. 4, 2019, announced it would divert $3.6 billion from 127 military projects to pay for Trump's border-wall construction. Months prior, Trump oversaw the longest partial shutdown of the federal government in U.S. history over his demand for $5.7 billion toward border-wall funding.", "These numbers alone are larger than the biggest available estimated cost of the Obamacare website. In August 2014, the Inspector General's office for the U.S. Department of Health and Human Services reported that the original estimate for the cost of contracts associated with developing HealthCare.gov totaled $1.7 billion. In its own September 2014 investigation, Bloomberg Government, in an independent analysis, tallied the cost of the website at $2.1 billion.", "Because the actor Tim Allen did not make the comment attributed to him in Eric Trump's Instagram post and also because estimated costs for the Obamacare website are far lower than the expected total cost of border-barrier construction, we rate this claim \"False.\"", "Wayne, Alex. \"Obamacare Website Costs Exceed $2 Billion, Study Finds.\"\r\n  Bloomberg. 24 September 2014.", "Ainsley, Julia Edwards. \"Exclusive - Trump Border 'Wall' to Cost $21.6 Billion, Take 3.5 Years to Build: Internal Report.\"\r\n  Reuters. 9 February 2017.", "Nixon, Ron. \"Border Wall Could Cost 3 Times Estimates, Senate Democrats’ Report Says.\"\r\n  The New York Times. 18 April 2017.", "Nowrasteh, Alex. \"The Cost of the Border Wall Keeps Climbing and It’s Becoming Less of a Wall.\"\r\n  The Cato Institute. 8 January 2019.", "Brunnstrom, David and David Morgan. \"Government Shutdown Becomes Longest in U.S. History.\"\r\n  Reuters. 12 January 2019.", "Piestsch, Bryan. \"Pentagon Pulls Funds for Military Schools, Daycare to Pay for Trump's Border Wall.\"\r\n  Reuters. 4 September 2019.", "Office of the Inspector Genera. U.S. Department of Health and Human Services. \"An Overview of 60 Contracts That Contributed to the Development and Operation of the Federal Marketplace.\"\r\n  26 August 2014.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]