["About this rating", "Thousands of National Guard members were reportedly dispatched to Washington, D.C. following the Jan. 6 U.S. Capitol attack, as of this report.", "Trump did not invoke the Insurrection Act, which means all efforts by law-enforcement or military forces in U.S. cities were unrelated to the 214-year-old law.", "On Jan. 11, 2021, as Democratic leaders moved to impeach U.S. President Donald Trump following a deadly attack on the U.S. Capitol a week before, rumors surfaced online alleging he had invoked a law that allows a president to use state or federal military forces to suppress civil unrest.", "Several tweets about the law, which is called the Insurrection Act, included photos or videos of officers wearing camouflage body armor supposedly patrolling the streets of Washington, D.C. \"Trump signed the Insurrection Act last night. Buckle up kids,\" one person tweeted on Jan. 10.", "At least one Parler post alleged the president had invoked the law to specifically use military force against his political opponents, including high-profile Democrats and Republicans, as well as federal agencies that were attempting to uphold the country's democracy amid Trump's baseless election fraud claims.", "The text of the act, which federal leaders originally passed in 1807 and amended several times since, includes the following provisions:", "§ [§ 251] “Whenever there is an insurrection in any State against its government, the President may, upon the request of its legislature or of its governor if the legislature cannot be convened, call into Federal service such of the militia of the other States, in the number requested by that State, and use such of the armed forces, as he considers necessary to suppress the insurrection.”", "§ [§ 252] “Whenever the President considers that unlawful obstructions, combinations, or assemblages, or rebellion against the authority of the United States, make it impracticable to enforce the laws of the United States in any State by the ordinary course of judicial proceedings, he may call into Federal service such of the militia of any State, and use such of the armed forces, as he considers necessary to enforce those laws or to suppress the rebellion.", "In other words, the act is the most widely cited legal authority regarding the president's power to deploy the military or the National Guard in U.S. cities, whether due to a natural disaster, terroristic violence, civil unrest, or another safety issue.", "The executive authority is different from \"martial law,\" which generally refers to the temporary military takeover of civilian functions and is not defined in federal statutes or the Constitution. (Read more about martial law via the Brennan Center for Justice.)", "Former President George H. W. Bush invoked the Insurrection Act in 1992 after a jury acquitted four police officers in the brutal beating of Rodney King, a Black man, prompting days of chaotic protests across the Los Angeles metro.", "Presidents generally invoke the Insurrection Act when, or if, the U.S. attorney general (Jeffrey A. Rosen began acting that role on Dec. 24) says to do so, or when the governor of the impacted state makes a request, according to a 2006 report by the Congressional Research Service.", "However, if that governor or state legislature \"cannot be convened\" for whatever reason, the law provides the president the legal authority to federalize the National Guard and military without state approval.", "Put another way, the law is generally \"open-ended, leaving the President the power to decide if circumstances warrant\" military intervention, according to University of Texas Law School professor Steve Vladeck.", "So, to recap, the Insurrection Act gives the commander-in-chief the power to order military forces to try to stop violence at the request of state leaders, or when the president alone feels local law-enforcement agencies cannot enforce federal laws or violence is depriving Americans of their Constitutional rights.", "But here's a key fact to debunk the claim regarding Trump: If, or when, a president decides to use the law, another provision requires that person to issue a public proclamation ordering the people causing violence to disperse within a certain time. That order essentially serves as a warning to people posing safety threats that they could face arrests if they remain on streets.", "\"If the situation does not resolve itself, the President may issue an executive order to send in troops,\" according to the 2006 report, which followed criticism of the federal government's response to Hurricane Katrina that killed more than 1,800 people.", "As of this report, Trump had not made such a proclamation — which means he did not invoke the Insurrection Act to authorize military forces to quell civil disobedience before, during, or after the Jan. 6, 2021, attack by American right-wing extremists. (See here for information on how Trump falsely claimed to have \"immediately\" deployed the National Guard and law enforcement during the siege, and learn what actually happened.)", "On Jan. 10, BuzzFeed reported the governing body of Washington, D.C., the 13-member City Council, had received a briefing from the district's attorney general office prior to the riot about the implications of Trump invoking the Insurrection Act, though that did not end up happening. A spokesman for the council's chair, Phil Mendelson, told USA TODAY the information, which explained how the act could allow the federal government to seize control of the district's Metropolitan Police Department (MPD), was \"a cautionary thing as opposed to preparatory.\"", "However, while it was false to claim Trump had invoked the Insurrection Act, National Guard members were indeed patrolling the nation's Capitol following the the Jan. 6 attack that resulted in the deaths of five people, including a police officer, numerous injuries and arrests, and property damage. The visual evidence of officers on social media that erroneously claimed president had invoked the act could be authentic, though misleading.", "On Jan. 9, D.C. Mayor Muriel Bowser authored a letter to Acting Secretary of Homeland Security Chad Wolf, who announced his resignation days later, according to news reports. Bowser's letter urged the department to coordinate with agencies, including the Department of Defense and the Department of Justice, to enhance security around federal properties so that MPD officers could focus on other duties. It is typical for such agencies to boost surveillance during high-profile D.C. events, including presidential inaugurations.", "The letter also asked the DHS to reject or cancel permits for demonstrations prior to Joe Biden's presidential inauguration ceremony.", "The letter asked the DHS to start boosting security efforts on Jan. 11 related to the inauguration, as opposed to the previously determined date of Jan. 19. \"[The timeline change] will allow for better Federal and District government interagency preparation for the [Jan. 20] Inauguration, given the new threats from insurgent acts of domestic terrorists,\" the letter read.", "As of this report, Army Gen. Daniel R. Hokanson, the chief of the National Guard Bureau, told reporters about 6,000 National Guard members from six states were stationed in D.C., and that that number would expand to about 10,000 over the course of days. The Washington Monument was being closed to the public amid the threats of disruption, The Associated Press reported.", "In addition to D.C., the FBI warned armed protesters could gather in 50 state capitals before Inauguration Day on Jan. 20.", "In sum, while it was true that National Guard members were sent to D.C. in the days before Biden's swearing-in ceremony, officers' surveillance was not a result of the Insurrection Act but rather local and federal authorities' efforts to maintain safety and prevent property destruction during the presidential transition. Trump had not invoked the Insurrection Act to apply to the district — nor anywhere else.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]