["About this rating", "Preliminary findings from a preprint study suggest that a common antimicrobial ingredient in over-the-counter mouthwash may prove effective at reducing COVID-19 in saliva.", "However, the study's findings have not yet been tested on humans. Also, to be clear: they did not indicate that using mouthwash is a cure for COVID-19, nor that it is an effective preventative measure.", "It is unclear how accurate these early findings may be. The results have not been peer-reviewed by the broader scientific community nor have they been replicated at the larger community level.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A preliminary report released in November 2020 claimed that over-the-counter mouthwashes that contained the antimicrobial ingredient cetylpyridinium chloride (CPC) showed signs of reducing COVID-19 in saliva — a “promising” find as the world raced to find therapeutics and vaccinations to combat the novel coronavirus.", "The findings were published by a long list of news outlets, including BBC News and CNBC, and became a Twitter moment on Nov. 17. Some headlines made bold claims like “Mouthwash Can Kill COVID-19 in 30 Seconds, Study Reveals,\" and as such generalized coverage swept the internet, Snopes readers asked our reporters to dig in and verify the veracity of this report.", "While it is true that the findings show promise that CPC could reduce COVID-19 in saliva, it is important to note several caveats with the study.", "Firstly, the preliminary results are published ahead of a clinical trial in the preprint server for biology bioRxiv, meaning that they have not been peer-reviewed and larger scale testing has yet to be conducted at the time of writing.", "Cardiff University researchers behind the most recent mouthwash study conducted an “in vitro” experiment, which means that it was not tested on humans but rather mimicked conditions found in the pharynx passage, the part of the throat located behind the mouth and nasal cavity that connects to the esophagus. Researchers exposed the SARS-CoV-2 novel coronavirus to two rinses containing CPC and a third containing a combination of ethanol and essential oils over the course of 30 seconds.", "Mouthwashes that contained at least .07% CPC showed signs of inactivating the novel coronavirus. That doesn’t kill it but rather eliminates the virus’ ability to invade host cells. Neither ethanol nor chlorhexidine alone was shown to have an impact on the virus.", "But there are some important limitations to the study worth noting. While mouthwashes were shown to be effective at eradicating the virus in a laboratory setting, it is not yet clear to what extent these results will be mimicked in real people. It also doesn’t directly indicate how mouthwash may reduce viral transmission between patients.", "“This study adds to the emerging literature that several commonly available mouthwashes designed to fight gum disease can also inactivate the SARS-CoV-2 coronavirus (and other related coronaviruses) when tested in the laboratory under conditions that are designed to mimic the oral/nasal cavity in a test tube,” said Dr. Richard Stanton, lead author on the study and a reader in virology at Cardiff University, in a university news release.", "Despite these limitations, the findings confirm previous studies that suggest CPC could reduce the levels of SARS-CoV-2 in saliva, which could help to reduce transmission between individuals. A study published in The Journal of Infectious Diseases in September found that gargling with an over-the-counter mouthwash for 30 seconds was “highly effective at inactivating infectious virus with greater than 99.9%.” Another study published in October in the British Journal of Oral and Maxillofacial Surgery furthered that saliva and oral cavities may serve as a potential reservoir for COVID-19 transmission, suggesting that mouthwashes could reduce transmission — but again, there is no clinical evidence to date that definitively confirms such findings.", "“Overall antimicrobial mouthwash may help in decreasing viral load in the oropharynx but this should not be viewed as using mouthwash instead of face masks, but instead as a potential combined intervention: use of mouthwash and wearing face masks,” said Professor Jean-Yves Maillard, Professor of Pharmaceutical Microbiology at Cardiff University, in a statement.", "“The remaining question is how often one needs to use a mouthwash to really make an impact? This would need to be answered before any recommendations are made.”", "Listerine owner Johnson & Johnson issued a statement in response to the findings, urging consumers to continue to use products as directed until further clinical evidence proves otherwise.", "No. LISTERINE® mouthwash has not been tested against any strains of coronavirus. Only some LISTERINE® mouthwash formulations contain alcohol, and if present is only around 20% alcohol. LISTERINE® mouthwash is not intended to be used, nor would it be beneficial as a hand sanitizer or surface disinfectant. LISTERINE® Antiseptic is clinically proven to kill 99.9 % of germs that cause bad breath, plaque and gingivitis.", "[…]", "No. LISTERINE® Antiseptic is a daily mouthwash which has been proven to kill 99.9% of germs that cause bad breath, plaque and gingivitis. LISTERINE® mouthwash has not been tested against the coronavirus and is not intended to prevent or treat COVID-19.", "Researchers at Cardiff University intend to next examine how effective mouthwash is in reducing SARS-CoV-2 viral load in the saliva of COVID-19-positive patients at the University Hospital of Wales in Cardiff. Results of this study are slotted for publication in early 2021. At the time of publication, several other studies are underway to determine how effective antiseptic mouthwash may be in preventing COVID-19 spread, including one at the University of California San Francisco that is expected to be completed in August 2021.", "Both Listerine and the scientific community caution that using mouthwash is not a cure for COVID-19, nor is it an effective preventative measure. Consumers should continue to follow recommendations issued by the Centers for Disease Control and Prevention, as well as the World Health Organization, including washing hands frequently, maintaining social distance, and avoiding touching the eyes, nose, and mouth.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]