["Arizona State Treasurer and Donald Trump’s state campaign chairman, Jeff DeWit, claimed ISIS was crossing the border while lobbying for Trump on immigration in a Feb. 22 interview with CNN’s Carol Costello.", "\"Myself being in Arizona, we know firsthand that tens of thousands of people that come over illegally every month there's a big problem on the border. There's drugs pouring over,\" DeWit said. \"Now we have ISIS coming over the border. You have problems. There's only one candidate that's going to do anything to fix it, and that's Donald Trump.\"", "He isn’t the first Arizona official to tie ISIS to the U.S-Mexico border. But there’s no evidence to support the claim.", "PolitiFact researched similar statements before:", "Arizona Congressman Trent Franks claimed that ISIS was present in Mexico back in September 2014. That claim was unfounded -- not a single law enforcement official could confirm it. We rated it Mostly False.", "Citing a report from right-leaning Judicial Watch, California Rep. Duncan Hunter said that U.S. Border Patrol agents caught at least 10 ISIS fighters on the border in Texas back in October 2014. U.S. Department of Homeland Security spokeswoman Marsha Catron rebuked the claim, noting that individuals with ties to ISIS apprehended at the border is \"categorically false.\" We rated Hunter’s statement Pants on Fire.", "We decided to delve into DeWit’s ISIS claim. Is this terrorist group crossing the border?", "Officials say it’s not happening", "DeWit spokesman Sean Dollman provided us with links to several news stories, including the Judicial Watch report cited by Hunter.", "Dollman said it is well-documented enough \"to be mentioned by the Treasurer as a valid concern.\" But he could not provide us with actual evidence that ISIS is crossing the border.", "Multiple officials disputed DeWit’s claim. While a small number of people from Middle Eastern countries have been detained near the border, none have been tied to ISIS (also called Islamic State or ISIL).", "Arizona Department of Public Safety spokesman Damon Cecil could not confirm the presence of ISIS at the border.", "\"We do know that people from Middle Eastern countries have crossed the U.S./Mexican border in Arizona. We are not able to confirm that anyone caught trying to illegally enter the U.S. from Mexico has ties to ISIS or any other terrorist organization,\" Cecil said.", "The influx of immigrants from the Middle East using the U.S.-Mexico border, however, goes back several years.", "A report released in 2006 from the House Committee on Homeland Security states that \"each year, hundreds of illegal aliens from countries known to harbor terrorists or promote terrorism\" are routinely encountered when they attempt to cross the border.", "The report also notes that several items have been found at the Rio Grande River, which runs from Colorado through Mexico, including a \"jacket with patches from countries where al-Qaida is known to operate.\"", "Moreover, the report definitively states that members of terrorist group Hezbollah \"have already entered the United States\" using the border sometime before 2005.", "An August 2009 Government Accountability Office report also notes that Border Patrol encountered three people with \"links to terrorism\" at southwest border checkpoints in fiscal year 2008.", "The House Committee on Homeland Security released an updated report in 2012. According to this report, from fiscal years 2006 to 2011, 1,918 \"special interest\" aliens, or aliens with ties to countries that \"could bring harm\" via terrorism, were apprehended at the border.", "But, as far as ISIS, the connection isn’t there.", "Recently, Border Patrol agents detained five Pakistani immigrants and one Afghan immigrant near the Arizona border in November 2015. However, U.S. Customs and Border Protection said that records checks on the immigrants \"revealed no derogatory information.\"", "Eight Syrians were also stopped at the Texas border in November, but DHS said they were regular migrants.", "Colin Clarke, an international security expert at the Rand Corporation, said he hasn’t seen any evidence of ISIS coming in over the border, but it’s possible.", "\"The border is vulnerable, why wouldn’t they try that?\" Clarke said. \"It’s certainly feasible that these guys could, through multiple attempts, smuggle someone across.\"", "Tim Nichols, an intelligence expert and associate professor at Duke University, said he is not aware of any information supporting DeWit’s statement. And neither are the feds.", "\"The suggestion that individuals who have ties to ISIL have been apprehended at the southwest border is categorically false, and not supported by any credible intelligence or the facts on the ground,\" said U.S. State Department spokeswoman Nicole Thompson.", "We also reached out to Mexico’s embassy in Washington D.C. Their spokesman, Ariel Moutsatsos-Morales, refuted DeWit’s claim.", "\"The government of Mexico dismisses and categorically denies any statement on the alleged presence of ISIS's operating cells throughout the border region. Mexican authorities have no record of the presence of Islamist extremist groups or individuals in Mexico. Officials from Mexico and the United States maintain permanent contact with each other and continuously exchange information on security threats,\" Morales said.", "A June 2015 State Department terrorism report makes this clear too:", "\"There were no known international terrorist organizations operating in Mexico, despite several erroneous press reports to the contrary during 2014. There was no evidence that any terrorist group has targeted U.S. citizens in Mexican territory.\"", "Our ruling", "DeWit said, \"now we have ISIS coming over the border.\" There is no definitive evidence of that.", "Yes, people with ties to the Middle East have been encountered at the border. Members of terrorist group Hezbollah entered the United States via the border sometime before 2005. But there’s no evidence that terrorists linked to ISIS have crossed the border, and many public safety officials have said flatly that it hasn’t happened.", "For that, we rate DeWit’s claim as False.", "Arizona State Treasurer Jeff DeWit, \"Remarks during CNN’s Newsroom,\" Feb. 22 2016", "House Committee on Homeland Security, \"A Line in the Sand: Confronting the Threat at the Southwest Border,\" accessed March 9, 2016", "House Committee on Homeland Security, \"Countering crime, violence and terror at the southwest border,\" Nov. 15, 2012", "United States Government Accountability Office, \"Checkpoints Contribute to Border Patrol’s Mission, but More Consistent Data Collection and Performance Measurement Could Improve Effectiveness,\" accessed March 10, 2016", "Interview with Arizona Department of Public Safety spokesman Damon Cecil, March 3, 2016", "Interview with Rand Corporation international security expert Colin Clarke, Feb. 26, 2016", "Interview with Duke University intelligence expert Tim Nichols, Feb. 26, 2016", "Interview with DeWit spokesman Sean Dollman, Feb. 28 - March 9, 2016", "Interview with State Department spokeswoman Nicole Thompson, March 9, 2016", "Interview with Mexico embassy spokesman Ariel Moutsatsos-Morales, March. 8, 2016", "U.S. Department of State, \"Country Reports on Terrorism 2014,\" accessed March 9, 2016", "ABC15, \"Border Patrol detains 5 Pakistani immigrants, 1 Afghan immigrant along Arizona border,\" Nov. 19, 2015", "CBS News, \"Syrians Stopped at Texas Border Were Not Sneaking In: Feds,\" Nov. 19, 2015", "The Los Angeles Times, \"Middle Easterners crossing border from Mexico? It’s rare,\" Nov. 25, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]