["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "White House National Economic Council Director Larry Kudlow speaks with reporters at the White House on June 27, 2018. (AP/Susan Walsh)", "Larry Kudlow, director of the National Economic Council for President Donald Trump, raised eyebrows when he said in a Fox Business Network interview that the nation’s deficit is falling on Trump’s watch.", "The economy under President Donald Trump, Kudlow said on June 29, \"is throwing out enormous amounts of new tax revenues. As the economy gears up, more people working, better jobs and careers -- those revenues come rolling in, and the deficit, which is one of the other criticisms (of Trump’s economic policy), is coming down, and it’s coming down rapidly. Growth solves a lot of problems.\"", ".@larry_kudlow: \"The deficit... is coming down, and it's coming down rapidly. Growth solves a lot of problems.\" pic.twitter.com/H375h7rV0a", "As it happens, the deficit hasn’t come down to date -- which sparked a quick backlash on social media and prompted Kudlow to amend his remarks later that day. Kudlow told the Washington Post that \"the economy is so strong right now it’s going to produce lower deficits. I probably should have said future deficits.\"", "However, that assertion is questionable as well. The most trusted source for future budget projections, the Congressional Budget Office, shows rising deficits for years into the future.", "In fiscal year 2015, when Barack Obama was president, the federal deficit was $438 billion. (A refresher: The deficit refers to federal revenues minus federal outlays. Each year’s deficit adds to the overall public debt.)", "In fiscal year 2016, which was also under Obama, the deficit rose to $585 billion.", "In fiscal year 2017, which was about two-thirds on Trump’s watch, the deficit rose to $665 billion.", "The deficit also rose as a percentage of the nation’s gross domestic product -- a way of comparing economic statistics across time. In fiscal year 2015, the deficit was 2.4 percent of GDP, rising to 3.2 percent of GDP in fiscal 2016 and 3.5 percent in fiscal 2017.", "So on a full-year basis, Kudlow is wrong.", "He’s also wrong if you look at the first seven months of fiscal year 2018. According to the Treasury Department, the first seven months of the current fiscal year saw a deficit of $385 billion -- which is 12 percent higher than the first seven months of fiscal year 2017, when the deficit totaled $344 billion.", "As for the future, CBO finds no reason to expect the deficit to go down any time soon.", "For fiscal year 2018, CBO projects a deficit of $804 billion, rising each successive year to $981 billion in 2019, $1 trillion in 2020, $1.1 trillion in 2021, and $1.3 trillion in 2022.", "The deficit is also poised to increase as a percentage of GDP --  from 3.5 percent in 2017 to 4.0 in 2018 and eventually to 5.4 percent in 2022.", "Here’s the full chart from CBO’s most recent projections, released in April.", "Not only that, but CBO specifically cited the tax cut Trump backed and signed into law as a reason for spiraling deficits.", "\"The deficit that CBO now estimates for 2018 is $242 billion larger than the one that it projected for that year in June 2017,\" CBO wrote in its April report. \"Accounting for most of that difference is a $194 billion reduction in projected revenues, mainly because the 2017 tax act is expected to reduce collections of individual and corporate income taxes.\"", "And the projections would be even worse if Congress doesn’t allow the recent round of tax cuts to expire. \"In that scenario, far larger deficits and much greater debt would result than in CBO’s baseline projections for the 2019–2028 period,\" CBO wrote.", "Kudlow said, \"The deficit ... is coming down, and it’s coming down rapidly.\" After being criticized, he later clarified that he \"probably should have said future deficits.\"", "Kudlow’s first formulation is wrong, and his revised version isn’t supported by the most widely trusted barometer -- projections by the CBO. Trump tax bill, which dramatically cut revenues, is a big reason why.", "The statement is inaccurate and ridiculous. We rate the statement Pants on Fire!", "Fox Business Network, tweet, June 29, 2018", "Congressional Budget Office, \"The Budget and Economic Outlook: 2018 to 2028,\" April 2018", "Treasury Department, \"Monthly Treasury Statement of Receipts and Outlays of the United States Government For Fiscal Year 2018 Through April 30, 2018\"", "Office of Management and Budget, \"Table 1.1—Summary of Receipts, Outlays, and Surpluses or Deficits (-): 1789–2023,\" accessed July 2, 2018", "Office of Management and Budget, \"Table 1.2—Summary of Receipts, Outlays, and Surpluses or Deficits (-) as Percentages of GDP: 1930–2023,\" accessed July 2, 2018", "Committee for a Responsible Federal Budget, \"The Deficit Is Not \"Coming Down Rapidly,\" June 29, 2018", "Washington Post, \"Trump’s top economic adviser says deficit ‘is coming down rapidly,’ contradicting virtually all available data,\" June 29, 2018", "Washington Post, \"Trump’s top economic adviser makes a laughable claim about a very basic economic number,\" June 29, 2018", "Washington Post, \"The White House is living in an alternate economic universe\" (editorial), July 1, 2018", "Email interview with Patrick Newton, spokesman for the Center for a Responsible Federal Budget, July 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]