["This Facebook post, which has been shared more than 400 times since it was published on May 3, 2019, contains a picture of schoolchildren being served at a canteen alongside a lengthy caption.", "The caption begins: \"Muslim parents demanded the abolition of pork in all the school canteens of a Perth suburb. The mayor of the Perth suburb of Joondalup, has refused, and the town clerk sent a note to all parents to explain why…\"", "The mayor’s \"note\" quoted in the post states Muslims should adapt to Australia, instead of the other way round.", "Below is a screenshot of the misleading post, showing the caption in full:", "The same claim referring to the Perth suburb of Joondalup has been circulating online since at least April 2017.", "Multiple Facebook posts, for example here – shared around 17,000 times since it was published April 19, 2017 – and here carry the same text and have been shared tens of thousands of times; while the same story has also been posted on websites and forums.", "The claim is false; the office of Joondalup Mayor Albert Jacob said in an emailed statement dated May 7, 2019, to AFP:", "\"The Mayor wishes to advise that the email and Facebook post you are referring to is a work of fiction and he is not affiliated with the author nor is he in any way associated with the person/s circulating this material.\"", "Variations of the hoax, using almost the exact same wording but claiming the incident happened in different locations, have circulated online for years.", "For example, this January 14, 2016 Facebook post about requests to prohibit pork at schools in the British capital London; this September 12, 2014 Facebook post referring to Ath, a district in Belgium; and this January 7, 2016 post about Maryborough, a city in the Australian state of Victoria.", "In the main body of text of these posts, which have been shared thousands of times, only the place names and nationalities are different.", "The image below compares screenshots of the Joondalup misleading post (1) with screenshots of the Ath (2) and London posts (3):", "The claims have been denied by local leaders in the areas mentioned in the misleading posts.", "The then mayor of Ath, Marc Duvivier, issued this rebuttal on the Belgian commune’s website in 2014. The French-language statement, translated into English, says:", "\"An article describing a request for the removal of pork in school canteens in Ath, from Muslim parents, is currently circulating in the form of leaflets.", "\"This document is also being relayed by email, often in good faith, by many Internet users. I hereby declare that no person of any nationality or ethnicity has made such a request to the communal services, to Bruno Boel, communal secretary, or to myself. It's a lie.", "\"An investigation will be launched to identify the author, or authors, of this document. Marc Duviver, Mayor of Ath\".", "Below is a screenshot of the statement:", "A similar denial of the same hoax in this January 7, 2016, Facebook post was made by the mayor of Australia's Maryborough in a local newspaper here.", "The misleading Facebook post referring to Joondalup offers no evidence that Muslim parents in the suburb have demanded a ban on pork.", "Abdul Rahman Yahaya, President of the Islamic Council of Western Australia (ICWA), told AFP on WhatsApp: “We have no idea if any Muslim parents did request the abolition of pork.”", "Below is a screenshot of the Whatsapp messages from Yahaya:", "The misleading Facebook post about Joondalup was uploaded alongside a photograph of several young uniformed girls standing in front of some food trays at an apparent school canteen.", "The photo is not a recent image; it has appeared online since at least 2008, for example in this unrelated report from British newspaper the Daily Mail, which is about high prices in school canteens and does not mention Australia or Muslims.", "Below is a screenshot of the Daily Mail article, dated July 6, 2008:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]