["By Angelo Fichera", "Posted on April 2, 2020", "A false claim that students in Missouri will have to repeat the school year was pushed online through a viral letter with a state logo as part of an April Fool’s hoax. State officials have publicly debunked the claim.", "A fictitious letter that circulated on Facebook as part of an apparent April Fool’s joke stirred confusion about whether students in the state would need to repeat the school year.", "While many shared the phony letter in jest, the falsehood arrived amid the rapidly changing interruptions of everyday life in Missouri and across the U.S. as the country confronts the novel coronavirus outbreak. That combination worked to deceive some, apparently, and prompted state officials to publicly address the hoax.", "The fake letter, dated April 1, claimed that “Missouri case law on education makes it very clear that if students can not take the necessary final exams in a class room setting & they can not complete the curriculum that was established at the beginning of the 2019-2020 school year no one enrolled in a public school in the state of Missouri can be allowed to be promoted to their next grade level.", "“This means that whatever grade each of your students started at in August of 2019 will need to be repeated,” it read.", "The false claim was not unique — we wrote about a spate of similar April Fool’s headlines from a prank-generating website — but it went further by employing the official logo of the Missouri Department of Elementary & Secondary Education. The letter’s detail about final exams may have also been read as a reference to the department’s recent (actual) announcement to cancel statewide required assessments this year.", "Mallory McGowin, a spokeswoman for the department, told us in an interview that the agency received multiple inquiries about the fake letter.", "“We were getting approached by several different of our stakeholder groups inquiring about this or letting us know this was an issue unfolding pretty quickly,” she said. “Because of the current times, I think in some people’s minds, it seemed like it could be a logical conclusion from what’s been happening.”", "“It seems particularly insensitive given the circumstances and given the anxiety and uncertainty that our students, parents and educators are already facing,” she added. “There’s really no room for that kind of misinformation to spread right now.”", "The education department — and Gov. Mike Parson — took to social media to publicly debunk the letter.", "“We could not be more disappointed that someone chose to use their free time to create this document, illegally using our department logo, and make a joke about something as serious as our students’ education,” the department wrote in part.", "One Missouri principal commented and thanked the department for “clearing this up. I had parents very concerned. Not funny.” Other commenters deemed it an obvious April Fool’s prank and observed that the letter was signed by “Candice B. Fureal” (which sounds like “can this be for real”).", "As of now, all of the state’s 555 school districts and charter schools are closed. The earliest some are currently permitted to reopen is April 6, but that is likely to change as the state navigates the outbreak. The state has reported more than 1,800 confirmed cases of the novel coronavirus, which caused the COVID-19 disease, and 19 deaths.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Coronavirus (COVID-19) Information.” Missouri Department of Elementary & Secondary Education. Accessed 2 Apr 2020.", "“COVID-19 Outbreak.” Missouri Department of Health & Human Services. Accessed 2 Apr 2020.", "“Department Cancels Required Statewide Assessments Due to COVID-19: Impact on Local Education Agencies and 2020 Graduating Seniors.” Missouri Department of Elementary & Secondary Education. 1 Apr 2020.", "Hale Spencer, Saranac. “April Fool’s Posts Falsely Claim Students Must Repeat the School Year.” FactCheck.org. 1 Apr 2020.", "McGowin, Mallory. Spokeswoman, Missouri Department of Elementary & Secondary Education. Phone interview with FactCheck.org. 2 Apr 2020.", "Missouri Department of Elementary & Secondary Education (@MOEducation). “This fake letter is circulating on social media, saying DESE will not allow students to move on to the next grade level for the 2020-2021 school year because #COVID19 caused school closures and statewide required assessments to be cancelled. ➡️ That is simply not true. ⬅️…” Facebook. 1 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]