["The claim was published on Facebook here on July 5, 2020.", "The post reads: “THIS IS SO SAD. ....... After hearing Facebook is saying that posting the Lord’s Prayer goes against their policies, I’m asking all Christians please post the Lord’s Prayer:\n\tOur Father who art in heaven hallowed be Thy name, Thy Kingdom come, Thy will be done, on earth as it is in heaven. Give us this day, our daily bread, and forgive us our trespasses as we forgive those who trespass against us and lead us not into temptation but deliver us from evil, for Thine is the Kingdom, the Power, and the Glory forever.”", "Other instances of the claim appear on Facebook here, here, here, here, here and here.", "The claim, however, is false.", "A Facebook spokesperson said posting the Lord’s Prayer does not violate the site’s policies.", "“Our Community Standards are in place to keep people safe and to ensure they feel empowered to express themselves freely on Facebook and outline what is and is not allowed on Facebook. Posting the Lord’s Prayer does not violate our policies,” the spokesperson told AFP in an email on July 23, 2020.", "Facebook’s Community Standards make no reference to the Lord’s Prayer or detail any restrictions on religious expression.", "The false claim was also debunked by fact-checking organisations Snopes and Full Fact.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]