["A Zee News broadcast has gone viral on social media. It shows Indian railway employees protesting against incumbent Minister of Railways Piyush Goyal. As per the video, Indian railway employees raised slogans against the politician.", "A fan page of Delhi Congress MLA Alka Lamba shared the video on Facebook and wrote in Hindi, “Railway employees will not listen to railway minister Piyush Goyal.”  (Translated from रेल मंत्री प्यूष गोयल की बात रेलवे कर्मचारियों ने नहीं सुनी।जय कर नारे लगाए रेल मंत्री मुरादाबाद)", "रेल मंत्री पीयूष गोयल की बात रेलवे कर्मचारियों ने नहीं सुनी। जमकर नारे लगाए रेल मंत्री मुर्दाबाद।", "Posted by Alka Lamba on Thursday, 10 September 2020", "Twitter user @KiranYa37047307 posted (archived link) the video with the same claim. It has in fact been shared by several Twitter users.", "रेल मंत्री प्यूष गोयल की बात रेलवे कर्मचारियों ने नहीं सुनी।जय कर नारे लगाए रेल मंत्री मुरादाबाद। pic.twitter.com/O2cIbwS3mf", "— Kiran Yadav (@KiranYa37047307) September 10, 2020", "Similarly, several Facebook users have also shared the video.", "We noticed that the video carries the date ’17 Nov 2018′ on the bottom left corner. This itself debunks the claim that the incident is recent.", "Next, we performed a keyword search on Zee News YouTube channel and found that the video was indeed uploaded on November 17, 2018.", "As per Zee News report, Goyal faced protests by railway employees in Lucknow over issues of restoring the old pension scheme and regularisation of the service of the apprentices. The same was reported by Business Standard and Huffington Post.", "It is noteworthy that we were unable to find media reports which claim that railway employees have recently staged protests. Centre of Indian Trade Unions (CITU), joined by railways employees and other mass organisations had protested against the privatisation of railways in July.", "Thus, a two-year-old video of protests against Minister of Railways Piyush Goyal has gone viral as recent.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]