["The article by Russia’s pro-Kremlin RT website has been shared thousands of times since it was published in 2014. It has resurfaced on Facebook in recent weeks, racking up more than 4,000 shares since January 28, 2020 in Australia, Canada, India, Nigeria, the UK, and elsewhere. We’ve archived some recent shares of the article here, here and here.", "Many comments on the posts expressed anti-Muslim sentiment.", "“Sharia principles are to become enshrined in the UK legal system for the first time,” the article claims.", "It says that solicitors “will be able to write Islamic wills which will have the power to exclude non-believers completely and deny women an equal share of an inheritance”, as well as amending standard clauses in a will in order to exclude adopted or illegitimate children.", "Solicitors have also been told that “male heirs in most cases receive double the amount inherited by a female heir of the same class” and that “non-Muslims may not inherit at all”, RT reports.", "RT’s article cites a document known as a practice note published in March 2014 by the Law Society, a body which represents solicitors in England and Wales.", "The Law Society issues practice notes to advise solicitors on the application of the law, although solicitors are not required to follow this advice. The organisation has since deleted its advice on sharia succession rules from its website, but you can find an archived version here.", "No change in the law", "RT’s article is misleading; the advice the Law Society issued to lawyers on writing wills for Muslim clients did not amount to a change in the law.", "While some elements were indeed taken from the Law Society’s report, the story’s headline and first paragraph led readers to believe that sharia would become enshrined in UK legislation.", "The Law Society tried to set the record straight on Twitter in March 2014.", "1/3 Reports that the Law Society is promoting 'Sharia Law' are inaccurate and ill informed", "2/3 We responded to requests from members for guidance", "3/3 Our practice note focuses on how to do that, where it is allowed under English law", "Britain’s The Telegraph and The Independent also reported on the Law Society’s advice at the time. Media reports prompted then-justice secretary Chris Grayling to clarify that shariah law had “no jurisdiction in England and Wales”.", "Mashood Baderin, professor of laws at London’s School of Oriental and African Studies (SOAS), said the Law Society’s advice to solicitors was completely legal in accordance with UK law.", "“Sharia law does not apply in the UK,” he told AFP on February 11, 2020.", "He said that solicitors had the right to amend or remove standard will clauses for Muslim clients, such as excluding adopted or illegitimate children from inheritance.", "“There are standard rules on how to make a will, but these are templates. There’s no law that says you can’t change the template”, he said. “You can give your inheritance to anyone. You can give your inheritance to a dog”.", "While sharia councils exist in the UK, they have no legal power. According to a study on sharia law commissioned by the British government and published in 2018, sharia councils are voluntary local groups of scholars who offer advice to Muslims, usually concerning religious marriage and divorce.", "AFP reported on misleading Facebook posts in January 2020 that claimed that the US state of North Carolina had banned sharia law.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]