["The six-minute 50-second video was published here in a Facebook post on November 19, 2019. It was viewed more than 760,000 times before it was deleted.", "The clip, which showed heavy winds toppling trees and ripping roofs off houses, was posted alongside a caption that read: “SUPER TYPOON [sic] IN CAGAYAN TODAY”.", "Below is a screenshot of the misleading post:", "It was shared as thousands of people were fled Cagayan ahead of Typhoon Kalmaegi, which was forecast to swell rivers, cut off roads and threaten low-lying communities across northern Philippines, as reported in this AFP article.", "The same video was also in several Facebook posts, for example here and here, and on YouTube here with a similar claim.", "The claim is false; the video actually shows Typhoon Haiyan battering Roxas, a city in central Philippines, in 2013.", "Reverse image searches of video keyframes extracted using InVID, a digital verification tool, found a high-quality version of the video published here on YouTube on November 14, 2013.", "The video’s caption states: “Exact footage of Typhoon Yolanda at Roxas City”.", "“Yolanda” is the local name for Typhoon Haiyan, which remains the Philippines’ deadliest typhoon on record. At least 7,360 people were killed or went missing in the storm, according to this AFP report published on November 5, 2018.", "Below is a screenshot comparison of the video in the misleading posts (L) and the November 2013 video (R):", "A report from the government’s Disaster Risk Reduction Council confirmed that Typhoon Haiyan made landfall in the Philippines in the days prior to the video being published in November 2013.", "The deadly storm hit several cities across the central Philippines, including Roxas, as seen in the screenshot below of an AFP graphic that details the typhoon’s path:", "The location in Roxas where the video was filmed can be seen on Google Street View here. The location on Google is embedded below.", "Below is a screenshot comparison of the one-minute 17-second mark of the video in the misleading posts (L) and the same street in Roxas on Google Street View (R) with corresponding features circled in red:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]