["About this rating", "In early December 2018, Facebook users circulated a post stating that newly-elected Illinois governor J.B. Pritzker, along with fellow Democratic state lawmakers, had proposed assessing a rather unusual fee against residents who moved out of the state -- a \"departing taxpayer fee\":", "We reached out to Jordan Abudayyeh, Pritzker's spokeswoman, who confirmed that the contents of post circulating on Facebook were \"absolutely not true\" and appeared to be nothing more than a hoax or an unflagged attempt at satire.", "Prtizker, a billionaire and Hyatt hotel heir, won the Illinois gubernatorial race on 6 November 2018 by a wide margin over Republican incumbent Bruce Rauner. Pritzker and his Democratic colleagues supported replacing the state's flat income tax with a progressive income tax, which would mean higher rates for wealthier Illinoisans with tax breaks for others. However, we found no evidence to suggest Pritzker had ever floated charging residents a special tax assessment for moving out of the state, and it's unlikely any such plan could be legally implemented.", "Pyke, Marni.   \"How Would a Graduated Income Tax Work in Illinois? Here's How Three Nearby States Do It.\"\r\n    Daily Herald.   2 November 2018.", "Vinicky, Amanda.   \"Gov.-Elect J.B. Pritzker Backs Off Temporary Tax Plan.\"\r\n    WTTW.   7 November 2018.", "Finke, Doug.   \"Pritzker Suggests Tax Help for Small Businesses to Cope With Minimum Wage.\"\r\n    The State Journal Register.   10 December 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]