["A video of a group of bikers attacked by a mob is circulating on social media. It is being shared with the claim that a BJP-RSS rally, in support of CAA and NRC, was attacked by “communists” in Kerala. The tweet has garnered close to 500 retweets.", "This is how Communists in Kerala attacked peaceful #BJP & RSS bike rally in support of #CAA & NRC.", "Trying to disguise as nationalists in the garb of National Anthem or Tricolor, Leftists can’t hide their hideous face for too long", "#WorldBiggestBikeRally #LEFTISTS_ARE_CANCER pic.twitter.com/vlz1jh1kcG", "— Geetika Swami (@SwamiGeetika) January 9, 2020", "Another Facebook user posted the video on January 9, 2020, with an identical claim.", "Madhu Kishwar retweeted a tweet by @binugazi which alleged the same.", "One Nishant Varma – ReVolter (@varnishant) whose Twitter bio says, “I Pledge Not to Submit any papers for #CAB or #NRC, #कागज_नहीं_दिखाएंगे“, also shared the video. He wrote, “MOST AMAZING VIDEO #Kerala RSS & #BJP Bike rally #CAASupport. See what happened next, U wont Believe #DeepikaPaducone“", "MOST AMAZING VIDEO #Kerala RSS & #BJP Bike rally #CAASupport.", "See what happened next, U wont Believe #DeepikaPaducone pic.twitter.com/p15nMbm5Ar", "— Nishant Varma – ReVolter (@varnishant) January 9, 2020", "With a keyword search on Twitter, Alt News found that it’s a year-old video from Kerala. On January 9, 2019, Twitter user Sanjeevani posted the video with the message, “Here’s how Kerala welcomed RSS bike rally today! Location: Edappal, Malappuram”.", "Here’s how Kerala welcomed RSS bike rally today! ❤️", "Location : Edappal, Malappuram 💁🏻‍♀️#Sabarimala #WomenEntryRow pic.twitter.com/4Yw5WGQquz", "— Sanjeevani (@SanjeevaniPage) January 3, 2019", "Furthermore, we found that the same video was published by The Times of India on January 3, 2019. A group of people attacked a bike rally taken out in support of a strike called in the wake of Sabarimala verdict where the top court allowed the entry of menstruating women in the temple. The rally was held at Edappal in Malappuram district of Kerala. A dawn to dusk hartal was organized by Sabarimala Karma Samithi. According to a report by Kerala news website Manorama, Sabarimala Karma Samithi is a joint platform of Right-wing outfits and BJP, which oppose the entry of women in 10-50 age group into the temple.", "In conclusion, a year-old video of a rally of supporters of hartal against Sabarimala verdict attacked by a mob is shared as a recent video of “communists” attacking pro-CAA rally by BJP-RSS.", "[Update: Madhu Kishwar’s retweet has been added to the report on January 10, 2020.]", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]