["By Chelsey Zhu", "Posted on February 27, 2020", "A viral meme falsely claims that Sen. Bernie Sanders received only 3,444 votes in the Nevada caucuses. He actually won 41,075 votes — more than twice as many as any other Democratic candidate.", "A social media meme falsely states that Sen. Bernie Sanders received just 3,444 votes in Nevada’s Democratic presidential caucuses. He actually received 41,075 votes, securing the greatest number of delegates in the caucuses.", "The meme uses a photo of National Review reporter and Fox News contributor Katherine Timpf that first appeared on Timpf’s Twitter page in September 2019, four months before the Nevada caucuses. An edited version of the photo — which went viral a day after the Nevada caucuses — includes text that says: “Bernie only had 3444 votes in NV. There is more people than that waiting to pee at a Trump rally!!”", "The caption on a Facebook post reads: “The MSM [mainstream media] is making a big deal out of Bernie winning in Nevada. Here are the real facts…lol”", "But the meme doesn’t report the real results from the Nevada caucuses.", "Voters in Nevada choose candidates through a caucus system, in which local political parties organize meetings for each voting precinct to divide up state delegates. Voters arrive at a meeting location on caucus day and gather in groups based on their preferred candidate. If a candidate doesn’t receive enough support to meet a minimum threshold, then his or her supporters disband and can caucus for another candidate.", "The number of people supporting a candidate in the final caucus alignment determines how many county convention delegates a candidate will receive, which then determines how many national pledged delegates a candidate will receive. A Democratic contender must have 1,991 pledged delegates to win the party nomination on the first ballot at the national convention.", "The Nevada State Democratic Party ran its caucuses on Feb. 22 but also allowed early in-person voting from Feb. 15 to 18. According to the Associated Press, Sanders received 41,075 total votes on caucus day and across the four days of early voting, which is 40.45% of all Nevadans who participated in the caucuses. That’s more than twice the number of votes that the runner-up, former Vice President Joe Biden, received.", "Sanders also won 6,788 county convention delegates, giving him 24 national pledged delegates from Nevada.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2020 Caucus: Frequently Asked Questions.” Nevada State Democratic Party. Accessed 26 Feb 2020.", "“Live results: Nevada 2020 Democratic caucuses.” Washington Post. Accessed 26 Feb 2020.", "“Nevada Caucuses 2020: Live Election Results.” New York Times. 24 Feb 2020.", "“2020 Nevada caucus results.” Politico. 24 Feb 2020.", "“Nevada Election Results.” Associated Press. 24 Feb 2020.", "“Presidential Election Process.” USA.gov. Accessed 27 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]