["About this rating", "During her long career, singer Aretha Franklin was occasionally contracted to perform at Trump-owned venues such as Trump Castle, the Trump Taj Mahal Casino, and Trump International Hotel and Tower.", "Aretha Franklin was never an 'employee' of Donald Trump's -- no more so than Frank Sinatra, Liza Minnelli, Michael Jackson, or any of the scores of other entertainers who performed at Trump properties over the years.", "Countless music lovers around the world mourned the passing of \"Queen of Soul\" Aretha Franklin on 18 August 2018. Fellow entertainers such as Diana Ross, Barbara Streisand, and Elton John tweeted warm remembrances, as did former U.S. presidents Bill Clinton and Barack Obama.", "\"In her voice, we could feel our history, all of it and in every shade -- our power and our pain, our darkness and our light, our quest for redemption and our hard-won respect,\" tweeted Obama.", "President Trump, too, paid tribute to Franklin in a brief statement he read at the start of a scheduled cabinet meeting:", "President Trump begins Cabinet meeting by remembering Aretha Franklin: \"I want to begin today by expressing my condolences to the family of a person I knew well. She worked for me on numerous occasions. She was terrific.\" https://t.co/O5OWa3k51H pic.twitter.com/Yo7AkWdsLK", "— CBS News (@CBSNews) August 16, 2018", "Trump's remarks generated more controversy than one would expect from a routine presidential pronouncement. Some people questioned how well Trump really knew Aretha Franklin, if at all. There's not much evidence to indicate they were friends, but a handful of press photographs exist showing the Trump and Franklin posing together at public events during the 1990s, so it seems they were at least acquainted. Franklin reportedly refused to perform at Donald Trump's presidential inauguration.", "What prompted the most chatter was Trump's assertion that \"She worked for me on multiple occasions\" -- and what, precisely, he meant by that:", "anyone have any idea what he means when he says Aretha \"worked for me on numerous occasions\"???? https://t.co/F7Tw8j43Kc", "— Glenn Kessler (@GlennKesslerWP) August 16, 2018", "??? @realDonaldTrump on Aretha Franklin: \"She worked for me on numerous occasions.\" WTF does that even mean? Did he own her or something?!! The guy has zero RESPECT. What capacity did she \"work\" for him??? ???https://t.co/oIypIm5SmS", "— Morgan J. Freeman (@mjfree) August 16, 2018", "Trump is a narcissist. A narcissist always makes everything about themselves, even someone else’s death. I’m sure at some point Aretha Franklin performed at a casino he owned, hence the “worked for me” comment. It’s always about stroking his small...ego. #MeMeMe pic.twitter.com/C8deGAGmTl", "— Scott Nevins (@ScottNevins) August 16, 2018", "We did find a few listings showing Franklin performed at venues on some (formerly) Trump-owned properties in Atlantic City during the 1980s and 1990s. She played a three-day engagement at Trump's Castle (now the Golden Nugget), for example, in December 1988. She headlined the Trump Plaza Hotel Convention Hall (now closed) in March 1994, where she returned almost two decades later in October 2012 to deliver a sold-out performance at the Trump Taj Mahal Casino Resort (now the Hard Rock Hotel and Casino):", "Entertainment listing in the Philadelphia Inquirer, 25 February 1994", "Franklin also performed at an event in conjunction with the grand opening of the Trump International Hotel and Tower in New York City in June 1997, although the performance itself did not take place there. According to the New York Times, Franklin gave a private concert on the occasion at the Mitzi Newhouse Theater in Lincoln Center. Some photographs capture Trump and Franklin posing together at the Trump Tower opening.", "To say that Aretha Franklin sometimes performed at Trump-owned venues is not to say that she was an employee of Donald Trump's, however (although we surmise that this is what he meant when he said that she worked for him). Scores of big-name entertainers have performed at Trump's hotels and casinos over the decades. Can they all be properly said to have \"worked for\" Donald Trump?", "Consider also that Franklin sang the national anthem at more than a few sporting events over the course of her career. Would it be a normal and acceptable use of the term for the Detroit Lions and Toronto Blue Jays to say Aretha Franklin \"worked for\" those teams?", "Call it hyperbole, call it boasting, call it a slip of the tongue, President Trump's claim that Aretha Franklin \"worked for\" him isn't altogether false, yet it is certainly tangential to the truth.", "Regretfully, we no longer have the opportunity to ask Ms. Franklin what she might have thought of it.", "CNN.   \"Aretha Franklin and U.S. Presidents.\"\r\n    16 August 2018.", "Gillette, Sam.  \" The Obamas Pay Tribute to Aretha Franklin as Trump Faces Backlash for Saying 'She Worked for Me.'\"\r\n    People.   16 August 2018.", "Hoban, Phoebe.   \"Trump Shows Off His Nest.\"\r\n    The New York Times.   25 May 1997.", "Longsdorf, Amy.   \"Trump Castle Presents a Rare Show by Aretha Franklin.\"\r\n    The Morning Call.   27 November 1988.", "Suebsaeng, Awawin and Maxwell Tani.   \"Aretha Franklin Bashed Trump in Private, Blew Off Inauguration Invite.\"\r\n    The Daily Beast.   16 August 2018.", "Press of Atlantic City.   \"Entertainers Through Trump Taj Mahal History.\"\r\n    4 August 2016.", "TheUrbanMusicScene.com.   \"Aretha Franklin Packed Out the Trump Taj Mahal Casino Resort in Atlantic City.\"\r\n    8 October 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]