["A campaign hand out from Scott Walker's bid for student body president at Marquette University. There was a controversy over missing student newspapers when Walker ran for the position in 1988.", "The circumstances around Gov. Scott Walker's withdrawal from Marquette University were murky enough to arouse questions, more than two decades later, about whether bad grades or misbehavior may have led him to quit school roughly a year short of a degree.", "Deep dives into Walker's college days by PolitiFact Wisconsin -- and later by national media as he emerged as a Republican presidential hopeful -- showed Walker was in \"good standing\" when he dropped out in 1990, taking a job with the American Red Cross and running unsuccessfully for the state Assembly.", "But no actual documents, such as a college transcript, turned up to shed light on Walker’s academic performance or on a controversy involving his run for student government president.", "Yet on Feb. 27, 2015, while attending the Conservative Political Action Conference outside of Washington, D.C. with other potential White House contenders, Walker suggested there was nothing murky at all about his time at Marquette, a Catholic university in Milwaukee.", "During an interview with Dana Loesch, a conservative radio and Blaze TV talk show host based in Dallas, Walker made a claim as Loesch prepared to ask a question.", "\"A lot of folks like myself thought it a little elitist -- because everybody’s vetting you now. You’ve already been more vetted than the current commander-in-chief,\" Loesch said.", "\"Yeah,\" Walker interjected, with a chuckle. \"And more written about my college days than the president. I unsealed my records.\"", "Really?", "2010", "Let’s start with a closer look at Walker’s claim -- that he \"unsealed\" his records. First, it suggests he did something proactively -- the way presidential candidates often release their tax returns. Second, it clearly suggests the information involved is complete and unfiltered -- that is, the documents themselves.", "In 2010, during Walker’s successful campaign for governor, the Milwaukee Journal Sentinel requested college transcripts from Walker and two other leading candidates, former Republican Congressman Mark Neumann and Milwaukee Mayor Tom Barrett, a Democrat. Neumann and Barrett provided them. Walker refused. Instead, his campaign said Walker had a grade point average of 2.59. (On a 4-point scale, that's in the range of a C-plus or a B-minus.)", "Walker also released a letter from Marquette that showed he attended the school for four years, from 1986 to 1990, and would have needed to stay there for at least another year to get a degree.", "2013", "PolitiFact Wisconsin published its article on Walker’s college days in December 2013. At the time, he was gearing up for re-election and raising his national profile, yet the story of his formative political years remained surprisingly disputed.", "Indeed, Wisconsin Democrats were claiming the governor was \"kicked out\" of student elections at Marquette (a claim we rated False) -- and maybe was booted from Marquette altogether.", "The article reported on Walker’s run, as a sophomore, for student government president. After the Marquette Tribune student newspaper endorsed Walker’s opponent, on the day before the election, there were allegations that Walker supporters emptied editions of the Tribune from racks in high-traffic buildings. Walker’s camp denied the allegations, but Walker lost the election.", "Marquette ordered an investigation, but details of the alleged dumping of the newspapers were not readily available in the public record, much less evidence of who may have been behind the acts.", "Asked by PolitiFact if he was \"forced out\" of Marquette for any reason, Walker said: \"I can say unequivocally that isn’t true.\" And PolitiFact found no evidence that he had.", "But the article made an important point -- that \"publicly available documents cannot fully resolve the question, in part because a federal privacy law blocks release of information on former students unless the person consents. In addition, Walker told us he was sticking to an earlier decision not to release his transcript.\"", "With that in mind, PolitiFact asked Walker if he would allow Marquette to comment on his academic and conduct record. He did.", "Marquette confirmed in a statement that Walker was a student from fall of 1986 until spring 1990 and, when he voluntarily withdrew, was a senior in good standing.", "At Marquette, being in \"good standing\" means a student is eligible to register and has no academic or non-academic conduct issues restricting registration.", "PolitiFact then asked Marquette whether any conduct issues were on Walker’s earlier school record, and was told Walker would have to permit release of that information. Walker did so.", "Walker was in good standing during each term while he was enrolled at Marquette, and was not suspended or expelled at any time, the school said in a letter.", "The school made clear that Walker had authorized only that limited release of information and only to PolitiFact Wisconsin.", "In other words, there was no general release or unsealing of documents.", "2015", "The pattern continued as Walker’s stock as a presidential contender rose.", "In February 2015, two weeks after lengthy stories about Walker’s college days appeared in the Washington Post and Boston Globe, Walker released a one-sentence letter showing he had authorized Marquette \"to confirm my academic standing for each term and that I voluntarily withdrew from Marquette University in good standing in the spring of 1990.\"", "Nothing new there.", "When we contacted the governor’s office for this fact check, spokeswoman Laurel Patrick forwarded us a copy of that letter.", "When we asked if that meant there had  been no unsealing of documents, she replied by saying:", "\"This effectively unseals his records, which is what he said. It gives Marquette University authorization to provide information about his record.\"", "But the limited comments Walker allowed Marquette to make about his record, of course, are far from any unsealing of the records themselves.", "It is more akin to a statement that you paid your taxes on time, rather than producing the returns themselves.", "Our rating", "Walker said he \"unsealed\" his student records at Marquette University.", "In fact, he has taken only the very limited step of authorizing the school to confirm that he was in \"good standing\" during his time at Marquette and that he voluntarily withdrew. We haven’t seen any records.", "We rate Walker’s statement False.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "------", "More on Scott Walker", "For profiles and stories on Scott Walker and 2016 presidential politics, go to the Milwaukee Journal Sentinel's Scott Walker page.", "DanaLoeschRadio.com, Gov. Scott Walker international interview (33:15), Feb. 27, 2015", "Right Wing Watch, \"Scott Walker pushes birther talking about Obama’s ‘sealed’ college records,\" March 4, 2015", "PolitiFact Wisconsin, \"Solving the ‘mystery’ of Scott Walker’s college years and entry into politics,\" Dec. 18, 2013", "PolitiFact Wisconsin, \"Wisconsin Democratic Party says Scott Walker was kicked out of student elections at Marquette University (False),\" Dec. 21, 2013", "Milwaukee Journal Sentinel, \"Is finishing college an issue in governor's race?,\" July 31, 2010", "Washington Post, \"As Scott Walker mulls White House bid, questions linger over college exit,\" Feb. 11, 2015", "Boston Globe, \"Scott Walker’s political ambitions fostered at Marquette,\" Feb. 11, 2015", "Email interview, Gov. Scott Walker press secretary Laurel Patrick, March 5, 2015", "Gov. Scott Walker, letter to Marquette University, Feb. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]