["About this rating", "In 2014, 11 wells in Kern County were closed in an \"abundance of caution\" due to poor administration in aquifer management; some crops in Kern County are irrigated with wastewater (and have been for many years).", "Crops in Kern County are irrigated with \"toxic wastewater\" that has been proved to contain harmful pollutants from fracking activities.", "In early February 2016, social media users began sharing posts warning that specific brands of produce were grown in wastewater that was a byproduct of fracking activity (i.e., the process of drilling and injecting fluid into the ground at a high pressure in order to fracture shale rocks to release fossil fuels) and therefore posed a risk to human health if consumed.", "Many Facebook users linked to a 10 February 2016 post on the blog EcoWatch which recapped the second episode of a web documentary series titled Spotlight California. That post suggested that farmers in a specific irrigation district were \"so desperate for water\" that they used oil wastewater produced by Chevron to grow food crops (including tangerines). The post quoted a retired almond farmer named Tom Frantz saying that the irrigation water being used in that area was toxic (and previously untested):", "The second episode [of Spotlight California], which aired last week, highlighted another aspect of the drought. It shows how farmers are using treated oil wastewater to irrigate their crops, despite the fact that nobody has tested the wastewater to see if it's safe.", "\"There are farmers so desperate for water in one particular irrigation district called Cawelo, they're taking some wastewater to irrigate crops from Chevron. It's being used to grow food for people — citrus crops, grapes, pistachios,\" Tom Frantz told Deol in the episode.", "\"You grow an orange — it's 90 percent water when it gets to the consumer,\" Frantz continued. \"Where did that water come from? It's the irrigation water. The irrigation water is toxic, even at very tiny amounts. Is there a tiny amount of toxicity now in the fruit? Nobody is testing that yet. And they're salting up their soil by using this water, which means ultimately they'll have to stop growing everything.\"", "In order to find out the health impacts of using recycled oil water on crops, Deol joined water scientist Scott Smith as he covertly tested the water for toxic chemicals at the Cawelo wastewater treatment plant.", "\"We found oil and these nasty solvents,\" which can cause \"kidney damage, liver damage and cancer,\" Smith said.", "Social media interest in wastewater irrigation spiked in February 2016, but the issue was neither new nor specific to tangerines.  The subject had been covered in a 14 November 2014 report by San Francisco Bay Area television station KNTV:", "State officials allowed oil and gas companies to pump nearly three billion gallons of waste water into underground aquifers that could have been used for drinking water or irrigation.", "Those aquifers are supposed to be off-limits to that kind of activity, protected by the EPA.", "\"It's inexcusable,\" said Hollin Kretzmann, at the Center for Biological Diversity in San Francisco. \"At (a) time when California is experiencing one of the worst droughts in history, we're allowing oil companies to contaminate what could otherwise be very useful ground water resources for irrigation and for drinking. It's possible these aquifers are now contaminated irreparably.\"", "In \"fracking\" or hydraulic fracturing operations, oil and gas companies use massive amounts of water to force the release of underground fossil fuels. The practice produces large amounts of waste water that must then be disposed of.", "California's Department of Conservation's Chief Deputy Director, Jason Marshall, said that often times, oil and gas companies simply re-inject that waste water back deep underground where the oil extraction took place. But other times, Marshall said, the waste water is re-injected into aquifers closer to the surface. Those injections are supposed to go into aquifers that the EPA calls \"exempt\" — in other words, not clean enough for humans to drink or use.", "But in the State's letter to the EPA, officials admit that in at least nine waste water injection wells, the waste water was injected into \"non-exempt\" or clean aquifers containing high quality water.", "An 8 April 2015 San Francisco Chronicle article concerns over the safety of wastewater irrigation, which followed a March 2015 hearing about water safety practices, suggested that the issues involved stretched back over thirty years due to confusion over which aquifers were designated as allowable for leftover wastewater injection:", "Farmers fear that the groundwater they increasingly need to nurture their orchards and crops may one day show signs of pollution, even if it hasn't surfaced yet.", "\"When I'm concerned for my farm, I'm looking at future generations and reaching a point where they can't use the groundwater because of things we're doing today,” said Tom Frantz, 65, a farmer and retired teacher who grows almonds near the town of Shafter (Kern County).", "The wastewater injection problem stretches back to 1983.", "EPA officials that year signed an agreement giving California's oil field regulators — the state's Divison of Oil, Gas and Geothermal Resources — responsibility for enforcing the federal Safe Drinking Water Act. The agreement listed, by name, aquifers considered exempt, where oil companies could legally inject leftover water with a simple permit from the division. If state regulators wanted to add any aquifers to the list, they would need EPA's aproval.", "But there were two signed copies of the agreement, said Steven Bohlen, the division's new supervisor. Eleven aquifers listed as exempt on one copy weren't included on the other. The state and the oil companies considered those aquifers exempt — perfectly suitable places to dispose of wastewater. The EPA didn't.", "\"We cannot tell, nor can the EPA, which version is correct,\" said Bohlen.", "The bureaucratic confusion didn't stop there. In some cases, the state treated entire aquifers as exempt when, in fact, only specific portions of them had been approved for oil industry use. In other instances, the state issued injection permits for aquifers that the EPA had never declared exempt, [EPA regional adminstrator Jared] Blumenfeld said.", "However, it wasn't until mid-2014 that the issue appeared to come to a head, when the sudden closure of eleven wells in Kern County caused concern about the overall safety of aquifer water to escalate:", "The problem developed over decades, starting with a bureaucratic snafu between state and federal regulators. It was made worse by shoddy record keeping and, critics say, plain negligence. The issue erupted into public view last summer when state officials abruptly shut down 11 waste-injection wells in Kern County, fearing they could taint groundwater supplies already feeding homes and farms.", "So far, tests of nearby drinking-water wells show no contamination, state officials say. But the federal Environmental Protection Agency, which helped uncover the practice, is threatening to seize control of regulating the waste-injection wells, a job it has left to California officials for over 30 years. The state faces a Feb. 6 deadline to tell the EPA how it plans to fix the problem and prevent it from happening again.", "Some tests indicated elevated levels of various substances in well water, but it wasn't clear whether those results had anything to do with previous wastewater injection rather than natural processes:", "Officials have tested samples from nine nearby drinking wells and found elevated levels of arsenic and nitrates. But that's common for this corner of the Central Valley, where arsenic often leaches into the water from the native rocks. The drinking wells may have been protected by distance, said Jonathan Bishop, chief deputy director of the State Water Resources Control Board. Even when the oil companies injected wastewater into an aquifer used for drinking and irrigation, the injection wells were drilled deeper than the drinking wells.", "[Jonathan Bishop, chief deputy director of the State Water Resources Control Board] noted, however, that pollutants can migrate over time. \"We haven't found any impact, but that doesn't mean we aren't concerned about it,\" Bishop said. \"If that aquifer has drinking water, we don't want them injecting into it.\"", "Tests of the water [from a farm near Bakersfield] revealed high levels of salt and boron, both of which can damage trees. [The farm's owner] eventually ripped out 3,500 dying trees. In September, he sued four companies that had been injecting wastewater near his orchard. The wells closest to his property do not appear to be among the injection wells being reviewed by the EPA and the state.", "A 6 April 2015 Newsweek article also examined the controversy.  Their coverage similarly indicated that the concerns over oilfield wastewater were not necessarily without merit, but that available evidence did not yet prove that wastewater injection had polluted any of the area's drinking or irrigation water:", "Little to no independent scientific research has been done on this type of water and how it interacts with crops, soil and surrounding bodies of water. Some scientists say there are too many unknowns associated with the wastewater from oilfields. If it is being used on food, and to irrigate land that lies above drinking water aquifers, we need to know more about it, they say—especially in light of the fact that, as Rodgers notes, the Central Valley hopes to expand its use for farm irrigation during the drought.", "\"There might not be a single risk out there with this practice. But the biggest risk that we have right now is that we just don't know,\" says Seth Shonkoff, an environmental public health scientist and a visiting scholar at the University of California, Berkeley. \"So until we know, we definitely have reason for concern. We know that there are compounds being put down oil and gas wells that you would not want in your food.\"", "To Shonkoff's knowledge, no scientist has ever published a study on what compounds from the oil development process — examples he gives are methanol, biocides and surfactants — might be in oilfield wastewater used on crops. Chevron says these constituents are kept separate from the water delivered to farmers.", "At the time the Newsweek article's publication, Chevron issued a statement about its wastewater disposal practices:", "Chevron, for its part, says testing [in early 2015] showed no heavy metals or chemical toxins were present in the water above maximum allowable levels. The arsenic levels were high, however, but \"issues related to the arsenic concentrations in the water were fully addressed in the process of obtaining the permit from the Central Valley Regional Water Quality Control Board.\"", "\"Protection of people and the environment is a core value for Chevron, and we take all necessary steps to ensure the protection of our water resources.\"", "David Ansolabehere, general manager of the Cawelo Water District, said that the district had performed tests for contaminants over the years despite lack of regulatory compulsion to do so, and that the \"tests have not turned up any positive results.\"", "On 1 July 2015, the Los Angeles Times similarly reported that tests demonstrated no detectable methylene chloride (one of the potential polluntants that prompted earlier concern) in area water supplies:", "Results of the most recent testing of recycled oil field wastewater that Chevron sells to Kern County farmers for irrigation showed no traces of methylene chloride, an industrial solvent that had appeared in previous testing conducted by a clean water advocacy group.", "In a statement, Chevron said the presence of acetone in earlier tests was probably the result of natural biological processes. \"We know of no operational source of acetone within Chevron's oil field processes in the San Joaquin Valley,\" said Chevron spokesman Cam Van Ast. All test results to date, including those conducted by Water Defense, show that water supplied by Chevron to the Cawelo Water District is in compliance with the company's permit from the water board.", "Interest in the quality of water in affected regions of California waxed and waned until the publication of a 1 September 2015 article about \"Californians Boycotting Produce Grown with Oil Wastewater\" (an alarmist headline belied by the article's opening sentence, which stated that produce companies \"may be using contaminated oil industry wastewater to grow their crops.\"", "That article recklessly asserted that the crops in question were being irrigated with water which was \"toxic,\" laden with \"chemicals used in fracking that may be used without disclosure or testing\" and \"laced with carcinogens,\" despite the lack of solid evidence documenting that any of those claims were true:", "A Mother Jones article exposed Sunview, Halos mandarins, Trinchero Family Estates, and Bee Sweet Citrus as companies that use water from Kern County's Cawelo Water District, where oil companies provided half of the water supply in 2014. According to the Los Angeles Times, oil giant Chevron recycles 21 million gallons of water each day that is used on 45,000 acres of crops, about 10 percent of the county's farmland.", "\"How in the world do these corporations think this is OK? This is scary. Hundreds of thousands of Americans put Halos Mandarins into their kids' lunch boxes every day and by all appearances, Halos and other major California growers — some even considered 'organic' — are irrigating their crops with oil wastewater, laced with carcinogens,\" explained Eddie Kurtz, executive director of the California-based Courage Campaign. \"These brands have no plans to stop. If anything, Big Oil wants to find more takers for this toxic water. Consumers and parents all over the country need to take action immediately, educate each other, and stop buying food from these misguided, short-sighted companies.\"", "That article failed to provide answers to the most obvious of questions: Had the fruit grown in that area ever been tested for toxins? Exactly what levels of specific contaminants constituted \"toxic\" for the purposes of these claims? What \"carcinogens\" is the irrigation water \"laced\" with, and what are their levels and sources?", "Los Angeles-area television station KCET addressed the detail-lacking, \"panic-inducing headlines\" associated with this issue in a 16 September 2015 report, noting that:", "As far as panic-inducing headlines go, it's tough to get much more frightening than \"There Might Be Fracking Wastewater in Your Organic Fruits and Veggies.\" Let's break it down: Our organic(!) fruits and veggies are being contaminated by wastewater(!) coming from the diabolic act of fracking(!). A trifecta of trigger points! But there's another word in that headline that needs further examination: Might.", "So, just how big of a worry is it truly? [Blake Sanden of the University of California's Agriculture and Natural Resources program] points me in the direction of Bakersfield Californian writer Lois Henry, who's been writing a series about wastewater irrigating crops in the Central Valley. Her articles, Sanden tells me, are \"a good counterpoint to the misinformation published in the L.A. Times.\" In one of her latest op-eds, Henry runs through a litany of what's wrong with [a] proposed bill [that would require food grown with oil and gas wastewater to be labeled], starting with the fact that fracking wastewater isn't used to irrigate crops.", "Henry reported in her own article that reporting on the wastewater controversy was rife with misinformation:", "The only place food is being irrigated with oilfield produced water is Kern County in the Cawelo Water District. That could change as the Regional Water Quality Control Board is receiving more requests by oil and ag operators to use produced water for irrigation.", "Cawelo has operated its program for more than 20 years. It uses about 640,000 barrels of water a day (27 million gallons or 82 acre-feet) from Chevron's Kern River Field and CRC's Kern Front Field. Wells in those fields are not fracked, by the way.", "That water is first treated at the oilfields to remove as much oil and impurities as possible and then blended with fresh water. The program supplies irrigation water to about 90 farmers growing almonds, citrus and grapes over 34,000 acres.", "The water has always been tested per Regional Water Quality Control Board standards and has always met those standards.", "Yet, an LA Times story used questionable testing from a water activist to imply the water might not be safe. And perhaps the food grown with that water wasn't safe either.", "The paper had to correct a number of inaccuracies in the story, including the water activist's chemical concentrations. Later testing by the Regional Board showed even those corrected concentrations were far higher than what it found. At least one chemical alleged by the activist to be in the water wasn't found at all.", "Eventually, the Times had to report the truth — the Chevron/Cawelo water is safe.", "But the damage was done. Countless other publications ran with the erroneous information. Thanks much.", "The question of whether fruit can be impacted by chemicals in irrigation water is now being studied by a technical group assembled by the Regional Board. [That research] is still in the data collection phase, but prevailing expertise suggests that, no, fruit is not impacted.", "Tom Frantz, a local almond farmer turned environmental activist, says the fact that so little tangible information is available is part of the problem:", "\"They're just continuously injecting billions of gallons of steam in every year and water comes up and they separate it,\" he [said], \"and now it's contaminated water, not fresh water. It’s got lots of salts in it.\"", "It’s disposal for the oil company. They’re giving this water away, because it would cost them a lot of money to dispose of it, so they send this water to the farmers for the cost of delivery and it’s very cheap, like $10 or $20 for an acre-foot [about 326,000 gallons]. I buy water for $150 an acre-foot out of a river. Farmers would pay up to $1000 an acre-foot for really good water, and still be able to make money with certain crops.", "If Chevron would clean that water — let's say they used reverse osmosis on this water, which would clean it — doing that would cost them $600 to $800 an acre foot. Chevron doesn't want to get into the business of purifying water; they have sources of fresh water themselves from the Kern River and the underground areas around the river, so they pump it, contaminate it and give it away to desperate farmers. We're finding out all over Kern County that the injection of the wastewater is being done into water that's somewhat fresh, and that's illegal, and that's been done for years.", "The big unknown is what kind of chemicals or toxic substances are in this wastewater before it gets sent to the farmers. Can they migrate from the roots into the plant and from the plant into the fruit itself? Especially fruits that would have a high moisture content? It's really important, now that this has been brought to light, that some extensive testing be done. For the first time, they are just beginning to test some grapes, we understand, and no results have come back [yet].", "It’s going to take a long time. In another 50 years, we might not be able to farm this land anymore. We need a list of all possible chemicals that have been put into our water.", "A report released in March 2016 by environmental watchdog group Clean Water Action claimed that wastewater from disposal pits was leaching into irrigation aquifers, which in turn were flowing into a tributary of the Kern River, creating further potential problems for farmers.", "We contacted Chevron for further information about the ongoing controversy in Kern County. On 10 March 2016, Chevron representative Cameron Van Ast provided us with extensive detail about the company's water programs in California. He stated that the program in question had been operative for more than two decades and that \"Chevron does not use hydraulic fracturing [fracking] at Kern River Oil Field,\" explaining:", "In 1994, Texaco (now Chevron) entered into a contract with the Cawelo Water District to provide excess produced water to Cawelo for irrigation purposes.", "The water that Chevron provides to Cawelo for agricultural purposes benefits about 90 farmers and is used primarily with permanent crops, such as citrus fruits, nuts, and grapes. After being separated from oil by gravity separation, produced water runs through depurators, which remove fine particulates and oil, and walnut shell media based filters to clean remaining residual oil before traveling 8.5 miles through an underground pipeline to a surface polishing pond. The Total Dissolved Solids (TDS) in the water sent to Cawelo is 520 mg/l. (The EPA standard for drinking water is 500 mg/L)", "From the pond, the processed water proceeds into Cawelo's blending reservoir, known as \"Reservoir B,\" where Chevron's water mixes with fresh water and processed water from other sources, including the Valley Water Management Company. The newly blended water is then sent through Cawelo's canal system, where additional fresh water is added and farmers are then able to draw water for irrigation.", "Van Ast further maintained that Chevron took issue with the bevy of claims made by Water Defense from a scientific standpoint:", "Water Defense has made a range of inaccurate statements to the media regarding our produced water program; specifically that Chevron is suppling tainted water to California farmers.", "These claims are based solely on the work of Water Defense's \"Chief Scientist\" Scott Smith, who, based on publically available information, does not appear to have an advanced degree in any sort scientific study.", "Further, they appear to be based on water sampling of Mr Smith using a type of sponge, which is a non-standard methodology and is not approved by any U.S. regulatory agency for water testing.", "All results from tests performed on water provided by Chevron to the Cawelo Water District have shown that water is in compliance with regulatory requirements and the permits issued by the Regional Water Quality Control Board. These regulatory requirements have been met in every instance, which is often overlooked in reporting.", "Van Ast also addressed claims raised in the Spotlight documentary (addressed above):", "People deserve a fair and accurate picture of Chevron’s produced water program and the benefits it provides to California — but they did not receive it in this web series, which promotes unsubstantiated allegations and omits key facts about produced water at Chevron’s Kern River Oilfield.", "Key omissions and inaccuracies include:", "· That the water is produced from the formation with the oil; it is not fresh water that was injected into the oilfield.", "· The entire treatment process the water goes through before it is provided to the Cawelo Water District and that the water is also blended with processed water from other sources.", "· All results from tests performed on water provided by Chevron to the Cawelo Water District have shown that water is in compliance with regulatory requirements; it is not self-regulated.", "· The entity charged with regulatory oversight over this water, the Central Valley Regional Water Quality Control Board (Water Board), has commissioned a Food Safety Panel to evaluate the use of treated, produced formation water. (Dr. Shonkoff is a member of this Panel.)", "All test results from tests performed by Chevron and the Cawelo Water District have shown that water supplied by Chevron to the Cawelo Water District is in compliance with its existing permit issued by the Water Board. In no instance was any regulatory requirement not met. Chevron’s provision of produced water to the Cawelo Water District for irrigation purposes has been run appropriately for the benefit of California agriculture and in accordance with all regulatory requirements.", "Van Ast concluded by reiterating that Chevron and the Cawelo Water District maintained an \"important conservation strategy\" to \"provide a significant and important benefit to local farmers and California\":", "Chevron is cooperating fully with the Food Safety Panel to evaluate the use of treated, produced formation water while continuing to provide the information requested by the Water Board and/or the Food Safety Panel to document the quality of the water that Chevron is providing to the Cawelo Water District.", "Chevron remains committed to working with regulators and partnering with organizations like the Cawelo Water District on solutions that address California's water crisis.", "The topic of wastewater in California and its effect on tangerines and other produce is a multi-faceted, multi-player controversy that is still under investigation. Research remains underway to definitively determine whether so-called \"frack fruits\" pose any threat to consumers who eat them, but the data collected thus far don't support any claims of danger to human health posed by the consumption of produce grown from crops irrigated with wastewater. Some of the high-profile initial reporting on this issue included misinformation, incomplete information, and other details that made for good social media outrage fodder but were neither evidence-based nor supported by existing data.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]