["About this rating", "The Trump administration has had its share of embattled nominees, but President Donald Trump's pick to head the Central Intelligence Agency in March 2018 is controversial even by those standards.", "Trump nominated the agency's deputy director, Gina Haspel, on 13 March 2018. But her record has come under question both in the U.S. and abroad because of her service while stationed at a secret CIA facility in 2002, leading to allegations that she committed war crimes (with commentary appearing, naturally, in meme form):", "A human rights advocacy group — the European Center for Constitutional and Human Rights (ECCHR) — has called for Haspel to be taken into custody if she travels to the continent. The group has petitioned federal prosecutors in Germany since 2014 to issue a warrant, saying:", "Those who commit, order or allow torture should be brought before a court – this is especially true for senior officials from powerful nations. The prosecutor must, under the principle of universal jurisdiction, open investigations, secure evidence and seek an arrest warrant. If the deputy director travels to Germany or Europe, she must be arrested.", "Andreas Schüller, director of the group's International Crimes and Accountability Program, has said that ECCHR does not expect that Haspel will actually face a warrant; its goal, he said, is that German officials recognize Haspel's alleged actions:", "If you allow her to come here, you are making a clear political decision that you prioritize that over your obligations under the Convention Against Torture… They can't say they didn't know who was coming here.", "Haspel, who first joined the agency in 1985 during President Ronald Reagan's administration, was reportedly in charge of a secret \"black site\" prison in Thailand at which a prisoner and terror suspect, Abd al-Rahim al-Nashiri, was waterboarded. She also allegedly supported the destruction of videotapes in 2005 capturing waterboardings at the prison. (However, a report stating that she was in charge of the facility, code-named \"Cat's Eye,\" at the time another suspect, Abu Zubaydah, was tortured was retracted.)", "The use of waterboarding — or \"enhanced interrogation,\" as officials called it at the time — was banned in 2009 by President Barack Obama. Five years later, the Senate Select Committee on Intelligence released a report criticizing the practice. Sen. Dianne Feinstein (D-California), who was the committee chair at the time, wrote in the foreword to the report:", "CIA personnel, aided by two outside contractors, decided to initiate a program of indefinite secret detention and the use of brutal interrogation techniques in violation of U.S. law, treaty obligations, and our values.", "In March 2018, Feinstein called on the agency to declassify documents related to Haspel's role in the program:", "As we move forward with the nomination process for Ms. Haspel, my fellow Senators and I must have the complete picture of Ms. Haspel's involvement in the program in order to fully and fairly review her record and qualifications. I also believe the American people deserve to know the actual role the person nominated to be the director of the CIA played in what I consider to be one of the darkest chapters in American history.", "Two of Feinstein's GOP Senate colleagues, Rand Paul of Kentucky and John McCain of Arizona, have also called for Haspel to explain how involved she was with the agency's interrogation program while it was active.", "Michaelson, Jay. \"Could CIA Nominee Gina Haspel Be Prosecuted for War Crimes?\"\r\n    The Daily Beast. 19 March 2018.", "Senator Dianne Feinstein. \"Feinstein to CIA: Release Haspel Torture Documents.\"\r\n    15 March 2018.", "Goldman, Adam. \"Gina Haspel, Trump's Choice for C.I.A., Played Role in Torture Program.\"\r\n    New York Times. 13 March 2018.", "Bonner, Raymond. \"Correction: Trump's Pick to Head CIA Did Not Oversee Waterboarding of Abu Zubaydah.\"\r\n    ProPublica. 15 March 2018.", "MacAskill, Ewen. \"Obama: 'I Believe Waterboarding Was Torture, And it Was a Mistake.'\"\r\n    The Guardian. 29 April 2009.", "Paul, Rand. \"Why I'm Against Gina Haspel.\"\r\n    Politico. 18 March 2018.", "Sen. John McCain. \"Statement by SASC Chairman John McCain on Leadership Changes at State Department & CIA.\"\r\n13 March 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]