["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Both Republican and Democratic voters have little love for prescription drug makers. When asked, four out of five Americans say the cost of drugs is \"unreasonable.\"", "Democratic presidential candidate Sen. Cory Booker, D-N.J., has signed on to a bevy of plans to bring prices down.", "\"There are too many people profiteering off of the pain of people in America, from pharmaceutical companies to insurers,\" Booker said at the first Democratic debate in Miami.", "The Trump campaign fired off a reminder that Booker has history with the drug makers.", "\"Cory Booker has accepted over $400,000 from the pharmaceutical industry during his political career,\" @TrumpWarRoom tweeted June 26, the night of the first Democratic debate.", "FACT: Cory Booker has accepted over $400,000 from the pharmaceutical industry during his political career. pic.twitter.com/1HUfFVBGVU", "By one measure, that number is correct. But a more granular look at drug maker political money delivers a lower number, and the tweet gives no hint that Booker stopped taking pharmaceutical money in 2017.", "The Trump campaign sent us to Booker’s career summary page on the Open Secrets website, a reliable source of federal political money data. Booker first ran for Senate in 2013. Since then, people and groups tied to the pharmaceutical/health products industry have given Booker $411,948.", "The number is actually higher. Booker runs a leadership PAC, a common device on Capitol Hill to raise money for a variety of uses, from travel expenses to helping other candidates fund their campaigns. Booker’s PAC got $56,000 since 2014, for a grand total of $468,000.", "There’s an important caveat: That industry group includes much more than drug makers. Drug wholesalers, medical equipment makers and dietary supplement companies all fall under this category. The wholesalers would have a stake in bills aimed at lowering prescription drug costs, but many other companies, such as Nestlé, which owns several dietary supplement brands, and Medtronic, maker of insulin pumps and much more, would go untouched by such legislation.", "Boiled down to drug makers alone, according to data pulled by the Open Secrets staff, Booker’s total is $327,000. That includes both donations to his campaign committee and his leadership PAC.", "One last wrinkle would add some money back in. The Trump campaign tweet was based solely on Booker’s federal receipts. But as mayor of Newark from 2006 to 2013, Booker raised millions. Some of that came from people tied to drug makers. A notable example is Jonathan Sackler, a member of the family behind Purdue Pharma, the maker of OxyContin. In 2009, Sackler gave $26,000 to Booker Team for Newark, a joint campaign committee to help elect Booker and a slate of city councilors.", "At the end of the day, we found that drug makers gave Booker’s campaigns upwards of $350,000. That’s less than the tweet claimed, but still a hefty amount. And if drug wholesalers are added in, the gap largely disappears.", "In June 2017, Booker told NPR he had stopped taking industry donations.", "\"We put a pause on even receiving contributions from pharma companies because it arouses so much criticism,\" Booker said.", "Recently, he tweeted, \"Big pharma companies need to be held criminally liable for the opioid crisis. I’ve said I would not take contributions from corporate PACs, from pharma executives — they are part of this problem.\"", "Big pharma companies need to be held criminally liable for the opioid crisis. I’ve said I would not take contributions from corporate PACs, from pharma executives — they are part of this problem. It’s time to work on a solution. Chip in to help us run a people-powered campaign", "As far as his PAC money, that revenue stream has died for Booker.", "Up through 2016, drug makers had given him $202,000.", "Since then, as the chart below shows, the amount from drug makers directly is zero, with some ongoing donations from individuals who work for drug makers.", "New Jersey is home to many large pharmaceutical companies, including Merck, Novartis and Bristol-Myers Squibb. Individuals who work for them have continued to give to Booker, but since 2016, that has fallen from nearly $100,000 to about $26,000.", "Booker’s campaign noted that he joined with Sen. Bernie Sanders, I-Vt., on a drug importation bill. Booker also put forward legislation that would allow the Medicare program to negotiate lower prices for prescription drugs. These and other measures have drawn strong opposition from the drug industry.", "The Trump campaign said that in the course of his career, Booker has accepted over $400,000 from the pharmaceutical industry.", "The number is close.", "What the tweet ignores is that Booker stopped taking money from pharmaceutical industry PACs and top executives. Since 2016, Booker received zero dollars from drug makers and individual contributions have fallen by 75%.", "The average reader of the tweet would have no idea that Booker has shunned pharmaceutical money for the past two years.", "That’s additional context, but Booker did accept the money in years past. That meets our definition of Mostly True.", "Trump for President, tweet, June 26, 2019", "Center for Responsive Politics, Cory Booker - career donations by industry, accessed June 27, 2019", "Center for Responsive Politics, Everything you need to know about where Cory Booker gets his money, Feb. 1, 2019", "Center for Responsive Politics, Booker receipts: Pharmaceutical makers, June 27, 2019", "New Jersey Election Law Enforcement Commission, Search for contributions, accessed June 27, 2019", "NPR, Sen. Cory Booker On Health Care And The Democrats' Future, June 30, 2017", "Cory Booker, tweet, June 27, 2019", "State of New Jersey, Business portal: Pharmaceuticals, accessed June 27, 2019", "Woodstock Vitamins, The 14 Mega Corporations That Own Your Supplement Brand, March 30, 2018", "Proclinical, The top 10 medical device companies, May 29, 2019", "New Jersey Star Ledger, Newark Mayor Cory Booker has raised $7.5M for upcoming election campaign, report says, May 5, 2010", "Kaiser Family Foundation, KFF Health Tracking Poll – February 2019: Prescription Drugs, March 1, 2019", "The Hill, Booker tries to shake doubts about pharmaceutical ties ahead of 2020, June 13, 2019", "Interview, Zach Parkinson, research director, Trump for President, June 27, 2019", "Email interview, Alex Baumgart, researcher, Center for Responsive Politics, June 27, 2019", "Email interview, Sabrina Singh, spokeswoman, Booker for President, June 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]