["About this rating", "On 23 June 2017, the fake news web site the Last Line of Defense (LLOD) posted an article reporting that actor Johnny Depp will be charged under the Patriot Act for plotting to kill President Trump:", "You’ve probably seen Johnny Depp’s last “Pirates” movie. In fact, you’ve probably seen the last of Johnny Depp. In a shocking announcement this morning, Homeland Security announced that it had enough evidence to charge Depp with conspiracy to assassinate the President and hold him as a terrorist enemy combatant.", "Those words typically mean one thing: Gitmo. That’s where combatants are detained and debriefed. Depp can expect to be subject to intensive interrogation on how an iconic American actor could possibly have fallen so far. Major James Okenhurd told us:", "“Depp’s apartment in the city is a shrine to Mohammed and Allah. He has several copies of the Quran and a collection of prayer rugs. There is no doubt that he is a practicing jihadist.”", "Albeit inspired by an actual incident — an ill-conceived comment Depp made during a public appearance in England (for which Depp later apologized) — the claim that Homeland Security announced he will be charged with terrorism is a complete fabrication (as is the claim that Depp is known to be a devotee of Islam and a \"practicing jihadist\"). No such reports have emerged in reliable mainstream news sources.", "According to the BBC, the Secret Service is tasked with monitoring and following up on threats against the U.S. president and was aware of Depp's statements, but in the absence of proof of a \"real intent to harm,\" artists are generally granted license under the First Amendment to \"wish the president dead\" without legal consequences, as was the case when Madonna made reference to \"blowing up the White House\" earlier in 2017:", "Reacting to the controversy, one Secret Service official told the New York Post that any action against her would depend on whether the remarks were considered a genuine threat — which could also be the case with Johnny Depp now.", "The official said then: \"It's all about intent. Is she intending to do harm to the White House or President Trump? Otherwise it will be characterized as inappropriate.\"", "Other cases included rapper Snoop Dogg, who shot a toy gun at a Donald Trump character in a music video and comedian Kathy Griffin, who posted a photo in which she appeared to hold a fake bloodied head that resembled Mr. Trump.", "Finally, the Last Line of Defense is a self-described \"satirical publication\"  whose content must always be taken with a very large grain of salt:", "DISCLAIMER: America’s Last Line of Defense is a satirical publication that uses the imagination of liberals to expose the extreme bigotry and hate and subsequent blind gullibility that festers in right-wing nutjobs. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "In other words, if you believe this crap you’re a real dumbass.", "Stryker.   \"BREAKING: Johnny Depp To Be Charged And Held Under The Patriot Act.\"\r\n   The Last Line of Defense.   23 June 2017.", "BBC.   \"Johnny Depp on Donald Trump: Crime or free speech?\"\r\n   23 June 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]