["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ricardo Lara (left) and Steve Poizner are running for California Insurance Commissioner.", "Democratic State Sen. Ricardo Lara, who is running for California Insurance Commissioner, showcased his opponent’s past stance on immigration in recent full-page newspaper ads in Sacramento and the Central Valley.", "This claim from the ads caught our attention:", "\"As Insurance Commissioner, Steve Poizner pledged to block immigrant children from ever getting MediCal health insurance.\"", "The Ricardo Lara for Insurance Commissioner 2018 campaign produced the ad above.", "Poizner, who served as insurance commissioner from 2007 to 2011, is running for the open position this year after switching his party affiliation from Republican to Independent.", "The incumbent, Democrat Dave Jones, is termed out.", "California’s insurance commissioner regulates the insurance industry and implements state law, but does not create it.", "We wanted to know whether Lara’s claim about Poizner was accurate. We set out on a fact check.", "Our research", "When asked about the claim, Lara’s campaign consultant Richie Ross pointed to a campaign ad from Poizner's 2010 run for governor, when he took several hard-line stances on immigration.", "The ad shows a car crashing off a cliff, as Poizner says:", "\"We all know California is heading right over a cliff. How did this happen? Years of liberal failure doing too much for too many. Take illegal immigration: Politicians have lacked the guts to tackle the problem. As governor, I will stop taxpayer-funded benefits for illegal immigrants.\"", "In the ad, Poizner doesn’t specifically bring up health benefits, but instead makes the blanket pledge to stop all benefits for undocumented Californians.", "Changed positions", "In April, Poizner told newspaper editorial boards he’s changed some of his positions on immigration.", "\"I regret the tone and direction that we took in that campaign,\" he said in an interview with the Bay Area News Group editorial board this week, calling his approach in that race \"wrong and harmful.\"", "Poizner told the editorial board that he now believes everyone who’s undocumented should be \"put on a path to get documented,\" and young people in the DACA program should be eligible for U.S. citizenship, The Mercury News reported.", "He also told the San Francisco Chronicle editorial board he no longer wants to cut tuition benefits to undocumented immigrants.", "Poizner said he took his previous anti-immigrant positions while under \"huge pressure\" in a competitive primary race against former eBay CEO Meg Whitman, according to the newspaper.", "Poizner’s campaign did not respond to three requests from PolitiFact California on where he stands on the specific issue of providing health benefits to undocumented children.", "During his time in the Legislature, Lara has worked to expand health coverage to all undocumented Californians. In 2015, Gov. Jerry Brown signed Lara's Health For All Kids Act 2015, which gave Medi-Cal coverage to undocumented kids and teens.", "Our ruling", "Democratic State Sen. Ricardo Lara claimed in full-page newspaper ads that his opponent in California’s Insurance Commissioner race, Steve Poizner, \"pledged to block immigrant children from ever getting MediCal health insurance,\" when Poizner previously held the state post.", "Poizner did make a general promise to block benefits for undocumented Californians, though that was eight years ago, in a Republican primary race for governor. He said in an ad: \"I will stop taxpayer-funded benefits for illegal immigrants,\" though he didn’t specify the kind of benefits.", "Notably, Lara’s statement ignores Poizner’s shift on immigration. Poizner told newspapers this spring he now favors some benefits for undocumented Californians and a path to citizenship for DACA recipients, and that his past approach was \"harmful.\"", "Poizner’s campaign did not respond to requests about his stance on health benefits for undocumented children, leaving his position on that unclear.", "In the end, we found there’s some truth to Lara’s statement, but it leaves out important details and takes things out of context.", "We rate it  Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Richie Ross, campaign consultant, Ricardo Lara for Insurance Commissioner, email exchange, Oct. 18, 2018", "Youtube.com, Poizner: In His Words, Oct. 7, 2018", "San Diego Union-Tribune, Immigration grabs stage in GOP race for governor, May 11, 2010", "StevePoizner.com, About Steve, Accessed Oct. 26. 2018", "Los Angeles Times, He once held the job as a Republican, but now Steve Poizner is making a no-party bid for California insurance commissioner, Feb. 12, 2018", "SFGate.com, Ricardo Lara glad that Steve Poizner \"repents\" for past immigration positions, April 27, 2018", "Mercury News, Steve Poizner, now running as an independent, says he regrets past immigration stances, April 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]