["Soldiers from different NATO countries participated in military exercise \"Saber Strike 2014\" in Lithuania on June 17, 2014.", "Two days before President Barack Obama announced he would consider military options for halting a violent Islamic insurgency in Iraq, former vice-presidential candidate Paul Ryan gave a speech on foreign policy.", "The Wisconsin Republican and House Budget Committee chairman, known primarily for his work on domestic issues, argued for a buildup of the U.S. military.", "And he suggested that America’s allies need to do more.", "Speaking June 11, 2014 at a Center for a New American Security conference in Washington, D.C., Ryan said that \"the fight against terrorism is global in scope.  And we can’t fight it alone. We need partners.\"", "He added:", "\"We have to work better with all of our allies, all around the world. In Western Europe, we have to strike a balance. Our friends can’t depend on us for all of their defense needs and we can’t dictate to them all of their defense policies. Every member of NATO has pledged to spend at least 2 percent of their economy on defense. But only three countries do -- Britain, Greece and us.\"", "NATO has 28 members.", "With tensions rising in Iraq, the Ukraine and elsewhere, is it true that only three NATO countries spend at least 2 percent of their gross domestic product on defense?", "NATO's evolution", "The North Atlantic Treaty Organization was created in 1949, largely to provide collective security against the Soviet Union. There were 12 founding members, including the United States, Canada, the United Kingdom, France and Italy.", "The new allies agreed that \"an armed attack against one or more of them … shall be considered an attack against them all\" and that following such an attack, each would take \"such action as it deems necessary, including the use of armed force.\"", "From 2004 through 2011, NATO provided training in Iraq, helping the country develop its armed forces. More recently there has been a focus on the Ukraine, which is not a NATO member. About a week before Ryan gave his speech, NATO's top official said the alliance would finalize a package to modernize Ukraine's armed forces following Russia's annexation of the ex-Soviet republic's Crimea territory.", "The alliance is heavily dependent on the United States. According to NATO’s latest annual report, for 2013, U.S. defense expenditures accounted for nearly three-fourths of all NATO member defense expenditures:", "United States -- 73 percent", "United Kingdom -- 6.6 percent", "France -- 4.9 percent", "Germany -- 4.7 percent", "Since 2007, the U.S. share has increased, from 68 percent, while the overall share from European members has decreased.", "Ryan’s claim", "To back Ryan’s claim, his office cited the 2013 annual report. It notes that NATO members \"have collectively agreed to two guidelines to help encourage an equitable sharing of roles, risks and responsibilities.\"", "One of the guidelines, or goals, as the report also calls it, is that members \"should devote at least 2 percent of gross domestic product to defense.\"", "Only the United States, the United Kingdom and Greece met the 2 percent goal in 2013, the report says.", "But newer NATO figures, released in February 2014, show that a fourth member -- Estonia -- also met the 2 percent benchmark:", "NATO member", "Amount spent on defense", "Percentage of gross domestic product spent on defense", "United States", "$735.2 billion", "4.4", "United Kingdom", "$60.3 billion", "2.4", "Greece", "$5.67 billion", "2.3", "Estonia", "$479 million", "2", "The day before Ryan gave his speech, NATO Secretary-General Anders Fogh Rasmussen called for European allies to increase their defense spending, noting that since Estonia had met the 2 percent goal, he expected other nations could also do so. The fact that only four NATO members had met that mark had also been noted previously by news media including the New York Times and Reuters.", "Our rating", "Ryan said all 28 members of NATO have \"pledged to spend at least 2 percent of their economy on defense. But only three countries do -- Britain, Greece and us.\"", "Ryan neglected to count a fourth member, Estonia. But that oversight doesn’t negate his larger point, which is that few NATO countries meet the 2 percent benchmark.", "We rate his statement Mostly True.", "To comment on this article, go to the Milwaukee Journal Sentinel website.", "YouTube, video of Center for a New American Security conference, (Paul Ryan quote at 1:54:30), June 11, 2014", "Milwaukee Journal Sentinel, \"Paul Ryan calls out Obama, China in foreign policy speech,\" June 11, 2014", "Email interview, U.S. Rep. Paul Ryan spokesman Kevin Seifert, June 12, 2014", "Email interview, NATO spokesman Matthias Eichenlaub, June 17, 2014", "Email interview, Brookings Institution foreign policy senior fellow Michael O’Hanlon, June 12, 2014", "Email interview, National Security Network policy analyst Bill French, June 12, 2014", "Email interview, McGill University political science professor Mark Brawley, June 12, 2014", "Email interview, International Institute for Strategic Studies research associate for defense and economics Giri Rajendran, June 18, 2014", "Associated Press, \"Ukraine crisis prompts security rethink in Europe,\" March 21, 2014", "Reuters, \"NATO chief hopes for summit pledge to raise defense spending,\" June 10, 2014", "Stockholm International Peace Research Institute, Military Expenditure Database, 1988-2013, accessed June 13, 2014", "International Institute for Strategic Studies' Military Balance Blog, \"What now for European defence spending?,\" April 9, 2014", "NATO, Secretary General's Annual Report 2013, Jan. 27, 2014", "NATO, \"Financial and Economic Data Relating to NATO Defense\" news release, Feb. 24, 2041", "Reuters, \"NATO to consider longer-term response to Ukraine crisis,\" June 2, 2014", "Radio Free Europe, \"NATO To Finalize Military Aid Package For Ukraine,\" June 3, 2014", "Defense News, \"U.S. pushes NATO allies to boost defense spending,\" May 3, 2014", "Center for Strategic and International Studies, \"NATO in the land of pretend,\" June 26, 2013", "NATO, \"The two percent defense expenditure guideline,\" accessed June 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]