["About this rating", "Walter \"Blackie\" Wetzel, a former leader of the Blackfeet Nation, helped the NFL develop the Indian head logo for the \"Redskins\" football team, which players debuted on helmets in 1972.", "There's no evidence to prove that he made any art choices regarding colors, lines, or other specifics of the logo's design. Rather, he provided inspiration for it by showing NFL executives photos of Native American leaders that he believed should be part of the Washington team's brand.", "After decades of criticism from Native American activists and allies over the offensiveness of the Washington NFL franchise's \"Redskins\" name, the team on July 13, 2020, said it would drop the controversial title — as well as its Indian head logo — when leaders select a new brand in the future.", "The announcement, which the team made via a press release featuring the Redskins name and logo, sparked a new wave of curiosity among social media users over how, exactly, the team's trademark came to be. Numerous Snopes readers contacted us to determine the legitimacy of the below-displayed meme, which opponents to the name change were circulating online as part of their argument for why the change was not necessary.", "To reach that conclusion, we began by confirming through verifiable evidence that Wetzel, indeed, was a real person and had served in a leadership position for the tribe in northwest Montana.", "An analysis of archived newspapers uncovered several news stories featuring Wetzel, including one in the Great Falls Tribune on July 9, 1969, in which he was described as the former chairman of the Blackfeet Tribal Council and president of the National Congress of American Indians. (NCAI), which represents tribes across the U.S. A directory for that organization said Wetzel served as president between 1960 and 1964.Next, we considered an obituary in Montana's Billings Gazette that said Wetzel died at age 88 on November 8, 2003.", "That profile filled in for us the lesser known details about his life: He was born near Cut Bank Creek on the Blackfeet Indian Reservation, grew up a \"star athlete in nearly all sports,\" attended the University of Montana, and, at one point, considered a career in professional boxing. The obituary stated:", "Other special interests and items which highlighted his life were being a drummer for a jazz band, dancing with movie actress Donna Reed and being the Medicine Man in the movie, \"Grey Eagle,\" which was filmed in the Helena area. Blackie was also very proud of being the force behind the Indian Chief logo of the Washington Redskins pro football team. Blackie and his Washington Redskins' cap were inseparable.", "The obituary went on to detail Wetzel's time in the Army, work to increase housing and employment opportunities for Native Americans, and leadership via the Blackfeet Tribal Council. In that role, the obituary stated, \"Chief White Calf gave him a right of passage of the chieftainship of the Blackfeet Nation and named him 'Siks-a-num,' 'Blackfeet man or man of the Blackfeet people.'\" He was survived by eight children and dozens of grandchildren.", "That means, based on evidence so far, it was true to state that Walter \"Blackie\" Wetzel, a former leader of the Blackfeet Nation, was a \"force behind\" the Indian head logo for the football team. The exact details of his involvement, however, were unclear.", "Next, we moved onto review a 2002 news story by The Washington Post in which Wetzel was interviewed about the moniker and logo. The newspaper reported that, after the football team abandoned early references to Native Americans in its brand and launched a new \"R\" image in the early 60s, Wetzel shared photos of Native American leaders with the team's top executives, and successfully persuaded them to use them as inspiration for a new design on players' helmets. While it's unclear what photos, exactly, Wetzel had used to make his case for the brand overhaul, Montana's Great Falls Tribune said the gallery included a picture of White Calf.", "According to the Post, the franchise created the new helmets with Wetzel's help within weeks, and players debuted them in 1972. Nothing in the news coverage indicates that Wetzel had drafted the details of the logo himself but rather that he provided inspiration for it. Wetzel said in the 2002 interview:", "It made us all so proud to have an Indian on a big-time team ... It's only a small group of radicals who oppose those names. Indians are proud of Indians.", "That means the language in the alleged quote from Wetzel in the above-displayed meme is correct; however, its punctuation ( or lack of ellipses between the first two sentences to note that he had said something more in the interview but the reporter chose not to include it) is misleading. The meme makes it seem like Wetzel had made the statement fluidly without pausing or connecting thoughts about his reaction to the logo and who he believed opposed it.", "The same image appeared on players' helmets through the 2019 season, despite decades-long pushback. Among critics is Bill Wetzel, a grandson to Walter \"Blackie\" Wetzel, who told Montana's Great Falls Tribune in July 2020 that he was bothered by the fact that some people conflated his grandfather's legacy — one that promoted civil rights — with the racial slur, adding:", "My wish is in the future we can concentrate on those much more important, and less polarizing, accomplishments in his legacy. For him, it was a simple issue, he wanted to promote Indigenous people. He also came from a different time. We now know things that people back then did not know about. Issues related to historical trauma and the impact that logos, mascots, and names can have on a group of people. It can have negative far-reaching effects on a demographic without them even knowing it is damaging them in this way. ...", "The team name and logo will change. It’s the right thing to do. People might miss it, but we will all be fine. And as for my grandfather’s legacy, he’s much more than just a logo.", "His opinion on the team's moniker differed with that of his uncle, Donald Wetzel Sr., who told a Washington Post journalist in 2014 that he had \"never heard anything negative about the logo or the name from the tribal members\" he had met.", "In sum, we rate this claim \"Mostly True\" because Walter \"Blackie\" Wetzel, a former leader of the Blackfeet Nation, inspired NFL executives to create the Indian head logo for the \"Redskins\" football team, but there's no proof to show he made decisions about the chosen image's specific design.", "Whyno, Stephen.   \"Washington NFL Team Drops 'Redskins' Name After 87 Years\".\r\n   The Associated Press.   13 July 2020.", "Poets&Writers, 50 & Forward.   \"Bill Wetzel\".\r\n   Accessed 16 July 2020.", "Wetzel, Bill.   \"'Times Change': Grandson of 'Redskins' Logo Designer Comments On Name Change\".\r\n   Great Falls Tribune.   14 July 2020.", "Vargas, Theresa.   \"One Native American Family With Redskins Ties Disagrees On Whether Name Is Offensive\".\r\n   The Washington Post.   6 July 2014.", "Billings Gazette.   \"Walter 'Siks-a-num (Blackie)' S. Wetzel\".\r\n   9 November 2003.", "Native Heritage Project.   \"John Two Guns White Calf\".\r\n   21 May 2012.", "National Congress of American Indians.   \"Previous NCAI Leadership\".\r\n   Accessed 16 July 2020.", "Fisher, Marc.   \"American Indians Among Admirers Of Redskins Name\".\r\n   The Washington Post.   26 January 2002.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]