["Patanjali Ayurved launched an ayurvedic treatment kit called ‘Coronil’ as a ‘cure’ for COVID-19. Indian media outlets ran shows on the kit, referring to it as a ‘breakthrough’ in coronavirus treatment. Ram Kisan Yadav, popularly known as Baba Ramdev, the face of Patanjali, stated that the kit was developed using “clinically controlled trial” and claimed that it was a “100% cure for COVID-19”. Further, Ramdev stated that they had all the required permissions for manufacturing and releasing the drug.", "Subsequently, the AYUSH ministry issued a statement that Patanjali Ayurved has been asked not to advertise the drug as a cure for COVID-19 due to the lack of documents (i.e. proof of efficacy). Ramdev claimed in an interview with India Today that by evening, AYUSH will be sent all the documents related to the research that has been used as the basis of the proof of efficacy for Coronil kit.", "Patanjali released a set of documents that included:", "Thus, apart from the CTRI, only the two research articles were listed as proof of efficacy that the drug provides 100% cure from COVID-19. Further, the license officer of Ayurved Department in Uttarakhand has stated that Patanjali’s application was approved for use as an immunity booster and not a drug for COVID-19.", "In this sci-check, we will look at the composition of Coronil kit and the two studies listed in the Patanjali document.", "The Coronil kit by Patanjali Ayurved is a 100% cure of COVID-19 and has been scientifically tested with clinical trials.", "False", "The Coronil Kit contains three bottles of:", "Apart from the CTRI which is a registration of the Clinical Trial (not a published RCT study), only the two research studies were listed in the document given to AYUSH as proof of efficacy of the drug. None of these studies was the published randomised controlled trials (RCTs) as stated by Patanjali.", "Among the two studies, the first was related to tablet 1 (DRS) in the kit, and the second study was related to only one of the herbs in the Coronil tablet called Giloy. There were no studies in the document provided for Ashwagandha and Tulsi, the other two components of the Coronil tablet. Also, no study was provided for the third drug in the kit Anu Taila (nasal oil drops).", "Further, the CTRI document suggested that 120 COVID-19 infected patients received Coronil treatment and Patanjali has claimed that they were successfully cured at the rate of 100%. However, the CTRI document is only proof of registration of the clinical trial and not proof of results found within the trial. Proof of efficacy should be a published, peer-reviewed study by the research standards in a sizable population.", "In addition, the following two studies were referenced as the scientific evidence by Patanjali to prove the efficacy of Swasari Ras (1st drug of the kit) and Giloy (a part of Coronil tablet or 2nd drug of the kit) for COVID-19.", "Study 1: Balkrishna, A., Solleti, S. K., Singh, H., Tomer, M., Sharma, N., & Varshney, A. (2020). Calcio-herbal formulation, Divya-Swasari-Ras, alleviates chronic inflammation and suppresses airway remodelling in mouse model of allergic asthma by modulating pro-inflammatory cytokine response. Biomedicine & Pharmacotherapy, 126, 110063.", "This study evaluated the effect of Swasari Ras or Divya Swasari Ras (DSR), in mice (not humans) induced in a lab in an allergic asthma model. The drug DSR has neither been tested on inflammatory lung tissue with coronavirus nor was it tested on humans. Allergic Asthma, on which DSR was tested on as part of this study and the disease due to the novel Coronavirus (COVID-19) are completely different diseases, and the mechanisms of the diseases are different as well. Moreover, since the tests for DSR are conducted in non-human species, the study cannot be used as a 100% proof to claim the efficacy of DSR against COVID-19.", "Study 2: Acharya Balkrishna, SUBARNA POKHREL, Anurag Varshney. Tinospora cordifolia (Giloy) may curb COVID-19 contagion: Tinocordiside disrupts the electrostatic interactions between ACE2 and RBD. Authorea. April 16, 2020. DOI: 10.22541/au.158707095.53639175", "The second study is a preprint (i.e. a non-peer-reviewed article), which hasn’t been reviewed by other scientists to ascertain its scientific validity. During this pandemic, there are many pre-prints available due to the speed of the information necessary to hasten the research process. This particular study released by Patanjali Ayurved as a 100% proof of efficacy for Coronil tablet is a molecular study of Giloy herb (Tinospora Cordifolia) through a computer simulation and is not a study on any living species, mice or humans.", "Since the Coronavirus (SARS-COV2) binds to the host cell in humans via its ACE receptor using a spike protein, the study claims that Giloy disrupts this binding by interrupting its electrostatic interactions between the ACE receptor and the receptor-binding protein (RBD) (see image). Both ACE receptors and spike protein RBD are the proteins used by SARS-COV2 to gain entry into the cell.", "The study is simply a molecular dynamics (MD) ‘simulation’ which is a computer simulation, and in this case, was conducted using software called Discovery Studio, Biovia.", "While the study needs peer-review, it is neither a ‘clinical trial’ as claimed by Ramdev or Patanjali, nor does it explore the interactions between the two proteins in humans or any other living species", "Therefore, none of the scientific proofs given by Patanjali suggests that Coronil is an effective treatment for COVID-19 for the following reasons:", "In fact, claiming that such untested drugs will cure a 100% of COVID-19 patients amounts to a false assumption of treatment and depletes them of the opportunity to receive proven treatment where necessary, even though they may not always treat every patient. This practice of false drug manufacturing under the garb of ancient ayurveda endangers the lives of people during the times of a global crisis.", "Balkrishna, A., Solleti, S. K., Singh, H., Tomer, M., Sharma, N., & Varshney, A. (2020). Calcio-herbal Formulation, Divya-Swasari-Ras, Alleviates Chronic Inflammation and Suppresses Airway Remodelling in Mouse Model of Allergic Asthma by Modulating Pro-Inflammatory Cytokine Response. Biomedicine & Pharmacotherapy. 2020 Jun;126:110063.doi: 10.1016/j.biopha.2020.110063", "Acharya Balkrishna, SUBARNA POKHREL, Anurag Varshney. Tinospora cordifolia (Giloy) may curb COVID-19 contagion: Tinocordiside disrupts the electrostatic interactions between ACE2 and RBD. Authorea. April 16, 2020. DOI: 10.22541/au.158707095.53639175", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]