["The 42-second video was shared on Facebook here on April 4, 2020. It has been viewed more than 2,800 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi-language caption translates to English as: “Brazilian TV channels broadcasted Prime Minister Modi’s speech and see what the Brazilians did the night before.”", "In a televised speech on April 3, 2020, Modi urged Indians to light lamps, candles and mobile flashlights on the evening of April 5 as a gesture of “collective resolve and solidarity” during the COVID-19 pandemic.", "The video of people holding lights out on the street was also shared alongside a similar claim on Facebook here, here, here and here and on Twitter here, here and here.", "The same video was shared in other posts, for example on Facebook here, here and here and in tweets here and here, alongside a different claim that the footage shows people in Switzerland participating in India’s vigil.", "The claim is false.", "A reverse Google image search using video keyframes extracted with InVID-WeVerify, a video verification tool, found the same video was published on Facebook here on March 28, 2020, six days before Modi called for the vigil.", "“Look in the streets of Brazil! The people are turning to Jesus in prayer and worship. Can I get an Amen?” the post’s caption reads.", "The same video was also shared on March 27, 2020 here on a Facebook page for Christians in Brazil.", "“Our greatest goal is to reach the promises of the god together and live together with him,” reads the introduction of the Facebook page.", "Audible voices in the video can be heard making religious remarks in Portugese. The audio translates to English as “I am in the hands of my Jesus.”", "Local media reports, for example here on Brazilian news site Folha Vitoria and here on the website for Brazil's Radio 93 FM, stated Brazilians took to the streets nationwide to show solidarity during the COVID-19 crisis.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]