["By Jessica McDonald", "Posted on August 12, 2020", "President Donald Trump exaggerated Americans’ comparative success battling the coronavirus, falsely saying in a press briefing that the U.S. per capita death rate is lower than “most” of Western Europe. He also claimed a 9% decrease in COVID-19 fatalities over the past week, but the data do not show such a decline.", "The president made his comments in an Aug. 10 press briefing at the White House. After noting that the U.S. has more nursing home residents than the U.K. and other European countries, he turned to mortality rates.", "Trump, Aug. 10: Our country also has a higher prevalence of underlying conditions that this virus targets. Yet, we have fewer deaths per capita than the United Kingdom and most other peer nations in Western Europe. So that’s an important — we have fewer deaths per capita than the United Kingdom and most other nations in Western Europe, and heading for even stronger numbers.", "Trump is right that the U.S., which has had about 50 deaths per 100,000 people, has a lower per capita death rate from COVID-19 than the U.K., which has had 70 deaths per 100,000. But he’s wrong when he adds the same is true of “most other nations in Western Europe.”", "As of Aug. 12, according to statistics compiled by Johns Hopkins University, the U.S. has done better on cumulative per capita deaths than Belgium, Spain, the U.K., Italy and Sweden, as well as two tiny microstates — Andorra, located between France and Spain, and San Marino, which is surrounded by Italy.", "But the U.S. also has done worse than France, Ireland, the Netherlands, Switzerland, Luxembourg, Portugal, Germany, Denmark, Monaco, Austria, Finland, Norway, Iceland and Malta. That’s twice as many countries that outperform the U.S. on this particular death metric than those that underperform.", "The following day, Trump altered his claim during a press briefing to exclude the New York tri-state area from the nation’s per capita death figures.", "Trump, Aug. 11: We also have fewer deaths per capita, excluding the disastrous deaths from the New York tri-state area — which had a very, very hard time — and did better than our peer nations of Western Europe, thanks to our excellent and highly advanced medical care and skill — something that the news doesn’t tell you. They don’t tell you that. They don’t like to tell you that.", "It’s not clear why the president would remove New York, New Jersey and Connecticut from the country’s statistics and then compare the per capita rate to other countries that aren’t being given a similar handicap. Still, we found that when those three states are not included, the U.S.’s per capita mortality improves over only one additional country: France.", "Without New York, New Jersey and Connecticut’s collective 52,794 COVID-19 deaths and nearly 32 million people, according to Centers for Disease Control and Prevention and U.S. Census Bureau figures, America’s mortality rate declines to around 37 deaths per 100,000 people. That’s better than France, but no better than the next Western European country, Ireland.", "And while Trump says that the U.S. is “heading for even stronger numbers,” it’s worth noting that deaths per capita will only grow for nations as more deaths accumulate in ongoing outbreaks. Given that the U.S. currently has more daily per capita deaths than nearly all of Western Europe, it’s unlikely that the U.S. could improve its relative position anytime soon.", "Trump also suggests that the U.S. per capita death numbers are all the more impressive since the U.S. has “a higher prevalence of underlying conditions that this virus targets.”", "We asked the White House for support for this claim, but did not receive a reply. We did, however, find a study that found the U.S. to be similar to Europe in terms of underlying conditions that put patients at higher risk of developing a severe case of COVID-19.", "The study, which was published in June in the Lancet Global Health, estimated the number of people at increased and higher risk for COVID-19 in each country, based on age, sex and underlying health conditions such as chronic kidney disease, diabetes, cardiovascular disease and chronic respiratory disease.", "The authors found that 28.5% of the U.S. population has at least one health condition and is at increased risk of developing severe COVID-19, while 5.8% of the population is at high risk. Compared with Europe as a whole, the U.S. is in a slightly better position, with 31% of Europeans at increased risk and 6.4% at high risk. Some countries in Europe fare a bit better than the U.S. on both numbers, such as Iceland and Ireland, but others do not, including the Netherlands and Germany (see this Excel spreadsheet for exact numbers).", "Shortly after his Western Europe claim, Trump touted American progress on the coronavirus.", "“Nationwide, we continue to see encouraging signs,” he said. “In the last seven days, nationwide cases declined by 14%, hospitalizations decreased by 7%, fatalities decreased by 9%.”", "Using figures from the COVID Tracking Project, we found the president to be close on cases and hospitalizations — but off on fatalities. The seven-day average of new coronavirus cases fell 12.5% between Aug. 3 and Aug. 10, although the seven-day average of new tests also declined 6.1%. Hospitalizations dropped 7.6%.", "But for fatalities, the seven-day average declined by only 11 deaths, or 1%, from a daily average of 1,056 deaths to 1,045.", "The White House did not explain the 9% figure or the data used in the president’s statistics. There are various metrics one can use, and different sources of similar data, which might explain some of the discrepancy, but we found none that matched 9%.", "Data from USAFacts, which provides data to the Centers for Disease Control and Prevention, for example, show a 0.07% decline in the seven-day average of new deaths, while the New York Times database shows a 5.5% decline. Oxford University’s Our World in Data actually shows a 1.9% increase in the seven-day average of new deaths for the same time period.", "On Aug. 11, Trump modified his claim downward, saying mortality in the U.S. “has declined by 7%.” The president isn’t explicit about the time period in question, but if he’s referring to a week-long period, as his comments suggest, data from the COVID Tracking Project show a 0.3% increase in the seven-day average in new daily deaths between Aug. 4 and Aug. 11.", "The real question is whether deaths in the U.S. are in fact trending down again, as they did in May and June, before rising in July as outbreaks swept across the South and West. And it may be too soon to tell.", "As Jennifer Nuzzo, a senior scholar at the Johns Hopkins Center for Health Security, previously told us, a week’s worth of data is not usually enough to establish a trend.", "“[T]here can be week to week fluctuations in tests, cases and deaths, so it’s appropriate to see data from two weeks,” she said in an email, to know if a change represents a trend.", "Two weeks prior, daily deaths were slightly below where they were on Aug. 10 and 11, and the seven-day average was still on the upswing, as a graph from the COVID Tracking Project shows.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]