["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Chris Christie recently wielded his veto pen to wipe out more than $900 million in spending passed in the state Legislature’s budget. A flood of press releases from Democrats condemning the governor’s cuts followed.\n\nAnd state Sen. Jim Whelan (D-Atlantic) was among those expressing disapproval.\n\n\"In our proposal, we would have expanded school aid across the board and finally realized the promise of the 2008 school funding reform act by fully funding all schools – urban, rural and suburban. Governor Christie slashed school aid in this budget, preferring instead to extend a tax break for millionaires over funding in the classroom,\" Whelan said in a July 5 news release.\n\nBut Christie claimed otherwise.\n\n\"This budget is not only constitutionally balanced, but represents my commitment to education,\" the governor said in a June 30 news release. \"This year’s budget managed to increase funding by $850 million and does so in a fiscally prudent budget.\"\n\nSo, who’s right? They both are.\n\nWhelan's statement was included in a news release about the governor's line item vetoes of the Democrats' budget proposal and Whelan confirmed to PolitiFact New Jersey that his statement was about the governor’s reductions from the Democrats’ budget.\n\nIn that case, Whelan is correct: the governor did cut state aid for schools from the budget approved by the Legislature. But year over year, Christie increased overall funding for schools.\n\nLet’s break it down.\n\nThe governor always fires the first shot in the state’s budget war. In Christie’s February proposal, state aid to school districts was increased by about $250 million over last year’s budget.\n\nThen, the New Jersey Supreme Court ordered another $500 million in state aid go to 31 urban school systems, the so-called Abbott districts.\n\nWhen Democrats unveiled their budget for Fiscal Year 2012 late last month, an additional $1.1 billion in state aid for schools had been added over the governor’s proposed budget. They also put another $412 million in state aid for non-Abbott districts in a separate bill that would have been enacted only if an income tax rate increase was approved for individuals earning more than $1 million. Christie vetoed both measures.\n\nThe increases in the Democrats’ spending plan also did not withstand Christie’s veto pen.\n\nThe governor cut nearly $500 million in state education aid from the Legislature’s budget. However, he left in more than $446 million in funding that will go to Abbott districts per the court order and another $167 million for other districts.\n\nThat aid, as well as the $250 million in the governor’s original budget proposal that went untouched, equals about $863 million. So,  year over year, funding for schools increased.\n\nWhelan recognized this when PolitiFact New Jersey spoke with him. \"There’s more school aid than last year,\" he said, but argued that the aid still didn’t fully fund all districts.\n\nAs a spokesman for the Senate Democrats put it: the year over year increase \"only tells a partial story, as the only districts being made whole are the Abbotts.\"", "State Treasury Department spokesman Andrew Pratt said, \"Everyone would like to see more aid for schools, however there’s a limit to what we can spend.\"\n\nLet’s briefly touch on the second part of Whelan’s statement, which said Christie made the cuts in state aid for schools, \"preferring instead to extend a tax break for millionaires over funding in the classroom.\"\n\nChristie vetoed a bill that would have raised the income tax on individuals with incomes over $1 million from 8.97 percent to 10.75 percent for two years.\n\nBut is vetoing a tax increase a tax break?\n\nPolitiFact New Jersey tackled this issue before and rated it half true.\n\nLet’s recap.\n\nWhelan said, \"Governor Christie slashed school aid in this budget\" and Christie did cut funds from the Legislature's proposal.", "And although Christie slashed school aid in his first year as governor, he in fact increased school aid year over year from Fiscal Year 2011 to Fiscal Year 2012.\n\nFor these reasons, we rate Whelan’s statement Half True.", "To comment on this ruling, go to NJ.com.", "State Sen. Jim Whelan, Whelan Statement on Governor’s Line-Item Veto; Says State’s Chief Executive Put Politics Ahead of People, July 5, 2011\n\nGov. Chris Christie, Governor Christie Keeps Commitment to New Jerseyans with Balanced Budget, Increased Education Spending and Job Creating Tax Cuts, June 30, 2011\n\nGov. Chris Christie, Governor Christie Releases Fiscal Year 2012 Budget Proposal, Feb. 22, 2011\n\nInterview with State Sen. Jim Whelan, July 5, 2011\n\nInterview with Andy Pratt, spokesman for state Treasury Department, July 8, 2011\n\nEmail interview with Derek Roseman, spokesman for the state Senate Democrats, July 8, 2011\n\nGov. Chris Christie, Summary of Appropriations for FY 2012 Proposed Budget\n\nThe Star-Ledger, Poor N.J. districts must receive $500M more in school funding, state Supreme Court rules, May 24, 2011\n\nThe Star-Ledger, Gov. Christie signs state budget after series of deep cuts, July 1, 2011\n\nNew Jersey Legislature, Senate Bill No. 4000\n\nGov. Chris Christie, Line Item Veto of Senate Bill 4000\n\nNew Jersey General Assembly, Bill No. 4203\n\nGov. Chris Christie, FY 2012 Budget Budget Summary\n\nGov. Chris Christie, Veto of Assembly Bill No. 4203\n\nNew Jersey General Assembly, Bill No. 4202\n\nGov. Chris Christie, Veto of Assembly Bill No. 4202\n\nPolitiFact New Jersey, NJEA ad: Not renewing Jersey’s millionaire’s tax gives break to wealthy residents, June 19, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]