["A Facebook post published on November 6, 2020, features two pictures of armed troops in a street and a caption that translates into English as: “That’s what's happening in Mbarara (a city in western Uganda) right now ...”", "Some online users in the comments appeared to believe that the images were recent and taken in Mbarara city where Wine, a 38-year-old opposition MP whose real name is Robert Kyagulanyi, was expected to launch his official manifesto for the presidential race.", "However, a reverse image search on TinEye revealed (here and here) that the pictures were captured by an AFP photographer on July 3, 2014.", "The photos show security forces patrolling the streets of Uganda’s capital Kampala after the US had warned of a threat by an unknown group to attack Entebbe International Airport.", "“The alert came as travellers flying to the United States from Europe and the Middle East faced tighter security because of new concerns about the development of explosives that could circumvent airport security,” the AFP captions read.", "AFP covered the story here.", "Political tensions in the east African country have escalated ahead of national elections on January 14, 2021. Wine will be challenging President Yoweri Museveni, who has been in power for 33 years.", "Wine has become a popular figure among youth in a country where the median age is less than 16.", "Since becoming an MP in 2017, he has been routinely arrested and put under house arrest, his concerts banned and public rallies dispersed with teargas.", "Museveni, one of Africa’s longest-serving rulers, had the constitution amended for a second time to allow him to run for a sixth term in 2021.", "Wine launched his election campaign on November 7, 2020, in Mbarara amid beefed-up security.", "The launch came four days after he was detained while registering his candidacy. In televised footage Wine was seen being pulled by police from his car and thrown into a van after submitting his nomination papers to election officials in the capital Kampala. His supporters were then violently dispersed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]