["“After PM Modi completed one year of his term in office, I praised him for the work done so far, on which Sonia Gandhi took umbrage and became angry. Once, while coming out after addressing the parliament, I happened to come face to face with her. She was accompanied by Gulam Nabi Azad and Mani Shanker Aiyer, who greeted me but Sonia kept waiting for me to greet her first. She forgot that the First Citizen of the country was in front of her. She had to acknowledge the President of the country and not Pranab Mukherjee. This greatly pained me from inside, that Sonia is so used to subservience.” If Postcard News is to be believed, these are words of former President Pranab Mukherjee extracted from his book. But then Postcard News is not to be believed.", "The Facebook page of the fake news website, Postcard News has posted an excerpt from former President’s book that expresses his admiration for PM Modi and displeasure with Sonia Gandhi. Like a lot of other content on Postcard News, this screenshot is also malicious and fake.", "Last week former President Mukherjee took to Twitter to announce that he looks forward to “penning down my Presidential Years”. The book titled “The Presidential Years” will be published by Rupa Publications would be the fourth book in the series.", "Look forward to penning down my Presidential Years…#CitizenMukherjee https://t.co/Uq81c5yBmA", "— Pranab Mukherjee (@CitiznMukherjee) June 13, 2018", "The earlier books titled, “The Dramatic Decade”, “The Turbulent Years” and “The Coalition Years”, each cover a different time period. According to a statement by Rupa Publications, the autobiographical account will cover the presidential years of Pranab Mukherjee and will also touch upon his relationship with Prime Minister Narendra Modi and the NDA government.” The book is slated for release in December 2018 to coincide with the author’s birthday.", "In an attempt to outdo itself, Postcard News has shared an extract from a book that is yet to be published. In fact, it is yet to be penned down by the author. Former president Mukherjee’s earlier books covered the time period before his presidency. Postcard News has shared a fake passage which is from the period that has not yet been written about by the former president and will be covered in his new book, “The Presidential Years”.", "Even though it is clear that the passage shared by Postcard News is patently fake, Alt News also reached out to former President Mukherjee’s office to check if this was an excerpt from his books. His office stated, “The book ends when he became the President. Covers the period between 2004-2012. So where does the question of something in May 2015 arise?”", "Postcard News has been at the center of fake news that gets circulated on social media. The founder of the website was recently arrested for circulating fake news. As we have always said, the fake news doesn’t exist in a vacuum. It needs an ecosystem of supporters around it who encourage it and help it to flourish. Alt News had documented several instances where prominent leaders of the ruling party have shared the articles of this fake news peddling website. Of late, the editor of the website has even found a place in debates run by Republic TV and has ironically shared views on the menace of fake news. With the likes of Postcard News receiving such encouraging support, we are certain that fake news, morphed images, and doctored videos will continue to be a part of our lives on social media.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]