["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mike Pence, the Republican vice presidential nominee", "Republican vice presidential nominee Mike Pence says that in addition to deporting undocumented criminals and strengthening the border, the United States should be tougher about removing people who overstay their visas.", "\"An enormous number of people come to this country legally and then simply overstay their visas because we make no effort to hold them accountable to that or uphold the law,\" Pence said Sept. 4 on NBC’s Meet the Press.", "People who have overstayed their visas account for a large portion of the estimated 11 million people in the country illegally, about 40 percent by some estimates.", "Are government officials really making no efforts against people who overstay their visas, or to uphold the law?", "Pence’s team guided us to a June Washington Times article that says immigration officials \"catch an abysmally small percentage of the illegal immigrants who arrived on visas but overstayed their welcome.\" The article attributes that factoid to an admission of immigration authorities.", "But there is more to the story.", "Enforcement priorities", "U.S. Immigration and Customs Enforcement does go after visa violators, but the agency prioritizes violent undocumented immigrants.", "The agency’s top focus is the removal of people convicted of violent crimes, such as murder and rape, ICE spokesperson Dani Bennett said via email. People who overstay their visas but don’t pose a threat to national security, public safety or border security fall into ICE’s second priority.", "The conservative-leaning Washington Times reported that at least 480,000 people didn’t leave the country as expected in fiscal year 2015. Immigration officials investigated just 10,000 of these cases and arrested fewer than 2,000 because, as the Times reported, \"the others don’t rise to the level of being priority targets.\"", "The article was based on a June 2016 House Homeland Security Committee hearing on overstays. Homeland Security Department officials testified that out of the nearly 10,000 leads pursued: about 4,100 cases were closed for being in compliance; at least 3,000 were under current investigation; 1,910 were arrested, and the rest were under \"continuous monitoring and further investigation as appropriate.\"", "ICE data shows that out of a total 235,413 removals in fiscal year 2015, about 18,500 were second-priority removals. There’s no breakdown of how many of those were visa overstays (that category also includes those convicted of drug-related crimes, unlawful possession or use of firearm and other misdemeanors).", "Indefinite number of overstays", "Immigration officials and scholars say not much is known about legal immigrants who overstay their visa, so they rely on estimates.", "In 2006, Pew Research Center said visa overstays could make up at least 4 million of the population here illegally, roughly one-third of that population.", "The first legal requirement for an entry-exit system came in the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, according to the Bipartisan Policy Center. It took about 20 years before DHS released its first ever Entry/Exit Overstay Report, though it only contained information for fiscal year 2015.", "Almost 45 million people were expected to leave in fiscal year 2015, the report said, and about 98.8 percent did so on time.", "About 482,700 were still in the country by Sept. 30, 2015, the end of the 2015 fiscal year. That dropped to 416,500 by Jan. 4, 2016.", "Overstay consequences", "While DHS devotes less enforcement resources to visa overstays than it does to border enforcement, violators are still apprehended and removed, said Donald M. Kerwin, executive director of the Center for Migration Studies, a think tank studying international migration.", "Undocumented immigrants also are not eligible for most public benefits, said Robert Warren, an expert on immigration and senior visiting fellow at the center.", "People who overstay their visas and become undocumented may also face limitations when applying for jobs. The Immigration Reform and Control Act in 1986 forbids employers from knowingly hiring people who are not authorized to work in the United States.", "If they leave and want to come back, they may be disqualified from getting a visa and not be let in, said Lazaro Zamora, a Bipartisan Policy Center senior policy analyst.", "Under the Immigration and Nationality Act, unlawful presence for more than 180 days is punishable by a 3-year bar against re-entering, and unlawful presence of one year or more is punishable by a 10-year ban, Zamora said.", "Our ruling", "Pence said, \"An enormous number of people come to this country legally and then simply overstay their visas because we make no effort to hold them accountable to that or uphold the law.\"", "Pence’s statement suggests there are no repercussions for people who overstay their visa. While they are not ICE’s top concern — officials say they prioritize the removal of convicted criminals over visa violators— they can still be deported and barred from coming back into the United States.", "About 8 percent of the 235,413 people removed from the country in fiscal year 2015 belonged to a category that includes visa overstays.", "We rate Pence’s statement Half True.", "NBC News, Meet the Press interview with Mike Pence, Sept. 4, 2016", "Email exchange, Donald Trump/Mike Pence campaign, Sept. 6, 2016", "PolitiFact, Rubio says 40% of illegal immigrants stayed in the U.S. after their visas expired, July 29, 2015", "PolitiFact, John Carter claim that 40 percent of nation's illegal residents came by plane and overstayed visas draws on 2006 estimate, Sept. 6, 2013", "The Washington Times, Illegal immigrants who overstay visas hardly ever caught, feds admit, June14, 2016", "Homeland Security Committee, Overstaying their welcome: National security risks posed by visa overstays, June 14, 2016", "Homeland Security Committee, witness testimony, June 14, 2016", "U.S. Department of Homeland Security, A Review of U.S. Citizenship and Immigration Services’ Alien Security Checks, November 2005", "U.S. Department of Homeland Security, Biometric technology, March 2009", "U.S. Department of Homeland Security, TSA pre-application program, Jan. 22, 2016", "U.S. Department of Homeland Security, Immigration enforcement priorities, Nov. 20, 2014", "U.S. Department of State, Safety & Security of U.S. Borders: Biometrics, accessed Sept. 9, 2016", "U.S. Immigration and Customs Enforcement, ICE Enforcement and Removal Operations Report, Fiscal Year 2015, Dec. 22, 2015", "U.S. Immigration and Customs Enforcement, Form I-9, Employment Eligibility Verification, November 2015", "U.S. Immigration and Customs Enforcement, Immigration and Nationality Act", "U.S. General Accounting Office, Ovestay Tracking, A Key Component of Homeland Security and a Layered Defense, May 2004", "Government Technology, Facial, Iris Scans Track Pedestrians Departing U.S. for Mexico, Feb. 19, 2016", "Bipartisan Policy Center, Entry-Exit System: Progress, Challenges, and Outlook, May 2014", "The New York Times, U.S. Doesn’t Know How Many Foreign Visitors Overstay Visas, Jan. 1, 2016", "The Wall Street Journal, Many in U.S. Illegally Overstayed Their Visas, April 7, 2013", "U.S. Department of Homeland Security, Entry/Exit Overstay Report Fiscal Year 2015, Jan. 19, 2016", "Pew Research Center, Modes of Entry for the Unauthorized Migrant Population, May 22, 2006", "Email interview, Dani Bennett, spokesperson for U.S. Immigration and Customs Enforcement, Sept. 9, 2016", "Email interview, Lazaro Zamora, a senior policy analyst at Bipartisan Policy Center, Sept. 7, 2015", "Email interview, Donald M. Kerwin, executive director at Center for Migration Studies, Sept. 8, 2016", "Email interview, Robert Warren, senior visiting fellow at Center for Migration Studies, Sept. 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]