["The 52-second video was posted here on Facebook on August 27, 2018, and has been viewed over 131,000 times since.", "A caption alongside the video says: “This is the Haj Flight from India.”", "The video shows a flight cabin strewn with toilet paper and rubbish as well as flooded, soiled toilets.", "Below is a screenshot of the misleading Facebook post:", "The same video has been shared in multiple Facebook posts in the last month, for example here and here, as well as here on Twitter and here on Instagram.", "This claim is false; the footage has circulated online since 2016 in reports about a Saudi Arabian Airlines flight from Jeddah to the Ethiopian capital, Addis Ababa.", "The incident was reported here by Arab News on September 7, 2016 and here by Gulf Business, on the same date.", "The first paragraph of the Arab News report reads; “the first flight of Saudi Arabian Airlines (Saudia) Airbus A330 from Jeddah to Addis Ababa in Ethiopia grabbed international attention for all the wrong reasons.”", "“Saudia” is Saudi Arabia’s national airline.", "A reverse image search on Yandex using keyframes from the clip obtained using video analysis tool InVID found this LiveLeak video published on September 6, 2016.", "The headline reads: ‘The disgusting state of an AirBus A330 of Saudi Arabian Airlines”.", "Below is an image comparison screenshot of the video in the misleading post (L) and the 2016 Liveleak video (R):", "The video has previously been shared along with another false claim that it shows a British airways flight from London to Islamabad -- a claim debunked by AFP here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]