["One version of the video, which we’ve archived here, has been shared more than 5,500 times on Facebook. Posted on April 8, it is captioned: “Herdsmen & Boko Haram Attack: Buhari Know the Attackers & Their Sponsors and Security provides him with Information to Act. - El-Rufai. [Karma]”.", "Scannews, one of the Facebook pages notorious for sharing misinformation in Nigeria, shared the same video (archived here) which was similarly miscaptioned to imply that el-Rufai was talking about Buhari and the Zamfara killings in the video.", "The Scannews post has been shared over a thousand times on Facebook and was also posted on Nairaland, the most-visited Nigerian social network.", "Many Nigerian blogs also picked up the story, including Naijaloaded, one of the most visited blogs in the country. Other blogs posted it here and here.", "“We apply military force, we think we can resolve insurgency, it is not going to happen. I have been in government, I ran a territory, and I know the amount of information I get, security reports that I get, as minister,\" el-Rufai is seen saying in the video.", "\"The president gets 50 times that. And I put it to you, and I challenge anyone, including DG SSS to this; the SSS (State Security Service) know who these insurgents are... the president knows them,\" el-Rufai adds.", "Taken out of context and re-captioned, it would be easy to infer that el-Rufai is talking in the video about Buhari and the recent rise in violence in Zamfara state.", "As reported by AFP, dozens of people have been killed so far this year in the northwestern state, where bandits have long been a scourge of rural communities, raiding villages, stealing cattle, burning homes, looting food, and kidnapping for ransom.", "In fact, the video shows el-Rufai appearing on STRAIGHTalk, a programme on TVC television, six years ago. It can be found on YouTube here, dated May 2013.", "At the time, Buhari wasn’t even president: el-Rufai is talking about Buhari’s predecessor Goodluck Jonathan.", "So in the interview el-Rufai is referring to Jonathan when he charges that the president knows who is behind the \"insurgency\". The Boko Haram insurgency, which was the focus of the interview, took hold in Nigeria in 2009, when Jonathan was vice-president.", "According to Nigeria Security Tracker, an online tally run by the Council on Foreign Relations think-tank, Boko Haram killed more than 10,000 people while Jonathan was president from 2010 to 2015.", "The United Nations Refugee Agency (UNCHR) estimates that the Boko Haram insurgency has displaced nearly 2.4 million people in the Lake Chad Basin, and over two million of them are from Nigeria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]