["When insurgents attacked the Capitol on Jan. 6, thieves made off with several stolen items, but despite what a popular tweet claims, U.S. Rep. Alexandria Ocasio-Cortez's shoes were not among them.", "“As most people know by now, many things were stolen during the terrorist insurrection at the Capitol: laptops, mail, even the Speaker’s lectern,” reads a fake tweet made to appear to come from Ocasio-Cortez’s verified Twitter account. “Security cameras also pick up a well-disguised fellow about 5’4” stealing all of my SHOES, for Chrissake. Unbelievable.”", "The tweet appears to have been posted at 2:42 a.m. on Jan. 10 and received 739 retweets, 126 quote tweets and 25,800 likes.", "Social media users across Facebook, Instagram and Reddit have shared varied versions of the tweet since Jan. 10.", "Facebook user Stephen Powell made a 12-minute video explaining how the stolen shoes fulfilled a religious prophecy. His video garnered more than 1,500 likes and reactions on Facebook.", "Others have speculated that the alleged thief was conservative political commentator Ben Shapiro.", "However, the Democratic congresswoman from New York’s shoes were never stolen. While several things were taken during the Capitol riot, including House Speaker Nancy Pelosi’s lectern and a conference room laptop, USA TODAY could find no reports that Ocasio-Cortez’s shoes were among the missing items.", "More:Fact check: What's true about the Capitol riot, from antifa to BLM to Chuck Norris", "USA TODAY reached out to several Facebook, Instagram and Twitter users that posted this fake tweet, and  three responded.", "Powell said he believed the tweet was authentic when it was sent to him, but he removed his video after USA TODAY questioned the tweet's authenticity.", "\"I didn’t check this out at first because it didn’t seem like someone would falsify something like that... what would be the point?\" he wrote.", "The other two said they posted the image suspecting it was not real.", "\"I found it on twitter, thought it was funny, and posted it as a joke,\" wrote GrittyDebs2020. \"There was no time when I thought that AOC was saying that Ben Shapiro had stolen her shoes.\"", "\"I don't think the tweet is even real,\" i_have_no_memes_public told USA TODAY.", "Lauren Hitt, the congresswoman’s communications director, told USA TODAY in an email the tweet was fake. She said Ocasio-Cortez’s staff reported the fake tweet to Twitter and Facebook on Jan. 12. She confirmed with USA TODAY that no shoes were stolen during the attack.", "The congresswoman addressed the falsehood and other misinformation in a Jan. 14 Twitter thread.", "\"On a lighter note there was also another viral photoshopped tweet about my shoes... but also now ppl are asking if I need shoes... no thanks. That was fake too!\" she tweeted. \"Sometimes when people call me 'extreme' I wonder how many fake Facebook stories/posts they’ve been exposed to.\"", "USA TODAY could find no record of the shared tweet on Ocasio-Cortez’s Twitter profile.", "Archived pages of Ocasio-Cortez’s Twitter profile show the viral tweet was not visible on her profile as of 6:28 a.m. Jan. 10, less than four hours after the tweet was allegedly shared.", "More:Fact check: No, Chuck Norris wasn't at the riot at the U.S. Capitol", "USA TODAY has previously fact-checked fake tweets, altered to appear as if they'd come from Ocasio-Cortez's account.", "Federal prosecutors continue to identify and arrest individuals involved in the Capitol riot.", "We rate the claim that U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., authored a tweet about Capitol rioters stealing her shoes FALSE. The congresswoman's office, archived webpages and her own Twitter profile confirm the tweet is fake. There is no evidence any of Ocasio-Cortez's shoes were stolen in the riot.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]