["About this rating", "San Francisco-based CAIR director Zahra Billoo tweeted in 2014 that she had conflicted feelings about Memorial Day due to her \"staunchly anti-war\" beliefs.", "The tweets appeared in 2015 or 2016; Billoo or CAIR demanded the cancellation of Memorial Day or replacement of it with a holiday honoring \"Muslim terrorists.\"", "On or around 15 April 2016, a number of Facebook users linked to a Top Right News article that reported that the Council for Islamic-American Relations, or CAIR, had declared that Memorial Day should (instead of honoring fallen American soldiers) mark the deaths of \"Muslim terrorists\":", "The Muslim Council on American-Islamic Relations (CAIR) has decided that Memorial Day should not honor those American soldiers who have died, instead, it should honor those Muslim terrorists who were killed by American soldiers.", "You read that right. As nearly all Americans come together on Memorial Day to honor those who paid the ultimate sacrifice for the country’s freedom and safety, two CAIR officials spent the holiday weekend differently: questioning whether U.S. troops deserve to be honored and tweeting that the country was “established upon white supremacy.”", "The article was shared by the Facebook page \"Marines United\" on 14 April 2016, which may have led users to think that the item had been published recently. However, the article linked first appeared on 25 May 2015. Curiously, Top Right News neither linked directly to nor embedded the tweets it referenced, and simply displayed partially dated screenshots:", "Other web sites published items on the topic in May 2015 as well:", "She Needs To Take Her Rags & Grab The Next Flight Out Of America! @ZahraBilloo CAIR Director! #RedNationRising pic.twitter.com/Ak1kLrEWas", "— RedNationRising (@RedNationRising) May 24, 2015", "We attempted to find the tweets attributed to CAIR San Francisco Executive Director Zahra Billoo, and noticed that a number of related replies didn't occur in 2015 (the year the article was published) either; both Billoo and detractors debated the issue as far back as 2010:", "RT @MuslimAgorist: Time to redefine #MemorialDay: better yet. A day to remember the fallen heroes of civil disobedience #flotilla — Zahra Billoo (@ZahraBilloo) May 31, 2010", "In May 2014, the claim began making the rounds:", "CAIR Officials Question Whether to Honor U.S. Troops on Memorial Day: https://t.co/SQ6pCFaMfR", "— Ryan Mauro (@RyanMauro) May 26, 2014", "Terrorist Front Group CAIR thinks we shouldn't honor US military on Memorial Day. So says=> .@ZahraBilloo #tcot https://t.co/odGTiv22DH — iPayMyJizyaWith357 (@SonofLiberty357) May 30, 2014", "The year was suspiciously missing from the images of Billoo's tweets in articles like the one quoted above, but two tweets dated 23 May 2014 matched the primary quotations:", "struggles with Memorial Day each year. How does one balance being pretty staunchly anti-war while honoring those who died in the military? — Zahra Billoo (@ZahraBilloo) May 23, 2014", "\"If one dies in an unjust war in which we illegally invaded and occupied a sovereign nation, should that person be honored?\" - @DawudWalid — Zahra Billoo (@ZahraBilloo) May 23, 2014", "More than one article claimed that CAIR called for a repurposing of Memorial Day to honor terrorists instead of soldiers, and misleadingly omitted dates enabling the outrage to be revisited anew each year. In fact, the tweets on which the claim hinged were published by Billoo herself (not the organization) and did not represent an official CAIR position.", "Billoo said nothing resembling \"Memorial Day should not be celebrated [or] should honor 'Muslim terrorists.'\" She simply stated that she felt conflicted about the national holiday, due in part to her own opinions about specific wars that she considered unjust. At no point during those tweets did Billoo or CAIR suggest or demand those opinions in any way influence celebration of Memorial Day. Billoo further described herself as \"staunchly anti-war,\" a position not at odds with conflicted feelings about Memorial Day.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]