["About this rating", "On 6 April 2018, the anti-Muslim blog JihadWatch.org reported that a 36-year-old woman they described as a \"Muslima nurse practioner\" had been arrested on suspicion of decapitating her 7-year-old son the night before, and that the heinous act had been motivated by her religious beliefs:", "“Zero indicators of anything religious, zero indicators of anything cultural,” said Monroe County Sheriff Todd Baxter.", "Yes of course. As always. But what about this? “When you meet the unbelievers, strike the necks ...” (Qur’an 47:4)", "Authorities persist in their assumption that Muslims in the U.S. don’t believe that, and some Muslims, such as nurse practitioner Hanane Mouhib, keep proving them wrong. Why did it occur to her, in whatever rage she was feeling toward her son, to behead him? The “religious” and “cultural” factors kick in at that point.", "Police arrested Hanane Mouhib, 36, on allegations she used a large-blade kitchen knife to stab her son Abraham Cardenas in the back and behead him. In the weeks leading up to the horrifying incident, Mouhib had called 911 twice to complain about mental health issues, resulting in an 19-day stay at Rochester General Hospital. She had been released just ten days prior to the horrifying murder:", "[Monroe County Sheriff Todd] Baxter said that deputies had been called to the location twice [the previous] month when Mouhib had called 911 seeking assistance.", "On March 5 [2018], Baxter said it appeared that she recognized she was having mental health issues and called for help. Deputies took her to an area hospital.", "Three days later, she again called 911 telling dispatchers that she did not feel right. Because of the record of the March 5 encounter, Mouhib was taken to Rochester General Hospital, where she received treatment from March 8 to 26.", "There were no warning signs or indicators that preceded the fatal stabbing, Baxter said. What happened appeared to be \"an isolated incident\" inside the house, and there was no sign of a fight or altercation.", "No evidence has been released to the public identifying what Mouhib's religious beliefs are, and the claim that she is Muslim appears to be based solely on the fact that she has an Arabic-sounding name. Furthermore, police investigating the murder said they have not found any indication that the killing was influenced by whatever Mouhib's beliefs might be.", "When asked by a reporter during a press briefing whether Mouhib's act \"was any kind of maybe religious ritual,\" Monroe County Sheriff Todd Baxter responded by saying that \"No, someone else asked me that question. Absolutely zero indicators of anything religious, zero indicators of anything cultural ... We have seen zero on that. There is really no indicators of that 'why.'\"", "Authorities have said they do not yet know what prompted Hanane Mouhib's alleged attack on her son.  Mouhib pleaded not guilty to murder charges at her 6 April 2018 arraignment on second-degree murder charges and is currently being held without bail.", "JihadWatch is a generally unreliable source of information that has been \"repeatedly criticized by numerous academics who believe that it promotes an Islamophobic worldview and conspiracy theories.\"", "Frelie, Victoria E. and Sean Lahman.   \"Sweden Mom Charged in Brutal Slaying of Her 7-Year-Old Son.\"\r\n    Democrat & Chronicle.   6 April 2018.", "Hernandez, Salvador.   \"A Mom Allegedly Decapitated Her 7-Year-Old Son Just Days After She Was Released from a Hospital.\"\r\n    BuzzFeed News.   6 April 2018.", "Associated Press.   \"Police: Mom Used Kitchen Knife to Decapitate 7-Year-Old Son.\"\r\n    Star Tribune.   6 April 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]