["About this rating", "For the first time in a generation, voters in Virginia handed the state's Legislature over to a Democratic majority, an event that has resulted in a backlash from conservatives, most visibly around issues like gun regulation, but also in the spread of online misinformation.", "On Jan. 22, 2020, the junk news site Big League Politics published an article reporting that Democratic legislators in the Virginia state assembly were planning to \"criminalize dissent\" against Democratic Gov. Ralph Northam and other state officials. The article stated that House Bill 1627, which was introduced on Jan. 16, 2020, \"explicitly criminalizes free speech, in what would constitute a blatant attack on the 1st Amendment of the Constitution.\"", "Big League Politics also reported that the bill made it a crime to \"use a computer or computer network to communicate obscene, vulgar, profane, lewd, lascivious, or indecent language, or make any suggestion or proposal of an obscene nature, or threaten any illegal or immoral act\" in regards to state legislators.", "But that reporting was misleading. First, the bill makes no mention of criminalizing dissent. That would likely violate the First Amendment of the U.S. Constitution anyway. Second, the harassment behaviors outlined above were already illegal under Virginia's existing \"harassment by computer\" law.", "House Bill 1627 specifically proposes that if a victim of such harassment was the \"Governor, Governor-elect, Lieutenant Governor, Lieutenant Governor-elect, Attorney General, or Attorney General-elect, a member or employee of the General Assembly, a justice of the Supreme Court of Virginia, or a judge of the Court of Appeals of Virginia,\" then the venue for prosecution would be Virginia's capital, Richmond.", "In other words, the bill didn't outlaw dissent against Virginia lawmakers but simply outlined where a violation of existing harassment law could be prosecuted when the alleged victim is a state official.", "HB 1627 stated:", "Any person violating any of the provisions of this article may be prosecuted either in the county or city from which he called or in the county or city in which the call was received, or in the City of Richmond if the person subjected to the act is one of the following officials or employees of the Commonwealth: the Governor, Governor-elect, Lieutenant Governor, Lieutenant Governor-elect, Attorney General, or Attorney General-elect, a member or employee of the General Assembly, a justice of the Supreme Court of Virginia or a judge of the Court of Appeals of Virginia.", "As of this writing, the bill had been introduced in the Legislature but not passed.", "Virginia Legislative Information System. \"House Bill 1627.\"\r\n    16 January 2020.", "Big League Politics. \"Virginia Democrats Push Legislation to Make Criticism of Government Officials a Criminal Offense.\"\r\n    22 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]