["About this rating", "In February 2020, an image supposedly showing a new product from condom-maker Trojan circulated on social media.", "While the above-displayed image was frequently shared with humorous captions, some social media users appeared to find the product plausible enough to be real. But this is not a genuine photograph of a Trojan product. This is a digitally manipulated image created by Adam Padilla.", "Padilla posted this image to his Twitter account on Valentine's Day 2020. If you look in the top right of the image, just below the \"KY Me & You\" product, you can see a watermark for \"Adam.The.Creator.\"", "This is not the first time that Padilla's digital content has managed to fool viewers on social media. Padilla is behind other humorous fake products, such as baby's \"First Vape\" and \"Monster Energy Caffeinated Ham.\"", "While Trojan Pre-Owned Condoms aren't a genuine product, some condom manufacturers are trying to make a more environmentally-friendly condom. The company Glyde, for instance, bills itself as the \"first certified ethical, vegan, and fair-trade premium condom brand.\" Sustain Natural uses latex from a Fair Trade rubber plantation and manufactures their condoms in a solar-powered factory.", "The New York Times reports that Trojan, too, makes some condoms that are free of nitrosamines, a possible carcinogen found in many popular condom brands.", "Gelles, David.   \"Eco-Friendly, Nontoxic and Vegan: It’s a Condom.\"\r\n    The New York Times.   17 February 2020.", "Ro, Lauren.   \"The Best Eco-Friendly Condoms and Lubes, According to Sex Experts.\"\r\n    New York.   28 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]