["The video appears here, here and here on Facebook and was widely viewed here before YouTube removed it for violating its standards. But it still exists here and here on the site, asserting that people can kill the novel coronavirus by breathing in hot air in a sauna or desert environment.", "“Breathing deeply for just a few minutes in any of these hot locations will kill a high percentage of any coronavirus that happens to be invading the upper respiratory system. And a second or third exposure about an hour apart will kill the rest,” says the video’s narrator.", "“No desert or sauna available? No problem. The common, widely available hand-held blow dryer, used for drying hair, contains a heating element and a fan that instantly deliver forced hot air temperatures that will kill coronavirus even faster,” the speaker says.", "The video cites this World Health Organization (WHO) page and this article abstract for information about the temperature at which heat kills the novel coronavirus. But both are about the effect of heat on SARS-CoV -- another coronavirus that was first reported in 2003 -- in laboratory testing, not in a person who had been infected.", "The narrator in the video is identified as Dr. Dan Lee Dimke. This website says a person by that name has a PhD in education -- a description also repeated in an “About the Author” section on Amazon -- and that he is the CEO of Future World Corporation.", "This section of Future World’s website, which links to the video and provides a transcript, includes the disclaimer: “This procedure presented in this video is NOT a cure for coronavirus! It has not yet been endorsed by any health authority.”", "Dr. Benjamin Neuman, an expert in coronaviruses who chairs the Biological Sciences department at Texas A&M University-Texarkana, said the sauna, desert and hair dryer methods would not be effective.", "“Breathing from saunas or a hair dryer would not have any effect on preventing or treating coronavirus, and both are downright weird,” Neuman told AFP by email, adding that relying on desert air for that purpose is “equally insane.”", "“There isn't any strong evidence connecting environmental temperature to the transmission of coronavirus -- it's more about how long you spend in close proximity to an infected person,” he said.", "“I could think of as many reasons why it would potentially exacerbate an infection as reasons why it might help.”", "Dr. Karine Le Roch -- a professor of cell biology at the University of California, Riverside -- echoed Neuman’s analysis.", "“So far there is ABSOLUTELY no evidence that the COVID-19 virus can be treated via heat,” Le Roch told AFP by email.", "Regarding using a hair dryer, “there is ABSOLUTELY no scientific evidence that it can prevent you from catching COVID-19 or treating the novel coronavirus,” she added.", "The WHO says current evidence indicates that the novel coronavirus “can be transmitted in ALL AREAS, including areas with hot and humid weather.”", "None of the methods advocated in the video appear on the WHO’s page offering advice to the public about the virus.", "The US Centers for Disease Control and Prevention (CDC) says on its novel coronavirus frequently asked questions page: “It is not yet known whether weather and temperature impact the spread of COVID-19.”", "None of the methods suggested in the video appear on the CDC’s page on how to protect against the virus, nor this page about caring for yourself if you are sick.", "The novel coronavirus originated in China in late 2019 but it has spread globally, killing more than 9,000 people, wreaking economic havoc from Asia to Europe and the United States in a public health crisis that governments are struggling to halt.", "AFP Fact Check has debunked more than 130 instances of rumors, myths or misinformation about the novel coronavirus.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]