["About this rating", "On Jan. 20, 2021, shortly after former U.S. President Donald Trump left office, an image started circulating online that supposedly showed the Oval Office at the White House being fumigated:", "This is not a genuine photograph of the Oval Office being fumigated after Trump left office. This picture originated with a satirical article published in 2017 by the Waterford Whispers News titled, \"Oval Office Fumigated After Complaints Of Overwhelming Smell Of Bullshit.\"", "The Waterford Whispers News, which carries a disclaimer labeling its content as fiction, created this image from a Shutterstock photo of the Oval Office. Here's a comparison of the real image (left) and the fake photo (right):", "Although this image of the Oval Office being fumigated is fake, the White House will truly get a thorough cleaning before President Joe Biden takes residence.", "CNN reported:", "A thorough cleaning is part of the every-four-years tradition that comes with the outgoing president and his family swapping White House living with the incoming president and family.", "The delicate and highly choreographed event of packing up and moving out, and unpacking and moving in, done by dozens of prepped and trained staff and movers, typically occurs in the six-hour window when both the exiting and entering presidents and their spouses attend Inauguration Day ceremonies on Capitol Hill. By the time the new president and first lady return to the White House, all of their stuff will have been moved in and ready to go -- down to a refrigerator stocked with their favorite foods and the master bathroom equipped with their preferred shampoo.", "But, like most things Trump administration, this January 20 won't be very traditional.", "Before the Bidens move in, the White House will first undergo a Covid-19 cleansing, top to bottom, from East Wing to West Wing. According to federal contract data reviewed by CNN, the total for the amplified White House inauguration deep clean right now hovers near a half-million dollars.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]