["About this rating", "In New Jersey, a dog was rescued from the woods after being found tethered by a cable to a tree next to a travel kennel. Another dog in a separate incident was found stuck in a creek in Broken Arrow, Oklahoma.", "A viral content website falsely combined the stories of both dogs as if it all happened to one pup. There was no \"heavy chain,\" nor was there a \"giant bite taken out of the side\" of the pet kennel.", "Since at least September 2019, the website Science 101 has run  the story, \"Man Thinks He’s Rescuing A Beaver Until He Gets A Closer Look.\" A variation of the headline also ran in an ad: \"Man Mistakenly Rescues 'Beaver' Then He Took Off Its Shirt.\" The story told of a man named Jim Passmore and his two dogs walking in the woods in Broken Arrow, Oklahoma. In Science 101's protracted telling of the tale, Passmore stumbled upon a wounded animal in the creek. Passmore then noticed an abandoned pet kennel nearby, the kind used as a crate for air travel:", "Perhaps this was just something unrelated. Some thoughtless person must have decided to get rid of an old kennel by abandoning it near the river. The fact there was a nearby beaver or other large rodent must just be a coincidence, right? Jim decided to peer into the animal cage just to be sure. From outside he could see a blanket hanging out of it. Maybe local animals like the nearby beaver liked using the cage for shelter. Beavers and other rodents are nothing if not resourceful, after all. But this was no shelter for animals — this was something disturbing. What he saw filled him with dread. In addition to the filthy blanket protruding from the cage, Jim observed animal feces surrounding it. But this wasn’t what disturbed him. What sent chills down his spine was the heavy chain latched to the cage. Clearly, something had been chained to this cage and left to die. Part of the cage had been scratched and torn. There was a giant bite taken out of the side where something must have escaped from.", "The story ended with Passmore walking back down to the creek and rescuing what he thought was a beaver. It turned out to be a dog named Teddy.", "This story was extremely misleading. The bad news is the author combined images and details from two true stories about dogs found in the woods into one dramatic and false narrative. The good news is that the two real dogs were rescued and were doing well.", "In March 2017, it is true that Passmore, while walking his dogs, saw what he thought was a beaver, but it turned out to be a dog. Fox 23 published a video report, with journalist Lynn Casey calling the Collie mix named Teddy \"just about the saddest dog you have ever seen.\" Police and firefighters were on the scene to help rescue Teddy. Passmore posted several videos showing the rescue, including moments when a wheelbarrow was used to get Teddy from the creek and up the street to an animal control truck.", "In a completely separate incident, on an unknown date in 2018, a German shepherd named Genesis was found \"tethered to a tree by a thick cable\" in the woods in New Jersey. The Dodo reported that the dog was tied up near a \"neighboring apartment complex\" and that \"only a plastic doghouse and a few empty bowls\" were left to help her. Alex Kelly, an animal control officer with New Jersey's Irvington Township, retrieved Genesis.", "Kelly's photos included one showing Genesis tied up, the very same image that Science 101 cropped Genesis out of for the purpose of its fictional story. Below you can see the image posted in Science 101's story on the left, and the original on the right.", "The most recent photo of Teddy on his Facebook page, Teddy's Big Adventure, showed him in a new bed in front of a cozy fire. An adoption website and the Associated Humane Popcorn Park Shelter both confirmed that Genesis had found a home. In 2018 it posted this video of one happy girl:", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]