["“Chris Wallace with Epstein. Now are you awake. ?” reads an October 1, 2020 Facebook post shared 1,300 times. In the photo, Wallace appears to walk along a pier with two women and a man.", "More examples of the claim are available on Twitter here, and in Spanish here and here.", "In a second photo used in a similar claim, a man helps Wallace climb onto a boat. That version of the post is found on Facebook here and here and on Twitter here.", "However, neither photo shows Wallace with Epstein, who owns two private islands in the US Virgin Islands and was accused in July 2019 of abusing minors. Epstein died by suicide in a New York jail later that year while awaiting trial on charges that he trafficked and sexually abused dozens of girls as young as 14 between 2002 and 2005.", "A reverse image search of the picture with four people, with results limited to before 2019 when Epstein was arrested, yields an August 2012 Politico video where Wallace describes the vacation, a four-day getaway at George Clooney’s home in Lake Como, Italy.", "“I was fortunate enough to be invited -- Lorraine and I, my wife -- to spend a few days with him at his home in Lake Como,” Wallace told then-Politico reporter Patrick Gavin in the video.", "Another 2012 clip, from Fox News where Wallace works as an anchor, also refers to the star-studded vacation. Wallace mentions that the women on the trip were Lorraine Martin Smothers, his wife, and Stacy Keibler, an American actress and Clooney’s girlfriend at the time.", "UK outlet Daily Mail also published an article about the trip with these details and several photos, including the image of the four on a pier.", "Wallace moderated the messy September 29 debate -- characterized by frequent, chaotic interruptions and sharp barbs --- between US President Donald Trump and his Democratic opponent, former vice president Joe Biden.", "Trump supporters and Trump himself -- who did most of the interrupting -- have accused Wallace of going too hard on the president and too easy on Biden during the debate.", "\"I guess I'm debating you, not him, but I'm not surprised,\" Trump said to Wallace at one point.", "Clooney supported Democrat Barack Obama in 2008 and 2012, raising millions, and also backed Hillary Clinton against Trump in 2016.", "The Virgin Islands government filed a lawsuit against Epstein’s estate, which says he and his associates acquired Little St James island in 1998.", "Lake Como, Italy is more than 4,000 miles away from Little St James.", "AFP Fact Check debunked another false claim about Epstein’s island here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]