["Hillary Clinton at a gala of the Congressional Hispanic Caucus Institute in Washington on Sept. 15. (AP)", "Hillary Clinton supports plans by President Barack Obama to defer deportation for millions of people in the country illegally, she said at the Congressional Hispanic Caucus Institute’s annual gala Sept. 15.", "But there is more to do beyond defending the programs, the Democratic presidential nominee said, such as closing private detention facilities and stopping immigration raids and roundups.", "\"No child should have to say goodbye to their parents every morning, not knowing if their mom or dad will be there when they get home,\" Clinton said. \"So here's the bottom line: Comprehensive immigration reform will not only be the right thing to do, but it will add $700 billion to our economy, and enable America to be what it's always been, a place where people from around the world can come to reunite with family, start new businesses, pursue their dreams, apply their talents to American growth and innovation.\"", "We wondered, will an overhaul of the immigration system add $700 billion to the U.S. economy?", "What we found is that Clinton is citing a reputable estimate, but experts say she ignores the time frame of the economic impact and just what is producing the influx of new money.", "Clinton’s source", "Clinton’s campaign said the figure came from a November 2014 fact sheet from the White House on the economic benefits of immigration reform.", "\"The nonpartisan Congressional Budget Office (CBO) estimated that enacting the Senate immigration reform bill would increase real GDP relative to current law projections by 3.3 percent in 2023 and 5.4 percent in 2033 – an increase of roughly $700 billion and $1.4 trillion, respectively, in today’s dollars,\" the White House said.", "The CBO in 2013 estimated the economic impact of a version of the Border Security, Economic Opportunity, and Immigration Modernization Act (S. 744) -- commonly known as the \"Gang of Eight\" bill.", "The measure, written by four Democratic and four Republican senators, passed the Senate but died in the House.", "The CBO said calculating the economic impact of the legislation was tricky and questionable.", "Yet the report says S.744 \"would boost economic output\" and increase real (inflation-adjusted) GDP by 3.3 percent in 2023 and 5.4 percent in 2033.", "It also projects a U.S. population increase of 10 million by 2023 and 16 million by 2033.", "Changes in direct spending and revenues would also decrease federal budget deficits by $197 billion from 2014 to 2023 and by nearly $700 billion from 2024 to 2033, the report said.", "Overall, CBO found that enacting the 2013 bill would:", "• Increase the size of the labor force (about 6 million in 2023 and 9 million in 2033) and employment", "• Decrease wages through 2024, but increase them in 2025 and later years", "• Slightly increase unemployment rate through 2020, but no effect on unemployment rate after 2020", "• Raise labor productivity and capital (increase in high-skilled immigrants would lead to technological advancements, including new inventions and improvements in production processes)", "• Increase amount of capital investment (return on investment would be higher under the proposed legislation)", "• Result in higher interest rates (with a greater rate of earnings on investments, federal government \"would face higher interest rates than under current law because it would be competing with the private sector for investors’ money)", "Caveats", "The biggest caveat with Clinton’s claim, experts say, is just where that new money would come from.", "George J. Borjas, a labor economist specializing in immigration issues and professor at the Harvard Kennedy School, said the $700 billion increase in GDP would be almost entirely captured by new immigrants migrating to America.", "\"Practically all of that increase in GDP would need to be paid to the immigrants as wages and salaries. They are not going to work for free,\" Borjas said.", "What really matters, Borjas said, is the \"immigration surplus\" — which is the benefit accruing to the native-born population. About 98 percent of the increase in GDP due to immigration goes to immigrant salaries, and about 2 percent goes to natives already living in the United States, Borjas estimates.", "\"Then the question becomes: who did Hillary refer to when she said ‘our economy’? I take it, in the context of a political speech, that means us — the current population of the United States that is voting in November,\" Borjas said. \"I don’t think she meant the future immigrants who have yet to arrive. And, as a result, I would say the statement is false.\"", "On the flip side, immigration reform would allow people currently living in the United States illegally additional opportunities for advancement, said David Dyssegaard Kallick, a senior fellow and director of the Immigration Research Initiative at Fiscal Policy Institute.", "A pathway to citizenship would mean currently undocumented immigrants would have greater potential for advancement and result in more productive employees, Kallick said. \"Making sure workers can’t be taken advantage of by employers wouldn’t hurt, either, pushing businesses to compete based on higher productivity rather than evasion of the law,\" he said.", "Lastly, any GDP increase would not be automatic. The CBO projected it would take 10 years to increase the GDP by $700 billion. And while $700 billion sounds like a lot, it would remain a tiny fraction of the country’s GDP, which today is nearing $18 trillion.", "Our ruling", "Clinton said immigration legislation \"will add $700 billion to our economy.\"", "Clinton’s statement stems from 2013 estimates of the stalled \"Gang of Eight\" bill. But that bill couldn't pass, and there's no telling what a future version might look like or mean for the U.S. economy.", "A Congressional Budget Office report found that if the 2013 bill was enacted, gross domestic product would increase by 3.3 percent in 2023, or roughly $700 billion. Clinton omitted that timeframe in her statement. The report acknowledges that determining economic impact of immigration policies is complex and can be \"uncertain.\"", "While immigration scholars say the $700 billion estimate is a reasonable estimate, some say increases in GDP would mostly go toward future immigrants, not the current population.", "Clinton’s statement is partially accurate but leaves out important details. We rate it Half True.", "https://www.sharethefacts.co/share/ab010bac-02c2-4be5-a5ac-adfa943e1569", "C-SPAN, Hillary Clinton remarks at Congressional Hispanic Caucus Institute awards dinner, Sept. 15, 2016", "Email exchange, Hillary Clinton campaign, Sept. 16, 2016", "Congressional Budget Office,The Economic Impact of S. 744, the Border Security, Economic Opportunity, and Immigration Modernization Act, June 2013", "White House, Fact Sheet: The Economic Benefits of Fixing Our Broken Immigration System, Nov. 21, 2014", "Congress.gov, S.744 - Border Security, Economic Opportunity, and Immigration Modernization Act", "Fiscal Policy Institute,Three Ways Immigration Reform Would Make the Economy More Productive, June 4, 2013", "The World Bank, GDP data, accessed Sept. 20, 2016", "Email interview, George J. Borjas, a labor economist specializing in immigration issues and professor at the Harvard Kennedy School, Sept. 19, 2016", "Email interview, David Dyssegaard Kallick, senior fellow and director of Immigration Research Initiative at Fiscal Policy Institute, Sept. 19, 2016", "Email interview, Tom Jawetz, vice president of immigration policy at Center for American Progress, Sept. 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]