["About this rating", "Are you a fan of the original 'Hawaii Five-O' TV series?  If you are, and you're under 60 years old, you likely have never seen the episode titled 'Bored She Hung Herself.'", "The advent of DVDs in the mid-1990s made it convenient and economical for fans to own complete seasons of their favorite TV series, rather than having to collect dozens of videocassettes each holding one or two episodes each. Savvy consumers quickly learned, however, that offerings of \"complete\" seasons or series were not always truthful -- sometimes \"full-season\" or \"complete series\" DVD sets lacked an episode or two, for reasons such as copyright issues, controversial or inappropriate subject matter, or other legal entanglements.", "One example of this phenomenon was the second-season DVD set of \"Hawaii Five-0,\" the popular police drama starring Jack Lord that originally aired on CBS from 1968 to 1980. Neither that set (nor, later, the \"Hawaii Five-0: The Complete Series\" DVD set) included one particular episode from the series' second season, titled \"Bored She Hung Herself.\" In fact, that episode hasn't been seen by the public (outside of bootleg copies) since its original broadcast on Jan. 7, 1970 -- it was not re-run by the network after its first airing, it has never been included in the syndication packages sold to local stations or cable channels, nor has it been made available to viewers via home video or streaming.  (Some mid-1990s television listings do show the episode as being scheduled in syndication, but whether it was actually aired then can't be determined at this remove.)", "What is it about this one \"Hawaii Five-0\" episode, alone out of the series' run, that has kept it locked away? The plot featured Don Miles, a \"health freak\" (i.e., stock hippie character) who practiced what would now be identified as autoerotic asphyxiation (i.e., strangling or suffocating oneself to heighten sexual arousal and orgasm) but in the staid world of 1960s television was described as a form of \"yoga\" or \"meditation.\" When Miles' girlfriend, Wanda Parker, is discovered dead after a violent argument with him, hanging from the same noose he employed for his \"yoga,\" Parker's prominent psychiatrist father is insistent that Miles murdered her. (The real killer proves to be a neighbor, who strangled Wanda after she refused his advances.)", "https://streamable.com/8klf1z", "According to one \"Hawaii Five-0\" fan page, the suppression of \"Bored She Hung Herself\" stemmed from a lawsuit over a copycat death:", "This episode has never been seen on TV since the original broadcast. According to the late Mrs. Rose Freeman, wife of the series' creator Leonard, speaking to fans at the 1996 Five-O convention in Burbank, CA, some viewer tried the hanging technique used by Don at the beginning of the show at home and died.", "This was confirmed by an e-mail exchange I had 20 years later with Joel Berliner, who played Hank, the neighbor's son. He wrote to me: \"Somewhere in America, someone hanged themselves after watching the show. Their parents sued CBS, and shelving the episode was part of the settlement.\"", "This explanation isn't completely impossible, but we note that:", "1) Neither we (nor anyone else, as far as we know) has ever turned up any documentation of the copycat death that supposedly prompted the alleged lawsuit.", "2) Neither we (nor anyone else, as far as we know) has ever turned up any documentation of a lawsuit's having been filed or settled against CBS or the show's producers over a copycat hanging death.", "3) We've investigated multiple claims that a particular controversial TV episode has not been re-aired due to a lawsuit by someone embarrassed or injured by it, but we have never found a real-life case of any such \"banned\" content.", "4) Even if a legal settlement had precluded additional airings of this episode by CBS and syndicators, it quite possibly would not extend to home video versions or streaming (neither of which was anticipated in the early 1970s).", "In reference to point #3 above, we can cite multiple instances in which certain series episodes proved so controversial or problematic that they were subsequently withheld or withdrawn voluntarily, not because lawsuits compelled those actions. We suspect something similar occurred with \"Hawaii Five-0,\" that CBS retired \"Bored She Hung Herself\" after a single airing because they opted to err on the side of caution and not because legal action forced them to.  Disclaimers included in DVD sets to explain the missing episode support that interpretation:", "Due to viewer reaction following the original telecast of the episode 'Bored, She Hung herself' (Season 2, episode 16), that episode has not been re-broadcast or released in any manner since its original airing and is not included in this collection.", "The suppression of \"Bored She Hung Herself\" doesn't seem to be much of a loss to anyone other than completists, as those who have seen it (when it has periodically turned up on YouTube or elsewhere online) consider it to be one of the series' worst episodes. It's heavy on the stereotypical portrayal of hippies and drug culture that permeated the show's early years, it lacks the excitement of car chases and shootouts that were hallmarks of the series, and it doesn't offer the other members of the Five-0 squad much of anything interesting to do. The episode is mostly talk and mostly McGarrett, and while some fans consider it to be an interesting departure from the show's usual formula, many others simply find it dull.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]