["By Saranac Hale Spencer", "Posted on September 11, 2019", "A social media meme inaccurately claims that Walmart will no longer sell rifles. Walmart stopped selling “military-style rifles such as the AR-15,” in 2015, and has announced it will no longer sell ammunition for “military-style weapons.” It still sells “long guns for hunting and sport shooting.”", "After several mass shootings this summer, Walmart announced that it would stop selling handguns in the only remaining state where the store still offers them, and would stop selling handgun ammunition and ammunition that can be used in large-capacity clips on what it described as “military-style weapons.”", "That decision drew condemnation from the National Rifle Association and conservative commentators. It also sparked a number of critical memes. One popular meme, though, includes inaccurate  information. That meme has been shared more than 13,000 times and says: “10,874 people killed by drunk drivers in 2017, and 403 by rifles. Walmart stops selling rifles. Still sells alcohol…”", "Walmart hasn’t discontinued selling all rifles. The retailer still sells “long guns for hunting and sport shooting, including shotguns, single-shot hunting rifles and light sporting rifles,” according to its firearms and ammunition guidelines.", "On Sept. 3, though, the company announced that it would stop selling handguns in Alaska, the only state where it currently sells them. Walmart stopped selling handguns elsewhere in the country in the 1990s. Over the years, Walmart has made various changes to its gun-sales policy:", "These new changes, which Walmart announced on Sept. 3, will take effect after current inventories of these items are sold:", "As for the numbers quoted in the meme, those come from federal agencies.", "According to the National Highway Traffic Safety Administration, 10,874 people died in drunk-driving crashes in 2017. More than half of those people — 6,618 in total — were the drunk drivers themselves, according to an NHTSA report.", "The other number quoted in the meme comes from the FBI’s crime statistics for 2017. That year 403 people were murdered with rifles — not, as the meme claims, killed by rifles. According to the Centers for Disease Control and Prevention, 39,773 people died from gunshot wounds in 2017 and most of those deaths — 60% — were suicide. The FBI figure doesn’t include suicides or accidental deaths.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“McMillon to Associates: Our Next Steps in Response to the Tragedies in El Paso and Southaven.” Press release. Walmart. 3 Sep 2019.", "National Highway Traffic Safety Administration. Traffic Safety Facts — 2017 Data. Nov 2018.", "Federal Bureau of Investigation. 2017 Crime in the United States — Table 20. Accessed 9 Sep 2019.", "Walmart Policies and Guidelines. Firearms and Ammunition Guidelines. Corporate.Walmart.com. Accessed 10 Sep 2019.", "Centers for Disease Control and Prevention. National Vital Statistics Reports. Deaths: Final Data for 2017. 24 Jun 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]