["About this rating", "Several Democratic politicians, including Elizabeth Warren and President Obama, do not follow Hillary Clinton on Twitter.", "President Obama and Elizabeth Warren unfollowed Hillary Clinton on social media in November 2016.", "On 28 October 2016, FBI director Jim Comey declared that the agency may have discovered additional e-mails connected to Hillary Clinton's use of a private server during her tenure as secretary of state. Since then, several rumors have circulated holding that high-ranking Democratic officials have \"jumped ship\" and abandoned their party's presidential nominee, such as a (false) claim that President Obama had canceled all of his upcoming campaign appearances and a (false) claim that Michelle Obama had \"scrubbed\" her Twitter account of all mentions of Clinton.", "Although we've already looked into the aforementioned claims and found them all to be false, some Donald Trump supporters have nonetheless doubled down and asserted that President Obama and Elizabeth Warren have both also unfollowed Clinton on Twitter:", "The above-displayed image is not \"proof\" that President Obama unfollowed Hillary Clinton. In order to properly #factcheck this claim, one would have to prove that President Obama's Twitter account had followed Clinton's in the first place, something that those making this claim failed to do.  Although this image most likely taken with a service such as doesfollow.com) may be real, it only documents that President Obama doesn't currently follow Hillary Clinton on Twitter, not that he previously did and has since \"unfollowed\" her.", "Similar claims were made concerning other top Democratic officials, such as Masschusetts senator Elizabeth Warren:", "Again, this image only shows that Warren doesn't follow Hillary Clinton on Twitter, not that she \"unfollowed\" Clinton after the FBI's announcement.", "Sean Hannity amplified these baseless claims during his show on 1 November 2016, then shortly afterwards took to Twitter to apologize and offer a correction:", "It should also be noted that while Senator Warren and President Obama do not follow Hillary Clinton on Twitter, they have both used that medium to express their support for the Democratic presidential candidate:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]