["About this rating", "In September 2019, we received multiple inquiries from readers about the veracity of claims that U.S. President Donald Trump had admitted criminal wrongdoing and said, \"My crimes can't be investigated while I'm president,\" or that he or his lawyers had made a legal argument to that effect.", "On Sept. 19, Vanity Fair published an article with the headline, \"Trump: My Crimes Can't Be Investigated While I'm President,\" which went on to report that the president's attorneys had devised a \"novel\" legal argument to prevent the involuntary release of their client's federal tax returns. Vanity Fair summarized that argument as being, \"It’s illegal to investigate a sitting president for any crimes he may have committed.\"", "The article continued:", "\"In a lawsuit filed today against Manhattan District Attorney Cyrus Vance Jr., who recently subpoenaed eight years of Trump’s tax returns to determine if the Trump Organization falsified business records relating to Stormy Daniels payments, the president’s lawyers claim such a request is unconstitutional because the founding fathers believed sitting presidents should not be subject to the criminal process.", "\"'The framers of our Constitution understood that state and local prosecutors would be tempted to criminally investigate the president to advance their own careers and to advance their political agendas,' the suit reads. 'And they likewise understood that having to defend against these actions would distract the president from his constitutional duties.'\"", "The Vanity Fair article did not quote Trump or any of his representatives or lawyers admitting any criminal action on his part, and it attributed the legal argument in question to the president's lawyers (not the president himself). The article also made clear that the statement, \"It’s illegal to investigate a sitting president for any crimes he may have committed,\" was the author's own summary of what Trump's attorneys had written, rather than a direct quotation from their court filings.", "Despite all that nuance, the article's headline had the effect of badly misleading those who did not carefully read the article itself. \"Trump: My Crimes Can't Be Investigated While I'm President\" demonstrably created the false impression, among many readers, that Trump himself (as opposed to his lawyers) had said (rather than argued to the effect that), \"My crimes can't be investigated while I'm president,\" and that in doing so, Trump or his lawyers had admitted wrongdoing on the part of the president.", "Trump did not say that nor did his lawyers. Nor did his lawyers even present an argument that could fairly be summarized in that way because, in making the argument they made, his lawyers did not admit any criminal actions on Trump's part.", "Unfortunately, the misleading nature of the article's headline was borne out in full. The Twitter account @stonecold2050 tweeted a link to the Vanity Fair article, adding, \"Trump says 'my crimes can’t be investigated while I’m the president of the United States.' 'My Crimes,' What did he just say?\"", "Trump says “my crimes can’t be investigated while I’m the president of the United States”", "“My Crimes” What did he just say?#ImpeachTrump\nhttps://t.co/c3iQ86DThG", "— Stone ? (@stonecold2050) September 20, 2019", "That widely shared tweet was one of many social media posts that clearly demonstrated an understanding of the article's headline as meaning that Trump had himself explicitly admitted to having committed crimes.", "The left-leaning The Other 98% Facebook page further promulgated that false impression, borrowing from @stonecold2050's tweet:", "Comments posted on Vanity Fair's own Facebook page, and in response to its own tweeting of the article, clearly show that a considerable number of readers, without any editorial mediation, understood the headline to mean that Trump himself had admitted to criminal wrongdoing and said, \"My crimes can't be investigated while I'm president.\"", "The passages quoted in the Vanity Fair article were taken from a civil complaint by Trump against New York District Attorney Cyrus Vance, filed on Sept. 19 in the U.S. District Court for the Southern District of New York.", "The key argument made by Trump's lawyers in that complaint was that Vance's efforts to obtain the president's tax returns, by issuing a subpoena to his accountants at Mazars, were an unconstitutional effort to advance a criminal investigation into a sitting president:", "\"Because the Mazars subpoena attempts to criminally investigate a sitting president, it is unconstitutional. This court should declare it invalid and enjoin its enforcement until the president is no longer in office.\"", "To that extent, the Vanity Fair article was accurate in summarizing the argument as being, \"It’s illegal to investigate a sitting president for any crimes he may have committed,\" though it is worth stipulating that occupants of the White House can (and have been) investigated as part of federal civil lawsuits if those suits don't relate to their official actions as president.", "(For example, the Clinton-Lewinsky scandal emerged from an investigation into Bill Clinton's personal life, stemming from a civil lawsuit brought against him by Paula Jones while Clinton was president.)", "Trump's attorneys are asking the District Court to declare the subpoena invalid and issue an injunction preventing the D.A.'s office from enforcing it and Mazars from complying with it. To that extent, Trump is also suing the accountancy firm.", "As of Sept. 23, Trump's legal team had filed a complaint, an emergency motion for a temporary restraining order and preliminary injunction, a proposed order granting that motion, and a memorandum of law in support of that motion. Across those dozens of pages of legal argument, none of Trump's lawyers has once averred or admitted that their client has engaged in any criminal actions.", "Rather, they have argued that the U.S. Constitution forbids the D.A. from conducting a criminal investigation into Trump until he is no longer president, and that therefore the District Court must temporarily block the D.A.'s efforts to obtain Trump's personal federal tax returns by issuing a subpoena to his accountants.", "As such, the headline of Vanity Fair's article (as opposed to the article itself) was grossly misleading. Although it did not explicitly attribute a statement to Trump, the wording of the headline created that widespread false impression. Trump did not say, \"My crimes can't be investigated while I'm president,\" nor did he make any similar statement in which he admitted having acted criminally, nor did his lawyers make an argument that involved an admission of criminal wrongdoing on the president's part.", "Subsequent social media posts that attributed \"My crimes can't be investigated while I'm president\" to Trump, as a direct quotation, were downright false.", "Levin, Bess.  \"Trump: My Crimes Can't Be Investigated While I'm President.\"\r\n  Vanity Fair.  19 September 2019.", "U.S. District Court, Southern District New York.  \"Trump vs. Vance, Mazars -- Complaint.\"\r\n  19 September 2019.", "U.S. District Court, Southern District New York.  \"Trump vs. Vance, Mazars -- Notice of Emergency Motion for a Temporary Restraining Order and a Preliminary Injunction.\"\r\n  20 September 2019.", "Rios, Michael.  \"Are Presidents Immune From Civil Lawsuits in State Court Over Their Private Conduct.\"\r\n  PBS Newshour.  13 April 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]