["Canadian singer Celine Dion did not say she hates America, despite a hoax you might have seen online.\n\nAn April 11 headline falsely quoted Dion as saying, \"I Can’t Even Look At An American Flag Any More, I Hate This Country.\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. We found no evidence that Dion said either of these things.", "The rumor originated on a clickbait website in September 2017, according to Snopes.", "The story doesn’t support the headline. Instead, it talks about how Dion turned down an offer to sing at President Donald Trump’s inauguration. In January 2017, news outlets such as TMZ reported that Dion passed up the opportunity, but not because she hates America.", "Dion was actually scheduled to perform at the Colosseum at Caesars Palace in Las Vegas on the day of the inauguration, which we were able to confirm with an archived version of her  2017 schedule.", "After a few paragraphs repeating the same information, the story cuts to a YouTube video with a thumbnail of Dion. The 59-second video shares the same title as the blog post, but instead of Dion speaking, it’s actually just a computer voiceover, saying, \"I can’t even look at an American flag anymore, I hate this country.\"", "Right after the \"quote,\" however, the voice-over contradicts the previous statement. It says that Dion is one of the most talented vocalists that \"ever existed.\" And although she is from Canada, her performance of God Bless America proves her \"true appreciation of our amazing country.\"", "We rate this headline Pants on Fire!", "The Independent, \"Donald Trump inauguration: Artists who won't perform at ceremony include Elton John, Celine Dion and John Legend,\" Dec. 23, 2016", "The Wayback Machine, archived version of the Colosseum at Caesars Palace 2017 schedule, retrieved April 13", "Snopes, Did Celine Dion Say ‘I Can’t Even Look at an American Flag’ Because ‘I Hate This Country?’ 2017", "TMZ, Celine Dion: Sorry, Donald... My Fans Trump Your Inauguration, Dec. 22, 2016", "Animalsloove.info, \"Singer Celine Dion Says: \"I Can’t Even Look At An American Flag Any More, I Hate This Country.\" April 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]