["About this rating", "Ocasio-Cortez wasn't in the main Capitol building where the House and Senate Chambers are located.", "However, Ocasio-Cortez never claimed to be in the main Capitol building. When the attack on the Capitol began, Ocasio-Cortez was, as she stated, in her congressional office, which is located in a network of office buildings immediately surrounding the Capitol, and her office building was one of the two buildings that were evacuated.", "In the aftermath of the deadly Jan. 6, 2021, attack on the U.S. Capitol, U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., took to Instagram Live on Feb. 1, to relay her personal account of how the events of that day had traumatized her.", "One theme covered in her retelling of those events was how her past experiences with trauma, particularly surviving sexual assault, had compounded her fear during and after the Capitol riot.", "\"I’m a survivor of sexual assault. And I haven’t told many people that in my life,” she said toward the beginning of her story. “But when we go through trauma, trauma compounds on each other.\"", "Ocasio-Cortez also observed that it's a painful fact for many survivors of trauma that they must deal with people who try to minimize what they experienced when they tell their stories, in an effort to silence them.", "It took less than 48 hours for the right-wing disinformation machine to contrive a way to minimize what Ocasio-Cortez said she had experienced.", "In a circus of cyberbullying that began on Feb. 3, 2021, conservative news outlets and social media conspiracy trolls latched on to the misleading claim that Ocasio-Cortez \"wasn't in the Capitol building\" and therefore was not in harm's way, as she had described in the Instagram video.", "Examples included the RedState blog headline, \"AOC Wasn't Even in the Capitol Building During Her 'Near Death' Experience,\" and the following tweet from the Daily Wire website:", "Others similarly chimed in, such as conspiracy theorist Candace Owens, who piled on another false claim by tweeting that Ocasio-Cortez had faked her \"own attempted murder\" after having previously \"staged a photo shoot dressed in all white at a parking lot to spread lies about immigrant children in cages.\" The \"staged photo\" claim was based on disinformation produced by the Alex Jones conspiracy network InfoWars.", "Online trolls went further by drawing a misleading comparison between Ocasio-Cortez and Jussie Smollett, an actor accused of staging a racist, anti-gay attack against himself in Jan. 2019.", "First, we will discuss what Ocasio-Cortez said in her video, then explain why the attacks on her were not just made in bad faith, but nonsensical.", "In an emotional 90-minute video, Ocasio-Cortez described in detail how her sense of danger grew in the days leading up to the assault on the Capitol. On the day of, she said she had felt sick with anxiety, but she was also happy at news that fellow Democrats Rev. Raphael Warnock and Jon Osoff had won U.S. Senate runoff elections in Georgia, handing Democrats a narrow majority in that chamber.", "Around the time the clashes at the Capitol started, Ocasio-Cortez said she was at her desk scrolling through lunch options when she heard a loud, \"violent\" banging on her office doors. She ran over to her legislative director Geraldo Bonilla-Chavez (whom she calls \"G\"), who told her, \"Hide, hide, run and hide.\"", "She hid in the bathroom of her office and realized that the person who was banging on the door had gotten inside and was yelling, \"Where is she?\" Ocasio-Cortez said didn't know it while she was hiding, but the person calling that out was actually a Capitol police officer.", "In the moment, while she was hiding in her bathroom and the door started to open on her, Ocasio-Cortez said, she thought she was going to die. \"This was the moment where I thought everything was over.\"", "Ocasio-Cortez went on to describe the ensuing chaos as she and Bonilla-Chavez tried to find a place to hide after the officer told them to evacuate, without directing them to a specific evacuation destination. While she and Bonilla-Chavez ran up and down stairways and wandered hallways, she said, they could hear rioters getting louder and louder, trying to break inside, and felt that at any moment the attackers might breach the building. Ocasio-Cortez said they finally found U.S. Rep. Katie Porter, D-Calif., and ended up sheltering in place in her office.", "Porter stated in a Feb. 1 interview on MSNBC that Ocasio-Cortez's level of \"fight-or-flight\" was so heightened that when Porter informed her that she was a mother and had everything they would need to stay there as long as necessary, Ocasio-Cortez had replied, \"I just hope I get to be a mom. I hope I don’t die today.\" Porter's office also found Ocasio-Cortez extra clothes and sneakers to change into so she could blend in and flee if she needed to.", "Ocasio-Cortez's video, as of this writing, has been viewed more than 5 million times on Instagram alone. In it, she called on members of Congress, such as U.S. Sen. Ted Cruz, R-Texas, to resign, saying they had helped incite the violence by breathing life into an incendiary disinformation campaign promoted by President Trump and his supporters falsely claiming that the November 2020 election had been \"stolen.\"", "Ocasio-Cortez was attacked on social media with bad-faith attempts to discredit her story by people who falsely claimed she exaggerated the danger she was in because she wasn't actually inside the main Capitol building where the House and Senate chambers are located.", "But Ocasio-Cortez never claimed she was in the main building. She said was inside her office, which is in just one of the network of buildings containing congressional offices that comprise the Capitol complex. The office buildings and the main Capitol building are interconnected by a series of tunnels known as the Capitol Subway System, which allows members of Congress to traverse underground from their offices to their respective chambers.", "Ocasio-Cortez's building, Cannon House, is across Independence Avenue from the Capitol and was one of the buildings evacuated:", "The online attacks on Ocasio-Cortez downplayed, from a safe distance, not only the sense of fear she felt in the moment during the attack on the Capitol, but also the imminent physical danger that she and others in and around the Capitol really were in during the attack.", "Five people died in the assault on the seat of the U.S. legislature, including a Capitol police officer. Videos, images, and personal accounts by officers tell stories of mobs beating and overrunning police and injuring 140 officers. Rioters who breached the Capitol loudly voiced their desires to kill lawmakers, and hours after the attack began, one rioter wrote on social media, \"assassinate AOC.\"", "The FBI searched for a suspect who planted pipe bombs outside Republican and Democratic national committee offices the night before the attack. Another man was arrested at the Capitol on charges related to possessing firearms and eleven Molotov cocktails -- jars containing melted styrofoam and gasoline, \"an explosive mixture that has the effect of napalm because, when detonated, the substance causes the flammable liquid to better stick to objects that it hits.\"", "The House Trial Brief for Trump's Senate impeachment trial, prepared weeks later, observed that it wasn't just those inside the main Capitol building who were in danger:", "Members and staff who were not on the House floor at the time of the siege were also in danger. Many barricaded themselves in their offices. Speaker Pelosi’s staff hid under a table with the lights turned off for hours while they could hear rioters outside in the Speaker’s office. One Member asked his chief of staff to protect his visiting daughter and son-in-law “with her life” -- which she did by standing guard at the door clutching a fire iron while his family hid under a table.", "In her video, Ocasio-Cortez alluded correctly to the fact that it took police and the National Guard hours to secure the Capitol complex after the attack due to a series of glaring security failures. Images and videos from the attack show rioters had a significant period of free rein, breaking into and casually sitting at the desk in an office used by House Speaker Nancy Pelosi, leaving behind smeared excrement and stealing the Speaker's lectern.", "Ocasio-Cortez made history when she was elected in 2018 as the youngest woman ever to serve in Congress. She is also a political progressive and a woman of color, and she is the frequent target of smear campaigns and disinformation. She has stated multiple times that right-wing smear campaigns have prompted death threats against her.", "CORRECTION [Feb. 4, 2021]:  A previous version of this article neglected to note under \"What's False\" that AOC never claimed to be in the main Capitol building.", "Updated to note that investigators now say the cause and manner of U.S. Capitol Police Officer Brian Sicknick's death are still under investigation.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]