["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. John Nygren, R-Marinette, says the GOP tax plan is better for middle class families since \"88% of the tax relief goes to those making $100,000 or less.\" Nygren is pictured here at a hearing in April 2018. Mike De Sisti, Milwaukee Journal Sentinel", "An early skirmish between Wisconsin’s Republican-led Legislature and Democratic governor revolves around competing tax cut plans.", "With both parties maneuvering to frame their plan as best for the Average Joe, state Rep. John Nygren offered some numbers to support his case. Nygren, R-Marinette, is co-chair of the powerful Joint Finance Committee.", "\"Our plan is better for working, middle-class families; 88% of the tax relief goes to those making $100,000 or less,\" Nygren tweeted Feb. 12, 2019. \"(Gov. Tony Evers’) plan benefits higher income earners. Only 75% of the tax relief goes to those making $100,000 or less.\"", "Evers vetoed the GOP tax plan on Feb. 20, 2019, saying he didn’t want to address a major fiscal policy item outside the budget. But with the tax cut showdown likely to continue in some form, we’ll still dive into the numbers.", "Do they support Nygren’s claim about how they impact the middle class?", "Nygren’s staff pointed us to a pair of memos from the state’s nonpartisan Legislative Fiscal Bureau that estimate the impact the two plans would have on Wisconsin income taxes in 2020.", "The bureau’s analysis shows the Republican plan would send 87.9 percent of tax savings to taxpayers with a federal adjusted gross income of less than $100,000.", "And the proposal from Evers and the Democrats would direct 74.5 percent of savings to that group.", "But there is a big catch.", "The Democratic tax cuts are bigger overall — totaling $441 million compared to $338 million for the Republican plan.", "So while a larger share of the GOP tax cuts would go to those making less than $100,000, the actual amount of tax savings for that group is lower.", "The Democrats’ plan would save a total of $328 million for taxpayers making less than $100,000.", "The Republicans’ plan would save that group $297 million.", "This chart shows the total projected tax savings for various income levels under the two plans:", "(To add a quick asterisk to this asterisk, Fiscal Analyst Rick Olin from the state fiscal bureau noted the Democrats’ tax plan includes limits on manufacturing and agricultural tax credits that the Republicans plan does not. The bureau analysis accounts for those credits that would be claimed by individual income filers, but not those who would get the credits through corporate tax returns. So the Democratic plan would increase the tax burden for those filers, but it’s not connected to the individual income tax process.)", "Nygren says the Republican tax cut plan is \"better for working, middle-class families,\" citing as support the percentage of tax cuts going to Wisconsin residents with incomes under $100,000.", "The numbers are accurate, so far as they go. The problem is they show only part of the picture.", "The Democrats are proposing a larger overall tax cut that would result in more tax savings for those under $100,000 in earnings — even if that accounts for a lower percentage of the overall tax cut package.", "So the statement is partially accurate, but it leaves out important details. That’s our definition of Half True.", "Twitter.com, John Nygren (@rep89), Feb. 12, 2019", "Email exchange with Nathan Schwanz, chief of staff for Rep. John Nygren, Feb. 12-19, 2019", "Interview and email exchange with Rick Olin, fiscal analyst, Wisconsin Legislative Fiscal Bureau, Feb. 18-19, 2019", "Legislative Fiscal Bureau, Analysis of Evers/democratic tax cuts, Feb. 7, 2019", "Legislative Fiscal Bureau, Analysis of Republican tax cuts, Feb. 7, 2019", "Email exchange with Britt Cudabeck, spokeswoman for Gov. Tony Evers, Feb. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]