["Gov. Andrew Cuomo holds a briefing in New York City on Sept. 29, 2020. (Courtesy Gov. Andrew Cuomo's press office.)", "Gov. Andrew Cuomo continues to be under fire for his administration’s handling of the novel coronavirus in nursing homes, where residents are vulnerable to serious illness or death from the virus.", "In a call with reporters, Cuomo was asked again, this time by the Finger Lakes Daily News, about how his administration dealt with nursing homes, specifically a controversial March 25 order, rescinded in May, regarding patients leaving hospitals and going to nursing homes. Nursing homes felt pressure to accept coronavirus patients from hospitals following the March 25 order. Cuomo pushed back on what he considered the premise of the question.", "\"You look at the nursing home deaths in this state,\" Cuomo said. \"Do you know what number we are by percentage before you made that statement? We're No. 46 out of 50 states, and we had the worst problem, and we're 46th in terms of percentage of deaths in nursing homes.\"", "The way that New York has counted COVID-19 deaths in nursing homes has come under scrutiny, and we wondered whether Cuomo is correct.", "We reached out to Cuomo’s press office, and spokesperson Jason Conwall directed us to a New York Times data analysis of deaths in long-term care facilities by state.", "In the most recent data, published Sept. 16, nursing homes accounted for larger shares of COVID-19 deaths in 41 other states and the District of Columbia - not 45, though Conwall said Cuomo was referencing previous iterations of the Times' data.  The Internet Archive showed a previous version of the list making New York 45th.", "We reached out to KFF, formerly the Kaiser Family Foundation, a nonpartisan source of health information, to ask about Cuomo’s claim. Priya Chidambaram, a policy analyst for the foundation, tracks data about COVID-19 deaths and long-term care. She told us that one of the key differences between New York and other states is that New York excludes deaths that were not in a nursing home. Nursing home residents who develop serious illness and need to be treated in a hospital, and do not recover, are not counted as part of the state’s nursing home deaths, she said. State data is not comparable because of the different ways states report these deaths. Some states include various long-term care facilities in their data, while others just include nursing homes. Other states report residents and staff, some just report residents.", "The best comparable data for analyzing nursing home deaths comes from the Centers for Medicare and Medicaid Services, Chidambaram said. In its data, which uses a different metric, New York ranks in the middle - not among the lowest - for the share of nursing home deaths among its population of nursing home residents. CMS ranks states by deaths per 1,000 nursing home residents. New York had 50.5 deaths per 1,000 residents, ranking 20th on a list of 50 states and the District of Columbia, as of the week ending Sept. 27. The federal government began requiring this data in May, long after the pandemic began in New York.", "New York's health commissioner, Howard Zucker, has defended the administration's approach, and said the state does not want to double count deaths - attributing a single death to a nursing home and a hospital, and that he wants to only release data that is completely accurate. A spokesperson for the department has said that the state has been a leader in releasing facility-level data on deaths.", "Cuomo said 45 other states had higher portions of nursing home residents as a share of the total coronavirus deaths in a state. He was referencing an analysis from the New York Times, which puts New York near the bottom, 43rd in a list of 46 states and the District of Columbia, with five states left off the list because of insufficient data.", "But the Times cautions readers about making comparisons among states because of the different ways each level of government and each facility reports the data.", "Cuomo's claim contains an element of truth: There is a New York Times database and it includes death numbers for nursing home patients across the nation. But the governor left out some critical facts that would give a different impression about how New York compares with other states for how nursing home residents are faring. New York counts deaths that occur in a nursing home, leaving out those deaths of residents in hospitals. And there's inconsistencies in the reported data that ends up in the database among states and facilities.", "According to federal data, which calculates deaths per 1,000 nursing home residents, regardless of where they die, New York lands near the middle.", "We rate his claim Mostly False.", "Finger Lakes Daily News audio file, \"Cuomo Defends Nursing Home Policies After Saying He’s Saved Lives During Pandemic,\" Sept. 30 2020.", "Phone conversation, Jason Conwall, spokesperson, Gov. Andrew Cuomo, Oct. 2, 2020.", "The New York Times, data analysis, \"About 40% of U.S. Coronavirus Deaths Are Linked to Nursing Homes,\" Updated Sept. 16, 2020. Accessed Oct. 6, 2020.", "The New York Times, article, \"Does Cuomo Share Blame for 6,200 Virus Deaths in N.Y. Nursing Homes?\" July 23, 2020. Accessed Oct. 8, 2020.", "Phone, email conversation, Priya Chidambaram, policy analyst, Program on Medicaid and the Uninsured, KFF, Oct. 8, 2020.", "Email conversation, Richard J. Mollot, executive director, The Long Term Care Community Coalition, Oct. 8, 2020.", "Email conversation, Amanda Davis, senior advisor, advocacy external relations, AARP, Oct. 8, 2020.", "Email conversation, Kara Jones, director of government relations and communications, The Foundation for Research on Equal Opportunity, Oct. 8, 2020.", "The Associated Press, article, \"New York’s true nursing home death toll cloaked in secrecy,\" Aug. 11, 2020. Accessed Oct. 8, 2020.", "ProPublica, article, \"Andrew Cuomo’s Report on Controversial Nursing Home Policy for COVID Patients Prompts More Controversy,\" July 10, 2020. Accessed Oct. 8, 2020.", "The Foundation for Research on Equal Opportunity, \"Nursing Homes & Assisted Living Facilities Account for 42% of COVID-19 Deaths,\" Aug. 31, 2020. Accessed Oct. 8, 2020.", "The Daily Gazette (Schenectady), \"Fight for nursing home COVID death data goes to court; Precise numbers remain unreleased,\" Oct. 3, 2020. Accessed Oct. 8, 2020.", "Centers for Medicare and Medicaid Services, COVID-19 nursing home data, as of Sept. 27, 2020. Accessed Oct. 9, 2020.", "KFF, brief, \"Limits and Opportunities of Federal Reporting on COVID-19 in Nursing Facilities,\" June 15, 2020. Accessed Oct. 9, 2020.", "The Empire Center for Public Policy, blog, \"The CDC’s Nursing Home Death Count Is Even Less Complete Than New York’s,\" Sept. 8, 2020. Accessed Oct. 9, 2020.", "Internet Archive, The New York Times, \"About 40% of U.S. Coronavirus Deaths Are Linked to Nursing Homes,\" June 27, 2020; July 7, 2020; July 15, 2020. Accessed Oct. 9, 2020.", "Gothamist, \"Full Scope Of NY's Nursing Home COVID Death Toll Still Unknown,\" Aug. 11, 2020. Accessed Oct. 13, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]