["The four-minute and 25-second video was published here on a public Facebook page with more than 16,300 members on August 26, 2020. It has been viewed some 2,200 times.", "The video’s traditional Chinese title translates to English as: “Train from Yiwu, Zhejiang to London, Europe”.", "The post's caption translates as: “The Belt and Road train from Yiwu, Zhejiang to London, Europe, with a total of 278 carriages and 10 locomotives (five at the front, three in the middle and two on the end). It’s more than spectacular! It is astonishing!”", "Yiwu is a city in China’s Zhejiang province.", "China's Belt and Road Initiative is a global project that aims to reinvent the ancient Silk Road land routes to connect Asia with Europe and Africa. The initiative includes massive investments in maritime, road and rail projects -- with hundreds of billions of dollars in financing from Chinese banks, as noted in this AFP report.", "The video was also shared alongside similar claims on Facebook here, here and here; on Weibo here, here and here; and on YouTube here.", "However, the video has been shared in a misleading context.", "Closer examination of the video revealed the letters \"BNSF\" at its 21-second mark.", "Below is a screenshot of the video with the letters circled in red:", "A further keyword search found that the logo matches that of a major US freight train operator, BNSF Railway.", "The train seen the misleading video matches the photos of those seen on the BNSF’s website, as seen below:", "In an email to AFP on September 8, 2020, a spokesperson for the company said: “BNSF Railway operates in 28 US states and three Canadian provinces. We do not have routes outside of North America nor do we run trains outside of our system.”", "A map of BNSF’s train routes, published here on its website in September 2020, also shows it only operates in the US and parts of Canada:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]