["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Expanding Medicaid in Virginia would imperil the lives of low-income people who have surgery, according to Pete Snyder, a Northern Virginia businessman who is seeking the Republican nomination for lieutenant governor.", "\"As it stands, Medicaid’s immense price includes a very real and tragic human cost: all too often it actually harms the very people it is meant to help,\" Snyder wrote in a March 6 article for Bearing Drift, a conservative blog.", "\"But don’t take my word for it,\" he continued. \"A study by the University of Virginia pulls back the curtain on Medicaid’s tragically bad outcomes, including ‘increased risk of adjusted mortality,’ or as one report summarizes, ‘surgical patients on Medicaid are 13 percent more likely to die than those with no insurance at all.’\"", "We were struck by the ramifications of Snyder’s claim. Under Obamacare, states are being encouraged to expand Medicaid, the government-run healthcare program for the poor and disabled. In return, Washington is offering to pay all the new costs at first, and 90 percent of the new tab in 2020 and thereafter.", "Expansion in Virginia, which is strongly opposed by Gov. Bob McDonnell, would open Medicaid to an estimated 400,000 people. Across the nation, about 16 million would become eligible for Medicaid if every state accepted the Obamacare offer.  Almost all of these people are now uninsured -- making too little money to afford private health insurance but earning above the poverty levels that qualify for Medicaid.", "The U.Va. study is being cited by several conservatives -- including former U.S. Rep. Ron Paul, R-Texas -- as an argument against expansion. They say the study offers evidence that spreading Medicaid will spread bad health care results.", "Fact-checking Snyder’s statement requires two determinations: 1) Did the U.Va. study actually find that Medicaid recipients face a greater risk of surgery-related death than uninsured people and all other categories of patients and, if so; 2) Was the heightened risk caused by Medicaid?", "The U.Va. study, published in 2010, considered how surgical patients fared during their hospitalization based on whether they had private insurance, Medicare, Medicaid or were uninsured. The researchers looked at almost 900,000 major operations across the country and adjusted for many population and health care variables, including age, income, region, type of hospital, type of operation and other health factors.", "\"Even after adjusting for all those things, the payer was still a predictor of poorer outcomes,\" Dr. Gorav Ailawadi, one of the authors of the paper, told us.", "The patients covered by Medicaid had the highest risk. They were 1.97 times more likely to die in the hospital than those with private insurance. Compared to the privately insured, Medicare recipients were 1.54 times more likely to die in the hospital and uninsured patients were 1.74 times more likely.", "With adjustments, Medicaid patients also had the longest hospital stays and greatest total costs.", "So Snyder is correct -- those covered by Medicaid did have an increased risk of mortality during their hospital stays. And he’s right that Medicaid recipients were 13 percent more likely to die in the hospital during or after surgery than uninsured patients.", "But researchers place little of the blame on Medicaid.", "They noted that Medicaid recipients are the poorest, sickest and least educated group of patients. They are the least likely group to seek preventive health care. As a result, they are more likely to enter hospitals in dire conditions that require emergency surgery.", "\"Medicaid patients had the highest incidence of acquired immunodeficiency syndrome, depression, liver disease, neurologic disorders and psychoses,\" the study said. \"Furthermore, Medicaid patients had the highest incidence of metastatic cancer.\"", "The researchers said that uninsured patients have similar characteristics to Medicaid recipients and that it is \"plausible\" that both groups may suffer from a \"system bias\" that limits their access to private hospitals and top physicians.", "\"For many surgical patients, private insurance status often allows for referral to expert surgeons for their disease,\" the study said. \"Alternatively, Medicaid and uninsured patients may have been referred to less skilled and less specialized surgeons.\"", "Does the research prove, as Snyder and other conservatives suggest, that it’s safer to be uninsured than on Medicaid? Ailawadi, co-author of the study, said it does not.", "Not all of the uninsured patients in the study were low-income people who would qualify for Medicaid if it is expanded. Thirty-one percent of them lived in zip codes where the average household income was greater than $45,000. Many of these people may have been uninsured by choice. \"The uninsured population in our study included a subgroup that may have had a high income,\" Ailawadi said.", "He added, \"I don’t think we’re able to say a government-sponsored system is beneficial or not.\"", "Our ruling", "Snyder is opposed to expanding Medicaid. He said,  \"A study by the University of Virginia   pulls back the curtain on Medicaid’s tragically bad outcomes, including ‘increased risk of adjusted mortality.’\"", "He’s partly right. A U.Va. study in 2010 did find that Medicaid recipients were more likely to die in the hospital during or after operations than all other surgery patients, including those who were uninsured.", "But he runs into trouble when he suggests that Medicaid is the cause of the high death rate. The authors of the report note that those who qualify for Medicaid are a high-risk group to begin with.", "We rate Snyder’s claim Half True.", "Pete Snyder on Bearing Drift, \"There’s No Such Thing As Free Money: A Big Government Bait-And-Switch,\" March 6, 2013.", "Emails from spokesman Chris Bond, March 26 and 27, 2013.", "Bob McDonnell, \"Statement of Governor Bob McDonnell on General Assembly Passage of Historic Transportation Legislation,\" Feb. 23, 2013.", "McDonnell, Letter to Secretary of Health and Human Services Kathleen Sebelius, March 5, 2013.", "U.S. National Library of Medicine National Institutes of Health, \"Primary Payer Status Affects Mortality for Major Surgical Operations,\" September 2010.", "Interview with Dr. Gorav Ailawadi, March 12, 2013.", "National Review Online, \"UVa Study: Surgical Patients on Medicaid are 13 percent More Likely to Die Than Those Without Insurance,\" July 17, 2010.", "Cancer, \"Morbidity and mortality of colorectal carcinoma surgery differs by insurance status,\" Sept. 20, 2004.", "Journal of Vascular Surgery, \"Insurance Status Predicts Access to Care and Outcomes of Vascular Disease,\" June 30, 2008.", "Journal of the National Cancer Institute, \"Effects of Health Insurance and Race on Early Detection of Cancer,\" June 23, 1999.", "Heartland Institute, \"Why Virginia Shouldn’t Expand Medicaid,\" Feb. 26, 2013.", "The National Bureau of Economic Research, \"The Oregon health Insurance Experiment: Evidence from the First Year,\" July 2011.", "Interview with Timothy Waidmann, senior fellow at the Health Policy Center at Urban Institute, March 5, 2013.", "Bearing Drift, \"There’s No Such Thing As Free Money: A Big Government Bait-And-Switch,\" March 6, 2013.", "The Washington Post, \"Democrats claim win, GOP says not so fast,\"Feb. 24, 2013.", "The Washington Post, \"Landmark: The Inside Story of America’s New Health-Care Law and What It Means for Us All,\" published in 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]