["Coronavirus is the latest pandemic that has emerged from Wuhan, China and has spread to 16 countries including Thailand, France, Philippines, USA, Australia and India. Over 170 people have died and more than 6000 people have been infected. The World Health Organisation (WHO) has declared Coronavirus as a global health emergency. Countries such as Russia have closed borders from China to prevent the spread of this infection. Recently, one confirmed case of coronavirus infection has been found in Kerala, India of a student returning from China; whereas three suspected cases were reported in Delhi.", "The infection from coronavirus resembles other respiratory tract infections hence can be hard to isolate from the common flu. It spreads from respiratory fluids such as coughs and sneezes, similar to influenza and other respiratory tracts’ infections. The extent of the infection has ranged from a mild cough to severely sick and dying due to the infection. Common symptoms include cough, fever, shortness of breath (dyspnea), and occasional diarrhoea. Currently, there are no vaccines for this infection and preventative measures are best to contain the spread of the infection.", "The Ministry of Ayurveda, Yoga & Naturopathy, Unani, Siddha, Sowa Rigpa and Homoeopathy (AYUSH) of India released two advisories via PIB on the preventative and treatment measures that can be taken for the coronavirus epidemic. One of the advisories was using the homeopathy drug Arsenicum album 30 as a ‘prophylactic medicine’ for the prevention of the infection (see below).", "Advisory for #CoronaVirus", "Homoeopathy for Prevention of Corona virus Infections", "Unani Medicines useful in the symptomatic management of Corona Virus infection", "Details here: https://t.co/OXC7PtM7L3", "— PIB India (@PIB_India) January 29, 2020", "“As per the Homoeopathy Practices, the following Preventive Management Steps are suggested- The Group of Experts inter-alia has recommended that homoeopathy medicine Arsenicum album30 could be taken as prophylactic medicine against possible Corona virus infections, which has also been advised for prevention of ILI. It has recommended one doze of Arsenicum album 30, daily in empty stomach for three days. The dose should be repeated after one month by following the same schedule incase Corona virus infections prevail in the community.”", "False", "Alt News examined the claims made by the AYUSH Ministry using published scientific evidence at platforms that index scientific articles such as Google Scholar and PUBMED. In the area of drug formulations, clinicians use the research indexed by Google Scholar and PUBMED to verify and seek information regarding new drugs. As a corollary, the absence of scientific research information regarding various drugs in Google Scholar and PUBMED indicates lack of clinical and/or basic scientific research for those drugs.", "We sci-checked the evidence for Arsenicum album 30 for coronavirus infections, the evidence for any other homeopathy drug against coronavirus, and Arsenicum album 30 for any other infections.", "No studies were found that researched the effect of Arsenicum album for coronavirus in humans or animals (in vivo). Also, there were also no studies found in an ex-vivo (outside the animal/human bodies) to study the drug efficacy.", "No studies were found that linked the efficacy of any homeopathy drug in coronavirus infections", "Searching for evidence in the homeopathic research for evidence for the drug Arsenicum album 30, only one paper was found, published in British Homeopathic Journal (Kayne & Rafferty, 1994), that studied its use in neonatal diarrhoea in calves. This study was not only in animals on a different type of infection, but was found to be statistically invalid by Verdier, Öhagen & Alenius in 2003.", "Thus, Arsenicum album 30 has not been proven or researched scientifically by homeopaths to cure coronavirus or any other infections in humans.", "Internationally as well as in India, the AYUSH ministry and the Indian government has met with a lot of criticism for issuing the advisory to use homeopathy as a preventative measure. Alt News sci-checked the homeopathic research behind the drug Arsenicum album 30 for the prevention of coronavirus infections.", "As with other homeopathic drugs, Arsenicum album 30 has never been tested or proven to reduce coronavirus infections or to prevent coronavirus infections. Even though the focus was to study the research conducted by the homeopaths, no studies were found by non-homeopaths within the evidence-based framework that suggests the use of Arsenicum album 30 for coronavirus.", "The claim of the AYUSH ministry and the AYUSH homeopaths is false, dangerous and can lead to India’s own coronavirus epidemic, as the infected patients’ caregivers can assume false protection based on the government of India’s advisory.", "This misinformed advice, if followed, risks million of people’s lives during such a dangerous and contagious epidemic.", "References:", "Kayne, S., & Rafferty, A. (1994). The use of Arsenicum album 30c to complement conventional treatment of neonatal diarrhoea (‘scours’) in calves. British Homoeopathic Journal, 83(4), 202-204.", "De Verdier, K., Öhagen, P., & Alenius, S. (2003). No effect of a homeopathic preparation on neonatal calf diarrhoea in a randomised double-blind, placebo-controlled clinical trial. Acta Veterinaria Scandinavica, 44(2), 97.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]