["The footage has been viewed more than 15,000 times since being published on Facebook here on April 4, 2020.", "The one-minute 25-second video shows armed uniformed officers stopping a moving vehicle before appearing to subdue three masked men who emerge from the vehicle.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi caption translates to English as: “The incident occurred at Chaure Bazar. Hail to Yogi’s rule. Didn’t you know jihadists that Ayodhya is the birthplace of the Lord Shri Rama, the propriety of conduct. Good job, UP police.”", "Chaure Bazar is a locality in Uttar Pradesh's Ayodhya district that is considered the birthplace of Rama, the Hindu god mentioned in the caption. “Yogi” refers to Yogi Adityanath, the chief minister of Uttar Pradesh.", "The video was also shared alongside a similar claim on Facebook here, here, here, here and here.", "The claim is misleading.", "The footage shows an anti-terror drill conducted by police in early April, according to Ayodhya police.", "“A video of an anti-terror attack demonstration by Ayodhya Police at Chaure Bazar barricading is being shared as an incident of militant attack on April 4, 2020, which is misleading and fake news. The Ayodhya Police denies any such news,\" police said in a Hindi tweet on April 8, 2020.", "#UPPAgainstFakeNews\n\n\t\tदिनांक 04.04.2020 को अयोध्या पुलिस द्वारा चौरे बाजार बैरियर पर #एंटी_टेरर_अटैक #डेमो को आतंकवादी घटना बताकर शेयर कर भ्रामक/फेक न्यूज़ चलाई जा रही है इस प्रकार की प्रसारित खबर को #ayodhyapolice खण्डन करती है।@Uppolice @IpsAshish @UPPViralCheck @PIBFactCheck pic.twitter.com/ZLNrN9lTBN", "The police statement attached to the tweet translates to English as: \"A misleading information about arrest of three Muslim terrorists at Faizabad Road has been circulated on social media sites (Facebook, Twitter, WhatsApp, Instagram, Hike etc). We are informed that an anti-terror attack demonstration, conducted by the local police on April 2, 2020, is being circulated as an incident of terror attack. The social media unit of the Ayodhya Police denies any such false information and refutes the claim.”", "Anuj Singh, who oversees social media for Ayodhya police, also said the footage shows a drill that was conducted on April 2.", "“Denial has been issued by the local police on Twitter. The video started circulating with the misleading claim on April 4, 2020 and hence they issued the clarification, but the drill was actually conducted on April 2, 2020,\" Singh told AFP by phone on April 16, 2020.", "A sign in the footage also indicates the drill was conducted in Ayodhya district in a city called Faizabad. In the first ten seconds of the video, a Hindi sign is visible that translates to English as: “Lucky Honda, Lucky Honda Auto Sales, Cuare Bazar - Faizabad”.", "Below is a screenshot of the sign:", "The claim about the video was also debunked by the Indian news website Dainik Bhaskar here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]