["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While lobbying for his wife in Phoenix March 20, former President Bill Clinton said the country’s political gridlock is not the only source of frustration for people.", "\"People in both parties are upset by the fact that 80 percent of the American people haven’t gotten a pay raise since the crash,\" Clinton said.", "The December 2007 recession destroyed Arizona’s housing market, also drying up construction jobs.", "Hillary Clinton made a similar statement in a campaign advertisement in February, noting that Americans haven’t had a \"raise in 15 years.\"", "PolitiFact found an increase in weekly earnings between January 2000 and January 2015, but median household income dropped between January 1999 and January 2014.", "Household income is a more complete measure of income growth, since it may include Social Security or income from investments. PolitiFact rated this claim Mostly True.", "But what about wages from the recession to now?", "We decided to look into Bill Clinton’s claim.", "Same salary", "Bill Clinton’s spokesman, Angel Urena, provided us with multiple studies done by the left-leaning Economic Policy Institute on the issue.", "We reached out to the D.C. think tank directly, which analyzes the data from the Bureau of Labor Statistics and U.S. Census Bureau.", "\"The statement is largely correct. Real, inflation-adjusted wages were stagnant for the bottom 80 percent of the wage distribution between 2007 and 2014,\" said Economic Policy Institute spokesman Dan Crawford.", "Real wages did increase 1.7 percent in 2015, but Crawford noted that was because of a one-time dip in inflation. Wage inequality still increased across the board in 2015.", "Other experts generally agreed with Bill Clinton’s claim.", "Bill Lester, an economic development professor at the University of North Carolina at Chapel Hill, analyzed the Economic Policy Institute’s income data from 1973 to 2012. From 2008 to 2012, wages for the bottom 80 percent either declined or did not change at all.", "Our ruling", "Bill Clinton said, \"80 percent of the American people haven’t gotten a pay raise since the crash.\"", "The former president is accurate. While there were modest increases in real wages and median weekly earnings in 2015, they come with asterisks.", "Inflation’s one-time decline in 2015 is an outlier. And, weekly wages leaves out other sources of income. Some households rely on sources outside of wages and salaries as part of their income.", "We rate Bill Clinton’s claim as Mostly True.", "Interview with Bill Clinton spokesman Angel Urena, March 22, 2016", "Interview with Economic Policy Institute spokesman Dan Crawford, March 23, 2016", "Interview with University of North Carolina at Chapel Hill economic development professor Bill Lester, March 23, 2016", "Economic Policy Institute, \"Wage inequality continued its 35-year rise in 2015,\" March 10, 2016", "Federal Reserve Bank of St. Louis, \"Real Median Household Income in the United States,\" accessed March. 23, 2016", "Federal Reserve Bank of St. Louis, \"Employed full time: Median usual weekly real earnings: Wage and salary workers: 16 years and over,\" accessed March 23, 2016", "PolitiFact, \"Hillary Clinton ad points out it’s been 15 years since Americans had a raise,\" March 11, 2016", "ABC15, \"Bill Clinton speaks to 1,000 people in Phoenix on behalf of wife,\" March 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]