["About this rating", "U.S President Donald Trump was caught on an audio recording making threatening remarks about the whistleblower who revealed allegations that he attempted to strong-arm Ukraine into giving him dirt on a political opponent. Trump also made similar remarks about the person who supplied information to the whistleblower.", "However, Trump's comments, though ominous, did not directly and explicitly state that the whistleblower and the person who supplied them with information should be put to death.", "At any other time in modern history, a headline that suggested the U.S. president threatened a government whistleblower with death perhaps would seem too far-fetched to be real. But in the toxic political and internet landscape of 2019, some Snopes readers inquired whether it was true.", "The headline, \"Leaked Audio Catches Trump Threatening Ukraine Whistleblower With Death And Calling Reporters Scum\" was published by the liberal website PoliticusUSA, which pulled its story from the Los Angeles Times, where the story originated.", "On Sept. 26, 2019, the Times published the audio, which was provided by an unnamed attendee at the event where Trump made the remarks. The Times described the event as a private gathering for American diplomatic officials, held that same day at the Intercontinental Hotel in New York. The whistleblower complaint alleges that Trump tried to strong-arm Ukraine’s leader into interfering in the 2020 election.", "In the recording, Trump stated:", "But basically that person never saw the report, never saw the call. He never saw the call, heard something and decided that he or she or whoever the hell it is — they're almost a spy. I want to know, who is this person that gave the whistleblower. Who's the person that gave the whistleblower the information? Because that's close to a spy. You know what we used to do in the old days, when we were smart, right? With spies and treason. We used to handle it a little differently than we do now.", "The first part of the quote above appears to reference the whistleblower when Trump says, \"But basically that person never saw the report, never saw the call. He never saw the call, heard something and decided that he or she or whoever the hell it is — they're almost a spy.\" The second part of the quote, however, appears to reference the person who provided information to the whistleblower.", "In both cases, Trump suggests they're spies, and his remarks have been interpreted by some as a \"veiled reference to execution\" because treason carries the death penalty. It was not the first time the president has brandished the specter of harsh punishment to be levied against his political enemies for investigating him, an action he has stated he considers treason. On Twitter, Trump has accused the whistleblower, and/or the person who supplied the whistleblower with sensitive information, of \"spying\" on the president.", "....In addition, I want to meet not only my accuser, who presented SECOND & THIRD HAND INFORMATION, but also the person who illegally gave this information, which was largely incorrect, to the “Whistleblower.” Was this person SPYING on the U.S. President? Big Consequences!", "— Donald J. Trump (@realDonaldTrump) September 29, 2019", "In the past, Trump has referenced the case of Ethel and Julius Rosenberg, two American citizens who were executed in 1953 for espionage against the United States on behalf of what was then the Soviet Union. In July 2019, talking to reporters aboard Air Force One, Trump stated in reference to allegations against his campaign of collusion with Russia:", "What pressure? I didn’t — I did nothing. Hey, now it's shown there's no collusion, there's no obstruction, there's no nothing. Honestly, the whole thing, it is really a media witch hunt. It's been a media witch hunt. And it's bad for the country. You know, when you talk about Russia, if Russia actually did whatever they want to do, they got to be laughing, because look at what happens — how much time. . . .", "They feel it's a witch hunt, the people. There are a lot of people. And those people vote. They don’t stay home because it's drizzling. We proved that. But every single party chairman said that my base is substantially stronger than it was in November. That's a big compliment. That's a big compliment. And I feel it.", "And I think what's happening is, as usual, the Democrats have played their card too hard on the Russia thing, because people aren’t believing it. It's a witch hunt and they understand that. When they say \"treason\" — you know what treason is? That's Julius and Ethel Rosenberg for giving the atomic bomb, okay? But what about all the congressmen, where I see the woman sitting there surrounded by — in Congress.", "Although it's true Trump's comments are threatening in nature, and he has discussed the death penalty as punishment for treason, we are rating this claim \"Mixture.\" That's because Trump did not state outright that the whistleblower and/or the whistleblower's informant should be put to death, but rather implied it.", "Stokols, Eli. \"Listen: Audio of Trump Discussing Whistleblower at Private Event: ‘That’s Close to a Spy.'\"\r\n  Los Angeles Times. 26 September 2019.", "The Washington Post. \"Excerpts from Trump’s Conversation with Reporters on Air Force One.\"\r\n  26 September 2019.", "Jenkins, John Phillip. \"Julius Rosenberg and Ethel Rosenberg.\"\r\n  Encyclopedia Britannica.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]