["About this rating", "On 7 December 2016, the web site Truthfeed published an article reporting that the MSNBC and CNN cable news channels went into a \"ratings freefall\" after the 2016 presidential election while Fox News' viewership increased:", "BREAKING: CNN and MSNBC In RATINGS FREEFALL — Fox Soundly Beating Both COMBINED", "It is very clear what is happening here. Trump supporters are permanently boycotting BOTH CNN and MSNBC in a punishing rebuke to their blatant Anti-Trump bias during the election.", "Fox News is enjoying a sustained post-election ratings bounce, soundly beating its primary cable news competition.", "This article was based on a 6 December 2016 report published by The Hill, which correctly stated that Fox News was averaging an audience of 2.9 million viewers (compared to CNN’s 960,000 and MSNBC’s 959,000) a month after the\nelection.  CNN and MSNBC did see a ratings dip after Donald Trump's election victory on 8 November 2016, although attributing the decline wholly or primary to Trump supporters' boycotting those news outlets seems to be a matter of assumption or speculation rather than hard data.", "According to Nielsen ratings data compiled by TV Newser, Fox News' overall viewership indeed grew in the month following the election, while both MSNBC and CNN saw their ratings dip. In the key 25-54-year-old demographic for the primetime hours, however, all three networks saw their audience shrink, although the losses for CNN (-47%) and MSNBC (-42%) were proportionally much larger than that of Fox News (-2%).", "Although Truthfeed credited some form of Trump boycott for this ratings dip, the truth is that the decline in viewership was largely expected. Fox News, MSNBC, and CNN all saw major viewership gains during the 2016 election, and a post-election decline was fairly inevitable:", "During a time of retrenchment across the media industry, Campaign 2016 has been a shot in the arm for CNN, MSNBC, Politico and any other network or website that traffics in scoops about the latest Donald Trump accuser or Hillary Clinton email. The cable news networks, for example, have posted double — and in some cases triple-digit — gains in viewers this year compared to 2015.", "The end of this legendarily nasty (and newsy) election cycle is unlikely to cheer anyone who writes headlines for a living. That’s especially true since the winner was Trump, a indefatigable critic of reporters he doesn’t like. But it was inevitable that the bubble had to burst.", "“There’s massive news-watching fatigue,” Tom Nunan, a TV and movie producer and lecturer at the UCLA School of Theater, Film and Television, said. “I really think people are going to take a break until the inauguration.”", "Nonetheless, according to Business Insider both CNN and MSNBC had record-breaking years in 2016:", "CNN also saw a boon in ratings. 2016 proved to be the channel's most-watched year among total viewers.", "In primetime, CNN placed eighth with an average of 1.3 million viewers, its highest ranking since 1995.", "And while MSNBC finished behind both CNN and Fox, it experienced significant growth, outpacing its rival networks in total-day gains. 2016 was also its most-watched year.", "As of late March 2019, Adweek's TV Newser was still ranking Fox News as outdrawing CNN and MSNBC combined:", "Collins, Scott.   \"Here’s Why the Election’s End is Very Bad News for CNN, MSNBC and Politico.\"\r\n    The Wrap.   9 November 2016.", "De Moraes, Lisa.   \"Cable TV Rankings 2016: Presidential Politics Fuels Ratings Gains.\"\r\n    Deadline.   20 December 2016.", "Katz, A.J.   \"Fox News Has Been Delivering Total Audience Gains Since the Election.\"\r\n    TVNewser.   5 December 2016.", "Katz, A.J.   \"Scoreboard: Monday, March 25.\"\r\n    TVNewser.   26 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]