["“Notice how the Whitmer kidnapping story disappeared after we found out the perps were ANTIFA and BLM anarchists?” reads an October 17, 2020 Facebook post posted by ForAmerica, a right-wing political organization.", "The arrest of 13 men in a plot to kidnap Michigan Governor Gretchen Whitmer and “instigate a civil war” placed a fresh spotlight on the growth of armed, right-wing extremists in the United States. Many of those arrested expressed support for the Boogaloo ideology, which promotes “a violent uprising against the government or impending politically-motivated civil war,” a Michigan state court filing said.", "FBI agent Richard Trask testified on October 13 in a bond hearing for five of the men charged that they were angry about Covid-19 lockdown measures, among other issues, and talked about “taking a sitting governor,” specifically mentioning Michigan and Virginia, US media reported.", "Trask said the kidnap plan for Whitmer included possibly putting her on mock trial, taking her to another state or stranding her on a boat in the middle of huge Lake Michigan.", "Several plotters were members of the recently-formed local Wolverine Watchmen armed extremist group, and some had joined rallies against Whitmer's coronavirus restrictions, wearing paramilitary gear, carrying multiple weapons, and declaring their rights were being violated.", "Black Lives Matter and Antifa groups came under fire this summer from the right after some demonstrations protesting the death of George Floyd at the hands of police descended into riots.", "“I can confirm that none of the defendants are members of Black Lives Matter or Antifa,” Ryan Jarvi, a spokesman for the Michigan attorney general’s office, told AFP in an email.", "The FBI became aware through social media that a group of individuals were discussing the violent overthrow of certain government and law enforcement groups earlier this year, the federal criminal complaint says.", "AFP found no results for the terms “antifa,” “anti-fascist,” “BLM” or “Black Lives Matter” in various documents, including a state court document, comments from the western Michigan attorney general and a Department of Justice statement.", "One of the alleged plotters, Daniel Harris, attended a Black Lives Matter protest in June, the Washington Post reported, citing the local Oakland County Times. Black Lives Matter has not responded to requests for comment on whether Harris was affiliated with the organization.", "Mark Bray, a historian at Rutgers University in New Jersey and author of “Antifa: The Anti-Fascist Handbook” told AFP by email that the defendants were the “opposite” of anti-fascists.", "“Antifascists do not oppose mask-wearing and social distancing measures etc or forcing workers to go back to work in unsafe conditions which were among the reasons the right opposed the governor of Michigan,” Bray said.", "“Law enforcement and journalists have been unanimous in ascribing blame to the far right. Boogaloo is a term derived from a far right notion of race war. Instead antifascists are anti-racists and internationalists.”", "Democrats blasted Trump on October 18 for criticizing Whitmer over her Covid-19 lockdown measures and refusing to condemn right-wing extremists.", "“One week after a plot to kidnap and murder me was revealed, the President renewed his attacks,” Whitmer tweeted on October 16. “Words matter. I am asking people of goodwill on both sides of the aisle — please, lower the heat of this dangerous rhetoric.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]