["The one-minute video was posted on Facebook on January 10, 2021.", "“Hundreds of Muslim boarding school students in Indonesia fell sick after being vaccinated let’s watch the news,” the Indonesian-language caption reads.", "Text superimposed on the video reads: “Anyone who wants to be vaccinated” and “for Mr Jokowi’s citizens”.", "The footage shows children being carried into a room and laid on the floor.", "“Jokowi” is the nickname of Indonesian President Joko Widodo.", "A man speaking in the first 45 seconds of the video asks, “To those who are present here, who’d like to be vaccinated? Anybody would like to get a vaccine jab? Yes? Seriously, nobody wants to? Why? Are you afraid?”", "The video was shared days before Indonesia kicked off its Covid-19 vaccination programme on January 13, 2021, with Jokowi receiving the first jab of CoronaVac, which is made by Chinese company Sinovac.", "The clip has been viewed more than 1.7 million times after it was posted with a similar claim on TikTok here and here, Facebook here, here and here, and YouTube here.", "A keyword search found that the clip matches a video report from local broadcaster Jember 1TV, posted on its YouTube channel on March 1, 2018. The video is titled: “Tens of Muslim Boarding School Students Faint After Diphtheria Immunisations.”", "The Indonesian-language caption says: “Tens of students of Muslim boarding school in Jenggawah district, Jember, fainted because of dehydrated after they were given diphtheria vaccination. The students’ parents panicked and arrived at the boarding school.”", "Jenggawah is a district in Jember Regency in Indonesia’s East Java province.", "Below is a screenshot comparison between the video in the misleading post (L) and the Jember 1TV footage (R):", "Indonesian news website Liputan 6 also published the report on the incident on March 1, 2018, headlined: “73 Muslim Boarding School Students Nauseous After Diphtheria Immunisations”.", "“A group of students from Madinatul Ulum Islamic boarding school, at Jatirejo hamlet, Cangkring village, Jenggawah district, Jember, East Java Province, were treated at the Jenggawah Community Clinic. Most of them received medical care at the school because they felt nauseous, had headaches and felt weak on Tuesday evening, February 27, 2018,” the report reads.", "“It is believed that those symptoms were the side effects of diphtheria immunisations that the students received on Tuesday morning. ‘73 students felt nauseous, had a headache and felt weak, their bodies shivered. It’s probably caused by side effects of the diphtheria vaccinations,’ said Madinatul Ulum official KH Lutfi Ahmad at the boarding school, on Wednesday, February 28, 2018.”", "Side effects of diphtheria vaccines can include fatigue, nausea and vomiting, according to the Centers for Disease Control and Prevention.", "The incident was also reported by Indonesian state news agency Antara and news outlet Detik.com.", "The president’s remarks", "The remarks of the man heard at the beginning of the video match those made by Jokowi with regards to the Covid-19 vaccine during a meeting with small-business owners at the Bogor presidential palace on December 18, 2020, as reported by Antara news agency and online news site Kumparan.", "The Kumparan report, headlined: “Jokowi: I Hope Nobody Will Refuse Corona Vaccine,” reads: “Jokowi asked the business owners if they’d like to receive the Covid-19 vaccines, but none of them responded. It was after the second question that some of them raised their hands.", "“To those who are present here, who’d like to be vaccinated? Anybody would like to get a vaccine jab? Yes? Seriously, nobody wants to? Why? Are you afraid? Who doesn’t want to be vaccinated? Anyone? Anyone here who doesn’t want to be vaccinated?” Jokowi asked.", "“‘I have already said that I would be the first person to get vaccinated. I would be the first in Indonesia, because the vaccine is safe. When everybody is vaccinated, the situation is returning to normal again,” he explained.", "AFP previously debunked a similar video in Indonesia which also falsely purports to show residents falling ill after taking a Covid-19 vaccine.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]