["About this rating", "Although numerous plays, musicals, films, books, and television programs have melded humor with the sport of baseball, the quintessential amalgamation of comedy and the American national pastime remains the renowned \"Who's on First?\" skit popularized by the\ncomedy team of Bud Abbott and Lou Costello.  Drawn from stock burlesque sketches and honed to perfection by Abbott and Costello over many years and thousands  of performances, the skit — which plays on the predictable confusion involved in keeping track of a baseball roster stocked with players bearing names such as \"Who,\" \"What,\" and \"I Don't Know\" — was a staple of the duo's radio appearances from the late 1930s through the 1940s as well as the centerpiece of their 1945 feature film, The Naughty Nineties.  (So popular was the comedy routine, rumor had it, that the pair was contractually obligated to perform it at least once a month on their radio program.)", "The enduring popularity of the \"Who's on First?\" sketch created a similarly enduring association between Abbott and Costello and baseball, contributing to the mistaken belief that the comedians have been the only people with no professional connection to the sport to be honored with induction into the National Baseball Hall of Fame in Cooperstown, New York.  Erroneous statements to this effect, such as the following, can be found on a variety of web sites:", "In 1956, one year before the release of their last film together, \"Dance With Me Henry,\" and their official (and amicable) split, Bud and Lou were brought together on THE STEVE ALLEN SHOW before a live nationwide viewing audience. The emotion was further heightened when Steve Allen announced the induction of Abbott & Costello and their Gold Record of \"Who's On First\" into the World-famous, BASEBALL HALL OF FAME in Cooperstown, N.Y. Abbott & Costello are the first non-baseball playing celebrities ever to be inducted into the Baseball Hall of Fame.", "Q: Right before Bud and Lou broke up, they appeared on The Steve Allen Show and were inducted into the Baseball Hall of Fame. Did they know that was going to happen before going on the show?", "A: No, I think it was set up as a surprise. Then, of course, the gold record of \"Who's on First?\" was dedicated to the Baseball Hall of Fame by Bud and Lou. They were the first non-baseball player celebrities that were inducted into the Baseball Hall of Fame.", "As of 2019, the Hall of Fame has so far enshrined 323 members, but Abbott and Costello don't number among them, nor do any other non-baseball personnel — all members are former players, managers, executives, or umpires.  (The Hall of Fame honors baseball writers and broadcasters with the J.G. Taylor Spink Award and the Ford C. Frick Award, respectively, but these honorees are not officially members of the Hall itself.)", "According to the Hall of Fame's FAQ:", "Q: Who are the only members of the Hall of Fame that have nothing to do with baseball?", "A: We often hear baseball fans ask the following trivia question: “Who are the only members of the Hall of Fame that have nothing to do with baseball?” The supposed answer is “Bud Abbott and Lou Costello.” Actually, that answer isn’t quite correct. Abbott and Costello are not members of the National Baseball Hall of Fame, though the comedy duo is featured in our museum. Furthermore, Abbott and Costello most certainly have a lot to do with baseball as they made popular one of the most famous and beloved comedy routines of all time: “Who’s on First?”", "The confusion probably stems from a May 1956 announcement that a recording and transcript of the famous routine were going to be put on permanent display in the National Baseball Hall of Fame museum:", "A gold recording of the \"Who's on First?\" routine of Bud Abbott and Lou Costello will be placed on permanent display at the National Baseball Hall of Fame museum in Cooperstown, N.Y., a spokesman for the comedians said today.", "Also to be exhibited late next month will be a framed copy of the dialogue they have performed more than 15,000 times in twenty years. The spokesman said word of the honor came to Abbott and Costello from Paul S. Kerr and Sid C. Keener, Hall of Fame officials.", "Costello commented, \"This is better than getting an Oscar.\"", "(News of the honor could not have been broken as a surprise to Abbott and Costello on The Steve Allen Show, as that program's debut didn't occur until a month after the public announcement quoted above.)", "The belief that Abbott and Costello are \"in\" the Hall of Fame as members is understandable given that the official name of the Cooperstown baseball institution is the National Baseball Hall of Fame and Museum, and the museum portion (where the \"Who's on First?\" recording is housed) is far more prominent — occupying about 93% of the exhibit space — than the gallery where the inductees' plaques are displayed.  The misassociation of the museum exhibits with the Hall itself has led to similar mistakes: In the coda to the 1992 film A League of Their Own, veterans of the All-American Girls Professional Baseball League (AAGPBL) are announced as \"the first women ever to be inducted into the Baseball Hall of Fame,\" but in fact they were simply recognized with the addition of a permanent \"Women in Baseball\" museum exhibit in 1988.", "Although Abbott and Costello may not be actual members of the Hall of Fame, they're featured more prominently in the museum than some of the figures who are.  For two men who never set foot on a professional baseball field in any official capacity, that's quite an honor.", "Brooks, Tim and Earle Marsh.   The Complete Directory to Prime Time Network and Cable TV Shows.\r\n    New York: Ballantine Books, 2003.   ISBN 0-345-45542-8   (pp. 1130-1131).", "Deane, Bill.   \"Baseball Hall Is Smaller Than You Think.\"\r\n    The [Oneonta] Daily Star.   20 September 2003.", "Dunning, John.   On the Air: The Encyclopedia of Old-Time Radio.\r\n    New York: Oxford Univ. Press, 1998.    ISBN 0-19-507678-8    (pp. 2-3).", "Nachman, Gerald.   Raised on Radio.\r\n    New York: Pantheon, 1998.   ISBN 0-375-40287-X   (pp. 35-38).", "Associated Press.   \"Baseball Skit in Shrine.\"\r\n    The New York Times.   30 May 1956   (p. 16).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]