["President Donald Trump delivers his State of the Union address to a joint session of Congress on Capitol Hill in Washington on Feb. 4, 2020, as Vice President Mike Pence and House Speaker Nancy Pelosi, D-Calif., watch. (AP)", "In his wide-ranging State of the Union address, President Donald Trump returned to a favorite theme: the cost of health insurance.", "He cited the high cost of premiums for people who buy their coverage through the Affordable Care Act marketplaces and said his administration has provided new, less costly coverage.", "\"I moved quickly to provide affordable alternatives. Our new plans are up to 60% less expensive and better,\" Trump told the lawmakers gathered at the Capitol.", "So we wondered, to which new alternatives was he referring? We reached out to the White House to ask.", "Spokesperson Adam Kennedy responded that the president was talking about short-term, limited-duration plans. But that got us thinking: Are they really less expensive and better? Or simply better than nothing?", "They are not. As background, short-term insurance plans have been around for decades in various iterations and are generally considered a stopgap solution for people between jobs or attending school. They provide some protections, usually paying a percentage of hospital and doctor bills after the policyholder meets a deductible.", "But they’ve always been a bit controversial.", "Unlike the ACA plans now available, short-term plans can bar people with health conditions from enrolling or exclude coverage for specific conditions or treatments. They also offer fewer benefits — meaning they are not required to comply with the health law’s mandated essential benefits requirement.", "So, for example, they don’t have to cover prescription drugs, or mental health services or substance abuse treatment — and many don’t. In addition, they can set annual or lifetime caps on benefits. Almost all exclude maternity care.", "If a person develops a health condition during the coverage term, insurers can look through their medical records and, in some cases, retroactively cancel the plans — or refuse to renew the coverage at the end of the policy’s term.", "The Obama administration restricted these policies, which still cannot be sold on the ACA marketplaces and do not qualify for subsidies, to a maximum coverage period of 90 days, down from the 364 days that applied previously.", "The Trump administration reversed that time-limit restriction in 2018 and built on it by allowing insurers to offer policies renewable for up to three years.", "Officials, including Health and Human Services Secretary Alex Azar, said at the time that these short-term plans provide an alternative but aren’t a good fit for everyone.", "For instance, the Trump rules require the policies to carry a warning that they aren’t \"required to comply with federal requirements for health insurance.\" They also state that consumers should \"check the policy carefully to make sure you understand what the policy does and doesn’t cover.\"", "The White House pointed us toward a January 2019 report produced by the Congressional Budget Office and the Joint Committee on Taxation as the source for the president’s assertion that these plans are 60% less expensive.", "It quickly becomes clear that the analysis is very wonky and complex.", "After all, it’s not easy to project what benefits insurers will include in short-term plans or what they will charge individuals, which can vary based on their health. Even the analysts called the estimating process \"challenging.\"", "When it came right down to it, they hedged: Short-term plans are likely cheaper than the lowest-cost ACA plan for some consumers, but more expensive for others. For example, people who get a federal tax credit to buy ACA-compliant insurance or those who are older or less healthy would likely pay more in premiums for a traditional short-term plan, the analysts said.", "Conversely, those without subsidies, especially younger or healthier consumers, might pay as much as 60% less than they would for the lowest-cost plan through the ACA, the analysis concluded. Another study, not cited by the White House but done by the conservative Manhattan Institute, also listed caveats, but more robustly defended the plans as less expensive. Premiums for short-term plans are lower — in some cases, almost half the cost — of ACA plans, it concluded.", "But critics put these price tags in context. \"I don’t have a reason to suspect the 60% is wrong if they’re lining them up against ACA plans, but if you’re a health plan that doesn’t cover much, it’s easy enough to offer a cheap premium,\" said Sabrina Corlette, research professor and co-director of the Center on Health Insurance Reforms at Georgetown University.", "The consensus is that the coverage short-term plans provide is not better than that of ACA plans. But it could be better than going without insurance entirely.", "\"Why not throw another option out there?\" said Doug Badger, senior fellow at the conservative Galen Institute. \"You might say this plan isn’t as good as that plan, but we may both agree that having this one is better than nothing.\"", "He said that should be a decision made by consumers, who can weigh the pros and cons: \"They know their circumstances and risk tolerance.\".", "Still, it’s a gamble, as no one knows what health conditions might befall them. A plan that doesn’t cover prescription drugs may be fine the first month, but if a serious illness crops up, it suddenly has unexpected costs.", "Others also note that short-term plans may have wider networks of doctors and hospitals than some ACA plans, giving consumers more options.", "\"In Texas, for example, you cannot buy an ACA plan that covers MD Anderson,\" the cancer center of the University of Texas, said Brian Blase, CEO of Blase Policy Strategies. Blase has advised Trump on his health policy efforts. \"The only way you can have such a plan that includes MD Anderson — unless you have employer coverage — is in a short-term plan.\"", "Again, nice to have a wide network. But there’s a conundrum. Someone with cancer — attracted to a network because it includes MD Anderson — would be rejected by most short-term plans.", "That ability to reject applicants — or seriously limit coverage of their preexisting conditions — helps keep premiums down.", "But those are also the main reasons experts say the plans are not better than those offered under the ACA, which bars such limits.", "A preexisting condition is often defined as anything treated — or for which a \"prudent person\" should have sought treatment — during the previous 12 months to five years, depending on the insurer.", "\"If you have high blood pressure and, while on one of these plans, you have a heart attack, the plan could say that was a preexisting condition,\" said Corlette.", "State regulation of such plans varies widely, as do the coverage benefits and limits offered by various insurers. Some have limits listed in the fine print.", "While short-term plans have been embraced by regulators in some states, nearly half of all states have moved to limit them to less than 12 months. Four — California, Massachusetts, New Jersey and New York — have barred them altogether.", "Those states cite concerns about the effect on ACA premiums and the risk that consumers could be left hanging by the more limited nature of the short-term plans.", "Trump said these are new plans that are 60% cheaper and better.", "But short-terms plans are not a new idea. Just how much cheaper they are depends on a lot of factors, experts told us. And it’s very hard to examine them in an apples-to-apples comparison with ACA plans, which cover far more and are required to accept all applicants.", "Given the limitations of short-term plans, they’re not better than ACA plans for most people, because policyholders could face potentially significant financial risk — or find their treatment needs are not covered. They’re definitely not better for people who qualify for federal subsidies to buy ACA insurance, especially those at the lower end of that income range, where the subsidies are larger.", "That said, a short-term plan may be better than going without coverage at all, particularly for a young or otherwise healthy person, whose income is above subsidy limits.", "We rate this claim as Mostly False.", "Email response from Adam Kennedy, spokesperson, Executive Office of the President, Feb. 5, 2020.", "Telephone interview with Sabrina Corlette, research professor and co-director of the Center on Health Insurance Reforms at Georgetown University, Feb. 5, 2020.", "Telephone interview with Tom Miller, resident fellow at the American Enterprise Institute, Feb. 5, 2020.", "Telephone interview with Brian Blase, CEO of Blase Policy Strategies, Feb. 5, 2020.", "Telephone interview with Doug Badger, senior fellow at the Galen Institute, Feb. 5, 2020.", "Congressional Budget Office, \"How CBO and JCT Analyzed Coverage Effects of New Rules for Association Health Plans and Short-Term Plans,\" January 2019.", "Kaiser Health News, \"Trump Administration Loosens Restrictions On Short-Term Health Plans,\" Aug. 1, 2018.", "Federal Register, \"Short-Term, Limited-Duration Insurance,\" Aug. 3, 2018.", "Commonwealth Fund, \"States Step Up to Protect Insurance Markets and Consumers from Short-Term Health Plans,\" May 2, 2019.", "FierceHealthcare, \"Azar touts agency progress on growing insurance options,\" Feb. 28, 2019.", "Manhattan Institute, \"Renewable Term Health Insurance: Better Coverage Than Obamacare,\" May 16, 2019.", "Commonwealth Fund, \"Short Term Health Plan Gaps and Limits Leave People at Risk,\" Oct. 20, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]