["By Angelo Fichera", "Posted on August 16, 2019", "A viral meme on Facebook falsely claims that members of Congress have received a “231%” increase in pay in the last 30 years. Automatic cost-of-living adjustments have resulted in an increase of 94.4% from 1989 to 2009.", "Members of Congress haven’t received a salary increase in a decade.", "Prior to that, congressional salaries climbed nearly 95% from 1989 to 2009, as a result of an annual adjustment formula based on economic factors, according to a May report by the nonpartisan Congressional Research Service.", "It is not the case that salaries “have gone up 231%” in the “past 30 years,” as a Facebook meme shared by tens of thousands of users claims.", "In 1989, according to the CRS, most representatives and senators collected a salary of $89,500. Today, members of Congress — with the exception of congressional leaders — make $174,000. That’s a 94.4% increase.", "Again, that change is decided by an automatic adjustment formula that was established by a 1989 law, which we’ve written about before. The adjustment formula is “based on changes in private sector wages and salaries as measured by the Employment Cost Index,” the CRS report notes.", "The percentage increase cannot surpass that for “General Schedule” federal employees, and the adjustment automatically goes into effect unless Congress statutorily denies it. Congress has done just that every year since 2009, therefore freezing their salaries.", "Accordingly, the CRS report says, “[m]ember salaries, when adjusted for inflation, decreased 15% from 2009 until 2019.”", "The meme also asserts that “[n]ow Congress is saying they need a $4,500 raise.” As we’ve previously reported, legislators were considering allowing the automatic pay raise — of 2.6%, or $4,500 — to go into effect for 2020 as scheduled. House Democratic leaders postponed any action on that in June. Congress is currently on recess until after Labor Day.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Fichera, Angelo. “Post Misleads on Congressional Salaries, Social Security.” FactCheck.org. 14 Jun 2019.", "“General Schedule.” U.S. Office of Personnel Management. Accessed 13 Aug 2019.", "“Salaries.” U.S. House Press Gallery. Accessed 14 Aug 2019.", "“Salaries of Members of Congress: Recent Actions and Historical Tables.” Congressional Research Service. 17 May 2019.", "“Senate Salaries since 1789.” U.S. Senate. Accessed 15 Aug 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]