["Then-House Speaker John Boehner of Ohio listens as then-Minority Leader Nancy Pelosi of California speaks before the signing of the Justice for Victims of Trafficking Act in May 2015 (AP).", "• There is no evidence that President Donald Trump established a child protective force that searches for missing children.", "• The U.S. Marshals Service has helped recover missing children, but not more than 300 in less than 30 days, as the post claims.", "• The Marshals’ Missing Child Unit was created during the Obama administration.", "A social media post says that President Donald Trump is underappreciated for his actions to help missing children.", "\"You people hate on Trump but he put on a child protective force that found over 300 missing kids in less than 30 days,\" the Facebook post reads.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There is no evidence Trump created a \"child protective force,\" or that his administration found more than 300 missing children in less than 30 days.", "Such an event would have likely prompted attention from news outlets, but PolitiFact searched news archives and found nothing to suggest that more than 300 missing children had been found recently.", "Social media platforms are seeing a wave of misinformation related to child abuse and trafficking.", "Followers of a baseless conspiracy theory called QAnon have been promoting the belief that Trump is working behind the scenes to bring down a child trafficking ring led by prominent Democrats and celebrities. The FBI considers QAnon a potential domestic terrorism threat.", "The Justice for Victims of Trafficking Act of 2015 gave the U.S. Marshals Service, a unit of the Justice Department, more authority to help local officials find missing children. The bill passed in Congress with bipartisan support, and President Barack Obama signed it into law in May 2015.", "By 2016, according to the agency’s annual report and a fact sheet, the Marshals Service had created a Missing Child Unit to help federal, state and local law enforcement locate \"missing, endangered or abducted children, regardless of whether a fugitive or sex offender was involved.\" That was before Trump took office.", "In August 2020, the Missing Child Unit, along with state and local agencies, conducted a two-week operation known as \"Operation Not Forgotten\" that found 39 missing children in Georgia.", "According to a press release, 26 children were rescued, 13 were safely located and nine arrests were made.", "\"The message to missing children and their families is that we will never stop looking for you,\" Donald Washington, the director of the Marshals Service, said in the statement.", "In October 2018, U.S. Marshals reported that a one-day sting operation in Michigan resulted in the recovery of more than 100 missing children. The operation \"sought to identify and recover 301 missing children, with an emphasis on locating victims of sex trafficking,\" according to news reports. Local officials reported that 107 children were found, and 103 of those children were \"either at home or where they belonged.\"", "Other news outlets reported that the Marshals’ Oct. 3 press release, which has since been taken down, exaggerated the success of the Michigan operation. The Marshals’ press release said 123 children had been recovered — it included 16 children the Marshals recovered in a separate operation.", "The press release also said three children were potentially linked to sex trafficking and one teenager was found homeless, but the release didn’t \"elaborate on where the remaining 119 children were found,\" HuffPost reported.", "The Detroit News reported: \"Only four of the children in that group were actually missing; the rest were merely listed as missing in police computers, Michigan State Police Lt. Michael Shaw said. Shaw said most of the kids had been reported as missing in the past, but their parents never alerted police they'd returned home.\"", "Whether the Michigan operation located 107 or 123 missing children, neither number supports the post’s claim that Trump administration officials \"found over 300 missing kids in less than 30 days.\"", "A Facebook post says Trump established a \"child protective force that found over 300 missing kids in less than 30 days.\"", "The U.S. Marshals Missing Child Unit conducted operations in 2018 and 2020 to locate children listed as missing. Many of them turned out to be where they lived or belonged.", "There is no evidence Trump created a \"child protective force,\" or that 300 missing children were found in less than a month.", "We rate this claim False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "CBS News, \"U.S. Marshals say they found 39 missing children in Georgia during two-week operation,\" Aug. 30, 2020", "Rolling Stone, \"Over 100 Missing Children Found in Michigan,\" Oct. 10, 2018", "KPRC 2 Click2Houston YouTube, \"U.S. Marshals rescue 39 missing children in Georgia sex trafficking raid,\" Aug. 28, 2020", "U.S. Marshals Service, \"U.S. Marshals Find 39 Missing Children in Georgia During 'Operation Not Forgotten,’\" Aug. 27, 2020", "Fox 23 News, \"US Marshals recover 123 missing children in Michigan county,\" Oct. 9, 2018", "Huffpost, \"U.S. Marshals Service Says It Recovered 123 Missing Michigan Children, But Did It?\" Oct. 10, 2020", "The Detroit News, \"Boy, 14, found squatting in abandoned Detroit house,\" Oct. 9, 2018", "U.S. Marshal Service, \"U.S. Marshals Service Fact Sheet - Missing Child Program,\" Feb. 25, 2020", "Congressional Research Service, \"Justice for Victims of Trafficking Act of 2015: Changes to Domestic Human Trafficking Policies,\" Dec. 17, 2015", "United States Marshals Service, \"FY 2016 Annual Report,\" accessed Sept. 16, 2020", "The Hill, \"Justice for Victims of Trafficking Act of 2015,\" May 29, 2015", "The Hill, \"Senate passes trafficking bill 99-0, ending long abortion fight,\" April 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]