["About this rating", "Humans have been modifying their bodies as long as there have been tools available to do so. Tattoos, piercings, corseting, and other practices generally characterized as \"transgressive\" actually come with centuries of historical weight, and even newer types of body modification generally have precedents.", "Eyeball tattooing is no exception to this, despite popping up mostly in news stories after 2015, when an inmate in Alaska appeared in court with one of his sclera evidently tattooed:", "Jason Barnum, also known as \"Eyeball,\" was sentenced to 22 years in prison for shooting a police officer.  His face and eye tattoos came up during the sentencing hearings as well; the prosecution said that his tattoos showed a specific behavior pattern, and Barnum argued that poor decisions earlier in life had left him unable to find work.", "At any rate, eye tattoos are real -- and permanent. The BBC weighed in on the practice of eyeball tattooing in 2015, concluding that the tattoos are a strikingly visible way to proclaim one's individuality to the world:", "Looking a little out-of-this world is something that appealed to Kylie Garth, a body piercer who works in Luna Cobra's Sydney studio. Before deciding to change the colour of her eyeballs, Garth had experimented with a number of body modifications including face tattoos, piercings, elf-like pointed ears and a bifurcated tongue.", "\"It was mentally intense,\" she says of the several injections needed to colour her eyeballs a delicate blue-green, a colour she refers to as sea foam.", "\"It feels like somebody is poking at your eye, then it feels like strange pressure and then it feels you have a bit of sand in your eye, but there's no pain.\"", "In 2007, a handful of stories ran on the practice of eyeball tattooing, mostly focusing on a tattoo artist named Luna Cobra who tattooed Garth's sclera and who claims to have invented the modern practice:", "First and foremost, I, Luna Cobra, am the inventor of eyeball, or sclera, tattooing (tattooing the white of the eye in a solid or mix of colours). I first attempted the procedure on sighted human eyeballs in 2007 on three well-informed and consenting parties. Since then, I have fine-tuned both the technique and materials to increase the safety and minimize the risks of tattooing the eyeball. There are still risks involved, of course, but in the 8 years I have been performing this procedure, all my clients are all still ok.", "Secondly, I personally have not trained anyone else to do this procedure. I have appeared on various tv/news segments though, and have inspired many copycats worldwide. This is important to know because without the proper education, training, experience and guidance, these practitioners have caused vision impairments like blurred vision, spots or floaters, and even blindness. YES PEOPLE ARE NOW BLIND FROM EYEBALL TATTOOING.", "The practice of tattooing the sclera or the cornea (mostly the cornea, over the iris of the eye) stretches back to at least the first century A.D. and has been documented as a cosmetic enhancement (e.g., a way to alleviate unsightly scars on the iris) since then:", "Permanent colouring of unsightly corneal scars has been known for almost 2000 years. During the final decade of the 19th and the first decades of the 20th century it was a commonly applied technique. Owing to the tremendous progress in microsurgical reconstructive procedures, corneal tattooing today will only apply for a minor and carefully selected group of patients.", "However, the procedure of coloring the whites of the eyes for elective cosmetic purposes has gained ground since Luna Cobra apparently developed it.  That procedure is slightly less invasive, consisting of sandwiching pigments between the sclera and the conjunctiva of the eye, rather than depositing bits of ink just beneath the upper layer, as with a more traditional tattoo:", "Using the injection method of eyeball tattooing, where a larger area of ink is injected via a single hole, complex designs are not possible, and although fades from one color to another are possible to some extent, they can be difficult to control and master. The difficulty in controlling the spread of the ink makes this method inadvisable for the cornea (ie. over the iris and pupil) because of the danger of obscuring vision if the ink spreads over the pupil. Because only a few injections are required to completely cover the white of an eye with ink, many of the risks in the traditional method such as significant ink loss and ulceration are largely mitigated (although they are not eliminated). However, the injections can be difficult to control, and over-injection or injections that are too deep or too shallow carry significant risk — the appropriate zone is less than a millimetre thick, with serious consequences for missing it.", "The medical community uses almost exclusively the traditional tattoo method — although even after 150 years they have not come up with an agreed upon technique, which is very telling — whereas the body modification community uses almost exclusively the injection method. To date, attempts to tattoo the white of the eye using traditional needle methods have been extremely unsatistfactory, almost completely falling out. The general consensus is that injection is the only acceptable method of scleral tattooing.", "The end result of this method permanently turns the whites of the eyes another color to create an otherworldly, striking look.", "Gifford S.R., Steinberg A.   \"Gold and silver impregnation of cornea for cosmetic purposes.\"\r\n American Journal of Ophthalmology. 1927.", "Larratt, Shannon.  \"The Eyeball Tattoo FAQ.\"  \r\n Body Modification Ezine.  21 November 2012.", "Pitz, S., et al. \"Corneal Tattooing: An Alternative Treatment for Disfiguring Corneal Scars.\" \r\n  British Journal of Opthamology.   April 2002.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]