["About this rating", "In a 2015 speech, Sen. Bernie Sanders, who represents Vermont, compared living conditions in Baltimore to a \"third world country.\"", "Sanders' comments were taken out of context to create a false equivalence between his 2015 statement and Trump's 2019 attack on Rep. Elijah Cummings, who represents Baltimore.", "U.S. Rep. Elijah Cummings laid into Acting Secretary of Homeland Security Kevin McAleenan during a House Oversight Committee hearing on July 18, 2019, calling attention to the Trump administration's treatment of migrant children after reports they were being held in filthy, overcrowded conditions at border-detention facilities.", "So began a snowballing reaction from U.S. President Donald Trump and his supporters that started with attacks on Cummings, a long-serving Democratic congressman who represents Baltimore, eventually leading to pointing fingers at unrelated comments Sen. Bernie Sanders made in 2015.", "Cummings, who chairs the House Oversight Committee, gave an emotional response when Acting Department of Homeland Security Secretary Kevin McAleenan said the immigration agencies he oversees are \"doing our level best\" to handle detained children at the U.S.-Mexico border.", "\"What does that mean when a child is sitting in their own feces, can't take a shower?\" Cummings asked, his voice rising. \"None of us would have our children in that position.\" He added, \"They are human beings.\"", "Cummings was responding to news reports of neglect and squalor at migrant facilities that have included details that children \"as young as 7 and 8, many of them wearing clothes caked with snot and tears, are caring for infants they’ve just met, the lawyers said. Toddlers without diapers are relieving themselves in their pants. Teenage mothers are wearing clothes stained with breast milk.\"", "Trump responded to Cummings' criticism of his administration's treatment of migrants more than a week later by taking to Twitter to attack the congressman and the city of Baltimore, which is in Cummings' district. The Twitter tirade, in which Trump called Baltimore \"a disgusting, rat and rodent infested mess,\" prompted some people to renew ongoing criticism that his recent comments targeting non-white leaders are racist.", "Trump found a new angle on the topic on July 29, 2019, six minutes after hosts on the Fox News morning talk show \"Fox & Friends\" said during their broadcast that Sanders made disparaging comments about Baltimore while visiting the city in 2015.", "Crazy Bernie Sanders recently equated the City of Baltimore to a THIRD WORLD COUNTRY! Based on that statement, I assume that Bernie must now be labeled a Racist, just as a Republican would if he used that term and standard! The fact is, Baltimore can be brought back, maybe......", "— Donald J. Trump (@realDonaldTrump) July 29, 2019", "Trump's tweet is misleading in that Sanders' comments weren't recent, and the speech in which Sanders made them occurred in a different context. Trump's complaint about being \"labeled a Racist\" reflects criticism he faced after he attacked several lawmakers of color, while Sanders, according to contemporaneous news reports, was attempting to win over potential black voters. The bulk of the race criticism came on July 14, 2019, after Trump tweeted that four female congresswomen, all of whom are people of color and U.S. citizens, should \"go back and help fix the totally broken and crime infested places from which they came.\"", "Sanders, an Independent from Vermont who caucuses with Democrats in Congress, gave the speech in question in Baltimore on Dec. 8, 2015. He said, \"The fact of the matter is that America is the wealthiest country in the history of the world. But anyone who took the walk that we took around this neighborhood would not think you're in a wealthy nation. You would think that you're in a third world country.\"", "Sanders was then, as he is as of this writing, running for president as a Democrat, and he gave the speech after he took a walking tour of the West Baltimore neighborhood where Freddie Gray was arrested. Gray died on April 19, 2015, from spinal cord injuries while in police custody, in a high-profile case that led to widespread anger and unrest over police violence directed at the black community.", "Sanders' speech was not the equivalent in content or context to Trump's statement about Baltimore, despite efforts to paint it that way after the fact. Trump's comments were an attack on a political opponent, Cummings, who is African-American and who represents a city with a large black community. Sanders' speech, on the other hand, denounced structural racism in a reported effort to reach black voters.", "In his speech, Sanders called out conditions in the community that were indicative of those faced by the broader African-American population, including economic inequality, higher unemployment, lack of educational opportunity, mass incarceration and even the lack of basic amenities, like grocery stores in some communities.", "\"There is an enormous amount of work to be done and we have the people to do that work,\" Sanders said (his full speech can be viewed here.) \"What we need is changes in our national priorities and to stop ignoring those many, many millions of people who are hurting today, who are not receiving the kind of attention or redress that they are entitled to from their government.\"", "In contrast, Trump's response to violence and unrest over the killing of Gray in 2015 was to blame then-President Barack Obama for it, again alluding to race.", "Our great African American President hasn't exactly had a positive impact on the thugs who are so happily and openly destroying Baltimore!", "— Donald J. Trump (@realDonaldTrump) April 28, 2015", "Sanders responded on Twitter on July 29, 2019, to Trump's comments about the 2015 speech:", "Trump's lies and racism never end.", "While I have been fighting to lift the people of Baltimore and elsewhere out of poverty with good paying jobs, housing and health care, he has been attacking workers and the poor. https://t.co/7N0K4GQgEO", "— Bernie Sanders (@BernieSanders) July 29, 2019", "Although it's true that Sanders likened parts of Baltimore to a \"third world country,\" he made the comments while visiting that city on the heels of racial unrest there to make a broader point about the need to fight structural racism. Pointing to his quote to claim it's the equivalent of Trump's political attack on the black congressman who represents Baltimore is misleading.", "Stolberg, Sheryl Gay. \"Baltimore to Trump: You Lost Your Authority to Criticize.\"\r\n  The New York Times. 29 July 2019.", "Barker, Jeff. \"Trump Attacks on Baltimore, Cummings Become Political Litmus Test, With Democratic Presidential Debates Ahead.\"\r\n  The Baltimore Sun. 29 July 2019.", "Brokaw, Summer, and Cone, Allen. \"Trump Attacks Elijah Cummings Over Border Criticism.\"\r\n  UPI. 27 July 2019.", "Romero, Simon, et al. \"Hungry, Scared and Sick: Inside the Migrant Detention Center in Clint, Tex.\"\r\n  The New York Times. 9 July 2019.", "Dickerson, Caitlin. \"‘There Is a Stench’: Soiled Clothes and No Baths for Migrant Children at a Texas Center.\"\r\n  The New York Times. 21 June 2019.", "Rogers, Katie and Nicholas Fandos. \"Trump Tells Congresswomen to ‘Go Back’ to the Countries They Came From.\"\r\n  The New York Times. 14 July 2019.", "Cheney, Kyle. \"Sanders Courts Black Voters in O'Malley's Baltimore.\"\r\n  Politico. 8 December 2015.", "Fritze, John. \"Bernie Sanders Likens West Baltimore to 'Third World' Country.\"\r\n  The Baltimore Sun. 8 December 2015.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]