["About this rating", "Farmers in India have been camped around Delhi, outside the capital city, for the last two months in protest of 2020 farm laws which they say benefit big private buyers at the expense of growers. On Jan. 26, 2020, the protests turned violent as a number of groups broke through barricades surrounding the historic Red Fort in the heart of the city, and made their way to the ramparts.", "Prominent Indian journalists, analysts, and government spokespersons spread misinformation online subsequently. Some claimed that the protesters had torn down the national tricolor flag, while others said the protesters had put up the Khalistan flag, representing a Sikh secessionist movement.", "Both claims were proven false by means of video and photographic evidence taken around the same time protesters hoisted their own flags at the Red Fort. Footage showed a protester climbing a flagpole below the Indian flag and hoisting a smaller triangular flag. Video and photographs captured by numerous media outlets showed the tricolor flag was still on a different pole at a higher spot on the Red Fort throughout the protest. The other flags were hoisted on an empty pole below it.", "https://twitter.com/IndianExpress/status/1353990450432987136/photo/1", "Getty Images photographs from the same day showed a triangular saffron flag alongside another rectangular yellow flag on the same pole:", "NEW DELHI, INDIA - JANUARY 26: Indian farmers gather at the iconic Red Fort during Republic Day to protest over new farming laws on January 26, 2021 in in New Delhi, India. Some farmers stormed the Red Fort and hoisted flags from the ramparts where traditionally India’s Prime Minister hoists the national flag on Independence Day. (Photo by Pallava Bagla/Corbis via Getty Images)", "Many claimed these flags were symbols of the Khalistan separatist movement. A closer look at the flags erected at the Red Fort showed that the same ones were a common sight during the months-long demonstrations. The yellow or saffron flags visible throughout the photographs and videos carry Sikh religious iconography and are referred to as the Nishan Sahib. Such flags are visible at Sikh temples and even during India’s Republic Day festivities as well. The rectangular yellow flag with green text carried farmers' slogans.", "Members of the Khalistan movement have often carried rectangular flags with the same symbol as the Nishan Sahib but with “Khalistan” written on them. Neither of the flags visible on the pole at the Red Fort had Khalistan written on them.", "The protesters at the Red Fort were themselves carrying the Indian flag. Furthermore, many leaders of farmers' unions condemned the groups that broke through the barricades and stormed the fort but said they would continue protesting.", "Given that these rumors have been widely debunked through video and photographic evidence, we rate this claim as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]