["By Robert Farley", "Posted on March 11, 2020", "Sen. Bernie Sanders wrongly claimed President Donald Trump said if people have symptoms of the new coronavirus infection, “doesn’t matter, go to work.” That’s not what the president said.", "Trump was making the point that infections are likely to go unreported by many who may experience only mild symptoms, opt not to go to a doctor and then get better — including some who may continue to go to work. As a result, Trump said, the rate of deaths from COVID-19, the illness caused by the new coronavirus, may appear to be higher because of the unreported cases.", "Some may fault Trump for not immediately noting — as the Centers for Disease Control and Prevention has — that people who experience symptoms are encouraged not to go to work. But Trump was not recommending that people with coronavirus infections go to work.", "Sanders’ comments came during a Fox News town hall on March 9 when he was asked to assess Trump’s handling of the novel coronavirus outbreak.", "Sanders said the fast-spreading virus — which has now been declared a pandemic — demonstrates why Medicare for All is a good idea.", "“You have got millions of people in this country today who may feel that they have a symptom, but you know what? They cannot afford to go to a doctor. And then they are going to go to work,” Sanders said. “We have a president of the United States, you know, ‘Doesn’t matter, go to work.’ We have a president who says absurd things. So, what we need to do is, right now make it clear that all Americans, if you are feeling sick, go to a doctor. It will be paid for. Don’t hesitate to go to the doctor.” (See the 4:05 mark of the video.)", "About a minute later, Sanders mocked the president for saying he has a “natural ability” to understand the problem.", "“You don’t say stupid things,” Sanders said. “You don’t suggest to people that you can go to work. That’s not what the scientists and what the doctors are saying.”", "Sanders isn’t the only one who has characterized Trump’s words this way. For example, Democratic Rep. John Yarmuth tweeted: “As a general rule, you shouldn’t trust what President Trump says. With the coronavirus, it could be dangerous to your health. Don’t go to work if you are sick.”", "But Trump never said that sick people should go to work.", "Trump made the comments in question in a telephone interview on March 4 with Fox News’ Sean Hannity, when the president called the World Health Organization estimate that 3.4% of reported COVID-19 patients worldwide have died “a false number.” As we wrote, that’s not a false number, although experts say Trump has a point that the fatality rate may ultimately be quite a bit less than 3.4%, because the WHO’s rate does not take into account unreported cases. Trump’s point was that there are likely a lot of unreported cases.", "Trump, March 4: Well, I think the 3.4% is really a false number. Now, this is just my hunch, and — but based on a lot of conversations with a lot of people that do this, because a lot of people will have this, and it’s very mild. They will get better very rapidly. They don’t even see a doctor. They don’t even call a doctor. You never hear about those people. So, you can’t put them down in the category of the overall population in terms of this corona flu and — or virus. So you just can’t do that. So, if we have thousands or hundreds of thousands of people that get better just by, you know, sitting around and even going to work — some of them go to work, but they get better. And then, when you do have a death, like you have had in the state of Washington, like you had one in California — I believe you had one in New York — you know, all of a sudden, it seems like 3 or 4%, which is a very high number, as opposed to — as opposed to a fraction of 1%. But, again, they don’t know about the easy cases, because the easy cases don’t go to the hospital.", "Trump did not say that people experiencing symptoms of the virus should go to work. Rather, he was saying that cases will go unreported because many people will not go to a doctor; they will simply allow the illness to take its course and get better.", "After some TV commentators criticized the president’s comment, Trump tweeted that he “NEVER said people that are feeling sick should go to work.”", "To be clear, the CDC has recommended that employers “actively encourage sick employees to stay home.”", "According to the CDC, “Employees who have symptoms of acute respiratory illness are recommended to stay home and not come to work until they are free of fever (100.4° F [37.8° C] or greater using an oral thermometer), signs of a fever, and any other symptoms for at least 24 hours, without the use of fever-reducing or other symptom-altering medicines (e.g. cough suppressants).”", "Some may fault Trump for not echoing those warnings to workers and employers when he made his comments on Fox News, but his point was not that people with symptoms should go to work, only that some with mild symptoms will.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]