["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The state has historically made higher education one of its top budget priorities, along with K-12 education and aid to local governments.", "But have prisons jumped ahead of higher education?", "That’s what Democratic gubernatorial challenger Mary Burke claims.", "\"Part of the increase in the cost (of higher education) has been because state support has dropped,\" she said in a June 2, 2014 discussion with the Fond du Lac Reporter’s editorial board.", "\"We now spend, under Governor Walker, more on corrections than we do on higher education.\"", "Burke’s claim really has two parts.", "First, that state support for higher education has dropped, which has resulted in a greater cost to students. Second, that thanks to Walker’s budgets, we are now spending more on corrections than higher education.", "Is she right?", "Education spending", "At a time when college-trained workers are in high demand, the UW System often feels the heat of state budget cuts.", "When asked for backup, Burke spokesman Joe Zepecki pointed to the state budget, which shows state support for the UW System has dropped in each of the last three budget cycles to 18.99% of the state’s 2013-15 budget.", "In raw numbers, the state spent $2.273 billion on the UW System before Walker took office and spent $2.247 billion in the 2013-2015 budget. That is a drop of about $26 million.", "Adding to the squeeze: The UW System’s enrollment rose by 10 percent in the past decade, while the system’s share of state appropriations shrank, according to a Milwaukee Journal Sentinel analysis from August 16, 2012.", "It’s part of a national trend.", "\"Budget-strapped states have had to cut what they spend on higher education,\" said a study released by the College Board in 2013. The report said total state appropriations for public universities have fallen by 19 percent nationwide since 2007.", "So, state support is down. But have costs to Wisconsin students gone up as a result, as Burke claimed?", "In the past three budgets, tuition increased annually by 5.5 percent from 2007-2012. That is the maximum allowed under state caps that regulate increases.", "For the 2011-12 academic year, this meant a tuition hike of $422 at the University of Wisconsin-Milwaukee and $681 at the University of Wisconsin-Madison.", "In 2012, Gov. Scott Walker launched a systemwide tuition freeze. He extended this freeze to last through the 2015-16 academic year based on projections that the UW System would end 2014 with more than $1.7 billion on hand in reserves.", "While tuition remains frozen, the Board of Regents in June 2014 hiked student segregated fees by an average of $39 per student and raised the the average cost of housing by $178. Its budget also called for increasing spending by 1.7 percent for the 2014-15 academic year.", "Tuition freezes are not a sustainable solution to the problem, said Todd Berry, president of the Wisconsin Taxpayers Alliance.", "\"In a sense, today’s students are being given tuition freezes because prior students got tuition increases,\" Berry said.", "Sinking state support also makes public universities rely more on tuition, fundraising fees, and other revenue sources to cover more of their costs. But these sources can’t cover it all, so this has lead to a strained reliance on them.", "So students’ families end up with more of the cost, since state and federal aid to students has dried up considerably since 2009-10, according to the College Board study’s co-author Sandy Baum.", "There is a similar picture when you consider the state’s technical colleges.", "Since Walker took office, state spending for tech colleges fell by $65 million to $221 million.", "But they will get a $5 million bump in support for their 2014-15 academic year.", "Given all this, Burke is essentially on target on this part of the claim.", "Corrections vs. higher education", "Now, let’s take a look at the second part.", "Burke cites the state’s 2013-15 budget as her source for saying that state corrections spending now trumps state support for higher ed.", "The budget documents show $2.315 billion in state appropriations to corrections, and $68 million less, or $2.247 billion, to the UW System.", "It was in Walker’s first budget, covering 2011-13, that the lines crossed.", "This chart shows the recent trend:", "Budget", "UW System appropriations (GPR)", "UW System percentage of total GPR expenditures", "Corrections appropriations (GPR)", "Corrections percentage of total GPR expenditures", "2003-2005", "1,908,506,300", "8.51%", "1,702,971,700", "7.59%", "2005-2007", "1,930,780,800", "7.49%", "1,802,134,800", "6.99%", "2007-2009", "2,237,870,400", "8.03%", "2,167,424,300", "7.78%", "2009-2011", "2,273,309,900", "8.215%", "2,252,212,400", "8.139%", "2011-2013", "2,095,251,600", "7.218%", "2,250,923,800", "7.754%", "2013-2015", "2,247,320,900", "7.398%", "$2,315,095,600", "7.621%", "The 2011 Journal Sentinel story that examined more than 20 years of budgets found this trend has been in the works regardless of which party was in charge of state government, through policy changes and shifts in budget priorities.", "Changes in sentencing and correctional policy launched in the 1980s led to the state’s rising prison population in the 1990s as more and more prisons were being built, the Journal Sentinel story found.", "Since 1990, state spending on corrections grew by 620%, without inflation. Spending tapered off in 2012 and has been mostly flat in the last decade, Berry said.", "The state’s inmate population also grew in the past 20 years -- from about 7,000 to 22,000 inmates. This requires more personnel costs to guard, feed, and provide medical care to them so it will be difficult to cut state spending on corrections anytime soon, the Journal Sentinel story notes.", "One last point.", "The higher education vs. corrections comparison Burke does not include state spending on technical colleges and the Higher Education Aids Board, the board which runs students’ financial aid. Together, they add another $512.7 million to the higher education tab in the 2013-’15 budget.", "When the tech colleges and aid board are included, corrections no longer comes out on top. The state still spends slightly more on higher education than corrections when those items are included.", "Our rating", "Burke said that \"Part of the increase in the cost (of higher education) has been because state support has dropped. We now spend, under Governor Walker, more on corrections than we do on higher education.\"", "The first part of Burke’s claim is on target. The drop in state support for higher education -- even with the recent tuition freeze -- has meant increased costs for the students.", "The lines crossed between corrections and the UW System during Walker’s time in office. But the trend had been heading in that direction for years so the blame does not fall squarely on Walker. What’s more, when spending on technical colleges is considered, the lines have not yet crossed.", "We rate Burke’s statement Half True.", "Wisconsin 2013-2015 Budget", "Milwaukee Journal Sentinel, \"As priorities shift, corrections budget passes UW System,\" Aug. 16, 2012", "PolitiFact Wisconsin, \"Wisconsin college tuition: Average increases 5.5%, never before been frozen two straight years,\" Jan. 23, 2014", "Bureau of Labor Statistics, tuition figures", "College Board, tuition study, 2013", "Interview, Sandy Baum, co-author of the College Board Study", "Interview Todd Berry, president of the Wisconsin Taxpayer’s Alliance", "Milwaukee Journal Sentinel, \"UW System budget pares undesignated cash reserves,\" June 5, 2014", "Emails, Joe Zepecki, spokesman, Mary Burke campaign, June 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]