["About this rating", "In a 2015 radio talk show discussion about the period shaming of women, Rosie O'Donnell said, “I’d like to take my period blood I no longer have and write, ‘You’re all assh***s.’ I’d like to smear it all over some people’s faces.”", "Her comment wasn't directed specifically at Christians or pro-lifers.", "According to various unreliable sources, plainspoken comedian and former The View co-host Rosie O'Donnell said publicly that she'd like to smear her menstrual blood all over either Christians' faces or pro-life people's faces — depending on which version you read. Both versions are misrepresentations of what O'Donnell actually said.", "On 12 August 2015, O'Donnell made a call-in appearance on the SiriusXM radio talk show Just Jenny, on which the topic of moment was menstrual blood. Specifically, the show's host, Jenny Hutt, and another guest had been criticizing marathon runner Kiran Gandhi's decision to run the London Marathon that year without wearing a tampon. O'Donnell took exception to their critical remarks.", "\"I can't believe two smart, intelligent women who I love, both named Jenny, are on the radio saying periods are disgusting,\" she said, comparing the discussion to Republican presidential candidate Donald Trump's then-recent comment about Fox News anchor Megyn Kelly, who had questioned him during a televised debate about his misogynistic statements toward women (including O'Donnell herself).", "\"You could see there was blood coming out of her eyes,\" Trump said of Kelly afterward. \"Blood coming out of her wherever.\" Trump later tweeted that he had meant \"blood coming out of her 'nose,'\" but he was widely understood as having purposely implied that Kelly must be having her period.", "According to O'Donnell, such demeaning comments are part of a widening \"war on women\" in America:", "Bigger than any specific people, there's a war on women that's happening in this country, starting with basic abortion rights, freedom to choose, that we fought for in the sixties and seventies, that women died for, bleeding in back alleys from hanger abortions. Women fought for equality in this country, and right now, politically, it's being taken away from us, and it doesn't help with you guys thinking, \"Oh, that woman who showed the blood, the menstruation blood — ew, that was disgusting, she's not fun to have dinner with. Come on, ladies.", "This prompted agreement from host Jenny Hutt, who admitted, \"There is still shame associated with periods.\"", "\"From men!\" O'Donnell replied. \"From men, ladies, and it doesn't help when the women do it!\"", "She continued:", "If you've got a period, you're gonna bleed. That blood is gonna keep the baby alive in your stomach, and the children that you love. It's part of being a human. Men get erections and semen comes out.", "Let's get off the period talk unless you're gonna be empowering. I'd like to take my period blood that I no longer have and write, you know, \"You're all assholes.\" I'd like to smear it all over some people's faces. So don't jump on the bandwagon with the period, please. We all have periods, okay?", "Based on the context of her remarks, the most reasonable interpretation would seem to be that O'Donnell was targeting people — mainly men, in her eyes — who had engaged in menstrual shaming, not specifically Christians or pro-life advocates.", "Salinger, Tobias.  \"Rosie O’Donnell: I Want to Use Period Blood to Write ‘You’re All A-------.\"\r\n    [New York] Daily News.   16 August 2015.", "Yan, Holly.  \"Donald Trump's 'Blood' Comment About Megyn Kelly Draws Outrage.\"\r\n    CNN.   8 August 2015.", "Zagorski, Sarah.  \"Rosie O’Donnell: 'I’d Like to Take My Period Blood and Smear It All Over [Pro-Life People’s] Faces.'”\r\n    Life News.   14 August 2015.", "PatDollard.com.  \"Rosie O’Donnell: “I’d Like to Take My Period Blood and Smear It All Over Christians’ Faces.'\"\r\n    21 August 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]