["About this rating", "On 17 May 2019, the \"Pictures in History\" Facebook page shared an image that supposedly showed a young Donald Trump (5 or 6 years old) in 1952:", "Many of the president's supporters took to Facebook to remark on how cute Donald Trump was as a child, but this is not a genuine photograph of a young Trump. This is actually an image of an adult Trump that was put through a \"baby filter\" on Snapchat.", "In May 2019, social media users posted a number of images that supposedly showed various celebrities as \"babies.\" Twitter user @MajorMarvelKing, for example, applied this Snapchat filter to various still images from the Avengers films:", "While we're not entirely sure who created this picture of baby Trump, we did find the real photograph that was used as a basis for it:", "On the left is an image President Trump during an appearance on the Oprah Winfrey Showin 1988, and on the right is the same image of Trump, who was about 42 years old at the time, after we ran it through Snapchat's baby filter.", "Whoever created the viral \"young Trump\" image also applied a black and white filter to make it appear as if the image had been taken during the 1950s.", "If you're curious as to how Donald Trump actually looked as a child, here is a genuine photograph from Trump's childhood:", "President Trump shared this image to his Instagram page in 2013 with the caption \"Who knew this innocent kid would grow into a monster? #TBT #Trump.\"", "Hill, Harry.   \"The Snapchat Baby filter on Characters from TV and Movies Is Absolutely Hilarious.\"\r\n    Mashable.   16 May 2019.", "YourEDM.   \"How to Get the New Snapchat Baby Filter Everyone Is Posting.\"\r\n    13 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]