["The image was published on Instagram here by Kirron Kher, a prominent lawmaker in the ruling Bharatiya Janata Party.", "The post’s caption reads: “Tricolour at Lal Chowk Srinagar, Jai Hindi #IndependenceDay.”", "Tricolour is a common reference to the Indian flag, which consists of three different colours, and Jai Hind is a Hindi slogan that translates as: “Victory to India”.", "Lal Chowk is a public square in Srinagar that has long been a site for political demonstrations, including flag hoistings, in the disputed region.", "The image was also shared alongside similar claims and Independence Day messages on Facebook here, here and here; and on Instagram here, here and here.", "Other Indian politicians published the image on social media here, here and here.", "However, the claim is false.", "A reverse image search on Yandex led to evidence showing that the image has been doctored.", "The original photo, which does not contain an Indian flag, was published in July 2010 by an Indian journalist in this blog.", "The photo is captioned: “A deserted Lal Chowk, Srinagar, June 22 2010.”", "Below is a screenshot comparison of the image shared on Facebook (L) and the original 2010 photo (R) with identical features marked A, B and C:", "An AFP stringer in Srinagar, Syed Shahriyar, also confirmed that no India flag was raised in Lal Chowk on August 15, 2020.", "Shahriyar captured the below photo on the morning of that day:", "A local media outlet also published this video on Facebook on August 15, 2020, which shows Lal Chowk deserted. The caption reads: “15 August: Kashmir capital Srinagar.”", "Getty Images published another photo here showing no Indian flag over Lal Chowk on August 15, 2020.", "In addition, several other Facebook users shared the manipulated image alongside an old photo of the Pakistani flag hoisted over Lal Chowk. Example posts can be seen here, here and here.", "While the image of the Indian flag flying over Lal Chowk is fake, the photo of the hoisted Pakistani flag appears to be authentic and show a political demonstration in 2010.", "The photo corresponds to the AFP photo below, which is captioned: “Kashmiri protestors hoisting a flag on to a clock tower in Srinagar on September 11, 2010.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]