["On August 28, Times Now reported on an image posted by Twitter account @iaMeetuSingh which claimed to be the “official account” of late actor Sushant Singh Rajput’s sister. Rajput was found dead in his Bandra apartment on June 14. @iaMeetuSingh tweeted a picture of the late actor with his sister Meetu Singh and wrote, “Missing u immensely my soulmate @itsSSR; you will always be in my heart…. no words to describe the void.” This was retweeted less than 300 times. (archived link)", "Times Now not only tweeted about the account but also aired it as ‘breaking’ news.", "Sushant Singh Rajput reportedly had four sisters Shweta, Priyanka, Meetu and Neetu. Alt News performed a keyword search on Twitter and found that on August 19, Shweta had tweeted that @iaMeetuSingh is a fake account.", "Please, report this fake account 👇 https://t.co/RlliD6eaw1", "— Shweta Singh Kirti (@shwetasinghkirt) August 19, 2020", "Shweta follows the genuine account of Meetu which is @divinemitz.", "Additionally, Alt News found that the image posted by the imposter account was earlier shared by Meetu on her Instagram account.", "Furthermore, the caption used to post the image was identical to the tweet made by Sushant’s sister Priyanka on August 3.", "Missing u immensely my soulmate @itsSSR; you will always be in my heart…. no words to describe the void. pic.twitter.com/zZTYr8v6zO", "— Priyanka Singh (@withoutthemind) August 3, 2020", "There are several other hints which suggest that @iaMeetuSingh is an imposter account. It is newly created and has far less number of followers than Meetu’s genuine account. This misinformation was earlier fact-checked by Boomlive.", "Times Nows fell for an imposter account and turned it into ‘breaking news’. Earlier, IANS had promoted tweets by a fake account posing as Sushant Singh Rajput’s father and Aaj Tak had fallen for a fake account dedicated to the actor himself.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]