["In Nebraska’s 2nd Congressional District, claims about the nation’s finances flew back and forth in a recent debate between Democratic challenger Kara Eastman and incumbent Republican Don Bacon.", "One in particular caught our attention.", "In a discussion about the economy and tax policy, Eastman criticized Bacon’s support of the 2017 Republican-backed tax cuts and said it won’t benefit those in poverty or in the middle class and will add $1.9 trillion to the federal deficit.", "Bacon countered, claiming that wasn’t the case.", "\"The revenues are actually up after tax reform,\" he said. \"Revenues are up. We have to work on spending.\"", "The Congressional Budget Office projected that the Tax Cuts and Jobs Act, which President Donald Trump signed into law in December, would increase the total deficit over the next 11 years by about $1.9 trillion. According to a recent report by the the U.S. Department of the Treasury, the budget climbed to $779 billion in the 2018 fiscal year, increasing 17 percent from $666 billion in 2017.", "Bacon has a technical point. Tax collection data shows that overall revenues are slightly up. But the significance of this small increase is undermined once you factor in inflation — and there is strong evidence that tax revenues increased despite the new tax law, not because of it.", "The data does show that, without adjusting for inflation, tax revenues rose between fiscal year 2017 and fiscal year 2018 — but only by 0.4 percent.", "PolitiFact has previously reported this rise is smaller than almost every previous year since World War II, except for a few years in which tax revenues declined, largely due to recessions.", "But even this small increase disappears once you consider other context — such as the flourishing economy and an adjustment for inflation.", "The Committee for a Responsible Federal Budget, a group that favors shrinking the federal deficit, found that after adjusting for inflation, tax revenues actually fell by 1.6 percent. (The calculation is for the first 11 months of fiscal 2018, compared to the first 11 months of 2017)", "Even more important, the role of the new tax law in boosting revenues is diminished once you look at the month-by-month data for tax collections.", "Three months in fiscal year 2018 were governed by the old law — October, November and December. Another two months — March and April — were governed by the new law, but were dominated by tax payments for income generated in 2017, and thus was predominantly shaped by the old law. A final month, September, had not produced final data by the time of our article.", "That leaves six months in which it was the new law that shaped tax payments to the government — January, February, May, June, July and August.", "And if you compare the cumulative collections for those six months in 2017 and 2018, tax collections actually declined by 3.8 percent between 2017 (when the old law was in force) and 2018 (when the new law was in force).", "The Urban Institute-Brookings Institution Tax Policy Center, an independent group that models the effects of tax legislation, told us the key idea is that tax revenues naturally grow with a growing economy.", "\"The economy has been doing well. Revenues, however, haven’t grown as much,\" said Donald Marron, an institute fellow at the Tax Policy Center. \"So the tax cuts reduced revenues relative to what they would have been, just as every serious analyst predicted.\"", "The Bacon campaign said the congressman was, in fact, referring to the increased individual income tax receipts when he made the statement, not corporate revenues. Broken down, individual tax revenues have gone up, while corporate tax revenues have declined.", "Bacon defended the tax law by dismissing projections that it will add to the deficit, saying that revenues \"are actually up after tax reform.\"", "Revenues did increase by 0.4 percent, but this historically small increase disappears once inflation is factored in. In addition, any causal link between this small revenue growth and the new tax law is dubious, since during the months in which the new law predominated, revenues were actually down.", "The Bacon campaign told us he meant to say that individual tax revenues have gone up, not revenues overall. Still, he didn’t specify that to viewers. We rate the statement Half True.", "KMTV 3 News YouTube debate clip, Oct. 16, 2018", "Congressional Budget Office, How the 2017 Tax Act Affects CBO’s Projections, April 20, 2018", "U.S. Dept. of The Treasury, \"Budget Results For Fiscal Year 2018,\" Oct. 15, 2018", "The New York Times, \"No, Trump’s Tax Cut Isn’t Paying for Itself (at Least Not Yet), Oct. 17, 2018", "PolitiFact, \"Ted Cruz said GOP tax cut led to higher revenues. Did it?\" Oct. 19, 2018", "Committee For a Responsible Federal Budget, \"No, Really, Tax Revenue Has Not Risen,\" Sept. 21, 2018", "Email interview, Stu Kantor, media relations manager at Urban Institute-Brookings Institution Tax Policy Center, Oct. 25, 2018", "Email interview, Kyle Clark, director of communications for Don Bacon, Oct. 24, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]