["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tyler Perry loves the Big A. A longtime resident, he has a studio in southwest Atlanta and is about to seal the deal on developing a much larger film and television studio at shuttered Fort McPherson.", "Atlanta officials say they are likely only weeks away from closing the deal on the largest business investment to take place on Atlanta’s southside in decades.", "By mid-May, they hope to make official the sale of 330 acres at the Army’s former Fort McPherson to actor and filmmaker Tyler Perry.", "Perry, a multimillionaire and long-term Atlanta resident, is ready to pay $30 million for the property, which he plans to redevelop into a television and film studio.", "According to the city, he has already invested about $200 million in various entertainment ventures in Georgia, most notably Tyler Perry Studios in southwest Atlanta.", "The new studio, which is forecast to take about two years to construct, is expected to attract additional investment in the area and expand Atlanta's footprint in television and film, Atlanta Mayor Kasim Reed has said.", "The project could mean \"over 8,000 new jobs, including the relocation of 350 jobs,\" according a city press on Aug. 8, 2014, announcing tentative agreement between Perry and a government agency overseeing the post’s redevelopment.", "That 8.000 jobs forecast has been repeated frequently and  across all media platforms and has sometimes been attributed to Reed. The mayor, however, has parsed his words more carefully, saying the project will create \"hundreds\" of jobs and has the potential to enhance the area culturally and economically.", "PolitiFact decided the projections warranted a closer look.", "We contacted Brian Hooker, executive director of the McPherson Implementing Local Redevelopment Authority. He told us the often-touted employment figure was formulated based on data from Perry’s organization.", "The Army, he said, wanted to assess how the proposed studio would affect vehicle traffic around the post, which closed in 2011.", "The job numbers, developed in July 2014, assume that between 10 and 20 productions will be in the works at the studio all times. Each production involves 200 to 300 skilled union and nonunion workers, as well as the talent (the on-screen folks and those you and I would consider the stars).", "Jobs at the studio could range from a low of 3,900 to a high of 8,300, according to the calculations.", "The vast majority -- 2,000 to 6,000 -- involve contract work related to the productions. A production usually takes an average of four to five months, Hooker said.", "The second biggest pool of workers   -- between 500 to 1,500 -- will be temporary jobs building the studio.", "The actual number of full-time jobs is estimated at between 400 and 800, with the bulk of those -- 300 to 500 -- being members of the professional and executive staff overseeing daily operations at the studio, Hooker said.", "It’s not clear exactly how many of those executive staff employees will be true new hires. That’s because the permanent employees of the current Tyler Perry Studios, about 350, are expected to move to McPherson. (Tyler Perry Studios executives have not shared their plans for the existing studio facilities, Hooker said.)", "Between 100 to 300 workers, categorized as \"operations labor,\" also will be full time. They will be responsible for assisting set designers and others who come to the studio as part of the various productions, Hooker said.", "Our conclusion:", "Tyler Perry plans to develop a major television and film studio at the former site of Fort McPherson, providing a major boost to the community and to Georgia’s growing film industry.", "The project has been forecast to create about 8,000 jobs, including some in construction. That’s based on a report, which we examined that shows a potential range of jobs from 3,900 to 8,300.", "At best only about 800 of those are expected to be permanent jobs.", "Most of them are in contract work. That’s important and missing context that doesn’t diminish the project but shortchanges the reader.", "The overall statement from the city is partially accurate, but misleading.", "We rate the statement Half True.", "\"Mayor Kasim Reed Announces Historic Redevelopment Agreement for Fort McPherson: McPherson Implementing Local Redevelopment Authority approves tentative agreement that allows Tyler Perry Studio’s to expand production operations on 330 acres of former Army post,\" press release from Mayor Kasim Reed’s Office, posted 12 p.m. Aug. 8, 2014", "\"Perry-Fort McPherson closing in sight,\" The Atlanta Journal-Constitution, Aug. 26, 2015", "Phone interviews and email with Brian Hooker, executive director, McPherson Implementing Local Redevelopment Authority, Atlanta", "Phone calls and emails with Anne Torres, communications director, Mayor Kasim Reed", "Fort McPherso recap on Wikipedia", "\"Updated; Fort Mac; board approves pac with Tyler Perry,\" Aug, 8, 2014", "\"Lawsuits, politicans, Tyler Perry: Fort McPherson's future,\" Atlanta Curbed, Aug. 11, 2014", "Georgia Public Broadcasting: Tyler Perry Studios expands, creates 8,000 jobs", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]