["“NO Fox News in Canada” says one version of the post, shared more than 20,000 times in Canada across several accounts. It also claims: “The Radio Act makes it a crime to lie to the public via airwaves.”", "Variations of the claim have been shared in the United States and Australia, some as early as 2011.", "The core claim that the Fox News Channel is not available in Canada is false.\n\n\tThe Canadian Radio-television and Telecommunications Commission (CRTC) approved the distribution in Canada of the US-based Fox News Channel in 2004 and according to the Fox News website, the channel is currently available through 16 cable or satellite providers, with two also providing the Fox Business channel.", "The CRTC’s website confirms this on its list of “programming services and stations authorized for distribution.”", "“We can confirm Shaw Cable and Shaw Direct do indeed carry the Fox News channel for customers in Canada,” Chethan Lakshman, vice president for external affairs at Shaw Communications, Canada’s second largest television provider, told AFP in an email.", "The CRTC had previously approved a license for a new Fox News Canada channel in 2003. Fox later chose not to launch the station, writing to the CRTC that “Fox News does not intend to implement this service and therefore will not meet the extended deadline to commence operations.”", "‘Radio Act’", "Hank Intven, Adjunct Professor of Law at the University of Victoria, said by email: “There is no ‘Radio Act’ in Canada. We have a ‘Radiocommunication Act’, but it deals mostly with the radio spectrum, not broadcasting content.”", "However, Canada’s Broadcasting Distribution Regulations of 1997 do state that broadcasters cannot distribute a programming service that contains any false or misleading news.", "“Fox could be subject to complaints, but it clearly meets whatever basic regulatory requirements are in place to be included within the available broadcast distribution services,” Michael Geist, a law professor at the University of Ottawa told AFP via Twitter.", "“Claims that they've been kept out due to the Radio Act are very old and were debunked many years ago,” he said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]