["About this rating", "In December 2020, multiple TikTok videos reignited a long-standing internet debate about an allegedly sunken ship visible on Google Earth in the port of a Japanese Island:", "Indeed, the presence of this boat and its alleged sunken status has been debated in various Reddit threads for over a year.", "One common assertion is that the image shows the remains of the Ottoman frigate Ertuğrul, which sank off the coast of a Japanese Island named Kii Ōshima in 1890. If you don't put too much thought into it, you can see why this theory is popular — the sunken ship on Google Earth is seen in a port on an island named Ōshima.", "For several reasons, however, the Ertuğrul theory is impossible. The most important reason is that it's the wrong Ōshima. The Ertuğrul Ōshima can be found at the tip of the Kii Peninsula in Wakayama Prefecture, Japan. The alleged shipwreck shown in Google is in a tiny fishing village named Habu on Izu Ōshima, a different island that is located in Tokyo Prefecture, Japan.", "In other words, that well-documented historical wreck is located over 220 miles away from the port shown in Google images:", "In an effort to assess if there was any possibility that a ship actually sank in the Habu port on Izu Ōshima, Snopes attempted to identify the ship that appears to be sunken in Google's imagery. This was made possible by viewing myriad photographs, videos, and Google street images between 2015 and the present in which we were able to view the same ship parked at the same mooring year after year, above water. For example:", "The ship (right side) in February 2015:", "The ship (right side) in November 2018:", "A video drive-by of the ship from 2016 reveals that its registration number is \"TK1-1330\":", "https://streamable.com/533t7u", "This number allowed Snopes to identify the ship as the Ōshima Maru. That it is constantly moored in the same place year after year makes sense. The Ōshima Maru belongs to the Ōshima Maritime International High School, just down the road from Habu port, and is used as a training ship for various educational endeavors. Most importantly for our purposes, however, this ship did not sink, and is — at the time of this reporting — actively in service. Snopes reached out to the Ōshima Maritime International High School for further comment on the boat's presence in this long-standing internet rumor, but did not receive a response.", "Having ruled out both a historical wreck and a contemporary wreck, Snopes was forced to give up its quixotic digital hunt for an actual sunken ship and instead dive reluctantly into the most likely and least sexy explanation: an image error on the part of Google.", "Snopes reached out to Google regarding the allegedly sunken ship. In response, the company confirmed that what appears to be a submerged ship is actually an error caused by splicing multiple pictures together:", "This is not a sunken ship, it’s a mix of images, one with a ship and one with just sea in it. We are working on a fix. The pictures displayed on Google Maps satellite view (also on Google Earth) are a combination of several images taken on different dates, under different lighting and weather conditions, and sourced from different providers. When objects show up in the border region between two images taken at different times, the faint remnants of the object can sometimes be seen.", "Indeed, a look at satellite imagery from a variety of different times further supports the argument that the photograph stems from one in which the ship was present, and one in which the ship was not present. The water from the picture in which the ship is not present appears to overlay the picture in which it is, making the ship appear sunken. Below, the faulty image shows the apparently \"sunken\" ship in the same exact location and position, suggesting this latter image is the source of the apparently sunken boat:", "Because the reports of this ship's death are greatly exaggerated, and because Google confirms that an image error is at play in this instance, we rank the claim that Google Maps shows a sunken ship in Habu Port on Izu Ōshima as \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]