["U.S. Rep. Joaquin Castro, D-San Antonio, speaks Monday on Capitol Hill. (AP/Alex Brandon)", "Democratic Congressman Joaquin Castro said at a news conference on Monday that most people in Texas are opposed to constructing a wall along the U.S.-Mexico border.", "\"Our country, since its founding, has become the most prosperous and powerful nation on earth without any wall,\" said Castro, who represents San Antonio. \"That’s why I believe most of the American people and most people in my home state of Texas disagree with the president building a wall across our border.\"", "Castro offered this claim about Texans while discussing legislation he sponsored, approved by the House on Tuesday, that would block President Donald Trump’s emergency order aimed at securing funding for his border wall.", "It’s no surprise that the Democratic-controlled House opposes Trump’s plan to build a wall, but is Castro right? Do Texans also oppose a wall?", "Polls show Texans divided on the wall", "Castro spokeswoman Jamie Geller said the congressman’s claim was based on an April 2018 poll published by Quinnipiac University which reported that 53 percent of respondents surveyed opposed construction of a wall, with a margin of error of plus or minus 3.6 percentage points.", "We decided to take a step back and consider polls released on this subject since 2016 from three non-partisan entities that run surveys in Texas to assess the validity of Castro’s claim: University of Texas/Texas Tribune polls, Texas Lyceum polls and Quinnipiac University polls.", "Four polls showed more respondents opposing the wall than supporting it, with one poll showing the opposite. A sixth survey released Tuesday, after Castro made his claim on Texans opposing the wall, revealed an even split. Only two of the polls showed a clear majority in opposition to the wall.", "A University of Texas/Texas Tribune poll of registered voters in Texas published in June 2016 showed that 52 percent of respondents either strongly supported or somewhat supported a wall along the U.S.-Mexico border.", "The same poll, which had a margin of error of plus or minus 2.83 percentage points, found 40 percent of respondents said they either strongly opposed or somewhat opposed a border wall. Of those polled, 8 percent said they did not know or had no opinion on the wall.", "Two years later, in February 2018, a University of Texas/Texas Tribune poll showed that 50 percent of respondents said they either strongly opposed or somewhat opposed a border wall and 45 percent strongly supported or somewhat supported a wall.", "Two polls from Texas Lyceum, a non-profit organization, showed majorities opposing the wall. These polls did not limit the pool of respondents to likely or registered voters and instead surveyed adults in Texas.", "A September 2016 poll from the group showed that 59 percent of adults polled opposed Trump’s proposed border wall, with 35 percent supporting the wall. The poll had a margin of error of plus or minus 3.1 percentage points.", "An April 2017 Texas Lyceum poll, which had a margin of error of plus or minus 3.1 percentage points, reported 61 percent of respondents opposing the wall and 35 percent expressing support.", "One year later, in April 2018, Quinnipiac University released a poll of Texas voters that showed 53 percent of respondents opposed building a wall along the border and 43 percent supported it. The poll surveyed 1,029 voters and the margin of error of 3.6 percentage points raised the possibility that fewer than 50 percent of Texas voters actually opposed the wall.", "Geller, Castro’s spokeswoman, pointed to this April 2018 poll as the evidence behind the Democrat’s claim.", "On Tuesday, Quinnipiac University released a new poll that shows Texas voters are evenly split on whether they support a border wall.", "Of the 1,222 voters surveyed, 48 percent said they supported a wall and 48 percent said they opposed one. The poll had a margin of error of plus or minus 3.4 percentage points.", "Peter Brown, assistant director of the Quinnipiac University Poll, said the results show that Castro’s claim is not entirely true, at least as of Tuesday afternoon.", "\"It’s factually wrong,\" he said. \"It’s 48-48.\"", "But do Texas voters support the way Trump is pursuing construction of the wall?", "The same Quinnipiac University Poll showed that 60 percent of respondents said they disapproved of Trump’s move to use emergency powers to secure the funding needed to construct a wall.", "Our ruling", "Castro said \"most people in my home state of Texas disagree with the president building a wall across our border.\"", "Polls from the University of Texas/Texas Tribune, Texas Lyceum and Quinnipiac University showed that Texas voters and adults are largely divided on their support for a wall.", "Only two of the polls showed a clear majority in opposition to the wall – those conducted by Texas Lyceum in 2016 and 2017. In these two polls, the survey questioned adults in Texas and was not limited to likely or registered voters, unlike the University of Texas/Texas Tribune and Quinnipiac University polls.", "Castro’s comment was not limited to registered or likely voters, so we kept that in mind while determining a ruling.", "We rate this claim as Half True. Recent polls show more Texans opposing a border wall than supporting it, but only two of the six polls we considered showed a clear majority.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Facebook video, Press Event on the Privileged Resolution to Terminate President Trump’s Emergency Declaration, accessed Feb. 26, 2019", "Email from Jamie Geller, spokeswoman for U.S. Rep. Joaquin Castro, Feb. 29, 2019", "Phone call with Peter Brown, assistant director of the Quinnipiac University Poll, Feb. 26, 2019", "Quinnipiac University Poll, The Wall Cuts Texas Voters in Half, Feb. 26, 2019", "Quinnipiac University Poll, Texas Voters Say Yes to the Guard, No to the Wall, accessed Feb. 26, 2019", "Texas Lyceum, 2016 Texas Lyceum Poll, accessed Feb. 26, 2019", "Texas Lyceum, 2017 Texas Lyceum Poll, accessed Feb. 26, 2019", "University of Texas/Texas Tribune Poll, Support for Wall Along Mexico Border February 2018, accessed Feb. 26, 2019", "University of Texas/Texas Tribune Poll, Support for Wall Along Mexico Border June 2016, accessed Feb. 26, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]