["The reports sparked conversations around wealth and poverty in Nigeria. Many comments on social media were critical of the behaviour of the super-rich, while others expressed admiration for how the wealthiest in Nigerian society are able to get ahead. Many ended their comments with the popular saying: “God punish poverty”.", "An Instagram video of the helicopter landing on the expressway, which we’ve archived here, has been viewed more than 50,000 times. “Real Luxury Lifestyle....the Power of Money....picking up a VIP who is stuck in traffic on the Lagos Benin Expressway,” reads the caption.", "A Nigerian theatre and voice actor, Deyemi Okanlawon, also put up the video with the caption: “Father in heaven please let me be able to do this for wifey... there was a 5 hour TRAFFIC hold-up at ORE today and one ‘big boy’ sent a chopper to pick up his CHICK! Though I joke about this please note that this is actually lawlessness!” His post, archived here, has been seen more than 34,000 times.", "Many Nigerian newspapers and blogs also reported that the helicopter came in to pick up a billionaire who was trying to get away from the traffic.", "PM News reported that “the unnamed billionaire was said to have called a helicopter to pick him up from the traffic snare and to everyone’s consternation”. We’ve archived blog posts carrying similar claims  here and here.", "“Nigerian man calls for his helicopter to be used to take him to his destination, after being stuck in Lagos traffic for hours,” read the caption on one tweet carrying the video, which was retweeted more than 4,500 times.", "“Why not just build nice roads in Nigeria,” suggested one reply to the tweet. “You could save yourself from this national embarrassment.”", "But Tropical Arctic Logistics (TAL), the company that operated the helicopter, clarified at a press conference in Lagos on Thursday that it was performing a licensed medical evacuation.", "“We were therefore surprised when our attention was drawn to several reports making the rounds on social media as well as unfounded statements by some news houses about our AW 139 aircraft making unauthorised diversion on the Lagos-Benin expressway just to pick an individual caught in gridlock,” said the company’s chief operating officer Femi Adeniji.", "Adeniji said the helicopter was dispatched to “airlift an individual who suffered a serious health challenge while caught in traffic and needed emergency evacuation”. He added that the company was “saddened that such a life-saving endeavour has been painted in a negative light” on social media.", "The company refused to give details of the person in question, but it said the Nigeria Airspace Management Agency (NAMA) approved the flight planning. The BBC reported that the passenger was a man who had suffered a stroke.", "Adeniji said no laws were broken in the operation, and that TAL has not received any query from the regulators. The company has a contract with Flying Doctors, an air ambulance service in Nigeria, he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]