["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A mass shooting occurred Feb. 26, 2020 at Molson Coors in Milwaukee, where Miller beers are brewed. (Rick Wood/Milwaukee Journal Sentinel)", "A Facebook claim said a Milwaukee man committed a mass shooting after being fired for complaining that he was racially discriminated against at work.", "He had not been fired. He did complain to people about racial discrimination at work, but there is no indication he filed any formal complaint.", "A noose incident occurred five years before the shooting. Police said that based on their preliminary investigation, “neither race nor racism has been identified as a factor in this incident.”", "Hours after a mass shooting in Milwaukee, claims surfaced that the gunman had been the victim of racism at the beer brewing complex where he worked and where the shooting occurred.", "One post on Facebook claimed:", "\"Supposedly he is black. A noose was hung on his locker and he addressed the issue and he was fired! So he returned the next work day and killed who he all thought were involved.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post contains only an element of truth.", "Milwaukee police said that on the afternoon of Feb. 26, 2020, Anthony N. Ferrill, 51, shot and killed five co-workers and then killed himself at Molson Coors, commonly known by its former name of Miller Brewing, a campus with some 1,000 employees on Milwaukee’s west side.", "All six were men and were current employees of Molson Coors, police said.", "Police have withheld other details. But with regard to the claim we’re checking, here is what was known as of March 3, 2020, as reported by the Milwaukee Journal Sentinel:", "Shooter was black: It is confirmed that the shooter was black. Four of the victims were white. One was a Hispanic. They all knew each other.", "The shooter had not been fired: Ferrill, an electrician, worked for about 17 years at Molson Coors.", "Co-worker dispute: The shooter had been involved with a long-running dispute with a co-worker, one law enforcement source told the Journal Sentinel. A co-worker told the newspaper the shooter believed he was being discriminated against because he was African American, and that he had ongoing tensions with at least one of the victims.", "No formal racism complaints: Molson Coors said it is not aware of any formal complaints by the shooter to the company or government agencies about racist harassment. The federal Equal Employment Opportunity Commission told the Journal Sentinel it could neither confirm nor deny the existence of employment discrimination charges, citing federal privacy laws. The state Equal Rights Division told the newspaper it has no record of any complaints filed by Ferrill against the brewery.", "Racism not a factor: Police issued a statement on March 4, 2020, saying that based on their preliminary investigation, \"neither race nor racism has been identified as a factor in this incident.\"", "Noose incident: Five years ago, a noose was placed on or in the shooter’s locker at work. \"The employee was not working that day, our HR team notified him of the incident, it was investigated fully,\" Molson Coors said. The company said it offered human resources and security services to the employee, talked to managers about incident \"and we ensured everyone knew about our confidential paths to share discrimination or harassment complaints.\" A few months after the noose incident, several racist notes were put through the slit of Ferrill's locker, a former employee told the Journal Sentinel.", "A Facebook post said about the gunman in a Milwaukee mass shooting at the Molson Coors brewing complex: \"Supposedly he is black. A noose was hung on his locker and he addressed the issue and he was fired! So he returned the next work day and killed who he all thought were involved.\"", "The shooter was black. He was a current employee; he had not been fired. His employer said someone put a noose on his locker, but that incident occurred five years before the shooting on a day the shooter was not working. The company said it was not aware of any complaint of racial harassment being filed by the shooter. Police said based on their preliminary investigation, racism was not a factor in the shooting.", "For a statement that contains an element of truth, our rating is Mostly False.", "Facebook, post, Feb. 26, 2020", "Facebook, Milwaukee police statement, March 4, 2020", "Milwaukee Journal Sentinel, \"With silence from Milwaukee officials, rumors have grown about the Molson Coors shooting. Here's what we know,\" March 3, 2020", "Milwaukee Journal Sentinel, \"Reports emerge of friction between Miller shooter Anthony Ferrill and other Molson Coors workers,\" Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]