["About this rating", "On June 22, 2020, readers inquired whether racial justice activist Shaun King had truly posted the following tweet:", "The tweet was posted on King's account. Followed by:", "King's tweets came amid controversial and widespread protests in which demonstrators have torn down statues of oppressive historical figures, such as representations of Confederate soldiers or Spanish conquerors.", "The protests railed against structural racism and police brutality in America, prompted by the in-custody death of George Floyd on May 25, 2020. Floyd, 46, was an unarmed Black man who was pinned to the ground by former Minnesota police officer Derek Chauvin for nearly 9 minutes as he begged for his life. A bystander's video recording of the event went viral and sparked widespread outrage and condemnation.", "As to King's statement about the appearance of historical Jesus, many representations of Christianity's central figure do depict a blue-eyed white man. However, Jesus was a Jewish man who lived in the Middle Eastern region presently known as the Levant. Writing for the Evangelical magazine Christianity Today, scholar Christena Cleveland noted his physical appearance was probably unlike the westernized image many are accustomed to:", "Jesus of Nazareth likely had a darker complexion than we imagine, not unlike the olive skin common among Middle Easterners today. Princeton biblical scholar James Charlesworth goes so far as to say Jesus was “most likely dark brown and sun-tanned.” The earliest depictions of an adult Jesus showed him with an “Oriental cast” and a brown complexion. But by the sixth century, some Byzantine artists started picturing Jesus with white skin, a beard, and hair parted down the middle. This image became the standard.", "The topic prompted something of a war of words on Twitter, however we are unaware as of this writing of any instances in which statues depicting a white Jesus were torn down. Because King did post the tweet with the comment in question, we rate this claim \"Correct Attribution.\"", "Cleveland, Christena. \"Why Jesus’ Skin Color Matters.\"\r\n  Christianity Today. 18 March 2016.", "KCAL. \"Los Angeles Protesters Take Down Father Junipero Serra Statue.\"\r\n  21 June 2020.", "WRAL. \"Protesters Tear Down Parts of Confederate Monument at State Capitol.\"\r\n  19 June 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]