["Less than two months ahead of Election Day, voters are scrutinizing candidates' records.", "Posts on Facebook honed in on former Vice President Joe Biden and his record of military service — or lack thereof.", "\"Lifeguard/Football player Joe Biden got five draft deferments for asthma during Vietnam,\" a post claims, alongside a photo of high-school-aged Biden.", "Some users also compared his record with that of his opponent, President Donald Trump.", "\"Well well well!!!! We finally have a Rebuttal to the Dems saying Trump was a draft dodger..\" another post reads.", "The users behind the posts did not respond to requests for comment from USA TODAY.", "Fact check:In 2010, Donald Trump offered $6M to try to stop a mosque near Ground Zero", "Born in November 1942, Biden came of age amid the Vietnam War. But unlike millions of men of his generation, he never served in the military.", "Biden received five student draft deferments, first as an undergraduate at the University of Delaware and later as a law student at Syracuse University.", "And after a medical exam in April 1968, he received the \"1-Y\" classification, which meant he could only be drafted in a national emergency.", "Biden released his Selective Service records to the Associated Press in 2008. At the time, a spokesperson said he was \"disqualified from service because of asthma as a teenager,\" per The News Journal.", "Fact check:On a viral list of 10 Trump 'accomplishments,' 3 are true", "Born in June 1946, Trump was also a member of the generation called up to serve in the Vietnam War. Like Biden, he never did.", "He received four student draft deferments while an undergraduate at the Wharton School of the University of Pennsylvania.", "And in the spring of 1968, he, too, received the \"1-Y\" classification — for bone spurs in his heels, per The New York Times.", "Fact check:Claim that Jill Biden will require Americans to learn Spanish began as satire", "Reports have noted that both candidates played sports and appeared relatively healthy prior to their medical exemptions.", "As the viral meme says, Biden played football and worked as a lifeguard in high school — details he included in his memoir, \"Promises to Keep,\" per a report from the Associated Press.", "Similarly, the New York Times observed that Trump had played football, tennis, and squash, and \"seemed the picture of health\" prior to his medical exemption.", "Fact check:National property tax isn't part of Joe Biden's plan", "Based on our research, the claim that Biden received five draft deferments is TRUE. He was granted five deferments as a student before he received a medical exemption for asthma. Similarly, Trump was granted four deferments as a student before his exemption for bone spurs.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]