["The claim was published on Facebook here on March 18, 2020.", "The post reads: “Heard...This is issued by UNHCR. 4 bus loads of Myanmarese Muslims and Bangladeshis attended the Sri Petaling event. The illegals are afraid to be arrested if they go for testing. The refugee chat group is having problems trying to persuade migrants and illegals to be tested. They are serving in restaurant and working in Selayang market.”", "Below is a screenshot of the misleading post:", "The Sri Petaling event was an Islamic gathering held just outside Malaysia’s capital Kuala Lumpur from February 27 to March 1, 2020. The event was organized by Tablighi Jamaat, an Islamic missionary movement, and drew a crowd of about 16,000 people. Since then, several hundred confirmed COVID-19 cases in Malaysia have been linked to the gathering, according to the Ministry of Health here in an infographic.", "Selayang is an area in Selangor, the most populous state in Malaysia.", "Globally, the death toll from the virus has risen to nearly 10,000 with more than 232,000 cases in 158 countries and territories, according to the AFP tally on March 20, 2020. Malaysia has currently reported 900 confirmed cases.", "A similar claim was also published on Facebook here, here, here and here.", "But the claim is false. UNHCR officials in Malaysia refuted the claim in this statement on March 18, 2020, saying it was “FAKE”.", "The statement reads in part: “UNHCR has received reports of a WhatsApp message allegedly being sent out by UNHCR regarding refugees unwilling to get tested for COVID-19.", "“Please be advised that this message is FAKE, and has not been issued by UNHCR.", "“This message creates unnecessary fear and distrust towards refugees, and it contributes to pushing refugees even further into the margins causing distress in the communities and preventing them from seeking help when they need it.”", "The statement adds that the agency has been in close co-ordination with the Malaysian government to “ensure that refugee communities are included in the Government’s national response measures”.", "A UNHCR spokesperson also told AFP that refugees and asylum-seekers who attended the Sri Petaling event were co-operating with health officials.", "“There are reports from the communities that refugees and asylum-seekers have also participated. UNHCR has received accounts from refugee communities that affected refugees have been cooperative with authorities on tracing efforts,” the spokesperson said via email on March 19, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]