["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With President Barack Obama and his family soon vacating the White House, several websites continue to spread a fake news story that says \"first grandma\" Marian Robinson will be getting a $160,000 annual pension after they move out.", "Bloggers on the websites USPostman.com and ENHLive.com both posted undated articles that said Robinson will get paid the money for \"services rendered as full-time/in-home caregiver,\" meaning she watched granddaughters Sasha and Malia Obama. Facebook flagged the stories as part of its efforts to combat fake news.", "These stories lambast the Obamas for allegedly abusing their power and wasting taxpayer money by taking advantage of the pension. But there is no pension for the first grandma — the story is fake, and originated on a website known for trafficking in fabricated news.", "Robinson, a former bank secretary and stay-at-home mother to First Lady Michelle Obama and her brother Craig, doesn’t qualify for any kind of pension, because she’s never been a federal employee. She did move into the White House in 2009, and has helped raise her granddaughters. But she didn’t draw a salary and wasn’t on any kind of government payroll for doing that.", "There was no contact information for USPostman.com, and we received no response from ENHLive when we attempted to contact that site. But both articles mention elements found in an Oct. 17, 2016, article posted on the faux news site BostonTribune.com.", "That fake story said that an unspecified Freedom of Information Act request provided documentation that Robinson would be getting the lifetime payment. There’s no indication of what the request showed, or how they arrived at the $160,000 figure.", "The story also said she likely qualified under the Civil Service Retirement Act. That is a benefits program for federal employees that our colleagues at FactCheck.org note is only for workers who started service before 1987. It has since been replaced by the Federal Employees Retirement System.", "The false article makes oblique reference to the Former Presidents Act, which provides an annual pension for chief executives (plus Secret Service protection and some travel and transition expenses) after they leave office. For 2016 the pay level was $205,700, unless the former president holds an appointed or elected office in the federal government.", "And while presidential widows can qualify for $20,000 annual payments should their husbands die, there are no provisions to pay pensions to any other member of a former president’s family.", "The BostonTribune.com website doesn’t appear to be working as of this writing. It was run by Associated Media Coverage, another website that also ran fake news, including one about several states enacting a two-pet limit that we rated Pants On Fire! in the past.", "There’s no indication that the story is true, but other websites continue to cite it as fact in various vitriolic posts. We rate this false assertion Pants On Fire!", "https://www.sharethefacts.co/share/77ba8fae-5a6b-451b-bde0-c6fff48a3f4a", "ENHLive.com, \"WE WILL RIOT! Michelle Obama’s Mom Will Receive $160k Every Year Out Of Taxpayers’ Pockets!,\" accessed Jan. 9, 2017", "USPostman.com, \"Michelle’s Mom Will get $160,000 For Being a ‘Grandma’,\" accessed Jan. 9, 2017", "New York Times, \"Family Mainstay to Move In to White House,\" Jan. 9, 2009", "Washington Post, \"The elusive Mrs. R.: Marian Robinson, the White House’s not-so-typical live-in grandma,\" March 31, 2014", "Congressional Research Service, \"Former Presidents: Pensions, Office Allowances, and Other Federal Benefits,\" March 16, 2016", "PolitiFact Arizona, \"Popular Internet story claims Arizona, Missouri and Texas enacted two-pet limit,\" May 13, 2016", "BostonTribune.com, \"First Grandma Marian Robinson to Receive Lifetime $160K Government Pension,\" Oct. 17, 2016", "FactCheck.org, \"No ‘First Grandma’ Pension,\" Nov. 9, 2016", "National Archives, \"Former Presidents Act,\" accessed Jan. 9, 2017", "U.S. Office of Personnel Management, \"CSRS Information,\" accessed Jan. 9, 2017", "Benefits.gov, \"Civil Service Retirement System (CSRS),\" accessed Jan. 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]