["By Saranac Hale Spencer", "Posted on January 11, 2018", "Q: Did actor Morgan Freeman say that Hillary Clinton should be jailed?", "A: No. He has donated to Democrats and endorsed Clinton for president in 2016.", "FULL ANSWER", "Morgan Freeman endorsed Hillary Clinton for president in 2016.", "But, in October, a website called Your News Wire — which spreads conspiracy theories and attacks liberals — published a story falsely attributing several anti-Clinton quotes to the actor.", "The story has been picked up by more than a dozen other websites and shared more than 6,000 times on Facebook. Users of the social media site flagged it as potentially false. It is.", "Although the bogus story claims that Freeman made the remarks during a press tour in New York to promote his new documentary series, there is no record of him saying anything about Clinton going to jail.", "In fact, the series, called “The Story of Us with Morgan Freeman,” is intended to bridge the differences between people and reduce factionalism. In one recent interview, Freeman said, “The point of the show, the point of telling people about people, is so that we can, on some level, reduce the amount of tension between people who don’t know each other.”", "He is not quoted anywhere outside of the made-up story as saying that President Donald Trump was elected specifically to “lock that bitch up!”", "There is one genuine quote in the story, though. Freeman made a promotional video for the Committee to Investigate Russia, a recently formed organization that aims to educate the public about the Russian cyber threat.", "In that video, he says: “We need our president to speak directly to us and tell us the truth. We need him to sit behind the desk in the Oval Office and say, ‘My fellow Americans. During this past election, we came under attack by the Russian government. I’ve called on Congress and our intelligence community to use every resource available to conduct a thorough investigation to determine exactly how this happened.”", "That’s not the first time that he’s lent his iconic voice to political projects. Freeman also narrated campaign advertising for Clinton in 2016, and he did the voice-over for her biographical video at the Democratic National Convention, as well.", "In 2012, Freeman also gave $1 million to Priorities USA Action, a Democratic super PAC that helped to re-elect President Barack Obama, and then worked to elect Clinton four years later.", "The made-up story about Freeman is one more is a series that have claimed various celebrities are taking conservative stances.", "Another popular story claimed that actor Kevin Bacon lavished praise on Trump. He didn’t.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Sources", "Wright, David. “Morgan Freeman endorses Clinton.” CNN. 19 Feb 2016.", "Dmitry, Baxter. “Morgan Freeman: ‘Jailing Hillary’ Best Way To Restore Public Faith In Govt’.” Your News Wire. 29 Oct 2017.", "Lynch, John. “Morgan Freeman talks Pussy Riot, the keys to longevity, and his new National Geographic show.” Business Insider. 10 Oct 2017.", "Committee to Investigate Russia. “Morgan Freeman warns Russia is waging war on the U.S.” InvestigateRussia.org. 18 Sep 2017.", "Clinton, Hillary. “All The Good.” Hillary Clinton YouTube channel. 19 Feb 2016.", "Kimmel, Jimmy. “Morgan Freeman On Narrating a Hillary Clinton Campaign Video.” Jimmy Kimmel Live YouTube channel. 5 Aug 2016.", "Federal Election Commission. “Priorities USA Action.” Itemized receipts. 21 Jun 2012.", "Confessore, Nicholas. “Huge ‘Super PAC’ Is Moving Early to Back Clinton.” New York Times. 23 Jan 2014.", "Spencer, Saranac Hale. “Kevin Bacon Isn’t a Trump Supporter.” FactCheck.org. 8 Dec 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]