["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, as the COVID-19 coronavirus disease pandemic spread around the world, Snopes received a number of requests from readers asking us to verify that the 1981 “Farmer’s Almanac” or \"Farmers' Almanac\" predicted the pandemic. Almost all the queries to Snopes shared the following passage:", "In around 2020 a severe pneumonia-like illness will spread throughout the globe, attacking the lungs and the bronchial tubes and resisting all known treatments. Almost more baffling than the illness itself will be the fact that it will suddenly vanish as quickly as it arrived, attack again ten years later, and then disappear completely.", "Image via Facebook.", "Snopes had encountered this page before, when social media users connected it to numerous sources including American author Dean Koontz and self-described psychic Sylvia Browne. The page actually originates from Sylvia Browne's 2008 book, \"End of Days.\" From our previous fact check on this story:", "[Browne] gained notoriety for her claims that she could predict the future and communicate with spirits. But she was also the subject of criticism for offering the grieving parents of missing children false information.", "Browne did vaguely write in her 2008 book that a respiratory illness would spread across the globe in 2020.", "We argued that Browne's \"prediction\" was \"more a matter of lucky guessing than predicting.\" We also wrote:", "... it may come as no surprise that Browne claimed to have foreseen an international respiratory disease outbreak, considering that the SARS (severe acute respiratory syndrome) outbreak of the early 2000s occurred before her book was published.", "Almanacs, according to the Encyclopaedia Britannica, are books or tables that contain a calendar of the days, weeks, and months of the year. They keep records of astronomical phenomena, with climate information, seasonal suggestions for farmers, and other miscellaneous data.", "The \"Farmer's Almanac,\" also known as \"Old Farmer's Almanac,\" has been annually published in the United States since 1792, while another \"Farmers' Almanac\" (note the placement of the apostrophe) was developed in 1818. They all usually contain weather predictions, planting schedules, recipes, and more. Their forecasts tend to focus on weather data.", "From Encyclopaedia Britannica’s page on the \"Farmer's Almanac\":", "The almanac issued long-range weather forecasts, based on esoteric interpretations of natural phenomena, long before the United States Weather Bureau (renamed the National Weather Service in 1970) or any other weather service existed, and generations of farmers planted and harvested according to its advice.", "And the \"Farmer's Almanac\" has gotten weather predictions wrong. The Grand Forks Herald, which covers daily news from northeast North Dakota and northwest Minnesota, described some incorrect predictions for 2019:", "The first big storm of the winter season was right after Thanksgiving — Nov. 30 through Dec. 1. The Almanac’s forecast read, “Flurries, mild.” That’s a miss.", "Neither was the \"Farmers' Almanac,\" a rival to the \"Old Farmer's Almanac,\" known for being a scientifically accurate source of weather forecasts. According to a 1981 report from The New York Times, Harry K. Buie, a retired schoolteacher and the man who prepared the 1981 weather data, suffered a fatal heart attack just after compiling the data for 1982. Buie's methods for compiling this data were secretive and sketchy at best:", "The forecasts are based on a complex formula involving sunspots, the position of the planets and tidal action, said Ray Geiger, editor of the almanac …\"[Buei] kept the formula a secret — even his wife wasn’t sure what it was.\"", "In any case, there is no evidence to support the claim that any 1981 almanac predicted a virus that would spread throughout the globe in 2020. The passage cited in social media posts as originating from the 1981 \"Farmer's Almanac\" or \"Farmers' Almanac\" was misattributed.", "Britannica.com. “Almanac.”", "Britannica.com.   “Farmer’s Almanac.”", "Mortillaro, Nicole.   “Yes, winter is coming. But that's about all the Farmers' Almanac can predict accurately.”\r\n   CBC News.   31 August 2019.", "Palma, Bethania.   “Did Self-Described Psychic Sylvia Browne Predict the Coronavirus?’\r\n   Snopes.   4 March 2020.", "The New York Times.   “Mild Winter is Predicted in 1981 Farmers’ Almanac.”\r\n   15 September 1980.", "Wheeler, John.   “How accurate have 'The Old Farmer's Almanac' predictions been this winter?”\r\n   Grand Forks Herald.   10 March 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]