["Air India Express flight IX-1344 crashed at Kozhikode International Airport on August 7. Eighteen people died in the mishap and over 150 others were injured. Malayalam channel Manorama News, during its August 10 bulletin, played a video claiming that it shows the cockpit of flight IX-1344. The relevant portion can be watched onward 15:13 minutes.", "അഞ്ചു ജില്ലകളില്‍ ഇന്നുകൂടി ഓറഞ്ച് അലര്‍ട്ട്; പെട്ടിമുടിയില്‍ തിരച്ചിൽ തുടരുന്നു", "#NewsBulletin", "Posted by Manorama News TV on Monday, 10 August 2020", "A Twitter user claimed that the video is widely circulating on WhatsApp.", "Dear @airindiain A news channel from Kerala @manoramanews says this is the cockpit video of the flight #KozhikodePlaneCrash .", "Kindly clarify , is this original video , This video is heavily circulated in whatsapp. pic.twitter.com/0fgMGo0dYU", "— RebelRevolution (@rebelrevoultion) August 11, 2020", "Alt News has also received verification requests for the video on its official mobile application and WhatsApp number (+917600011160).", "This slideshow requires JavaScript.", "Facebook page ALIF News – India shared the video with the caption, “Reality of Kerala Plane Crash,” drawing over 19,000 views.", "The video is not genuine but a simulation clip. A keyword search ‘Air India Express flight crash’ takes one to the original video uploaded by YouTube channel ‘MPC Flight Recreations’ on August 7. The description of the video reads, “This is a video simulation with real data of Air India Express flight 1344, a Boeing 737 registration VT-AXH from Dubai to Calicut Airport, on august 7, 2020.”", "The part aired by Manorama News can be seen at 1:43 minutes.", "The top right corner of the video carries the words ‘academic license’ which indicates that the video was created using a software. Academic licenses are for educational products and are generally given to students or educational institutes.", "Therefore, Malayalam daily Manorama News played a simulation video claiming that the channel “received visuals” of the cockpit of the Air India Express flight that crashed on August 7. Earlier, Mathrubhumi had reported that 40 passengers of the flight tested COVID positive. This was denied by Malappuram Collector.", "Update: Manorama News sent a clarification on their broadcast after Alt News Fact Check was published. The same has been added below.", "“We had collected various visuals/simulations as models and filed them for reference. On the 10th of August, we got a still from the cockpit of the ill-fated plane. The news was based on this still. The news also clearly has details about the still like the position of the thrust lever, flap, the engine still functioning etc. We only intended to give details in the news based on this still. But inadvertently a visual which was stored for reference was used in the story. The oversight was immediately noted by our own team after the story went on air and it was withdrawn. Also, a fresh story was aired from the next bulletin. A link to the news story aired is attached for reference.”", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]