["About this rating", "President Trump signed an executive order in March 2017 that lifted a moratorium on leasing federal lands for coal mining.", "The overturned moratorium was temporary, and federal lands were still being used for coal mining in the meanwhile.", "In March 2017, multiple web sites published articles under headlines, such as \"Trump Opens National Parks and Wildlife Refuges for Coal Mining,\" which were true in a literal sense, but didn't convey that public lands had not been fully and permanently closed to such activity in the first place.", "On 28 March 2017, President Donald Trump signed an executive order titled \"Presidential Executive Order on Promoting Energy Independence and Economic Growth\" that overturned several environmental regulations implemented during the Obama administration, such as a temporary (three-year) moratorium on the leasing of federal lands for coal mining:", "Federal Land Coal Leasing Moratorium.  The Secretary of the Interior shall take all steps necessary and appropriate to amend or withdraw Secretary's Order 3338 dated January 15, 2016 (Discretionary Programmatic Environmental Impact Statement (PEIS) to Modernize the Federal Coal Program), and to lift any and all moratoria on Federal land coal leasing activities related to Order 3338.  The Secretary shall commence Federal coal leasing activities consistent with all applicable laws and regulations.", "The Obama administration placed a three-year moratorium on the leasing of federal lands for coal mining in January 2016 in order to review how domestic coal production aligned with the United State's goal of reducing greenhouse gas emissions. This moratorium did not, however, completely halt coal production on public lands — Secretary's Order 3338 temporarily stopped new coal mining efforts from starting up on public lands but but allowed existing coal mining projects to continue in operation:", "The Obama administration will halt new coal mining on public land for the next three years with immediate effect as it undertakes a review of the “environmental and public health impacts” of coal production.", "The wide-ranging review, applauded by climate and environmental groups, will assess how federal coal production fits in with the US’s commitment to reduce its greenhouse gas emissions. It will also ensure “American taxpayers are earning a fair return for the use of their public resources” — raising the possibility of a hike in royalties or a new levy on coal producers.", "About 40% of US coal is mined on public land. Barack Obama flagged new restrictions on coal exploitation in his State of the Union address, saying: “I’m going to push to change the way we manage our oil and coal resources so that they better reflect the costs they impose on taxpayers and our planet.”", "The department of interior, which oversees leases on public land, stressed that coal would continue to be an important part of the US’s energy mix and that current operations would not be affected by the freeze in new leases. It is estimated there is around 20 years-worth of coal production already under way, with 50 pending leases set to be affected by the decision.", "“The federal coal program is in needs of modernization, as we haven’t down a top-down review for the past 30 years,” said Sally Jewell, secretary of the department of interior. “The lease program was designed to get as much coal out of the ground as possible. It’s time to take a careful look to see if it best serves the needs and priorities of today.”", "Although President Trump's executive order lifted this moratorium a few years earlier then originally intended, it did not \"open\" public lands to coal mining, as such activity had already taken place and was still underway. The order did, however, allow for federal lands to be leased to coal companies for new mining operations that were precluded while the moratorium was in effect:", "Interior Secretary Ryan Zinke has ended the federal government’s Obama-era moratorium on coal-mining leases on federal land.", "Zinke signed an order repealing the pause in leases in his Washington, D.C., office, surrounded by Republican lawmakers, lobbyists and staffers.", "The action implements parts of an executive order that President Trump signed —  focused on repealing environmental policies and restrictions on energy production — under the goal of increasing energy independence.", "That means the Bureau of Land Management can now resume the process of allowing new coal-mining leases on its land.", "So yes, President Trump signed an executive order that allowed for the issuance of new coal mining leases for federal lands.  But existing coal mining operations on federal lands were still ongoing, and the moratorium that precluded the issuance of new coal mining leases was due to expire in 2019.", "Milman, Oliver.   \"Obama Administration Halts New Coal Mining Leases on Public Land.\"\r\n    The Guardian.   15 January 2016.", "Cama, Timothy.   \"Interior Secretary Reopens Federal Coal Mining.\"\r\n    The Hill.   29 March 2017.", "Office of the Secretary.   \"Secretary Zinke Takes Immediate Action to Advance American Energy Independence.\"\r\n    29 March 2017.", "Eilperin, Juliet.   \"Trump Moves Decisively to Wipe Out Obama’s Climate-Change Record.\"\r\n    The Washington Post.   28 March 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]