["By Angelo Fichera", "Posted on June 17, 2020", "A conspiracy theory on Facebook is falsely claiming that the killing of George Floyd was “filmed before covid19” because “[n]ot a single person is wearing a mask” in the videos. Some of the officers and officials in the videos can clearly be seen wearing masks.", "Since the May 25 killing of George Floyd in Minneapolis, conspiracy theories about his death have swirled online as posts have falsely suggested that the death was “staged” or that “crisis actors” were involved.", "Now, a repeatedly posted image on Facebook feeding into that narrative wrongly claims that the killing was “filmed before covid19” because “not a single person is wearing a mask” in the videos.", "“It just dawned on me the most glaring component of the Floyd psyop… it was filmed before covid19… How do I know… Not a single person is wearing a mask…” the post claims. It specifically asserts that Floyd and “the cops,” among others, were not wearing masks.", "But the claim is undercut by a review of footage that is publicly available.", "Take the viral video that shows former Police Officer Derek Chauvin kneeling on Floyd’s neck, for example. The video, captured by a bystander, shows that two EMTs who arrived at the scene, and who helped put Floyd into an ambulance, can be seen wearing surgical masks.", "Chauvin has been charged with third-degree murder, second-degree manslaughter and second-degree unintentional murder while committing a felony.", "Other footage captured by surveillance cameras at a nearby restaurant also shows that former Officer Thomas Lane — one of three officers charged with aiding and abetting unintentional second-degree murder, and aiding and abetting second-degree manslaughter — was also wearing a mask.", "Another officer who was present at the scene can also be seen wearing a face covering, the surveillance video shows. More footage captures a firefighter, who arrived after the ambulance left, also wearing a mask.", "So the assertion that “[n]ot a single person is wearing a mask” in the videos is false. The footage, in fact, undercuts the baseless theory that Floyd’s death was “filmed before covid19.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Four officers charged in George Floyd’s death.” Hennepin County Attorney. 3 Jun 2020.", "Hale Spencer, Saranac. “Bogus Claims of ‘Crisis Actors’ in Death of George Floyd.” FactCheck.org. 16 Jun 2020.", "Hill, Evan, et. al. “8 Minutes and 46 Seconds: How George Floyd Was Killed in Police Custody.” New York Times. 31 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]