["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A progressive advocacy group says eight Democrats in the New York State Senate accepted money from campaign donors who typically support Republicans.", "A video released by The Creative Resistance targets the Independent Democratic Conference, a faction of Democrats aligned with Republicans instead of the other 23 Democrats in the Senate.", "\"IDC members also get tons of campaign money from real estate, charter school, and health care lobbyists, some of whom are Republicans with connections to Trump,\" the narrator says.", "Outside groups often give to the majority party in each chamber. Republicans now hold a majority of 40 members, including IDC members and a Democrat who sits with the Republican conference.", "The video claims members of the IDC cashed in with donors who also contributed to GOP lawmakers. Is that true?", "Giving money in the Senate", "Special interest groups can give money to support candidates in two ways: to candidates directly or to a political party committee. In the State Senate, the Republicans, Democrats and IDC each has its own campaign account.", "The list of donors The Creative Resistance sent us to support its claim is long. Filings from the state Board of Elections show its claim is accurate -- the IDC did get money from real estate, charter school and health care lobbyists. But so did both Republicans and Democrats.", "Some health care examples:", "Charter schools", "Republicans in the State Legislature are more likely to support legislation that benefits charter schools. That’s reflected through donations they receive from charter school groups.", "Two of those groups, New Yorkers for Putting Students First and the Coalition for Public Charter Schools, have not given to mainline Senate Democrats since 2011.", "They gave about $167,000 to the IDC and its members and about $233,000 to Republicans.", "Eva Moskowitz, the founder of Success Academy Charter Schools, has favored the IDC over Democrats in the Senate.", "Her political action committee, Great Public Schools, has given about $66,000 to the IDC and its members since 2011. The PAC gave $114,000 to Senate Republicans, while six members of the mainline Democratic conference were given about $38,000 from the group.", "Real estate", "Some IDC donors from the real estate industry have ties to President Donald Trump, the video claims.", "The largest real estate donor on the group’s list is the Real Estate Board of New York, a statewide group that advocates for real estate developers.", "The Creative Resistance says the group is tied to Trump through his children. Both Eric and Ivanka Trump are members of  the board.", "The board has given slightly more than $1 million to the Senate Republican campaign account and members since 2011. The IDC has received about $480,000 while mainline Democrats were given about $207,000.", "The IDC's response", "The IDC responded to the group's claim with its own analysis of major donors from health care, charter school and real estate lobbyists.", "\"An honest review of campaign finance donations of all Democrats in New York illustrates that these same donors contribute to Democrats across the state, and the Senate's minority Democratic conference is no exception,\" IDC spokesperson Candice Giove said.", "Our ruling", "The Creative Resistance said in a video \"IDC members also get tons of campaign money from real estate, charter school, and health care lobbyists, some of whom are Republicans with connections to Trump.\"", "The IDC and its members do get money from donors in the lobbyists. But so do mainline Democrats, even if it’s less than their IDC colleagues. It's not true the IDC members benefit while Democrats do not.", "The statement is accurate but needs clarification and additional information. We rate it Mostly True.", "Video: \"Lulu Land\", Oct. 24, 2017, The Creative Resistance", "Email conversation with Eric Rockey, spokesperson for The Creative Resistance", "All contribution data obtained through the New York State Board of Elections website, Oct. 27 - 30, 2017", "\"Shaping the Westchester skyline\", The Real Deal, Jan. 1, 2017", "REBNY Member Directory, showing Ivanka and Eric Trump. Queried Oct. 31, 2017", "\"New Vision for Catskill Development, Without Cards\", New York Times, May 8, 2008", "\"The Donald to develop condo tower in White Plains, N.Y.\", National Real Estate Investor, 2004", "\"Just How High Should Progress Go?\", New York Times, 2006", "\"Donald Trump Taps Richard LeFrak, Steven Roth To Lead New Infrastructure Council\", Forbes, Jan. 17, 2017", "\"President Trump Gives Up On Infrastructure Council\", Fortune, Aug. 17, 2017", "JCOPE Filing for DelBello Donnellan Weingarten", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]