["The non-existent grant featured in this Facebook post on July 4, 2020, with a picture of Zambia’s trade minister, Christopher Yaluma.", "“ANNOUNCEMENT!!! ANNOUNCEMENT!! GOOD NEWS TO ALL ENTREPRENEURS; The Ministry has partnered with USAID, BACC and other International bodies in giving out GRANTS to all deserving citizens to boost your business during this time. I urge all to grab this chance,” the caption reads.", "Included is a link to a Google form designed to look like an online application for the Zambia Development Agency (ZDA). It asks applicants for personal details such as their physical location, occupation, and marital status.", "However, Zambia’s Ministry of Commerce, Trade and Industry (MCTIZ) published a press release on May 7, 2020 on their official Facebook account informing the public of a fraudulent Facebook page claiming to advertise grants.", "“There are fraudsters who have created a fake Facebook page named as MINISTRY OF COMMERCE, TRADE AND INDUSTRY-ZAMBIA advertising and claiming that the Ministry has partnered with USAID, BACC and other International bodies in giving out grants to deserving citizens to boost their business during this time,” the statement reads.", "“Kindly note that the Ministry is not disbursing any grants and is not running any empowerment programme on behalf of and in partner[ship] with the United States of American Agencies.”", "The fake page, with very few posts, was created in September 2019 and is managed out of Kenya, according to the Facebook page transparency details. The ministry’s official page, with more regular posts, was created on January 14, 2014, and is administered in Zambia.", "The ZDA echoed the ministry’s position in a post on May 26, 2020, warning people to “be wary of such offers from unscrupulous people by seeking confirmation with the Zambia Development Agency or other legitimate Government institutions before they can apply or make any payments”.", "People who had submitted applications through the bogus page subsequently shared screenshots of the emailed responses in the comments section beneath the ministry’s statement of denial. These comments show a further request by the scammers for a more thorough application to be filled in and returned, which some users claimed to have done.", "In response, officials commented on Facebook that they were looking to take further action.", "“Be assured that the Ministry is working with the fraud department and other authorities,” said a reply from the MCTIZ.", "An older post by the ZDA from November 19, 2019, shows that the grant scam posts are a recurring theme for the agency -- the warning then addressed a scam targeted at Small and Medium Enterprises (SMEs).", "Non-existent partnerships were also used as a ploy in a more recent Facebook post on July 16, 2020, claiming to be an initiative by Zambia’s Ministry of Finance.", "“The Ministry has partnered with the World Bank and International Monetary Fund (IMF) to roll out an economic development program in the country by issuing Financial Grants worth US$ 93.6 Million to all deserving entrepreneurs and farmers in the country with an aim of promoting local investment and entrepreneurship amid COVID-19 pandemic,” reads the purported offer, on a page created less than a month ago.", "However, a response to AFP Fact Check sent from the ministry’s real Facebook page by spokesman Chileshe Kandeta, confirmed, with thanks, that the post is “fake”.", "On June 25, 2020, Zambia’s President Edgar Chagwa Lungu said his government had put in place a 10-billion kwacha ($558 million) medium-term refinancing facility for businesses and households impacted by COVID-19.", "“I am happy that commercial banks are now accessing part of the 10-billion kwacha to be loaned to our entrepreneurs, especially, small and medium enterprises,” Lungu said.", "At the time he said 533 million kwacha of 1.8 billion kwacha worth of applications from the banking sector had been approved by the Bank of Zambia, with applications worth 753 million kwacha from the non-banking financial sector under consideration.", "He added that the Zambian government had decided “to issue the COVID-19 bond amounting to 8 billion kwacha as a stimulus package to enhance economic activity”.\n\n\tPart of the money raised from the bond would include the payment of retirees, suppliers of goods and services, and local contractors.", "“Further, the money realised from the bond will be utilised to support the small and medium enterprises that will not be able to access the 10-billion kwacha medium-term refinancing facility through commercial banks which is managed by the Bank of Zambia,” Lungu said.", "A Facebook search of keywords in the fake Zambia post led to a similarly-worded version of the false offer for grants relief on a page purporting to be run by Botswana’s Ministry of Finance and Economic Development.", "Page transparency information on Facebook also indicates the page is managed in Kenya. In this case, the post has been shared more than 640 times since May 4, 2020.", "The Botswana government warned against the scam on official social media platforms here, here and here.", "“We would like to advise that the said post is a scam and further caution members of the public not to follow the link provided as this might be the scammers’ way of swindling the public of their hard earned money,” reads the statement.", "While the Botswana government is giving businesses affected by the COVID-19 pandemic some assistance, it does not list the grant opportunities mentioned in the fake post. Some of the assistance includes loans, credit, and tax concessions.", "AFP Fact Check recently debunked a claim with the exact same wording aimed at Uganda’s entrepreneurs.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]