["About this rating", "U.S. Special Counsel Robert S. Mueller was appointed in May 2017 to lead an investigation into allegations that the Russian government had attempted to interfere with the United States' 2016 presidential election. On 18 April 2019, after nearly two years of investigation, the Department of Justice released a redacted version of the \"Report on the Investigation Into Russian Interference in the 2016 Presidential Election.\"", "As journalists combed through the 400-plus page report, excerpts started to appear online. One of the most popular passages reportedly came from page 290 of the report and documented President Donald Trump's reaction upon learning of Mueller's appointment:", "The text of the relevant section reads:", "Evidence", "The Appointment of Special Council and the President's Reaction", "On May 17, 2017, Acting Attorney General Rosenstein appointed Robert S. Mueller, III as Special Counsel and authorized him to conduct the Russia investigation and matters that arose from the investigation. The President learned of the Special Counsel's appointment from Sessions, who was with the President, Hunt, and McGahn conducting interviews for a new FBI Director. Sessions stepped out of the Oval Office to take a call from Rosenstein, who told him about the Special Counsel appointment, and Sessions then returned to inform the President of the news. According to notes written by Hunt, when Sessions told the President that a Special Counsel had been appointed, the President slumped back in his chair and said, \"Oh my God. This is terrible. This is the end of my Presidency. I'm fucked.\" The President became angry and lambasted the Attorney General for his decision to recuse from the investigation, stating, \"How could you let this happen, Jeff?\" The President said the position of Attorney General was his most important appointment and that Sessions had \"let [him] down,\" contrasting him to Eric Holder and Robert Kennedy. Sessions recalled that the President said to him, \"you were supposed to protect me,\" or words to that effect. The President returned to the consequences of the appointment and said, \"Everyone tells me if you get one of these independent counsels it ruins your presidency. It takes years and years and I won't be able to do anything. This is the worst thing that ever happened to me.\"", "While this section was highlighted by a number of credible journalists and news outlets, some readers were skeptical that it truly originated in the Mueller Report. After all, doctored documents have circulated in the past after the release of important or politically divisive documents.", "This passage, however, did appear in the report.", "The excerpt is frequently shared as if it comes from \"Page 290\" of the report. While this is technically accurate (this excerpt can literally be found on the 290th sheet of paper of the report), anyone attempting to find this excerpt in the official version of the report released on the Department of Justice's website would have better luck looking for page 78 of Volume II.", "You can access the redacted version of the Mueller Report on the Department of Justice website. Several news outlets have also created searchable versions of the document to make it easier to find specific passages, as well as annotated versions of the report for those who want more context on the findings.", "NPR.   \"Highlights From The Mueller Report, Annotated.\"\r\n    18 April 2019.", "Washington Post.   \"The Mueller Report, Annotated.\"\r\n    18 April 2019.", "CNN.   \"Read and Search the Full Mueller Report.\"\r\n    17 April 2019.", "Mueller, Robert.   \"Report on the Investigation Into Russian Interference in the 2016 Presidential Election.\"\r\n    U.S. Department of Justice.   March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]