["A meme dating to 2015, claiming that World War II Gen. George S. Patton expressed disdain for left-wing Democrats, surfaced on Facebook in the days after the November election. It’s already gotten a one-two fact-check punch from Snopes and PolitiFact.", "The short answer: There is no evidence that Patton — an innovator in the use of tanks in combat — ever said this. Snopes found the earliest use of the quote in “The Unknown Patton” by Charles Province, a 1983 book. Province did not use footnotes in his book and said the work was not a biography.", "In an email, Province wrote that the quote \"was directly from Gen. Patton's World War II diary,\" though he wrote in a follow-up email that he could not supply a date for it, writing that his \"materials were in storage.\"", "\"I wouldn't have put in the book if it weren't from one of those diaries,\" he wrote.", "A review of Patton's wartime diary, which he kept from late 1942 until shortly before his death in December 1945, did not show any evidence that Patton said this, nor did a review of Martin Blumenson's \"The Patton Papers,\" which contain excerpts from Patton's letters and diaries.", "PolitiFact traced the first use of the quote back to “The Proper Study of Mankind,” a 1948 book by Stuart Chase. A search of newspapers.com did not show the quotation or its attribution to Patton before 1988.", "The version of the meme currently circulating was posted on Facebook on Nov. 4, 2018, and just recently went viral. A message seeking comment was sent to the user who posted the meme.", "More:Fact check: List of 'deadliest days in American history' is partly false", "Patton expressed a broad disdain for politics but showed little understanding of and even less interest in the topic. It wasn't that Patton lacked exposure to politics. His father, George S. Patton Sr., was a conservative Democrat who won election to several local offices in California, including mayor of San Marino.", "But the father’s interest didn’t get passed down to the son. Patton said he had “no more gift for politics than a cow has for fox hunting,” wrote Robert H. Patton, his grandson, in “The Pattons: A Personal History of an American Family.”", "Robert Patton wrote that the general’s views were “a sort of reactionary royalism” that disdained labor unions and what Gen. Patton called “grafting politicians.” But he didn't develop these ideas much further.", "“He wanted only two things from government: ‘Consistent military preparation’ — and someday, please, a declaration of war,” Robert Patton wrote.", "Patton's wartime diary focuses almost wholly on the general's experiences with his colleagues; his experiences in the North African and European campaigns, and his boundless self-esteem.", "“The thing I must do is to retain my SELF-CONFIDENCE,\" Patton wrote on May 22, 1943. \"I have greater ability than these other people and it comes from, for lack of a better word, what we must call greatness of soul and based on a belief — an unshakable belief — in my destiny.”", "The general rarely discussed or interacted with politicians of either party during the war. His few mentions of them tended to be positive. He warmly recorded a note from President Franklin Roosevelt in May 1943, thanking him for his contributions to the North African campaign. In November 1944, he recorded a visit from Averell Harriman, then the U.S. ambassador to the Soviet Union, who passed on Joseph Stalin's compliments of Patton's fighting style.", "On March 13, 1945, Patton recorded a dinner with Harry Taylor, then a foreign correspondent for the Scripps-Howard newspapers.", "\"(Taylor) has very positive views on a large number of subjects, the chief of which seems to be dislike of the Democratic Party and all concerned with it,\" Patton wrote. \"Naturally I made no comments in that direction, as I am certainly not a politician and have no desire to become one.”", "More:Fact check: Viral photo shows protest in Paris, not Oregon", "After World War II, Patton was assigned to lead the military government of the German state of Bavaria, where his lack of political skills came to the surface, along with his anti-Semitism. Describing a visit to a refugee camp with Gen. Dwight Eisenhower on Sept. 17, 1945, Patton wrote in his diary that “Jewish DPs (displaced persons), or at least a majority of them, have no sense of human relationships.”", "“They decline, when practicable, to use latrines, preferring to relieve themselves on the floor,” he wrote.", "Five days later, while holding a press conference, Patton belittled denazification efforts in that area, saying he had “never seen the necessity of the denazification program.” When reporters noted complaints that “reactionary Nationalists and Nazis still dominated the life of Bavaria,” Patton said “Reactionaries! Do you want a lot of communists? I don’t know anything about parties. I’m here to see that they do what they’re told.”", "“This Nazi thing is just like a Democratic and Republican election fight,” he said. “The thing was that these damned Nazis got other people by the scruff of the neck and other Germans just didn’t have the guts to go back.”", "Patton’s comments cost him the leadership of the Third Army. The general lashed out at the reporters in his diary, writing of “a very apparent Semitic influence in the press.”", "“They are trying to do two things,” he wrote. “First, implement communism, and second, see that all businessmen of German ancestry and non-Jewish antecedents are thrown out of their jobs. They have utterly lost the Anglo-Saxon conception of justice and feel that a man can be kicked out because somebody else says he is a Nazi.”", "We rate this claim FALSE. There is no evidence that Patton ever said this. While Patton expressed contempt for politicians, he showed little interest in or knowledge of party politics during his lifetime. His comparison of the Nazi Party — an organization dedicated to the industrialized murder of racial and ethnic minorities — to the Democratic and Republican parties reflected this.", "Contact Montgomery Advertiser reporter Brian Lyman at 334-240-0185 or blyman@gannett.com.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]