["The photo was published here on Facebook in a public group called “Alliance In Support of Our Police Force Official FB Fans Page”.", "The post has been shared more than 600 times.", "It was published on October 3, 2019, two days after Hong Kong pro-democracy protesters staged a large demonstration against China’s National Day. Here is an AFP news report about the events.", "In the photo, several people can be standing next to a black people carrier with license plate CX7. A second black vehicle with registration plate CX78 can also be seen in front of the car.", "Below is a screenshot of the misleading Facebook post:", "The post’s caption, written in both English and traditional Chinese characters, translates to English as: “From Silk Road 21. Hong Kong riots: Action command centre", "“During Hong Kong’s riots on the National Day, an ‘ex-soldier’ took this photo. The attached caption:", "“‘This is the command car that commanded the protesters downstairs from my apartment yesterday. As the clearance proceeded, the Caucasians returned to the car to change their clothes and refresh.", "“Pay attention to the six abdominal muscles, age and the overall body condition. Also note that the number of the car they use, CX7, is very similar to that of the car CX78 in front of them. There are one or two other cars the one in the front as support vehicles.", "“To me this looks like an operational support team -- external 'advisers'.”", "Another Facebook post published earlier on the same date in Facebook group 21SilkRd can be seen here with a similar caption in English. It has been shared more than 150 times.", "The photo was also published here, here and here on Facebook; here and here on Weibo; and here and here on Twitter with a similar claim. It was published in other Facebook posts here and here with a claim that the cars might be owned by Hong Kong airline Cathay Pacific.", "The claims are false. American broadcaster ABC News published this news article on October 3, 2019, clarifying that the photo in fact shows its news crew working at the protest in Hong Kong.", "The report’s headline states: “ABC News Hong Kong crew misidentified in viral social media photo”.", "The report states in part: “A photograph circulating on social media misidentifies Senior Foreign Correspondent Ian Pannell and an ABC News crew as ‘external advisers’ and ‘an operational support team’ for protesters in Hong Kong.", "“The picture was taken on Tuesday apparently from an apartment building at the intersection of Star Street and Monmouth Path in the Wan Chai district of Hong Kong, next to the Three Pacific Place office building. The photo also misidentifies a vehicle used by the ABC News team as a ‘command car directing the protesters.’", "“The ABC News team was in Hong Kong on Tuesday covering the unauthorized protest march in the Admiralty District, including the clearance operation outside the Hong Kong Government headquarters. The ABC News team had previously positioned its vehicles on Monmouth Path.”", "The report also contained a screenshot comparison of the photo in the misleading post with photos of Pannell in Hong Kong.", "Below is a screenshot of the photo:", "Below is a screenshot comparison of the misleading image (L) and Pannell’s photo in the ABC News article (R):", "A video included in the ABC News article shows Pannell broadcasting live in Hong Kong from the one-minute 56-second mark. The video is embedded below:", "Pannell separately tweeted this video and this photo of events in Hong Kong from his official Twitter account on October 1, 2019.", "The photo in the misleading posts corresponds with Google Street View imagery here from Monmouth Path in Wan Chai district. The location can be seen on Google Street View below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]