["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rendering from California High-Speed Rail Authority", "LISTEN TO THIS STORY:", "Plans for California’s high-speed rail network hinge on the private sector paying for much of the $68 billion project.", "Voters agreed to kick-start the rail plan with public money in 2008 by passing a nearly $10 billion state bond. The project has also received a limited supply of federal dollars.", "Increasingly, however, the California High-Speed Rail Authority has looked to the private sector for help. This summer, the authority asked businesses to offer financial advice and ideas on how to make the venture more efficient. It allowed the authority to gauge private investment interest.", "More than 30 companies responded. None pledged any funds, though the rail authority’s solicitation said it was asking only for advice, not money.", "Soon after, Assemblyman Jim Patterson, R-Fresno, told the LA Times in a November news article: The rail authority has \"failed to disclose huge cost overruns and after they boasted private firms were interested in funding this project, we now know these firms are unwilling to put up any private money.\"", "We decided to focus on his claim that the private sector is \"unwilling to put up any private money.\"", "He’s made similar statements elsewhere, including to a TV news station in Fresno.", "KSEE TV Fresno interview with Assemblyman Jim Patterson, Nov. 1, 2015", "Was Patterson right? Did the responses amount to corporations writing off the bullet train as a bad investment?", "We decided to check the facts.", "Our research", "First stop: A look at the role the private sector was expected to play when Californians voted for the high-speed rail network in 2008.", "Dan Richard, chairman of the rail authority, told us this month that the authority originally envisioned private funds paying about one-third of the project’s cost. It’s expected companies would invest their own capital to build, operate and maintain large portions of it -- once an initial government-funded Merced-to-Burbank segment opened in 2022 and showed strong ridership and revenue.", "Language in the ballot measure approved by voters requires the authority to seek private funds to cover the project’s cost, though it does not specify what percentage.", "Richard said the state still plans on private funds covering about one-third of the cost. Connecting the network from San Francisco to Los Angeles depends on it, he added.", "Richard also recently said opening the initial operating segment in 2022 could be delayed. The project broke ground in January in Fresno.", "\"There’s really no question about interest from the private sector,\" Richard added. \"The only question is when that money comes in.\"", "Challenges ahead", "The rail project continues to face numerous legal and financial challenges and has lost voter support in recent years. Cost projections have seesawed from $33 billion to nearly $100 billion, and most recently to $68 billion.", "Patterson’s statement about a lack of private funds raises a key concern. Responses from many private firms mirrored those by Madrid-based Acciona. It said it was \"concerned about the financial market capacity to raise the required capital\" unless the project’s contracts are broken into smaller pieces.", "Many also said they need a revenue guarantee from the state to reduce their investment risk. That’s prohibited by the law voters passed in 2008, though Richard has said such guarantees won’t be necessary once the project can demonstrate strong ridership.", "The proposed rail network would be one of California’s largest ever public works project, and the first high-speed rail system in the United States.", "Early stages", "Still, rail authority leaders, members of the private sector and the head of the project’s oversight panel all said it’s much too early to conclude the private sector has given up on high-speed rail.", "\"We’re only at that very first stage where the authority has asked for expressions of interest, not (funding) proposals,\" said Stephen Polechronis, a senior vice president at AECOM, one of the private firms that responded to the rail authority’s request for advice.", "Michael Cahill of Siemens Industry, another firm that responded, told the Sacramento Bee recently: \"We didn’t propose anything concrete in terms of private money going in, because there wasn’t an opportunity to do that. Which doesn’t mean we wouldn’t be interested. Quite the opposite.\" The company confirmed those comments, but declined our request to elaborate.", "No one is saying the private sector will soon jump onboard with gobs of cash. They are waiting and watching to see if the rail authority can successfully start the project and eliminate financial risks, said Louis Thompson, chairman of the California High Speed Rail Peer Review Group, an independent oversight group that issues reports to the Legislature on the project.", "\"What the private sector has said,\" added Thompson, a retired federal rail administrator, \"is that it is not willing to take many of the risks that the project would entail as of now.\"", "Thompson said the claim by Patterson, the Fresno lawmaker, about the private sector being unwilling to fund the project \"isn’t strictly correct.\"", "A spokeswoman for Patterson said the lawmaker stands behind the statement. She pointed to recent news articles that outline private sector concerns with the project.", "Our ruling", "Assemblyman Jim Patterson said this month: \"We now know these firms are unwilling to put up any private money.\" He was referring to the more than 30 companies that submitted financial advice to the rail authority, without offering any funding.", "Many of those companies identified financial concerns, including the need to reduce the size of the project’s contracts and guarantee revenue. But Patterson does not mention that the rail authority’s request was for advice, not money. And we simply don’t \"know\" how willing those companies will be once a formal funding request is made.", "Some of the firms that responded, along with rail authority leaders and the head of the project’s independent oversight panel, all said it’s too early to conclude the private sector has given up on the project. Patterson’s statement implies they already have.", "We rate the claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "California High-Speed Rail Authority website, Requests for Expressions of Interest In Initial Operating Segment", "Fox & Hounds Daily website, blog post by Dan Richard \"Yes, the Private Sector Will Invest in California High-Speed Rail,\" July 28, 2014", "KSEE TV Fresno, interview with Assemblyman Jim Patterson, Nov. 1, 2015", "Proposition 1A Safe Reliable High-Speed Passenger Train Bond Act, 2008", "Los Angeles Times, \"At lawmakers' urging, agency reveals report on growing bullet train,\" Nov. 3, 2015", "Sacramento Bee, \"Siemens aims to make Sacramento a hub for bullet train,\" Oct. 18, 2015", "Bloomberg Business, \"Banks May Balk at Financing $68 Billion California Bullet Train,\" Oct. 19, 2015", "Capital Public Radio, \"State Insists High-Speed Rail Remains On Track,\" Nov. 5, 2015", "Email interview, Alisha Gallon, spokeswoman for Assemblyman Jim Patterson, Nov. 6, 2015", "Email interview, Brie Sachse, spokesperson for Siemens Industry, Nov. 6, 2015", "Phone interview, Stephen Polechronis, Senior Vice President AECOM, Nov. 9, 2015", "Phone interview, Dan Richard, Chairman of the California High-Speed Rail Authority Board of Directors, Nov. 9, 2015", "Phone interview, Michael Genest, former director of California Department of Finance, Nov. 10, 2015", "Phone interview, Lou Thompson, Chairman of the California High-Speed Rail Peer Review Group, Nov. 10, 2015", "Email interview, John Chalker, former Vice Chairman of the California High-Speed Rail Peer Review Group, Nov. 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]