["About this rating", "President Donald Trump has fought a symbolic battle during his tenure in the White House against National Football League players and staff who have protested racial injustice by kneeling or refusing to stand on the field during the playing of the U.S. national anthem.", "Trump has consistently emphasized the importance of paying respect to the anthem and the American flag, a track record which provoked allegations of hypocrisy in August 2018 after the president traveled to Ohio.", "On 24 August 2018, President Trump and First Lady Melania Trump accompanied Alex Azar, Secretary of Health and Human Services, on a visit to a children's hospital in Ohio as part of a trip addressing the opioid crisis in the United States.", "The White House described the purpose of the presidential visit to Nationwide Children's Hospital in Columbus as follows:", "From 2000 to 2012, America saw a i>five-fold increase in the share of babies born with Neonatal Abstinence Syndrome (NAS) -- equivalent to one baby suffering from opiate withdrawal born every 25 minutes, according to the National Institute on Drug Abuse.", "Last year, 198 babies were admitted to the neonatal intensive care unit at Nationwide Children’s Hospital in Columbus, Ohio, for NAS. Today, President Trump and First Lady Melania Trump will tour that facility, discussing the Administration’ three-part plan to halt the opioid crisis.", "As part of the visit, the Trumps and Secretary Azar spent time with children in a classroom at the hospital, talking and participating in joint arts and crafts activities, including coloring in U.S. flag templates.", "This innocuous moment sparked a wave of controversy and bafflement after photographs appeared to indicate that President Donald Trump had incorrectly colored in parts of the U.S. flag. In a photograph posted to Twitter by Azar, the president was shown with a blue marker on the table before him, along with a flag template in which the fourth stripe had been colored in blue. (The national flag of the United States bears only red and white stripes; the color blue appears solely in the flag's canton.)", "We've magnified the photograph posted to Twitter by Azar in order to more clearly show the apparent error:", "This image prompted several news articles either speculating or asserting that President Trump had incorrectly colored in parts of the American flag. Newsweek, for example, ran with the headline \"Donald Trump Colored the American Flag in Wrong,\" adding that \"A photo posted to Twitter Friday by one of his Cabinet secretaries shows President Donald Trump coloring the U.S. flag incorrectly.\"", "That description was not technically accurate. The photograph posted by Azar showed President Trump sitting before a flag template with a blue marker in front of him and one of the flag's stripes colored blue. The picture did not actually capture the president coloring the stripe blue.", "The same is true of a short video which the White House published on 27 August. Around the 30-second mark, President Trump can be seen, with a red marker in hand, coloring in a stripe red, with another stripe already colored blue:", "﻿", "However, another image appears to show President Trump actually using a blue marker to color the fourth stripe blue:", "We have been unable to so far identify the original source of this image or corroborate its authenticity. But even if it is authentic and does show President Trump coloring one of the flag stripes blue, the context behind it is unknown. It is possible that the president was indulging or amusing one of the children around him by using a blue marker to color one of the stripes, rather than making an inadvertent error or acting out of ignorance about the flag's design.", "We sent the White House several questions about this episode but did not receive a response in time for publication.", "White House.   \"1600 Daily -- 24 August 2018.\"\r\n    24 August 2018.", "DeMaria, Meghan.   \"This Photo of President Trump Coloring an American Flag Has People Asking If He Knows What the Flag Looks Like.\"\r\n    Huffington Post/Yahoo! News.   27 August 2018.", "Stubley, Peter.   \"Donald Trump Colors in US Flag, Gets It Wrong.\"\r\n    The Independent.   26 August 2018.", "Politi, Daniel.   \"Did Trump Color and American Flag Wrong During a Photo-Op with Ohio Kids?\"\r\n    Slate.   25 August 2018.", "Fearnow, Benjamin.   \"Donald Trump Colored the American Flag in Wrong.\"\r\n    Newsweek.   26 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]