["A video of a man in a red jacket beating up another person in green clothing is widely circulating on social media to espouse the claim that students associated with Left parties attacked members of RSS-affiliated Akhil Bharatiya Vidyarthi Parishad (ABVP). This triggered the violence in JNU on the intervening night of January 5-6, per the narrative. Journalist Sumit Kumar Singh the first to tweet the video. He wrote, “This triggered clashes in #JNU campus. Students associated with Left parties bashed up #ABVP members when they were facilitating admission process. Students from #Left parties wanted to cancel admission process in #JNU.“", "This triggered clashes in #JNU campus. Students associated with Left parties bashed up #ABVP members when they were facilitating admission process. Students from #Left parties wanted to cancel admission process in #JNU pic.twitter.com/H5dyMRYyig", "— Sumit Kumar Singh (@invincibleidea) January 6, 2020", "Prasar Bharati tweeted the video with a similar allegation. The public broadcaster wrote that the video bears witness to JNU VC Mamidala Jagadesh Kumar’s statement that “those opposing registration for Winter session of #JNU are behind violence to scuttle the academic process of varsity.”", "Video bears witness to #JNU VC @mamidala90‘s statement that those opposing registration for Winter session of #JNU are behind violence to scuttle the academic process of varsity. pic.twitter.com/JWr4n81GbW", "— Prasar Bharati News Services (@PBNS_India) January 6, 2020", "This was retweeted by the VC himself.", "It is noteworthy that the violence was triggered at the backdrop of protests against hostel fee hike that has been going on for around three months. The JNU Students’ Union decided to boycott the process of registration for the winter semester which began on January 1.", "IT head and convenor BJP Himachal Chetan Bragta also shared the video with the identical claim as Singh. He wrote in Hindi, “इस वजह से JNU कैंपस में झड़पें शुरू हो गईं। वामदलों से जुड़े छात्रों ने ABVP के सदस्यों को पीटा जब वे प्रवेश प्रक्रिया में छात्रों की मदद कर रहे थे। लेफ़्ट पार्टियों के छात्र JNU में प्रवेश प्रक्रिया को रद्द करना चाहते थे। #LeftAttacksJNU”", "Other BJP office-bearers – national IT cell head Amit Malviya and BJP spokesperson Suresh Nakhua – promoted the claim through retweets.", "ABP’s Vikas Bhadauri shared the clip, tweeting, “Leftists first spread anarchy in Bihar, Chhatisgarh and Jharkhand, then massacred, massacred plenty in West Bengal and in 2010, citizens paid their last respects. JNU is their last stronghold. Right now, they have spread anarchy, tomorrow they will try massacres. If you don’t wake up now, it’ll be too late.”", "सावधान- वामपंथियों ने बिहार, छत्तीसगढ़, झारखंड में पहले अराजकता फैलाई, फिर कत्लेआम किया, पश्चिम बंगाल में खूब कत्लेआम किया, साल 2010 में जनता ने अंतिम संस्कार कर दिया #JNU आखिरी गढ़ बचा है अभी अराजकता फैलाई है कल कत्लेआम की कोशिश होगी। अभी नहीं जागे तो देर हो जाएगी।#JNUattack pic.twitter.com/ZJRpgpbQfg", "— Vikas Bhadauria (ABP News) (@vikasbhaABP) January 6, 2020", "The man in the red jacket is ABVP member Sharvender, a third-year PhD student at Centre for West Asian Studies, School of International Studies (SIS), JNU. His identity was confirmed to Alt News by four JNU students, two of whom are from SIS.", "Below, a photo of Sharvender wearing an ABVP name-card (right) has been juxtaposed with a screenshot of him from the video (left).", "The photo is a part of a larger image where Sharvender can be seen with ABVP cadre.", "In the photograph below, Sharvender (who has now deleted/deactivated his Twitter account), can be seen alongside JNU VC Mamidala Jagadesh Kumar and SIS dean Ashwini Mohapatra.", "He can in fact be spotted in several images with JNU professors. Here, Sharvendra is congratulating Mohapatra with a group of students for taking charge as the dean of SIS.", "Alt News tried contacting Sharvender over calls and an email however we are yet to receive a response.", "A video of the assault was also posted by the Delhi University faction of All India Students’ Association, (AISA) affiliated with CPI (ML). The clip is described as, “ABVP’s hooliganism on common students in School of International Studies and School of Languages, JNU. SIS student Vivek Pandey (former DU student) along with others were brutally beaten up by ABVP goons infront of SIS and SL lawns. Dear ABVP, despite all your efforts we will not give up a single inch. We remind you again “NO REGISTRATION WITHOUT AFFORDABLE EDUCATION.”", "Vivek Pandey (former DU student) along with others were brutally beaten up by ABVP goons.", "Part 1", "ABVP’s hooliganism on common students in School of International Studies and School of Languages, JNU.", "SIS student Vivek Pandey (former DU student) along with others were brutally beaten up by ABVP goons infront of SIS and SL lawns. Dear ABVP, despite all your efforts we will not give up a single inch. We remind you again “NO REGISTRATION WITHOUT AFFORDABLE EDUCATION”", "#FeesmustFall #BoycottRegistration #CompleteRollback", "Posted by AISA Delhi University on Saturday, 4 January 2020", "The person assaulted by Sharvender was identified as Vivek Pandey. Alt News confirmed with multiple students who informed that Vivek Pandey is a first-year MA student. We also contacted Vivek who sent us a video statement debunking the false claim that he is an ABVP member. “The student who is wearing red sweater is Sharvender. He is a West Asia student…In the video, you can clearly see that I’m wearing a green shirt…but they are circulating the video with the opposite narrative.” Vivek also clarified that he is associated with AISA.", "The juxtaposition below evidently shows that Vivek is the person in green who was assaulted.", "Another student who was assaulted during the scuffle was Abhishek Pandey, a former JNU student visiting the campus at the time the violence broke out. He can be seen at about 45 seconds into the video. Abhishek had fallen to the ground and several students can be seen picking him up. Sharvender joined the scuffle later however it is unclear if he was a part of the group that attacked Abhishek.", "Speaking with Alt News, Abhishek claimed that he was visiting JNU campus to meet friends when violence broke out. “They chased after a junior from the Chinese centre. The student fell down and we went to save him. But some professors of JNUTF including the dean targetted me as an ‘outsider’. I was only trying to save the student. But I was hit and one of my friends tried to pull me out,” he narrated.", "Abhishek has been highlighted in the image below. His identity was confirmed to us by multiple JNU students.", "A video of an ABVP member assaulting a student associated with AISA has been spun to portray as if Left parties attacked the RSS student wing. Another person beaten-up, Abhishek Pandey, was also not associated with ABVP. The video of the assault, first shared by journalist Sumit Kumar Singh with the false claim, was amplified by numerous other journalists, among them – Abhijit Majumdar, Swati Goel Sharma, Aditya Raj Kaul and filmmaker Ashoke Pandit.", "Rishi Bagree, who has been found circulating misinformation multiple times, tweeted the video and wrote, “The series of event in JNU yesterday leading to #JNUViolence1. Leftist students have been trying to stop the registration process in JNU2. They were rattled by the fact that students were registering online.”", "The series of event in JNU yesterday leading to #JNUViolence", "1. Leftist students have been trying to stop the registration process in JNU", "2. They were rattled by the fact that students were registering online. pic.twitter.com/E7cmVUEREO", "— Rishi Bagree ऋषि :flag-in: (@rishibagree) January 6, 2020", "It was also shared with the false claim by Chayan Chatterjee, great-grandson of Ashutosh Mukherjee.", "#LeftAttacksJNU This started it Left Goons attacking ABVP students when they went for registration yesterday was the last day of registration for winter semester pic.twitter.com/HnirFYS907", "— Chayan Chatterjee (@Satyanewshi) January 6, 2020", "The Twitter account Friends of RSS also tweeted the video.", "[UPDATE: The reference to JNUTA has been changed to JNUTF in the article. Vikas Bhadauria and JNU VC Mamidala Jagadesh Kumar’s tweet and retweet respectively have been added.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]