["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump recently sent Congress a list of his immigration priorities as legislators consider a plan to allow Dreamers to stay in the United States.", "Dreamers are young people who grew up in the United States after being brought here illegally as children or infants. Trump has said he was willing to negotiate with Democrats in order to allow them to stay.", "In exchange, Trump is seeking changes to immigration law that would affect other minors who come to the United States illegally.", "\"Loopholes in current law prevent ‘Unaccompanied Alien Children’ (UACs) that arrive in the country illegally from being removed,\" said Trump’s outline. \"Rather than being deported, they are instead sheltered by the Department of Health and Human Services at taxpayer expense, and subsequently released to the custody of a parent or family member -- who often lack lawful status in the United States themselves.\"", "The children Trump is talking about tend to be from Central America, as opposed to Mexico. Waves of unaccompanied minors from Guatemala, Honduras and El Salvador came to the United States in recent years fleeing gang violence and poverty.", "Trump wants to make it harder for these children to claim asylum (a type of relief sought by unaccompanied minors) and to be able to remove them all expeditiously.", "Typically, a loophole refers to an unintended consequence, ambiguity or omission from a law that allows something to be evaded. The Trump administration, however, deems the procedures laid out in law for treating unaccompanied minors as \"loopholes\" that need to be changed.", "But the law explicitly requires that a federal agency place children from non-border countries \"in the least restrictive setting\" (in many cases with family members) and to help them access legal counsel for their removal proceedings.", "Even with these procedures, however, thousands of children are still ordered removed. Trump’s claim gives a misleading impression.", "An Unaccompanied Alien Child is the legal term for a child who does not have a lawful immigration status in the United States; is under 18 years old; and has no parent or legal guardian in the United States, or for whom no parent or legal guardian in the United States is available to provide care and physical custody, according to U.S. Citizenship and Immigration Services.", "The number of apprehensions of unaccompanied minors peaked in 2014 at 68,541, up from 38,759 in fiscal year 2013. Their apprehensions have fluctuated since 2014. Border Patrol agents tallied about 38,500 apprehensions of unaccompanied minors from October 2016 to August 2017.", "There have been concerns for years that unaccompanied minors were not being adequately screened to determine if they should be sent back to their countries. So Congress passed the William Wilberforce Trafficking Victims Protection Reauthorization Act of 2008, formalizing how they should be treated, and President George W. Bush signed it into law.", "\"Special rules\" in the law allow unaccompanied minors from contiguous countries (Mexico and Canada) to be quickly returned to their countries.", "But unaccompanied minors from other countries are not immediately sent back by immigration officers; they are placed in formal removal proceedings.", "The law requires that they be transferred within 72 hours to HHS, which places them \"in the least restrictive setting that is in the best interest of the child.\" In many cases, children await their immigration court hearing while living with family members in the United States, including relatives who are in the country illegally.", "The law directs HHS to ensure \"to the greatest extent practicable\" that unaccompanied minors have access to legal counsel, including pro-bono services.", "The procedures for unaccompanied children cases are not loopholes, but rather basic requirements of the law, said Mark Greenberg, a senior fellow at the nonpartisan Migration Policy Institute and a former acting assistant secretary for the Administration for Children and Families within HHS during the Obama administration.", "The most common immigration relief granted to unaccompanied minors includes asylum, special immigrant juvenile status, and \"T nonimmigrant status\" for victims of trafficking, said a January 2017 Congressional Research Service report.", "Data shows that children with an attorney are more likely to be allowed to stay in the country than children who lack representation.", "The Transactional Records Access Clearinghouse (TRAC) at Syracuse University examined outcomes for unaccompanied minors cases filed and decided from fiscal years 2012 to 2014.", "Outcomes for unaccompanied minors with an attorney (8,761 cases): In 73 percent of cases an immigration court allowed the child to stay in the United States, in 12 percent of cases a child was ordered removed, in 15 percent of cases a judge entered a \"voluntary departure\" order (child still has to leave the country, but the voluntary departure carries less severe consequences than a removal order).", "Outcomes for unaccompanied minors without an attorney (12,817 cases): In 15 percent of cases the child was allowed to stay in the country, in 80 percent of cases a child was given a removal order, and in 5 percent of cases, a voluntary departure order.", "Trump said, \"Loopholes in current law prevent ‘Unaccompanied Alien Children’ (UACs) that arrive in the country illegally from being removed.\"", "The Trump administration argues there is a loophole for unaccompanied minors primarily from Central America. They are referred to HHS and in many cases placed with family members while they await their immigration court hearing. The law directs HHS to try to connect unaccompanied minors with legal counsel, and having an attorney can help them win their case and allow them to stay in the United States.", "But this process is not a loophole; it’s outlined in the law. The law also does not prevent their deportation: at least 2,707 unaccompanied minors were removed in fiscal year 2017.", "The statement has an element of truth but leaves out critical context that would give a different impression. We rate it Mostly False.", "Politico, President Donald Trump’s immigration policies and principles, released Oct. 8, 2017", "Congress.gov, William Wilberforce Trafficking Victims Protection Reauthorization Act of 2008", "U.S. Customs and Border Protection, United States Border Patrol Southwest Family Unit Subject and Unaccompanied Alien Children Apprehensions Fiscal Year 2016, published Oct. 18, 2016", "U.S. Customs and Border Protection, Southwest Border Migration, last updated Sept. 11, 2017\nTransactional Records Access Clearinghouse (TRAC) at Syracuse University, Representation for Unaccompanied Children in Immigration Court, Nov. 25, 2014", "Phone interview, Mark Greenberg, senior fellow at Migration Policy Institute, Oct. 9, 2017", "Congressional Research Service, Unaccompanied Alien Children: An Overview, Jan. 18, 2017", "Bipartisan Policy Center, Unaccompanied Alien Children: A Primer, July 21, 2014", "Migration Policy Institute, Unaccompanied Child Migration to the United States: The Tension between Protection and Prevention, April 2015", "U.S. Citizenship and Immigration Services, Questions related to: \"Unaccompanied Alien Child\", § 235.4 Withdrawal of application for admission", "Email interview, U.S. Customs and Immigration Enforcement, Oct. 9, 2017", "McClatchy DC, Trump wants to clamp down on asylum, Oct. 8, 2017", "CNN, Trump admin quietly made asylum more difficult in the US, March 8, 2017", "Harvard Law School, Harvard Immigration and Refugee Clinical Program, The Impact of President Trump’s Executive Orders on Asylum Seekers", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]