["About this rating", "White House Press Secretary Sarah Huckabee Sanders has been the subject of intense scrutiny and criticism as one of President Donald Trump's chief spokespersons since his inauguration in January 2017.", "Her consistent defense of sometimes vacillating and even contradictory statements by Trump, as well as her occasionally combative style have made her the subject of ridicule by late night talk show hosts and in Saturday Night Live sketches. In April 2018, comedian Michelle Wolf targeted Huckabee Sanders in a controversial monologue at the White House Correspondents Association dinner.", "It might come as a surprise, then, to learn that many members of the American public admire her more than nearly any other woman in the world. In May 2018, the \"Trump 2020\" Facebook page — which is not affiliated with the president's official re-election campaign — made just such a claim, posting a meme which read:", "Congrats to Sarah Huckabee Sanders. Sarah was just named as one of the ten most admired women in America.", "This is true. In April 2018, the UK-based polling firm YouGov published the results of its \"World's Most Admired\" survey. Respondents in the United States ranked Huckabee Sanders the ninth most admired woman in the world. (You can view the United States' rankings by choosing \"USA\" from the drop-down list of countries.)", "Huckabee Sanders was ranked behind Nobel Peace Prize-winner Malala Yousafzai, Supreme Court Justice Ruth Bader Ginsburg, Queen Elizabeth II and Oprah Winfrey. The woman Americans admire most, according to the survey, is Michelle Obama. Former Democratic presidential candidate Hillary Clinton was ranked fourth.", "By some distance, the man most admired by American survey respondents is former president Barack Obama. His successor, Donald Trump, was ranked second, ahead of Pope Francis, Dwayne \"The Rock\" Johnson, Clint Eastwood and Vermont Senator Bernie Sanders — all of whom appeared in the top ten.", "In an article accompanying the rankings, YouGov explained how the \"Most Admired\" list was finalized:", "In December, YouGov gathered open-ended nominations from panellists across 35 countries, asking them simply: “Thinking about people alive in the world today, which [man or woman] do you most admire?” These nominations were then used to compile a list of the 20 men and 20 women who received the most nominations and were nominated in at least four countries. An additional 10 popular local figures were added to the lists for individual countries.", "Over the beginning of the year we then used the lists to poll each of the 35 countries asking two questions: “who do you truly admire?”, where respondents could make multiple selections, and “who do you MOST admire?”, where they could only pick one. These two numbers were combined into a percentage share of admiration...", "Huckabee Sanders received a percentage share of 3.6 percent — the same share of the vote received by First Lady Melania Trump, who was listed as the tenth most admired woman in the world among American survey respondents, but who effectively tied for ninth place with the White House Press Secretary.", "MacGuill, Dan.  \"Did Sarah Huckabee Sanders Say She Was 'Proud' to Be Compared to Aunt Lydia From the 'Handmaid's Tale'?\"\r\n  Snopes.com.  30 April 2018.", "Smith, Matthew.  \"World's Most Admired 2018.\"\r\n  YouGov.  11 April 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]