["Spike Cohen, the Libertarian Party's nominee for vice president in 2020, alleged in a viral post that the Biden administration has deemed Libertarians to be terrorists.", "“A silver lining to the Biden administration labeling Libertarians terrorists is that the CIA will probably start giving us money and weapons now,” Cohen wrote on Jan. 22.", "The Facebook post garnered 13,000 reactions and 5,000 shares.", "There is no evidence that President Joe Biden labeled Libertarians as terrorists.", "Cohen said in an interview that his post was intended to be satire.", "“It was intended as a joke, and it was overwhelmingly received as one,” he said.", "More:Fact check: Viral letter to Joe Biden is misattributed to rocker Ted Nugent", "The Libertarian Party offers this description on its website: \"Libertarians strongly oppose any government interference into their personal, family, and business decisions. Essentially, we believe all Americans should be free to live their lives and pursue their interests as they see fit as long as they do no harm to another.\"", "In a comment on his post, Cohen linked to a clip of former CIA Director John Brennan discussing the recent U.S. Capitol siege on MSNBC. He does not call Libertarians terrorists during the interview.", "\"I know looking forward that the members of the Biden team, who have been nominated or have been appointed, are now moving in laser-like fashion to try to uncover as much as they can about what looks very similar to insurgency movements that we’ve seen overseas. Where they germinate in different parts of the country, and they gain strength, and it brings together an unholy alliance, frequently, of religious extremists, authoritarians, fascists, bigots, racists, nativists, even libertarians,” Brennan said.", "Brennan, who was CIA director under former President Barack Obama, does not serve in the Biden administration.", "After the Jan. 6 siege on the U.S. Capitol, Biden called the insurrectionists “domestic terrorists,” but he did not specifically name Libertarians.", "“They weren’t protesters. Don’t dare call them protesters. They were a riotous mob. Insurrectionists. Domestic terrorists,” Biden said in remarks delivered on Jan. 7.", "PolitiFact has previously debunked the claim.", "More:Fact check: Josh Hawley 'Spineless Traitor' book cover is satire", "The claim that the Biden administration labeled Libertarians as terrorists is SATIRE, based on our research. Spike Cohen, the Libertarian Party's nominee for vice president in 2020, said in an interview that he intended for the post to be a joke.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]