["“I’m the only one here I think that’s ever started a business, is that fair?” Bloomberg says in the video posted on his Twitter and Instagram accounts, which has also been shared on Facebook here and here.", "It then shows about 20 seconds of footage of the other candidates saying nothing as the sound of chirping crickets plays, presenting it as their reaction to his comment.", "“Okay,” Bloomberg says as the clip ends.", "But there was actually only a gap of about one second between Bloomberg’s remark and him saying “okay,” after which he continued to speak.", "That portion of the February 19, 2020 debate in Las Vegas can be viewed starting at the 1:13:30 minute mark in this video.", "Bloomberg -- who has spent hundreds of millions of dollars of his own fortune on political advertising -- made the first debate appearance of his presidential run in Las Vegas.", "He was heavily criticized by fellow Democratic candidates about his suitability for office given his record as New York mayor, for remarks he allegedly made about women, and other issues.", "The debate clip is not the first misleading video associated with Bloomberg’s candidacy: one of his campaign ads attacking President Donald Trump used footage that dated to his predecessor Barack Obama’s time in office.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]