["About this rating", "An article of faith among U.S. conservatives of the Cold War era stated that the Soviets aimed to destroy America from within by promoting a program of \"creeping socialism,\" by which they meant the gradual replacement of democratic, free-market institutions with centralized government control.", "Never mind that the communists themselves subscribed to a different version of the end of free-market economies, namely Marx's theory that capitalism contained the seeds of its own destruction, an end which he argued was inevitable and would culminate in a socialist revolution.", "Regardless, conservative icons such as Ronald Reagan and Barry Goldwater saw creeping socialism in every piece of progressive legislation that came around the pike, from Roosevelt's New Deal to Medicare to LBJ's Great Society social-welfare programs of the mid-1960s.", "They further claimed that at least one Soviet leader, Nikita Khrushchev, had explicitly announced the regime's intent to export \"small doses\" of socialism to the U.S. in a statement he allegedly made in 1959. Reagan was fond of quoting this supposed pronouncement in speeches he gave as a crusader for conservative causes before launching his own political career later in the '60s. This instance is from an address he delivered in 1961:", "The communists are supremely confident of victory. They believe that you and I, under the constant pressure of the Cold War, will one by one give up our democratic traditions and principles and customs. Only temporarily, of course, but only temporarily we will turn to totalitarian tactics and methods just for the purpose of opposing the enemy. And then they cynically believe we will one day awake to find that we have, in adopting these tactics, become so much like the enemy that the causes for conflict have disappeared between us. Three and a half months before his last visit to this country, Nikita Khrushchev said, \"We can't expect the American people to jump from capitalism to communism but we can assist their elected leaders in giving them small doses of socialism until one day they will awaken to find they have communism.\"", "Variants of this passage also appeared in newspaper opinion columns, letters to the editor, and even political ads portraying Democratic Party candidates as enemies of freedom. This example is from the Muncie, Indiana, Star Press of 5 November 1960:", "Fast-forwarding to some 56 years later, we find the same quote being deployed against Democrats of today, only now in the preferred venue of social media:", "\"giving Americans small doses of socialism until they suddenly awake to find they have communism.\"-Nakita Khrushchev pic.twitter.com/mQVfhYvaNo", "— Susan Minor (@susanminor41) April 14, 2016", "The authenticity of the quote was questioned practically from the get-go, however. In 1962, Sen. Lee Metcalf (D-Montana) assailed it as \"a fabrication, attributed to the leader of the Communist Party, (which) arouses Americans against their elected officials.\"", "Metcalf told the Los Angeles Times that the quote was being circulated by organizations including the far-right John Birch Society, which operated a bookstore called Poor Richard's Book Shop in Hollywood:", "[Metcalf] said the statement has been printed on post cards distributed by Coast Federal Savings & Loan Assn. and Poor Richard's Book Shop, both of Los Angeles, but that the Central Intelligence Agency, the Federal Bureau of Investigation and the Library of Congress have all been unable to verify the quotation.", "Metcalf said such material leads readers \"to believe that their President, their senators, their representatives, their judges and local officials are Communist stooges. Thus a lie is used to perpetrate a greater lie.\"", "The Times reported that the president of Coast Federal Savings & Loan, Joe Crail, claimed responsibility for printing the postcards but admitted he couldn't authenticate the quote and said the campaign had been discontinued for that reason.", "Similarly, Sen. Morris K. Udall (D-Arizona) recruited the Library of Congress to verify the authenticity of the statement attributed to Khrushchev and shared the results in the 10 May 1962 issue of The New Republic:", "\"We have searched the Legislative Reference Service files, checked all the standard reference works on quotations by Khrushchev, and consulted with the Slavic division of the Library of Congress, the Department of State, and the US Information Agency, in an attempt to determine the authenticity of this quotation. From none of these sources were we able to produce evidence that Khrushchev actually made such a statement.\"", "All that supposedly changed four years later when a witness came forward to claim that Khrushchev had uttered those very words in his presence. Ezra Taft Benson, who served two terms as President Eisenhower's Secretary of Agriculture and would later head the Church of Jesus Christ of Latter-day Saints, said in a 1966 address at Brigham Young University (BYU) that Khrushchev made the statement during a one-on-one discussion the two had in September 1959:", "I have talked face-to-face with the godless Communist leaders. It may surprise you to learn that I was host to Mr. Khrushchev for a half day, when he visited the United States. Not that I’m proud of it -- I opposed his coming then and I still feel it was a mistake to welcome this atheistic murderer as a state visitor. But according to President Eisenhower, Khrushchev had expressed a desire to learn something of American agriculture, and after seeing Russian agriculture I can understand why.", "As we talked face-to-face, he indicated that my grandchildren would live under Communism. After assuring him that I expected to do all in my power to assure that his, and all other grandchildren, would live under freedom, he arrogantly declared, in substance:", "You Americans are so gullible. No you won’t accept Communism outright, but we’ll keep feeding you small doses of socialism until you’ll finally wake up and you find you already have Communism. We won’t have to fight you. We’ll so weaken your economy until you fall like over-ripe fruit into our hands.", "Such a meeting did occur, documents show, but Benson's 1966 account of their exchange on communism raises more questions than it answers. Benson had cited versions of the same quote on more than one occasion prior to 1966 without claiming that Khrushchev said it in his presence.", "Like Ronald Reagan routinely did during the same period, Benson told audiences that the Soviet premier made the remark before, not during, his 1959 visit to the United States. Benson presented it as follows in an August 1961 commencement address at BYU (from a report in the Provo Daily Herald, emphasis added):", "The Communist strategy, said the speaker, was laid down by Nikita Khrushchev three weeks before he visited the United States when he was quoted as making this statement:", "\"We cannot expect the Americans to jump from capitalism to communism, but we can assist their elected leaders in giving Americans small doses of socialism, until they suddenly awake to find they have communism.\"", "\"For years LDS Church leaders have warned against such a development, Elder Benson said.", "He introduced the quote more or less the same way in a book he wrote the following year (1962) called The Red Carpet: Socialism -- The Royal Road to Communism (emphasis added):", "A few months before coming to the United States Khrushchev is reported to have said:", "\"We cannot expect the Americans to jump from capitalism to communism, but we can assist their elected leaders in giving Americans small doses of socialism, until they suddenly awake to find they have communism.\"", "The three different versions of the story don't jibe. Did Khrushchev utter the remark three weeks before visiting the U.S., a few months before, or did he utter it during a face-to-face meeting with Benson on U.S. soil? Why did Benson write in 1962 (three years after Khrushchev's visit) that the Soviet premier was \"reported\" to have said it? Why was there no mention before 1966 of Khrushchev's saying it to his face?", "Unfortunately, Ezra Taft Benson died in 1994, so we can't ask him. Nor, as far as we know, has any third-party witness to the alleged exchange ever come forward. Far from settling the question of whether Khrushchev really vowed to slip Americans \"small doses of socialism,\" Benson's conflicting stories leave the authenticity of the remark very much in doubt.", "We should also mention, in passing, that U.S. conservatives were sounding alarms about Americans being plied with \"small doses of socialism\" long before Khrushchev attained the premiership of the Soviet Union. This is National Association of Manufacturers President Claude A. Putnam speaking in April 1950 (as reported in the Times Herald of Olean, New York):", "Socialism \"is being foisted on the American people piecemeal,\" says Claude A. Putnam of Keene, N.H., president of the National Association of Manufacturers. Putnam, who spoke here, warned that an \"all-powerful government is a menace to freedom.\" The American people \"are being given small doses of socialism, disguised as social gains and gifts of something for nothing,\" he declared.", "If we've learned nothing else in the roughly 60 years of its existence, the durability of the Khrushchev quote shows that a politically charged statement needn't be authenticated to serve its purpose as a partisan cudgel. As if to prove the point, the quote was tweeted out to 70,000 followers as recently as February 2018 by none other than Michael Reagan, Ronald Reagan's son:", "We cannot expect the Americans to jump from capitalism to communism, but we can assist their elected leaders in giving Americans small doses of socialism, until they suddenly awake to find they have communism.\"\n-- Nikita Khrushchev", "— Michael Reagan (@ReaganWorld) February 18, 2018", "Benson, Ezra Taft.   \"Our Immediate Responsibility.\"\r\n    Latter Day Conservative.   25 October 1966.", "Jeffries, Stuart.   \"Karl Marx's Guide to the End of Capitalism: A Primer.\"\r\n    The Guardian.   20 October 2008.", "Reagan, Ronald.   \"Encroaching Control.\"\r\n    The Reagan Speech Preservation Society.   30 March 1961.", "Udall, Morris K.   \"Khrushchev Could Have Said It.\"\r\n    The New Republic.   7 May 1962.", "The Daily Herald.   \"542 Receive Degrees at BYU Rites.\"\r\n    27 August 1961.", "The Los Angeles Times.   \"Right-Wingers Hit on 'Quote' by Khrushchev.\"\r\n    9 March 1962.", "Times Herald.   \"Keene Warns Against Spread of Socialism.\"\r\n    14 April 1950.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]