["“I’ll believe in climate change when Texas freezes over,” reads the tweet allegedly written by Cruz. It was shared on social media while a furor erupted about his personal actions after an unusually severe winter storm covered Texas in the second and third weeks of February, 2021.", "“This 2016 Ted Cruz Tweet did not age well, and it has also frozen solid,” one user humorously commented, while others shared it on Instagram and Twitter.", "However, the tweet was doctored, and no records of it exist online.", "The fake tweet features Cruz’s real handle, @tedcruz, as well as the photo that he currently uses on Twitter. The tweet was supposedly published at 5:44 PM on September 8, 2016.", "Cruz’s real Twitter account currently shows that on September 8, 2016 the Senator tweeted only twice, both times about the Obama administration but not about climate change.", "Politwoops, a project of investigative journalism website ProPublica to archive tweets deleted by politicians, shows that Cruz did not delete any tweets on September 8, 2016.", "Cruz’s other Twitter account, @SenTedCruz, does not show any such tweet on that day either.", "Cruz has repeatedly questioned scientific evidence for global warming. During a 2015 NPR interview on this belief, he said that climate change is the result of “liberal politicians who want government power over the economy, the energy sector and every aspect of our lives.”", "An overwhelming majority of scientific studies suggest that climate change is real. A vast majority of countries see the trend as the world’s greatest threat.", "Cruz faced heavy criticism for his February 17, 2021 trip to Cancun, Mexico while millions of people in his state struggled without power or water due to the storm. The senator, a possible 2024 presidential contender, returned home the day after and called the trip a mistake, retweeting his explanation to reporters.", "Other disinformation shared during the 2021 winter storm falsely claimed that renewable energy failed in Germany and was to blame for US power shortages, and that a pastor had refused to provide shelter from the cold.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]