["About this rating", "In June 2017, a lawsuit filed by a man named Larry Klayman against President Barack Obama, George Soros, Black Lives Matter, Hillary Clinton, the Nation of Islam, and several others for inciting violence against police officers was dismissed.", "In 2018, dubious \"news\" web sites such as Guerrilla.News continued to post about this lawsuit as if it was still recent, relevant, and ongoing:", "FEDERAL LAWSUIT Names Obama, Holder, Sharpton, Farrakhan, BLM Leaders for “INCITING VIOLENCE” Against Police", "It seems as though Former President Barack Obama may have some regrets after supporting Black Lives Matter. He was so adamant about pushing the cop-hating and white-hating mentality that was the catalyst in further dividing Americans, but now it seems to all have backfired. A conservative activist is in the process of holding Obama and his black extremist peers responsible for the hate that they have built through their idiotic persistence.", "Former prosecutor Larry Klayman is sick and tired of the cop-killing and extreme animosity towards police. He recently filed a lawsuit against a group of defendants that he believes are responsible for instigating the hateful crime spree.", "This lawsuit was filed by Larry Klayman in July 2016 in the United States District Court of the Northern District of Texas on behalf of himself and Dallas Police Sargent Demetrick Pennie, shortly after five police officers were killed by a sniper.", "The lawsuit accused Obama and 16 other defendants of inciting \"their supporters and others to engage in threats of and attacks to cause serious bodily injury or death upon police officers and other law enforcement persons of all races and ethnicity including but not limited to Jews, Christians and Caucasians.\"  It was dismissed in June 2017:", "With respect to Defendants President Obama and General Holder, the court grants their Motion to Dismiss (Doc. 21), as Plaintiffs lack Article III standing, and accordingly dismisses without prejudice Count Three for lack of subject matter jurisdiction under Federal Rule of Civil Procedure 12(b)(1). Counts One and Two are dismissed without prejudice pursuant to Federal Rule of Civil Procedure 41(a)(1)(A)(i), as Plaintiffs have voluntarily dismissed these claims against President Obama and General Holder, and no answer or motion for summary judgment has been filed by either Defendant.", "Klayman has a long history of filing frivolous lawsuits. In fact, during the back-and-fourth litigation of the aforementioned lawsuit, the court warned Klayman about filing more \"nonsensical documents\" and threatened him with a fine:", "ORDER: The record reflects Mr. Klayman's predilection for filing frivolous, nonsensical, and vituperative documents, in the form of notices, motions, briefs, etc., in response to unfavorable rulings. The court has grown weary of Mr. Klayman's tactics. If Mr. Klayman files any further frivolous or nonsensical documents in this matter, the court will personally sanction him monetarily. The court directs the Clerk to strike \"Plaintiffs' Response to the Court's Order Denying Motion for Leave to File Notice of New Case Authority Re: Memorandum Opinion and Order in Nwanguma v. Trump\"(Doc. 132 ). (Ordered by Judge Sam A Lindsay on 4/13/2017) (axm) (Entered: 04/14/2017)", "It appears that Klayman escaped discipline during the course of these legal proceedings, but the conservative attorney has not always been so lucky. In a 2017 profile of the conservative attorney, TheHill.com noted that Klayman has been formally disciplined by multiple courts:", "In a 2016 opinion, a federal court of appeals noted 12 cases “in which Klayman’s ability to practice law in an ethical and orderly manner was called into question.”", "Klayman, an avid supporter of the \"birther\" conspiracy theory, also once filed a petition to get Obama deported. Klayman has also referred to Obama as a \"Muslim king\" and once held a \"citizen's grand jury\" (which had no legal authority) in an attempt to charge Obama with fraud for becoming president. The activist lawyer's documents have no force of law and compel no government action, serving instead as self-published expressions of his political viewpoint.", "Barbaro, Michael.   \"Black Lives Mater Was Gaining Ground. Then a Sniper Opened Fire.\"\r\n    New York Times..   9 July 2016.", "Bo Williams, Katie.   \"Larry Klayman: 'Why I'm not scared.'\"\r\n    The Hill.   1 January 2017.", "Southern Poverty Law Center.   \"Larry Klayman Files Two Lawsuits Accusing Black Defendants of Pushing Race War.\"\r\n    7 February 2017.", "Ohlheiser, Abby.   \"Larry Klayman is Suing the Federal Government Because of Ebola. Yes, Really.\"\r\n    Washington Post.   14 October 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]