["About this rating", "On 4 April 2017, the web site Safe Living published an article reporting that high schoolers put together a science experiment involving cress and wifi that purportedly showed wireless connectivity is harmful to seedlings:", "Foreign researchers are extremely excited for a biology project from five 9th grade girls ... Take 400 Cress seeds and place them into 12 trays. Then place six trays in two rooms at the same temperature. Give them the same amount of water and sun over 12 days, and remember to expose half of them to mobile [Wi-Fi] radiation.", "It is a recipe for a biology test so brilliant that it has attracted international attention among acknowledged biologists and radiation experts. Behind the experiment are five girls from 9b in Hjallerup School in North Jutland, and it all started because they found it difficult to concentrate during the school day ... The school was not equipped to test the effect of mobile phone radiation on them. Therefore, the girls had to find an alternative. And the answer was Cress.", "Six trays of seeds were put into a room without radiation, and six trays were put into another room next to two [Wi-Fi] routers. Such routers broadcast the same type of radiation as an ordinary mobile.", "And the result spoke was clear: cress seeds next to the router did not grow, and some of them were even mutated or dead.", "Most versions of the story did not provide any further detail. After its initial appearance in 2013, the claim regularly pops up as \"new news,\" spiking again in December 2013 in an article describing the school project as a study (rather than an experiment) and raising health concerns.", "However, a 2013 meta-study suggested that, while research showed mixed results, there was little to cause immediate concern and proposed more research on the topic:", "The lack of an apparent biophysical mechanism of interaction and the generally negative results of other studies using RF exposures at similar levels as Wi-Fi (Jauchem 2008; Habash et al. 2009; Vecchia et al. 2009; IARC 2011) provide no basis to anticipate that Wi-Fi exposure will cause any biological effects. The overwhelming consensus of health agencies around the world is that RF exposures below international (ICNIRP or IEEE) exposure limits have not been shown to produce any health hazard (Verschaeve 2012).", "A May 2013 analysis written by skeptic and mathematician Pepijn van Erp as the claim made its way around the Internet unpacked concerns about the project:", "Who are the scientists who are so enthusiastic about this poor study? The article on the Danish website mentions Olle Johansson, who received the ‘Misleader of the Year‘ Award from the Swedish skeptics in 2004. He is well known for having unsubstantiated ideas of negative health effects of radiation. He is cited in the Danish article as having plans to replicate the girls’ experiment in cooperation with senior researcher Marie-Claire Cammaerts from the Université libre de Bruxelles. We shouldn’t expect anything good from this replication, because as I’ve shown in a blog some while ago, Cammaerts probably cannot be trusted with this kind of experiments (see: Ants Performing Statistical Miracle under GSM Phone Radiation?). [Update 4-1-2016: Cammaerts and Johansson published a replication, in which they managed to make even more mistakes] Tjomlid also mentions Andrew Goldsworthy, another well known fear monger, and Dutchman Niek van ‘t Wout, who is head of green space of a Dutch city and the instigator of research into the possible deteriorating effect of WiFi on trees (so he is not a scientist himself). After a not so convincing first experiment, Wageningen University started a follow up, of which we never heard again.", "The Guardian posited that heat generated by routers could be a possible plant growth inhibitor, and observed that the students didn't rule out other causes for sleep disruption near mobile phones (such as light or general distracting properties).", "It is true that in May 2013 a small school science project was done by five Danish schoolgirls, its findings cyclically reported and shared on social media for years thereafter. Although anti-technology sites continue to present the claim as novel and credible, seasoned researchers almost immediately identified significant flaws in the methodology.", "A study published in March 2016 has been widely billed as a replication of the Danish high school project. That study, which is published in an obscure journal (Current Chemical Biology) and written by a professor actively involved in pushing claims about the dangers of EMF, as well as a “consultant” who works for a company that offers to “measure your home, office and/or school for Dirty Electricity, Radio Frequency Radiation, Electric and Magnetic fields and provide simple solutions to reduce your exposure to ‘electrosmog’, is literally the opposite of a replication of the Danish study, as they did not actually replicate their results:", "We did not get the same results as the high schools students in Denmark. Of the four species we tested, garden cress (Lepidium sativum) seemed to be the least sensitive to Wi-Fi radiation under controlled laboratory conditions. There was no difference in germination or biomass at the end of the 28-day experiment.", "While this study did test the effects of Wi-Fi on other plants (broccoli, red clover, and peas) and purported to find negative effects on them, science is still waiting for a successful replication to the Danish cress study (as well as a replication of new results presented in this paper).", "Bean, Daniel.   \"Can WiFi Signals Stunt Plant Growth?\"\r\n    ABC News.   24 May 2013.", "Gage, Suzi.   \"Wi-Fried: Do Wireless Routers Really Kill Plants?\"\r\n    The Guardian.   17 December 2013.", "Havas, Magda and M. Sheena Symington.   \"Effects of Wi-Fi Radiation on Germination and Growth of Broccoli, Pea, Red Clover and Garden Cress Seedlings: A Partial Replication Study.\"\r\n    Current Chemical Biology.   2016.", "Howe, Alex.   \"No, Wi-Fi Does Not Hurt Plants — Or Anything Else for That Matter.\"\r\n    Science Meets Fiction.   16 December 2013.", "Van Erp, Pepijn.   \"Danish School Experiment with Wifi Routers and Garden Cress, Good Example of Bad Science.\"\r\n    Pepijn Van Erp.   25 May 2013.", "Zolfagharifard, Ellie and Ben Spencer.   \"What's Wifi Doing to Us? Experiment Finds That Shrubs Die When Placed Next to Wireless Routers.\"\r\n    Daily Mail.   16 December 2013.", "Stop Smart Meters.   \"9th Grade Student 'Cress + Wifi' Experiment Attracts International Attention.\"\r\n    21 May 2013.", "Safe Living.   \"9th Grade Student 'Cress + Wifi' Experiment Attracts International Attention.\"\r\n    4 April 2017.", "Updated [6 November 2017]: Added further information about a 2016 study billed as a replication of the original Danish finding.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]