["About this rating", "On 1 May 2015, a rumor began to circulate online claiming a “study” assessed the beards of average men and made a shocking discovery: they’re basically dripping with fecal matter (known colloquially as “poop”).", "The headlines followed, ones such as “Study: Men’s Beards are Filled with Poop and Nasty Bacteria,” “Your beard is dirty as a toilet,” and “How Filthy Is Your Beard?” The intrigue of the claim at a time when beards were certainly somewhat in fashion led to little scrutiny of its base facts... most notably, what study?", "For example, here is one of the earliest iterations of this claim, which came from a site devoted to casting calls (not a medical journal or other scientifically credible site) and was loaded with scary phrases about fecal contamination:", "However, a new study has shown that beards are basically filled with more bacteria than the inside of a toilet. According to KOAT Albuquerque, several anonymous men allowed a microbiologist to swab their beards for bacterial testing. A few of the beards contained standard stuff while others revealed fecal matter. While the microbiologist recommended a good beard scrubbing and regular hand-washing to diminish the amount of germs, he didn’t explain how a man’s beard could end up with poop in the first place.", "But that underlying “study” was actually merely a brief local news report by Albuquerque station KOAT that consisted of a newsperson and a Quest Diagnostics lab in Albuquerque taking swabs from the beards of a small handful of volunteers, analyzing them for microbes, finding a few seemingly yucky results, and discussing the outcome with a single microbiologist — from whom a few very short, sensational-sounding, out-of-context sound bites were excerpted.", "This tenuous “study” was soon the subject of a multiplicity of sensationalized headlines comparing men’s beards to everything fecal:", "o Cosmopolitan: “New study finds beards are toilet-level dirty”", "o New York Post: “Bearded men have poop on their faces”", "o Canada Journal: “Your filthy beard contains more s— than a toilet, study shows”", "o Daily Mirror: “Some beards contain more poo than a toilet shocking study reveals”", "o News.com.au: “Shock new research reveals some beards contain more poo than a toilet”", "o WSB-TV: “Beards are filled with bacteria and ‘as dirty as toilets’”", "However, as the Guardian observed, KOAT’s process fell far short of what constitutes a rigorous study and didn’t actually detect the presence of fecal material in men’s beards:", "As far as I can tell there was no proper study, no team of microbiologists and no poo in beards. The origin of the story appears to be this segment from a TV news network in New Mexico, which involved a reporter swabbing a “handful” of men’s beards and then sending the swabs to a microbiologist in a lab to culture any microbes present.", "The reporter then interviewed the microbiologist, John Golobic, who identified a few of the bacteria present as “enterics”, that is they are bacteria that normally live in the intestines.", "“Those are the types of things you’d find in faeces,” he said.", "And that’s all. Somehow, from this story other media organisations have managed to get poo in beards.", "While it is true that human faeces are partially composed of gut bacteria, it’s not accurate to describe those bacteria on their own as faeces.", "Similarly, the Washington Post noted that “gut bacteria” isn’t necessarily the same thing as “poop,” not is its presence either alarming or harmful:", "The problem with this is that bacteria known to associate poop is not necessarily literal poop. In fact it’s probably not. And saying that something is gross for being covered in bacteria is pretty ridiculous, because anything that exists in our physical realm is definitely going to be covered in bacteria.", "I have bad news for y’all: You’re covered in poo bacteria. COVERED. Look to your left, look to your right. There’s probably poo bacteria on both sides and also in front of you. It’s okay. It’s really fine. Embrace the poo bacteria, it is a part of you because you are a multitude of microorganisms, each more special than the last.", "But unless you’ve put it there intentionally, you almost certainly don’t have poop on your face. No matter how thick your beard is.", "The Guardian concurred in that assessment:", "Even if this was a properly conducted scientific study with a large number of samples and published in a reputable journal, there wouldn’t necessarily be any cause for concern.", "Human skin is home to great diversity of microbes, and it’s not unheard of for types of bacteria normally found in the gut, such as E. coli, to be also found on the skin.", "It may be true that some beards may be less than rigorously hygienic, but proclaiming them to be “filthy” and “dirty as a toilet” based on a scant TV news survey is an alarmist exaggeration.", "Da, Royale.   \"Some Beards as Dirty as Toilets.\"\r\n    KOAT-TV.   30 April 2015.", "Evershed, Nick.   \"No Need for Men to Get Flush-Faced About Faeces in Beards.\"\r\n    The Guardian.   4 May 2015.", "Feltman, Rachel.   \"No, Your Beard Isn’t Full of Poop (Probably).\"\r\n    The Washington Post.   4 May 2015.", "Project Casting.   \"Study: Men's Beards Are Filled with Poop and Nasty Bacteria.\"\r\n    3 May 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]