["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The economy in Madison, Wis., is buoyed by state government and the University of Wisconsin. (Bill Fritsch)", "Republican Scott Walker, aiming to smack down the latest Democrat seeking to deny him a third term as governor, got off to an early start in attacking Madison Mayor Paul Soglin.", "At 6:41 a.m. on Jan. 10, 2018, the day Soglin announced his candidacy, Walker tweeted:", "The last thing we need is more Madison in our lives. @Paulsoglin is the latest extreme liberal who wants to take our state backward -- just like he did in Madison, where businesses have left and murders have gone up. We want to go forward.", "The capital city is generally known for having economic vitality and relative safety.", "So, let’s check the attack: Walker is claiming that in Madison, businesses have left and murders have gone up, and that Soglin is at least partly to blame.", "(We’ll note: The Wisconsin Republican Party unveiled an anti-Soglin website the same day and made an attack on Soglin similar to Walker’s.)", "Businesses leaving", "To back the first part of Walker’s statement, his campaign cited to us two large employers that left the city:", "1. Spectrum Brands, the owner of Rayovac, Remington and other consumer product lines, announced in 2012 it was moving its headquarters and more than 500 employees from Madison to Middleton, a suburb.", "Soglin complained that Spectrum Brands didn’t give Madison a chance to bid on keeping the company in the city. The company said its Madison facility was outdated and not energy efficient, and that it did consider sites in Madison. The company also said the cost savings --  along with a $4 million award from the Wisconsin Economic Development Corp., a state agency under Walker -- \"were substantial enough to shelve plans to move\" to Florida.", "2. Heinz Kraft, the parent company of Oscar Mayer, announced in 2015 it would shut down its 1,000-employee Oscar Mayer plant in Madison. Kraft Heinz said the decision was part of a plan to close seven factories in the United States and Canada, following its merger with Oscar Mayer.", "State Senate Majority Leader Scott Fitzgerald, a Republican, pointed a finger of blame at Soglin, while Soglin criticized the Economic Development Corp. for not trying to keep the plant in Madison after learning that other states were trying to get the Wisconsin facilities.", "Walker’s campaign also pointed to criticism of Soglin over Oscar Mayer by former Madison Mayor Dave Cieslewicz. But Cieslewicz concluded that the company’s decision to close the plant \"almost certainly couldn’t have been headed off by state or local efforts, even if officials knew it was coming. This appears to be a straightforward business decision that had to do with changes in the industry and the configuration of the aging plant here.\"", "So, based on news reports of the companies’ own statements, it’s not clear how much of a role, if any, Soglin played in the companies’ decisions.", "Moreover, Walker didn’t provide any evidence that the two cases are anything more than isolated examples.", "We thought it was important to look at the number of businesses in Madison overall.", "Finding those numbers isn’t as simple as it might appear. These entities don’t count businesses at the City of Madison level: the state departments of Workforce Development and Financial Institutions; the Wisconsin Manufacturers and Commerce and the Greater Madison Chamber of Commerce; and three federal bodies -- the Bureau of Economic Analysis, the Census Bureau and the Bureau of Labor Statistics.", "The best count we could find is from the City of Madison assessor’s office, which tracks business that are subject to what is known as the personal property tax, but is only paid by businesses, based on their equipment and furnishings. (Utilities and manufacturers are excluded from the counts.)", "Business in Madison, per city assessor counts", "2011 (Soglin takes office in April)", "4,700", "2012", "5,095", "2013", "4,791", "2014", "4,949", "2015", "4,701", "2016", "4,704", "2017", "4,847", "So, the figures indicate the number of businesses has gone up and down during Soglin’s tenure, but there are more now than when he took office.", "In other words, it isn’t a picture of a net loss in businesses.", "Murders in Madison", "Homicide in Madison is uncommon enough that, to the best of the Madison Police Department’s knowledge, the number has been in the single-digits in every year but one. So, even one or two incidents could cause an increase in a given year.", "In contrast, although Milwaukee’s population is only about 2.4 times larger than Madison’s (595,000 to roughly 252,000), it had more than 11 times as many homicides (124) in 2017.", "Here’s a look at the numbers:", "Homicides in Madison", "Year", "Number of homicides", "2011 (Soglin took office in April)", "7", "2012", "3", "2013", "5", "2014", "5", "2015", "6", "2016", "8", "2017", "11", "So, the number of murders in 2016 and 2017 was higher than in every other year during Soglin’s tenure. In fact, the 11 in 2017 is a record for the city.", "Like many mayors, Soglin has sometimes clashed with his police chief over police staffing. And policing certainly is one factor in homicides. But criminologists say many other factors are involved.", "Northeastern University professor of criminology, law and public policy James Alan Fox told us Soglin can’t be singled out for blame, saying:", "As is common for jurisdictions that tend to have fewer than a dozen homicides a year, there is a substantial volatility in the homicide counts that have little to do with any policy or practice. Such factors as whether a gunshot victim is struck in a vital organ or not, and how quickly an assault victim is brought to the hospital for emergency treatment, can impact whether a crime is a homicide or an aggravated assault.", "(Police policies and staffing could affect homicides), however, staffing levels have little impact on many forms of homicide. And whatever impact there is, it is hard to connect that with an increase of a few homicides.", "Said Rick Rosenfeld, a criminology and criminal justice professor at the University of Missouri-St. Louis:", "These numbers are simply too low to draw meaningful conclusions about an increase, not to mention assigning \"blame.\" Homicide counts will vary one year to the next simply because a bullet hits or misses a vital organ. Social scientists refer to such variation as measurement error.  The Madison numbers are well within expected measurement error of this sort.", "Our rating", "Walker says Soglin took Madison backward -- \"businesses have left and murders have gone up.\"", "There are, of course, examples of businesses having left Madison, but the total number of businesses appears to be higher now than when Soglin took office. As for murders, they increased by two in 2016 and by three in 2017, hitting a record high of 11.", "But the two large companies cited by Walker that pulled out of Madison cited business reasons, not Soglin, for leaving. And while a mayor can play some role in combating homicides, primarily through a police department, there are many factors that lead to murder.", "Walker’s statement contains an element of truth but is overbroad. We rate it Mostly False.", "div class='artembed'>", "Twitter, Scott Walker tweet, Jan. 10, 2018", "Email, Scott Walker campaign spokesman Brian Reisinger, Jan. 23, 2018", "Email, Paul Soglin campaign manager Melissa Mulliken, Jan. 15, 2018", "Madison Police Department, annual reports for 2016, 2015, 2014, 2013, 2012, 2011", "Capital Times, \"Soglin claims city was shut out of Spectrum move discussions,\" Jan. 27, 2012", "Spectrum Brands, news release, Jan. 19, 2012", "Wisconsin State Journal, \"Defying Paul Soglin, finance committee adds Midtown Police Station funding,\" Sept. 29, 2015", "U.S. Census Bureau, \"Geography Area Series: County Business Patterns by Employment Size Class,\" 2010 through 2015", "WISN-TV, \"Upfront with Mike Gousha\" interview of Paul Soglin, Jan. 14, 2018", "Wisconsin State Journal, \"Mayor Paul Soglin blasts Police Chief Mike Koval for 'campaigning' for higher budget,\" April 28, 2017", "Wisconsin State Journal, \"Scott Fitzgerald points finger at Paul Soglin on Oscar Mayer plant closure,\" March 9, 2016", "Wisconsin State Journal, \"Oscar Mayer plant in Madison will close; headquarters to move to Chicago,\"", "Capital Times, \"Mayor Paul Soglin reflects on Madison's violent year,\" Dec. 24, 2017", "Interview, Wisconsin Department of Financial Institutions spokesman George Althoff, Jan. 17, 2018", "Email, Northeastern University of criminology, law and public policy James Alan Fox, Jan. 26, 2018", "Email, University of Missouri-St. Louis criminology and criminal justice professor Rick Rosenfeld, Jan. 26, 2018", "Interview, City of Madison Economic Development Division director Matthew Mikolajewski, Jan. 16, 2017", "Email, University of Wisconsin-Madison University Research Park managing director Aaron Olver, Jan. 16, 2018", "Interview, Wisconsin Manufacturers and Commerce director of communications and marketing Nick Novak, Jan. 16, 2018", "Interview, City of Madison treasurer Dave Gawenda, Jan. 16, 2018", "Isthmus, \"Finger-pointing over Oscar Mayer doesn’t help anybody,\" March 7, 2016", "Email, Wisconsin Department of Workforce Development communications director John Dipko, Jan. 17, 2018", "Email, U.S. Department of Commerce Bureau of Economic Analysis chief of public affairs and outreach Jeannine Aversa, Jan. 16, 2016", "Interview, Madison police records custodian Lt. John Radovan, Jan. 16, 2018", "Email, U.S. Census Bureau public information officer Daniel Velez, Jan. 16, 2018", "Interview, Madison Region Economic Partnership research and communications manager Jin Park-Higbee, Jan. 16, 2018", "Interview, Madison City Assessor Mark Hanson, Jan. 24, 2018", "Greater Madison Chamber of Commerce communications manager Erik Greenfield, Jan. 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]