["About this rating", "In May 2019, we began receiving queries from viewers who were taken aback by a photograph supposedly showing a very large species of megabat in the Philippines known as the \"Golden Crowned Flying Fox\":", "While some who have encountered this image may believe it pictures a creature straight from the pages of a Bram Stoker novel, the photograph truly depicts an animal that exists in the real world.", "We have not been able to positively identify the species of bat shown in this image, but it is frequently circulated with captions naming it as a \"Golden Crowned Flying Fox\" (Acerodon jubatus), also known as the golden-capped fruit bat — although the animal in this picture doesn't appear to have the golden fur around its head that species is known for. It's possible this image actually shows another species of megabat, called fruit bats or old world fruit bats, such as the Large flying fox (Pteropus vampyrus).", "We've reached out to Bat Conservation International for help identifying this species and will update this article when more information is available.", "Regardless of the exact species, this is a genuine photograph of a large megabat. It was first posted to the \"Nature Is Metal\" section of Reddit on 9 August 2018 along with the claim that it showed a \"Flying Fox\" in the Philippines, where Reddit user \"sakundes\" uploaded two additional images in that thread to assure skeptical viewers that the first photograph was real. One was simply an uncropped version of the viral image, and the second pictured this megabat from a different angle:", "We also found a video of this same flying fox on YouTube:", "While these images are real, they may also give viewers an unrealistic expectation about the size of megabats. We've encountered a few social media posts, for instance, labeling this bat as \"human-sized.\"", "The flying fox is one of the largest species of bats in the world, with a wingspan growing to nearly 5 1/2 feet. However, the megabat's actually body length is not comparable to the size of an average adult human. According to Animal Diversity, these megabats only grow to a little over a foot in length and weigh less than 3 pounds.", "Norton, Kelsie.   \"Pteropus Vampyrus: Large Flying Fox.\"\r\n    Animal Diversity Web.   Retrieved 9 May 2019.", "Stimage, Kaityn.   \"Flying Foxes: The Largest Bats In The World.\"\r\n    World Atlas.   22 November 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]