["About this rating", "When The Texas Chain Saw Massacre hit movie theaters in 1974, it quickly supplanted the previous year's top horror flick, The Exorcist, as \"the most terrifying movie ever made.\" Unlike The Exorcist, however, The Texas Chainsaw Massacre eschewed standard production values and modern special effects in favor of a grainy documentary-like approach with decidedly low-tech visual effects. The tale of five young students who unwittingly meet up with a sinister hitchhiker and the mask-wearing maniac Leatherface (whose mask is actually made from dried human skin, not leather), The Texas Chainsaw Massacre turned \"a lumberjack's tool into the stuff of nightmares and the blood-curdling scream into an art form,\" in the words of Toronto Star writer Melissa Aronzyk.", "The 2003 remake of The Texas Chainsaw Massacre has been touted with the tagline \"Inspired by a true story,\" leading many horror fans to wonder whether the grisly film was actually based on real events, or whether the claim is simply another bit of Hollywood promotion intended to attract filmgoers via the extra-chilling lure of a macabre tale not entirely the product of a screenwriter's imagination (a technique successfully used by the Coen brothers to entice viewers into suspending disbelief for 1996's Fargo, their gruesome cinematic depiction of a kidnapping-for-hire scheme gone awry).", "Actually, The Texas Chainsaw Massacre has been promoted as being \"based on a true incident\" for quite a few years now, as the original videocassette cover includes the following synopsis:", "The film is an account of a tragedy which befell a group of five youths, in particular Sally Hardesty. For them an idyllic summer afternoon drive became a nightmare when they were exposed to an insane and macabre family of chain saw killers. One by one they disappear to be brutally butchered, each murder more horrendous than the last with one victim being hung live on a meat hook, another trapped in his wheelchair as he is hacked to death and the surviving member of the group making a frantic bid for escape in the horrific climax.This video cassette is based on a true incident and is definitely not for the squeamish or the nervous.", "So, true story or not? Certainly there was no real family of cannibalistic chainsaw murderers slaughtering people in Texas, nor any actual series of chainsaw-related killings. Writer/director Tobe Hooper said the inspiration for the film came from his spotting a display of chainsaws while standing in the hardware section of a crowded store:", "I was in the Montgomery Ward's out in Capital Plaza. I had been working on this other story for some months — about isolation, the woods, the darkness, and the unknown. It was around holiday season, and I found myself in the Ward's hardware department, and I was still kind of percolating on this idea of isolation and such. And those big crowds have always gotten to me. There were just so many people to go through. And I was just standing there in front of an upright display of chainsaws. And the focus just racked from my eyeball to the people to the saws — and the idea popped. I said, \"Ooh, I know how I could get out of this place fast — if I just start one of these things up and make that sound.\" Of course I didn't. That was just a fantasy.", "Hooper has also said that he based the character of Leatherface on Ed Gein, a Wisconsin farmer who robbed graves (his own mother's supposedly among them), allegedly engaged in necrophilia and cannibalism, and murdered at least two women in the 1950s (one of whose corpses was found hanging naked — decapitated and disembowelled — in Gein's residence). As Gunnar Hansen, the actor who portrayed Leatherface, notes in his Texas Chainsaw Massacre FAQ:", "Here's what Tobe (director) and Kim (writer) told me themselves one night during the filming. They had heard of Ed Gein, the man in Plainfield, Wisconsin, who was arrested in the late 1950s for killing his neighbor and on whom the movie Psycho was based. So when they set out to write this movie, they decided to have a family of killers who had some of the characteristics of Gein: the skin masks, the furniture made from bones, the possibility of cannibalism. But that's all. The story itself is entirely made up. So, sorry folks. There never was a massacre in Texas on which this was based. No chainsaw either. And, in spite of those of you who have told me you remember when it happened, it really didn't happen. Really. Believe me. This is an interesting phenomenon. I've also had people tell me that they knew the original Leatherface, that they had been guards at the state prison in Huntsville, Texas, where he was a prisoner. Maybe they knew somebody who dreamed of being Leatherface. It is, I suppose, something to aspire to.", "Police eventually discovered the remains of 15 different mutilated female bodies in Gein's filthy farmhouse, parts of which (mostly skin and bones) had been fashioned into a variety of bizarre objects (including drums, bowls, masks, bracelets, purses, knife sheaths, leggings, chairs, lampshades, and shirts), as well as a refrigerator full of human organs.", "Gein later admitted to killing two women, one in 1954 and one in 1957. He was suspected of involvement in the disappearance of four other people in central Wisconsin (two men and two young girls) between 1947 and 1952, but the remains found in his farmhouse all came from adult females, and none of them matched up with any of the four missing persons. (Gein maintained that with the exception of the two women he had admitted killing, all of the body parts in his farmhouse had been taken from corpses he dug up in the local cemetery.)", "Gein's story inspired (at least in part) the Norman Bates character — a young man who murders women out of a twisted sense of loyalty to his dead mother — in the classic thriller Psycho, and the Buffalo Bill character — a transvestite serial killer who murders women to make use of their skin — in the horror novel Silence of the Lambs. Although the Leatherface character and the events depicted in The Texas Chainsaw Massacre differ in many substantial ways from what is known about the life and activities of Ed Gein (most notably in that Gein was apparently far more a grave robber than a murderer, and he didn't go around slicing up live victims with a chainsaw), there are definite similarities between the film and the Ed Gein story as well (e.g., hanging a murder victim's corpse in the house, making functional use of the skin from dead bodies, elements of cannibalism). Whether these similiarities are sufficiently close to justify the statement that The Texas Chainsaw Massacre was \"based on a true story\" is up to filmgoers to decide for themselves.", "Aronzyk, Melissa.   \"A New Texas Chainsaw to Fire Up Blood Lust.\"\r\n    The Toronto Star.   12 October 2003.", "Baumgarten, Marjorie.   \"Tobe Hooper Remembers 'The Texas Chainsaw Massacre.'\"\r\n    The Austin Chronicle.   27 October 2000.", "Savlov, Mark.   \"The Texas Chainsaw Massacre.\"\r\n    The Austin Chronicle.   2 November 1998.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]