["By Saranac Hale Spencer", "Posted on June 23, 2020", "Social media accounts supportive of President Donald Trump have been sharing a photo of a large outdoor crowd with the false claim that it shows the scene outside of Trump’s Tulsa rally. It actually shows the Rolling Thunder event near Washington, D.C. in 2019.", "Although President Donald Trump had expected to fill the 19,000-seat arena for his rally in Tulsa, Oklahoma — with overflow crowds next door — there were whole sections of empty seats at the June 20 event.", "The Tulsa Fire Department reported that about 6,200 tickets were scanned for the event. The Trump campaign has disputed that number, saying that the attendance figure was actually closer to 12,000.", "What’s not in dispute, though, is that the campaign cancelled speeches that were planned for an outdoor overflow crowd when that crowd didn’t materialize.", "But you wouldn’t know that by looking at Trump fan accounts on social media, which have been posting a picture of an outdoor crowd near Washington, D.C. in 2019 with the bogus claim that it shows the overflow crowd in Tulsa.", "Many of the pictures were shared with a caption attached that claimed: “A small crowd has gathered for the Trump Rally in Tulsa “", "The Berks County Republican Committee’s Facebook page posted the picture the day after Trump’s rally with this claim: “SHARE THIS FAR AND WIDE AS THE LEFT IS TRYING TO MAKE IT LOOK LIKE TRUMP SUPPORTERS DIDN’T SHOW UP FOR TRUMP!”", "But the picture actually shows the start of an annual motorcycle ride through Washington, D.C. that highlights veterans’ issues and honors prisoners of war. It’s hosted by an organization called Rolling Thunder. The picture shows a crowd of participants gathered in the north parking lot of the Pentagon, where the ride began on May 26, 2019.", "Other photos from that day, some of which were featured on the Facebook page for Rolling Thunder Washington, D.C., show a similar angle of the scene as is featured in the picture now being shared with the false information. The same white Jeep is visible in the foreground as is the black truck in the crowd and the white-topped tents.", "Artie Muller, executive director of Rolling Thunder confirmed to FactCheck.org that the photo being shared on social media shows the event. “That’s how it always looks,” he said.", "So, the picture shows a crowd near Washington, D.C. in 2019, not the crowd for Trump’s Tulsa rally.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Trump, Donald. “Remarks by President Trump in Roundtable Discussion on Fighting for America’s Seniors.” Whitehouse.gov. 15 Jun 2020.", "Wallace, Chris. Fox News Sunday. “Trump campaign reacts to the president’s return to the campaign trail.” Foxnews.com. 21 Jun 2020.", "Eger, Andrea. “BOK Center, TPD reject claims they contributed to Trump rally’s lower-than-expected attendance.” Tulsa World. 22 Jun 2020.", "Kaplan, Talia. “Trump campaign says fire marshal’s count for Tulsa rally attendance was ‘wrong.’” Foxnews.com. 22 Jun 2020.", "Subramanian, Courtney (@cmsub). “Campaign confirms the outdoor remarks have been cancelled. Statement per pooler @jdawsey1.” Twitter. 20 Jun 2020.", "Sailorcurt.com. “Rolling Thunder.” Photo. 28 May 2019.", "Rolling Thunder Washington, DC, Facebook page. “If you attended this year’s Rolling Thunder Demonstration Run, feel free to share your thoughts related to the run.” Photo. 29 May 2019.", "Muller, Artie. Executive director, Rolling Thunder. Telephone interview and email exchange with FactCheck.org. 23 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]