["About this rating", "In March 2020, the prospect of the U.S. government's sending out $1,200 stimulus checks to individual taxpayers as part of a $2 trillion emergency economic package for dealing with the COVID-19 coronavirus disease pandemic created a prime opportunity for grifters who engage in scams that involve luring victims by mailing checks to them.", "In particular, one several-year-old, check-scam warning was widely recirculated via social media:", "Such warnings served a useful purpose in alerting many viewers to be wary of receiving checks in the mail from unexpected sources. However, they also poorly served audiences in misstating how the underlying scams connected with those checks work. It is not the case, as claimed in the warning reproduced above and in the following news clip, that the scammers who mail out these checks \"do this in hopes of getting your account information when you deposit the check,\" and then using that information to clean out your bank account:", "A little common sense would be relevant here: If your simply depositing a check provided the sender of that check with the means to obtain your personal banking information and drain your bank account, it would be unsafe for any bank customer to ever deposit any check — and clearly that is not the case, as millions of people maintain checking accounts without regularly falling victim to scammers.", "All such check scams have two essential components:", "1) Scammers mail out counterfeit checks (often made out in the names of real organizations) to lure their victims into believing they are receiving money.", "2) Scammers instruct their victims to send back some of the funds they supposedly received from depositing the fake checks (usually via wire transfer, Western Union, PayPal, or gift cards).", "The scammers count on the fact that funds from deposited checks are often made available to bank customers before the banks can confirm that the checks are authentic and have cleared. The victims of these scams, mistakenly believing they have received \"free money\" once they have deposited their fake checks, are then usually receptive to sending some of that money back to the scammers for some legitimate-sounding purpose. But by the time the victims' banks discover the deposited checks were bad, the scammers already have the money their victims forwarded to them, and the victims are stuck paying all of those funds back to their banks:", "The person running the scam convinces a victim to cash a check and then send, via wire transfer, a portion of the money to another location. The portion kept by the victim can be called payment for a job, part of a commission, or a prize.", "However, the check turns out to be a very convincing fake.", "Banks in the United States are required to make funds available within a few days, but it can take weeks for a fraudulent check to be discovered. This means the wire transfers will happen long before the bank, or the victim, discovers that the initial check was fake.", "This scheme is effective because many consumers aren't fully aware of how the check-clearance process works:", "Unfortunately, the term “clear” sometimes gets used prematurely. An item has cleared only after your bank receives funds from the check writer’s bank. Bank employees might tell you that a check has cleared, and your bank’s computer systems might show that you have those funds available for withdrawal, but that doesn't necessarily mean you can spend the money risk-free.", "In many cases, when a bank employee tells you an item cleared, they are saying you can spend that money with your debit card, withdraw cash from an ATM, or set up a payment online. Most of the time, this informal terminology is fine because funds typically arrive as expected.", "Most of the confusion around checks comes from bank policies and federal laws that allow you to spend money before a check really clears. Banks are required to make a portion of your deposit available quickly -- usually the first $200 or, on certain official checks, $5,000 -- and they might need to release the remaining funds after several business days. But that policy might prematurely provide access to the money. It does not mean the funds successfully arrived from the check writer’s bank.", "If a check bounces, the bank reverses the deposit to your account -- even if you already spent some or all of the money from that deposit. If you don't have enough money in your account to cover the reversal, you end up with a negative account balance, and you could start bouncing other payments and racking up fees. Ultimately, you are responsible for deposits you make to your account, and you’re the one at risk.", "The lures that scammers use to dupe their victims into sending them the illusory proceeds from the depositing of counterfeit checks are many and varied:", "o Mystery Shopping Scam: Scammers engage victims to act as \"mystery shoppers\" by making purchases from various vendors in order to rate their service. The scammers then send out counterfeit checks to their victims, instructing them to keep a portion of the funds to cover the costs of purchasing and returning the goods and to compensate them for their time, then wire back the rest of the money.", "o Reshipping Scam: Scammers engage job-seekers to act as work-at-home re-shippers, receiving (possibly stolen) goods and sending them on to other locations. Then the counterfeit checks those re-shippers are sent to compensate them for their efforts and to reimburse them the shipping charges they incurred bounce, and they're left holding the bag.", "o Payment-Processing Scam: Scammers hire job-seekers to work as payment processors. The victims are instructed to open business accounts in their own name, deposit (counterfeit) checks sent to them into those accounts, then disburse the deposited funds as directed by the scammers. When the business account overdraws because the deposited checks are fake and bounce, the victim is on the hook for making restitution to the bank.", "o Windfall Scam: Scammers send out counterfeit checks that they declare are the proceeds from an inheritance, lottery win, or some other type of prize giveaway. Recipients are instructed to deposit the checks and return a share of the money to cover processing fees, shipping and handling charges, legal fees, taxes, or other charges.", "o Online Sales Overpayment Scam: Scammers agree to purchase items that have been advertised for sale or auction online, then send out counterfeit checks for greater than the sale price and ask the victims to refund the overpayments.", "o Rental Scams: Scammers respond to ads seeking roommates or tenants, send a check to cover the rent plus a little extra, then ask that the overpayment be forwarded to another party to cover moving expenses.", "As the U.S. Federal Trade Commission succinctly describes such scams:", "Fake checks drive many types of scams – like those involving phony prize wins, fake jobs, mystery shoppers, online classified ad sales, and others. In a fake check scam, a person you don’t know asks you to deposit a check – sometimes for several thousand dollars and usually for more than what you are owed – and wire some of the money back to that person. The scammers always have a good story to explain the overpayment – they’re stuck out of the country, they need you to cover taxes or fees, you need to buy supplies, or something else. But by the time your bank discovers you’ve deposited a bad check, the scammer already has the money you sent, and you’re stuck paying the rest of the check back to the bank.", "The best way to avoid falling victim to such scams is not to cash or deposit checks for people you do not know, not to wire money to people you do not know, and not to spend funds from large checks you have deposited until you have verified with your bank that those checks have fully cleared.", "Brunelli, Laureen Miles.   \"How to Recognize a Fake Check Scam.\"\r\n    The Balance.   11 November 2019.", "Pritchard, Justin.   \"Did That Check Really Clear?\"\r\n    The Balance.   24 February 2019.", "Tressler, Colleen.   \"Anatomy of a Fake Check Scam.\"\r\n    Federal Trade Commission.   5 September 2018.", "Loftsgordon, Amy.   \"Fake Check Scams Target Job Seekers.\"\r\n    Lawyers.com.   Accessed 2 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]