["A widely reported news of March 18 claimed that Bollywood actor Amitabh Bachchan got a self-quarantine stamp on his hand. Below is a tweet by Delhi Times which says that Bachchan “shared a picture of a stamp on his hand to denote he has self-quarantined…” The same was reported by Ahmedabad Times.", "Huffpost India also wrote that the actor shared a picture of his inked hand.", "Similar reports were carried by Prabhat Khabar, Times of India, Economic Times, Deccan Chronicle, India TV, The Week, Dainik Jagran, Dainik Bhaskar, Outlook and Patrika.", "Many of the English reports were republished PTI copies.", "The above reports were published after Bachchan shared a photograph of a back of a palm, inked with a self-quarantine stamp dated March 30, 2020. The actor wrote, “Stamping started on hands with voter ink, in Mumbai .. keep safe, be cautious, remain isolated if detected.” Quite evidently, nowhere has he claimed that his hand was inked but seems to be informing that stamping has been started in Mumbai.", "T 3473 – Stamping started on hands with voter ink, in Mumbai .. keep safe , be cautious , remain isolated if detected .. pic.twitter.com/t71b5ehZ2H", "— Amitabh Bachchan (@SrBachchan) March 17, 2020", "Brihanmumbai Municipal Corporation (BMC) had shared the same photograph a day before (the fourth image in the tweet). BMC informed that people who are advised to be home quarantined will now get inked at the back of their palms. “This #BadgeOfHonour will serve as a constant reminder, for 14 days. For others, gets easy to spot & remind to return home,” reads its tweet.", "#LimitContacts#SecondLineOfDefence", "People who are advised to be #HomeQuarantined will now #GetInked at the back of the palm.", "This #BadgeOfHonour will serve as a constant reminder, for 14 days. For others, gets easy to spot & remind to return home. One worry less!#NaToCorona https://t.co/PE1KPOTYgf pic.twitter.com/3VU1hAh9Mm", "— माझी Mumbai, आपली BMC (@mybmc) March 16, 2020", "The decision was taken after several reports of people resisting isolation or patients escaping quarantine wards came pouring in. People returning from abroad, even if tested negative in airport screening, are being kept in home-quarantine as a precautionary measure while their samples are sent for further tests.", "Four Germany-returned passengers with home-quarantine stamps on their hands were deboarded from a train at Palghar station after co-passengers spotted their ink. Palghar station is 100 km from Mumbai. After being deboarded, they were taken to a government hospital in Palghar. The four passengers were screened at the Mumbai international airport and tested negative. They were advised 14 days of self-isolation.", "As per reports, “Greater Mumbai’s Municipal Commissioner Pravin Pardeshi has issued an order to all officials at hospitals and the airport, asking them to ‘stamp’ behind the left palm of the home-quarantined person concerned, the dates of isolation, with ink that would last for 14 days.” The state government has also made it a punishable offence to break compulsory quarantine. Furthermore, any person who does not follow home-quarantine advice would be forcibly moved to a government isolation facility.", "Actor Amitabh Bachchan therefore did not share a photograph of his hand with a home-quarantine stamp. He was merely tweeting about the new measure undertaken by the government.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…"]