["About this rating", "Many listeners have been fascinated by a recording that was supposedly produced from slowed-down tapes of crickets chirping, producing something that sounds remarkably like a human chorus:", "Composer Jim Wilson has recorded the sound of crickets and then slowed down the recording, revealing something so amazing. The crickets sound like they are singing the most angelic chorus in perfect harmony. Though it sounds like human voices, everything you hear in the recording is the crickets themselves.", "\"I discovered that when I slowed down this recording to various levels, this simple familiar sound began to morph into something very mystic and complex ... almost human.\"", "Musician Tom Waits referenced this piece of cricket music in a 2008 NPR interview as the most interesting recording he owned:", "Q: Most interesting recording you own?", "A: It's a mysteriously beautiful recording from, I am told, Robbie Robertson's label. It's of crickets. That's right, crickets. The first time I heard it ... I swore I was listening to the Vienna Boys Choir, or the Mormon Tabernacle choir. It has a four-part harmony. It is a swaying choral panorama. Then a voice comes in on the tape and says, \"What you are listening to is the sound of crickets. The only thing that has been manipulated is that they slowed down the tape.\" No effects have been added of any kind, except that they changed the speed of the tape. The sound is so haunting. I played it for Charlie Musselwhite, and he looked at me as if I pulled a Leprechaun out of my pocket.", "What listeners are hearing is often touted as being nothing more than a simple two-track recording of crickets, with crickets chirping at normal speed on one track and greatly slowed-down recordings of crickets (said to be \"slowed down to match and mirror the length of the average lifespan of a human being\") chirping on the other.  How much the original recordings of crickets were manipulated (beyond simply slowing them down) to produce this work is a topic that has sparked considerable debate, with some confusion apparently stemming from the fact that this recording exists in multiple forms.", "Apparently the cricket sounds were originally recorded by the late Native American producer/musician Jim Wilson and used, with overdubbed lyrical narration, for the song \"Twisted Hair\" (also known as \"Ballad of the Twisted Hair\") which was issued on a spoken word and musical exploration album credited to Wilson's Little Wolf Band (along with Wilson's uncle, David Carson).  An extended, digitally remixed and mastered version of the cricket recordings was also issued on Wilson's CD release God's Chorus of Crickets, described as follows:", "Created by Jim Wilson, this enchanting recording contains two tracks: the natural sounds of chirping crickets, and the crickets played several octaves lower.", "Though it may sound like a synthesizer or a chorus singing; it's the crickets themselves slowed way down, creating the effect of a choir of human voices. The sound created is a simple diatonic 7-note scale chord progression and melody with a multi-layered structure.", "The recording can be played continuously in the background to create a natural soothing atmosphere for peace, serenity, and healing direct from Mother Nature.", "However, a version of \"Twisted Hair\" also appeared the album Music for Native Americans by Robbie Robertson and The Red Road Ensemble, and that version featured additional overdubbing by Native American opera singer Bonnie Jo Hunt, who explained in a 2004 interview with NPR how she was approached by Robertson to overdub her voice onto the track:", "I do a lot of traveling because of our non-profit organization. We work with children on self-improvement. So I'm out on the reservations much of the time. And I had these messages saying that Robbie Robertson said to get in touch with me. So we went in studio. He said, 'I want you to do whatever you feel like. And, now, these are crickets.' So I thought, oh, my goodness. I'm to accompany crickets, see?", "And when I heard them, I was so ashamed of myself, I was so humbled, because I had not given them enough respect. Jim Wilson recorded crickets in his back yard, and he brought it into the studio and went ahead and lowered the pitch and lowered the pitch and lowered the pitch. And they sound exactly like a well-trained church choir to me. And not only that, but it sounded to me like they were singing in the eight-tone scale. And so what — they started low, and then there was something like I would call, in musical terms, an interlude; and then another chorus part; and then an interval and another chorus. They kept going higher and higher.", "They were saying cricket words. I kept thinking, 'Oh, I almost can understand them. It's a nice, mellow tone. And they never went off pitch until one of the interludes, where they went real crazy and they got back on again to where they were. And I know that people do not know that they're listening to crickets unless they're told that that's what that is.", "Various listeners have therefore been exposed to different versions of this piece, some of which feature the additional human vocal overdubbing.  (The most commonly circulated versions seem to be ones which do not include Bonnie Jo Hunt's added vocals, though.)", "Nonetheless, even if the original recording featured nothing other than the sounds of crickets chirping, exactly what was done to those sounds to create the finished piece remains a subject of contention.  Critics contend that Wilson didn't simply slow down a continuous recording of crickets chirping; they interpret his statement that he \"slowed down this recording to various levels\" and Bonnie Joe Hunt's reference to Wilson's \"lowering the pitch\" several times to mean that he used multiple recordings of crickets, each slowed down by a different amount to produce a specific pitch, and layered them to create a melodic effect sounding like a \"well-trained church choir.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]