["By Jessica McDonald", "Posted on August 20, 2019 | Corrected on August 22, 2019", "In a July 31 television interview, Democratic presidential candidate Marianne Williamson inaccurately implied there might be a connection between vaccines and higher reported rates of childhood chronic diseases.", "Williamson is correct that reported rates of chronic conditions in kids have increased over the last several decades, but there is no scientific evidence to suggest vaccines are the cause. She also said childhood chronic illnesses had risen from “something like 12%” before 1986 to 54% today. Those percentages are cherry-picked and can’t be compared.", "Williamson, who is a book author and activist, made her comments in an interview on MSNBC’s “The Beat with Ari Melber” the day after her appearance in the second Democratic debate.", "When Melber characterized Williamson as having “cast skepticism on vaccinations,” the Democratic hopeful pushed back, saying, “On the issue of vaccinations, I’m pro-vaccination, I’m pro-medicine, I’m pro-science.”", "Melber then brought up statements Williamson made in New Hampshire in June, when she called vaccine mandates “draconian” and “Orwellian.” Williamson responded, “When I was a child we took far fewer vaccines, and there was much less [bundling], and there was much less chronic illness.”", "Melber asked Williamson directly whether she was suggesting that vaccines have made the situation worse. She replied, “No, no, no,” but proceeded to restate and juxtapose certain vaccine and childhood chronic disease statistics.", "Williamson, July 31: What I’m saying is that in 1986 there was this vaccine protection law, there was and there have been $4 billion in vaccine compensation payments that have been made. And there was much less chronic — there was something like 12% chronic illness among our children previous to that law, and there’s 54% now.", "A week before the MSNBC interview, Williamson used the same percentages to defend her position on vaccines over Twitter.", "Jonas Salk was a great scientist. The polio vaccine did and does save lives. The current controversy about vaccines is not about their inherent value. It’s about the rise in chronic illnesses (from 12% to 54%) among American children since the “Vaccine Protection Law” in 1986.", "— Marianne Williamson (@marwilliamson) July 24, 2019", "The law Williamson referenced is the National Childhood Vaccine Injury Act of 1986, which created the National Vaccine Injury Compensation Program. In the 1970s and 1980s, increasing litigation against vaccine makers led companies to withdraw from the market, causing concerns about the nation’s vaccine supplies as well as the ability to create new vaccines. In response, Congress established a no-fault legal system for vaccine injury claims and a compensation trust fund, financed with a 75-cent tax on every vaccine recommended by the Centers for Disease Control and Prevention for routine administration to kids. According to the latest figures, the government has paid out nearly $4.2 billion in compensation since 1988.", "But as we’ll explain, the fact that there have been compensation payments should not be viewed as an indictment of vaccine safety.", "Williamson’s description of chronic illness in children is also faulty and paints a misleadingly bleak picture of the health of the nation’s youth. The two percentages likely stem from datasets that use different and fairly expansive definitions of chronic disease; the results can’t be directly compared and don’t reflect the time points she gave.", "Several measures show a rise in reported chronic disease in children, though some of that may be due to changes in awareness and diagnosis, as we’ll explain. But the larger claim — that vaccines might have something to do with it — is not supported by science.", "The Williamson campaign did not explain the source of her percentages when we asked, but a prominent group opposed to vaccination, Children’s Health Defense, has also highlighted these numbers, which it pulled from two different studies.", "The 54% figure comes from a 2011 paper published in the journal Academic Pediatrics. The study, which was primarily focused on identifying differences in disease rates among children with private versus public health insurance, used responses from the 2007 National Survey of Children’s Health, a telephone survey that asked parents about the health of their children ages 0 to 17.", "The authors found that 43% of American children had at least one of 20 chronic health conditions, with the percentage rising to 54.1% “when overweight, obesity, or being at risk for developmental delays are included.”", "The lower number Williamson cited originates in a 2010 article published in the Journal of the American Medical Association, which followed three groups of children at different times for six years each to track the prevalence of chronic conditions over time. Chronic conditions included asthma, obesity, and a variety of physical or behavior and learning problems. Of the earliest group of kids, who were ages 2 to 8 when the study started in 1988, 11.2% began with a chronic condition, and 12.8% had a chronic condition at the end of the six years in 1994.", "On the most basic facts, then, Williamson is wrong that the 12% figure refers to a time period before the 1986 law, as the study did not begin until two years later. The upper-end number is also more than a decade old.", "But more critically, Williamson is comparing numbers that should not be compared. The two studies have completely different designs, use different definitions of chronic disease and have different study populations.", "As a researcher now working with Christina Bethell, the lead author of the 2011 paper, pointed out, the JAMA paper was “a prospective cohort study that followed 3 cohorts of children from ages 2-8 for 6 years,” while the Academic Pediatrics paper was “a cross-sectional study using a nationally representative sample of children ages 0-17.” The studies, she said in an email, are “not comparable.”", "And before parents panic, both studies — but especially the 2011 Academic Pediatrics paper — use rather broad definitions of chronic disease.", "The 54% of kids with a chronic condition in 2007 include children with asthma, environmental allergies, ADHD, chronic ear infections, kids 10 or older who are overweight or obese, and young children “at risk” for a developmental delay, among many others.", "Environmental allergies alone affected 24% of kids, while nearly a third of the older children were overweight or obese, and more than a quarter of the young children were considered at risk for developmental delay.", "While important to treat or monitor, many of these conditions aren’t that serious or will be outgrown. James Perrin, the senior author of the 2010 JAMA paper and a pediatrician and researcher at Harvard Medical School and MassGeneral Hospital for Children, noted that the high rates of disease in the 2011 paper are “really based on a lot of conditions that people really wouldn’t worry about.”", "Indeed, the same survey that researchers used to identify the 54% of kids with chronic conditions also found that 84% of parents described their kids’ overall health as “excellent or very good.” That finding has held steady from the first survey in 2003 through to 2011-2012.", "In the latest, revised version of the survey from 2016-2017, 89.8% of parents described the health of their children as “excellent or very good,” while 8.7% described it as “good” and just 1.7% described it as “fair.”", "One of the key findings of his paper, Perrin told us, was that in contrast to adults, chronic conditions in children are dynamic, and should not necessarily be viewed as permanent. Less than half of all kids in his study who started out with asthma or a behavioral or learning problem, for instance, reported it at the end of the study period.", "Even though her specific numbers don’t pan out, Williamson is right that there has been an increase in reported childhood chronic disease.", "Measuring rates of chronic disease in children, Perrin said, “is not simple.” There are many different ways of doing it, and one can get very different results depending on how strictly chronic illness is defined.", "As Perrin explained it, one method, which relies on Social Security disability criteria, uses a very limited definition, and usually only about 2% of children meet the criteria. Another method, which the 2011 paper reported along with the telephone survey results, considers whether children have special health care needs, which is usually around 15-18% of kids. A third way is to use a list of conditions, which typically results in an estimate between 10-25%, depending on the list. A fourth method is based on whether a child’s daily activities are limited, such as school-age kids not being able to go to school as regularly as they should, which is around 8-10%.", "Using that latter definition related to limitation in activity, which Perrin suggested as a better reference point for comparison purposes, only 1.8% of American children had a chronic condition in 1960, but by 2010, more than 8% of children did.", "These numbers mean it’s still a minority of kids who report having a significant chronic condition, in contrast to Williamson’s implication that over half do. But it is a steep increase.", "What explains the rise? Perrin said some reasons are known, while some are not, but the evidence for vaccines as a cause “doesn’t exist.”", "Perrin explained that most of the growth in chronic conditions has been in asthma, obesity, and mental health and developmental problems, primarily attention deficit/hyperactivity disorder and autism. And in each case, there is no evidence to support the idea that vaccines play a role.", "As we have written before, researchers have looked in study after study for a possible link to autism, and have turned up nothing. In 2004, the Institute of Medicine, the medical wing of the National Academies, concluded that the literature “favors rejection” of a causal relationship between the measles, mumps and rubella vaccine, and autism. In 2011, the group came to the same conclusion again. The CDC also states emphatically on its website that vaccines do not cause autism.", "As we have previously explained, it’s not even clear whether there is a real increase in autism prevalence, as the higher number of cases in recent years may result from more awareness and changing diagnostic criteria.", "That may also be true for ADHD. According to a 2007 JAMA article co-authored by Perrin, changes in diagnostic practices are “clearly one reason” for the rising number of cases. The disorder didn’t even appear in the Diagnostic and Statistical Manual of Mental Disorders until 1968, so parents long ago wouldn’t have known or been asked about it.", "As the Children’s Hospital of Philadelphia’s website explains, much of the concern with vaccines and ADHD was with the mercury-containing preservative thimerosal, which has since been removed from most childhood vaccines. Two large studies failed to find any association between thimerosal vaccines and development of ADHD.", "Scientists have also investigated potential links between vaccines and asthma or allergies. While a few studies have identified associations, others have reported that vaccines could have a protective effect, and many others find no effect.", "For instance, a 2002 study looked at the electronic health records of 167,000 children in four large health maintenance organizations between 1991 and 1997, and found no association between the oral polio, MMR, or diphtheria, tetanus and whole cell pertussis vaccine and the risk of asthma.", "The study identified a small increase in risk tied to the Haemophilus influenzae type b and hepatitis B vaccines. But at least some of that risk was explained by other factors, and subsequent studies have not replicated those findings.", "The bulk of evidence does not support the idea that vaccines are a risk factor for asthma or allergies, much less that they are behind a rise in those conditions. A 2008 paper in Expert Review of Clinical Immunology concluded that immunization programs “do not explain the increasing prevalence of allergic diseases and asthma.”", "Based on a review of the literature, the Institute of Medicine also determined in 2011 that the inactivated influenza vaccine likely does not make asthma worse for a period following immunization — something that initially seemed possible, but was refuted by multiple epidemiology studies.", "Finally, there is no demonstrated link between vaccines and childhood obesity, which has many causes, but is driven by diet and physical activity.", "Instead, scientists have reason to think that the apparent increase in chronic conditions is largely due to environmental exposures and changes in the social environment, including shifts in how kids spend their time.", "“Greater variation in adult supervision of young children, along with changes in children’s diets, level of physical activity, and media exposure (such as television, mobile technology, and connectedness via social media) have been implicated in growth” of asthma, obesity and mental health and neurodevelopmental disorders, explains a 2014 Health Affairs article dedicated to the subject.", "In the MSNBC interview, Williamson also referenced the National Vaccine Injury Compensation Program, or VICP, noting that “there have been $4 billion in vaccine compensation payments.”", "Her figure is correct. More precisely, as of Aug. 1, the program has paid out nearly $4.2 billion since its inception in 1988. But the seemingly high amount of compensation needs to be put in context — and does not contradict the idea that vaccines are, on the whole, safe.", "For one, compared with the millions of people who are vaccinated every year, the number of people who make claims is incredibly small, and the number of people who are awarded money is smaller still.", "Over VICP’s history, fewer than 21,000 petitions have been filed, and just over 6,700 have been compensated. According to the CDC, between 2006 and 2017, Americans received more than 3.4 billion vaccine doses, and just 4,408 people received compensation, or about one award per million vaccines. Far from being evidence of high vaccine risk, the number of payments demonstrates how rare vaccine-related injuries are.", "Even if someone receives an award for an injury, it doesn’t necessarily mean the vaccine was responsible. The program’s website explains that about 70% of paid claims are settled, meaning that the Department of Health and Human Services “has not concluded, based upon review of the evidence, that the alleged vaccine(s) caused the alleged injury.” Instead, it simply means that in the interest of time and litigation costs, both parties agreed to resolve the case.", "Other than a settlement, vaccine recipients can receive compensation by presenting their case in federal claims court, or by showing that they have one of the conditions current evidence suggests can be caused by vaccines, which are listed on the so-called Vaccine Injury Table.", "The table-based system is designed to err on the side of patients who suspect a vaccine-related injury, while weeding out spurious claims. An FAQ page for the program gives the example of someone who develops a severe allergic reaction within four hours of receiving a tetanus vaccine. If there is no other known cause of the reaction, then it’s assumed to be due to the vaccine.", "Given her central claim about childhood illness, Williamson’s $4 billion figure is also misleading because a majority of the payments have been paid out because of alleged injuries to adults, not kids. According to data provided to us by the Health Resources & Services Administration, adults account for 59% of filed claims and 62% of compensated claims between 1988 and August 2019.", "A large number of recent claims don’t even have anything to do with the vaccines themselves, but from vaccine delivery. Shoulder injuries can occur when vaccines are injected into the shoulder joint rather than the deltoid muscle, causing severe pain and limited range of motion. VICP data show that between fiscal year 2017 and August 2019, 52% of all claims allege a shoulder injury.", "Vaccines protect millions of people against dangerous diseases every year, and if they cause side effects, they are almost always mild, such as a rash or sore arm. Serious side effects, including severe allergic reactions, are rare. Williamson’s reference to the program’s total payments, while factually accurate, erroneously implies that vaccines are highly risky — a claim that’s not borne out by the data.", "Correction, Aug. 22: We initially misspelled Christina Bethell’s name.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]