["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "During the COVID-19 coronavirus disease pandemic in March 2020, U.K. Prime Minister Boris Johnson issued a set of movement restrictions intended to help stem the spread of the virus:", "Meeting friends, shopping for anything beyond essentials, and gathering in crowds are now banned.", "Police will be able to enforce the rules, and impose fines on people who do not abide by them. Authorities will force the closure of all shops selling non-essential goods, including hair and nail salons, and all markets apart from food markets. Also closed will be libraries, outdoor gyms and playgrounds, and churches or other places of worship. Hotels, B&Bs, campsites and caravan parks will also be closed, apart from to permanent residents or key workers. All public gatherings of more than two people will be banned, except if those people share a household. Also prohibited are all social events such as weddings and baptisms, although funerals will be permitted to take place.", "Some scammers took advantage of those restrictions to send out bogus text messages purporting to come from the U.K. government, warning recipients that they had been detected \"out of the house more than once\" (presumably through some undisclosed monitoring program). Recipients were to believe they were now subject to fines of up to £250 which would automatically be taken from their bank accounts, which could escalate to fines of £5,000 and arrest for repeated offenses. The messages like the one displayed above also included a phone number to call \"for any enquiries or to appeal.\"", "No government or law enforcement agency in the U.K. sent out any such text messages — they appear to be part of a scam to steal personal information, and recipients should not respond to them by calling phone numbers or clicking on links they contain. The West Mercia Police, for example, have advised as follows:", "Beware fraud and scams during the Covid-19 pandemic.", "The Government has only sent one text message to the public regarding new rules about staying at home to prevent the spread of COVID-19. Any others claiming to be from UK Government are false.", "Criminals are able to use spoofing technology to send texts and emails impersonating organisations that you know and trust. We would remind anyone who receives an unexpected text or email asking for personal or financial details not [to] click on the links or attachments, and don’t respond to any messages that ask for your personal or financial details.", "Walker, Peter.   \"UK Lockdown: What Are the New Coronavirus Restrictions?\"\r\n    The Guardian.   23 March 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]