["President Donald Trump speaks during a \"Salute to America\" event on the South Lawn of the White House, Saturday, July 4, 2020, in Washington. (AP Photo/Patrick Semansky)", "Based on identified cases, the CDC shows a cumulative case death rate of 4.5%", "About 4% of new cases require hospitalization.", "Doctors are beginning to see longer term impacts on patients who had mild cases that never sent them to the hospital.", "In a Fourth of July celebration with jets flying overhead and soldiers parachuting through the air, President Donald Trump minimized the threat of the coronavirus. With cases surging across many states, Trump said the latest numbers were promising.", "\"We have tested over 40 million people,\" Trump said July 4. \"By so doing, we show cases, 99% of which are totally harmless. Results that no other country will show, because no other country has testing that we have — not in terms of the numbers or in terms of the quality.\"", "\"Totally harmless\" is a strong term, and while people can debate the finer points of what represents harm, no definition backs up Trump’s 99% figure.", "We reached out to the White House and the Trump campaign for the underlying data and did not hear back.", "Death is the least likely outcome of catching this disease. If Trump’s figure was going to be right, it would show up in how many people the virus has killed.", "Counting deaths from COVID-19 is an inexact science, but no data source shows a rate lower than 4.2%, based on the numbers of identified cases", "According to the government’s tally at the Centers for Disease Control and Prevention, since the virus hit, there have been about 2.8 million cases. The death toll has reached nearly 130,000.", "That would produce a case death rate of 4.5%.", "Remember, researchers don’t know the number of people infected — only the confirmed cases. The infection tally would be larger than the number of identified cases.", "Some researchers expect the global fatality rate to come down, with the caveat that it will be higher for more vulnerable populations, such as the elderly and people with underlying health problems.", "Epidemiologists say we continue to learn more about COVID-19 and the damage it causes short of death.", "\"To cavalierly say that only 1% of infections result in problems is wildly inaccurate,\" said  Donald Thea, Boston University professor of global health. \"We are seeing reports of young people who have recovered from mild cases developing diabetes or blood clots and suffering from chronic fatigue, respiratory compromise, persistent fever or coming back with bacterial sepsis weeks later. There's too many reports of other organ damage that hints that there are possible long term serious implications.\"", "And that doesn’t speak to hospitalizations. By most standards, anything that sends someone to the hospital has done significant damage.", "Numbers from the COVID Tracking Project give some idea of the hospitalization trends. Unlike the cumulative death rate, this data gives a window into the number of hospitalizations that emerged out of each day’s newly identified cases. The rate has been falling since early June, when it was 8%. But it still sits at 4%, or four times higher than Trump’s 1% figure.", "Researchers agree that while counting the number of cases is important, one of the most important aspects of the coronavirus remains murky — how many people have been infected by the virus.", "This is very different from looking at the known cases, because it includes the people who never show symptoms. By one CDC estimate, the total could be 10 to 12 times higher than the number of identified cases. If deaths and hospitalizations remained the same, the threat of death and harm would fall dramatically.", "The problem is, Thea said, we lack reliable numbers to fill in any of those boxes. He expects the estimated number of infections to grow, but so will the estimated number of deaths.", "\"We’re undercounting those deaths by 20% to 40%, conservatively,\" Thea said. \"There is a year-to-year-stability in death rates. We’ve seen an enormous amount of excess deaths, and the large majority of the excess mortality is due to the infection itself.\"", "Trump said that 99% of all COVID-19 cases are totally harmless. The White House provided no supporting data.", "Looking at the worst possible outcome, the government’s numbers show a cumulative death rate of 4.5%, although the actual fatality rate could end up lower once we learn more about the disease", "The rate at which new cases lead to hospitalizations has fallen, but it still remains at 4%. And public health researchers note that more and more, there are reports that even people with mild cases are hit with medical problems after they’ve recovered.", "There’s a lot more to be learned about this disease, but nothing says that it’s harmless for 99% of the people it touches.", "We rate this claim False.", "White House, President Trump at the 2020 Salute to America, July 4, 2020", "U.S. Centers for Disease Control and Prevention, Weekly surveillance summary of U.S. Covid-19 activity, July 3, 2020", "U.S. Centers for Disease Control and Prevention, Cases in the U.S., July 5, 2020", "U.S. Centers for Disease Control and Prevention, Commercial Laboratory Seroprevalence Survey Data, June 26, 2020", "Covid Tracking Project, Data, accessed July 6, 2020", "University of Oxford, Our World in Data: Covid-19, July 6, 2020", "CNN, State of the Union, July 5, 2020", "Worldometer, Covid-19 by country, July 4, 2020", "Guardian, Think a 'mild' case of Covid-19 doesn’t sound so bad? Think again, July 6, 2020", "Nature, How deadly is the coronavirus? Scientists are close to an answer, June 16, 2020", "New York Times, Trump Falsely Claims ‘99 Percent’ of Virus Cases Are ‘Totally Harmless’, July 5, 2020", "Interview, Donald M. Thea, professor of global health, Boston University, July 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]