["A college student and climate activist interrupted U.S. Sen. Marco Rubio during a recent speech to question Rubio's ties to the energy industry.", "September Porras, a Swarthmore college student who is a member of the Sunrise Movement, a national group of climate change activists, challenged Rubio's links to fossil fuels at the Seminole County GOP fundraiser held at a hotel in Altamonte Springs on Aug. 22.", "Here is a partial transcript of the exchange:", "Porras: \"Senator, if you really care about young Americans, why did you take three-quarters of a million dollars from fossil fuel executives in your last Senate election?\"", "Rubio: \"I’m so glad I live in America where she can say that, in a lot of countries you go to jail, I am grateful that I live in America where ... (applause drowns out a few words) ... I don’t have a problem with protesters...\"", "Porras: \"I’m not a protester, I just want to know why you aren’t answering our questions.\"", "Rubio: \"I don’t have a problem with hecklers. I don’t have a problem with any of that. You know why? Because one of the issues I am working on now involves nations where that’s not possible,\" a reference to his work related to U.S. policy on Cuba and Venezuela. \"I am grateful that I live in a nation where people can disagree, I am grateful that I live in a nation where people get to vote every two to four years. I am grateful that I live in a place where people can speak their minds and they can settle their differences at a ballot box.\"", "Rubio then made a call for the United States to achieve energy independence:", "\"I believe as a cornerstone of allowing us to succeed economically we need to be able to power a 21st century economy, and I believe technological advances are making that energy more efficient and cleaner than ever before. I absolutely believe that America needs to be energy independent. We are crazy as a nation if we don’t utilize all of the resources that God’s blessed this great land with and I will continue to be a strong supporter of that.\"", "The part of the exchange we will fact-check is whether Rubio took three-quarters of a million dollars from fossil fuel executives during his 2016 Senate bid. We did not hear back from Rubio’s spokespersons.", "Porras told PolitiFact that she obtained the dollar amount from the Center for Responsive Politics, an independent clearinghouse for campaign finance data that publishes its data at opensecrets.org.", "The center’s data for the top 20 recipients of oil and gas donations during the 2016 cycle showed that Rubio received $753,201. That amount put Rubio in fourth place for oil and gas donations behind three other presidential candidates: U.S. Sen. Ted Cruz, Donald Trump and Hillary Clinton.", "Separately, the center compiled industry donations for the Florida Senate candidates in 2016. That analysis shows that Rubio received $524,877 from oil and gas. Rubio received more money from six other sectors, including retirees, security/investment and Republican/conservative.", "Over Rubio’s career as a federal candidate and politician between 2009-18, he has taken $1.1 million from oil and gas.", "(Porras cited Rubio’s oil and gas donations but coal is also a fossil fuel. The Center of Responsive Politics found Rubio got $48,800 from the coal industry in 2016.)", "Compiling Rubio’s donations during the 2016 cycle is complicated because he ran in two elections -- presidential and Senate. The Center for Responsive Politics provided PolitiFact with a more specific breakdown for his oil and gas donations:", "$339,194 - to his presidential campaign", "$207,500 - to outside groups that supported both his presidential and Senate runs", "$271,571 - to his Senate campaign and leadership PAC", "That adds up to $818,265. That’s higher than the other totals shown for Rubio because it is the center’s most up to date analysis.", "So the dollar amount cited by Porras is valid, but while she referenced Rubio’s \"last Senate election\" the amount she cited included some donations to his presidential campaign.", "Another caveat: Porras said that the donations to Rubio were from \"executives\" but the donations could be broader than that. The donations reflects contributions from any individuals who list their employer as an oil and gas firm as well as as corporations and unions who donate from their treasuries.", "However, the vast majority of money reported to the Federal Election Commission comes from executives, CEOs and PACs, said Sarah Bryner, research director at the Center for Responsive Politics.", "The donations don’t include external lobbyists who represent a whole host of interests, not just oil and gas, but it would include an in-house lobbyist for an oil company.", "Donations from the oil and gas industry have generally been increasing over the past decade, particularly in presidential cycles. The donations peaked at about $103 million in 2016, with about 88 percent going to Republican candidates.", "Rubio has previously called for the United States to become energy independent, and that includes the use of oil and gas. He criticized international climate efforts, as well as President Barack Obama’s regulatory measures.", "\"If you’re overly dependent on any one source of fuel, then you become vulnerable to disruption,\" he said at an event in January 2016. \"I want America to truly have a truly all-of-the-above strategy.\"", "A heckler said that Rubio took \"three quarters of a million dollars from fossil fuel executives\" during the 2016 Senate election.", "While the heckler was referencing Rubio’s Senate election, that amount also includes donations to his presidential race. That's an important distinction, because presidential fundraising tends to draw more donations. The figure comes from an analysis by the Center for Responsive Politics which found that Rubio received $753,201 during the 2016 cycle.", "We rate this claim Half True.", "Sunrise Movement, Medium post, Aug. 22, 2017", "Center for Responsive Politics, Oil and Gas top recipients, 2016", "Center for Responsive Politics, Florida Senate race top industries, 2016", "Center for Responsive Politics, Sen. Marco Rubio top industries, 2009-2018", "Center for Responsive Politics, Oil & Gas: Background, March 2016", "Center for Responsive Politics, Oil and Gas: Long-term contribution trends, May 2017", "Center for Responsive Politics, \"Clinton’s fossil fuel friends: Lobbyist bundlers brought in big money (but there’s an asterisk),\" April 2016", "Greenpeace, Fossil Fuel Funding of 2016 Presidential Candidates, March 21, 2016", "Waging Nonviolence, \"Meet the activists with a plan to make climate change matter in elections,\" June 20, 2017", "Orlando Sentinel, \"Rubio praises America at Seminole fundraiser,\" Aug. 23, 2017", "Washington Post Wonkblog, \"GOP platform highlights the party’s drastic shift on energy, climate,\" Aug. 30, 2012", "Tampa Bay Times, \"Rubio alters drilling debate,\" May 10, 2017", "Miami Herald Naked Politics blog, \"Rubio to Seminole County GOP: 'America is going to be OK,'\" Aug. 23, 2017", "Miami Herald, \"Inside Oval Office, Rubio and Diaz-Balart pushed Trump to crack down on Cuba,\" June 15, 2017", "Miami Herald, \"Powerful Venezuelan lawmaker may have issued death order against Rubio,\" Aug. 13, 2017", "PolitiFact Florida, \"Marco Rubio says oil spill fine money could go to Great Lakes and West Coast,\" March 22, 2012", "PolitiFact, \"Hillary Clinton gets 0.2 percent of campaign donations from oil, gas employees, Robby Mook says,\" April 19, 2016", "PolitiFact, \"Obama: None of the GOP candidates have climate change plan,\" March 1, 2016", "Interview, September Porras, Orlando resident, Swarthmore College student, member of Sunrise Movement, Aug. 25, 2017", "Interview, Evan Weber, member of political team of Sunrise Movement, Aug. 25, 2017", "Interview, Charlie Cray, Greenpeace researcher, Aug. 25, 2017", "Interview, Cassady Craighill, Greenpeace spokesperson, Aug. 25, 2017", "Interview, Alex Baumgart, Center for Responsive Politics individual contributions researcher, Aug. 25, 2017", "Interview, Brendan Quinn, Center for Responsive Politics spokesman, Aug. 25, 2017", "Interview, Sarah Bryner, Center for Responsive Politics research director, Aug. 25, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]