["The claims were published by an Australian-administered Facebook page here on October 14. The post has been shared more than 200 times.", "Text written above a photo of UK PM Boris Johnson (right) and his father (left) reads, in part: “Boris Johnson’s dad, Stanley, wrote a novel in 1982 called ‘The Virus’ about the government releasing a deadly Virus into the population as cover for population control through a forced vaccine.”", "The claims were also shared hundreds of times on Facebook, for example here, here, here and here.", "However, the claims are misleading.", "Stanley Johnson, the father of the current UK PM, Boris Johnson, did publish a book called “The Marburg Virus” in 1982, which was republished by HarperCollins owned imprint Witness Impulse this year.", "Contrary to the claims made in the Facebook post, after reading the entire novel AFP Fact check found no references to “the government releasing a deadly virus into the population as a cover for population control”.", "The book revolves around a fictional epidemiologist, Lowell Kaplan, who attempts to track down the source of an outbreak of the highly infectious and deadly Marburg Virus, after a woman dies from the pathogen in New York.", "Set around the time of its original publication in 1982 the book uses the Cold War tensions of the time as the driving force behind the narrative, pitting the US and USSR against each other in a race to control the main vector of the virus -- a group of African Green Monkeys.", "As Kaplan searches for the source, the outbreak worsens in the United States, resulting in \"fifty thousand suspected contacts in isolation\".", "In the book’s denouement, Kaplan and another character called  Stephanie Verusio, manage to secure documents on how to create a vaccine.", "The novel, however, stops short of detailing whether the vaccination program rolled out in the US is mandatory, as claimed in the Facebook post, with a character only later alluding to 200 million Americans receiving a dose.", "There is no mention of the virus being “released into the population” for population control, which refers to artificially controlling the size of a population, as claimed in the Facebook post.", "Population control is also not mentioned as a motive behind controlling the virus, also claimed in the Facebook post.", "At the end of the book it comes to light that the fictional US outbreak of the virus was an accident.", "The book is loosely based on the real outbreak of the Marburg Virus in Germany and Serbia in 1967. The original outbreak was linked to laboratory work using African Green Monkeys, according to the World Health Organization.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]