["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Alison Lundergan Grimes says in a new ad that Sen. Mitch McConnell, R-Ky., has forgotten that \"over half the voters in Kentucky are women.\"", "The proof? Grimes turns to Ilene Woods, an elderly Kentucky woman, who sums it up in a question for Mitch McConnell:", "\"Senator, why did you vote two times against the Violence Against Women Act and against enforcing equal pay for women?\"", "Silence.", "\"I can never get him to answer this one either,\" Grimes offers.", "Does Grimes’ evidence hold water? Let’s take a look at McConnell’s record on the Violence Against Women Act to find out.", "This is a case where the literal truth is still somewhat misleading (as FactCheck.org dutifully laid out in its own review).", "The Violence Against Women Act was introduced in 1990 by Joe Biden, then a senator from Delaware. The bill created federal penalties for sex crimes, provided federal grants to law enforcement agencies to combat crimes against women, created the National Commission on Violent Crime Against Women, aided victims of sexual assault, funded women’s shelters and changed how courts can weigh a victim’s past sexual experience in sexual assault cases.", "McConnell was one of just three Republican cosponsors of the bill, along with 22 Democrats. It was sent to a committee but never came up for a vote.", "Biden tried again in 1991. Support was building. This time, McConnell was one of 10 Republican cosponsors and 56 overall. But again, it didn’t make it out of committee.", "The bill was introduced a third time by Biden in 1993. This time, there were 67 cosponsors, but McConnell wasn’t one of them. (His campaign would not say why.)", "While the bill once again died in committee, the language of it was adopted into the Violent Crime Control and Law Enforcement Act, a $30 billion omnibus crime bill that was also sponsored by Biden. The bill won widespread bipartisan support, passing the Senate in 1993 on a 95-4 vote. McConnell joined the majority of the Senate in voting for it.", "The House bill also contained the Violence Against Women Act, but included as well a much more controversial assault weapons ban. This was opposed by a majority of Senate Republicans, including McConnell. It passed the Senate 61 to 38, with McConnell voting against it, and Clinton signed it into law.", "The Violence Against Women’s Act was twice reauthorized, once in 2000 and again in 2005, passing the Senate unanimously on each occasion. The 2005 reauthorization occurred under Republican control of the Senate (McConnell was in the party leadership at the time) and included additions such as enhanced penalties for stalking and programs for American Indian victims, according to the Congressional Research Service.", "Grimes’ campaign, though, pointed to more recent votes against the Violence Against Women Act twice. Indeed, in 2012 and 2013, McConnell opposed the measured put forward by the Democratically controlled Senate.", "What were his objections in reauthorizing a bill he had supported many times throughout the previous two decades?", "McConnell contended that Democrats added a number of contentious provisions in the legislation that Republicans, who backed the overall legislation, could not sign off on.", "Republican angst was centered on three new components:", "including victims of discrimination for sexual orientation and gender identity among \"underserved populations\";", "increasing the cap on U-Visas, a visa that grants nonimmigrant status to immigrant victims of domestic violence who assist police in prosecuting their attackers;", "allowing non-American Indian residents on tribal land to be prosecuted by tribal courts for domestic violence against Native women.", "In both 2012 and 2013, Republicans put forward their own legislation that reauthorized the Violence Against Women Act without these three elements. In 2012, McConnell voted for an amendment offered by Sen. Kay Bailey Hutchison, R-Texas. It failed 37 to 62. Later that day, the Senate passed the Democratic bill, but it couldn’t get through the GOP-controlled House.", "In 2013, the Senate again passed the Democratic measure. McConnell voted against the Democrats’ bill and for an unsuccessful amendment by Sen. Chuck Grassely, R-Iowa, that did not contain the provisions for LGBT victims, American Indians and immigrants.", "This time, the Senate bill passed the House, and President Barack Obama signed it into law.", "Our ruling", "Grimes’ ad claims McConnell twice voted against the Violence Against Women Act. The claim paints a very incomplete picture. McConnell supported the act repeatedly when it was first introduced and when it first passed the Senate in the early 1990s, and twice voted to reauthorize it. While he voted against the Democratic versions of the bill in 2012 and 2013 that included new provisions for sexual orientation, immigration status and tribal lands (and eventually became law), he voted for Republican measures that largely maintained the status quo.", "The statement is partially accurate but leaves out important details and context. Therefore, we rate it Half True.", "Alison Lundergan Grimes campaign ad, \"Question from Ilene,\" July 30, 2014", "FactCheck.org, \"Playing Politics with Violence Against Women,\" July 31, 2014", "Congressional Research Service, \"The Violence Against Women Act: Overview, Legislation, and Federal Funding,\" March 6, 2014 (obtained through the Federation of American Scientists)", "Congressional Research Service, \"The Violence Against Women Act: Overview, Legislation, and Federal Funding,\" May 10, 2012", "Govtrack.us, S. 2754 (101st): Violence Against Women Act of 1990, accessed Aug. 12, 2014", "Govtrack.us. S. 15 (102nd): Violence Against Women Act of 1991, accessed Aug. 12, 2014", "Govtrack.us, S. 11 (103rd): Violence Against Women Act of 1993,  accessed Aug. 12, 2014", "U.S. Senate, U.S. Senate Roll Call Votes 103rd Congress - 2nd Session Vote No. 295, H.R. 3355 Violent Crime Control and Law Enforcement Act of 1994, Aug. 25, 1994", "The Library of Congress, Bill Summary & Status 103rd Congress (1993 - 1994) S.1607, accessed Aug. 12, 2014", "U.S. Senate, \"Party Division in the Senate, 1789-Present,\" accessed Aug. 12, 2014", "Govtrack.us, H.R. 3244 (106th): Victims of Trafficking and Violence Protection Act of 2000, accessed Aug. 12, 2014", "Library of Congress, Bill Summary & Status 109th Congress (2005 - 2006) S.1197, accessed Aug. 12, 2014", "Congress.gov, S.1925 - Violence Against Women Reauthorization Act of 2012, accessed Aug. 12, 2014", "Congress.gov, S.Amdt.2095 to S.Amdt.2093112th Congress (2011-2012), accessed Aug. 12, 2014", "Congress.gov, S.47 - Violence Against Women Reauthorization Act of 2013, Aug. 12, 2014", "Congress.gov, S.Amdt.14 to S.47, accessed Aug. 12, 2014", "CQ.com, Member profiles: Sen. Mitch McConnell, accessed Aug. 12, 2014", "Email interview with Charly Norton, spokeswoman for Grimes, Aug. 11-12, 2014", "Email interview with Allison Moore, spokeswoman for Mitch McConnell, Aug. 11-12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]