["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lawmakers on both sides of the aisle agree: The IRS screwed up, big time, when it watched for phrases like \"tea party\" to trigger extra scrutiny of groups seeking tax-exempt status.", "But there’s a partisan disagreement over whether it was merely an ill-conceived time-saver for overworked Ohio staffers or a sinister White House plot to hamstring conservative groups before an election.", "(\"It's the IRS targeting-gate!\" said New York Republican Tom Reed.)", "Rep. Sander Levin, a long-serving Democrat who’s the ranking member of the Ways and Means Committee, said after a May 17 hearing that evidence is on Democrats’ side.", "\"My view is that the criteria were very inappropriate,\" he told MSNBC host Chris Matthews. \"There was terrible mismanagement. I think there was very terrible oversight. ...", "\"But the IG, the inspector general, when asked, Was there any political motivation for the people who were in the exempt organization in Cincinnati, the lower-level people who were working on this, he said no. Was there any outside influence? And he said no.\"", "The inspector general for tax administration is charged with independent oversight of the IRS.", "Did he say there was no \"political motivation\" or \"outside influence\" driving the agency’s inappropriate behavior?", "‘Inappropriate criteria’", "The latest round of congressional hearings — and there will be more — kicked off after the May 14 release of a mildly titled audit from the inspector’s office: \"Inappropriate Criteria Were Used to Identify Tax-Exempt Applications for Review.\"", "It asked whether the IRS:", "• Targeted groups applying for tax-exempt status.", "• Delayed processing of targeted groups’ applications.", "• Requested unnecessary information from targeted groups, such as donor lists.", "It found that Cincinnati employees did all of those things, beginning in early 2010.", "A \"determinations unit\" there reviews applications for tax-exempt status for various kinds of organizations — such as charities and nonprofit schools and hospitals.", "It ran into trouble with applications for 501(c)(4) status — a designation that allows a tax-exempt group whose primary activity is social welfare to engage in political activity without disclosing its donors. In theory, a group whose primary activity was actually political activity — such as supporting candidates for office —wouldn’t qualify.", "So IRS employees developed criteria to identify and group applications from organizations likely to engage in political activity for a deeper look. But regulations don’t define how to measure a group’s \"primary\" activity. So, according to the report, amid confusion, three \"inappropriate\" things happened.", "• For months, employees used phrases such as \"tea party,\" \"patriots,\" \"9/12\" and political-sounding names such as \"we the people, or \"take back the country\" to group applications for special review.", "The criteria got more generic in 2011, then more specific again in mid 2012, including \"political action type organizations involved in limiting/expanding government, educating on the constitution and bill of rights, social economic reform/movement.\"", "• Most of those applications languished for more than a year as employees sorted out how to handle them.", "• Then it sent lengthy, probing questionnaires to many applicants, requesting detailed responses, such as lists of all donations and donors, whether any leaders or donors had run for office or would in the future, and lists of all issues important to the organization and its position on those issues.", "The basic result was that while none of those groups had their applications denied, more than half of them waited more than 200 days — and some as long as three years, across two election cycles.", "Some are still awaiting decisions.", "Auditors asked various IRS leaders and employees in Cincinnati and Washington whether anyone outside the IRS influenced the \"inappropriate\" criteria. They found the opposite: that one problem was insufficient high-level oversight.", "\"Specifically, only first-line management approved references to the tea party,\" the report said.", "However, interviews with employees in the Cincinnati office didn’t turn up exactly who had been involved in creating the criteria, the report said.", "Inspector general", "Since the audit, lawmakers have repeatedly brought in the Treasury inspector general for tax administration, J. Russell George, to testify about the findings of his auditors.", "Levin’s staff pointed us to this exchange before Ways and Means, when the congressman asked George to clarify the audit’s results on outside influence and political motivation:", "Levin: On page 7, Mr. George, of the IG report it states and \"all of these individuals stated that the criteria were not influenced by any individual or organization outside the IRS.\" Is that correct?", "George: That is the information we received, correct.", "Levin: Did you find any evidence of political motivation in the selection of the tax exemption applications?", "George: We did not, sir.", "It’s important to note that George is careful to say that information gathered during the audit didn’t point to outside influence or political motivation — not that he was certain it had been ruled out.", "He was similarly careful in his responses that day to Rep. Jim McDermott, D-Wash., and later, Rep. Ron Kind, D-Wis.:", "McDermott: The inspector general report says that no one acted out of malice or political motivation. Mr. George, I want to know, do you still stand by that?", "George: We have no evidence at this time to contradict that assertion, sir. ...", "Kind: \"According to your report, you found no bias or partisanship behind the development and the use of the criteria for selecting applications in the Cincinnati office. Is that right?", "George: That is correct, sir, but we did find gross mismanagement in the overall —", "Kind: Right. And that's clear in your report, too. Did you find any evidence that anyone outside of the IRS was involved in the development and review of —", "George: Not at this time, sir.", "Kind: Not the White House or Treasury?", "George: That's correct, sir.", "Rep. Tim Griffin, R-Ark., pointed out that day that George’s office had conducted an audit, but not yet an investigation.", "\"There's a reason you don't know who came up with this. You didn't investigate that,\" he said.", "Indeed, George clarified for lawmakers in the days after Levin’s MSNBC interview that auditors didn’t ask directly about White House involvement, because no evidence pointed that direction.", "He also distinguished between an audit — designed to uncover systemic problems — and an investigation, which focuses on misconduct by specific people.", "\"It is not uncommon for audits to present specific issues that lead to additional reviews or investigations,\" he said.", "Our ruling", "Levin told Matthews on MSNBC that, \"the inspector general, when asked, Was there any political motivation for the people who were in the exempt organization in Cincinnati, the lower-level people who were working on this, he said no. Was there any outside influence? And he said no.\"", "That was the gist of George’s testimony the same day before the Ways and Means Committee, but with the important clarification that he was careful to explain that the assessment was based solely on evidence turned up so far by auditors.", "Levin offered no such caveat. We rate his claim Mostly True.", "CQ Newsmaker Transcripts, \"Reps. Levin and Reichert Interviewed on MSNBC,\" May 17, 2013, subscription only", "Email interview with Josh Drobnyk, communications director for Rep. Sander Levin, May 22, 2013", "Treasury Inspector General for Tax Administration, \"Meet the IG:  J. Russell George,\" accessed May 23, 2013", "Council of the Inspectors General on Integrity and Efficiency, \"Are IGs independent?\" accessed May 23, 2013", "CQ Congressional Transcripts, \"House Ways and Means Committee Holds Hearing on the IRS Tax-Exempt Investigation,\" May 17, 2013, subscription only", "Treasury Inspector General for Tax Administration, \"Inappropriate Criteria Were Used to Identify Tax-Exempt Applications for Review,\" May 14, 2013", "Washington Post, \"Watchdog probed potential Treasury, White House involvement,\" May 22, 2013", "Bloomberg, \"IRS Sent Same Letter to Democrats That Fed Tea Party Row,\" May 14, 2013", "PolitiFact, \"Tax code allows groups to spend on undisclosed donations on political campaigns, says Xavier Becerra,\" May 22, 2013 (Mostly True)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]