["The video was published on Facebook here on October 31, 2020. It has been viewed more than 1,800 times and shared more than 50 times.", "The post’s traditional-Chinese caption translates as: “This is a tornado in Toronto, Canada, it even sucked up 4 Boeing-747 airplanes from the airport to the sky, and many cars are flying in the sky as well! So scary!  China National Geography spent $1 million to buy this footage, don’t miss it!”", "The video was also published alongside a similar claim on Facebook here, here, here, here and here; on Twitter here, here, here and here; and on Youtube here and here.", "The claim, however, is false.", "A reverse image search on Google found the footage had in fact been taken from “Into the Storm”, an American film released in August 2014. Similar footage can be seen in the movie’s trailer here and a behind-the-scenes video here.", "Below is a screenshot comparison of the footage seen in the misleading posts (L) and the “Into the Storm” trailer (R):", "Below is a screenshot comparison of the footage seen in the misleading posts (L) and the movie’s behind-the-scene video (R):", "The misleading post was also debunked by the Taiwan Factcheck Center here on October 26, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]