["Susan Stimpson, former chairwoman of the Stafford County Board of Supervisors, recently announced her candidacy for the House of Delegates, challenging House Speaker William Howell in next year’s Republican primary.", "She said Howell, who has led the House since 2003, has abandoned conservatives.", "\"Bill Howell has been the consistent force behind every major tax increase in Virginia in the last decade,\" she said in a Dec. 2 news release. \"He has voted for them, he has engineered them and they are his legacy. Simply put, Bill Howell has lost his way and is the chief architect of a tax-and-spend agenda that rewards the politicians and punishes the middle class.\"", "It would be no small feat for Howell to be the force behind every state tax increase of the last decade and still manage to be re-elected as speaker every two years by the House’s Republican majority. So we examined Stimpson’s claim.", "Tim Edson, Stimpson’s spokesman, sent us vote records, news releases and articles that cover three major tax increase bills in 2004, 2007 and 2013. So let’s enter the Wayback Machine.", "2004", "Gov. Mark Warner proposed a $700 million a year tax increase to bolster education, public safety and health programs. The Senate went a few leaps further, adding transportation to the mix and approving a tax hike of almost $2 billion a year. Howell voiced opposition to both plans but never voted on them. The transportation bill was killed in the House Finance Committee.", "The tax standoff led to 115-day impasse in passing a two-year state budget. It was broken after moderate House Republicans crafted a compromise bill for a $615 million tax increase.", "The bill faced a major hurdle on April 6 when it came before the House Finance Committee. Stimpson points to articles in several newspapers the next day saying the legislation passed on a 10-8 vote after the Howell persuaded four anti-tax Republicans on the panel to skip the meeting. The speaker had been under pressure to allow the full House an opportunity to vote on the measure and, at the time, there appeared to ample votes to still kill it on the floor.", "A week later, however, the House approved the tax increase on a 52-46 vote when 17 rebellious Republicans joined forces with Democrats. Howell voted against the bill. The tax hike went on to pass the Senate and was signed by Warner.", "Howell would later strip three Republicans leaders of the tax compromise of some of their appointments to powerful committees and state commissions.", "2007", "Howell sponsored legislation to raise about $500 million a year for transportation, most of it by diverting funds that had helped pay for other services. But $158 million of the sum would come from raising fees on drivers and imposing heavy penalties on chronically bad drivers. The bill also gave Northern Virginia and Hampton Roads power to raise a combined $600 million more by establishing transportation commissions in their regions that would be authorized to raise taxes.", "Although the General Assembly approved the legislation, it had short-lived success. Less than a year later, lawmakers repealed the new penalties of bad drivers -- which could exceed $1,000 -- amid a public outcry. And the state Supreme Court struck down the regional transportation authorities, ruling that the legislature cannot delegate taxing power to unelected bodies.", "2013", "Howell sponsored a successful bill to raise about $750 million annually for transportation. Most of the money comes from a new tax on the wholesale price of gas, an increase in the state sales tax from 5 percent to 5.3 percent, and an increase in the motor vehicle sales tax from 3 percent to 4.3 percent.", "The bill also imposed a series of regional tax increases in Northern Virginia and Hampton Roads -- including an 0.7 percent sales tax hike -- to help the congested areas raise a combined $680 million a year for transportation.", "Howell said he carried the bill to improve the safety of Virginia roads and because he was concerned transportation problems could undercut Virginia’s ability to recruit new corporations and retain the ones already here. Half of the 66 Republicans in the House voted for the measure, which was also backed by then-Gov. Bob McDonnell, also a Republican.", "Matt Moran, a spokesman for Howell, reminded us there were several large proposed tax hikes that the speaker opposed. Indeed, records show that Howell either voted or spoke out against $1 billion-plus tax increases former Gov. Tim Kaine unsuccessfully sought in 2006, 2008 and 2010.", "Our ruling", "Stimpson says \"Howell has been the consistent force behind every major tax increase in Virginia in the last decade.\"", "She’s right on the transportation tax bills that were passed in 2007 and 2013. Howell sponsored the measures and encouraged fellow House Republicans to vote for them.", "There’s complexity to the speaker’s role in the passage of the 2004 tax increase for education, public safety and health programs. Howell consistently spoke out against the bill and voted against it.", "But the bill survived a hostile House committee because Howell persuaded four conservative allies to skip the vote. This was a political miscalculation by the speaker rather than a nod of support. Howell was under pressure to let the full House vote on the measure. He was outmaneuvered a week later when 17 Republicans joined Democrats to narrowly pass the tax hike. Howell retaliated by stripping leaders of the GOP revolt of some duties.", "So we find Stimpson’s statement accurate, but in need of this clarification: Howell was an unwitting force behind one of the tax increases.", "We rate Stimpson’s claim Mostly True.", "Susan Stimpson, \"Susan Stimpson Launches Campaign for House of Delegates,\" Dec. 2, 2014.", "Email from Tim Edson, spokesman for Susan Stimpson,  Dec. 4, 2014.", "William Howell, \"A long-term solution on transportation,\" Jan. 8, 2013.", "William Howell, \"House & Senate Pass Historic Transportation Plan,\" Feb. 23, 2013.", "Richmond Times-Dispatch, \"Warner calls special session; Tells legislators: ‘Stay in town and complete the work of the people,’\" Mark 17, 2004.", "Richmond Times-Dispatch, \"House to vote on tax bill -- Plan passes panel with four GOP anti-tax legislators on sidelines,\" April 8, 2004.", "Legislative Information System, 2004,  HB 5018, SB 635,", "Fiscal impact statement, 2004 HB 5018, April 2004.", "The Daily Press, \"House Makes Progress On Budget,\" April 8, 2004.", "Richmond Times-Dispatch, \"Lawmakers reach deal on budget; The $59 billion packages, likely to be approved by full Assembly tomorrow, ends record standoff,\" May 6, 2004.", "Richmond Times-Dispatch, \"Howell dumps GOP delegate from money panel; Bryant took leadership role in backing governor’s effort to raise taxes by $1.4 billion,\" Dec. 30, 2004.", "LIS, 2007 HB 3202 Fiscal Impact Statement.", "LIS, 2007 HB3202.", "Library of Virginia, \"Kaine Email Project @LVA -- Transportation Edition,\" Feb. 3, 2014.", "Howell, \"Statement of House Speaker William J. Howell regarding Governor’s Amendments to House Bill 3202, Transportation Reform and Funding Plan,\" March 26, 2007.", "Howell, \"A long-term solution on transportation,\" Jan. 8, 2013.", "Howell, \"House & Senate pass Historic Transportation Plan,\" Feb. 23, 2013.", "LIS, 2013 HB 2313 Fiscal Impact Statement.", "LIS, 2013 HB 2313.", "The Virginian Pilot, \"Abusive driver fees repealed, refund mechanism set up,\" March 28, 2008.", "Richmond Times-Dispatch, \"Warner calls special session; Tells legislators: ‘Stay in town and complete the work of the people,’\" Mark 17, 2004.", "Richmond Times-Dispatch, \"House to vote on tax bill -- Plan passes panel with four GOP anti-tax legislators on sidelines,\" April 8, 2004.", "Legislative Information System, 2004,  HB 5018, SB 635,", "Fiscal impact statement, 2004 HB 5018, April 2004.", "The Daily Press, \"House Makes Progress On Budget,\" April 8, 2004.", "Richmond Times-Dispatch, \"Lawmakers reach deal on budget; The $59 billion packages, likely to be approved by full Assembly tomorrow, ends record standoff,\" May 6, 2004.", "Richmond Times-Dispatch, \"Howell dumps GOP delegate from money panel; Bryant took leadership role in backing governor’s effort to raise taxes by $1.4 billion,\" Dec. 30, 2004.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]