["A video of Republic TV managing director Arnab Goswami has surfaced on social media where he can be heard saying – “Now operation elimination will start. We have to eliminate all these people. These traitors, the sloganeering brigade, you think we have not given you chance? We now need to have a tough military option. And I’m saying as a proud Indian, I am prepared for collateral damage. Kill thousands.”", "While millions of people in Kashmir are under a military siege, Arnab Goswami says, “As a proud Indian, I am ready for collateral damage….kill them…kill them in thousands”.", "Prime Time journalists in India are baying for the blood of Kashmiris. #StandWithKashmir", "Posted by Bhakton ka RADAR on Wednesday, 7 August 2019", "The video was first put out by a Twitter handle ‘With Kashmir (WithKashmir_)‘ but was later taken down (archive). It was shared with the caption – “While millions of people in #Kashmir are under a military siege, Arnab Goswami says, “As a proud India, I am ready for collateral damage.”", "The video was quote-tweeted by several journalists, including Rituparna Chatterjee and Abhinandan Sekhri. The former has now deleted her tweet. @WithKashmir_’s tweet was also retweeted by Anoo Bhuyan, Omar Waraich and Mahwash Ajaz.", "Actress Gauhar Khan referred to the contents of the video in a recent tweet.", "The video, while in context of Kashmir, was not broadcast after the government’s decision to deem provisions of Article 370 ineffective. It was broadcast on February 24 after the Pulwama attack where panellists debated on the topic – “Will Pro-Azadi Gang Unite Against Pakistan?”", "In the video below, Goswami can be heard saying at 1:07:47 onwards, “I am saying that we now need to have a tough military option and I’m saying as a proud Indian, I am prepared for collateral damage to take on terrorists within Jammu and Kashmir and their supporters because now operation elimination will start and we will have to eliminate all these people.” At about 55:12, he says, “Kill thousands, kill them,” with regard to stone-pelters in Kashmir. A little further into the debate Goswami suggests that the only solution for Kashmir is the use of force and strong military action. He also says that the sole fix for the problem of stone-pelters is to round them up, hold them by their hair and thrash them up.", "The video doing rounds on social media, while replete with hate-filled and provocative language, is not recent and was broadcast post-Pulwama attack.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]