["A Planned Parenthood of Wisconsin, Inc. clinic on South 7th Street in Milwaukee prepares to open in the morning on March 17, 2017. (Michael Sears / Milwaukee Journal Sentinel.)", "It’s hard to have a health care debate without mentioning Planned Parenthood.", "The organization has been caught in the middle of a years-long partisan battle over federal funding for the nonprofit organization, which is the largest abortion provider in the country.", "In August 2019, the U.S. Department of Health and Human Services issued rules that would bar health clinics from receiving any federal funding if they provide or refer patients for abortions with the exception of cases of rape, incest or a medical emergency.", "Several 2020 Democratic presidential candidates have already pledged to provide funding for Planned Parenthood if they’re in office.", "The organization, which has over 600 locations nationwide and 24 in Wisconsin, according to Wisconsin Public Radio, provides reproductive health care to patients, including those who are low-income or underinsured.", "In response to the Trump administration’s action, U.S. Rep Mark Pocan, D-Madison, sent out this tweet:", "\"In WI, over 79% of Title X patients rely on Planned Parenthood for their basic health care.\"", "Is Pocan right?", "Title X vs. Trump administration", "Let’s start with some background.", "Title X is a federal grant program that serves low-income patients or those who don’t have health insurance.", "It was first enacted in 1970 and signed into law by President Richard Nixon. The program distributes about $260 million a year in family planning grants.", "The program helps provide patients with cancer screenings, STD testing and annual exams for women, but it does not fund abortion care.", "Instead of complying with the new rules, Planned Parenthood decided to pull out of the federal program, saying that forcing Title X providers to stop referring abortions would be unfair to patients and limit their access to reproductive health options.", "According to the Guttmacher Institute, a research organization operating out of Washington D.C. and New York City that studies and advocates for the advancement of sexual and reproductive health and rights, Title X-funded providers serve about 3.8 million contraceptive clients.", "Of that group, 1.6 million are served by Planned Parenthood centers.", "The claim", "When asked for backup, Pocan spokesman Conor McCabe told us the congressman took the 79% figure from a Planned Parenthood graphic.", "Planned Parenthood told us the Wisconsin statistics came from the Democratic staff of the U.S. Senate’s Health, Education, Labor and Pensions committee.", "According to that research, there were 19 Title-X funded sites -- not limited to Planned Parenthood -- operating in Wisconsin in 2015. Collectively, the sites provided contraceptive care to nearly 31,000 women across the state.", "Planned Parenthood health centers served 79 percent of these women.", "That does not exactly close the case, however.", "Pocan’s claim said those patients rely on Planned Parenthood \"for their basic health care.\"", "That brings to mind such things as annual check-ups and flu shots.", "But Title X doesn’t cover any of that, according to the U.S. Department of Health and Human Services. The money is strictly for reproductive health care.", "\"Title X funds only cover services that prevent or help to achieve pregnancy,\" said Mia Heck, director of external affairs at HHS.", "Among the services covered: birth control, STD screenings, emergency contraception, breast exams, cervical cancer screenings and abortions.", "One can argue those are considered basic care when it comes to reproductive issues. But Pocan’s tweet used it more broadly, which was misleading.", "To be sure, Planned Parenthood does provide more general health care. Among the things it offers, according to its website: physicals, anemia testing and screenings for colon cancer, diabetes and cholesterol levels.", "Certainly some Title X patients may get general care at Planned Parenthood clinics. But that care is not paid for by Title X, as Pocan suggests.", "Our ruling", "Pocan said \"In WI, over 79% of Title X patients rely on Planned Parenthood for their basic health care.\"", "We found these numbers match data collected for a U.S. Senate committee, and used by Planned Parenthood itself. But Pocan’s claim was a bit off by framing the debate around \"basic health care.\"", "Title X funds are limited to reproductive health care issues, not such things as physicals, flu shots and other general matters for which people might see a doctor.", "Our definition for Mostly True is: \"The statement is accurate but needs clarification or additional information.\"", "That fits here.", "U.S. Department of Health & Human Services Family planning grant program, Feb. 22, 2019", "WPR, For Planned Parenthood Wisconsin, Title X funding ended months ago, Aug. 21, 2019", "Guttmacher Institute, Response to Inquiry concerning the impact on other safety-Tweet from Mark Pocan, Aug. 19, 2019", "NBC News, Nearly 900 women’s health clinics have lost federal funding over gag rule, Oct. 22, 2019", "Planned Parenthood, Facts and Figures", "E-mail exchange with Conor McCabe, spokesman for Mark Pocan, Aug. 20, 2019", "E-mail exchange with Andrew Everett, Planned Parenthood communications specialist, Oct. 30, 2019", "Senate HELP Committee data", "USA TODAY, Planned Parenthood rejects Title X funding over abortion rule: Here’s what that means, Aug. 21, 2019", "NPR, Planned Parenthood withdraws from Title X program over Trump abortion rule, Aug. 19, 2019", "U.S. Health and Human Services, HHS releases final Title X Rule detanet family planning providers of \"defunding\" Planned Parenthood, June 15, 2017", "The Capital Times, Planned Parenthood of Wisconsin leads lawsuit against proposed Trump administration family planning policies, May 2, 2018", "Vox, Planned Parenthood leaves federal funding program due to Trump administration rule, Aug. 19, 2019\nE-mail exchange with Mia Heck, Director of External Affairs at HHS, on Nov. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]