["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A tribute is displayed outside the store owned by one of 10 victims in the mass shooting at a King Soopers grocery store in Boulder, Colo., on March 24, 2021, in Boulder, Colo. (AP)", "Ahmad Al Aliwi Alissa’s brother told CNN that their family emigrated from Syria to the U.S. in 2002, before Barack Obama was president. Court records and Alissa’s Facebook page show that he was born in Syria in 1999.", "We don’t yet know the details of how Alissa’s family immigrated to the U.S. The Syrian refugee crisis began in 2011.", "After police announced the name of the man suspected of killing 10 people at a supermarket in Boulder, Colo., some people on social media started to paint him as a radicalized refugee.", "In a March 23 tweet, conservative activist Jack Posobiec cited an unnamed \"national security official\" to claim that Ahmad Al Aliwi Alissa came to the U.S. under the Obama administration.", "\"New information coming in that Boulder shooter was a Syrian refugee who arrived via Obama-era asylum programs, per national security official,\" Posobiec, a vocal supporter of former President Donald Trump, said in the now-deleted tweet, which has been reposted on Instagram and Facebook. \"Self-radicalized while in US.\"", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns Instagram.) We reached out to Posobiec for a comment, but we haven’t heard back.", "(Screenshot from Instagram)", "On March 22, a gunman walked into a King Soopers grocery store in Boulder, a college town northwest of Denver, and opened fire. Ten people were killed in the shooting, including one police officer. Police arrested Alissa, 21, in connection with the attack, during which he was injured.", "The Boulder Police Department and the FBI are investigating the shooting, and have not established a motive. So we wanted to take a closer look at Posobiec’s claim about Alissa’s background.", "The suspected shooter was born in Syria, but the best available information shows he did not move to the U.S. during the Obama administration. It’s unclear if he immigrated as a refugee.", "Alissa’s brother, Ali Aliwi Alissa, told CNN that their family emigrated from Syria in 2002. Before it was taken down, Ahmad Al Aliwi Alissa’s Facebook page also said he arrived in the U.S. that year, when Barack Obama, who became president in 2009, was still an Illinois state senator. Court records and Alissa’s Facebook page show that he was born in Syria in 1999.", "According to CNN, Alissa and his family had resided in Arvada, Colo., since 2014. The suspected shooter graduated from Arvada West High School in May 2018, the Arvada Press reported, before which he attended Denver South High School.", "We don’t yet know the details of how Alissa’s family immigrated to the U.S.", "However, the Syrian civil war began in March 2011, during which millions of refugees started to flee the country. The ensuing refugee crisis began nearly a decade after Alissa’s family emigrated from Syria. We reached out to Boulder police for more information, but we haven’t heard back.", "Posobiec’s claim contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Al Jazeera, \"Syria’s war explained from the beginning,\" April 14, 2018", "Arvada Press, \"Arvada resident is charged in King Soopers shootings,\" March 23, 2021", "Associated Press, \"Colorado suspect got assault weapon 6 days before shooting,\" March 24, 2021", "CNN, \"Here's what we know about the Boulder, Colorado, mass shooting suspect,\" March 24, 2021", "Facebook post, March 23, 2021", "The Guardian, \"Boulder shooting: 10 killed, including police officer, at Colorado supermarket,\" March 22, 2021", "Instagram post, March 23, 2021", "The New York Times, \"Colorado Grocery Store Shooting Leaves 10 Dead,\" March 22, 2021", "Snopes, \"Was Suspected Boulder Shooter a Syrian Refugee Who Came to US via Obama-Era Asylum Program?\" March 24, 2021", "Boulder County District Court, arrest warrant, accessed March 24, 2021", "U.N. Refugee Agency, Syria emergency", "U.S. Senate, Barack Obama", "The Washington Post, \"Suspect in Boulder shooting had previously alarmed classmates with violent outbursts,\" March 23, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]