["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic ex-congressman Alan Grayson is talking about the Taliban again.", "The first time -- when he not-so-subtly compared his opponent in the 2010 election to the Taliban -- didn't work so well. See, previous paragraph (i.e., ex).", "But Grayson is back, preparing to run for Congress after losing to Republican Dan Webster.", "In an e-mail to supporters (subject line: \"Iraq: I Did My Part\") on Sept. 1, 2011, Grayson wrote about the Commission on Wartime Contracting in Iraq and Afghanistan, which released its final report on prevalent waste and fraud among taxpayer-paid contractors in those countries. The bipartisan commission determined the U.S. government lost between $31 billion and $60 billion to waste and fraud as a result of ineffective oversight of contract spending.", "Grayson elaborated in his e-mail: \"In fact, $360 million of our tax dollars went straight to ... the Taliban. Wow. Who could have imagined that? Well ... me.\"", "The rest of Grayson's note details how he revitalized a Civil War-era law that allows people to file lawsuits in the name of the federal government, a move that attracted attention from the New York Times, Washington Post, CNN and Wall Street Journal (he included links). He wrote that he voted against the wars, was a vocal opponent of them while in office and provided breakdowns of the war's toll on taxpayers.", "His point? He did something against the wars.", "But did he also make a false claim? Of all his figures, his statement that the United States sent $360 million \"straight to the Taliban\" was the most striking.", "It didn't take long to turn up what he was talking about.", "Grayson was referencing an Aug. 16, 2011, story by the Associated Press that preceded the commission's in-depth report. The AP reported that an investigation by a military task force found that $360 million in taxpayer money meant to strengthen Afghanistan's economy ended up going to \"the Taliban, criminals and power brokers with ties to both.\"", "It happened through a process called \"reverse money laundering.\" The AP explained it like this: American money starts out clean as it is given to companies hired by the military for transportation, construction, fuel and other projects. But the funds become \"tainted\" -- landing in the hands of crime groups and the Taliban -- either by direct payments or through the network of subcontractors.", "The Taliban and insurgent groups only reaped a \"small percentage\" of this $360 million, an anonymous Kabul-based military official told the AP. Most of the money was lost to profiteering, bribery and extortion by criminals and power brokers.", "About half of the lost money stemmed from a large transportation contract called Host Nation Trucking, comprised of eight prime companies that hired nearly three dozen subcontractors to transport supplies to U.S. troops in Afghan bases. Those subcontractors then paid off insurgents or warlords who control the roads. The task force found that one of the prime contractors, HEB International Logistics, made direct payments to \"malign actors,\" the designation given to the network of corrupt Afghan government and business officials, criminals and insurgents.", "The work of the military task force ran \"parallel\" with the research of the wartime contracting commission, commission spokesman Clark Irwin said.  But the military's findings have not been publicly made available (at least as far as we can tell).", "The wartime contracting commission's report, however, is a publicly available document. That report does not peg a specific dollar figure on moneys lost to the Taliban and other criminal groups. It notes, however, that extortion of U.S. transportation and construction project money is the second-largest source of revenue for insurgent groups, behind the drug trade (pages 73-4).", "From the report: \"In Iraq and Afghanistan, U.S. funds have been diverted to insurgents and warlords as a cost of doing business in the country. In Afghanistan, insurgents, warlords, or other groups control or contest parts of the country. They threaten to destroy projects and harm personnel. The Commission finds it particularly alarming that Afghan subcontractors on U.S.-funded convoys, road construction, and development projects pay insurgent groups for protection.\"", "We asked the member of the commission who wrote that excerpt and an expert on the issue, University of Baltimore government contracting professor Charles Tiefer, for his opinion on Grayson's statement. There was no unclassified amount for money diverted to the Taliban until recently, Tiefer said, but the $360 million figure is credible based on information he gained while on a trip to Kandahar in March and the commission's conclusions.", "\"That figure is consistent with it being the insurgent's second-largest funding source,\" he said, noting that finding a precise number would be nearly impossible.", "Tiefer went on to compliment Grayson, saying he \"was among the first lawyers to discuss publicly the scale of contracting waste in Iraq -- I never talked to him but I read what he had to say -- so, I think he has more right than most congressmen to pronounce on this issue.\"", "Grayson, reached by e-mail, said he received further information on the subject from military briefings during his time in Congress, congressional delegation trips and several whistle-blower clients who worked for contractors in Afghanistan, \"none of which, unfortunately, I am allowed to share with you, except to say that the figure is corroborated,\" he wrote.", "Here's what we know: Grayson correctly quoted a figure from a national story about U.S. money being diverted to \"the Taliban, criminals and power brokers with ties to both.\" A member of the Commission on Wartime Contracting -- and an expert in the field of government contracting -- found this information credible based on extensive research.", "But Grayson's statement comes with two minor caveats. He said that tax dollars went \"straight to ... the Taliban.\" The process is actually more complicated and involved a type of money laundering. And the money went to bad actors other than the Taliban in some cases. Those are noteworthy clarifications and enough to rate Grayson's statement Mostly True.", "\"Iraq: I Did My Part,\" Alan Grayson e-mail, sent Sept. 1, 2011", "Commission on Wartime Contracting final report, issued Aug. 31, 2011", "\"Taliban, criminals get $360 million from US taxes,\" The Associated Press via MSNBC, Aug. 17, 2011", "\"U.S. military awards contracts in Afghanistan to get money away from insurgents,\" The Washington Post, Aug. 16, 2011", "\"U.S. trucking funds reach Taliban, military-led investigation concludes,\" The Washington Post, July 24, 2011", "Interview with Clark Irwin, Commission on Wartime Contracting spokesman, Sept. 9, 2011", "E-mail interview with Charles Tiefer, Commission on Wartime Contracting member and University of Baltimore professor, Sept. 9 and 12, 2011", "E-mail interview with Alan Grayson, Sept. 9, 2011", "\"'Malign' Afghans Targeted,\" The Wall Street Journal, Dec. 29, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]