["About this rating", "A spokesperson for The North Face confirmed to Snopes that the company did not fulfill a corporate order for Innovex, noting that each request is considered to ensure cobranded products are within “supply limits and consistent with our brand guidelines and values.”", "The North Face did not confirm whether the company denied the request on the basis that Innovex is an “oil and gas services company” as the latter's CEO alleged.", "Outdoor clothing company The North Face allegedly refused to fulfill a corporate clothing order to Houston-based oil and gas company Innovex Downhole Solutions due to concerns over the company’s environmental practices.", "The accusation was reported by retail and energy publications, as well as a number of local news affiliates around the U.S. On social media, some users pointed out the irony of the alleged refusal, citing the fact that some products made by The North Face contain materials produced by oil and gas companies.", "The North Face did not respond to follow-up questions from Snopes as to whether or not the company denied the request on the basis that Innovex is an “oil and gas services company” as its CEO alleged.", "A letter in response to The North Face decision was posted on LinkedIn by Innovex Downhole Solutions CEO Adam Anderson. In the post, Anderson said that he was “shocked and disappointed that a great outdoors brand… refused to sell Innovex 400 jackets because we are in the oil and gas industry.”", "“We recently contacted North Face to inquire about buying jackets with the Innovex logo for all of our employees as Christmas presents,” wrote Anderson in the four-page letter. “Unfortunately, we were informed that North Face would not sell us jackets because we were an oil and gas services company.”", "Anderson went on to accuse The North Face of \"virtue signaling,\" a term used to describe the public expression of opinions intended to demonstrate the moral correctness of the person expressing them.", "Samantha Wannemacher, senior manager of corporate communications for The North Face, sent Snopes the following statement:", "As the world’s largest outdoor apparel brand, The North Face recognizes our responsibility to be positive stewards of the earth’s resources and to protect the environment. We have a longstanding commitment to conservation, sustainability, and to the outdoor places our consumers love to explore.", "We consider each request for corporate branded merchandise to ensure any cobranded The North Face products are within our product supply limits and consistent with our brand guidelines and values. We investigate product requests to ensure they align closely with our goals and commitments surrounding sustainability and environmental protection. Each request is evaluated individually on its own merits, and we don’t share the results of those decisions for a few reasons, including to respect the privacy of those organizations.", "The North Face has a history of strong environmental messaging, including its commitment to making products by improving environmental performance and social responsibility in the supply chain. And while The North Face's parent company, VF Corporation, made a commitment to reduce some greenhouse gas emissions by 30% by 2030, it is true that the company has previously used petroleum-based materials in its products — particularly those that are waterproof — and continued to do so into late 2020.", "On one of the company’s Frequently Asked Questions pages, The North Face noted that its DryVent® waterproofing technology utilized a polyurethane coating — a polymer whose principal raw materials come from crude oil and natural gas.", "The North Face", "That being said, The North Face has made efforts to reduce its use of oil-derived polyurethane as it moves to waterproof materials made from natural castor oil from beans, which the company said reduces the use of synthetic components by half compared to traditional waterproof materials.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]