["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Poll workers sort out early and absentee ballots at the Kenosha Municipal building on Nov. 3, 2020. (AP Photo/Wong Maye-E, File)", "A number of old election controversies are roaring back to life amid the Wisconsin recount, including the question of votes cast by indefinitely confined voters.", "Voters who declare themselves in that category — and under state law it’s up to the voter — are able to cast an absentee ballot without having to provide a copy of a photo ID, which is otherwise required for voters.", "After President Donald Trump lost Wisconsin by 20,600 votes, his campaign requested a recount in Milwaukee and Dane counties — Democratic strongholds and the state’s two largest counties. On Nov. 20, 2020, Trump attorneys sought to discard any ballot from a voter who declared themselves indefinitely confined in Dane County.", "The county’s Board of Canvassers denied that request, but it was expected to also resurface in the Milwaukee County recount and later in court.", "State Rep. Joe Sanfelippo, R-New Berlin, raised a similar objection in a Nov. 9 statement, with an additional accusation.", "His release talked about the need for confidence in election outcomes and asserted \"a great number of irregularities have taken place leading up to and including this past Election Day that have breached the trust of the electorate.\"", "(For the record, election officials have reported no such irregularities, and a canvass has since confirmed the size of Trump’s loss to Democrat Joe Biden.)", "Sanfelippo then said this: \"Clerks in Milwaukee and Dane Counties colluded to (add) nearly 250,000 individuals to the ‘Indefinitely Confined’ voter list.\"", "Sanfelippo is effectively making two claims: That clerks added 250,000 people to this list and that they colluded in doing so. We’ll examine both elements.", "The crux of the controversy is who exactly can claim to be indefinitely confined, as we sit in the middle of an ongoing pandemic.", "The issue surfaced when Dane County Clerk Scott McDonell sent an email March 25, 2020, to the municipal clerks in his county saying this:", "\"During this emergency and based on the Governors Stay at Home order I am declaring all Dane County voters may indicate as needed that they are indefinitely confined due to illness.  This declaration will make it easier for Dane County voters to participate in this election by mail in these difficult times.\"", "McDonell then shared that email with every county clerk in the state. Milwaukee County Clerk George Christenson released a statement the same day saying voters there could do likewise.", "On March 27, the Wisconsin Elections Commission met and provided more detailed guidance on indefinitely confined status. The two key points:", "Designation of indefinitely confined status is for each individual voter to make based upon their current circumstance. It does not require permanent or total inability to travel outside of the residence. The designation is appropriate for electors who are indefinitely confined because of age, physical illness or infirmity or are disabled for an indefinite period.", "Indefinitely confined status shall not be used by electors simply as a means to avoid the photo ID requirement without regard to whether they are indefinitely confined because of age, physical illness, infirmity or disability.", "Christenson then issued revised advice, saying, \"It is very important to note that 'indefinite confinement' based only upon the Governor’s Safer at Home Emergency Order cannot be used to legally avoid the photo ID requirement.\"", "Also on March 27, the Republican Party went to court to block the Dane County advice that the stay-at-home order allowed anyone to claim they were indefinitely confined. Four days later the Wisconsin Supreme Court sided with the GOP.", "In a statement responding to that ruling, McDonell said, \"My intent at all times was to protect the safety of seniors afraid to leave their homes due to this pandemic.\" He said he simply attempted to follow guidelines from the commission.", "McDonell noted that letters were also sent to all voters who claimed that status in May, confirming whether they remained indefinitely confined.", "The indefinitely confined voter concept originates in a section of state statute that says this:", "\"An elector who is indefinitely confined because of age, physical illness or infirmity or is disabled for an indefinite period may by signing a statement to that effect require that an absentee ballot be sent to the elector automatically for every election. The application form and instructions shall be prescribed by the commission, and furnished upon request to any elector by each municipality. The envelope containing the absentee ballot shall be clearly marked as not forwardable. If any elector is no longer indefinitely confined, the elector shall so notify the municipal clerk.\"", "In others words, it’s up to the voter.", "The elections commission makes this explicitly clear in a May 13, 2020, memo, saying \"all changes to status must be made in writing and by the voter’s request.\" It noted clerks don’t have the power to remove anyone from the indefinitely confined list either, unless the voter requests it.", "So Sanfelippo’s claim about clerks adding voters to the list is misleading at best in that it implies decision-making power lies with clerks. Local clerks simply record the decisions made by voters.", "Sanfelippo and his staff did not return a phone call or emails seeking evidence for his claim, or information on where the 250,000 number came from.", "That figure may have been drawn from a MacIver Institute report that said about 250,000 people were listed as indefinitely confined in the days before the Nov. 3 election, including many who registered as such after the April election.", "Reid Magney, spokesman for the elections commission, said about 215,000 ballots were returned in the Nov. 3 election from voters listed as indefinitely confined.", "Since Sanfelippo didn’t respond to our requests for comment, we also don’t know exactly what he was referring to as collusion.", "McDonell said he was confused by the allegation.", "\"I guess I am not sure what is meant by collusion. I let all the county clerks in the state know what I was telling my municipal clerks, including Milwaukee,\" he said in an email to PolitiFact Wisconsin.", "Merriam-Webster defines collusion as a \"secret agreement or cooperation especially for an illegal or deceitful purpose.\"", "That’s a high bar to clear for Sanfelippo.", "There’s a big difference between a secret agreement for deceitful purposes and the communication we know of — an email that included not just two clerks but every clerk in the state.", "A March 26, 2020, memo from the nonpartisan Legislative Reference Bureau said it would be appropriate, consistent with elections commission guidance and \"simply a matter of public outreach\" for clerks to encourage people who are legitimately unable to vote in person to claim that indefinitely confined status, \"assuming the clerks make a good faith effort to determine if the voter understands his or her declaration.\"", "Sanfelippo said, \"Clerks in Milwaukee and Dane Counties colluded to (add) nearly 250,000 individuals to the ‘Indefinitely Confined’ voter list.\"", "Each element of this claim runs into issues.", "Clerks don’t determine who is on the list as this implies, they simply record which voters list themselves this way. They don’t even have the authority to remove someone from it.", "And we’ve seen no evidence of the boldest element of this claim, that some kind of collusion was involved. The two clerks did communicate, but as part of a larger group email. For our fact checks, the burden of proof is on the speaker, who refused to provide any evidence.", "We rate this claim False.", "Rep. Joe Sanfelippo, statement, Nov. 9, 2020", "Email exchange with Scott McDonell, Dane County Clerk, Nov. 18, 2020", "Email exchange with Brian Rothgery, spokesman for Milwaukee County Clerk George Christenson, Nov. 17-18, 2020", "Wisconsin Elections Commission, Guidance for Indefinitely Confined Electors COVID-19, March 29, 2020", "Wisconsin Elections Commission, Indefinitely Confined Absentee Request Confirmation Process, May 13, 2020", "Wisconsin Legislative Reference Bureau, memo, March 26, 2020", "Merriam-Webster dictionary, definition of collusion, accessed Nov. 20, 2020", "Wisconsin State Statute, 6.86(2)(a), accessed Nov. 20, 2020", "Milwaukee Journal Sentinel, Nearly 200,000 Wisconsin voters did not have to show a photo ID in the April election, May 26, 2020", "Milwaukee Journal Sentinel, Supreme Court bars Dane County clerk from telling groups of voters they don't need an ID to vote absentee, March 31, 2020", "Scott McDonell, email, March 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]