["A photo of Aamir Khan’s daughter Ira with a man has been shared with the claim that she eloped with her domestic help who hails from the Hindu community. Twitter user Sadhvi Mishra’s tweet promoting the claim was liked by 1,700 handles and garnered 557 retweets. (Archive link)", "अमीर खान जो हिन्दुओं को नीचा दिखाने हिन्दु नौकर रखा था उसकी बेटी इरा खान अपने हिन्दु नौकर को लेके फरार ..!! 😂 pic.twitter.com/QodPYfu7ZJ", "— साध्वी मिश्रा🙏🇮🇳 (@sadhvi00_6) February 24, 2021", "Another Twitter user @Chintu_is_back also shared this picture with the same claim. (Archive link)", "हिंदुओं को नीचा दिखाने के लिए आमिर खान ने हिन्दू नौकर रखा था 😊 इसी नौकर को लेकर उसकी बेटी इरा ख़ान फरार हो गई 🤣🤣🤣🤣🤣🤣🤣🤣🤣 pic.twitter.com/t2XJSeRYtK", "— चिन्टू पाण्डे (@Chintu_is_Back) February 25, 2021", "The image and accompanying claim have gone viral on Facebook and Twitter.", "This slideshow requires JavaScript.", "Alt News performed a reverse image search and found the photo in a Pinkvilla article dated November 26, 2020. It states that Aamir Khan’s daughter Ira is in a relationship with her fitness coach. The man posing in the photo with her has been identified as Nupur Shikhare, founder of ‘Fitnessism’. The two are reportedly dating.", "Shikhare shared the image on his Instagram profile on November 17, 2020. The post mentions that it was taken during Diwali.", "A post shared by Popeye ⚓ (@nupur_shikhare)", "We found that Ira Khan has also shared several pictures with Shikhare.", "A post shared by Ira Khan (@khan.ira)", "A photo of Aamir Khan’s daughter Ira with her fitness coach Nupur Shikhare, whom she is dating, has been shared with the false claim that she has eloped with her domestic help.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]