["Actress Saoirse Ronan attends the 90th Academy Awards on March 4, 2018. (AP)", "Ladybird actress Saoirse Ronan is the victim of an Internet death hoax.", "\"BREAKING: Irish superstar Saoirse Ronan dies after on-set accident in St. Lucia,\" said  the headline from St. Lucian Times, a website with no \"about\" page or social media accounts.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. The Irish-American actress is alive.", "Aside from that major fact error, there are many other inaccurate points in this post.", "The made-up story said that Ronan died following an on-set accident where she fell 20 feet off a balcony onto a concrete floor while filming her new movie Mary Queen of Scots in the Caribbean island of St. Lucia.", "But we found that the film was actually filmed in the United Kingdom, across various parts of England and Scotland, and not in St. Lucia.", "The article fabricated quotes by British film producer and co-chairman of the production company Working Title Films Tim Bevan, who is co-producing the film.", "A coroner named Bradley Cyril is also quoted as saying Ronan died at Beausejour Medical Center of blunt force trauma due to her fall, passing away shortly after being placed on a ventilator.", "We found a similar Beausejour Health Centre in Canada, but we did not find any facilities by the name of Beausejour Medical Center, and none in St. Lucia. Consequently, we couldn’t find anyone named Bradley Cyril who works as a known coroner.", "Also mentioned in the story are supposed injuries suffered by actress Charlize Theron, the \"irreplaceable star\" for Mary Queen of Scots. Not only is Theron injury-free, she is not in the film. The film is also under the production companies Working Title Films and Focus Features, not Good Universe.", "We rate this post Pants on Fire.", "St. Lucian Times, Breaking News: Irish superstar Saoirse Ronan dies after on-set accident in St. Lucia", "IMDB, Tim Bevan, accessed March 19, 2018", "IMDB, Mary Queen of Scots, accessed March 19, 2018", "IMDB, Charlize Theron, accessed March 19, 2018", "IMDB, Saoirse Ronan, accessed March 19, 2018", "Working Title Films", "Focus Features", "Deadline, Saoirse Ronan to play ‘Mary Queen of Scots’ in working title feature, Aug. 9, 2012", "IERHA Canada", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]