["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the Democratic race has tightened, the Hillary Clinton campaign has portrayed Sen. Barack Obama as inconsistent on abortion rights.", "\"In the Illinois state Senate, on issue after issue, my opponent voted 'present,' instead of yes or no. Seven of those votes were on a women's right to choose,\" Sen. Clinton said in a December 2007 speech in Iowa. In the days leading up to Super Tuesday on Feb. 5, 2008, several other groups repeated the charge against Obama via e-mails.", "The facts here are not in dispute. Obama did vote present on seven bills that attempted to restrict abortion. His defenders argue that it was a tactic to disrupt legislation that would be used against Democrats in swing districts.", "It's worth pausing here to explain what the \"present\" vote means. The Illinois Legislature allows members to vote \"yes,\" \"no,\" or \"present.\" Bills need \"yes\" votes to pass, so a vote of \"present\" counts the same as a \"no.\" Thus, Obama's \"present\" votes on bills seeking to restrict abortion counted the same as if he had voted \"no.\" All of the bills passed by in the Senate by sizable margins.", "The seven votes were on proposals that abortion opponents have successfully passed in other places. Two bills outlawed the late-term procedure that opponents call partial-birth abortion. Two bills required parental notification for minors seeking abortions. Three bills were for so-called \"born alive\" legislation, which require doctors to administer medical care to aborted fetuses that survive the abortion process in hopes that the fetuses can survive.", "No one questions that Obama opposed the seven pieces of legislation; indeed, he is mentioned in news reports from the time as being against several of the measures. Rather, Obama's critics say he ducked a \"no\" vote; supporters say it was a tactical move.", "Those interpretations seem to have split the leaders of the Illinois abortion rights movement.", "Obama should have voted \"no\" on those bills, said Bonnie Grabenhofer, president of the Illinois chapter of the National Organization for Women, which has endorsed Clinton.", "\"We think the way you talk about a bill and the way you stand up is important,\" she said. \"It was a strategy that allowed people to take political cover as opposed to talking about why the bill was a bad bill and clearly saying no.\"", "But Pam Sutherland, president and CEO of the Illinois Planned Parenthood Council, said Obama was helping advance a prochoice agenda by voting present.", "\"He always was going to vote 'no' on these bills. We needed to keep some of our moderate Democrats from voting yes, which is something you never want to happen,\" Sutherland said. By having a well-known supporter of abortion rights also vote present, it gave other Democrats cover, she said.", "Regardless of the interpretation of the \"present\" votes, Obama has received extremely positive ratings from organizations that promote abortion rights. Even Grabenhofer's organization, the NOW Illinois political action committee, endorsed Obama twice after the \"present\" votes. The group did not endorse in the U.S. Senate race in 2004, she said, in part because of the present votes.", "Steve Trombley of Planned Parenthood in Chicago has defended Obama's prochoice bona fides, even though Planned Parenthood has not endorsed in the race.", "\"Barack Obama has always been committed to a woman's right to choose. He has a 100 percent pro-choice voting record both in the U.S. Senate and the Illinois Senate,\" Trombley wrote in a statement posted on the Obama campaign Web site.", "\"I don't know why Illinois NOW has changed its opinion of Barack Obama since his record has remained the same and since his time as a state senator, he has only demonstrated a full and steady commitment to choice,\" Trombley added.", "Both Clinton and Obama have their supporters among the abortion rights movement.", "Clinton arguably has the bigger endorsements. She has been endorsed by the National Organization for Women and EMILY's List, an organization dedicated to electing prochoice women.", "Obama has some high-profile endorsements as well, such as Kate Michelman, former president, NARAL Prochoice America, who sided with Obama after John Edwards dropped out of the race. Obama also has the support of U.S. Rep. Rosa DeLauro, the first executive director of EMILY's List, who has publicly defended Obama as a strong supporter of abortion rights. We checked her statement\n\nhere\n\nand found it to be True.", "Two other large groups, NARAL Prochoice America and Planned Parenthood, are not endorsing. Planned Parenthood, however, has given both candidates 100 percent ratings for their records on abortion.", "We stipulate that there are clearly different interpretations of the significance of Obama's \"present\" votes. But there's no doubt he made them. So we find Clinton's statement to be True.", "Hillary Clinton campaign Web site,\n\nFact Check: Hillary's Iowa Remarks\n\n, Dec. 20, 2007", "Barack Obama campaign Web site,\n\nFact Check: Obama's strong prochoice record,\n\nJan. 8, 2008", "Illinois State Legislature,\n\nSB 230: Partial Birth Abortion Ban Act\n\n, 1997. Senate bill\n\npassed\n\n.", "Illinois State Legislature,\n\nHB 382: Partial Birth Abortion Ban Act\n\n, 1997", "Illinois State Legislature,\n\nHB 1900: Parental Notice of Abortion Act\n\n, 2001. Bill\n\npassed\n\n.", "Illinois State Legislature,\n\nSB 562: Parental Notice of Abortion Act\n\n, 2001. Bill\n\npassed\n\n.", "Illinois State Legislature,\n\nSB 1093:Law to protect Liveborn children\n\n, 2001. Bill\n\npassed\n\n.", "Illinois State Legislature,\n\nSB 1094: Bill to protect children born as result of induced labor abortion\n\n, 2001. Bill\n\npassed\n\n.", "Illinois State Legislature,\n\nSB 1095: Bill defining \"born alive\" defines \"born-alive infant\" to include infant \"born alive at any stage of development,\"\n\n2001. Bill\n\npassed\n\n.", "Chicago Sun-Times, \"Bill proposes care for fetus after abortion,\" March 31, 2001", "Chicago Sun-Times, \"Ban on partial-birth abortion clears panel,\" March 5, 1997", "Interview with Bonnie Grabenhofer, president of the Illinois chapter of the National Organization for Women", "Interview with Pam Sutherland, president and CEO of Illinois Planned Parenthood Council", "Barack Obama campaign Web site,\n\nSetting the Record Straight\n\n, by Steve Trombley, Feb. 5, 2008", "EMILY's List,\n\nHillary Clinton endorsement", "National Organization for Women,\n\nHillary Clinton makes history\n\n, Jan. 8, 2008", "The Huffington Post,\n\nWhy I'm endorsing Barack Obama\n\n, by Kate Michelman, Feb. 3, 2008", "The Associated Press,\n\nConnecticut Democrats endorse Obama for president\n\n, Feb. 2, 2008", "Planned Parenthood Action Fund,\n\n100% Prochoice Presidential Candidates\n\n, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]