["The photo was shared here in a Facebook post on January 6, 2020.", "The post’s Hindi-language caption translates to English as: “This mosque is on the platform of Old Delhi railway station, does anyone have the guts to demolish this mosque or authorities can only raze a Hindu temple? Guys, raise your voice.”", "Delhi junction railway station is located in the old part of Delhi.", "The caption is referencing the demolition of an “illegal” Hindu temple on January 4, 2021 by municipal authorities in Delhi following an order from the Delhi high court. It was reported by Indian English-language newspapers including the Hindustan Times and The Indian Express.", "The photo was also shared alongside the same claim on Facebook here, here and here.", "The claim, however, is false. The mosque in the photo is actually in Prayagraj Junction railway station in the city of Allahabad, which was renamed Prayagraj in 2018.", "A reverse image and keyword search on Google found the same image published here on a blog in 2013.", "The photo caption reads: “Mosque at Prayagraj railway station platform.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo on the 2013 blog post (R)", "Another angle of the same shrine at Prayagraj railway station can be seen here on Google Street View.", "Several photos have been uploaded on Google here of the same shrine, which is known as \"Line Shah Baba\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]