["About this rating", "In April 2016, many social media users encountered an image on Facebook headlined \"An American Classic Says Goodbye!\" which announced that the rights to the popular Dr Pepper soft drink had been bought up by Coca-Cola, who would be imminently discontinuing production of their new acquisition:", "After 131 years of quenching American's [sic] thirst, Dr. Pepper announces it will halt production in the Summer of 2016. Though sales have always remained consistent, Dr Pepper says it can no longer compete with other soda producers using cheaper ingredients. Rights to the recipe have been sold to Coca-Cola Corp who says they will stop production sometime during the Summer of 2016. Dr Pepper you will be truly missed by millions of Americans!", "There is no truth to this rumor.  The Dr Pepper soft drink brand is owned by the Dr Pepper Snapple Group; neither the drink nor its parent company has been acquired by Coca-Cola (or any other entity), nor has Dr Pepper Snapple Group announced plans to discontinue production or sales of their flagship product.", "Some Dr Pepper loyalists believed that the so-called \"Dublin Dr Pepper,\" which had been produced for 121 years at a bottling plant in Dublin, Texas (always using pure cane sugar rather than high-fructose corn syrup), was the best version of Dr Pepper out there, and that product is no longer available because the Dublin plant was forced to cease production of Dr Pepper. But that shutdown occurred back in 2012 and did not spell the end of overall Dr Pepper production (or even the cane sugar version of it).", "It is true that because Dr Pepper lacks the bottling infrastructure of other beverage giants,\nCoca-Cola owns bottlers in North America who produce and distribute both Coca-Cola and Dr Pepper products, but those two brands are, and always have been, owned by different companies.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]