["About this rating", "On 16 June 2017, The Onion published an article positing that WWE officials had killed a champion wrestler because a 7-year-old boy had wandered into his steel cage:", "INDIANAPOLIS — Saying they were left with no other choice given the imminent peril of the situation, World Wrestling Entertainment officials confirmed they were forced to kill one of their own stars Friday when a 7-year-old boy wandered into the steel cage enclosure of an aggressive wrestler.", "Beloved two-time WWE champion Big Show was reportedly shot dead after the emergency response team at the Indiana Farmers Coliseum made a split-second decision to take out the nearly 400-pound dominant male wrestler, who is said to have appeared aggravated and hostile, causing those present to fear for the small child’s safety.", "“Last night, after determining he posed a clear threat to a young boy who had entered the steel cage, we chose to end the life of one of our wrestlers,” said WWE spokesperson Chris Bellitti, who added that the security guards who opened fire had followed protocol, assessing the body language and vocalizations of the 45-year-old wrestler to evaluate the danger he presented. “It is a tragedy anytime something like this happens, but luckily we can say a child is alive today thanks to the swift and appropriate measures taken by our WWE staff.”", "This article was quickly circulated widely via social media by users who shared it as if it were a real news report. However, there was no truth to the tale, which originated with the venerable humor site The Onion, a publication widely known for its satire.", "In this case the Onion was spoofing such high-profile incidents as the fatal shooting of a gorilla named Harambe at the Cincinnati Zoo in order to rescue a three-year-old child who fell into the animal's enclosure.", "For background, here is why we sometimes write about satire/humor.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]