["“Masks violate OSHA 19.5% min. oxygen level,” reads a widely-shared image of text painted on a windshield, referring to the US Department of Labor Occupational Safety and Health Administration’s respiratory protection standards. Similar posts are available here and here.", "Many posts with the image, which has been circulating since at least June 21, 2020, also include a caption attributed to an “OSHA 10&30 certified” expert, claiming: “Everytime you put your (surgical) mask on you are breathing the germs from EVERYWHERE you went,” “CLOTH masks do not filter anything,” “Cloth masks trap this carbon dioxide... It actually risks health. !!!!!” and “N95 blows the virus into the air from a contaminated person,” and more. Experts say the post contains false and misleading information.", "Additional versions of this caption are available here, here and here.", "When the US Centers for Disease Control (CDC) in April began recommending people wear masks or cloth coverings to help stop the spread of the virus, President Donald Trump told reporters he would not follow the guidance.", "\"I don't think I'm going to be doing it,\" he said at the time.", "He subsequently refused to wear a mask in public -- a message taken to heart by many of his supporters -- until he visited the Walter Reed military hospital outside Washington on July 12.", "But when US infections topped four million on July 23, and Trump scrapped plans for next month's Republican convention in Florida, he produced a mask from his pocket and urged Americans to wear one.", "AFP Fact Check breaks down the claims in the social media posts below.", "\"Masks violate OSHA 19.5% min. oxygen level.. brain damage. headaches. high blood pressure. infection,” the image of the windshield reads. This is false; an OSHA spokeswoman told AFP by email that “OSHA generally recommends that employers encourage workers to wear face coverings at work… OSHA has made no determination about masks’ impact, if any, on oxygen levels.”", "OSHA defines an oxygen-deficient site as “an atmosphere with an oxygen content below 19.5% by volume” and notes that a “normal atmosphere contains between 20.8 and 21 percent oxygen.”", "The spokeswoman also said employers have discretion to determine whether workers should wear cloth face coverings in the workplace based on the specific circumstances.", "“Where cloth face coverings are not appropriate in the work environment or during certain job tasks (e.g., because they could become contaminated or exacerbate heat illness), employers can provide PPE, such as face shields and/or surgical masks, instead of encouraging workers to wear cloth face coverings.”", "More information on OSHA’s guidance about face coverings at work can be found here.", "Dr. Marissa Baker, director of the University of Washington’s Industrial Hygiene program, confirmed that masks worn in the workplace to slow the spread of COVID-19 should not pose an oxygen deficiency risk.", "Cloth masks are “plenty big to allow for the free flow of oxygen and carbon dioxide, while still small enough to capture some of the larger respiratory droplets that could contain COVID-19,” Baker said in an email.", "Regarding the poster’s purported “OSHA 10&30” certification, Baker explained that “someone who has an OSHA 10 or OSHA 30 is not affiliated with OSHA and doesn't necessarily have expertise to be making claims about respiratory protection. It means the person has taken a 10 hour and 30 hour training course.”", "The post caption claims “Cloth masks trap this carbon dioxide … It actually risks health. !!!!!” Experts say this is false.", "Baker explained: “Masks are actually porous enough to allow for the continued flow of gas, it is larger droplets (droplets that could contain a virus) that would be kept inside the mask. Carbon dioxide and oxygen can still flow through a mask. Therefore, the oxygen % inside the mask should be the same as outside the mask. Only if someone is in an oxygen deficient environment will they be breathing below the 19.5% minimum oxygen level.”", "Dr. Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas at Austin, confirmed that correctly worn masks allow airflow, and carbon dioxide does not accumulate. “These masks filter out particles; they do not prevent the exchange of air, oxygen and carbon dioxide,” Payne said in an email.", "“By now hopefully you all know CLOTH masks do not filter anything,” the post caption reads. Experts say this is false.", "Dr. Jonathan Karn, of Case Western Reserve University School of Medicine and director of the Cleveland COVID Task Force, pointed to a study that found cloth barriers to be beneficial in protecting mice from droplet spread.", "“It seems to be an extremely good bet that a cloth mask will limit transmission from asymptomatic people to people in their vicinity,” he told AFP by email, noting that a controlled population study has yet to be done, but adding: “The predominance of evidence is that masks limit virus spread.”", "And Professor Yuen Kwok-yung, one of the world's top coronavirus experts, told reporters last month: “It's very clear that the effect of masking the infected, especially when they are asymptomatic -- or symptomatic -- it's much more important than anything else.”", "\"Surgical Mask: these masks were designed and approved for STERILE environments… IF you come in contact with Covid and your mask traps it, you become a walking virus dispenser. Everytime you put your mask on you are breathing the germs from EVERYWHERE you went. They should be changed or thrown out every 20-30 minutes in a non sterile environment,” the post caption reads in part.", "Baker said this is misleading. While surgical masks are not intended to be worn more than once and are generally worn in a sterile operating environment, “once an operation starts the environment is no longer sterile -- there could be blood, other bodily fluids, etc. And the physician wearing the mask is breathing/coughing/sneezing into the mask. That is what a surgical mask is meant to protect against-- large droplets (the size of droplets that may contain coronavirus),” she said.", "She added: “Surgical masks do not need to be changed out every 20-30 minutes. They need to be changed when they are noticeably dirty or damaged.”", "“N95 masks: are designed for CONTAMINATED environments. That means when you exhale through N95 the design is that you are exhaling into contamination. The exhale from N95 masks are vented to breath straight out without filtration. They don’t filter the air on the way out…Ultimate Answer: N95 blows the virus into the air from a contaminated person,” the post caption reads.", "Karn said this is misleading. While it is true that some N95 masks have exhale valves and do not reduce virus spread very effectively, those recommended for frontline healthcare workers are unvented and are more effective at preventing spread.", "Baker agreed. “Masks (N95 or other) that have a one way valve, do allow for unfiltered air to be exhaled. For this reason, wearing this mask doesn't protect the people around you. Therefore, this type of mask is not recommended for COVID-19.”", "AFP Fact Check has debunked almost 550 examples of false and misleading information about the novel coronavirus, available here, as well as numerous mask-related claims, examples of which are here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]