["The stage during a rehearsal ahead of the first presidential debate between Republican candidate President Donald Trump and Democratic candidate former Vice President Joe Biden at Case Western Reserve University in Cleveland. (AP Photo/Julio Cortez)", "Fox News, whose host Chris Wallace is moderating the debate, said the claim is false.", "The evidence is hearsay from a conservative pundit who has spread misinformation before.", "In an article on his website and in a tweet, conservative radio host Todd Starnes said Joe Biden already knows what he’ll be asked in the presidential debate.", "\"Word on the street is that Joe Biden got tonight’s debate questions in advance,\" Starnes tweeted Sept. 29, the morning of the first debate between President Donald Trump and the Democratic nominee Biden.", "Word on the street is that @JoeBiden got tonight's debate questions in advance - per @KXEL1540", "There is no basis for the accusation.", "Fox News host Chris Wallace is the debate moderator and the network rejected the idea that anyone shared questions with Biden or his team.", "\"This is entirely false and any assertion otherwise is patently absurd,\" a Fox News spokesperson said in a statement.", "As evidence, Starnes cited a Sept. 24 interview with Jerome Corsi. Corsi, a conservative who has shared conspiracy theories himself gave no firm source. (PolitiFact has rated three of Corsi’s claims False and one Pants on Fire)", "\"The information I've just gotten, and I think it's mostly it's always been accurate, is that Joe Biden has been given the questions from Fox's Chris Wallace,\" Corsi said. \"He's being prepared on the exact questions, he's gonna be asked.\"", "On Sept. 22, Wallace released the topics for the debate. They include:", "The Trump and Biden records", "The Supreme Court", "COVID-19", "The economy", "Race and violence in our cities", "The integrity of the election", "Starnes’ tweet has over 25,000 likes, and other websites and Facebook users repeated his claim.", "Starnes denies making a statement of his own about Biden.", "\"We quoted verbatim from the report Mr. Corsi made to KXEL and we did so accurately,\" Starnes said.", "He said he had reached out to Fox News, and did not get a reply. When Fox News released a statement, he put that at the top of his website article.", "Starnes said Biden received debate questions in advance. Fox News host Wallace did release a list of debate topics, but no questions. Fox News said the claim is \"entirely false.\"", "The accusation is based on hearsay.", "We rate this claim Pants on Fire.", "Todd Starnes, tweet, Sept. 29, 2020", "Todd Starnes, Biden Has Been Given Debate Questions in Advance, Says Jerome Corsi, Sept. 29, 2020", "KXEL, Corsi interview, Sept. 24, 2020", "Factcheck.org, Baseless Online Claims Target Biden Ahead of First Debate, Sept. 29, 2020", "The Commission on Presidential Debates, Moderator Announces Topics for First Presidential Debate, Sept. 22, 2020", "Statement, Fox News, Sept. 29, 2020", "InfoWars, REPORT: JOE BIDEN HAS BEEN GIVEN TONIGHT’S DEBATE QUESTIONS IN ADVANCE, Sept. 29, 2020", "New York Times, Right-Wing Sites Falsely Claim Biden Got Debate Questions in Advance, Sept. 29, 2020", "Email exchange, Todd Starnes, Sept. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]