["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A provocative headline suggested beef between first lady Melania Trump and Hillary Clinton.", "\"Hillary Clinton furious at ‘special gift’ Melania Trump sent her from her hospital bed,\" said a May 17 headline on Any Politics, a website crowded with clickbait headlines.", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.)", "Trump underwent kidney surgery to treat a benign condition at Walter Reed National Military Medical Center on May 14. But there is no credible reporting to suggest she sent any gifts while at the hospital, nor that they sparked Clinton’s indignation.", "A sincere thank you to Walter Reed Medical Unit @WRBethesda & to all who have send good wishes & prayers! I am feeling great & look forward to getting back home @WhiteHouse soon.", "Another blog post claimed that President Donald Trump was planning to donate his kidney to his wife. That story was also made up.", "The story provides no evidence of the gift, and no major news outlets reported anything about it.", "The story did, however, get something right: the popularity of Melania as a baby name. The name came in fifth among the fastest-growing girls’ names, leaping from spot 1,650 in 2016 to 930 in 2017, according to Social Security data.", "But that doesn’t support the ridiculous headline.", "We rate this statement Pants on Fire!", "Jumboreport.com, Hillary Clinton Furious At ‘Special Gift’ Melania Trump Sent Her From Her Hospital Bed, May 17, 2018", "WhiteHouse.gov, Statement from the Communications Director about First Lady Melania Trump, May 14, 2018", "Twitter, @realDonaldTrump tweet, May 14, 2018", "Twitter, @FLOTUS tweet, May 14, 2018", "Huffington Post, Melania Is One Of The Fastest Rising Baby Names For Girls, May 11, 2018", "PolitiFact, No, Donald Trump isn't donating his kidney to Melania, May 17, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]