["About this rating", "Katrina Pierson was arrested for shoplifting in 1997, a circumstance she openly credits with turning her life around (and about which she has been very open).", "Pierson did not conceal information about her receipt of unemployment insurance benefits, and we found no evidence that Pierson continued to collect unemployment while working a paying job.", "On 13 August 2016 Donald Trump spokeswoman Katrina Pierson was the focus of the viral hashtag #KatrinaPiersonHistory over inaccurate statements she made during an appearance on CNN, prompting a groundswell of interest in resurrected rumors that Pierson was a \"shoplifter\" and a \"welfare cheat.\"", "Pierson's rise to social media infamy prompted intense interest into the longtime Texas tea party activist's work history, which was often condensed to reports that she'd once been arrested for stealing from a Texas J.C. Penney store, and that she collected unemployment insurance benefits while she was on the payroll of Senator Ted Cruz.", "The rumor about shoplifting was relatively well-established: Pierson herself openly discussed the incident during her early 2014 primary challenge for a U.S. House seat against incumbent Republican Rep. Pete Sessions:", "On and off the campaign trail, congressional candidate Katrina Pierson sometimes discusses the hardscrabble background that she says ultimately made her a conservative firebrand.", "The troubles in her youth, records show, included an arrest for shoplifting.", "In 1997, five days before her 21st birthday, Katrina Pierson, then named Katrina Lanette Shaddix, was arrested on a charge of theft of greater than $50 and less than $500.", "Pierson, who is running against Dallas Rep. Pete Sessions in the March 4 Republican primary, acknowledges the mistake. She told police then, and repeated recently, that she was talked into shoplifting by a friend.", "“Like an idiot, I went along for the ride,” Pierson said in a recent interview.", "According to a Plano police report, Pierson said she and the woman with her, Laura Elizabeth Nelson, told police they needed the clothes for jobs they were trying to obtain.", "Pierson told police she was “scared at first and did not want to go through with it.”", "Pierson exited the store with four items of clothing in a shoe box inside her shopping bag. They were valued at $168. The report said Pierson had her young son with her when the incident occurred ... Pierson, a tea party leader from Garland, said she knew her background would be open for scrutiny if she decided to take on Sessions, the powerful incumbent.", "The unemployment aspect of the rumor is harder to authenticate. Supposedly, Pierson was paid for working on Ted Cruz's 2012 U.S. Senate re-election campaign as an \"organizer\" or \"spokeswoman\" yet was also collecting unemployment benefits at that time.", "Pierson filed financial disclosure forms [PDF] covering the period from January 2012 to November 2013 and state that she received $11,440 from the Texas Workforce Commission (TWC) during that time. Pierson played some role in Senator Ted Cruz's 2012 U.S. Senate re-election bid (she was variously described as \"campaigning with\" Ted Cruz, being a campaign \"organizer,\" or serving as a campaign \"spokeswman\"), but it's unclear whether she received any compensation for that effort.", "Pierson's 2013 financial disclosure forms report no income obviously related to the Cruz campaign for 2012, and the listing of the $11,440 amount in the \"current year\" column suggests that she received the unemployment insurance compensation in 2013 (and not while working for the Cruz campaign in 2012).", "Pierson's LinkedIn profile shows that she worked at Florida-based ASG Software Solutions until December 2012, and her disclosure form states that she received over $100,000 in salary from that company in 2012, so presumably the loss of that employment (for which Pierson blamed Obamacare) was what qualified her for unemployment insurance benefits:", "“Not sure what the scandal is here,” [Pierson] told the Austin news website Quorum Report, which first reported the [unemployment] payments. “A single mom getting child support loses her job because of Obamacare and had unemployment.”", "ASG did not respond to calls to confirm whether it laid off anyone because of potential costs under the Affordable Care Act. A few weeks before the 2012 elections, owner David Siegel, a Florida billionaire, warned employees by email that he would have to consider layoffs if President Barack Obama were re-elected.", "Pierson lost her House bid against Sessions in March 2014 and began work for a Tea Party Super PAC in August 2014:", "After Pierson lost her primary challenge, she took a job as a spokeswoman for the Tea Party Leadership Fund, which has been described in media reports as a “scam PAC” for tactics that include spending unusually high percentages of its funding on overhead. “We all have to pay the bills, but for Katrina, there is no principle that she isn’t willing to abandon for the right price,” complained Matt Mackowiak, an unaligned Republican consultant from Texas.", "“What price is that?” responded Pierson. “Is there a price we can talk about, because I have worked my ass off at the grass roots since 2009 for zero dollars. It wasn’t until I started working for the PAC that I was being paid for my time.” One Cruz ally, speaking on the condition of anonymity to avoid alienating Pierson, pointed to her work for the PAC as the sort of affiliation that would make her unappealing to the senator’s campaign.", "In December 2015, GOP presidential candidate Donald Trump signed Pierson as his new national spokeswoman.", "It's true that Katrina Pierson was arrested for shoplifting in 1997, but she hasn't attempted to hide that information, openly discussing it in multiple interviews as an example of her dealing with difficult circumstances in her early life. Allegations that Pierson was a \"welfare cheat\" stem from claims that she was performing compensated work for Senator Ted Cruz's campaign while simultaneously receiving unemployment benefits in 2012, but we've found no evidence documenting such an overlap.", "Feldman, Josh.   \"Trump Spox Katrina Pierson: We Weren’t in Afghanistan Until Obama Decided to Go In.\"\r\n    Mediaite.   13 August 2016.", "Jeffers Jr., Groemer.   \"Pete Sessions Rival Katrina Pierson Says '97 Shoplifting Charge Helped Turn Her Life Around.\"\r\n    The Dallas Morning News.   14 February 2014.", "Schreckinger, Ben and Katie Glueck.   \"Trump's New Face.\"\r\n    Politico.   18 November 2015.", "Swartsell, Nick.   \"Pierson Disclosure Shows Jobless Aid.\"\r\n    The Dallas Morning News.   24 February 2014.", "Harvey Kronberg's Quorum Report.   \"Tea Party Challenger to Pete Sessions Criticized for Collecting Unemployment.\"\r\n    23 February 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]