["Alt News has received several requests to fact-check a video on WhatsApp (+91 76000 11160) and on our official Android application. The viral text with the video says, “If you are done with ridiculing corona, then watch this video from China and guess how dire the situation has turned… kindly stay alert [Transalted from *Corona* का मज़ाक़ उड़ाने से फ़ुर्सत मिल गयी हो तो *चीन* से आए इस विडीयो को देख ले ओर अंदाज़ा लगा ले की स्थिति कितनी गंभीर हे.. कृपया सावधानी बरते].” This video is primarily viral on WhatsApp.", "The video begins with people running away from a masked gunman inside a building. A few seconds later, we see a group of people watching as bystanders. Subsequently, one of the shooters flees while the other takes a civilian a hostage. Four men enter the premises and shot down the gunman. No civilian was injured. After this another scenario is shown where a suicide bomber blows himself up and a gunman takes civilians as hostages. Men dressed in military gear enter and take down the gunman. The camera shows a civilian who appears to be injured and close up of a dislocated leg. The video ends with Channel News Asia’s logo.", "On March 21, Alt News debunked a clip of hostage-taking scenario at Blaise Diagne Airport in Dakar, Senegal which was viral on social media with a similar claim. Keeping this in mind and the fact that the video ended with the logo of Channel Asia News, we performed a keyword search on YouTube and found the viral video.", "It was uploaded by Channel News Asia on October 17, 2019. The context of the viral video is in the description. The video shows a counterterrorism exercise conducted at Singapore’s Changi Airport, Terminal 3.", "Therefore, the social media claim associated with the viral video is false and misleading. The video is not from China nor it is related to coronavirus. It represents counterterrorism exercise at Singapore’s Changi Airport from 2017.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]