["About this rating", "Our readers inquired about the date of a gun purchase made by Atlanta spa-shooting suspect Robert Aaron Long. Long was jailed on suspicion of killing eight people in a shooting spree at area massage parlors on March 16, 2021. Six of the eight were Asian women.", "We received a number of messages asking if it was true that Long purchased a gun on the same day as the slayings. Some readers linked to or attached an image of this viral tweet from @DeaconBlues0:", "As of March 21, the tweet received well over 200,000 likes and 50,000 retweets.", "On March 17, Atlanta-based WSB-TV reported that Long purchased a 9mm gun on the same day as the spa shootings, March 16:", "Long purchased a gun on the day of the shooting.", "Officials said they found a 9mm in the car and believe that was the gun he used to carry out all the shootings. No other guns were found in his possession.", "Channel 2 investigative reporter Justin Gray confirmed with Big Woods Goods in Holly Spring that Long purchased a gun at the store the day of the shooting.", "The store’s attorney said they are cooperating with authorities and that “there is no indication of anything improper with the transfer.”", "We contacted Big Woods Goods in Holly Springs, Georgia. An employee referred us to attorney Matthew W. Kilgo. We confirmed WSB-TV's reporting that Long did, indeed, buy a 9mm gun at the store on the same day as the shootings, prior to the killings.", "Local police also confirmed the same-day gun purchase, according to The Associated Press.", "The AP story reported that firearm buyers in Georgia and a vast majority of other states can walk out of a store with a new gun in a matter of \"minutes\":", "If Georgia had required him to wait before getting a gun, lawmakers, and advocates say, he might not have acted on his impulse.", "“It’s really quick. You walk in, fill out the paperwork, get your background check and walk out with a gun,” said Robyn Thomas, executive director of the Giffords Law Center to Prevent Gun Violence. “If you’re in a state of crisis, personal crisis, you can do a lot of harm fairly quickly.”", "The purchase was a normal transaction at Big Woods Goods, a shop north of Atlanta that complies with federal background check laws and is cooperating with police, said Matt Kilgo, a lawyer for the store.", "“There’s no indication there’s anything improper,” he said.", "The article also cited an analysis that found waiting periods for gun purchases could lead to decreased suicide and homicide rates. However, the research was \"inconclusive\" on the impact delayed-gun purchases may have on mass shootings, such as the Atlanta spa shootings.", "The second part of the viral tweet from @DeaconBlues0 made a claim about voting in Georgia. \"You cannot register and vote on the same day in Georgia,\" the tweet read.", "This is also true.", "For example, the voter-registration deadline for the November 2020 election in Georgia was Oct. 5. Also, the deadline for the Jan. 5, 2021, Georgia runoffs was Dec. 7, 2020. While Georgia does not offer same-day voter registration, it is available in several other states.", "In sum, it was true that Long purchased a 9mm gun on the same day he was suspected of shooting eight people at area massage parlors, prior to the killings. It was also true that it's possible to purchase a gun in less than a day in Georgia but not to register to vote on Election Day.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]