["Amid the impeachment inquiry of President Donald Trump, a screenshot of a salacious fake tweet attributed to Monica Lewinsky is circulating on Facebook.", "The fabricated tweet makes it appear that Lewinsky, a central figure in the 1999 impeachment of President Bill Clinton for obstruction of justice and lying under oath, made a sexually suggestive comment involving Trump, oral sex and her interest in seeing Trump impeached. Clinton’s impeachment charge stemmed from a sexual harassment case, in which Lewinsky, then a White House intern, became famously intertwined following an independent council’s investigation into sexual encounters between Lewinsky and Clinton.", "The viral image in question displays Lewinsky’s real Twitter profile picture and handle. It makes it look like she authored a tweet time-stamped at 6:06 p.m. on Oct. 3, with 1,610 retweets and over 18,000 likes, that read:", "\"I’m willing to take one for (sic) team and give Trump a b****** in the oval office. Apparently, that’s the only thing that can convince Republicans to impeach.\"", "The screenshot was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "No, this is not a real tweet written by Monica Lewinsky.", "The fake tweet appears to have been created by Instagram user @electorotting — the handle appears in the upper right hand corner of the tweet’s image. A visit to that Instagram profile shows the Lewinsky tweet and several other fabricated tweets and other memes. The same person’s Twitter bio tells people to follow them on Instagram for \"original memes.\" In 2018, the user admitted to the Associated Press that he was responsible for creating a fake tweet made to look like it came from President Barack Obama’s verified account.", "PolitiFact reached out to @electorotting but didn’t immediately receive a response.", "There is no sign of the tweet on Lewinsky’s Twitter profile page. She tweeted multiple times on Oct. 3, but none mentioned impeachment or anything sexually suggestive.", "We also searched Lewinsky’s Twitter handle @MonicaLewinsky in the All My Tweets database, which compiles users tweets in a single webpage, and could not find anything from Lewinsky on Oct. 3 – as the screenshot shows – that references impeachment, Trump or oral sex.", "Another red flag demonstrating that the tweet is fabricated: An advanced Twitter search of its keywords came up with (almost) no results. For a viral tweet that has supposedly garnered thousands of retweets and likes, only one similarly-worded tweet from a user who isn’t Lewinsky showed up on the platform.", "We reached out to Lewinsky for comment, but haven’t yet heard back.", "We know enough, though, to rate this faux tweet Pants on Fire!", "Facebook post, Oct. 3, 2019", "History, President Clinton impeached, Dec. 19, 2018, updated Sept. 25, 2019", "Instagram, electorotting, Accessed Oct. 4, 2019", "Twitter, @electorotting, Accessed Oct. 4, 2019", "Associated Press, Obama did not tweet about using his birth certificate to buy Cheerios, Nov. 21, 2018", "Twitter, Monica Lewsinsky, Accessed Oct. 4, 2019", "All My Tweets, @MonicaLewinsky, Accessed Oct. 4, 2019", "Twitter Advanced Search, Oct. 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]