["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrats are trying to link Donald Trump’s incendiary statements about Muslims to comments by other Republicans in the presidential race.", "Democratic National Committee chairwoman and South Florida Rep. Debbie Wasserman Schultz bashed several GOP candidates, most notably fellow Floridian U.S. Sen. Marco Rubio, in a Dec. 9 interview on CNN.", "\"It's not just Donald Trump that has said that Muslims are unacceptable for admission to this country,\" said Wasserman Schultz, highlighting comments about refugees by former Florida Gov. Jeb Bush and New Jersey Gov. Chris Christie before turning to Rubio.", "\"Marco Rubio after the Paris attacks said not only that we should be considering internment, he actually suggested that maybe we should close down cafes and diners where Muslims gather, and in fact, compared them to the Nazi party,\" Wasserman Schultz said.", "Did Rubio actually say those things about Muslims?", "Our research shows Wasserman Schultz distorted Rubio’s recent TV interviews. We will explain each portion of her statement and why it creates an inaccurate picture of Rubio’s comments.", "Rubio has not called for internment of Muslims", "Even the DNC admitted the \"internment\" part of her attack on Rubio is completely inaccurate.", "Rubio has not proposed anything similar to the internment of Japanese Americans during World War II for Muslims.", "DNC spokesman Sean Bartlett claimed Wasserman Schultz had comments by Trump in mind during this part of her interview.", "In December, Trump told TIME magazine he wasn’t certain if he would have supported internment of Japanese during World War ll.", "\"I would have had to be there at the time to tell you, to give you a proper answer,\" he said. \"I certainly hate the concept of it. But I would have had to be there at the time to give you a proper answer.\"", "Trump told Morning Joe on Dec. 8 that he wasn’t proposing internment camps for Muslims. But in an interview on Good Morning America, he compared himself to President Franklin D. Roosevelt, who ordered the Japanese internment.", "\"What I'm doing is no different than FDR,\" Trump said. \"I mean, take a look at what FDR did many years ago and he's one of the most highly respected presidents. I mean respected by most people. They named highways after him,\" he said, referencing a highway in New York City named for the former president.", "When asked if he supports internment camps, Trump said no.", "These comments by Trump, however, don’t add validity to what Wasserman Schultz said about Rubio.", "Rubio on Muslim cafes and diners", "According to Wasserman Schultz, Rubio \"actually suggested that maybe we should close down cafes and diners where Muslims gather.\"", "Rubio did talk about closing down cafes in an interview Nov. 19 with Fox News’ Megyn Kelly, but Wasserman Schultz fails to mention a key qualifier. Rubio said any place should be closed down if it is a site \"where radicals are being inspired.\"", "In the interview, Kelly asked Rubio, \"Donald Trump is suggesting we may need to close mosques that have problems with radicals at the top. What do you say?\"", "Rubio replied, \"Well, I think we need to target radicalism. A lot of it is actually happening online, not simply in mosques. The vast majority of the mosques in America is not...\"", "Kelly asked: \"But the mosques piece is a controversial piece, so where do you stand on that?\"", "Rubio then said:", "\"Well, I think it's not about closing down mosques. It's about closing down any place. Whether it's a cafe, a diner, an internet spot. Any place where radicals are being inspired.", "\"And that we have — the biggest problem we have is our inability to find out what these places are because we've crippled our intelligence programs, both through an authorized disclosure by a traitor, in other words, [Edward] Snowden, or by some of the things that this president has put in place for the support even of some from my own party to diminish our intelligence capabilities.", "\"So, whatever facilities being used, it's not just a mosques. Any facility that's being used to radicalize and inspire attacks against the United States should be a place that we look at.\"", "Closing down any place if it is being used to \"inspire attacks\" is different from flat-out calling for shuttering cafes and diners simply because Muslims gather there.", "Nazi comparison", "The last part of Wasserman Schultz’s attack is that Rubio compared Muslims \"to the Nazi party.\"", "This is also a case of Wasserman Schultz twisting Rubio’s words out of context.", "Bartlett of the DNC pointed to Rubio’s interview with George Stephanopoulos on ABC’s This Week Nov. 15, the night after a Democratic debate. Stephanopoulos asked Rubio: \"You saw Secretary Clinton there did not want to use the words ‘radical Islam.’ What is your response?\"", "Rubio replied, \"I don’t understand it. That would be like saying we weren’t at war with Nazis because we were afraid to offend some Germans who may have been members of the Nazi party but weren’t violent themselves. We are at war with radical Islam, with an interpretation of Islam by a significant number of people around the world, who they believe now justifies them in killing those who don't agree with their ideology. This is a clash of civilizations. ... Of course all Muslims are not members of violent jihadist groups.\"", "Rubio was trying to use an analogy to suggest it would have been ridiculous to avoid using the word \"Nazis\" during World War II out of fear of offending some Germans who were members of the Nazi party.", "We emailed a spokesman for Rubio to ask if he had addressed this comparison again but did not hear back, and a Nexis search did not turn up other examples of him talking about this.", "Our ruling", "According to Wasserman Schultz, Rubio has said \"we should be considering internment\" of Muslims, and \"maybe we should close down cafes and diners where Muslims gather and in fact compared them to the Nazi party.\"", "Rubio has not called for internment of Muslims. This is flatly wrong. Her paraphrases about Rubio wanting to close Muslim cafes and diners and comparing Muslims to Nazis are at least missing context.", "But to suggest he wants internment of Muslims — to take away their freedom and rights in the United States and separate them from the rest of society — is a grave accusation that leaves listeners with a grossly misleading impression of Rubio’s statements.", "We rate her claim Pants on Fire.", "Washington Free Beacon, Youtube clip of U.S. Rep. Debbie Wasserman Schultz on CNN, Dec. 9, 2015", "Washington Free Beacon, \"Debbie Wasserman Schultz Claims Marco Rubio Advocated ‘Internment’ of Muslims after Paris Attack,\" Dec. 9, 2015", "MSNBC Rachel Maddow blog, \"Rubio faces leadership test and flunks,\" Nov. 20, 2015", "ABC, \"Donald Trump cites these FDR policies to defend Muslim ban,\" Dec. 8, 2015", "ABC This Week, Transcript of interview with Sen. Marco Rubio, Nov. 15, 2015", "Fox News The Kelly File, Transcript, Accessed in Nexis, Nov. 19, 2015", "MSNBC Transcript, \"Morning Joe\" Interview with Donald Trump (R), Presidential Candidate, Regarding Muslims in America and Homeland Security,\" Accessed in Nexis, Dec. 8, 2015", "The Hill, \"DNC walks back claim Rubio supports ‘internment’ camps for Muslims,\" Dec. 9, 2015", "The Hill, \"Rubio: We should close down ‘any place’ that produces terrorists,\" Nov. 20, 2015", "CNN Transcript, \"Trump: Parts of London, Paris Radicalized; Interview with Rep. Debbie Wasserman Schultz; Trump's Impact on Democratic Presidential Race; RNC Chairman Doesn't Agree with Trump,\" Dec. 9, 2015", "Washington Post, \"Harsh rhetoric toward Muslims,\" Accessed in Nexis, Nov. 20, 2015", "Interview, Alex Burgos, U.S. Sen. Marco Rubio campaign spokesman, Dec. 9, 2015", "Interview, Sean Bartlett, U.S. Rep. Debbie Wasserman Schultz spokesman, Dec. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]