["On March 16, Dr Devi Shetty, chairman and founder of Narayana Health, wrote an article titled ‘Save lives with Social Distancing: How to protect your family from coronavirus, primed to hit India like a bomb’ for the Times of India.", "Around March 18, a four-minute audio clip attributed to Dr Shetty has gone viral. The person in the viral clip says, “everybody who has the coronavirus or is suspected of it should not go to get tested.” There are also multiple videos of the viral audio clip available online. They show a still image of Dr Shetty while the audio plays over.", "Karnataka Medical Association, a verified Facebook page with close 30,000 followers posted (archive link) the viral audio clip. Since then it has been shared over 3,000 times. The video had a logo of Daijiworld Television.", "Fight against corona", "Very good message Kindly circulate", "Posted by Karnataka Medical Association on Wednesday, 18 March 2020", "On March 18, Twitter user @BoldMonk22 posted (archive link) the viral audio clip by Daijiworld Television. It got over 2,000 retweets.", "This is by far the best video pic.twitter.com/dXS09dDrxb", "— Bold_Monk (@BoldMonk22) March 18, 2020", "While the audio message is particularly viral on WhatsApp, it has also been shared on Twitter and YouTube.", "You can read the full transcript of the audio message below.", "“Hi guys, This message is specific for India. You see, in India we have a peculiar problem, everybody who has the corona virus or is suspected of it should not go to get tested. India has 1.4 billion people and the kits we have is less than 150,000 at this point of time, a very important point. So just giving you the gist of our discussion, so the coronavirus infection will be asymptomatic, or will be mild only like a respiratory virus and fever for 85% of the population. So anybody who has a flu or a cold, the first thing you do is isolate yourself and follow your symptoms. First you will have the contact with the virus. On day zero, you will just feel a little fatigued. On day three, you might have a mild fever with cough, and an itchy throat. Day four, a mild, headache, on and off. Day five, you might have some gastrointestinal symptoms like diarrhea or cramps, along with headache and your fever might be normal, or it might increase. Day six-seven, you will feel civil more body pain, headaches will reduce diarrhea might increase or might reduce and, but you will still have an upset stomach like loss of appetite like symptoms. Now here is what is very important now. Day eight and nine, most of your symptoms will reduce that is where you have to keep watching your symptoms will reduce to lower fever lower body pain, your energy will come. Only your coughs will persist with your runny nose, which means that you are somebody who has resisted the corona and have already formed resistance to it and your body is improving. Now you even you do not have to get tested for the covid virus because your antibodies have already formed. If somebody on day eight and day nine, instead of starting to feel better, see all of you have been sick with the flu so you know. You have to remember how it was. You know how it is, when you know that you’re improving from the flu. It is extremely important that you decide. You know if your flu is getting worse, even in a common flu. Like from a flu if it goes into a pneumonia you know what to do. So what you do is if you feel like it is going to worsen then improve, then you call the covered 19 helpline and go get it tested, because, because India has only 150,000 tests at this point of time we might be able to get a maximum of 1.5 million only. So we can not afford to test, everybody who is having just flu at three days or two days, it will become a disaster. So from the rotaries point of view, as educated informed citizens, I would advocate, all of you to wait follow the symptomatology which I gave you and if it is worsening only go to get yourself tested. Please do this. Testing should not be done as soon as you’re afraid. We do not have enough tests like now my hospital is struggling to get N95 masks. I have been telling for the last four months, India please don’t wear masks. Masks are scars now. Health workers do not have it so please do not waste the blood tests, also it will become a disaster for India. Thank you. Thanks for listening, hope it was informative guys. Please do the needful.”", "Narayana Health’s official Facebook page commented on Karnataka Medical Association’s post and pointed out, “Please note this audio clip is not of Dr Devi Shetty, Chairman and Founder, Narayana Health. It has been incorrectly attributed to him.”", "However, on March 13 when NDTV anchor Sara Jacob asked Shetty, “Is there a concern that we may be under-reporting the cases given the fact there are only 52 controlled testing centres in India?” He responded, “See, doing the tests extensively will not make much difference to the outcome. The strategy we have adopted is if you suspect that some particular person is positive then you assume he is positive and treat him that way. Rather than doing all the test… ok you have done the test it is proven that he is positive. What are you going to do? If it is a mild symptom, then we’ll ask him to go home and rest. Because 85% of the positive patients do not need hospitalization, so I’m not unduly worried about not doing the test in large number what is required, unlike other tests. No, but I’m very very happy with the way the government is responding in restricting the social interaction, and that everything depends on that.” You can watch the four-minute NDTV interview below, the above-mentioned exchange starts from 2:40 mark in the video.", "On March 19, The News Minute (TNM) filed a fact-check report debunking this claim. Dhanya Rajendran, editor-in-chief at TNM, had pointed out that this audio was viral on WhatsApp.", "Dr Devi Shetty office, in case you have heard that viral audio that tells people no need to test. “Somebody is circulating this message on WhatsApp in the name of Dr. Shetty and people are believing and forwarding without even thinking”. Stop fwding crap.", "— Dhanya Rajendran (@dhanyarajendran) March 19, 2020", "Similarly, several other Twitter users pointed out that the claim is false.", "To conclude, the viral audio clip leverages the goodwill of Dr Devi Shetty to spread misinformation about COVID-19. Narayana Health debunked the claim that the audio wasn’t recorded by Dr Shetty. The viral clip undermines the importance of getting tested for coronavirus.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]