["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On March 24, 2020, Business Standard News published an article positing that televangelist Pat Robertson blamed oral sex for the spread of COVID-19 coronavirus disease:", "Robertson Blames Coronavirus On Oral Sex, ‘Lady Chemicals’", "[...]", "During an appearance on “The 700 Club,” Robertson blamed the coronavirus on oral sex.", "“Some of these young uns are doing all kinds of unnatural things with their sex organs,” said Robertson. “When people do that, they transfer all kinds of chemicals from ladies’ private parts and that’s where I think the virus came from. We never had this kind of thing when I was coming up. But no one was committing oral sex back then.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "The Business Standard News is a satirical site designed to parody the 24-hour news cycle. The stories are outlandish, but reality is so strange nowadays they could be true.", "While the Business Standard News carries a disclaimer labeling its content as fiction, many people encountered this rumor on social media when a screenshot of the article was shared without any mention of its satirical origins. This false rumor received a viral boost when it was shared by celebrities Patricia Arquette and Chelsea Peretti.", "Televangelist Pat Robertson did not blame oral sex for the COVID-19 pandemic. The rumor originated with a satire article that was commenting on Robertson's penchant for linking catastrophes to perceived human failings.", "For background, here is why we sometimes write about satire/humor.", "Horton, Michael.   “Yes, Pat Robertson Blamed the Vegas Shooting on ‘Disrespect’ for Trump and the National Anthem.”\r\n    The Washington Post.   3 October 2017.", "Zajac, Andrew.   “Haiti Earthquake: Televangelist Pat Robertson Links Quake to ‘Pact with the Devil.'”\r\n    Los Angeles Times.   14 January 2010.", "Balfour, Hamish.   \"Robertson Blames Coronavirus On Oral Sex, ‘Lady Chemicals’.\"\r\n    Business Standard News.   24 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]