["Journalist Saurav Datta tweeted a screenshot of a Facebook post by Mangalore Voice (page), which said, “Meet the NIA judge Ravindra Reddy joining the BJP”. The message posted along with screenshot also reiterated the identical narrative. According to the message, former Judge Ravinder Reddy, who had resigned after delivering an acquittal for Swamy Aseemanand in Mecca Masjid blast case, has joined the Bharatiya Janata Party. the tweet was subsequently deleted and a clarification was issued for the same.", "Several prominent Twitter users including Sadanand Dhume, Nidhi Razdan, Raju Parulekar and Swati Chaturvedi had quote-tweeted Datta’s tweet with a similar narrative. Dhume’s tweet was retweeted by journalist Abhisar Sharma. However, at the time of writing the article, with the exception of Parulekar, they had all deleted their tweets and issued a clarification regarding the same.", "Feku Express, a Facebook page was one of the earliest to post the photo with a caption, “Meet the NIA judge Ravindra Reddy joining BJP who acquitted RSS leader – Swamy Aseemanand in Mecca Majid bomb blast.” At the time of filling the article, the post has already amassed close to 1,500 shares. It may be noted that the source quoted by Saurav Datta had also copy-pasted this Facebook post by Feku Express.", "Alt News found that neither the claim nor the photograph is true. Last October, former judge Ravinder Reddy had joined the Telangana Jana Samiti, which was part of the opposition alliance led by the Congres party during the 2018 assembly election. “Last month, Mr Reddy had expressed keenness to join the Bharatiya Janata Party (BJP), describing it as a “patriotic party”, and banners welcoming him into the party were put up at the state BJP headquarters here, but it did not materialise”, stated a report published by NDTV on October 14, 2018. Reddy, who was then judging for National Investigation Agency (NIA) cases in Hyderabad, had acquitted Swamy Aseemanad in Mecca Masjid blast case on April 16, 2018.", "Moreover, the photograph shared by multiple individuals and pages on social media doesn’t feature Ravindra Reddy. The man in a saffron scarf in the picture is former senior Congress leader, Ramdayal Uike, who had defected to BJP last year in October.", "Chhattisgarh polls: Senior Congress leader Ram Dayal Uike defects to BJP https://t.co/m2dqhcN5qp pic.twitter.com/eu2yy5Z5PK", "— The Wire (@thewire_in) October 13, 2018", "AAP MP Sanjay Singh also quote-tweeted a tweet by Sanjay Hegde with an identical narrative.", "क्या हमारी न्याय प्रक्रिया का मज़ाक़ नही है? जो व्यक्ति असीमानंद को रिहा करता है वो जज भाजपा में शामिल हो जाता है। https://t.co/BR2RI79ASO", "— Sanjay Singh AAP (@SanjayAzadSln) March 29, 2019", "Multiple prominent Twitter handles had tweeted a piece of fake news, which was based on a Facebook post, without doing their due diligence.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]