["The video was shared here on Facebook on February 27, 2020.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi caption translates to English as: “They have brought Kashmir to Delhi. They aren’t pelting stones but breaking India. Barkha, Ravish, DSouza, Rajdeep, Wire, Quint, Scroll, Rana Ayub, Arfa, NDTV will not show this. This isn’t an anti-CAA demonstration but but terrorism and it is being controlled from Rawalpindi. #DelhiBurns”.", "“Barkha, Ravish, DSouza, Rajdeep, Rana Ayub and Arfa” are a reference to well-known journalists in India – namely: Barkha Dutt, Ravish Kumar, Faye DSouza, Rajdeep Sardesai, Rana Ayyub and Arfa Khanum Sherwani.", "The phrase “Wire, Quint, Scroll, BBC and NDTV” refers to media organisations operating in India.", "CAA is an acronym for the Citizenship Amendment Act, a law passed by the Indian government on December 11, 2019. The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh and Pakistan, has been criticised as anti-Muslim and sparked nationwide protests.", "#DelhiBurns refers to the sectarian violence in India’s capital city in February 2020. At least 42 people have been killed in the capital following the clashes, as reported here by AFP on February 28, 2020.", "The 45-second video has been viewed more than 74,500 times after it was shared alongside a similar claim here, here, here and here on Facebook; and here, here, here and here on Twitter.", "The claim is misleading; the video shows anti-citizenship law protest in the Ahmedabad area of the Indian state of Gujarat in December 2019.", "A closer examination of the video found a shop front with the word “medicines” written in Gujarati. Below is a screenshot of the video with the sign circled in red by AFP:", "A keyword search found this longer, higher-resolution video which shows the same incident as is shown in the misleading posts.", "The longer video was published on the YouTube channel for local Indian television channel TV9 Gujarati on December 19, 2019.", "The video’s caption states: “Anti-CAA protest in Shah-e-Alam area, Protesters pelted stones on Police van.”", "Below is a screenshot comparison of the video in the misleading posts (L) and the TV9 Gujarati video (R):", "At the 0:08 mark of the video in the misleading posts, AFP identified another shop sign which reads “Famous Chicken Suppliers”.", "Below is a screenshot of the video with the sign circled in red by AFP:", "A Google search of the shop name found it is located here in the Shah-e-Alam area of Ahmedabad city, in the Indian state of Gujarat.", "The incident was also reported by other local media, including the India Today newspaper here and the news outlet The Lallantop here, both on December 19, 2019.", "According to this report by Indian newspaper Times of India published on December 22, 2019, local police arrested 64 people from the Shah-e-Alam area in connection with the clashes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]