["Then-candidate Donald Trump shakes the hand of a supporter during a rally in Charleston, W.Va., on May 5, 2016. (AP)", "At a rally in neighboring southwestern Pennsylvania, President Donald Trump trumpeted his wide 2016 presidential election victory in West Virginia.", "\"I won that one by 42 points -- 42 points -- West Virginia,\" Trump said during his Aug. 13 speech in Monaca, Pa.", "That would be a big win. Was his victory in the Mountaineer State that large?", "The Trump campaign pointed us to the official results on the website of the West Virginia Secretary of State, which showed that Trump won West Virginia with 68.63%, outpacing his Democratic opponent, Hillary Clinton, with 26.48%. The difference is 42.15 percentage points -- right in tune with what Trump said.", "West Virginia accounted for Trump’s second-widest margin of victory of any state, following Wyoming at 46.29%.", "The 2016 results were also the latest sign of the widening of the gap between Republicans and Democrats in West Virginia, a state where Democrats were once dominant.", "The following chart shows how Democratic margins of victory in the presidential race shrank between 1992 and 1996, then produced increasingly large Repubilcan margins of victory.", "As the Pew Research Center has noted, this pattern has coincided with the increasing alignment of national partisan politics on certain demographic factors, notably race, educational attainment and population density.", "Geographical areas that are less racially diverse, less college-educated and more rural have swung hard to the Republican Party in recent years, especially in federal-level elections. When Governing magazine recently analyzed all 50 states on these three demographic factors, it found that West Virginia had the strongest Republican-aligned demographics of any state.", "Trump said that in the 2016 presidential election in West Virginia, he won by 42 points. He’s correct; in fact, it was his second-widest margin in any state, trailing only Wyoming. We rate the statement True.", "Donald Trump, speech in Monaca, Pa., Aug. 13, 2019", "West Virginia Secretary of State, official election results, accessed Sept. 27, 2019", "U.S. Election Atlas", "Governing, \"7 States Where Demographics Haven't Determined Their Political Destiny -- Yet,\" Aug. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]