["A video of Amit Shah addressing the media is viral with the claim that the Home Minister asked the people of Delhi to not watch Aaj Tak because it supports the Aam Aadmi Party (AAP). In the video, Shah can be heard saying, “Aaj Tak has undertaken the agenda that AAP should win. Delhi’s people are with BJP. Aaj Tak channel wants AAP to win at any costs which is why Delhi’s voters should not trust any reports by Aaj Tak, don’t believe them…This is a straightforward allegation and I say inside the press conference that Aaj Tak’s agenda is to launch AAP and there is no greater example of yellow journalism.”", "[Translated from: “आज तक ने एजेंडा हाथ में लिया है AAP पार्टी को जितने का। दिल्ली की जनता BJP के साथ है। आज तक चैनल का एजेंडा है कि AAP पार्टी को कुछ भी करके जितनाना है। इसलिए आज तक के किसी भी समाचार पर दिल्ली की मतदाता भरोसा न करे, उसको माने ना। … जी सीधा आरोप है और मैं प्रेस वार्ता के अंदर कहता हूँ कि आज तक चैनल का एजेंडा है AAP पार्टी को लांच करने का। और इससे बड़ा येल्लो जर्नलिज़्म का कोई एक्साम्पल नहीं हो सकता।”]", "Twitter handle @RealHistoryPic tweeted the clip on January 25.", "सरकार की चाटूकारिता करते करते आज़तक के एंकरों की जीभ में छाले तक पड़ गए लेकिन बिकाऊ लोगों के साथ समस्या ये होती है कि मालिक को उनकी औकात बताने में दो मिनट भी नहीं लगते। (2020) @anjanaomkashyap @sardanarohit", "pic.twitter.com/CSCeJVJV7e", "— History of India (@RealHistoryPic) January 25, 2020", "The handle had reshared the video posted by @Dilsedesh.", "Home minister @AmitShah asks people of Delhi not to watch @aajtak this is being seen as great set back to @anjanaomkashyap and @chitraaum sad but true !! pic.twitter.com/cFYOABnM3J", "— Dilsedesh (@Dilsedesh) January 23, 2020", "Another handle @br_sharma_ also tweeted the same video.", "अमित शाह जी ने #आजतक चैनल को “आप” पार्टी का स्पष्ट समर्थक बताया ।#ShameOnAajTak pic.twitter.com/TJuntgXgeA", "— Bαℓяαм Sнαямα🇮🇳 FB💯% (@br_sharma_) January 19, 2020", "The clip has also been shared by a few Facebook users.", "Alt News performed an advanced search on Twitter with a combination of keywords and found several tweets sharing the video link.", "Here is an old tweet by Akhilesh Mishra, CEO of BlueKraft Digital Foundation.", "#AajTak is the worst case of yellow journalism in India: https://t.co/WdeeYSLH5z || Amit Shah in his blistering, frontal attack mode. 1/2", "— Akhilesh Mishra (@amishra77) January 24, 2015", "A further search led us to the complete video uploaded by BJP’s YouTube channel on January 23, 2015, with the title, “We will free Bihar from ‘Jungle Raj’: Shri Amit Shah: 24.01.2015.” The viral portion can be heard from 21:10 minutes.", "Bihar legislative elections were held during October-November in 2015. Shah’s conference in Patna was to “appraise the media of the work done by the government since it came to power.”", "A five-year-old video of Amit Shah accusing Aaj Tak of ‘Yellow journalism’ and asking voters to not believe the channel’s polls has been revived before the upcoming Delhi elections scheduled to be held on February 8, 2020.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]