["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Regarding how to respond to the COVID-19 pandemic, Tuberville did say once he “wouldn’t have a clue” and another time said, “I don’t know which way you go.”", "Tuberville has not laid out a plan for addressing the virus, though he has taken some positions on shutdowns and emergency aid, and the need to resume school and athletics.", "Sen. Doug Jones, an Alabama Democrat who could face an uphill battle for re-election against Republican Tommy Tuberville, is attacking the former college football coach as something of a know-nothing on a critical subject: the federal response to the coronavirus pandemic.", "Jones made the attack on Tuberville in an Aug. 7 interview with Alabama Public Television host Don Dailey.", "\"He’s never been challenged on the issues, Don, and that’s the key,\" Jones said. \"In April, he said on a radio show, when asked how he would handle the pandemic, he said he didn’t have a clue. Just right after the Republican nomination, he was asked the same question and he still said he didn’t have a clue.\"", "Jones also posted that clip from the \"Capitol Journal\" show on Facebook.", "Tuberville did say, in March, he \"didn’t have a clue\" on how to handle COVID-19 and in July said, \"I don’t know which way you go.\" He has not laid out a plan for addressing the virus, though he has taken some positions on pandemic-related shutdowns and federal emergency aid.", "Tuberville’s campaign referred us to statements he has made in support of sending children back to school and restarting sports.", "Tuberville, who had his greatest success as a football coach at Auburn University in Alabama, is making his first run for public office. He’s challenging Jones, who won a special election in December 2017 for the seat vacated by Republican Jeff Sessions, who became President Donald Trump’s first attorney general.", "The outcome of their Nov. 3 race could help determine whether Republicans keep a majority in the Senate, where they now control 53 seats. As of Aug. 17, the race is rated as \"lean Republican\" by the Cook Political Report.", "To back Jones’ attack, his campaign cited two Tuberville radio interviews.", "1. \"Wouldn’t have a clue\": Birmingham talk show co-host Matt Murphy asked Tuberville on March 19 if he agreed with the Trump administration on sending stimulus checks to people in response to the coronavirus pandemic.", "\"I’d have to look at it, Matt, because we don’t have the money, number one,\" Tuberville said, adding that it was unknown how many people would need the financial assistance.", "\"The unknown is what is so tough here and that's the reason, the decision's going to have to be made from just a group of people in the White House and hopefully a few people, people in the Senate and the House of making the decision for the people and take politics out of it.\"", "He added:", "\"The decision is basically two words. You’re either going to pay or you’re going to send people back to work, at the end of the day. And they know a lot more about the situation than we do. They’ve got all the facts and figures and they’re working around the clock. So, to make a decision from my standpoint, I wouldn’t have a clue. It’d be like putting a game plan together and not be around it and all of a sudden trying to call plays, not knowing what the defense does. You’ve got to know everything around you.\"", "2. \"Don’t know which way you go\": On July 17, Rick Burgess, co-host of a Birmingham show, raised COVID-19 and asked: \"What would be your approach to what’s going on?\"", "After saying that initially the pandemic might have been \"overblown to a point,\" and then making a reference to how Sweden responded, Tuberville replied:", "\"The thing you’ve got to remember — five, eight years ago, we couldn’t have done that; technology-wise, we couldn’t have shut the country down like we did. We didn’t have the Zooms and all those things that we could continue to work, and we would have just fought through it. I think that technology gives us an easier out in terms of saying, Shut everybody down.\"", "He added: \"I tell you, we’ve got to work through this. But I tell you, it’s an unseen virus. We know very little about it. We’re learning more about it. The previous administration just left us without any kind of medical supplies. President Trump’s had to dig deep. And boy, he’s taken a lot of hits. But I don’t know which way you go, at the end of the day, whether you’re right or wrong, or anything that you do with this. Because, we’ve got to just fight through it ourselves and mentally fight back.\"", "Tuberville has not laid out a plan for addressing COVID-19 and has sometimes downplayed its seriousness. He highlights 10 issues on his campaign website, including health care, but COVID-19 is not mentioned.", "In July, Tuberville raised funds and held face-to-face meetings in Washington, D.C., defying orders from the city that visitors from certain coronavirus hot spots quarantine upon arrival, the Washington Post reported. \"The D.C. Democrat mayor’s order specifically applies only to nonessential travel, and Coach Tuberville was not up there sightseeing,\" his campaign responded in a statement.", "But we found that Tuberville has expressed some opinions on the response to the pandemic, especially in the education and athletic contexts:", "For playing football, returning to school: \"We have to put our kids in a school — keep them protected, be socially responsible — but we need to get back to school and get back to normal life,\" Tuberville said Aug. 12 on Fox News. He also said college football should be played this fall: \"There’s nobody more protected than college athletes and high school athletes. They have doctors, they have ways to wash their clothes that get them disinfected.\"", "Against extending unemployment aid: Tuberville opposed extending a $600-per-week federal bonus on unemployment checks as being \"way too much.\" He said, according to an Aug. 6 AL.com report: \"We’re having people just sit out not working because they’re making more sitting around. We’ve got to go back to work.\"", "On investigating the origins of the virus: Asked about whether China should be investigated regarding the origins of the coronavirus, Tuberville said it should, according to a May 7 report from WPMI-TV in Mobile. He added: \"I trust President Trump to get us out of it, and everybody wants to start pointing fingers. We don’t need to point fingers until we get out of it, then we can hold whoever’s accountable, accountable.\"", "Tuberville’s campaign referred us to a July 23 radio interview it described as representative of statements Tuberville has made on COVID-19. On that show, Tuberville noted that the virus affects people differently, complained that medical experts such as Dr. Anthony Fauci have often been wrong about the virus, and said: \"If you need to wear a mask, wear a mask.\"", "He reiterated that kids need to return to school, perhaps with modifications for children or teachers who have health risks. \"These people make a lot of money, these superintendents and principals. They can figure out a way to make it safe for the teachers and the kids. We’ve got to get back to school and we’ve got to get back to athletics,\" he said.", "Our ruling", "Tuberville did say in March he \"wouldn’t have a clue\" about whether to make stimulus payments to Americans unemployed by the pandemic or to send them back to work. And in July, when asked what his approach to the pandemic would be, he said: \"But I don’t know which way you go, at the end of the day, whether you’re right or wrong, or anything that you do with this.\"", "Tuberville also has not laid out a plan for what he would do about COVID-19, but he has stated some positions, including that people should return to work and children should return to school.", "Jones’ statement is accurate, but needs additional information — our definition of Mostly True.", "Facebook, video (38:35), Aug. 10, 2020", "Email, Doug Jones campaign communications director Owen Kilmer, Aug. 27, 2020", "Interview, Tommy Tuberville campaign research consultant Gary Maloney, Aug. 27, 2020", "Alabama Public Television, \"Capitol Journal\" Doug Jones interview, Aug. 7, 2020", "SoundCloud, clip of \"Matt and Aunie\" show interview of Tommy Tuberville, March 19, 2020", "WPMI-TV, \"Tuberville and Sessions on investigating China and COVID-19,\" May 7, 2020", "AL.com, \"Tommy Tuberville says $600 unemployment boost ‘way too much,’\" Aug. 04, 2020", "WBMA-TV, \"Tommy Tuberville: $600/week unemployment benefit is too much,\" Aug. 6, 2020", "Jeff Poor Show, Tommy Tuberville interview (29:00), July 23, 2020", "Montgomery Advertiser, \"Alabama Senate candidates take sharply different approaches to rise in COVID-19 cases,\" June 26, 2020", "Washington Post, \"Tommy Tuberville, Alabama U.S. Senate candidate, defies D.C. quarantine order on fundraising visit,\" July 29, 2020", "Fox News, \"Tommy Tuberville insists college football be played this fall, says US must 'get back to normal life,’\" Aug. 12, 2020", "YouTube, \"Rick & Bubba\" show interview of Tommy Tuberville (10:00), July 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]