["By Angelo Fichera", "Posted on August 9, 2019", "A viral Facebook post claims that “not one Democrat called for gun control” after a 2017 shooting involving Republicans in Congress. While demands for legislative action were quieter, there were some.", "In the aftermath of many shootings, Democrats renew public calls for gun control, as they have in the aftermath of the recent mass shootings in Ohio and Texas.", "That demand was notably more tempered after a 2017 shooting that targeted Republicans during a congressional baseball practice in Alexandria, Virginia. The gunman shot and injured four people, including Louisiana Republican Rep. Steve Scalise, who was critically wounded.", "But it’s not the case, as a viral meme on Facebook claims, that “not one Democrat called for gun control” following the shooting.", "The day after the June 14, 2017, shooting, former Democratic Rep. Gabrielle Giffords — who was shot in the head in 2011 and advocates for gun control — wrote an op-ed in the Washington Post calling for lawmakers to address gun violence.", "“We know, as always, that no one law could prevent a shooting like this. But we also know that we must acknowledge a problem: an unacceptable rate of gun violence in this country,” she wrote. “And we must acknowledge that a deadly problem like this brings a responsibility to find solutions.”", "Virginia’s then-Gov. Terry McAuliffe, also a Democrat, said during a press briefing the day of the shooting that “we need to do more to protect all of our citizens.”", "“I have long advocated — and this is not what today is about — but there are too many guns on the street,” he said, according to the Richmond Times-Dispatch. A state gun rights group criticized McAuliffe for “[n]ever missing a chance to push his gun control agenda.”", "Democrat Dannel Malloy, the governor of Connecticut at the time, called the shooting “a reason why we need, quite frankly, and I’ll say it, saner gun laws in America.”", "Still, the response from gun-control advocates in Congress was noticeably quieter than it had been compared to other high-profile shootings — which some attributed to the politics of the situation. The shooter, who was killed by police, expressed anti-Republican views before the attack. Congressional leaders were taking efforts to demonstrate unity.", "The “tone was different than after past tragedies,” an ABC News article observed. “There appeared to be a sensitivity that it was not the appropriate time to fight with their colleagues over policy.”", "There were subtle references to the need for gun safety, though.", "“This kind of mindless violence must stop, and I’m dedicated to doing all I can to putting an end to these senseless tragedies,” Democratic Sen. Dianne Feinstein, of California, said in a June 14, 2017, statement. Feinstein routinely introduces measures to ban assault weapons.", "House Speaker Nancy Pelosi — who was the Democratic House minority leader at the time — held a press conference the day after the shooting, in which she referenced the people who “lose their lives to gun violence in America every day.  Within many families and communities across America, the anguish that we are feeling personally in Congress today is altogether too familiar.”", "Answering a question about political vitriol, Pelosi at one point referred to inaction on the issue.", "“I think our energy should be used in our thoughts and prayers for Steve Scalise and Mr. Mika, and that’s really where our hearts are right now,” she said. “It’s a question of gun safety that, you know, has never happened. Little babies, little children in kindergarten, were massacred and nothing happened.”", "Sen. Chris Murphy, a staunch supporter of gun control and Democrat from Connecticut, wrote in a June 15, 2017, Facebook post that “we are becoming massively desensitized to the carnage.”", "“What does it say about us as a country that we can so easily move on from such a seemingly cataclysmic event? Are we so jaundiced to gun violence and mass shootings that it only takes us twenty four hours now to revert back to business as usual,” he said.", "He then made clear that he would continue his push for gun control: “But after tonight’s game, I’ll get back to work. Because until the laws of this country change, the slaughter — and the risk of normalizing it all — won’t stop.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Feinstein Statement on Alexandria Shooting.” Press release, Office of Sen. Dianne Feinstein. 14 Jun 2017.", "Giffords, Gabrielle. “Gabrielle Giffords: We need courage to face our gun-safety problem now.” The Washington Post. 15 Jun 2017.", "“Law Enforcement Shares Findings of the Investigation into the June 14 Alexandria, Virginia Shooting.” Press release, FBI. 21 Jun 2017.", "Murphy, Chris. “I’m going to play baseball tonight.” Facebook. 15 Jun 2017.", "Parks, Maryalice. “Talk of gun control notably absent following Scalise shooting.” ABC News. 15 Jun 2017.", "Radelat, Ana. “Malloy: Baseball field shooting ‘reason why we need…saner gun laws.'” The Connecticut Mirror. 14 Jun 2017.", "“Transcript of Pelosi Press Conference Today.” Office of House Speaker Nancy Pelosi. 15 Jun 2017.", "Wilson, Patrick. “McAuliffe renews call for gun control measures following shootings of congressman, others in Alexandria.” Richmond Times-Dispatch. 14 Jun 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]