["President Donald Trump has repeatedly labeled CNN as \"fake news,\" but is it true that Sen. Bernie Sanders agrees with him? That was the message from Trump in an early-morning Twitter take.", "\"While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network,\" Trump tweeted Feb. 12. \"They said technical difficulties.\"", "While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network. They said technical difficulties!", "Trump is referring to CNN’s Erin Burnett’s interview with Sanders, I-Vt., on Feb. 10, a few days before his tweet.", "Trump’s tweet, however, mischaracterized the reality of the Sanders-Burnett exchange. His tweet echoes a post on InfoWars, a website that pushes conspiracy theories.", "Here’s what actually happened.", "Sanders and Burnett were discussing the news that Trump's national security adviser Michael Flynn called the Russian ambassador to the United States before the inauguration to discuss easing sanctions imposed by President Barack Obama in retaliation for interference in the election. Vice President Mike Pence and other Trump officials had said in media interviews that Flynn did not discuss the sanctions with Sergey Kislyak.", "A minute into the interview, Burnett played a clip of Trump responding to reporters’ questions on his plane about Flynn’s comments. Trump said, \"I don't know about that, I haven't seen it. What report is that? I haven't seen that, I'll look at that.\"", "After the clip, Burnett asked Sanders if it’s a \"problem\" that the president hasn’t seen the report. That’s when Sanders actually criticized Trump for his tendency to dismiss news outlets’ negative reports as fake news.", "Here’s the back-and-forth:", "Burnett: \"He says he knows nothing about it, hasn't seen any of these reports. Is that a problem?\"", "Sanders: \"Well, I don't know, maybe he was watching CNN fake news, what do you think?\"", "Burnett: \"You don't buy it?\"", "Sanders: \"That was a joke.\"", "Burnett: \"I know it was a joke. I'm saying, you don't buy what he said, obviously?\"", "Sanders’ audio cut out after Burnett acknowledged the joke, so CNN cut to commercial break.", "\"It looks like we've lost connection with Senator Sanders,\" Burnett said. \"So let's just try to get that back up. Do we have him back? OK. So what we're going to do is take a break, I don't want to waste our time, we only have the senator for a few minutes, we're going to take a break, we're going to come back and continue our conversation with Senator Sanders.\"", "Burnett picked up the interview after the break, going on for nine more minutes to ask Sanders about the administration’s contentious travel ban, the Republican plans to replace the Affordable Care Act and Trump’s attacks on Democratic Sen. Elizabeth Warren of Massachusetts.", "CNN reporters including Brian Stelter and Jake Tapper also shot back at Trump’s tweet misrepresenting the exchange.", "Untrue. Sanders was *criticizing Trump* for calling CNN \"fake news.\" You can see for yourself, all 11 minutes, here: https://t.co/qhtlb5Wo6Q https://t.co/AcwOiNHi0j", "From Michael Briggs, Senator Sanders’ Communications Director: “The Senator was clearly joking” https://t.co/OzMj8pkTlv", "Our ruling", "Trump tweeted, \"While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network. They said technical difficulties!\"", "Trump’s tweet distorted what happened when Sanders brought up \"fake news\" on CNN.  Sanders was actually criticizing Trump’s repeated outcries that CNN is a fake news source. His audio did go out after this joke, but the CNN host picked up the interview after a commercial break for about nine more minutes.", "Trump gave the inaccurate impression that Sanders was booted for calling CNN \"fake news.\" That’s not what happened. We rate this statement False.", "https://www.sharethefacts.co/share/3b173a27-53c4-4066-91b2-6991518ee78b", "Tweet, Donald Trump", "Tweet, Brian Stelter", "Tweet, Jake Tapper", "CNN transcript", "CNN, \"Bernie Sanders rips Trump (Entire interview),\" Feb. 10", "Email exchange, Steven Cheung, White House spokesperson", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]