["The video has been viewed more than 300,000 times after it was posted on Facebook on March 14, 2021.", "The post’s Tagalog-language caption translates in English as: \"Philippine tax reform programme gains admiration from the World Bank, and because of it the country’s economy is going stronger despite the pandemic.”", "The text headline superimposed on top of the video reads: “World Bank admires President Duterte”.", "The video circulated online amid surging Covid-19 infections in the Philippine capital of Manila, which prompted the government to impose targeted lockdowns and reintroduce night-time curfews.", "Officials in the capital Manila, where most of the new cases are detected, have been quarantining neighbourhoods in a bid to contain infection clusters while minimising the economic impact.", "Covid-19 restrictions have crippled the Philippine economy and left many people hungry and out of work, AFP reported.", "“Tax reform” refers to the law President Rodrigo Duterte signed in December 2017 which aimed to raise funds for his massive spending programme for new roads, railways, ports and airports.", "Comments to the video indicate some people had believed the news report is recent.", "“This government has enacted projects despite the pandemic where previously it’s all corruption, even the World Bank admires President Duterte,” one comment reads.", "An identical video was also shared alongside a similar claim here and here on Twitter. The video was also shared in March 2021 posts on TikTok here and here; and on Facebook here and here.", "The claim, however, is misleading: the video is in fact unrelated to the pandemic and has circulated online some seven months before Covid-19 was first detected in the Philippines.", "A keyword search on Google found the video was posted here on Facebook by local television SMNI News on June 7, 2019.", "“World Bank lauds the tax reform program of the Duterte Administration,” its title reads.", "The Philippine finance department also published a similar report here on June 6, 2019, titled: “World Bank exec lauds PHL’s ‘proactive, forward-looking’ tax reform program”.", "The first Covid-19 case in the Philippines was confirmed in January 2020.", "Worst economic record during pandemic", "The claim that the Philippine economy is “going stronger despite the pandemic” is also misleading.", "Figures from the Philippine Statistics Authority, the country’s statistics agency, show the economy shrank a record 9.5 percent in 2020.", "The figure was the worst since records began in 1946, ending more than two decades of annual growth, AFP reported.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]