["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Senate candidate George Allen recently complained that corporate taxes are too high and discourage economic expansion.\n\n\"The tax on job-creating businesses in the United States is 35 percent, second worst in the entire world,\" he said during a June 14 news conference at which he unveiled his Blueprint for America’s Comeback..\n\nWe wondered if the U.S. really is No.2 in the world when it comes to high corporate taxes and asked for the source of Allen’s information.\n\nKatie Wright, spokeswoman for Allen’s campaign, pointed to a March 8, 2011, report from the right-leaning Tax Foundation. It indeed showed that the U.S. had the second highest total corporate tax rate among industrialized and emerging nations. Only Japan placed higher levies on business profits.\n\nBut taxes are a complicated subject, and Allen’s claim needs elaboration.\n\nEric Toder, co-director of the Urban Institute-Brookings Tax Policy Center, noted most corporate income is taxed at the top U.S. federal rate of 35 percent, which Allen cited. The tax applies to American companies doing business here and abroad as well as to profits earned in the U.S. by affiliates of foreign companies.\n\nAllen understates his argument when he says the 35 percent federal corporate tax rate is the second highest in the world. Actually, it outstrips Japan and is the highest national rate among nearly three dozen industrialized democracies, according to 2011 data from the Organization for Economic Cooperation and Development.\n\nBut national tax rates on companies don’t tell the whole story.  \n\nWhen looking at how the U.S. corporate tax liability compares to other countries, analysts usually  examine a combination of federal and state corporate income tax rates.\n\nBy that measure, the combined average corporate tax rate in the U.S. is 39.2 percent this year, according to the OECD. Among industrialized democracies, only Japan’s combined corporate rate of 39.5 percent is higher.\n\nJapan had planned to lower its corporate tax rate by 5 percent on April 1. But it delayed making the cut after a disastrous earthquake and tsunami struck in March.\n\nThe OECD report only discusses statutory corporate tax rates. It does not address deductions and credits companies can claim in various countries to lower their liabilities. These loopholes produce an \"effective tax rate\" - the percentage of profits companies actually pay in levies.\n\nThe World Bank published a report last November containing the effective corporate tax rates of 183 nations. The U.S. had an effective corporate tax rate of 27.6 percent, according to the study, which is still pretty high. Among larger international economies, only Japan, New Zealand and Thailand had higher effective tax rates on corporate profits.\n\nAllen, during his news conference, said he would like to lower the 35 percent national corporate tax rate to 20 percent and eliminate loopholes.\n\nLet’s sum up:\n\nAllen said the U.S. corporate income tax of 35 percent is the second highest in the world.\n\nThe national rate of 35 percent is actually the highest among democratic industrial nations. The U.S. combined corporate tax rate -- the average total of state and national levies on business profits -- is 39.2 and ranks second among industrialized democracies.\n\nSo Allen is a smidgen off on tax rates, rankings and definitions. We rate his claim Mostly True.", "George Allen’s remarks at news conference about the Blueprint for America’s Comeback, June 14, 2011. (statement is 5 minutes, 20 seconds into the recording)\n\nGeorge Allen, Blueprint for America’s Comeback, released June 14, 2011.\n\nThe Heritage Foundation, \"The economic impact of a 25 percent corporate tax rate,\" December 2, 2010.\n\nOrganization for Economic Cooperation and Development, \"Taxation of corporate and capital income  (2011),\"table II.1, accessed June 14, 2011.\n\nE-mail form Eric Toder, Urban Institute fellow and co-director of the Tax Policy Center, June 14, 2011.\n\nInterview with Eric Toder, June 14, 2011.\n\nPolitiFact, \"Gary Johnson says U.S. has ‘the highest corporate income tax in the world right now,’\"May 6, 2011.\n\nPolitiFact, \"Pat Toomey says U.S. has highest corporate tax rates in the world,\"January 3, 2011.\n\nInterview with Karen Campbell, senior policy analyst in macroeconomics at The Heritage Institute, June 14, 2011.\n\nE-mail from Katie Wright, spokeswoman for George Allen campaign, June 14, 2011.\n\nTax Foundation, \"Countdown to #1: 2011 marks 20th year that U.S. corporate tax rate is higher than OECD average,\"March 8, 2011.\n\nThe New York Times, \"U.S. business has high tax rates but pays less,\" May 2, 2011.\n\nWorld Bank, \"Paying taxes 2011: the global picture,\" accessed June 15, 2011.\n\nTax Policy Center, \"Business taxation: what are the statuatory and effective corporate tax rates?\"July 9, 2008.\n\nGovernment Accounting Office, \"Comparison of the reported tax liabilities of foreign and. U.S.-controlled corporations,\"1998-2005.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]