["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A campaign ad by the political action committee supporting Republican Sen. Rob Portman features a video clip of his opponent, former Ohio governor Ted Strickland, a Democrat, saying, \"My record is mixed and spotty, and I can be criticized for that,\" before the ad launches into attacks on his economic record.", "The narrator says that Strickland is speaking \"on his record,\" then slams Strickland for 350,000 jobs lost and $8 million in taxes raised. PolitiFact Ohio has checked those two figures before and rated the claims Half True and Mostly True, respectively.", "Now we’d like to know where Fighting for Ohio got that \"mixed and spotty\" clip. Did the former Ohio governor really fall on his sword over the economic upshot of his tenure?", "No, he didn’t. The ad takes Strickland’s words out of context.", "Text under the video cites a Cleveland Plain Dealer editorial board’s February interview of Democratic primary Senate candidates, which is posted in its entirety on YouTube.", "The context tells the tale. At the 26:13 mark of the interview, primary hopeful P.G. Sittenfeld asked Strickland, \"Why should Democratic voters not judge you by your record on guns?\" He criticized Strickland for reversing his anti-gun control stance, a change of heart Strickland’s aides have attributed to the 2012 Sandy Hook Elementary School shooting in Newtown, Conn., that resulted in the deaths of 20 children and six adults.", "Strickland countered that he welcomed voters to judge him by his record, then changed the subject to the diversity of his cabinet appointees during his term as Ohio’s governor from 2007 to 2011. But the topic snapped back to guns (at the 28-minute mark) when one of the off-camera Plain Dealer interviewers asked Strickland to clarify his stance.", "\"Has my position changed over time? It has,\" Strickland answered. \"Can people criticize me for that? Absolutely. You’re not going to find me out there saying my records with guns is not a legitimate -- you know, it’s one of many issues that people will look at and make a decision about me and this race, and so on and so forth.\"", "From there, Strickland tried to explain his gun rights position, calling President Bill Clinton’s 1994 crime bill, which he voted against in Congress, \"one of the worst pieces of legislation that’s been passed in decades.\" He said he dropped his NRA membership \"five or six years ago,\" and defended a recent radio interview in which he boasted about his A+ rating from the NRA in 2010.", "Strickland’s monologue concluded at the 31:40 minute mark, when he said, \"My record is mixed and spotty, and I can be criticized for that.\"", "The next 12 minutes of discussion is fixed on the candidates’ stances on gun control. Not employment, not taxes.", "Steiner Public Relations in Columbus, Ohio, is fielding questions for Fighting for Ohio. Their spokesperson, Jen Detwiler, said, \"We’ll let the content of the ad stand on its own.\"", "Our ruling", "An attack ad juxtaposes employment figures and tax dollars with a video clip of Strickland saying, \"My record is mixed and spotty, and I can be criticized for that.\"", "Strickland’s stance on gun control may have wavered, but the context in which he made the \"mixed and spotty\" statement did not. Strickland was talking about guns, not jobs or taxes. The Fighting for Ohio PAC’s \"Spotty\" ad distorts the context of his statement.", "We rate this ad False.", "https://www.sharethefacts.co/share/02d12e26-ad74-49e5-9fff-f0ca114a71eb", "Email interview, Jen Detwiler, Steiner Public Relations, May 10-11, 2016", "Interview, David Bergstein, Ted Strickland for Senate, May 11-12, 2016", "Article, \"Strickland switches on gun rights,\" Columbus Dispatch, Dec. 21, 2015", "Article, \"PAC backing Portland runs attack ad,\" Toledo Blade,  May 10, 2016", "TV ad, \"Spotty,\" PoliticalAdArchive.org", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]