["This claim was posted to Facebook here on February 24, 2021.", "The Thai-language text in the image translates to English as: “Court postpones the verdict reading for the rebel case of 39 PDRC protest leaders, from today to May 6 at 9 am #Feb24Mob.”", "The post’s caption reads: “There I thought so, either they walk or it is postponed.”", "PDRC refers to the People’s Democratic Reform Committee, a now-defunct protest movement founded in 2013 that aimed to counter the influence of ex-premier Thaksin Shinawatra.", "Following several consecutive months of protests between November 2013 and May 2014, Prayut Chan-O-Cha, a former army chief, staged a coup, replacing Prime Minister Yingluck Shinawattra.", "Similar claims was shared on Facebook here, here, and here.", "The claim is false.", "On February 24, 2021, Bangkok’s Criminal Court’s found three current government ministers guilty on charges of sedition, as AFP reported here.", "The group included PDRC founder Suthep Thuagsuban and three ministers: Digital Economy Minister Buddhipongse Punnakanta, Education Minister Nataphol Teepsuwan and Deputy Minister of Transport Thaworn Senniam.", "Following the guilty verdict, they will immediately be stripped of their posts, according to Thailand's constitutional law.", "The Criminal Court’s press release annoucing the verdict on February 24, 2021 can be found here.", "Thailand’s Court of Justice also refuted the false claim about the verdict being postponed in a Facebook post published here on February 24, 2021.", "\"This claim is inaccurate. Today is the first verdict hearing, which is currently underway. There is no postponement,\" part of the post reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]