["About this rating", "In general, most people like getting something for nothing.  But when word got out online that the Vibrant Body Company was offering a promotion code that allowed shoppers to purchase bras free of charge, some skeptical social media users expressed fears that the giveaway was a front for a human trafficking scheme.  The fearful premise was that the promotion was simply a trick to find out where women live and provide an excuse for sending delivery people to their homes, with those \"delivery people\" engaging in home invasions or abducting the women therein for human trafficking purposes:", "As a criminal scheme, this scenario is highly implausible.  It posits that someone would go through all the trouble of setting up a realistic and very professional web site for selling bras (complete with full contact information and staff listings), take orders from women all over the United States, and then blindly dispatch thugs to the delivery addresses to break into those homes and/or kidnap women — despite knowing nothing about the nature of those residences or who lives there.  (Are those delivery addresses actually residences rather than businesses or mail drops?  Who else lives at a given address other than the person who ordered the bra?  When are the people who live at those addresses at home?  Do they have security systems?)", "Aside from the fact that it would be much more efficient and easier for criminals seeking to perpetrate any kind of crime on women to simply stake out public places that women frequent (e.g., shopping malls, grocery stores, restaurants, gyms), random home invasion abduction isn't the method by which human traffickers generally ply their trade in the United States.  The criminal process of soliciting human trafficking victims generally works by having someone build up a rapport with the targeted victim, or by luring victims with false promises and advertisements for jobs and travel.", "In this case, Vibrant Body Company eventually cleared the air by sharing via Facebook the information that the promotional code offering no-cost bras was not part of some criminal enterprise, but rather something that was aimed at a small breast cancer support group and issued in conjunction with a group event in Los Angeles.  As often happens, that code became widely shared and used online outside of its intended audience, creating a problem for the company:", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]