["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "René-Charles Angélil, Celine Dion’s son, was not one of the people killed in the Las Vegas shooting, despite a fake news article that says he was.", "HoustonChronicle-tv.com posted an article claiming that \"Celine Dion’s 16-year-old Rene-Charles Angelil’s was among the 58 victims who were killed when a gunman opened fire late Sunday at a Las Vegas concert that left at least 58 people dead and 515 injured.\"", "There is no indication that Angélil was even at the country music concert, let alone murdered there.", "HoustonChronicle-tv.com attributed to Dion a statement that it said she made on Oct. 2 about her son’s death: \"At this point, I'm in complete disbelief and despair. I don't know what to say. René-Charles was the most kind-hearted, loving son I have ever seen.\"", "However, Dion never said this. Instead, Heather Gulish Melton said it in a statement made to radio station WCYB about her husband, Sonny. Sonny and Heather Melton attended the Route 91 Harvest Festival together. There, Sonny was shot and killed as they were running away from the shooter at the concert.", "\"At this point, I'm in complete disbelief and despair. I don't know what to say. Sonny was the most kind-hearted, loving man I have ever met. He saved my life and lost his,\" said Heather Gulish Melton.", "HoustonChronicle-tv.com changed the quote by switching the names from \"Sonny\" to \"René,\" altering the last part of the quote from \"loving man I have ever met,\" to \"loving son I have ever seen,\" and eliminating all together \"he saved my life and lost his.\"", "Often, fake news sites use site names that are close to the name of an existing news publication to trick people into thinking it is legitimate. For example, HoustonChronicle-tv.com is similar in name to the Houston Chronicle, which is the actual local newspaper for Houston, Texas.", "Dion had a concert in Las Vegas on Oct. 3 where she paid tribute to the victims, their families, first responders and anyone affected by the tragedy.", "\"I never start the show like this but tonight is very different,\" she said, according to People. \"On Sunday we lost too many beautiful, innocent souls, and so many are still suffering,. But tonight we’re going to let these families know that we are supporting them and that we will help them through their tragic loss.\"", "She made no mention of her son, because he was not a victim of this mass shooting.", "HoustonChronicle-tv.com has posted other fake news articles that we have rated before. Like those articles, we rate the claim that René-Charles Angélil was a victim of the Las Vegas massacre as Pants on Fire.", "New York Post, Wife of Las Vegas Massacre victim: ‘He saved my life and lost his, Oct. 2, 2017", "PolitiFact, All Pants on Fire! statements involving HoustonChronicle-tv.com", "People, Tearful Céline Dion Dedicates Las Vegas Show to Shooting Victims and Donates All Proceeds: 'Tonight Is Very Different', Oct. 4, 2017", "Houston Chronicle", "WCYB News, Tennessee man identified as one of the Las Vegas victims, Oct. 2, 2017", "HoustonChronicle-tv.com, Celine Dion’s 16-year-old son Rene-Charles Angelil killed in Las Vegas Shooting", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]