["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Megan Rapinoe, a forward on the U.S. women’s national team that won the World Cup this summer, drew the ire of some Americans — including the president — after she said she wouldn’t visit the White House. Now, she’s under scrutiny for disrespecting the flag.", "\"This is Kelley O’Hara,\" began a July 8 Facebook post with a photo of one of Rapinoe’s teammates. \"She is the women’s soccer player who rushed to rescue the American flag after it was thrown down on the field and stomped on by her idiot teammates. Kelli Ohara (sic) is the true face of real feminism. Lets (sic) make HER famous instead of the square jawed haters with the bad dye jobs dissing the flag for attention.\"", "The reference to bad dye jobs is an apparent dig at Rapinoe, whose blonde hair was purple during the World Cup matches.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Your video assistant referees at PolitiFact are here to help sift fact from fiction.", "The post echoes a tweet from former Navy SEAL Jonathan Gilliam, who on July 7 posted a video clip of Rapinoe and players Allie Long and Alex Morgan celebrating after their World Cup win. (You can watch the clip here.)", "\"You should be disturbed by this unpatriotic narcissistic behavior,\" he wrote. \"@mPinoe is neither a hero or a role model. I rewound and watched the entire celebration on the field. Rapinoe didn’t want anything to do with an #Americanflag before she stomped it. @repulsive\"", "You should be disturbed by this unpatriotic narcissistic behavior. @mPinoe is neither a hero or a role model. I rewound and watched the entire celebration on the field. Rapinoe didn’t want anything to do with an #Americanflag before she stomped it. #repulsive pic.twitter.com/Kevbe7jJYt", "When the clip begins, Long is holding the trophy in one hand and an American flag in the other. She hands the trophy to Rapinoe and then drops the flag as she, Rapinoe and Morgan begin what looks like a choreographed move that ends with them throwing their hands in the air. Rapinoe’s foot appears to come into contact with the flag as the players start shuffling forward but O’Hara darts into the frame and Long picks the flag back up and hands it to her.", "The incident received some news coverage, including from Fox News, which reported that \"Long came under fire for briefly dropping the American flag during her celebration with Golden Boot winner and outspoken Trump critic Megan Rapinoe.\"", "Fox doesn’t say that any of the players stomped on the flag. And here, we think words matter. While it’s true that Long dropped the flag on the ground for a few seconds during the team’s celebration, to say that players stomped on it suggests something more sinister than what took place.", "But more than that, it doesn’t appear that anyone even stepped on the flag. After Rapinoe takes a step forward, Long is able to pick it up.", "In the Facebook post’s comments, some Facebook users cheered O’Hara on. But others were skeptical of how the account had framed what happened on the field after the U.S. team beat the Netherlands 2-0.", "\"Thank you for picking up our flag,\" one man said. \"I watched that video a couple times. I never saw any of those girls step on the flag. Kelley got it before they could. I won’t pretend to see something to make liberals look bad. I don’t have too (sic). They do enough obvious stuff.\"", "We rate this Facebook post as False.", "Facebook post, July 8, 2019", "Tweet, July 7, 2019", "The New York Times, \"Trump criticizes Megan Rapinoe over refusal to visit White House,\" June 26, 2019", "The New York Times, \"U.S. wins records fourth World Cup title,\" July 7, 2019", "Fox News, \"Allie Long briefly drops American flag, during World Cup celebration, Kelley O’Hara picks it up,\" July 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]