["About this rating", "In 2015, pop star Nelly was arrested on drug charges, sentenced, and released. Two years later, a story — apparently based on the 2015 incident — seemed to show that he had been arrested again:", "Hip-Hop artist Nelly was arrested by a Tennessee state trooper and was charged with felony possession of drugs and possession of drug paraphernalia. According to a press released, around 9:20 a. m. , Nelly, whose real name is Cornell Haynes, was riding in a Prevost motor coach bus when it was stopped by a trooper. Police say the bus failed to display a U. S Department of Transportation sticker and an International Fuel Tax Association sticker.", "However, the text of this article and the included video describe the April 2015 incident. According to Billboard, the musician's tour bus was pulled over while traveling through Tennessee on 11 April 2015. Troopers smelled marijuana and searched the bus for drugs:", "The rapper's bus was pulled over by a trooper on Saturday morning (April 11) for not having two required stickers, the Johnson City Press reports. From there Nelly was charged with felony possession of drugs, simple possession of marijuana and possession of drug paraphernalia. The charges came up after the officer smelled marijiuana coming from the bus.", "After a search was conducted, they found five rocks that tested positive for meth, a small amount of marijiuana as well as drug paraphernalia. Several handguns were also found in the bus. Another man, Brian Jones, was charged with being a felon in possession of a handgun.", "According to celebrity and entertainment site Bossip, Nelly avoided jail time:", "Instead of heading to trial, the rapper agreed to participate in Tennessee’s pretrial diversion program, where he’ll be put on probation and could have his record cleared if he stays out of trouble, court officials in Putnam County, Tn. confirmed to BOSSIP.", "Although it is true that Nelly was arrested on drug charges, this took place in 2015. The singer did not serve any jail time and as of May 2017 is currently on tour with Florida Georgia Line. He played a concert with Juvenile on 20 May 2017 (after the arrest rumors started to recirculate) in Peoria, Illinois, and is scheduled to perform at the Neon Desert Music Festival over Memorial Day Weekend.", "Vena, Jocelyn.   \"Nelly Arrested on Drug Charges in Tennessee.\"\r\n    Billboard.com.   11 April 2015.", "Bossip.com.\r\n   \"BOSSIP Exclusive: Nelly Cops Plea In Meth Case.\"    25 January 2016.", "Bossip.com.\r\n   \"BOSSIP Exclusive: Nelly Cops Plea In Meth Case.\"    25 January 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]