["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Rep. Loretta Sanchez, middle, greets supporters at the California Democrats State Convention in Anaheim, Calif., on Saturday, May 16, 2015. Associated Press photo.", "Critics have repeatedly attacked California Attorney General Kamala Harris for what they say is her slow progress investigating gun owners who are legally prohibited from having them.", "In 2001, California created the nation’s only database to identify these gun owners, including the mentally ill and those subject to domestic violence restraining orders. It allows the seizure of weapons by law enforcement from people in the prohibited categories.", "There’s no record of anyone questioning the existence of the database, which has been praised by gun control advocates.", "But a decade after it went into effect, the tracking system has a backlog of thousands of cases.", "Enter Rep. Loretta Sanchez. The Orange County congresswoman is Harris’ closest competitor for the U.S. Senate seat being vacated by retiring Sen. Barbara Boxer. All three are Democrats.", "Sanchez told Capital Public Radio during an interview in January 2016 that Harris has squandered state resources, and hasn’t even produced a database.", "\"So the Legislature gave the Attorney General $25 million to match up those people who were felons versus those people who were buying guns. Just a database, so that we could weed out what was going on with respect to those people who shouldn’t be able to purchase guns – by existing law. Nothing was done. I mean, $25 million was spent, but we don’t have that database,\" Sanchez said.", "We decided to focus on whether the database exists, and check on how the state funds have been spent.", "#ICYMI: See & hear the words that put @LorettaSanchez on the hot seat. #PantsOnFire: https://t.co/HEY8WGisUz pic.twitter.com/pBIkGNvYHd", "Our research", "The database is officially called the Armed Prohibited Persons System, or APPS. It was created in 2001 after the Legislature passed SB 950, a Republican-authored bill, in response to gun violence across the nation.", "It cross-references all handgun and assault weapon owners in California against criminal records. It’s designed to check for individuals who legally purchased or registered a firearm but later committed a crime that would prevent them from owning the gun. Law enforcement agents are charged with tracking down the individuals and trying to confiscate their weapons.", "The database became active in December 2006, according to Harris’ office, or four years before she was elected attorney general.", "In this Nov. 16, 2012 Associated Press file photo, California Attorney General Kamala Harris speaks during a news conference in Los Angeles.", "While the database is not public, it is real. It’s been tied to a court challenge and is the subject of reports by the Attorney General’s Office, articles by the press, and letters by gun rights groups and gun control advocates.", "\"Yes. It does exist,\" said Michelle Gregory, a spokeswoman for the Attorney General’s Office. \"These (enforcement) agents are working these cases every day. … It’s definitely a lot of work. It’s time consuming.\"", "\"The database absolutely exists,\" added Mike McLively, an attorney with the San Francisco-based Law Center to Prevent Gun Violence.", "We asked the Sanchez campaign to explain her claim.", "A campaign spokesman argued that it’s correct — if you add words that greatly change the original statement:", "\"To date, we don’t have that database as it was promised by the (State) Department of Justice in 2013,\" the spokesman wrote in an email.", "As a refresher, here’s what Sanchez said originally: \"Nothing was done. I mean, $25 million was spent, but we don’t have that database.\"", "Still a backlog?", "It’s a clear misstatement to say \"we don’t have that database.\" But we wanted to see what progress Harris has made reducing its backlog, to better examine Sanchez’s claim that \"nothing was done\" and that \"$25 million was spent.\"", "In 2013, the Legislature and Gov. Jerry Brown approved $24 million in additional funds to reduce the long list of cases. It had grown to more than 20,700 at the time, according to Harris’ office. Earlier that year, a Harris aide seemed to suggest that the backlog could be eliminated in a single year, according to news reports from the time.", "That same year, the attorney general pledged to hire 36 enforcement agents with the money. Two years later, only half as many had been hired  due to what Harris’ office called \"hiring challenges.\" And while state investigations helped clear nearly 7,000 names off the list, the overall backlog had shrunk by only one-fifth during that time, to about 17,500, according to a March 2015 report by the Attorney General’s office.", "A sample of the firearms seized through the state's APPS program. Photo courtesy California Attorney General's Office.", "Republicans in the Legislature criticized Harris for what they said was slow progress.", "Sanchez’s comments about the database came five days before the Attorney General’s Office issued another report on the program. It said the list is now down to about 12,700 cases, which the office called \"a historic low.\" The report makes clear that the list is not static. More than 20,000 people were added to it during the past two and a half years, while about 7,800 dropped off due to death or other reasons.", "SOURCE: California Attorney General's SB 140 Supplemental Report of the 2015-2016 Budget Package. The above figures represent the end of fiscal year numbers. *This data represents the first six months of FY 15-16.", "Since the additional funding was approved in 2013, state agents have removed more than 20,500 people, and doubled the average number of guns seized per year, according to the most recent report.", "The office has spent $15 million of the $24 million, according to the Attorney General’s Office. The office’s authority to spend the remainder expires May 1, though Harris has asked the Legislature to create a permanent funding stream for the program.", "Our ruling", "Rep. Loretta Sanchez said in a recent interview that California Attorney General Kamala Harris has done \"nothing\" to address a backlog of cases in a high-profile gun ownership tracking system. The database allows law enforcement to seize guns from people with criminal records and mental illness.", "\"So the Legislature gave the Attorney General $25 million to match up those people who were felons versus those people who were buying guns. Just a database, so that we could weed out what was going on with respect to those people who shouldn’t be able to purchase guns – by existing law. Nothing was done. I mean, $25 million was spent, but we don’t have that database,\" Sanchez said.", "Not only does the program exist, but some progress has been made. The backlog has been cut from more than 20,000 cases to 12,700. That’s after Harris’ office spent $15 million of $24 million allocated by the Legislature and governor.", "Some continue to argue that the cases should be cleared more quickly, citing the mass shootings that have continued across the country. But there’s no denying that the Attorney General’s Office, under Harris, has put a dent in the backlog, allowing for the seizure of thousands of guns. And that’s far from \"nothing.\"", "While there’s room to criticize the pace of the program, Sanchez’s statement amounts to a complete misrepresentation of reality.", "We rate the claim Pants On Fire.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Senate Bill 140 Supplemental Budget Report", "Phone interview, Michelle Gregory, spokeswoman for the California Attorney General’s Office, Jan. 29, 2016", "Phone interview, Mike McLively, staff attorney at the Law Center to Prevent Gun Violence, Jan. 29, 2016", "Email interview, Luis Vizcaino, spokesman, Loretta Sanchez for U.S. Senate, Jan. 27, 2016", "History of Armed & Prohibited Persons System, California Attorney General’s Office", "California Senate Bill 950, October 2001", "California Senate Bill 140, May 2013", "California Senate Bill 140, Armed & Prohibited Persons System, Report to the Legislature, Calendar Year 2014", "California Senate Bill 140, Armed & Prohibited Persons System, Supplemental Report of the 2015-16 Budget Package, January 2016", "Sacramento Bee, news article, \"California continues to have large backlog of prohibited gun owners,\" March 17, 2015", "Sacramento Bee, op-ed by Sen. Bob Huff, \"Another View: Harris is falling short on gun backlog,\" April 9, 2015", "California Rifle & Pistol Association, press release, \"Appeal filed in Federal District Court: Unconstitutional Firearms Sales ‘Fee,’\" March 5, 2015", "Michel & Associates, Attorneys at Law, letter to potential clients, \"Protect Yourself! California’s Politicized Gun Confiscation Program Threatens Uninformed Gun Owners,\" May 23, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]