["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There’s nothing like a law enforcement investigation to set off a political mudslide.\n\nThat’s what happened to Wadsworth Republican Rep. Jim Renacci after a May 18 article in The New Republic revealed that federal law enforcement authorities were examining donations that his campaign received from employees of a North Canton direct marketing firm called Suarez Corporation Industries.\n\nFederal law enforcement officials sought contribution records from  the campaigns of Renacci and GOP U.S. Senate candidate Josh Mandel after the Toledo Blade published a report about large sums of money the firm’s employees gave to the two campaigns. Wealthy political donors sometimes try to skirt caps on the amount they can give campaigns by having other people write checks and reimbursing them. That practice is illegal. The company and its employees deny any wrongdoing, as do the political campaigns.\n\nStill, the questions were enough to prompt Mandel -- who serves as Ohio’s state treasurer --  to return the donations at issue.\n\n\"We have decided to issue refunds for any contributions that appear to be under investigation by federal authorities,\" Mandel campaign treasurer Kathryn Kessler said in a letter to Suarez Corporation.\"We believe we have no reason to be concerned with the contributions, but out of an abundance of caution and until the investigation is complete, we believe this course of action is most appropriate.\"\n\nRenacci’s decision to hang onto the cash pending the investigation’s outcome prompted predictable political attacks from his foes. Demanding that an opponent get rid of donations from a controversial campaign backer is a common political tactic, one that Renacci himself has repeatedly used in the past.\n\n\"After several months of investigation and countless stories in the press about suspect campaign contributions, Congressman Renacci’s continuing refusal to return the funds speaks volumes,\" said a May 29 press release from Renacci’s November election rival, Copley Township Democratic Rep. Betty Sutton.   \"Every day that passes is a day that he fails to do the right thing to come clean about what he knew about these potentially illegal contributions and return or donate the suspect funds.\"\n \nEager to capitalize on the controversy, the campaign arm of Democrats in the House of Representatives issued a June 1 missive announcing it had named Renacci its \"Corrupt Republican of the Month,\" a designation whose sole purpose seemed to be providing an excuse for press releases.\n\n\"Congressman Jim Renacci is under FBI investigation for taking $110,250 in suspect campaign cash and refuses to return the money,\" Democratic Congressional Campaign Committee spokesman Jesse Ferguson said in the release.\n\nWhile it is clear that the FBI is investigating Suarez Corporation’s donations, PolitiFact Ohio had not heard that Renacci himself was under investigation by the FBI.\n\nWe asked the DCCC to back up their claim.\n\nThe DCCC said its assertion was consistent with statements from groups such as Citizens for Responsibility and Ethics in Government, whose website claims that the FBI is investigating Renacci, and headlines such as this one from the Medina Gazette’s online edition: \"FBI confirms campaign investigation of U.S.  Rep. Jim Renacci.\" The article underneath that headline clearly stipulates the FBI is investigating Suarez’ donations to Renacci and Mandel, and states \"The candidates are not accused of any wrongdoing.\"\n\nWhile a claim on a watchdog website, or sloppy headline could have conveyed the impression that Renacci or his campaign was being investigated by the FBI, none of the news coverage we found on the subject indicated that was the case. To settle the question, we went straight to the source: the Canton office of the Federal Bureau of Investigation.\n\nIn a June 18 interview, Andrew Hayden, the supervisory senior resident agent of Canton’s Federal Bureau of Investigation office confirmed that Renacci is not a target of the FBI’s investigation.\n\n\"We are looking into the donations from the Suarez Corporation, and not the congressman’s campaign or the congressman,\" Hayden said.\n\nIt couldn’t be much clearer than that. The FBI says it is not investigating Renacci.\n\nOn the Truth-O-Meter, the DCCC’s statement rates False.", "The New Republic, The Battleground, May 18, 2012\n\nToledo Blade, Canton firm’s workers making unusual donations, August 19, 2011\n\nDemocratic Congressional Campaign Committee press release, \"Congressman Jim Renacci Named as \"Corrupt Republican of the Month,\" June 1, 2012\n\nThe Plain Dealer, Justice Department probing campaign donations to Rep. Jim Renacci, U.S. Senate candidate Josh Mandel, May 21, 2012\n\nCanton Repository, FBI probes Suarez employees’ campaign contributions,  May 21, 2012\n\nCanton Repository, Suarez: FBI agents ‘terrorizing’ employees, May 24, 2012\n\nThe Plain Dealer, U.S. Senate Candidate Josh Mandel returns $105,000 in questionable campaign contributions to 21 donors,  May 23, 2012\n\nPress release from Betty Sutton for Congress, Sutton to Renacci on returning questionable donations: What are you waiting for? May 29, 2012\n\nPress release from Jim Renacci for Congress, \"Boccieri campaign cash tainted by corruption, Renacci campaign calls on Boccieri to return Rangel’s dirty money,\" March 1, 2010\n\nPress release from Jim Renacci for Congress, \"Despite ethics violations, Boccieri refuses to part with Rangel cash,\" July 26, 2010\n\nJim Renacci for Congress, news release \"Boccieri’s base of corruption broadens, while refusing to return Rangel’s money, another Boccieri financial backer indicted,\" August 2, 2010\n\nThe Plain Dealer, Rep. Charles Rangel’s ethics charges fuel political charges in Ohio, July 29, 2010\n\nMedina Gazette online , \"FBI confirms campaign investigation of U.S. Rep. Jim Renacci,\" May 23, 2012\n\nCitizens for Responsibility and Ethics in Washington website on Rep. Jim Renacci, accessed June 18, 2012\n\nEmails with Renacci spokesman James Slepian, June 15, 2012\n\nEmails with DCCC spokeswoman Haley Morris, June 18, 2012\n\nInterview with Mike Tobin, spokesman for the U.S. Attorney for the Northern District of Ohio, June 18, 2012\n\nInterview with Andrew Hayden, Supervisory special agent of Canton’s FBI office, June 18, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]