["While social media has served as a beneficial tool for stormchasers and weather forecasters to spread alerts and share images, it has also turned into a platform to spread misinformation.", "A vintage image of a purportedly large tornado with two people standing yards away is making the rounds on social media. Users in the comments describe it as \"a scene in the Wizard of Oz.\"", "“The famed 19th Century Tornado that was caught on camera in Oklahoma, 1898,” reads a Facebook post by the page Historical Pictures that has been shared over 600 times.", "USA TODAY reached out to the page for comment.", "More:Fact check: No evidence that Aemilia Bassano wrote all of Shakespeare’s plays", "Alex Cooke, an editor for the photography site Fstoppers, wrote in 2015 that he first came across the image when reading a 1,300-page book on tornadoes. He noticed something wasn't right about the photo.", "“The way the funnel attached to the cloud base, its location in the storm, its overly perfect funnel shape (it’s rare that funnels are actually shaped like funnels), and even the lighting were off,” Cooke wrote, noting that the trees near the tornado appeared unaffected.", "Thomas P. Grazulis, an American meteorologist, writes in his book, “Significant Tornadoes 1680-1991, a Chronology and Analysis of Events” that, “The way the funnel and the funnel join in this photograph does not look very natural. This photo was probably touched up or combined with another photograph that had a more interesting cloud base. Early photographs were frequently altered to make them more saleable commercially.”", "Aside from the odd funnel and cloud base, Cooke writes, “the strangest aspect” was the two people standing yards away from the tornado, indicating the image was likely a composite, two or more photos combined to create one.", "The photo claiming to show the tornado first appeared after it was sent to the Monthly Weather Review by a man who went by \"Mr. Connor.\"", "The editors of the publication, however, had grown used to readers sending in fake photos and were skeptical about the legitimacy of the image, so they decided not to publish it.", "\"We have watched with interest and curiosity the efforts of some manipulators of the camera to reproduce the phenomena of nature in all her varying moods,\" the Monthly Weather Review wrote on May 1, 1899. \"There can be no particular fault found with the enterprise of the photographer, be he amateur or professional, who sallies forth at high noon, or soon thereafter, and under the friendly shadow of an accommodating cloud makes moonlight views by the score.\"", "Shortly after, the weather journal was sent a similar photograph by someone named Mr. Gosewisch, after the Kirksville Cyclone hit on April 27, 1899.", "The editor at the time, Alfred J. Henry, acknowledged that the funnel was forged and recalled the similar image sent by Connor.", "\"We confess, too, that we can pass into the waste basket without hesitation the many poor attempts to fabricate the funnel cloud of a tornado. We received one such not very long ago from Mr. Connor. It was better than the average, and instead of going into the trash basket, it went into a convenient drawer,\" Henry wrote, according to an article found by Snopes.", "The images, that Henry said were likely created by blending a funnel with a \"beautiful photograph of sunset clouds and landscape,\" were originally made by photographer North Losey.", "Losey has captured images of speeches by President Theodore Rooseveltand life in the 19th century in Oklahoma City. He also held patents in photographic light-diffusing and artificial light diffusing.", "Two similar images of the cyclone funnel appear in the Library of Congress and the American Museum of Natural History and are credited to an unknown photographer, but could have been taken by Losey, according to Snopes.", "The Library of Congress examined a scan of one of the photos and told Snopes, \"it appears there was some editing done where the tornado touches the cloud. There’s also a line towards the top of the photo which could be the edge of the glass if he faked it. I can’t say for certain it was faked, but I would believe it someone else had proof.\"", "In 2014, the Weather Channel reported that \"meteorology was still in its infancy\" in the late 1800s and in 1833, the government banned the word \"tornado\" from weather forecasts to avoid widespread panic.", "\"Historically, the only extreme weather images were from eyewitness sketches. Very few Americans had actually seen a tornado until the 1880s, when photographers released the earliest known tornado photographs,\" the Weather Channel reported.", "We rate this claim as FALSE based on our research. The photo is a composite of two images edited together. Reports state that photos of tornados in the 1800s were mainly from sketches. Editors at the Monthly Weather Journal at the time found that similar images had been sent to the publication and that the photo appeared edited.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]