["The 41-second video was shared in this Facebook post on June 27, 2019, where it has been viewed more than 900,000 times and shared more than 45,000 times.", "Below is a screenshot of the misleading post:", "The Hindi language caption translates into English as: “If Tabrez doesn’t get justice, then we are 1,600 Hindu families with around 8,000 members and will convert to Islam. Listen to this true patriot of Lord Ram.”", "“Tabrez” refers to Tabrez Ansari, an Indian Muslim who was allegedly beaten by a mob in Jharkhand state and forced to chant Hindu slogans on June 18, 2019.", "He died four days after the attack on June 22, 2019. Police arrested 11 people over the killing on June 25. Here is an AFP report about the killing published on June 25.", "Ram refers to a Hindu deity.", "The video shows a man wearing a white cap speaking to journalists in Hindi.", "His comments translate to English as: “We will accept Islam, all the families of contractual teachers will accept Islam. As soon as we talk to a Muslim cleric and decide a date, we will all along with each family member including men, women, old, young will accept Islam and will raise the slogan of Allahu Akbar. We will also do Jihad. We are 1,600 families which total at around 7,000 to 8,000 people will accept Islam.”", "The same video has been viewed hundreds of thousands of times on Facebook here and here with a similar claim, and was also shared on Twitter here.", "The claim is false; the video has circulated online since 2017 in local media reports about a teachers protest.", "A keyword search for ‘Shikshamitra (contractual teachers) threaten Islam conversion’ found a longer version of the video published here on a YouTube channel called ‘Indus Info’ on July 26, 2017.", "The YouTube video’s Hindi language title translates to English as: “Contractual teachers gave a threat of religion conversion to Yogi, Shikshamitra case.”", "Yogi refers to Yogi Adityanath, the chief minister of the north Indian state of Uttar Pradesh. Here is his official Twitter profile.", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "Keyword searches found the YouTube video relates to teacher protests in Lalitpur, a district in Uttar Pradesh.", "The protest was covered by local Hindi language site Patrika.com in this report published on July 27, 2017.", "The headline of the article translates to English as: ‘Contractual teachers gave a warning to Yogi government after the order from Supreme Court.’", "Contractual teachers, known as ‘Shikshamitras’ were protesting a Supreme Court decision wherein the court canceled the promotion of contractual teachers to assistant teachers in government schools in Uttar Pradesh. The Supreme Court decision was published here on July 25, 2017.", "The person speaking in the video in the misleading posts can also be seen in this video published on the YouTube channel for local news channel Patrika Uttar Pradesh on July 26, 2017.", "At the 35 second mark, he identifies himself as Manohar Singh Bundela, a resident of a town near Lalitpur district in northern India.", "He lists himself as a government school teacher on his Facebook profile here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]