["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Advocating a bill he introduced to help public school students pay for private school, state Sen. Dan Patrick said in an April 9, 2013, committee hearing, \"We have 315,000 mostly minority students in failing schools.\"", "The Houston Republican’s Senate Bill 23 would provide a tax credit to businesses that donate to a private school scholarship fund.", "Since he and Lt. Gov. Dewhurst announced the plan in December 2012, they have referred to the plight of students in schools rated academically unacceptable. In the April 9 hearing, Patrick spoke of \"trapping a poor student in a poor-performing school -- of which we have 532 in our state, out of 8,500 campuses.\"", "Overall, about 70 percent of Texas’ 5 million students in 2011-12 belonged to groups traditionally considered minorities, according to 2011-12 Texas Education Agency data.", "We wondered how the picture changed when looking only at students in schools rated unacceptable.", "Patrick’s chief of staff, Logan Spence, sent us a spreadsheet from the education agency showing 2011-12 enrollment data for 530 schools rated unacceptable, the lowest category in the state’s most recent accountability ratings, which are from 2011. No rulings were issued in 2012, as the state is phasing out TAKS (Texas Assessment of Knowledge and Skills) tests and replacing them with STAAR (State of Texas Assessments of Academic Readiness) exams.", "Via email, agency spokeswoman Debbie Ratcliffe verified the numbers for us and said that the tally of campuses rated unacceptable had fluctuated as schools appealed ratings, ending up at 530.", "By our calculations using the agency’s data, the number of nonwhite students in \"unacceptable\" schools was 315,073 in 2010-11, but 304,139 in 2011-12.", "Spence told us Patrick has used totals from both years in speeches.", "We calculated that non-white students made up 77.8 percent of the enrollment at \"unacceptable\" schools in 2010-11 and 78.4 percent of the enrollment at \"unacceptable\" schools in 2011-12.", "The breakdown for 2011-12 enrollment at schools rated unacceptable, using the agency’s categories:", "Hispanic -- 51.4 percent", "At schools rated acceptable or better in 2011-12, we found, the enrollment was 68.5 percent non-white. And those schools accounted for the vast majority of Texas’ 4.98 million students in 2011-12. Schools rated acceptable or better served 91.4 percent of Texas students, including 91 percent of the state’s 3.4 million non-white students.", "Again using the agency’s data, we broke out the percentage of non-white students for the other school rating levels, and found that the percentage of non-white students decreased with each step up:", "Our ruling", "Patrick said Texas has \"315,000 mostly minority students in failing schools.\"", "That matches an outdated figure -- the 2010-11 non-white population at such schools. For 2011-12, there were 304,139 students in \"unacceptable\" schools. In both cases, about 78 percent of the students in the faltering schools were \"minority,\" meaning non-white. In contrast, schools rated acceptable or better in 2011-12 had enrollments of nearly 69 percent non-white students.", "We rate Patrick’s statement as Mostly True.", "State Sen. Dan Patrick, remarks in Senate Education Committee hearing, April 9, 2013", "Texas Education Agency spreadsheet, 2010-11 enrollment data", "Texas Education Agency spreadsheet, 2011-12 enrollment data", "Email interviews, excerpted, with Logan Spence, chief of staff for Sen. Dan Patrick, April 15-22, 2013", "Email interviews, excerpted, with Debbie Ratcliffe, communications director, Texas Education Agency, April 15-22, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]