["According to a tale currently spreading across Canadian social media, a 13-year-old girl was drugged to make her compliant, her hair was cut and two foreign women attempted to escort her out of the mall to a car where two men were waiting. The mother recognized her daughter just in time to alert the authorities and foil the concerningly well-planned abduction attempt.", "However, the story is false.", "“There is no record of this happening in London, and there is information on Facebook that suggests this may be an urban legend,” Sandasha Bough, a spokeswoman from the London Police Service, told AFP on December 16.", "Sandra Lorentiu, the general manager for the Masonville Mall, told AFP that she was not aware of any abduction attempt on the premises under her authority.", "Bough pointed out that nearly identical scenarios have been shared on social media in other cities over the past two years, and that none of those Facebook posts had been written by someone who was present at the scene of the alleged foiled kidnapping.", "Tales of children abducted by strangers in public areas have captivated public imagination for a long time. According to Snopes, a website that began covering digital disinformation in the 1990s, stories similar to the Masonville Mall abduction used to circulate via email chains before migrating to Facebook. AFP Fact Check has debunked similar stories, including a false tale of thwarted abductions at Canada’s Wonderland.", "Many of the stories follow a similar pattern. They are usually presented as accounts from a friend or relative of the person who experienced the threat, and go on to recount child abduction attempts in public places, be it an amusement park, a mall, or a supermarket. The resolution is positive, with the child found, but dressed in different clothes and with either a shaved head or dyed hair, supposedly proof of the level of organization and premeditation of the kidnappers.", "The available data on child abductions further refutes the idea that strangers generally loom in public spaces in the hope of kidnapping children. In Canada and in the United States, the majority of child abductions are carried out by a child’s relative.", "According to this data from Canada’s National Centre for Missing Persons and Unidentified Remains, only 27 children were abducted by strangers out of 42,233 reports of missing minors in 2018. The report adds that 92 percent of missing minor reports were removed from the list within a week, and that 73 percent of cases are runaways.", "Abductions by strangers “are so rare that when they do happen, the impact is great and that’s why people are so fearful of stranger abduction,” Karen Chymy, director of operations for MissingKids.ca, a resource center for missing children, told AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]