["The photo was published on Facebook here on November 18, 2020.", "Part of the post’s sarcastic Hindi caption translates to English as: “Mr. Ashok Gehlot had requested the US to manufacture special firecrackers that produce oxygen on burning. The US did so only for Ashok Gehlot ji and he is burning the same firecracker in this photo. And yes, Ashok Gehlot has made burning firecrackers a criminal offence in the state. Several children were arrested for burning firecrackers and their parents had to pay heavy fines to  bring them home from the police lockups…”.", "Ashok Gehlot, a prominent figure in India’s main opposition Indian National Congress party, announced in early November 2020 that Rajasthan would ban the use of firecrackers in Diwali celebrations in a bid to limit air pollution during the Covid-19 pandemic.", "The decision by Rajasthan and other state governments drew criticism from the ruling Bharatiya Janata Party and Hindu hardliners who claimed the ban was anti-Hindu.", "The photo was also shared alongside a similar claim on Facebook here, here, here and here, and on Twitter here, here, here and here.", "The claim is false.", "A reverse image search on Google found the photo was published on Gehlot’s verified Instagram account here on October 28, 2019, several months before the Covid-19 pandemic began. He shared it more than one year before the ban on fireworks was implemented.", "“Celebrated #Diwali with #family #diwalicelebration,” reads the post.", "A post shared by Ashok Gehlot (@ashokgehlot.inc)", "Diwali -- the Hindu festival of light and prosperity -- was celebrated on October 27 in 2019.", "Gehlot’s son Vaibhav Gehlot also published the same photo on Twitter here on October 28, 2019.", "“Worshipped mother Lakshmi with family on the occasion of Diwali,” the Hindi tweet reads.", "दीपावली के अवसर पर सपरिवार लक्ष्मी मां की पूजा-अर्चना की।#DiwaliCelebration #HappyNewYear #Lakshmipooja pic.twitter.com/ey0iL7F9uV", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]