["Several Twitter users have posted a video of a large gathering of people from the Muslim community with the claim, “Chechen Muslims protest against France and expressing devotion to the Prophet (peace and blessings of Allaah be upon him) #boycottfrance #FranceBoycott #ProphetMuhammadSAW”.", "Twitter user @007AliSohrab posted the viral video on October 26. Since then it has been viewed over 50,000 times (archived link).", "Chechen Muslims protest against France And expressing devotion to the Prophet (peace and blessings of Allaah be upon him)#boycottfrance #FranceBoycott #ProphetMuhammadSAW pic.twitter.com/pPKPi2Sgqf", "— काकावाणी 2.0 (@007AliSohrab) October 26, 2020", "It was also posted by the Facebook page PTI Overseas, gathering over 1,600 shares (archived link).", "The video is circulating in the backdrop of French President Emmanuel Macron’s comments on Islam after a middle school history teacher was beheaded for showing his pupils cartoons of Muhammad, the Prophet of Islam. The teacher was killed by an 18-year-old who came to France with his family as a refugee from the Muslim-majority Chechnya region. President Macron criticised the Islamic faith which was not well received by the Muslim community across the world.", "Alt News analysed the video using InVID. We performed a reverse image search and found that the video was uploaded in February by a Facebook user along with text in Hausa, a Chadic language spoken in Niger and Nigeria mainly. Using Google Translate we found that the title read “the birth of the prophet s.a.w is the most powerful argument” (translated from mauludin annabi s.a.w yafi qarfin hujja).", "Using this as a clue, we performed a keyword search on Getty Images and found a video that shows similar visuals as seen in the viral video. “Yemenis in Sanaa celebrate Prophet Mohammad’s birthday,” reads its description. AFP uploaded the same video on November 2019. It was also reported by US-based platform Voice of America on YouTube, Jordan Times, and the International Quran News Agency in 2019.", "Alt News found that the viral video was uploaded by Media Center for Ansar Allah ( المركز الإعلامي لأنصار الله) on YouTube with the title ‘The full moon has come upon us, the Yamani supporters of the greatest Prophet on the anniversary of his birth’ ( طلع البدر علينا” اليمانيون أنصار النبي الأعظم في ذكرى يوم مولده) in November 2019.", "Therefore, a 2019 video of celebrations of Muhammad’s birthday in Yemen was shared as Chechen Muslims protesting against France.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]