["Democratic presidential candidate Elizabeth Warren speaks during a Democratic presidential primary debate in Manchester, N.H., on Feb. 7, 2020. (AP)", "Sen. Elizabeth Warren took a shot at other candidates and out-of-control campaign spending during the debate before the New Hampshire primary..", "\"Everyone on this stage except Amy (Klobuchar) and me is either a billionaire or is receiving help from PACs that can do unlimited spending,\" said Warren, D-Mass., Feb. 7.", "The question of who is funding the Democratic candidates is a longtime issue for Democratic primary voters. Warren’s assertion distanced her from billionaire candidates and from candidacies aided by donors who can give unlimited amounts.", "Warren is basically right about her rivals’ connection to unlimited political spending. However, we found that a different type of group is supporting her in similar ways.", "The terminology can be confusing, so let’s clarify the definitions.", "Political action committees, or PACs, are vehicles for politically active individuals to pool their money and spend it in political campaigns. There are dollar limits on how much individual donors can give to a PAC and how much PACs can spend on behalf of a given candidate.", "A \"super PAC,\" by contrast, has fewer restrictions. Super PACs, which proliferated after the Supreme Court’s ruling in the Citizens United case, can raise and spend unlimited amounts, as long as they don't directly coordinate with candidates or party committees. Super PACs are often, though not always, established and run by a candidate’s former close aides.", "Super PACs, like regular PACs, publicly disclose their receipts and expenditures to the Federal Election Commission, though they sometimes get big donations from nonprofits, which don't have to disclose their donors. So tracking super PAC funding sources still leaves gaps.", "We’ll note that Warren didn’t say \"super PAC\" in her debate claim, but she clarified in a subsequent tweet that that’s what she was referring to.", "When we checked with the Warren campaign, they provided a list of candidates on the debate stage in New Hampshire. Warren’s list is essentially accurate:", "Joe Biden: Unite the Country (super PAC)", "Pete Buttigieg: VoteVets Action Fund (super PAC)", "Bernie Sanders: National Nurses United super PAC, and Our Revolution", "Andrew Yang: Math PAC (super PAC)", "Tom Steyer: He’s a billionaire. No super PAC", "Amy Klobuchar: She’s neither a billionaire nor a super PAC beneficiary", "Yang and Biden both benefit from groups that were created specifically to support their campaigns.", "Yang benefits from the Math PAC, a play on Yang’s catchphrase, which he says stands for \"Make America Think Harder.\" The super PAC, founded by Democratic operative Will Hailer, reported spending $358,381 through Feb. 10.", "The pro-Biden Unite the Country super PAC, chaired by former Biden aide Mark Doyle, has spent almost $6.5 million, according to disclosures reported to the Federal Election Commission through Feb. 10. That includes extensive expenditures in the early primary and caucus states of New Hampshire, Nevada and South Carolina, the Hill newspaper reported.", "The super PAC that supports Buttigieg is slightly different. VoteVets was established in 2006, when Buttigieg was still a Rhodes Scholar at Oxford University, rather than being purpose-built for his candidacy. Because VoteVets endorsed Buttigieg, a former Navy reservist, the group can use its super PAC on his behalf. It has purchased television advertising to support Buttigieg, the Washington Post reported.", "Sanders, meanwhile, benefits similarly from the super PAC affiliated with National Nurses United. Like VoteVets for Buttigieg, National Nurses United existed before Sanders’s presidential campaigns and has endorsed him.", "Sanders also has the support of a different group, Our Revolution, that was created by Sanders aide Jeff Weaver and was headed for a period by former Ohio state Sen. Nina Turner, another Sanders ally. It isn’t a PAC or super PAC — it’s a 501(c)4 \"social welfare\" organization, which means that it is overseen by the Internal Revenue Service rather than the Federal Election Commission. But it has some similarities with super PACs.", "A 501(c)4 can accept unlimited donations, but it can’t allocate more than half of its spending toward political advocacy. And like super PACs, such groups do not have to disclose their biggest donors. (Our Revolution posts the names of donors, but not the amounts.) In addition, Our Revolution cannot formally coordinate with a candidate it supports. Our Revolution has also supported a variety of other candidates, not just Sanders.", "Warren has the support of an organization that’s affiliated with a 501(c)4 group, the same kind of group as Our Revolution.", "The Progressive Change Campaign Committee has backed Warren over her political career. Currently, the group has Warren in the first slot on the \"candidate\" page on its website.", "While the Progressive Change Campaign Committee is not a super PAC, it is affiliated with the P Street Project, a 501(c)4 group. This means that Warren has the support of a group that, like a super PAC, can accept unlimited donations. It also doesn’t have to disclose its donors.", "Warren said, \"Everyone on this stage except Amy (Klobuchar) and me is either a billionaire or is receiving help from PACs that can do unlimited spending.\"", "She has a point that Steyer is a billionaire and that Biden, Buttigieg, Sanders and Yang are each supported by a super PAC. Some of the super PACs started for the 2020 presidential campaign; some existed beforehand.", "That said, Warren has the backing of a group that has an affiliate organized under section 501(c)4 of the tax code, which allows it operate in much the same way as a super PAC does, even if it isn’t technically a super PAC.", "We rate the statement Mostly True.", "EDITOR'S NOTE, Feb. 19: By Feb. 19, both Warren and Klobuchar were benefiting from super PACs, according to news reports. Both candidates issued statements saying they do not want the help of these groups. As is our policy, our fact-check is made based on the situation at the time the claim was made, and so our rating does not change.", "EDITOR’S NOTE, Feb. 20: One day after our previous editor’s note, Warren changed her position on super PACs, saying that \"If all the candidates want to get rid of super PACs, count me in. I'll lead the charge. But that's how it has to be. It can't be the case that a bunch of people keep them and only one or two don’t.\"", "New Hampshire debate transcript, Feb. 7, 2020", "Federal Election Commission, \"Contribution limits,\" accessed Feb. 10, 2020", "Campaign Legal Center, \"PACs, Super PACs & Dark Money Groups: What's the Difference?\" June 20, 2018", "OpenSecrets.org, outside spending 2020 home page, accessed Feb. 10, 2020", "OpenSecrets.org, \"Outside Spending: Frequently Asked Questions About 501(c)(4) Groups,\" accessed Feb. 10, 2020", "Elizabeth Warren, tweet, Feb. 7, 2020", "VoteVets.org, website, accessed Feb. 10, 2020", "Progressive Change Campaign Committee, \"about us\" page, accessed Feb. 10, 2020", "Our Revolution, donors page, accessed Feb. 10, 2020", "Washington Post Fact Checker, \"Sanders’s claim that he ‘does not have a super PAC,’\" Feb. 11, 2016", "Associated Press, \"Democratic pledges against big money come with an asterisk,\" May 23, 2019", "Washington Post, \"The Trailer: New Hampshire's search for a moderate to love,\" Feb. 9, 2020", "ProPublica, \"How Nonprofits Spend Millions on Elections and Call it Public Welfare,\" Aug. 18, 2012", "New Hampshire Public Radio, \"2020 Candidate Conversation: Andrew Yang,\" May 9, 2019", "Recode, \"A new high-powered super PAC is going to spend millions to back Andrew Yang,\" Oct 18, 2019", "The Hill, \"Super PAC backing Biden plots foray into early primary and caucus states,\" Feb. 4, 2020", "New York Times, \"Major Nurses’ Union Backs Bernie Sanders and His Push for ‘Medicare for All,'\" Nov. 12, 2019", "Associated Press, \"Shadow group provides Sanders super PAC support he scorns,\" Jan. 7, 2020", "Associated Press, \"Democratic pledges against big money come with an asterisk,\" May 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]