["The 30-seconds of footage was published on Facebook here on January 11, 2021. It has since been viewed more than 8,000 times.", "The Indonesian-language post translates to English as: “THEY ARE SCREAMING, CALLING THE LORD'S NAME …", "“Viral Video Moments before the Sriwijaya Air SJ 182 aircraft, Jakarta - Pontianak route crashed ... Oh my God ... Can't watch it\n\t#SJ182 #prayforSJ182”", "Indonesia’s Sriwijaya Air flight SJ 182, which was carrying 62 passengers, plunged into the Java Sea on January 9, 2021, shortly after takeoff from Jakarta, as AFP has reported.", "The footage was also shared alongside a similar claim and viewed over 7,000 times on YouTube and TikTok.", "The video has also appeared with a similar claim in English here on Facebook, and in Chinese here on YouTube and here on Weibo.", "The claim, however, is false.", "The original footage was posted on Instagram here on October 29, 2018, by a user with the handle @marapi_singgalang.", "A post shared by ALGUMARA (@marapi_singgalang)", "Translated from Indonesian language to English, the post reads in part: “Deep condolences for the incident experienced by @lionairgroup plane #lionair #lionjt610.", "“This is a video taken by myself on a flight that made me so traumatised I no longer want to travel by plane.", "“At that time the #lionair Flight JT 353 flight, was supposed to leave at 10.30 a.m. had to be delayed until 12.30 p.m.", "“And the travel time from Padang to Jakarta should be 1 hour 40 minutes. It became so long, 4 hours.\n\tDue to turbulence, engine shutdown etc.”", "Tha caption is referring to the deadly Lion Air crash on October 29, 2018, which AFP has reported on here.", "The video in the misleading post has been flipped horizontally from the original footage.", "Below is a screenshot comparison between the video in the misleading post (L) and the original Instagram video (R):", "On October 29, 2018, @marapi_singgalang also posted further details about his video here, telling people not to spread a hoax and to read his posts carefully.", "He explained that he had posted the video because the Lion Air crash reminded him of his own terrifying experience aboard another Lion Air flight.", "But the footage was also misused in 2018 and circulated alongside false claims that it showed the final moments before the Lion Air Flight JT 610 accident. AFP debunked that false claim at the time, here.", "David Ditama, who owns the @marapi_singgalang Instagram account, told AFP in 2018 that the video was taken when he was flying Lion Air flight JT 353 from Padang, in West Sumatra province, to Jakarta on December 11, 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]