["According to certain online depictions of Bill C-75, a proposed bill meant to reform the Canadian judicial system, child abduction will no longer lead to prison time, and penalties will be relaxed for human trafficking.", "An article published in the Geller Report in September 2018 tries to tie changes to the criminal justice system to concerns about sharia law. The article, which was shared nearly 4,000 times and has inspired other similar articles, heavily quotes a blog post by Conservative member of parliament Ted Falk, who shared concerns about the bill.", "Falk had pointed out that child abduction, benefiting from human trafficking, or participating in terrorist activities could be tried as summary offences in court, and couldlead to a maximum sentence of two years minus a day, compared with an automatic ten years at the moment.", "Nowhere in Falk’s explanation of his concerns about the bill is Islam mentioned, and a word search of Bill C-75 shows that the word Islam is absent from the text.", "Bill C-75 is an omnibus bill that was proposed by Minister of Justice Jody Wilson-Raybould in the House of Commons in March 2018. The bill’s main aim is to reduce court delays through wide-ranging reform of Canada’s judicial system.", "Today, I was pleased to introduced #legislation (Bill C-75) that will work to reduce #court delays, while ensuring that Canadians have a well-functioning criminal justice system that respects their rights and maintains public safety: https://t.co/EJbnm3hv4F #CdnJusReform", "The bill’s scope has led to a variety of concerns across the political spectrum, and so was referred to the Standing Committee on Justice and Human Rights in June 2018. There, it was further debated while the committee heard more than 90 witnesses who suggested changes to the bill, committee chair and Liberal MP Anthony Housefather, told AFP. The committee is expected to present its findings on October 24, Housefather added. Housefather anticipates the bill will be amended, but said he trusts that the Liberal majority will vote for the bill.", "Bill C-75, as it currently stands, does give more latitude to actors of the judiciary in deciding how to prosecute certain crimes. The bill would allow some indictable offences to be processed as summary convictions, or resolved without a jury trial and/or indictment. The maximum prison sentence for summary convictions would also be raised to two years less a day.", "“They hybridized every offence that was solely indictable that had a ten year maximum,” Tony Paisana, a lawyer who testified before the Standing Committee on Bill C-75 as the Chair of the Law Reform Committee of the Canadian Bar Association’s National Criminal Justice Section, told AFP. The offences are said to be hybridized because they can lead to criminal offences being legally processed in more than one way.", "Under the current criminal code, most of the offences associated with abduction and human trafficking can only be charged as indictable offences, crimes considered more serious and which typically receive longer prison sentences and higher fines.", "Abduction of a person under sixteen and abduction of a person under fourteen are two examples of offences that will be hybridized. However, Paisana, whose committee proposed changes to bill C-75 despite overall approval of the reform effort, argued that prosecutors will still use common sense. “No prosecutor is going to do a very serious case by way of a summary conviction,” he said.", "Human trafficking (279.01) currently carries a mandatory minimum penalty of four years in prison, and the penalty will remain as it is now. There is no relaxation of penalties for this offence under Bill C-75. However, benefiting financially or materially from human trafficking (279.02) will be hybridized, meaning it could carry a lower sentence in less serious cases.", "For serious offences, Célia Canon, Communications Advisor at the Office of the Minister of Justice stresses that: “Judges are still required to impose sentences that are proportionate to the gravity of the offence and the degree of responsibility of the offender.”", "Bill C-75 will most likely be amended before it becomes law. In the meantime, it does not remove prison sentences for child abduction or human trafficking. It grants prosecutors the ability to bring action against those crimes in different manners, which may result in shorter jail sentences depending on the gravity of the case.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]