["Republican Eric Esshaki, a former nurse, is vying to unseat incumbent Rep. Haley Stevens, D-Rochester Hills, in Michigan's 11th congressional district, which she flipped from red to blue in 2018. In an ad, Esshaki attacks Stevens on health care, promising to stop her plan for \"socialized medicine.\"", "\"She’d eliminate 100,000 doctors and nurses,\" the ad says.", "The evidence Essahaki’s campaign cites comes from a report funded by a group lobbying against Medicare for All that makes problematic assumptions to support its analysis.", "While some progressive Democrats are pushing for a single-payer system to replace private insurance, others are calling for a public option, a government-sponsored program that would be available alongside private plans through the Affordable Care Act’s exchanges.", "Stevens has publicly been on both sides of this divide, but her latest position is in favor of the public option.", "At the time Esshaki’s campaign produced the ad, Stevens had already moved away from Medicare for All, campaigning instead on a public option. Although her stance on Medicare for All has shifted over time, she told PolitiFact Michigan she does not support Medicare for All.", "What’s the difference between Medicare for All and a public option?", "Medicare for All would create a single, national health insurance plan supported by payroll taxes that would cover every American, mostly eliminating private health insurance.", "Under public option proposals, by contrast, Americans would have the choice of a government health plan in addition to private insurance options.", "Some critics argue this would inevitably lead to a single-payer national system if private insurers aren’t able to compete with the government’s prices and quality.", "But advocates of a public option have differing ideas of the role it would play in the health care system. Those who support a modest version envision the public plan as a kind of last resort for those who cannot find affordable private insurance, while others see it as a transitional step toward Medicare for All.", "Would Stevens’ health care plan eliminate 100,000 doctors and nurses?", "Esshaki bases his claim that Stevens’ health care plan would eliminate 100,000 doctors and nurses on a report published this year by FTI Consulting, a global consulting firm with offices around the world, that projects a loss of nearly 45,000 physicians and 1.2 million nurses by 2050 under Medicare for All.", "The report was funded by Partnership for America’s Health Care Future (PAHCF), a group of medical professionals, hospitals, health insurers and pharmaceutical companies lobbying against Medicare for All and public option proposals.", "The report notes that countries where physicians are paid more have more physicians. The FTI analysis then assumes that Medicare payment rates would remain constant under Medicare for All, and looks at how a decline in incomes would affect the supply of physicians in the U.S.", "But \"the relationship between physician salaries and physician supply is an association and not necessarily causal\" warns Joelle Abramowitz, a University of Michigan economist. Meanwhile, \"the calculation assumes that all other components of Medicare as it is currently implemented for seniors will remain the same under Medicare for All, which is likely not the case,\" Abramowitz said.", "Esshaki’s campaign shared another report with PolitiFact Michigan that found that a public option would eliminate the jobs of 420,000 health care employees. This report was also funded by PAHCF and assumes that a public option would reimburse health care providers at current Medicare rates. It does not specify how many doctors and nurses are included in this figure.", "Robert Pollin, an economist at the Political Economy Research Institute of the University of Massachusetts-Amherst told Kaiser Health News that Medicare for All would entail significant job losses. \"Every proponent of Medicare for All — including myself — has to recognize that the biggest source of cost-saving is layoffs,\" he said.", "But experts predict most of the job losses under Medicare for All would be in the health insurance industry, such as insurance brokers, medical billing workers and other administrative roles. Some argue that Medicare for All, by decreasing the number of uninsured Americans, would increase demand for health care providers, including doctors, physician assistants and nurses.", "Stevens supports a public option over Medicare for All", "During her 2018 campaign, Stevens advocated for Medicare for All. In a June 2018 tweet she wrote, \"Medicare for all. NOW.\" That same month, during a candidate forum, the former Obama administration official said, \"We absolutely need to propose legislation to provide Medicare for All.\"", "This did not remain her position for long. A month before she won her seat, BuzzFeed reported Stevens supports a voluntary public option instead of Medicare for All. In a debate days before she was elected, Stevens said, \"I think that Medicare for All is a place where we can grow and go into, but for right now we need to focus on the cost of prescription drugs.\"", "A Medium article written by a member of Michigan for Single Payer in early 2019 notes Stevens has \"said in private\" that she supports a Medicare for All bill \"but has not done so publicly.\" Stevens has not co-sponsored Medicare for All bills late introduced in the current Congress.", "Back on the campaign trail, Stevens has said she supports a public option instead of Medicare for All. \"We need to work together to fix the Affordable Care Act (ACA), not dismantle it,\" her website reads.", "When asked to clarify her stance on Medicare for All, Stevens told PolitiFact Michigan, \"I do not support Medicare for All. I believe we can expand and improve on the Affordable Care Act to achieve the goal I have spent my life fighting for: the right for every American to have healthcare.\"", "Our ruling", "Esshaki claims that 100,000 nurses and doctors would disappear under Stevens’ \"plan for socialized medicine.\"", "The studies Esshaki’s campaign shared make problematic assumptions and were from a group lobbying against Medicare for All.", "While Stevens has supported Medicare for All in the past, her current position is for a public option, and she told PolitiFact Michigan that she does not support Medicare for All.", "The ad comes up short in offering a fair characterization of Stevens’ views and a credible assessment of the impact of her health care policies.", "We rate its claims Mostly False.", "Eric Esshaki, Facebook post, July 10, 2020", "Haley Stevens, tweet, June 22, 2018", "MI-11 Democrat Candidates Forum, YouTube video, June 26, 2018", "BuzzFeed, \"Suburban Women Are Fed Up With The Republican Party And Could Drive A Blue Wave,\" October 16, 2018", "ClickOnDetroit, \"Flashpoint 11/04/18: Michigan attorney general, 11th Congressional District candidates debate,\" November 4, 2018", "116th Congress, \"H.R.1384 - Medicare for All Act of 2019 - co-sponsors,\" introduced February 27, 2019", "116th Congress, \"H.R.2452 - Medicare for America Act of 2019 - co-sponsors,\" introduced May 1, 2019", "116h Congress, \"H.R.1346 - Medicare Buy-In and Health Care Stabilization Act of 2019 - co-sponsors,\" introduced February 25, 2019", "Haley Stevens campaign website, \"Affordable Healthcare for Every American,\" accessed July 28, 2020", "PolitiFact, \"Medicare for All: What it is, what it isn't,\" February 19, 2019", "Vox, \"Joe Biden’s health care plan, explained,\" July 16, 2019", "Forbes, \"The Public Option: Medicare For All, Part One,\" February 18, 2020", "NBC News, \"2020 Democrats who want a 'public option' don't always want the same thing,\" July 19, 2019", "116th Congress, \"H.R.2452 - Medicare for America Act of 2019,\" introduced May 1, 2019", "FTI Consulting, \"Medicare for All and the Future of America's Health Care Workforce,\" 2020", "Kaiser Health News, \"Analysis: A Health Care Overhaul Could Kill 2 Million Jobs, And That’s OK,\" May 24, 2019", "POLITICO, \"Medicare for All’s jobs problem,\" November 25, 2019", "Navigant, \"The Potential Impact of a Medicare Public Option on U.S. Rural Hospitals and Communities: A Scenario Analysis,\" AUgust 2019", "Joelle Abramowitz, economist, University of Michigan, email, July 27, 2020", "Dan Hazelwood, Esshaki campaign spokesperson, email, July 20, 2020", "Dan Hazelwood, Esshaki campaign spokesperson, email, July 24, 2020", "Partnership for America’s Health Future, website, accessed July 28, 2020", "Blake McCarren, Haley Stevens for Congress, email, July 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]