["About this rating", "An embarrassing 2016 incident for the Joe's Crab Shack restaurant chain received renewed attention two years later after an upswing in the number of social media users sharing the story online:", "Both local and national news outlets took notice when two diners, Chauntyll Allen and Tyrone Williams, publicly criticized the chain for using the picture of a black man being hanged as part of its table decorations while dining at a Joe's outlet in Roseville, Minnesota. The picture, which reportedly captured the execution of 21-year-old Richard Burleson in 1895,  included the caption, \"All I said was I didn't like the gumbo.\" Burleson was publicly executed after being convicted of murdering a white man, J.G. McKinnon.", "Williams said at the time, \"We just instantly felt sick and confused.\"", "The Minneapolis chapter of the National Association for the Advancement of Colored People (NAACP) demanded that Joe's Crab Shack apologize for using the picture and remove \"any and all lynching or otherwise racially-offensive imagery.\" City officials in Roseville also condemned the use of the photo.", "David Catalano, chief operating officer of Joe's parent company Ignite Restaurant Group, said in a statement:", "We understand one of the photos used in our table décor at our Joe's Crab Shack location in Roseville, MN, was offensive. We take this matter very seriously, and the photo in question was immediately removed. We sincerely apologize to our guests who were disturbed by the image and we look forward to continuing to serve the Roseville community.", "The Roseville restaurant was one of several locations that was shuttered in August 2017 as part of the bankruptcy proceedings for the Ignite Restaurant Group.", "Walsh, Paul.   \"Joe's Crab Shack in Roseville Among Many in U.S. Now Closed.\"\r\n    Minneapolis Star Tribune.   16 August 2017.", "Tan, Avianne.   \"Joe's Crab Shack Under Fire for Using Photo of Black Man's Hanging as Table Decor.\"\r\n    ABC News.   11 March 2016.", "KARE-TV.   \"Joe's Crab Shack Sorry for Controversial Picture.\"\r\n    10 March 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]