["About this rating", "In late April 2019, a hoax spread on Facebook alleging that a sex-trafficking ring was attempting to locate unwitting girls on another social platform, Snapchat. Police and Snapchat both confirmed the rumor to be unfounded.", "Real instances of human trafficking are of true concern, with an estimated 40 million people forced into labor and exploitation worldwide. Nevertheless, the topic of sex trafficking has also been the focus of multiple viral internet hoaxes and scarelore.", "The most recent iteration of a trafficking-themed hoax started with a 23 April 2019 Facebook post that stated the ring was targeting people in Lawrence, Mass. The claim was that the criminal ring could use Snapchat to locate unwitting girls, kidnap them and sweep them into the sex-trafficking operation.", "It was shared thousands of times and includes images of what appear to be people's Snapchat profiles. The post reads:", "UPDATE:\nSo there’s a sex trafficking ring going on in Lawrence Mass. If you get a random person who tries adding you on Snapchat this morning and it says “added by search” it’s the trafficking ring and they’re using snapchats to locate girls. I received one this morning, didn’t accept because I don’t accept people that I don’t know because of this reason. Be safe! ?\nPs.... try me!!!???\nUpdate- I’m only making this post in good taste. Bringing awareness for ANY type of sex crime/crimes in the area as anybody else would upon learning and seeing things I had seen. That is what a social platform is for and supposed to be used to help people. I DID NOT mean to inflict fear, only knowledge, so people can be safe. I heard about it and have seen evidence for myself based off the photo. Not releasing any names or anything personal due to respect of privacy. Only reason why I posted this was because I was worried about family members, friends, and concerned for my community. Police were notified. And things are being handled.", "Police did in fact weigh in on 24 April 2019 to debunk the claim that a sex-trafficking ring was leveraging Snapchat to capture girls.", "Using official social media channels, Lawrence police stated that, \"The LPD has been made aware of a social media scam referring to sex trafficking. There is no substance to this matter. As always the public should use caution when responding to, or clicking on posts from individuals they do not recognize.\" Snapchat also stated that the allegation appears to be \"a case of disinformation.\"", "The hoax appeared to exploit a lack of understanding about how Snapchat works. Namely, users' locations are not shared unless they opt to do so, and even then, their locations are only revealed to friends they have selected to share them with. In other words, even if a Snapchat user opted to add a stranger as a contact, the user would have to actively choose in the platform to share a location with that stranger. (The company advises users against adding people they don't know.)", "Perhaps because they constitute an overlap of the salacious and the frightening, \"sex-trafficking-ring\" internet hoaxes are regular occurrences. In August 2018, social media users circulated an unfounded claim that text messages containing the phrase \"a friend has complimented you in IRL\" were linked to sex trafficking. In February 2019, a woman took to Facebook to falsely report that a mix-up resulting in her getting into the car of the wrong Uber driver involved the threat of sex trafficking. Police stated that was not the case.", "Social media users on all platforms can employ basic safety measures to keep certain information that might leave them vulnerable to crime out of public view. For example, users can avoid posting their locations with strangers, manage privacy settings and only allow people they know into their networks.", "International Labor Organization. \"Forced Labour, Modern Slavery and Human Trafficking.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]