["Two videos have gone viral with the claim that people from the Muslim community are hoarding food supplies and wasting food amidst the lockdown imposed to tackle coronavirus.", "Video 1: Shot at night", "A 90-second video of a man who claims to be reporting at a slum near Gandhi Ashram has gone viral. In this video, the man says that since past seven or eight days he has been visiting these slums to give food. However, he claims that some people have been hoarding the relief food even when they have more than enough supplies of their own. Later in the video, he enters a house and shows various food items – a portion of chicken, a meagre quantity of flour and nine food packets. The video also shows stacks of pooris lying on a table. Just as the pooris are shows we can hear goats bleating in the background. While the man walks out, we see a lady sitting on the ground. She said, “We took them out because of the dal.” The man wraps up the video by requesting people of Meerut not to distribute food at slums near Gandhi Ashram.", "The readers should note that police officers can be seen in the viral video and the fact that the man in the video made no communal comments", "Alt News has received several requests to fact-check this on WhatsApp (+91 76000 11160) and on our official Android application with the claim that “people of Muslim communities are deliberately hiding food.”", "Facebook page Najafgarh Confession shared the viral video sans communal subtext.", "खाना बाँटने से पहले ये देख लो! हम तो सोचते है भूखे होंगे ये तो अच्छा चिकन खा रहे है! सब एक जैसे नहीं है लेकिन अब ज्यादा लोग सामान इकठ्ठा कर रहे! वीडियो बने वाले भाई को दिल से धन्यवाद!", "Posted by Najafgarh Confessions on Friday, April 10, 2020", "Video 2: Shot in daylight", "Several Facebook users have posted a different one-minute video with the claim that Muslims are hoarding food so that poor Hindus are starved. This video shows the man from video 1 in an orange kurta. Just like the first video he appears to be reporting. According to him, food is being wasted at a leprosy ashram. The video shows a room where pooris are lying on the floor. It is pertinent to note only the man who appears to be reporting can be seen in the video. The video abruptly ends with the frame of stacks of jute bags.", "Just like video 1, no communal comments were made by the man in the video.", "On April 12, Kumar Ajit posted the viral video and wrote in Hindi, “#Caution #Food_Jihad has started, loot the food and let it go bad, don’t let the food reach to any Hindu poor, so that the government looks bad and poor Hindus die (translated from #सावधान #खाना_ज़िहाद शुरू हो चुका है, खाना लूटो और उसे खराब कर दो, किसी हिन्दू गरीब को खाना ना पहुँचने दो, ताकि सरकार बदनाम हो और गरीब हिन्दू भूखा मरे ). This video has been viewed over 66,000 times and shared by more than 2,700 users. (archive link)", "। #सावधान ।। #खाना_ज़िहाद शुरू हो चुका है, खाना लूटो और उसे खराब कर दो, किसी हिन्दू गरीब को खाना ना पहुँचने दो, ताकि सरकार बदनाम हो और गरीब हिन्दू भूखा मरे ।", "Posted by Kumar Ajit on Saturday, April 11, 2020", "A Facebook user even felt the need to mention ‘muslanmanoo’ and ‘jihadiyon’ in brackets just in case the communal subtext wasn’t clear.", "Alt News found a Facebook post by Mukesh Garg which includes two videos, video 1 and a longer version of video 2, posted on April 10. It is pertinent to note the man seen the viral videos cannot be seen in the second video uploaded by Garg.", "He wrote, “All the institutions of the country must watch both these videos. Look how slum dwellers and disrespecting the god of food (translated from देश की सभी संस्थाओं को यह दोनो वीडियो जरूर देखनी चाहिये।यह झुगी झोपड़ी वाले अन्न देवता का कैसे अनादर कर रहे है।). This post is massively viral, it has been shared over 63,000 times. One of the videos has over 11 lakh views (Video 1) while the other has over three lakh views. (archive link)", "At the very first second in video 1, a car’s number plate is visible – UP 15 CN 2507. Using this as a clue, Alt News looked up its registration details and found that it registered at Meerut RTO to one Ankur Sharma.", "We then performed a keyword search on YouTube and found a report published by Jan TV on April 10. This video shows footage from both the viral videos.", "Jan TV aired a few seconds of both viral videos on mute and presented a similar narrative that poor marginalised people from leprosy ashram and slums near Gandhi Ashram are hoarding food supplies. The report also added that these people sell excess food. The report included a statement from district magistrate Ajay Kumar Tiwari. He discouraged hoarding and said that authorities will look into the claims made in the viral video. Tiwari added that authorities will visit the slums where food is being wasted and explain to them that there is no food shortage. Tiwari acknowledged that selling of meat is a serious matter and said no one is authorised to sell meat.", "Alt News reached out to multiple journalists in Meerut hoping to find more details about the videos. According to them, the man in the video is Navneet Balaji, a member of Hindu Yuva Vahini (HYV). HYV is a youth organisation founded by Uttar Pradesh chief minister Yogi Adityanath. Balaji refuted the claim made by JAN TV that people are selling excess food.", "Alt News spoke with Balaji. He said, “I work in the real estate sector,” and confirmed that he is a part of HYV. Explaining the context behind the viral video he said, “I heard that some marginalised people were hoarding food. So I decided to look into the matter along with the government officials.” Balaji didn’t reveal the identity of the officials to Alt News. When we informed that the video is being shared with communal narrative, Balaji clarified that there is no communal angle to this video. “I just wanted to show that some people are taking more food supplies than required.”", "Balaji told us that video 1 was shot on April 9 and video 2 was shot a day prior. “Multiple people were shooting the video on April 8, that’s why there are two versions of the video online,” he added, “There is no Hindu-Muslim angle to my videos.”", "Alt News reached out to a local journalist (identity concealed at request) who visited the location where the video was shot. According to the journalist, the slums are located 100 metres away from Gandhi Ashram crossway.", "According to the journalist, the woman is the video has nine family members. Alt News crossed checked this with Ashutosh Kumar, inspector Nauchandi, Meerut. “The woman seen in the viral video is Kasturi and she belongs to a Hindu family,” the inspector added.", "As per the journalist, Kasturi explained that pooris had dampened because they were packed with dal which is why she placed them outside to dry. In the video, we can hear Kasturi trying to make this point twice. Inspector Kumar said, “She told us that uses these pooris with other food that is given to her.” The journalist also told that he got the same explanation from Kasturi.", "The journalist added that many families in slums accept extra food packages because there is an uncertainly about their next meal. While speaking with Alt News, inspector Kumar said, “These people get food from the government or NGOs. They accept food from everyone hoping to secure the next meals.”", "The image below shows four screenshots from the video of various food items – chicken and chapati, pooris (which were next to chicken curry), boxes (that don’t look like food parcels, possibly empty) and flour. Anyone in the right mind will not label this quantity as hoarding. However, Balaji felt that Kasturi’s family had excess food.", "Inspector Kumar informed, “Kasturi got chicken from Lisari gate. We told her not to do this in future (until lockdown).” Alt News checked the distance of Lisari gate from Gandhi Ashram crossway in order to verify it was practically possible to make this trip during the lockdown. We found out that Lisari gate is within a two-kilometre radius from Kasturi’s home.", "The viral video also shows boxes of food – possible flavoured rice or biryani. Balaji suggested that the family had taken more food than necessary. However, in the picture, we can clearly see the boxes match the number of members in Kasturi’s family.", "Inspector Kumar clarified that social media claims are baseless and added, “The family shown in the video is a Hindu family.” Balaji also confirmed that there is no communal narrative, as mentioned above.", "Balaji added, “After I learnt that the video got viral, I realised that the families in this area might be struggling to get food from NGOs. Since last two days, I have been going to this area to give them food.” Alt News couldn’t independently verify this claim.", "Thus, the social media claim associated with the first viral video is false. Additionally, Balaji’s allegation that the family shown in the video is hoarding food doesn’t hold water. Moreover, entering someone’s home without permission and filming them inside is a gross violation of privacy.", "At the beginning of the video, Balaji said he is at Kusht Ashram behind a mehal. Using that as a clue, Alt News performed a keyword search on Google and found Shri Vivekanand Kusht Ashram (SVKA), a leprosy shelter. As per Just Dial, the ashram is located on Delhi Road, behind Mukud Mehal.", "Alt News tried looking up for the ashram on Google maps but couldn’t find it. After speaking with Balaji, we learnt that the ashram is located behind Hotel Mukut Mahal, Delhi Road. Since it is not marked on the map, Alt News requested Balaji to pin-point in on the map. The screenshot below highlights the location of Shri Vivekanand Kusht Ashram (SVKA), as per Balaji.", "Balaji said, “On April 8 we visited the ashram in order to assess if they need food supplies. While inspecting the premises we saw few doors that were locked. One of our team members managed to have a peek inside and pointed out that there is food lying on the ground.” As stated above, he clarified that there is no communal narrative in the video.", "Alt News spoke to Sachin, secretary at SVKA. Sachin informed that in the ashram only members of the Hindu community stay and refuted the communal narrative on social media. According to him, they had received food on Kanya Poojan which was celebrated on April 1 this year. “This year we received pooris in extra quantity. Despite distributing it among ashramites food was left. We were going to give it to a gaushala,” Sachin said. He added that they received food from Amar Ujala newspaper as well.", "However, as per Balaji, the ashram authorities didn’t explain why they had so much food rotting in a room.", "Alt News spoke with Rajan Tripathi regional editor Amar Ujala, Meerut. According to Tripathi, SVKA had reached out, prior to April 1, for aid because they were struggling to feed the people at the ashram. He also pointed out that the ashram is very close to their office. Alt News checked on Google maps and found that it is within a two-kilometre radius.", "Tripathi said, “I find it unlikely that Kanya Poojan was celebrated due to the lockdown. However, it is likely that the ashram got more food than the requirement. Thus a lot of it was wasted.” When we informed that the video is being shared with a communal narrative, he said, “This a leprosy ashram – people all faiths are welcome. However, as far as my knowledge only Hindu community residents here.”", "Alt News also spoke with an inspector at Nauchandi police station who looked into this incident. He said, “After the video went viral the police visited the ashram. However, by then all the excess food lying was cleared up. Thus no case was registered.” The inspector confirmed, “There is no communal narrative to this incident.”", "Despite the inconsistencies on why food was wasted in the ashram, the claim that Muslims are stocking up food supplies in this ashram was refuted by Meerut Police, Navneet Balaji (the person who recorded the video), Sachin, secretary at the Shri Vivekanand Kusht Ashram and Rajan Tripathi, regional editor Amar Ujala, also have the same statement.", "Two videos went viral from Meerut around April 10. The initial claim was that marginalised people are stocking up food. However, several people subsequently shared it with the communal narrative on social media. Alt News investigated both the videos and verified that both claims do not hold water.", "Donate Now", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…"]