["About this rating", "As Christmas 2017 approached, social media users began circulating an image of a vintage-looking box labeled \"Asbestos: Pure White Fire Proof Snow\" and questioning if the packaging really contained artificial snow made out of what is now a widely-recognized carcinogen:", "In the early half of the 20th Century, asbestos was widely used as Christmas decor because of its white, fluffy appearance -- but that was before the substance was recognized as a major risk factor for an aggressive form of cancer known as mesothelioma, as the Asbestos.com website reports:", "Asbestos was once marketed as artificial snow and sprinkled on trees and wreaths and ornaments. Although those products have not been produced for many years, the oldest decorations that were passed down from one generation to the next, may still have small amounts of asbestos.", "The most famous asbestos snow scene was used during the filming of \"The Wizard of Oz,\" the 1939 classic with Judy Garland that became the most watched film in history. There is a scene in the movie where snow, made from asbestos, falls on Dorothy and her friends, awakening them from a spell cast by the Wicked Witch of the West.", "The above displayed above depicts a real item sold to consumers in the mid-20th century. The picture was taken by Tony Rich, an industrial hygienist and amateur photographer who catalogs asbestos images on the photo-sharing platform Flickr using the moniker Asbestos Hunter. Rich, an anti-asbestos activist, originally shot the picture in 2009.", "Rich told us he has the actual box in storage and directed us to another photograph that shows the product was manufactured by National Tinsel Manufacturing Company and sold in the late 1940s through the 1950s:", "This brand actually contains amphibole asbestos \"amosite\", very toxic.", "Generally speaking, asbestos was used by the tens of millions of tons for nearly over a century and a half in modern history for a wide variety of applications, mostly due to its fire resistance, insulating properties, durability/strength, inertness, could be woven, and was cheap and abundant.", "Major asbestos manufacturers had large [research and development] programs constantly finding new ways to use asbestos. I believe the most tragic use was in cigarette filters.", "Rich told us many people are surprised to learn that, despite its significant link to cancer, asbestos isn't completely banned in the United States. Aside from raising awareness with his camera as \"Asbestos Hunter,\" Rich serves on the Prevention Advisory Board for the non-profit Asbestos Disease Awareness Organization (ADAO), on whose blog he wrote in 2015:", "The United States has a very long history of asbestos usage, a tragic history that continues to be written to this day, to the ultimate detriment of its citizens…our loved ones, neighbors, and future generations.", "During that time, tens of millions of tons of asbestos materials were put into our nation's buildings and infrastructure, most of which remains in place today.", "Eventually, laws and regulations were created in an attempt to help protect employees and the public from the toxic legacy left by asbestos. However, despite the volumes of asbestos standards, many still face ongoing problems related to regulatory under-enforcement, poor risk management or by simply failing to identify basic asbestos hazards.", "Compounding these issues, asbestos continues to be imported into our country, primarily due to the alarming fact that asbestos has not yet been completely banned. Further, asbestos has been repeatedly found in a wide variety of new consumer products as reported by recent independent studies. Some of these asbestos-containing products include children's toys and crayons, readily available from retail marketplace's shelves.", "Rich, Tony.   \"The United States of Asbestos?\"     Asbestos Disease Awareness Organization.   28 August 2017.", "Smith, Ernie.  \"The Slow Demise of Asbestos, The Carcinogen that Gave 'The Wizard of Oz' Snow.\"     Atlas Obscura.   1 August 2016.", "Mauney, Matt.   \"CDC: Mesothelioma Deaths on the Rise.\"     Asbestos.com.   10 March 2017.", "Povtak, Tim.   \"Christmas Decorations in the Attic Might Be Sprinkled with Asbestos.\"     Asbestos.com.   1 December 2011.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]