["By Saranac Hale Spencer and Angelo Fichera", "Posted on July 28, 2020", "A widely shared video, featuring a doctor falsely claiming hydroxychloroquine is a “cure” for COVID-19, ignited an online storm that resulted in the video being pulled by social media platforms. There is no known cure for COVID-19, and current scientific evidence hasn’t found that hydroxychloroquine is an effective treatment.", "A video pushing the use of an unproven COVID-19 treatment has received widespread attention, including on Twitter by President Donald Trump and Donald Trump Jr., whose account was temporarily suspended for directly sharing the video.", "Twitter, YouTube and Facebook have been removing the video since it started circulating on July 27 and amassing millions of views. The video spreads the debunked claim that COVID-19 can be cured with hydroxychloroquine — the drug that has been continuously touted by the president.", "The clip features a Houston-area doctor named Stella Immanuel wearing a white coat in front of the U.S. Supreme Court building as she proclaims that a cocktail of hydroxychloroquine, zinc and the antibiotic azithromycin has cured COVID-19 patients.", "Immanuel was speaking at a press conference arranged by an organization called “America’s Frontline Doctors.” We couldn’t find much information about the group and neither its founder, Simone Gold, nor its lawyer, Steven Mitby, returned our calls for comment. But the group appears to be connected to the Tea Party Patriots Foundation, which runs the conservative Tea Party movement. The group’s logo and an open letter to Trump written by Gold are featured on a webpage copyrighted by the foundation.", "Gold is a licensed doctor in California, although it appears that she most recently ran a concierge medical business, which she described on her website as working “the same way as a highly effective Fortune 100 CEO.” Her website says Gold “reads the latest research, consults with the foremost experts, and examines the scientific literature” to provide “very high quality CEO-level information to her client-patients.”", "However, in April, as the COVID-19 pandemic spread across the U.S., Gold stood outside the Cedars-Sinai Medical Center in Los Angeles wearing a white coat embroidered with her name above the words “Emergency Dept.” and recorded videos about her “experience practicing emergency medicine in this era of the COVID-19 crisis.”", "In one video she claimed “the emergency department volume is down.” In another video in front of the hospital, she reported that, “we have been very successful at flattening the curve.”", "But Gold has never worked at the hospital. In fact, the only time she was affiliated in any way with Cedars-Sinai was when she worked on a per-diem basis in a Cedars-Sinai Medical Network urgent care clinic for less than three weeks in 2015, Sally Stewart, a spokeswoman for Cedars-Sinai told FactCheck.org in an email.", "Immanuel has an equally opaque background, and she didn’t return our calls either.", "Immanuel is a licensed doctor in Texas and lists her practice as the Rehoboth Medical Center. That medical center is listed as being registered with the Texas Comptroller of Public Accounts in September 2019 by Solange Gabice. We reached Gabice by phone, but she hung up when we asked if her clinic was treating COVID-19 patients with hydroxychloroquine.", "It’s worth noting also that the same strip mall in Katy, Texas, that houses the clinic also houses Fire Power Ministries, a Christian ministry run by Immanuel.", "During a July 28 press briefing, the day after the video went up, Trump questioned why social media platforms had been removing it. “They’re very respected doctors,” the president said.", "When a reporter asked him about Immanuel, who also has claimed that doctors make medicine using DNA from aliens, Trump noted that she appeared with several other doctors.", "“I thought she was very impressive in the sense that she came — I don’t know which country she comes from — but she said that she’s had tremendous success with hundreds of different patients,” he said. “And I thought her voice was an important voice, but I know nothing about her.”", "In the video, Immanuel repeats the word “cure” a half-dozen times when referring to using hydroxychloroquine to treat COVID-19, saying it can prevent any COVID-19 deaths.", "“Nobody needs to get sick. This virus has a cure,” she says at one point. “It is called hydroxychloroquine, zinc and Zithromax.” (Zithromax is a brand name for the drug azithromycin.)", "First of all, there is no known “cure” for COVID-19, as the Centers for Disease Control and Prevention points out. And the current scientific evidence doesn’t support the conclusion that hydroxychloroquine is effective in treating the disease, as we’ve explained before.", "Since early in the novel coronavirus pandemic, hydroxychloroquine — a drug that is used to treat malaria and other illnesses — has been touted as a potential treatment. Trump has repeatedly cited it, at one point referring to it as a “game changer.”", "But numerous randomized controlled studies have cast serious doubt on its effectiveness when it comes to COVID-19.", "“There are no data from randomized clinical trials that demonstrate effectiveness of hydroxychloroquine for COVID,” Dr. Neil Schluger, chairman of the department of medicine at New York Medical College School of Medicine, told us in a phone interview. Schluger has studied hydroxychloroquine in relation to COVID-19. “There are now several randomized clinical trials that show that it had no effect.”", "“The vast majority of expert opinions … is that hydroxychloroquine has no benefit in COVID illness,” he added.", "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, also said the drug is “not effective” for treating COVID-19 in a July 28 interview on ABC’s “Good Morning America.”", "“The overwhelming prevailing clinical trials that have looked at the efficacy of hydroxychloroquine have indicated that it is not effective in coronavirus disease,” Fauci said.", "As we’ve reported before, the Food and Drug Administration had issued an emergency use authorization in March to allow adult and some adolescent patients hospitalized with COVID-19 to obtain hydroxychloroquine and chloroquine from the Strategic National Stockpile “when clinical trials are not available, or participation is not feasible.”", "Amid growing evidence the drug is not effective, the FDA announced in June that it had revoked the EUA for the drugs because they are “unlikely to be effective in treating COVID-19 for the authorized uses in the EUA,” and that the “known and potential benefits” of the drugs “no longer outweigh” the risks — which can include “serious cardiac adverse events and other potential serious side effects.”", "A large randomized controlled study called RECOVERY, in the U.K., reported in a preprint, which hasn’t been peer-reviewed, that hydroxychloroquine wasn’t associated with reduced mortality — and was actually associated with “an increased length of hospital stay and increased risk of progressing to invasive mechanical ventilation or death.” The study said that 26.8% of the 1,561 patients given hydroxychloroquine died within 28 days, whereas 25% of patients given usual care died in that time span — a difference that was not statistically significant.", "The authors wrote that “these results indicate that hydroxychloroquine is not an effective treatment for patients hospitalized with COVID-19.”", "Another study published July 16 in the Annals of Internal Medicine — a randomized, double-blind, placebo-controlled trial that involved more than 400 participants  — found that “[h]ydroxychloroquine did not substantially reduce symptom severity in outpatients with early, mild COVID-19.”", "There was one observational study by the Henry Ford Health System, published in the International Journal of Infectious Diseases on July 1, that found hydroxychloroquine was associated with lower mortality for patients hospitalized with COVID-19. But, as we’ve explained before, the study has limitations — and it stands in contrast to multiple randomized controlled trials that have found the drug is not beneficial to hospitalized patients (and two other observational studies).", "During the press conference, Immanuel also claimed that a 2005 study “said it works.”", "That study — which found that “[c]hloroquine is effective in preventing the spread of SARS-CoV in cell culture” — “is no evidence at all that it’s a cure for COVID,” Schluger said.", "“That was a different coronavirus; that was the coronavirus that causes SARS,” he said. Secondly, he said, the study involved cells in test tubes. Potential drugs are evaluated in test tubes, then in animals, before they move into the three phases of clinical human trials, he said — and 90% of drug candidates that make it to human trials fail because they aren’t effective or aren’t safe.", "A study in a test tube involving a different virus, Schluger added, is “not how the FDA approves drugs.”", "Likewise, Dr. Radha Rajasingham, an assistant professor of medicine in the division of infectious diseases and international medicine at the University of Minnesota, told us in an email that “[w]hen something ‘works’ in cell culture, the next step is to test it in animals, and then in humans to prove efficacy in this setting. Thus, it’s not reasonable to make clinical decisions based on one lab-based study.”", "Despite the evidence that hydroxychloroquine isn’t an effective treatment for COVID-19, Immanuel in the video generally dismisses such studies (erroneously suggesting that they only involved “20 people, 40 people”) — and claims she has successfully treated more than 350 patients.", "She also says: “I’ve put myself, my staff and many doctors that I know on hydroxychloroquine for prevention. Because by the very mechanism of action, it works early and as a prophylaxis.”", "There are scientists exploring the use of hydroxychloroquine as a prophylaxis, or preventive, and some results have been published.", "Rajasingham and fellow researchers at the University of Minnesota published the results of a post-exposure prophylaxis randomized controlled trial of hydroxychloroquine for COVID-19 in the New England Journal of Medicine on June 3.", "The double-blind trial recruited more than 800 volunteers who received either hydroxychloroquine or a placebo within four days of exposure to someone with confirmed COVID-19. Nearly 12% of hydroxychloroquine participants developed a COVID-19-like illness compared with 14.3% of those getting the placebo — a difference that was not significant.", "Rajasingham said her group is currently analyzing the results of a trial that looks at hydroxychloroquine as a pre-exposure prophylaxis, involving 1,500 health care workers.", "“But without clear evidence that this works in randomized clinical trials (in humans) I would not believe this medicine is efficacious,” she said.", "Schluger said he understands why the public is desperate for an answer, and why some might look to hydroxychloroquine. But “the job of doctors and scientists is to figure out if things really work — and as far as we can tell, hydroxychloroquine doesn’t seem to have any significant effect.”", "He said doctors like Immanuel should submit their evidence for peer-review and “see if it stands up to scrutiny.”", "At one point in the video, Immanuel claims, “you don’t need masks, there is a cure.” Immanuel and the doctors behind her in the video are not seen wearing face masks.", "There is no cure, as we said. And the CDC has explained that face masks or coverings could help prevent the spread of the novel coronavirus by containing respiratory droplets created when people cough, sneeze or talk. That’s how the virus is primarily spread and containing fluids is called source control.", "The CDC has been recommending the use of face coverings since early April, when the agency changed its initial position on the use of face masks during the COVID-19 pandemic, citing new studies on the transmission of the novel coronavirus.", "We’ve written numerous stories explaining that guidance and correcting misinformation on the issue, but bogus claims like Immanuel’s continue to add to the confusion.", "We’ve written before that there have been relatively few randomized controlled trials looking at the efficacy of face masks when worn by the public, and the ones that have been done are inconsistent or have not observed large effects. But given lab studies of how masks work, many experts support them, and the World Health Organization has, like the CDC, recommended their use during “severe epidemics or pandemics.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Rajasingham, Radha. Assistant professor of medicine, University of Minnesota. Email to FactCheck.org. 28 Jul 2020.", "Schluger, Neil. Chairman, department of medicine, New York Medical College. Phone interview with FactCheck.org. 28 Jul 2020.", "McDonald, Jessica. “Navarro Doesn’t Give Full Picture On Hydroxychloroquine.” FactCheck.org. 9 Jul 2020.", "McDonald, Jessica and Eugene Kiely. “Azar, Trump Mislead on FDA’s Hydroxychloroquine Decision.” FactCheck.org. 18 Jun 2020.", "McDonald, Jessica. “Trump Hypes Potential COVID-19 Drugs, But Evidence So Far Is Slim.” FactCheck.org. 25 Mar 2020.", "Rosenberg, Eli S. et. al. “Association of Treatment With Hydroxychloroquine or Azithromycin With In-Hospital Mortality in Patients With COVID-19 in New York State.” JAMA. Published online 11 May 2020.", "Boulware, David R., et. al. “A Randomized Trial of Hydroxychloroquine as Postexposure Prophylaxis for Covid-19.” New England Journal of Medicine. 3 June 2020.", "“FDA cautions against use of hydroxychloroquine or chloroquine for COVID-19 outside of the hospital setting or a clinical trial due to risk of heart rhythm problems.” FDA Drugs Safety Communication. Updated 1 Jul 2020.", "Vincent, Martin J., et. al. “Chloroquine is a potent inhibitor of SARS coronavirus infection and spread.” Virology Journal. 22 Aug 2005.", "Geleris, Joshua, et. al. “Observational Study of Hydroxychloroquine in Hospitalized Patients with Covid-19.” New England Journal of Medicine. 7 May 2020.", "“No clinical benefit from use of hydroxychloroquine in hospitalised patients with COVID-19.” Press release, Randomised Evaluation of COVID-19 Therapy. 5 Jun 2020.", "Arshad, Samia, et. al. “Treatment with hydroxychloroquine, azithromycin, and combination in patients hospitalized with COVID-19.” International Journal of Infectious Diseases. 1 Jul 2020.", "Stewart, Sally. Spokeswoman, Cedars-Sanai. Email exchange. 28 Jul 2020.", "Centers for Disease Control and Prevention. “Considerations for Wearing Cloth Face Coverings — Help Slow the Spread of COVID-19.” Updated 16 Jun 2020.", "McDonald, Jessica. FactCheck.org. “COVID-19 Face Mask Advice, Explained.” 6 Apr 2020.", "World Health Organization. “Non-pharmaceutical public health measures for mitigating the risk and impact of epidemic and pandemic influenza.” 2019.", "Secondopinionproject.com. Webpage copyrighted by the Tea Party Patriots Foundation. Accessed 28 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]