["A claim massively viral on social media suggests that Prime Minister Narendra Modi has “inducted” 22-year-old Prathap NM from Karnataka, who builds drones from e-wastes, into the Defence Research and Development Organisation (DRDO). Infographics created by fake news portal Postcard News in both English and Kannada are doing the rounds.", "A Twitter thread by Amit Singh Rajawat claiming that Prathap was appointed in the DRDO by PM Modi has received close to 17,000 retweets.", "The claim is also viral in Hindi — “#Karnatak के 21 साल के NM Pratap की कबाड़ से #ड्रोन बनाने से DRDO साइंटिस्ट बनने की कहानी दिलचस्प है”. BJP politician Ameeta Singh tweeted with the hashtag #DRDO.", "Speaking with Alt News, Prathap claimed while other details of his accomplishments are true, the bit about his induction into the DRDO is false. “Not yet,” he told us. “I haven’t received any offer from the Prime Minister’s Office. The PM cannot recruit for DRDO, isn’t it? Several people from Kannada media have told me that I will be getting a call. But I am not sure. Till now I haven’t received any call or email.”", "A keyword search for news reports claiming that Prathap has been appointed as a scientist in DRDO led us to a December 2019 report by India Times which said, “He is currently working on a project with India’s DRDO for drone application in critical national projects.” When asked about the report, Prathap clarified that he has never directly worked with the DRDO. “I worked with a Bengaluru-based company which was working on a project for DRDO.”", "Every year, the DRDO recruits scientists in DRDS (Defence Research & Development Service) mostly at entry-level (Scientist ‘B’). “However, depending on the requirements in specialized areas of research & development, limited number of scientists are also recruited in higher grades (Scientist ‘C’ to Scientist ‘H’),” according to the website of Recruitment and Assessment, DRDO. The essential qualifications for scientists in science/ engineering category are first class master’s degree in relevant subjects and work experience ranging between 3 to 15 years depending on the position.", "The claim that PM Modi has inducted Prathap NM into the DRDO is baseless. It is to be noted that Alt News was unable to independently verify the awards and accomplishments credited to Prathap NM.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]