["About this rating", "Since 1946, the Gallup analytics company has conducted surveys to identify the \"Most Admired Man\" and \"Most Admired Woman\" in the world (although in 1946 and 1947 only a single \"Most Admired Person\" was named). With only a handful of exceptions across those several decades, the most admired man has typically been the current president of the United States.", "It should be no surprise, then, to see that President Barack Obama held the \"Most Admired Man\" designation for all eight years he occupied the White House, from 2009 through 2016. It may come as something of a surprise, however, to learn that Obama has actually maintained that status for 11 straight years, beginning the year before he assumed office (2008) and continuing for the two years since he has been out of office (2017-18).", "The current president, Donald Trump, has polled reasonably close to Obama in the admiration stakes over the last few years, according to Gallup, but still in a distinctly second-place position:", "Only a few times, all in tumultuous political circumstances, has the incumbent president not been tabbed as Gallup's \"Most Admired Man\" for multiple consecutive years:", "On the other side, the \"Most Admired Woman\" has commonly been either the current first lady of the United States or the prime minister of a non-U.S. country. But Hillary Clinton, as a U.S. senator, U.S. secretary of state, and a presidential candidate, earned that designation for 16 straight years from 2002-2017 and (including her tenure as first lady) for 22 years overall in the span from 1993-2017 — consistently outpolling incumbent first ladies Laura Bush and Michelle Obama.", "Clinton's streak finally came to an end in 2018, however, when she dropped to third place behind former First Lady Michelle Obama and television personality Oprah Winfrey.", "Although Gallup asks respondents to identify the man and woman \"living today in any part of the world\" whom they admire most, only adult Americans are surveyed, so the results reflect a U.S.-centric outlook rather than a global one.", "Gallup.   \"Most Admired Man and Woman.\"\r\n    Accessed 2 April 2019.", "Jones. Jeffrey M.   \"Michelle Obama Ends Hillary Clinton's Run as Most Admired.\"\r\n    Gallup.   27 December 2018.", "Jones. Jeffrey M.   \"Trump Approval More Stable Than Approval for Prior Presidents.\"\r\n    Gallup.   21 December 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]