["\"In the end I believe my generation will surprise everyone. We already know that both political parties are playing both sides from the middle and we'll elect a true outsider when we fully mature,\" starts a quote supposedly said by Cobain in 1993. It concludes, \"I wouldn't be surprised if it's not a business tycoon who can't be bought and who does what's right for the people. Someone like Donald Trump as crazy as that sounds.\"", "The quote has been shared repeatedly on Facebook, Twitter and Pinterest, but never with any attribution as to where or exactly when it was said by Cobain.", "The latest iteration is a meme including a black-and-white photo of Cobain during Nirvana’s famous MTV Unplugged performance in 1993. Nowhere in that performance does Cobain speak the quote.", "In August 2016, fact-checking site Snopes reported that the hoax originated on a Facebook page called Trump Train.", "In another sign that the quote is likely fabricated, the earliest version of the meme misspelled Cobain’s first name as Curt rather than Kurt.", "A recent debunk of the meme appeared in August 2018 when Danny Goldberg, who was one of Nirvana’s managers when Cobain was alive, wrote in The Nation, “I know that the quote is not only made up but it is also a grotesque perversion of Kurt’s beliefs.”", "While known to speak out against homophobia, a 2017 Rolling Stone magazine compilation of 12 great quotes from Cobain does not include broader statements on politics.", "A Google search of the quote from before July 2016 only produced only two results: a page ranking blogs on Cobain which is no longer online and a page of Cobain memes.", "There were no search results from during the tumultuous life of the grunge singer who died by suicide at age 27 in April 1994.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]