["About this rating", "At a press conference held immediately following the 2018 U.S. midterm elections, President Trump engaged in a number of heated exchanges with members of the press. He called CNN's Jim Acosta a \"rude, terrible person,\" \"fake news,\" and an \"enemy of the people,\" accused Yamiche Alcindor of the PBS Newshour of asking him a \"racist question,\" told Peter Alexander of NBC News that he wasn't a fan of his, and derided the general media as \"hostile\" and the driving force causing political division in the nation.", "After the conference, the White House suspended Acosta's press press on the grounds that he had \"placed his hands\" on an intern who had attempted to take a microphone away from him, an action that dominated the rest of the day's news cycle.", "Social media users then engaged in another round of whatboutism as they claimed that President Obama had an equally contentious relationship with the press, sharing as proof a video that supposedly captured Obama's angrily ejecting a reporter from a press conference:", "This same claim about President Obama previously appeared on social media in July 2018, after the White House barred another CNN reporter, Kaitlan Collins, from attending a press event. At the time, Trump's defenders made the identical argument and asserted that Obama had also kicked a reporter out of a press conference for asking a question he didn't like:", "A version of this video posted by Twitter user \"Rosie Memos\" had nearly 500,000 views at the time of this writing:", "This video is real in the sense that it has not obviously been altered, but it does not capture President Obama's rejecting a reporter for asking a question he didn't like.", "This clip documents an incident which took place at a July 2015 event at the White House in honor of LGBT Pride Month. President Obama was delivering a speech (not taking questions at a press conference) when a protester (not a reporter) interrupted and shouted at him to demand an end to the deportation of LGBT immigrants:", "An activist interrupted President Obama at a White House event celebrating L.G.B.T. Pride Month to demand an end to the deportation of L.G.B.T. immigrants. The activist was escorted from the room amid a chorus of boos and jeers from the assembled guests.", "The activist, Jennicet Gutiérrez, who is transgender and says she is in the country illegally, interrupted Mr. Obama shortly after he began speaking, calling from the back of the room, “President Obama, release all L.G.B.T.Q. immigrants from detention and stop all deportations!”", "President Obama displayed little patience with the heckler, telling her, “You’re in my house” before having her removed.", "Here's a video of the incident from BBC News:", "Little comparison exists between the two incidents involving Presidents Obama and Trump referenced here, other than that they both resulted in an individual's being barred from a White House event.", "Zeitlin, Matthew.   \"'You Are a Rude, Terrible Person': Trump Scolds and Insults Reporters at Press Conference.\" \r\n    Slate.   7 November 2018.", "Viebeck, Elise.   \"Trump Calls Black Reporter’s Question 'Racist,' Denies Making 'Racist Remarks.'\" \r\n    The Washington Post.   7 November 2018.", "Viebeck, Elise.   \"Trump Calls Black Reporter’s Question 'Racist,' Denies Making 'Racist Remarks.'\" \r\n    The Washington Post.   7 November 2018.", "Stack, Liam.   \"Activist Removed After Heckling Obama at L.G.B.T. Event at White House.\" \r\n    The New York Times.   24 June 2015.", "Hayes, Christal.   \"White House Bans CNN Reporter from Press Conference.\" \r\n    USA Today.   25 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]