["About this rating", "Articles of impeachment were introduced against five of the six Republican presidents who have served since President Dwight D. Eisenhower.", "Articles of impeachment were not introduced against President Gerald Ford; a handful of Democratic politicians filed articles of impeachment against President George H. W. Bush Sr. and President Ronald Reagan but their efforts did not receive the backing of the entire Democratic party; and the impeachment efforts against President Richard Nixon received bipartisan support.", "A popular rumor floating around social media posits that Democrats have attempted to impeach every Republican president since Dwight D. Eisenhower:", "This claim is both factually inaccurate and misleading.", "The U.S. has had six republican presidents since Eisenhower left office in 1961: Richard Nixon, Gerald Ford, Ronald Reagan, George H. W. Bush, George W. Bush, and Donald Trump. The claim is wrong on its face because Democrats made no effort to impeach Ford. While a handful of Democratic lawmakers have introduced articles of impeachment against five of the last six Republican presidents, in most cases these efforts weren't taken seriously by the party at large. Nixon and Trump have been the only Republican presidents since Ike who have faced a serious threat of impeachment.", "Multiple ways exist to start the impeachment process. Typically, it begins when a member of the House of Representatives introduces articles of impeachment. From there, the matter is typically referred to a committee where an inquiry can be opened. If the committee finds that the evidence warrants impeachment, they can send the matter to the full House for a vote. If the House votes to impeach, the case gets sent to the Senate, where an impeachment hearing is held. If two-thirds of the senators vote to convict, the president is removed from office.", "Here's a simplified version of this process:", "The impeachment efforts against Reagan, Bush Jr., and Bush Sr. only reached the first step of this process. These efforts didn't receive much support from the Democratic party as a whole, and they never made their way out of committee for a vote in front of the full House. When Rep. Henry B. Gonzalez, D-Texas, introduced articles of impeachment against Reagan in 1987, the Associated Press reported that the effort had \"virtually no chance of being approved\":", "Articles of impeachment charging President Reagan with misconduct in office because of his actions in the Iran-Contra affair were introduced in the House on Thursday by a Texas Democrat. But they were given virtually no chance of being approved ...", "... The articles were not expected to be approved and were not presented in a forum to be taken seriously by the House leadership.", "Gonzalez made his remarks at a time in which the House had concluded its official business for the day and a handful of members were making speeches. Less than a half dozen members were on the floor at the time.", "Gonzalez also filed articles of impeachment against Bush Sr., first in 1991, when H.R. 34 was referred to House Judiciary Committee, and then again in 1992, when H.R. 86 was put before the Subcommittee on Economic and Commercial Law. Neither of these efforts received a vote.", "The impeachment effort against Bush Jr. was a bit more serious. Congressmen Dennis Kucinich, D-Ohio, and Robert Wexler, D-Fla., introduced 35 articles of impeachment against Bush to the U.S. House of Representatives in June 2008. Twenty-four Republicans joined 227 Democrats to vote in favor of sending the resolution to the House Committee on the Judiciary. Bush would leave office a few months later, however, before any other action was taken on the matter.", "While articles of impeachment were introduced against Reagan and Bush Sr., these efforts never received the backing of the Democratic Party, never made it past committee, and were never brought to the House for a vote. A bit more support existed behind the impeachment efforts against Bush Jr., but again, this matter was not referred to the House for a full vote.", "The only Republican president since Eisenhower (and before Donald Trump) who faced a serious threat of impeachment was Nixon. Nixon made it to step 2 of the impeachment process in July 1974 when the Judiciary Committee voted to send articles of impeachment to the House for a vote. This was a bipartisan effort, however, as six of the 17 Republicans on the Judiciary Committee joined their 21 Democrat colleagues to vote in favor of the resolution.", "Nixon would have faced a vote in front of the full House, but he resigned from office before the vote took place.", "As of this writing, Trump is in the middle of step 2 of the impeachment process. U. S. House Speaker Nancy Pelosi has announced an official impeachment inquiry into the president, but the matter has not yet been referred to House of Representatives for an official impeachment vote.", "To sum up: This meme claims that Democrats have tried to impeach every Republican president since Eisenhower. As no impeachment efforts were made against Gerald Ford, this claim is false. It is true, however, that articles of impeachment were filed against five of the last six Republican presidents. In two of those cases (Reagan and Bush Sr.), these efforts were led by a handful of politicians and did not receive support from the Democratic party as a whole. It should also be noted that the most serious impeachment effort, that against Nixon, received bipartisan support.", "Lyons, Richard and William Chapman.   \"Judiciary Committee Approves Article to Impeach President Nixon, 27 to 11.\"\r\n    The Washington Post.   28 July 1974. 25 September 2019.", "Wolf, Zachary.   \"How impeachment works.\"\r\n    CNN.   25 September 2019.", "Associated Press.   \"Articles Of Impeachment Introduced, But Given No Chance Of Passage.\"        5 March 1987.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]