["About this rating", "In December 2017, a viral video left millions of people saddened and horrified by the sight of an emaciated polar bear forced to scavenge in trash cans for food on Canada's Baffin Island.", "Photographer Paul Nicklen posted the video on Facebook, garnering almost 30,000 shares within a week, as well as the attention of the national news media. Nicklen, who is also co-founder of the environmental nonprofit group SeaLegacy, wrote:", "My entire Sea Legacy team was pushing through their tears and emotions while documenting this dying polar bear. It’s a soul-crushing scene that still haunts me, but I know we need to share both the beautiful and the heartbreaking if we are going to break down the walls of apathy. This is what starvation looks like. The muscles atrophy. No energy. It’s a slow, painful death.", "When scientists say polar bears will be extinct in the next 100 years, I think of the global population of 25,000 bears dying in this manner. There is no band aid solution. There was no saving this individual bear. People think that we can put platforms in the ocean or we can feed the odd starving bear. The simple truth is this — if the Earth continues to warm, we will lose bears and entire polar ecosystems.", "The video was subsequently shared by National Geographic, which reported:", "Video shows the polar bear clinging to life, its white hair limply covering its thin, bony frame. One of the bear's back legs drags behind it as it walks, likely due to muscle atrophy. Looking for food, the polar bear slowly rummages through a nearby trashcan used seasonally by Inuit fishers. It finds nothing and resignedly collapses back down onto the ground.", "The footage is real. Nicklen says it was captured \"a few months\" before December 2017, at an abandoned Inuit camp on Baffin Island, the enormous land mass southwest of Greenland in the Canadian Arctic. There appears to be no doubt that the animal is suffering from starvation, as National Geographic wrote:", "The bear's thin frame and protruding bones are clear indicators of this, and its atrophied muscles suggest it's been starving for an extended period of time.", "However, the causes of the bear's condition were a little bit more complicated.", "Polar bears live only in the Arctic and eat only meat, their main source being seals. They rely on Arctic seawater to freeze into ice, where they can gain access to seals. But climate change means that these Arctic ice sheets are reducing in size, lowering the number of seals available to polar bears and ultimately, causing them to starve. The risk is higher in places like Baffin Island, where polar bears depend on seasonal ice.", "According to the Smithsonian Institution, the issue is likely about to become dramatically worse:", "Recent predictions suggest that warming seawater and air will melt 20 percent or more of the Arctic's ice cover in the next 40 years — a scary statistic for the many species in the Arctic that rely on seasonal ice cover for vital activities such as breeding and eating.", "However, Dr. Steven Amstrup, chief scientist for the non-profit Polar Bears International, said in a blog post that climate change may not have been the direct or sole contributing factor in this particular animal's demise:", "Polar bears have few natural predators. Although they normally live a long time, they are not immortal. All eventually die and most do so because they have not been able to capture enough food. This means that malnutrition is a major cause of death for polar bears.", "Young bears that have not learned well enough how to catch seals, old feeble bears, and bears that have injured themselves, all can succumb to malnutrition under some circumstances. The starvation leading to the event shown in this video could be related to old age, injury (like a broken jaw or teeth that prevent it from catching food), disease, or other factors limiting its success in obtaining prey.", "However, Amstrup points out that the continued diminishment of sea ice that is expected will make it harder for polar bears in this region to find seals to eat, and therefore make starvation much more likely for sick, lame, very young or very old animals who might otherwise have survived:", "The problem is that an ever-warmer future means polar bears will have less and less access to their seal prey, so the rate at which bears die from malnutrition/starvation will increase. So, regardless of the proximate cause of this bear’s condition, this heart-wrenching footage provides us with a warning about the future.", "Hunters from Inuit communities on Baffin Island were also skeptical over whether to link the bear's condition with climate change; Eric Ootoovak, the vice-chair of the Mittimatalik Hunters and Trappers Organization, said of the bear:", "You can really tell he’s sick. He's not starving. If he was starving, he'd be able to move a bit more than that.", "Nick Arnalukjuak, who leads a similar group in the island community of Nunavut, called it part of a \"normal cycle\" for some bears to suffer injury or illness, adding:", "We don't have starving polar bears, we don't have polar bears facing hard times because of ice. As long as we have four seasons — spring, summer, fall, winter — nothing's going to change.", "Gibbens, Sarah.  \"Heart-Wrenching Video Shows Starving Polar Bear on Iceless Land.\"\r\n  National Geographic.  7 December 2017.", "Gibbens, Sarah.  \"Your Questions About Our Starving Polar Bear Video Answered.\"\r\n  National Geographic.  11 December 2017.", "Cammen, Kristina; Soulen, Brianne.  \"Ice-Loving Seals and the Loss of Sea Ice.\"\r\n  The Ocean Blog/Smithsonian National Museum of Natural History.  24 September 2013.", "Polar Bears International.  \"Starving Polar Bear Draws Attention to Climate Change.\"\r\n  Polar Bears International.  9 December 2017.", "Edwards, Tim. \"The Problem with Polar Bear Propaganda.\"\r\nThe Walrus. 14 December 2017.", "Update [14 December 2017]: Updated with comments from hunters in Inuit communities on Baffin Island and reworded claim to accommodate the possibility of non-starvation sickness.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]