["About this rating", "A nightly news program on ABC erroneously aired a video from a Kentucky gun range during a report about the outbreak of war in northern Syria between Turkey and U.S.-allied Kurds after U.S. President Donald Trump pulled American forces out.", "The video depicting a fiery explosion was shown during \"World News Tonight\" on Oct. 13, 2019, and again the following day on \"Good Morning America.\" The video described itself as \"appearing to show\" the Turkish military bombarding Kurdish forces. In reality, it showed a night-time shooting event at a Kentucky gun range. ABC apologized for the mistake.", "\"We’ve taken down video that aired on 'World News Tonight Sunday' and 'Good Morning America' [on Oct. 14, 2019] that appeared to be from the Syrian border immediately after questions were raised about its accuracy. ABC News regrets the error,\" an ABC spokesman said in a statement.", "A source from ABC said the video was provided by someone who purported to be in a \"sensitive position\" on the border between Turkey and Syria. The network is investigating the incident.", "Turkey launched a military offensive against Kurdish forces in northern Syria shortly after Trump pulled American troops from their posts there, where they had been for several years supporting Kurds in a fight to contain Islamic State (ISIS) terrorists. The resulting chaos that included the escape of detainees associated with ISIS, violence against civilians, and a geopolitical advantage handed to America's adversaries, have prompted sharp bipartisan criticism of Trump's decision.", "The video aired by ABC has been online since at least 2017. A caption on what appears to be the original YouTube post says the explosion was the rather spectacular result of a night time machine-gun shoot, an event held at the Knob Creek Gun Range in Kentucky.", "A number of right-wing partisans have pointed to the incident as evidence of the nefarious work of the \"mainstream media\" or \"MSM,\" which attracted the attention of Trump, who often attacks the news media.", "A big scandal at @ABC News. They got caught using really gruesome FAKE footage of the Turks bombing in Syria. A real disgrace. Tomorrow they will ask softball questions to Sleepy Joe Biden’s son, Hunter, like why did Ukraine & China pay you millions when you knew nothing? Payoff?", "— Donald J. Trump (@realDonaldTrump) October 15, 2019", "But Peter Adams, head of education at the non-profit, non-partisan News Literacy Project, explained that although ABC owes the public a detailed account of how the misstep happened, it appeared to be nothing more than human error, not an intentional effort by ABC to mislead.", "\"Despite the online rantings of bad-faith partisans, there is no evidence that this was intentional nor ideologically-motivated. The conflict in Syria is highly newsworthy & the motivation here was almost certainly to get a sensational, great-for-TV clip,\" Adams wrote in a Twitter thread. Adams added that legitimate news outlets publicly acknowledge even minor errors and correct the record, and that it's important to remember that these types of mistakes are relatively rare.", "Murphy, Heather. \"ABC Apologizes for Showing Video From U.S. Gun Range in Report on Syria.\"\r\n  The New York Times. 14 October 2019.", "Edelman, Adam and Elizabeth Janowski. \"Republicans Slam Trump's Syria Pullout: 'Disaster,' 'Betrayal,' 'Mistake.'\"\r\n  NBC News. 7 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]