["The articles have been shared more than 10,000 times in recent weeks, including here, here and here.", "They claim followers of a prophet drank Dettol to protect themselves from the novel coronavirus and other diseases, leading to the death of 59 people.", "The claims are accompanied by an image of a man pouring what appears to be Dettol into a woman’s mouth.", "A reverse image search reveals the picture is genuine but is linked to news reports in South Africa (see here and here) from December 2016, three years before the new coronavirus emerged.", "Furthermore, none of the publications make any mention of fatalities.", "South African newspaper Daily Sun identified the man as Rufus Phala, a \"prophet\" who told his congregation that drinking the antiseptic liquid would heal them.", "It quotes Phala saying at the time: “I know Dettol is harmful, but God instructed me to use it. I was the first one to drink it.” The hoax articles repeat these words.", "Phala's actions were criticised as an \"unnatural habit\" by the health department, which called on church leaders to investigate.", "Dettol South Africa also responded at the time, advising the product was for external use only, warning that ingestion could be dangerous.", "\"We have been in contact with Prophet Rufus Phala and have asked him to stop this practice,\" the statement read.", "AFP was unable to verify if the bottle Phala gave to his congregants genuinely contained Dettol.", "Responding to AFP, police spokesman Brigadier Vishnu Naidoo dismissed the claims as false and denied any investigations into the deaths of 59 people linked to the consumption of Dettol.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]