["About this rating", "A photograph purportedly showing an image of Eric and Donald Trump, Jr., the two older sons of President Donald Trump, has been circulating on social media in various forms since at least June 2017:", "@realDonaldTrump Donald Trump HATES this photo of his two sons. Please don't share it. pic.twitter.com/gnxy9BIwmn", "— Linda Radtke (@lradtke77) June 9, 2017", "The image, which provides an oddly grotesque look at President Trump's olders sons, has been re-purposed in various memes to mock the First Family. For instance, it has been turned into a movie poster for Dumb and Dumber, was shared in a meme comparing the two Trumps children into to the \"sloth\" character from the movie The Goonies, and was frequently shared with the captions \"They look like that \"h'yucc\" sound Goofy be making\" or \"Donald Trump HATES this photo of his two sons. Please don't share it.\"", "However, this picture (despite the Getty Images watermark) is not a genuine photograph of Donald Trump's sons, but a digitally altered version of one.", "The original photograph was taken on 12 November 2005, during Donald Trump, Jr.'s wedding reception at his father's Mar-a-Lago estate in Florida and was captioned: \"Donald Trump, Jr. pose with his brother Eric Trump after the wedding ceremony at the Mar-a-Lago Club on November 12, 2005 in Palm Beach, Florida. (Photo by C. Allegri/Getty Images)\"", "Several subtle changes were made to the original image in order to uglify the Trump brothers. For instance, Donald Trump, Jr.'s upper lip was enlarged, his bottom teeth were hidden, his right eye was moved off-center, and his left ear was lowered. Eric Trump's eyes were also widened, and some extra fat was added to his neck.", "Here's a comparison of the fake image (left) and the real image (right):", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]