["About this rating", "Texas has tentatively legalized the use of marijuana for the treatment of a form of epilepsy.", "Texas has not announced plans to legalize marijuana for general medicinal and recreational use.", "In September 2014, the NewsBuzzDaily web site published an article reporting that Texas was about to follow in the footsteps of the states of Colorado and Washington and legalize marijuana for medicinal and recreational use:", "On September 29, 2014, Texas Governor Rick Perry will be signing a new bill into law, legalizing medicinal and recreational use of marijuana for adults ages 21 or older. Bill HB 2412 will go into effect January 1, 2015. Texas is the first southern state to legalize any recreational drug. The state of Texas is expected to profit $50 million in tax revenue from marijuana sales. A state tax of 11% will be implemented on sales. In addition to the profit in tax revenue, with the legalization of the drug Texas is expected add more than 5,000 job openings ranging from farmers to dispensary agents.", "Soon afterwards links and excerpts referencing this item were being circulated via social media, with many of those who encountered it mistaking it for a genuine news article.  However, Texas has no bill to legalize any form of marijuana use pending in its legislature; the last bill numbered HB 2412 presented to that body was on a completely different subject.", "The article was just a spoof from NewsBuzzDaily, a fake news web site whose stock in trade is publishing fabricated clickbait stories.  The site's About Us page states that:", "NewsBuzzDaily.com is a combination of real shocking news and satire news. Please note that articles written on this site are for entertainment and satirical purposes only.", "In January 2016, however, life began to overtake satire when Texas agreed to allow select dispensaries to sell low-level THC products to people suffering from intractable epilepsy, whose seizures are not controllable with traditional drugs. And in June 2016, Texas news outlets began reporting that some state officials were hoping to expand the law to include more allowable uses for medical marijuana.", "However, as of now, the use of marijuana for recreational purposes and most medicinal purposes remains illegal in Texas.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]