["Alabama Gov. Kay Ivey, accused of funneling $1 million to a liberal activist organization, delivers the annual State of the State address at the Capitol, in Montgomery, Ala., on Jan. 9, 2018.", "Scott Dawson, an evangelical minister running for governor in Alabama, accused the incumbent of funnelling taxpayer dollars to a controversial cause.", "\"It's been uncovered that Gov. Kay Ivey gave nearly $1 million of taxpayers’ money to a liberal activist organization that promotes alternative lifestyles and transgenderism,\" Dawson’s campaign wrote in a press release.", "The organization in question is Free2Be, a non-profit that provides counseling services to LGBTQ victims of domestic violence and bullying in Alabama.", "The nonprofit has been the subject of heavy scrutiny in Alabama, but for financial reasons, not political ones.", "After the group’s founder, James Robinson, left the group in January, the board of directors determined that Free2Be did not have the financial stability to continue. The group shuttered its doors after a state agency found they had failed to pay payroll taxes to the IRS.", "Dawson’s campaign pointed us to a 2012 YouTube video as evidence Free2be is a \"liberal activist organization that promotes alternative lifestyles and transgenderism.\"", "The video didn’t suggest the organization aimed to change anyone’s sexual orientation or gender identity. Neither do the group’s public statements. Instead, Robinson railed against messages of hate from teachers, parents and churches towards LGBTQ teens.", "So what taxpayer funding did the group receive until they landed in hot water?", "Dawson’s campaign overshot the target by a few hundred thousand dollars with their $1 million figure.", "The campaign calculated that Free2Be received $762,042.37 in federal grants since Ivey assumed office in April 2017, using data from Alabama’s Finance Department.", "But the Alabama Department of Economic and Community Affairs, which reviews grant applications and presents funding recommendations to the governor’s office for approval, announces grants on an annual basis. Ivey’s administration was responsible for approving $800,000 in grants for fiscal year 2018, which began in October 2017.", "Of that total, $727,410 came from the Victims of Crime Act, which is part of the U.S. Department of Justice, and $49,915 from the federal Family Violence Prevention and Services Act.", "The grants refunded expenses incurred by the organization. Those payments stopped in late March, when Free2Be shut down, and added up to $422,680.37.", "In fiscal year 2018, the state awarded $23.5 million in Victims of Crime Act grants to 79 nonprofit or governmental agencies across Alabama, said Department of Economic and Community Affairs spokesman Josh Carples. Free2Be was one of those recipients.", "The law requires that 10 percent of Victims of Crime Act grant funding go to underserved victims of violent crime each year. The agency started to look for LGBTQ grant recipients in 2013, after a program specialist noticed the agency was not funding any providers that serviced that community. Because it qualified as underserved, the specialist suggested the agency begin LGBTQ outreach.", "The following year, Free2Be was the only Victims of Crime Act applicant serving the LGBTQ population, and the agency approved their grant request.", "Ivey’s campaign argued that the grants were not funded by taxpayer dollars, but by federal criminal fees.", "The Office for Victims of Crime’s website uses a similar distinction as Ivey in describing these grants: \"The Fund is financed by fines and penalties paid by convicted federal offenders, not from tax dollars.\"", "But Matt Gardner, senior fellow at the Institute on Taxation and Economic Policy, said there is a distinction between tax dollars and taxpayer dollars.", "\"User fees are, technically, not ‘tax dollars’ in that they are not the product of our tax system,\" Gardner said. \"But the broader claim that these are not ‘taxpayer dollars’ doesn't seem right. When we pay the $20 entrance fee to visit a national park, we're not paying a tax. But most people would say that $20 is ‘taxpayer dollars’ in that the government collected it from people, and will spend it on some public services.\"", "Gardner likened a $20 park fee to the fines and penalties paid by federal offenders.", "Susan Pace Hamill, a professor at the University of Alabama School of Law, agreed.", "\"Criminal fines and forfeitures are not typical taxes, but resemble typical taxes because they represent dollars collected involuntarily and are used for some public purpose,\" Hamill said.", "Dawson said, \"It's been uncovered that Gov. Kay Ivey gave nearly $1 million of taxpayers’ money to a liberal activist organization that promotes alternative lifestyles and transgenderism.\"", "The organization in question is Free2Be, a victims resources nonprofit that serviced the LGBTQ community. Dawson distorted the organization’s purpose, which was to support LGBTQ victims of domestic violence and bullying in Alabama, not to change anyone’s gender identity or sexual orientation.", "The Ivey administration approved almost $800,000 in grants to Free2Be in order to meet a federal grant quota for underserved communities. But the group did not receive the full amount before it closed in March; it received a little more than half of that funding.", "The statement has an element of truth but ignores critical facts that would give a different impression. We rate this statement Mostly False.", "Press release, Scott Dawson for governor, May 15, 2018", "Phone interview with Jonathan Gray, general consultant to Scott Dawson, May 18, 2018", "Phone interviews with Josh Carples, ADECA communications director, May 24, 2018", "Email interviews with Debbee Hancock, Kay Ivey communications director, May 24, 2018", "Alabama Department of Finance, Checkbook, accessed May 22, 2018", "AL.com, LGBTQ group raises red flags - but not for its politics, May 16, 2018", "WHNT, Huntsville nonprofit Free2Be closes, unclear if operations will resume, May 14, 2018", "Office for Victims of Crime, About OVC", "Governor.Alabama.gov, Details Regarding Federal Grant Awarded to Free2Be, May 15, 2018", "Facebook, Free to Be, May 16, 2018", "Email interview with Matt Gardner, senior fellow at the Institute on Taxation and Economic Policy, May 22, 2018", "Email interview with Susan Pace Hamill, a professor at the University of Alabama School of Law, May 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]