["Indian soldiers and Chinese PLA personnel were involved in a fierce face-off in Nakula area of North Sikkim on May 9 in which seven Chinese and four Indian soldiers reportedly got injured. According to a recent report by Hindustan Times, India and China have deployed additional troops as tensions continue to simmer in Ladakh and Sikkim sectors of the Line of Actual Control (LAC).", "After the incident, a video started circulating on social media. Journalist Baba Umar tweeted it with the claim that it shows Chinese and Indian soldiers talking after possibly stone-pelting each other. The tweet has amassed over 2,500 retweets so far.", "Chinese and Indian troops talk, probably after stone pelting each other", "via — https://t.co/N6k4VYdu52 pic.twitter.com/fs8zVuVAX6", "— Baba Umar (@BabaUmarr) May 13, 2020", "Jamal Khan Raisani, the son of Pakistani politician Mir Siraj Khan Raisani, posted the video with the same narrative. At the time of writing this report, the tweet has garnered close to 2,400 retweets.", "Chinese and Indian troops talk after stone pelting in sikkim 3 days ago. pic.twitter.com/jF7uitro9v", "— Nawabzada Jamal Khan Raisani (@SonOfShaeed) May 13, 2020", "Sweden-based academician Ashok Swain quote-tweeted the video with a question about the authenticity of the video while saying, “If it is true, it goes against Indian media report of Indian troops confronting Chinese troops in Sikkim and forcing them to go back, It is opposite rather.”", "We found that this video is viral on Facebook and Twitter. The video has also been uploaded on YouTube with the same claim.", "Congress spokesperson Randeep Surjewala shared the clip (archive) after at least 20 Indian army soldiers were martyred in Galwan valley. He wrote, “Let us not muddle facts @DrSJaishankar Pl see the video on social media & tell why no firearms are being carried(see 34th sec for Galwan).” Surjewala’s video also includes a clip where Indian and Chinese soldiers are seen involved in a scuffle.", "Let us not muddle facts @DrSJaishankar Pl see the video on social media & tell why no firearms are being carried(see 34th sec for Galwan)", "And Stop quoting Agreement on Border Management to justify sending Soldiers Unarmed in tactical military situation with lives at stake pic.twitter.com/MT1rjZYJ23", "— Randeep Singh Surjewala (@rssurjewala) June 18, 2020", "We broke the video into multiple key-frames by using digital verification tool InVid. Alt News then performed a reverse image search on Google and found that the video was uploaded on YouTube on January 13, 2020, captioned, “Chinese army arguing with Indo Tibetan Border Police (I.T.B.P.) in Border of Arunachal Pradesh.”", "With a keyword search, we found an article by a Chinese website – dwnews.com – published on January 17, 2020. According to the article, the video is getting shared since mid-January and talks about a military hotline that was to be established between the India-China border. “Although both the Chinese and Indian armies are seeking to establish a military liaison hotline to reduce misjudgements, the confrontation on the border can be said to occur [with] almost every other incident with a strong sense of hostility…These border differences are mostly manifested as confrontation between the Indian Army and the People’s Liberation Army. Recently, many videos have been circulated on the Chinese network, showing the confrontation between the Indian Army and the People’s Liberation Army in different parts of the disputed border,” says the report.", "“This hotline had faced several roadblocks in the past because of the differing views of both sides…Both sides see hotlines as a necessity for better interaction between their armies and to defuse tensions caused by differing perceptions of the LAC.” stated a report published by The Economic Times on January 11, 2020.", "While Alt News is unable to independently verify the location and time of the video, it can be said with certainty that the video existed on the Internet since January 2020. Hence, it is not related to the recent clash on the India-China border.", "The second video shared by Surjewala was traced back to at least 2017. Times Now shared it on on July 31, 2017, when Chinese soldiers had transgressed into Uttarakhand’s Barahoti.", "[Update: Randeep Surjewala shared the same video after at least 20 Indian army soldiers died in Galwan Valley. His tweet was added to the report on June 19, 2020.]", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]