["About this rating", "A widely shared photograph that appeared to show two women holding a sign that read \"Parasites have no rights\" was authentic, and its message was not digitally altered. The photograph appears to have been taken at a 19 May protest against abortion restrictions in Huntsville, Ala.", "We have so far been unable to identify or contact the women who held the sign, so we cannot state definitively that they carried the placard as part of sincere participation in the protest and not for some other reason.", "In mid-2019, right-leaning online forums and conservative, anti-abortion commentators shared a photograph that appeared to show pro-choice activists holding a sign likening fetuses to \"parasites,\" a comparison that outraged some observers:", "By “parasites” they mean unborn babies in the womb.", "This is truly despicable... pic.twitter.com/0TuGX0taeU", "— Obianuju Ekeocha (@obianuju) May 22, 2019", "On 22 May 2019, the renowned Princeton University political philosopher Robert P. George posted that photograph to Facebook, saying the placard, which read \"Parasites don't have rights,\" was designed to \"dehumanize unborn children\" and comparing it to the rhetoric used by Nazis to describe Jews during the Holocaust:", "The photograph was also published on the prominent right-leaning, pro-Trump Reddit forum \"The Donald\" and right-leaning Facebook pages such as \"God, Guns and We the People\" and \"Death by Political Correctness.\"", "We received several inquiries from Snopes readers about the authenticity of the photograph and the wording on the placard. The photograph is authentic and was taken at a 19 May rally against abortion restrictions which took place in Huntsville, Alabama.", "However, we have not been able to identify or contact the women shown in the photograph. As such, we cannot state definitively that their intention was to sincerely protest the abortion restrictions signed into law in Alabama in May 2019, as opposed to, for example, acting as agitators with the intent of undermining those protests (although we have no evidence that the latter was the case).", "The photograph was one of several posted to the Facebook page of an event called \"My Body, My Choice\" — a protest against House Bill 314, a bill that would make performing an abortion a felony and that Republican Gov. Kay Ivey signed into law on 15 May, prompting a wave of international scrutiny.", "The protest took place on the afternoon of Sunday, 19 May at Butler Green Park in Huntsville:", "As further proof that the slogan was not digitally added or manipulated, we note that the same three women, one of them holding an identical sign, were also included in a second photograph published by the Alabama news website AL.com.", "Associated Press.   \"Near-Total Abortion Ban Signed Into Law in Alabama.\"\r\n    16 May 2019.", "BBC News.   \"Alabama Passes Bill Banning Abortion.\"\r\n    15 May 2019.", "AL.com.   \"Gallery -- Huntsville Abortion Rally.\"\r\n    20 May 2019.", "Weill, Kelly.  \"Alt-Right Frames Protesters as Pedophiles with Fake NAMBLA Sign.\"\r\n    The Daily Beast.   31 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]