["About this rating", "Paul McCartney said that the song was inspired by the fight of the \"Little Rock Nine\" to enroll in an all-white school in Arkansas.", "The song was not written in the U.S., but in Scotland.", "A lengthy post recirculating online offered a slightly dramatized account of the origin of one of Paul McCartney's most socially conscious songs.", "The post, which first appeared on Facebook in June 2017 (and then again in October 2018), reported that the Beatles song \"Blackbird,\" which was released on the group's eponymous 1968 LP commonly referred to as the \"White Album,\" was inspired by a visit the singer/guitarist paid to America.", "According to the post:", "It is said that [McCartney] was sitting, resting, when he heard a woman screaming. He looked up to see a black woman being surrounded by the police. The police had her handcuffed, and were beating her. He thought the woman had committed a terrible crime. He found out \"the crime\" she committed was to sit in a section reserved for whites.", "Paul McCartney was shocked. There was no segregation in England. But, here in America, the land of freedom, this is how blacks were being treated.", "McCartney and the Beatles went back home to England, but he would remember what he saw, how he felt, the unfairness of it all.", "He also remembered watching television and following the news in America, the race riots and what was happening in Little Rock, Arkansas, what was going on in the Civil Rights movement. He saw the picture of 15-year-old Elizabeth Eckford attempt to attend classes at Little Rock Central High School as an angry mob followed her, yelling, \"Drag her over this tree! Let's take care of that n**ger!'\" and “Lynch her! Lynch her!” “No n**ger b*tch is going to get in our school!”", "McCartney couldn't believe this was happening in America. He thought of these women being mistreated, simply because of the color of her skin. He sat down and started writing.", "At least one detail in the post, that McCartney wrote the song in the U.S.m is not accurate: McCartney said in a 25 May 2002 interview with KCRW that he wrote \"Blackbird\" in Scotland, explaining that \"I remembered this whole idea of, 'You were only waiting for this moment to arise' was about, you know, the black people's struggle in the southern states, and I was using the symbolism of a blackbird. It's not really about a blackbird whose wings are broken, you know. It's a bit more symbolic.\"", "The post does, however, accurately recount McCartney's meeting and acknowledgement of Thelma Mothershed Wair and Elizabeth Eckford on 30 April 2016, when he tweeted a photograph of himself with the two women, who were among the first nine African-American students to enroll at Little Rock Central High School after the school's all-white attendance policy was deemed unconstitutional as part of the Supreme Court verdict in Brown vs. the Board of Education.", "Incredible to meet two of the Little Rock Nine--pioneers of the civil rights movement and inspiration for Blackbird. pic.twitter.com/QrnOQnqrFX", "— Paul McCartney (@PaulMcCartney) May 1, 2016", "The photograph was posted the same day as McCartney's concert in Little Rock, when he introduced \"Blackbird\" with an explanation of the song's origin:", "Way back in the Sixties, there was a lot of trouble going on over civil rights, particularly in Little Rock. We would notice this on the news back in England, so it's a really important place for us, because to me, this is where civil rights started. We would see what was going on and sympathize with the people going through those troubles, and it made me want to write a song that, if it ever got back to the people going through those troubles, it might just help them a little bit, and that's this next one.", "The title of McCartney's 2001 poetry book, Blackbird Rising, is also a reference to the song.", "Kreps, Daniel.   \"Paul McCartney Meets Women Who Inspired Beatles' 'Blackbird.'\"\r\n    Rolling Stone.   1 May 2016.", "ABC News.   \"Paul McCartney on the Meaning Behind Songs.\"\r\n    1 May 2001.", "Douridas, Chris.   \"Paul McCartney.\"\r\n    KCRW-FM.   25 May 2002.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]