["President Donald Trump tours the Owens & Minor medical equipment distribution center in Allentown, Pa., on Thursday, May 14, 2020. TIM TAI / Inquirer Staff Photographer", "After touring an Allentown warehouse filled with protective medical equipment, President Donald Trump criticized Gov. Tom Wolf for keeping parts of Pennsylvania closed that the president thinks are no longer threatened by the coronavirus.", "\"You have areas of Pennsylvania that are barely affected and [the governor wants] to keep them closed,\" Trump told a crowd of workers from Owens & Minor, a company that manufactures and distributes masks, gloves and gowns to health care workers, on May 14.", "We wondered whether the statewide stay-at-home order Wolf issued on April 1 still applies to places hardly impacted by the deadly disease.", "It all depends what criteria are used to determine whether the coronavirus still poses a threat.", "The virus is still raging across Southeastern Pennsylvania, and not even Trump is arguing that Philadelphia and its suburbs are ready to reopen. Officials in Delaware and Bucks counties, however, have asked Wolf to exclude their nursing-home populations when he eventually rates their readiness.", "\"Largely when you look across the state, the hardest hit area has been the Southeast of Pennsylvania,\" said Dr. David Rubin, director of PolicyLab at Children’s Hospital of Philadelphia, which has been tracking the differences in the outbreak across individual regions of the country.", "The Philadelphia area as far west as Lancaster, Berks and Dauphin counties, and north to the Lehigh Valley have seen some of the worst outbreaks in Pennsylvania, he said.", "\"Largely the rest of the state has had a pretty deceptively, sort of minimal experience with COVID,\" Rubin said.", "That includes Allegheny County, the rural \"T\" and the South, Central and Southwestern parts of the state.", "\"When you have someone in that area of the state that are upset that they are unable to work, they’re not wrong,\" Rubin said. But for those in the Southeast worried about a resurgence, \"they’re not wrong, either.\"", "Wolf has already moved 37 Pennsylvania counties into what he calls the ‘yellow’ phase of reopening.", "In these places, many businesses may resume in-person operations, and residents may leave their homes so long as they take precautions. Thirteen counties in Southwestern Pennsylvania moved into the yellow phase May 15. Twenty-four others in the Northern half of the state entered yellow May 8. Another 12 counties will move into yellow on May 22.", "Counties in the red phase of Wolf’s reopening plan are still under lockdown, with stay-at-home orders in place and all but ‘essential’ businesses closed. Counties that eventually make it to the green phase will ask businesses and individuals to follow Centers for Disease Control and Prevention and State Department of Health guidelines for limiting the spread of the virus but will otherwise have no restrictions.", "Yellow counties’ gyms, hair salons, and schools must remain closed, and gatherings of more than 25 people are prohibited.", "Even still, yellow is the distinction several other Central and Eastern Pennsylvania counties are clamoring for.", "A key factor that determines whether a county qualifies for yellow privileges is whether it has fewer than 50 new reported coronavirus cases per 100,000 residents over a period of 14 days.", "The number of people sickened with the virus in Lancaster, Lebanon, Dauphin, Franklin and Schuylkill counties disqualifies them from entering the yellow phase. But that fact didn’t stop local leaders from announcing plans to reopen businesses anyway – with or without Wolf’s blessing.", "In a series of letters and tweets, the officials, including state lawmakers and county commissioners, begged Wolf to allow local businesses to reopen and better position themselves to survive the crisis. Officials from Dauphin, Franklin and Schuylkill counties later backed down. Lebanon officials are set to vote on reopening today. Lancaster officials held a news conference on the issue Thursday night but did not say what they will do.", "Counties reversed course after Wolf called them ‘cowardly’ and ‘selfish’ and threatened to withhold their federal stimulus funds if they directed businesses and residents to defy his order.", "Until recently, another nine counties found themselves in limbo.", "They had reported fewer than 50 cases per 100,000 residents over a 14-day period, but until May 15, when Wolf announced plans to move them into the yellow phase soon, they remained stuck in the red zone, which requires businesses to stay closed and residents to continue sheltering at home. Those counties include: York, Adams, Perry, Juniata, Mifflin, Carbon, Wyoming, Susquehanna and Wayne.", "Officials from York and Adams counties had been especially vocal about their frustration that businesses had not been cleared to reopen. Some officials said they didn’t understand what was holding them back, given their success keeping coronavirus case counts relatively low.", "Wolf had been asked about the discrepancy several times in recent days before he announced plans to move the counties into yellow by May 22, and his explanations lacked clarity. We had to read a 7,000 word Wolf administration document titled \"Process to Reopen Pennsylvania\" to figure it out.", "A county’s coronavirus case count is not the only piece of information Wolf’s team uses to determine when it’s ready to move into the yellow phase. He’s said this publicly, but on recent calls with the press, he hasn’t listed the other factors that matter. Carnegie Mellon University researchers advising the state compiled the list and rated counties in each category.", "According to the document, the other factors are:", "A county’s ability to meet a surge in demand for intensive care.", "A county’s density.", "The share of county residents who are over age 60.", "The share of county residents who work in \"physically closed\" industry sectors, such as nursing homes.", "When those pieces are considered, it appears York County was held back from reopening because of its population density, and Adams County was ordered to stay closed because it has an insufficient number of intensive care unit beds. Mifflin, Juniata, Perry, Carbon, Susquehanna and Wayne counties were also flagged because of limited ICU capacity.", "We had to click through a link tucked at the bottom of a May 8 press release to find a May 7 PowerPoint presentation detailing how each Pennsylvania county rates on the Carnegie Mellon risk assessment scale. It’s unclear if county officials calling to have their stay-at-home orders lifted know where to find their own ratings.", "Wyoming County in the Northeast corner of the state has a small number of coronavirus cases and doesn’t rate as high risk in any of the other categories. Before Wolf announced that Wyoming County would move into the yellow phase by May 22, it was unclear why Wolf wouldn’t allow businesses there to reopen. County officials had announced plans to reopen without Wolf’s approval and later backed down.", "In the \"Process to Reopen Pennsylvania\" document, the state cautioned that the reopening process will be fluid and that the Carnegie Mellon rating system is not designed to \"make decisions but rather to inform decision makers.\"", "Trump said that Wolf wants to keep parts of Pennsylvania closed that have been \"barely affected\" by the coronavirus. Trump was likely speaking about counties in Central and Eastern Pennsylvania like Lebanon and Lancaster whose Republican lawmakers have been clamoring for more freedom even though their coronavirus case counts remain relatively high. Those places have not been \"barely affected.\" They’re battling active outbreaks. Trump was right, though, that until May 15, Wolf wanted to keep closed nine counties with relatively few cases. For these reasons, we rate Trump’s statement Half True.", "The Philadelphia Inquirer, \"Trump comes to Pennsylvania and urges the state to reopen faster,\" May 14, 2020", "State of Pennsylvania, \"Gov. Wolf, Sec. of Health: Pennsylvania on Statewide Stay-at-Home Order Beginning at 8 PM Tonight, \"Most Prudent Option to Stop the Spread,\" April 1, 2020", "The Philadelphia Inquirer, \"Delco, Bucks call on Gov. Wolf to prioritize the Philly area, Pa.’s ‘economic engine,’ in coronavirus reopening and testing plans,\" May 5, 2020", "The Philadelphia Inquirer, \"Gov. Tom Wolf clears 24 counties to move into first reopening phase; case decline in Philly is still ‘very slow,’\" May 1, 2020", "State of Pennsylvania, \"Gov. Wolf Announces 13 Counties will Move to Yellow Phase of Reopening on May 15,\" May 8, 2020", "State of Pennsylvania, \"Gov. Wolf Announces Reopening of 24 Counties Beginning May 8,\" May 1, 2020", "Spotlight PA, \"Red, yellow, green: What to expect in each of Pa.’s tiers for reopening,\" May 1, 2020", "PA Post, \"Here’s Lancaster County’s plan to reopen Friday ahead of the governor’s timeline,\" May 13, 2020", "The Patriot News, \"Lebanon County commissioners push to reopen Friday, defying governor’s orders,\" May 13, 2020", "Lancaster Online, \"Several southcentral Pa. officials say they'll reopen ahead of Gov. Wolf's timeline [update],\" May 10, 2020", "Herald Mail Media, \"Franklin County commissioners divided on move to ‘yellow’ phase,\" May 13, 2020", "WNEP, \"Schuylkill County tells governor, 'We're reopening',\" May 10, 2020", "WGAL, \"Some Pennsylvania counties back off plans to reopen against governor's orders,\" May 14, 2020", "The Morning Call, \"Schuylkill County commissioners reverse on county reopening Friday,\" May 13, 2020", "WGAL, \"Lebanon County commissioners to vote Friday on resolution to reopen early,\" May 13, 2020", "WGAL, \"Some Lancaster County leaders say they will forge ahead with plan to reopen early,\" May 15, 2020", "Pittsburgh Post-Gazette, \"Gov. Tom Wolf denounces Pa. counties reopening without his approval as ‘cowardly,’ ‘selfish’\" May 11, 2020", "WGAL, \"Some Pennsylvania counties tell Gov. Wolf they will begin reopening despite his orders,\" May 11, 2020", "The Patriot-Ledger, \"Data doesn’t support keeping businesses in York and Adams counties closed, Republican lawmakers argue,\" May 12, 2020", "State of Pennsylvania, \"Process to Reopen Pennsylvania,\" May 12, 2020", "Carnegie Mellon University, \"CMU Dashboard Will Help Inform State Decision-Makers During Pandemic,\" April 22, 2020", "State of Pennsylvania, \"Gov. Wolf Announces 13 Counties will Move to Yellow Phase of Reopening on May 15,\" May 8, 2020", "Carnegie Mellon University, \"Risk-Based Decision Support Tool,\" May 7, 2020", "WNEP, \"Wyoming County won't reopen without Governor's OK,\" May 12, 2020", "The Philadelphia Inquirer, \"Coronavirus: Tracking The Spread,\" Accessed May 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]