["Facebook posts claim that a hand-written poem by Myanmar State Counselor Aung San Suu Kyi, which fetched $180,000 USD at auction in Yangon early September, was plagiarised from a poem by Vladimir Mayakovsky. The claim is false: Russian literature experts told AFP the poem is “certainly not borrowed from Mayakovsky”.", "The claim was published here on Facebook on September 16, 2020, where it has since been shared some 1,200 times.", "Part of the Burmese-language post translates to English as: “The poem that sold at auction for 2,400 million Kyat is a copy from a Russian poem”.", "The caption also contains a Burmese, Russian and English-language translation of the poem by Suu Kyi:", "“The Proud \n\tPoetry \n\tEchoes of the human mind\n\tThe beating of a human heart\n\tThe roar of the human spirit\n\tThe song of human hope\n\tPoetry\n\tThis is the sound of our struggle\n\t#Vladimir Mayakovsky…\n\n\t“Shame! Despite plagiarising the original poem [from Vladimir Mayakovsky], the grammar is still wrong.”", "The post was published alongside a photo of Aung San Suu Kyi’s hand-written poem and a composite image.", "The composite image includes a stock photo of Russian poet Mayakovsky that has circulated widely online, for example here in a tweet from the Russian Embassy in Sri Lanka.", "It also includes Russian language text which saying: \"On this day 19 July 1893 was born Vladimir Mayakovsky\" and a photograph of a Russian-language book called The Story of Zoya and Shura by Russian folk hero Zoya Kosmodemyanskaya.", "The image of the handwritten poem has been taken from a post by poet Min Htin Ko Ko Gyi, who auctioned the poem.", "He posted the image of the handwritten poem here on his Facebook page with a caption saying: \"Poem from 54 University Avenue. This handwritten poem on a piece of paper was given to me by Mother Su [Aung San Suu Kyi] in the dining room of 54 University Avenue [Suu Kyi's house] at around 4:00 pm on June 30, 2011. It was just before I was setting off for Colombia. I was on my knees thanking Mother Su.\"", "In another post here he explains that he asked Suu Kyi to write the poem when he was due to speak at the 20th international poetry festival in Colombia.", "\"I told her that I would like to recite her poem before my own poems. That's the reason Mother Su wrote this poem. I didn't ask her to compose the poem as a gift to me. I asked for her poem in order to share it with international poets,\" the post said.", "The hand-written copy of the poem went up for auction on September 5, 2020 in Yangon and sold to an anonymous buyer for 240 million Burmese Kyats, or $180,000 USD.", "In this September 16, 2020 Facebook post Min Htin Ko Ko Gyi said he has since donated all of the proceeds to Aung San Suu Kyi's National League for Democracy (NLD) party, ahead of the November 8, 2020 General Election.", "Vladimir Mayakovsky is a Russian poet, widely considered a leading literary figure of the early Soviet period.", "Identical claims were also published here, here, here, and here on Facebook.", "The claim is false.", "Vera Teriokhina, the head of a specialist group on Mayakovsky at the Russian Science Academy’s Institute of World Literature, told AFP the poem “certainly is not borrowed from Mayakovsky”.", "During a phone conversation on September 17, 2020, Teriokhina said: “It’s imitating Mayakovsky, but it’s certainly not borrowed from him. It’s actually quite far from Mayakovsky. The poem is influenced by Mayakovsky’s work, and his understanding that poetry can be a force for transformation of society.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]