["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "West Virginia president Gordon Gee greets a fan before an NCAA college basketball game on Jan. 11, 2014. (AP/Andrew Ferguson)", "Is West Virginia University’s freshman class this year the smartest ever? The question came up as part of an ongoing dispute between West Virginia University and fraternities over student safety.", "In February, WVU President Gordon Gee released a statement charting a course for future relations between the university and Greek organizations.", "\"Fraternities and sororities are acquiring an increasingly toxic reputation among parents, employers and members of the public,\" Gee wrote in the Feb. 15, 2018 letter. \"At West Virginia University, we are not waiting for the next tragic death, arrest or headline-grabbing incident to prompt our action. When it comes to student misconduct in our fraternities and sororities, the time to act is now.\"", "Later in his letter, Gee wrote that following a student death in 2014, \"we have had great success in changing our overall student culture to emphasize working smart and playing smart. The result has been a rise in student academic qualifications. Last fall, for example, on our Morgantown campus we welcomed our biggest class of Honors College freshmen ever, as well as our largest overall freshman class, with the highest-ever GPA.\"", "Friction between the university and fraternities has continued: Several fraternities threatened to bolt from university oversight, and during the first week of the semester in August, Gee sent a letter to parents asking them to \"discourage\" students from rushing unaffiliated fraternities.", "In this article, we aren’t going to fact-check the fraternity controversy, but one portion of Gee’s earlier letter caught our eye. Is it true that WVU’s current freshman class has the \"highest-ever GPA\" in the university’s history, as Gee wrote?", "On the university’s website, it says that \"the average student enrolled in WVU’s Fall 2018 freshman class had a 3.55 high school GPA, an ACT score of 24 and a combined Math and Critical Reading SAT score of 1133.", "Stephen Lee, WVU’s associate vice president of enrollment management and executive director of admissions and recruitment, provided PolitiFact with a partial run of older data.", "The data Lee provided shows that average GPAs for the previous three years were 3.47 for the freshmen of 2017, 3.46 for the freshmen of 2016, and 3.45 for the freshmen of 2015.", "Here’s a chart summarizing the data from Lee:", "The data shows a steady increase in the freshman GPA, but the data goes back only to 1995. So we can’t independently confirm that this fall’s freshmen have the highest GPAs \"ever.\"", "Meanwhile, the data also showed a post-1995 high for SAT and ACT standardized test scores for incoming freshmen in 2018.", "Gee wrote that WVU’s incoming freshman class for 2018 has the \"highest-ever GPA\" in the university’s history. The incoming freshman GPA is the highest since 1995, according to data provided by the university, and given the steady rise since 1995, it’s plausible that the current class’ GPA is the highest in the university’s history. But we do not have data that independently confirms that.", "The statement is accurate but needs additional information, so we rate it Mostly True.", "West Virginia University, \"President Gee addresses IFC decision,\" Feb. 15, 2018", "West Virginia University, \"Letter to parents regarding fraternity life,\" Aug. 19, 2018", "CollegeData.com, West Virginia University page, accessed Sept. 12, 2018", "Pittsburgh Post-Gazette, \"As 'rogue' fraternities emerge, WVU's president sends urgent message to parents about ungoverned groups,\" Aug. 20, 2018", "Email interview with Stephen Lee, West Virginia University’s associate vice president of enrollment management and executive director of admissions and recruitment", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]