["The images were published on Facebook here on March 3, 2020. The post has been shared more than 2,500 times.", "Below is a screenshot of the misleading post:", "The post’s Sinhala-language caption translates to English as: “EXCLUSIVE Chicken also infected with coronavirus. We can no longer eat chicken?”", "The novel coronavirus, COVID-19, was first detected in the Chinese city of Wuhan in late December 2019. The virus has killed more than 6,000 people and infected 163,930 worldwide, including sports stars, celebrities and world leaders, AFP reported here on March 16, 2020.", "The photos were also shared with a similar claim on Facebook here and here.", "The claim is false.", "“So far there is no evidence to claim that chicken is infected with the novel coronavirus and that it's unsafe to consume chicken,” Dr. R. Hettiarachchi, the acting director general of Sri Lanka’s Animal Production and Health Department, told AFP by phone on March 11, 2020.", "Hettiarachchi said there was no need to “concern oneself over eating chicken” and warned that such “baseless claims can really damage the poultry industry.”", "Dr. Ashan Pathirana, the registrar of Sri Lanka’s Health Promotion Bureau, also said chicken remains safe to consume and cautioned the public against “unnecessary panic”.", "“While it is important to practise general good food safety measures such as avoiding contamination of uncooked proteins and avoiding raw or uncooked meats, there is no need to create an unnecessary panic over baseless claims,” Pathirana told AFP on March 5, 2020.", "Dr. Pathirana urged the public to only trust verified government sources when sharing information about the coronavirus.", "The images used in the misleading posts were also being shared out of context. They werre taken from various unrelated reports online and show chickens sickened with other diseases. They were debunked here and here by AFP after circulating in similar posts in India and Pakistan.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]