["By Sydney Schaedel", "Posted on August 28, 2017", "Q: Did the Supreme Court rule that President Donald Trump can build a border wall without the approval of Congress?", "A: No. That story comes from a website that “makes no guarantee that anything you find here will be based at all in reality.”", "The Supreme Court did not rule that President Donald Trump can build a wall on the United States’ southern border without approval from Congress.", "A story that makes this claim has appeared on several websites, including flashnewsusa.com and patriotusa.website, and it has been flagged by Facebook users who thought it might be fake. The stories on other sites all lead back to a story headlined “HUGE LEGAL NEWS: SCOTUS Rules Trump Can Build The Wall WITHOUT Congress,” on ourlandofthefree.com.", "An immediate tip-off that this website might publish satire is the URL of the story, which says “scotus-rules-trump-has-the-iq-of-an-amoeba.”", "Although the story isn’t labeled satire, the “About Us” tab of ourlandofthefree.com says: “Ourlandofthefree.com makes no guarantee that anything you find here will be based at all in reality. All posts should be considered satirical and all images photoshopped to look like something they’re not. It’s not you, it’s me.”", "But even without noticing the site’s disclaimer, readers could find a number of suspicious elements in the story.", "The apparent spokesperson for the Supreme Court is referred to as “WHOIP Director Jeff Derpinger.” But an internet search for that name and title only returns stories from ourlandofthefree.com and other satirical websites, such as thelastlineofdefense.org.", "The Supreme Court’s apparent logic for its fake decision doesn’t make much sense either.", "“President Trump found a loophole in the Evolution Clause that allows the President to make decisions of national security concerning our borders,” the story says. “In a decision in 1826, Chief Justice Jonathon Lieberston noted that the decision to secure the borders of Texas after the Alamo came at great national expense but that the benefit outweighed the cost.”", "There is no “Evolution Clause” in the Constitution, and no chief justice, or associate justice for that matter, who has ever been named “Jonathan Lieberston.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Admin. “HUGE LEGAL NEWS: SCOTUS Rules Trump Can Build The Wall WITHOUT Congress.” Flashnewsusa.com. 25 Aug 2017.", "Admin. “HUGE LEGAL NEWS: SCOTUS Rules Trump Can Build The Wall WITHOUT Congress.” Patriotusa.website. 25 Aug 2017.", "Eagleton, Flagg. “HUGE LEGAL NEWS: SCOTUS Rules Trump Can Build The Wall WITHOUT Congress.” Ourlandofthefree.com. 24 Aug 2017.", "U.S. Supreme Court. “Justices 1789 to Present.” Undated. Accessed 25 Aug 2017.", "“Popular Names of Sections and Clauses.” Usconstitution.net. Undated. Accessed 25 Aug 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]