["By Robert Farley", "Posted on September 28, 2018", "President Donald Trump wrongly said that “nobody from this country knew” about Mexico’s value-added tax until after NAFTA was signed. A deputy U.S. trade representative at the time NAFTA was put in place said: “US policymakers, embassy officials and tax authorities were fully aware of Mexico’s VAT system.”", "The president also claimed that the VAT tax put the U.S. “16 points behind, before we even started.” The former trade representative, as well as several economists and tax experts, told us the VAT is not a trade barrier, as it is charged on goods imported into Mexico as well as on products made and sold within Mexico.", "Trump has repeatedly claimed as president, and as a candidate, that he views Mexico’s VAT tax as a “hidden tax” that puts U.S. exporters at a disadvantage.", "In his Sept. 26 press conference at the United Nations, Trump reiterated that claim, and added that NAFTA negotiators in the early 1990s were duped.", "“NAFTA was a defective deal the day it was signed. You know why? Because they had a VAT tax of 17 percent and nobody from this country knew that,” Trump said. “And by the time they found out, which was about a week later, nobody went and changed it. So you went many years and they never changed it. There was a VAT tax that Mexico got. So we were 17 or 16 points behind, before we even started. NAFTA was a horrible thing.”", "A value-added tax or VAT is “a consumption tax placed on a product whenever value is added at each stage of the supply chain, from production to the point of sale. The amount of VAT that the user pays is on the cost of the product, less any of the costs of materials used in the product that have already been taxed,” according to Investopedia. And Mexico does indeed have a 16 percent VAT.", "It’s “factually inaccurate” for Trump to say “nobody from this country” knew about Mexico’s VAT and that they didn’t find out until “about a week later,” said Rufus Yerxa, president of the National Foreign Trade Council, a business organization.", "“US policymakers, embassy officials and tax authorities were fully aware of Mexico’s VAT system and other aspects of its tax system,” Yerxa told us via email.", "Yerxa was deputy U.S. trade representative in Geneva under President George H.W. Bush during the initial NAFTA negotiations. He took over as Washington deputy after Bill Clinton was elected president, and became the chief negotiator for the NAFTA side agreements. He also led the USTR effort to get the implementation legislation through Congress.", "“It wasn’t that they weren’t aware of it. They knew about it,” Gary Clyde Hufbauer, a nonresident senior fellow at the Peterson Institute for International Economics, told us. “But they didn’t think of it as a trade disadvantage, therefore it was not subject to negotiations.”", "An economic plan released by the Trump campaign in September 2016, and penned by Peter Navarro, now a White House trade adviser, and Wilbur Ross, now secretary of commerce, argued that it is a trade barrier. Because goods imported from the U.S. to Mexico are subject to the VAT, they argued, this “turns the VAT into an implicit tariff on US exporters.”", "Navarro and Ross, Sept. 29, 2016: Here is the key unequal tax treatment issue: While the US operates primarily on an income tax system, all of America’s major trading partners depend heavily on a “value-added tax” or VAT system. Under current rules, the WTO allows America’s trading partners to effectively create backdoor tariffs to block American exports and backdoor subsidies to penetrate US markets. …", "Under WTO rules, any foreign company that manufactures domestically and exports goods to America (or elsewhere) receives a rebate on the VAT it has paid. This turns the VAT into an implicit export subsidy.", "At the same time, the VAT is imposed on all goods that are imported and consumed domestically so that a product exported by the US to a VAT country is subject to the VAT. This turns the VAT into an implicit tariff on US exporters over and above the US corporate income taxes they must pay.", "The two argued that Mexico “shrewdly exploited the VAT backdoor tariff to further its competitive advantage,” increasing its VAT from 10 percent to 15 percent “shortly after the NAFTA agreement was signed in 1993.”", "Several economists and tax experts, however, told us Mexico’s VAT is not a trade barrier.", "“It is important to emphasize the Mexican VAT applies equally to domestic and imported products,” Yerxa told us. “It is not a discriminatory tax on imported products. It is trade neutral. It is similar to the VAT taxes that the European countries, Japan and many others maintain. They are basically consistent with international trade rules. The US does not have a VAT at the national level, but we do have state sales taxes and federal excise taxes, that also apply to imported products from NAFTA countries (as well as domestic products).”", "“This is one of those zombie ideas that never dies,” Joseph Rosenberg, a senior research associate at the Tax Policy Center, told us back in June. “The structure of value-added taxes (VATs) and the fact that they are ‘adjusted at the border’—that is, the tax is imposed on imports and rebated on exports — does not distort trade flows. In fact, VATs are designed to be neutral to trade. They tax domestic consumption, not production. So the tax is imposed uniformly on goods consumed domestically regardless of where the goods are produced.”", "In an article published during the presidential campaign, Eric Toder, co-director of the Tax Policy Center, wrote that Trump was “simply wrong” when he claimed that Mexico’s VAT “gives its producers an advantage over American competitors.”", "“A VAT is meant to be a tax on consumption,” Toder said. “Mexicans pay the same Mexican VAT on taxable goods and services they buy in Mexico no matter where they are produced. At the same time, no Mexican VAT is imposed on goods or services consumed outside of Mexico, regardless of where they are produced.” Therefore, it provides no “leg up” over U.S. importers, he said.", "Toder noted that while the U.S. has no national sales tax, it does impose “federal excise taxes on goods such as tobacco products, alcoholic beverages, and motor fuels.” Those excise taxes are treated the same way other countries treat their VAT.  “The cigarette excise tax, for example, applies to imported cigarettes, but not those exported by U.S. tobacco companies,” Toder wrote. “State retail sales taxes in the United States work the same way: They apply to domestic consumption of taxed products from all sources, but not to exports.”", "“No, Mexico’s VAT is not an unfair trade barrier,” Alan Deardorff, an economics professor at the University of Michigan, told us via email in June. “It is a tax that they charge on value added (the value of the output minus the value of any purchased inputs), and they charge it on everything, whether it is produced in Mexico or abroad. But it’s only charged if the product remains in Mexico. It is rebated on goods that are exported. So it is not a discriminatory tax, since it is charged both on imports and on domestic production.”", "In fact, Hufbauer told us, if the U.S. were to negotiate an elimination of the VAT on goods imported into Mexico, that would put Mexican producers at a competitive disadvantage, because they’d still have to pay the VAT on goods made and sold domestically.", "In an interview with CNBC in March 2017, Secretary of Commerce Wilbur Ross said the administration would use the renegotiation of NAFTA as “a partial means of addressing” what it believes is an unfair advantage for Mexico due to the VAT.", "Yerxa said the renegotiated trade agreement with Mexico doesn’t change the rules with respect to the VAT. The Trump administration is expected to publish the text of the trade deal with Mexico on Sept. 28.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]