["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a September 2011 floor speech, Democratic U.S. Rep. Lloyd Doggett of Austin spoke of two concerns he said are growing in the Lone Star State: poverty and hunger.\n\nDoggett said that in tough times, more families are turning to food banks, creating \"immense\" demand. Among his examples: The Austin-based Capital Area Food Bank of Texas \"this year is delivering 50 percent more food to poor people than it did three years ago.\"\n\nIn his speech, Doggett attributed that figure to John Turner, a food bank official. We wondered if the proclaimed increase was correct, and if so, whether that accurately reflected a surge in hunger in our area.\n\nThe food bank, founded in 1981, takes in donations of food and money from the government, the food industry and the public, then distributes food to Central Texas residents directly and through more than 350 agencies in its 21-county service area roughly centered on Travis and Williamson counties. (Click to view a map.) The region’s north edge runs from Mills County in the west to Freestone County in the east; its south edge runs from Gillespie and Blanco counties in the west to Fayette County on the east.\n\nDoggett spokeswoman Sarah Dohl told us by email that Doggett drew his 50 percent figure from a Sept. 4, 2011, news story in the Guardian, a British newspaper, which quotes Turner saying the food bank was delivering 50 percent more food to the poor than it had done three years ago.\n\nIn an interview, Turner, the food bank’s senior director for marketing and branding, recently told us he’d given the Guardian a conservative estimate: The pounds of food distributed by the bank had actually increased 64 percent, going from 15.4 million pounds in 2007 to 25.3 million pounds in 2010. Turner noted, too, that the 2010 poundage was inflated by one-time federal stimulus aid enabling the bank to buy an additional 2.3 million pounds for the Summer Food Nutrition Program. Subtract that, and the 2010 figure becomes 23 million pounds -- up 49 percent from what the bank gave out in 2007.\n\nSo, do the poundage figures mean hunger in the area shot up 49 percent or more over the past few years?\n\nJ.C. Dwyer of the Texas Food Bank Network, the state association of food banks, told us pounds of food distributed generally isn't the best measure of need in a food bank's region: \"It’s more of a metric for how we’re dealing with the needs,\" Dwyer said. A better way of gauging needs, he said, is to track the number of residents requesting food assistance.\n\nThat is, the amount of food distributed doesn't necessarily reflect ups and downs in need. In the holiday season, donations and distributions surge, for instance, but that doesn’t necessarily mean surges in need.\n\nDwyer and Turner each suggested we check on changes in food demands through \"Hunger in America,\" a report commissioned every four years by Feeding America, a national charity that acts as a clearinghouse connecting food supplies to 200 food banks, including the one in Austin.\n\nThere was no \"Hunger in America\" report for 2007, the first year in Doggett’s statement, but the reports based on surveys in 2005 and 2009 were broken down into smaller reports covering the Austin bank’s 21-county region: In 2005, the Capital Area bank fed an estimated 174,900 people. In 2009, the estimated number of people served was 284,900 for the year, up 63 percent from those who were served in 2005.", "That change outstripped population growth, according to U.S. census estimates. In 2005, the 21 counties had 2,265,981 residents. By 2009, the region’s population was 2,547,559 -- up 12.4 percent. Put another way, the food bank provided sustenance to nearly 8 percent of the region’s residents in 2005 while about 11 percent of a greater total of residents got food in 2009.\n\nFinally, we wondered if Doggett was correct in saying the food aid went to the poor alone.\n\nTurner told us the bank does not question people who come seeking food as to their income -- if you show up, you are fed, he said, though depending on the lines that form, it could take an hour or two. However, the \"Hunger in America\" report using 2009 data states that 73 percent of the Capital Area food bank’s clients had incomes below the federal poverty level.\n\nCensus figures for 2010, drawing on 2009 data, show that poverty in the 21-county region matched the percentage for Texas overall: Seventeen percent of residents had income below the federal poverty level. According to the United States Department of Agriculture, Dwyer told us, \"food insecurity\" across Texas -- the percentage of households at risk of missing meals because of financial pressure -- rose from 14.8 percent in the three-year period 2005-07 to 18.8 percent in 2008-10.\n\nOur conclusion: Changes in the amount of food distributed over several years, which Doggett cited, might not be the best way to gauge changes in residents’ needs. That said, the number of Central Texas requestors for food aid over those years outpaced regional population growth. The 63 percent increase in requestors also exceeded the 50-percent increase in food distributed that he stressed, though, contrary to his statement, not all those pounds of food went to \"the poor.\"\n\nWe rate the claim Mostly True.", "U.S. Rep. Lloyd Doggett, speech on House floor, Sept. 21, 2011\n\nCapital Area Food Bank of Texas web site\n\nJohn Turner, senior director for marketing and branding, Capital Area Food Bank of Texas, interviews by phone, email and in person, Oct. 17-31, 2011\n\nMathematica Policy Research Inc. on behalf of Feeding America, survey based on 2009 data, \"Hunger in America 2010 Local Report Prepared for The Capital Area Food Bank of Texas, Inc.,\" published Feb. 1, 2010                    \n\nSarah Dohl, communications director for Rep. Doggett, interviews by phone and email Oct. 14-31, 2011\n\nThe Guardian, news story, \"Texas poverty figures challenge Rick Perry jobs record,\" Sept. 15, 2011   \n\nJ.C. Dwyer, state policy director for the Texas Food Bank Network, interview by email, Oct. 28, 2011\n\nMathematica Policy Research Inc. on behalf of Feeding America, survey based on 2009 data, \"Hunger in America 2006 Local Report Prepared for The Capital Area Food Bank of Texas, Inc.,\" published Feb. 1, 2006\n\nU.S. Census Bureau, web site, 2000-2009 data for Texas counties, \"State & County QuickFacts\"           \n\nU.S. Census Bureau, web site, 2010 data for Texas, \"State & County QuickFacts\"\n\nUnited States Department of Agriculture Economic Research Service, report, \"Household Food Security in the United States in 2010, Statistical Supplement,\" Administrative Publication No. 057, September 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]