["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On April 3, 2014, legislation intended to protect pregnant women from workplace discrimination and safeguard the health of both the mother and child was introduced before the Providence City Council. It called for accommodations such as extra break times and the right to transfer to lighter duty.", "Arguing in support of the legislation, Council President Michael Solomon, a co-sponsor, said in a news release, \"Pregnant women who stand for five or six hours at a time increase their risk of pre-term pregnancy by 80 percent.\"", "Pre-term pregnancy means a woman gives birth before 37 weeks -- about eight and a half months -- of pregnancy; 37 to 42 weeks is considered normal. Currently about 1 in 8 babies are born pre-term in the United States and they account for about 35 percent of infant deaths.", "We knew that studies have shown that most physical activity does not pose a risk during pregnancy, but we were unaware that prolonged standing could hike the risk of prematurity by 80 percent -- which is almost double the normal risk.", "In his news release, Solomon attributed the information to the Women's Fund of Rhode Island. We are fact-checking his statement because, although he clearly cited the source of his information, public officials are still responsible for the statistics they repeat.", "Solomon released a statement defending the idea behind the proposal, saying, \"Providing reasonable accommodations and taking common sense steps to protect the health of pregnant women and their babies is the right thing to do.\" He did not offer any evidence to support the 80 percent statistic.", "As it turns out, the issue has been studied for years and the findings have been all over the map, with some researchers discovering a risk comparable to 80 percent -- and sometimes greater -- but most finding a much smaller risk, if any risk at all. Also, the definition of \"prolonged standing\" can vary from study to study, which can make it hard to compare studies.", "\"The Face of Pregnancy at Work\" page on the Women's Fund website essentially has the same claim Solomon made: \"Women who stand for 5 to 6 hours at a time increase their risk of pre-term delivery by 80 percent.\" It lists no source. A spokeswoman promised to get back to us with more information.", "Meanwhile, we called the 57,000-member American College of Obstetricians and Gynecologists, which sent us some material that raised questions about the 80-percent claim.", "For example, the American College sent us a 1995 study that involved women who stood at work for longer periods -- in this case five hours per day. They were 20 percent more likely to have a premature delivery than pregnant workers who stood for two hours or less each day. That's significantly lower than 80 percent.", "An overview of such studies was published in 2000 in the journal Obstetrics and Gynecology. It combined the results from 14 studies published between 1983 and 1998. Eight found no link between prolonged standing (defined as more than three hours a day, not five or six hours), two showed a clear link and three showed a barely significant increase. The studies from the mid-1990s onward tended to show no link.", "Overall, the researchers calculated, prolonged standing increased the risk by 26 percent.", "When the people at the Women's Fund got back to us, they directed us to the summaries of seven studies. Some were part of the Obstetrics and Gynecology analysis (which was included in their list). There were also some more-recent examinations of the question.", "One found no significant risk for premature delivery for women standing more than seven hours a day. A second found that the risk was 69 percent greater.", "A third, a 2004 report in the Journal of Epidemiology & Community Health, found that a woman would have to stand for more than six hours a day to produce a significant risk. Doing so increased the chances of preterm birth by 26 percent. It was the same degree of risk seen among women who reported that the satisfaction of their job was low.", "However, in the countries where the infant mortality rate was low and women could take long prenatal leaves, standing for more than six hours did not increase the risk at all.", "When it comes to body posture, \"the worst position a pregnant woman can be in is standing and being motionless,\" said Dr. Raul Artal, chairman of the department of obstetrics, gynecology and women's health at the Saint Louis University School of Medicine in Missouri.", "A woman who is on her feet but moving around doesn't face the same risk, he said. \"Actually, I would encourage women to walk around.\"", "Instead of a risk that's 80 percent higher, an estimate in the 20-30 percent range \"is much more reasonable,\" said Atral, who edits the Clinical Updates in Women's Health Care for ACOG.", "In general, \"healthy pregnant women should be encouraged to continue to live a normal life,\" he said.", "We also note for the record that the U.S. Centers for Disease Control and Prevention has a list and poster of things a woman can do to prevent a pre-term delivery. Avoiding prolonged standing is not listed as a big risk factor.", "Our ruling", "Providence City Council President Michael Solomon said, \"Pregnant women who stand for five or six hours at a time increase their risk of pre-term pregnancy by 80 percent,\" attributing the statistic to the Women's Fund of Rhode Island.", "That's a very specific claim.", "But the evidence is based on a few studies, cherry-picked from a larger body of research that suggests that the risk, if there is one, is significantly smaller.", "Because the statement contains some element of truth but ignores critical facts that would give a different impression, we rate it Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "ProvidenceCityCouncil.com, \"Council to Introduce Ordinance to Protect Women from Pregnancy Discrimination in the Workplace,\" April 3, 2014, accessed April 9, 2014", "Email, Marisol Garcia, director of communications, Providence city council, April 18, 2014", "WFRI.org, \"The Face of Pregnancy at Work,\" Women's Fund of Rhode Island, undated, accessed April 9, 2014", "Obstetrics and Gynecology, \"Working Conditions and Adverse Pregnancy Outcome: A Meta-Analysis,\" April 2000, accessed April 11, 2014", "NCBI.NLM.NIH.gov, \"Employment, working conditions, and preterm birth: results from the Europop case-control survey,\" Journal of Epidemiology & Community Health, 2004, accessed April 10, 2014; \"The Risk of Prematurity and Small-for-Gestational-Age Birth in Mexico City: The Effects of Working Conditions and Antenatal Leave,\" American Journal of Public Health, June 1996, accessed April 17, 2014; and \"The effects of standing, lifting and noise exposure on preterm birth, growth restriction, and perinatal death in healthy low-risk working military women,\" Journal of Maternal-Fetal & Neonatal Medicine, September 2005, accessed April 17, 2014", "Wiley.com, \"Standing at work and preterm delivery,\" BJOG: An International Journal of Obstetrics and Gynaecology, March 1995, accessed April 11, 2014", "Emails, Nuria Chantre, April 16-17, 2014, and Molly Garrison, April 14, 2014, Women's Fund of Rhode Island, and Megan Erhardt, manager of media relations & communications, American College of Obstetricians and Gynecologists, April 10-14, 2014", "Interview, Dr. Raul Artal, chairman, department of obstetrics, gynecology and women's health, Saint Louis University School of Medicine in Missouri, April 15, 2014", "CDC.gov, \"Preterm birth,\" Dec. 9, 2013, and \"Factors Associated with Preterm Birth,\" undated, accessed April 11, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]