["About this rating", "In late November 2016, a salacious December 2015 article from the fake news site NotAllowedTo.com appeared once again. According to the story, a woman stabbed her boyfriend several times after he attempted to have sex with a raw turkey:", "Police were called with reports of a domestic violence incident. When they arrived, they found 24-year-old Ryan Mills on the ground in the living room next to an uncooked turkey carcass. He was stabbed five times, once in the arm and four times in the legs. His girlfriend, 19-year-old Tiffany Rodriguez was found crying on the couch holding a knife.", "According to the police report, Mills allegedly had sex with the turkey corpse after he took it out of the refrigerator to prepare it for Thanksgiving dinner. His girlfriend admitted to finding him in the bathroom “going at it hard” with the Thanksgiving meal. That’s when she grabbed the turkey and ran into the living room while Mills chase after her, apologizing. Rodriguez admitted that’s when she lost it and began stabbing him in his extremities.", "Rodriguez was arrested for assault with a deadly weapon and Mills is being charged with ‘animal abuse’ But, in a magnificent piece of legal footwork, his attorney argues that he can’t be guilty of that crime, because a carcass is not an ‘animal’ ... If Mills is convicted, he could serve up to two years in prison, because of a previous conviction in 2005 for shooting a dead pig named Mitzie so that he could have sex with it.", "The image of the couple involved in the purported turkey carcass sex act dispute was the same as one used for a previous fake news item about a meth-addled couple eating a homeless man in New York's Central Park. NotAllowedTo.com is a web site that publishes only sensational fake news stories, and includes the following disclaimer:", "NotAllowedTo.com is intended for entertainment purposes only. Our website and social media content uses the most notorious urban and satirical entertainment news with the most shocking headlines and articles.", "Before the turkey carcass sex hoax, NotAllowedTo.com published articles reporting that Meek Mill's father was Martin Luther King, Jr., that Americans petitioned to replace the U.S. flag with a rainbow gay pride version, that a Colorado McDonald's added a pot smoking section for diners, that a young man murdered a female friend over the #WasteHisTime hashtag, that more than a dozen girls were impregnated after a boy ejaculated in a swimming pool, that McDonald's disclosed the presence of french fry grease in coffee, that a serial \"booty tickler\" was nabbed in Texas, and that a woman murdered her boyfriend after a prank proposal on April Fools' Day.  None of these stories are true.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]