["The posts, for example this one published to Facebook on October 6, 2018, contain a message in Hindi purportedly from \"A.K. Mittal(IPS)\", who is described as \"Commissioner Delhi.​\" IPS stands for Indian Police Service.", "Posts with the same caption have been circulating on Facebook, for example here and here, in a post published February 28, 2019, on Twitter here, and on WhatsApp, as reported in this tweet.", "The misleading posts' caption starts with the words \"IMPORTANT NOTICE\" in English and \"warning\" in Hindi.", "The posts often contain a video, for example an animation on the subject of supposed WhatsApp hacking here or a seemingly unrelated clip of a woman dancing here, which has been viewed around 2,600 times.", "Translated into English, the caption says: \"Hi friends. If you have profile picture on your WhatsApp display, please change it immediately because Isis are using the platform to plan their terror activities and these hackers have your WhatsApp numbers and can misuse your profile pictures.", "\"WhatsApp CEO has advised users to not use a display picture for the next 20-25 days. WhatsApp engineers will work and cooperate with you to keep you safe. Please forward this message.", "\"Thank You. A.K. Mittal(IPS) 9849436632 ​​Commissioner Delhi.​​ ​Pls forward to all your frnds ones too..​\"", "Below is a screenshot of one of the misleading posts:", "The current police commissioner in Delhi is called Amulya Patnaik, according to the official police website here.", "The same site lists all former Delhi police commissioners. None of them are named A. K. Mittal.", "The phone number given under Mittal’s name in the misleading posts’ caption does not work.", "AFP contacted WhatsApp to enquire about the claims.", "The company’s head of communications Carl Woog told AFP: \"This is a false rumor. WhatsApp cares deeply about the safety of our users, and we help protect your messages from hackers by providing end-to-end encryption, which means that only the sender and recipient can read your messages and no one else.\"", "The hoax has circulated online since at least 2016, for example here is an Indian Express fact check of a similar claim from July 5, 2016.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]