["A swing sits empty on a playground outside Achievement First charter school in Providence, R.I., on March 7, 2020. (AP/Goldman)", "Carlson’s language paints a black-and-white picture for children and teachers between death and full recovery. Other outcomes — including hospitalization — have occurred and are also harmful.", "There’s a lot we don’t know about long-term health conditions associated with COVID-19.", "The risk of severe illness and death due to COVID-19 increases with age and for people with underlying medical conditions.", "Fox News host Tucker Carlson downplayed the risk of the coronavirus recently, arguing on his TV show that schools should reopen because, he said, the virus \"poses virtually zero threat\" to children and most working adults.", "\"For children, the risks of staying locked at home are high,\" Carlson said in the July 7 segment. \"The risks from the coronavirus, by contrast, are not high.\"", "\"The virus is deadly to the very old and to those who are already sick. We know that,\" he continued. \"But to children and the vast majority of young and middle-aged adults and the vast majority of teachers, it poses virtually zero threat.\"", "The risk of death from COVID-19 does increase with age and for people with underlying medical conditions, the Centers for Disease Control and Prevention says. The CDC’s demographic data shows that older adults account for the majority of COVID-19 deaths.", "But \"poses virtually zero threat\" is a loaded phrase, experts said. Carlson’s language paints a black-and-white picture between death and full recovery. A lot can happen in between those two outcomes.", "\"COVID is definitely not ‘zero threat’ in any of these age groups,\" said Cindy Prins, a clinical associate professor of epidemiology at the University of Florida.", "RELATED: Donald Trump’s false claim that 99% of COVID-19 cases are harmless", "Fox News pointed to a handful of studies, articles, state statistics and CDC model estimates that identified children and young adults as less likely to fall severely ill or die from the coronavirus. Case fatality rates do rise with age, a recent CDC report on U.S. cases through May 30 shows.", "Death is the worst — but least likely — outcome for COVID-19 patients. Counting deaths and calculating fatality rates can be tricky, since deaths due to COVID-19 may be undercounted and epidemiologists still don’t know the exact number of people who were infected.", "The CDC provides age-related data as part of its provisional death counts, which lag by a few weeks because they are based on death certificates. The data through July 4 showed the breakdown of cumulative, confirmed COVID-19 deaths to look like this:", "\"Among adults, the risk for severe illness from COVID-19 increases with age, with older adults at highest risk,\" the CDC says on its website.", "That doesn’t mean there’s zero threat facing children and the other age groups. Healthy children can still get and spread the virus, although the CDC says children account for a relatively small share of cases. Working-age adults are susceptible to it, too.", "RELATED: Some COVID-19 deaths have been children", "In fact, people between the ages of 18 and 64 represented roughly 75% of all U.S. COVID-19 cases as of July 12, according to CDC data.", "The average age of teachers in 2017-18, the latest year for which data is available, was about 43 years old, according to the National Center for Education Statistics.", "Across all schools, 15.1% of teachers were under age 30; 55.7% were ages 30 to 49; 11.6% were 50 to 54; and 17.6% were 55 or older.", "Andrew Noymer, an associate professor of public health at the University of California, Irvine, is on a task force advising a local school district in Orange County, where roughly 24% of COVID-19 deaths as of July 9 were patients between 25 and 64 years old.", "\"I'm thinking of teachers, teachers aides, school nurses, lunchroom staff, administrators, custodial staff and so on,\" Noymer wrote in an email. \"Twenty-four percent of county-wide mortality in this age group is hard to dismiss!\"", "And it’s not just a matter of death versus no consequences. By most standards, for example, anything that results in a hospitalization has done significant damage. The likelihood of hospitalization rises with age, according to the CDC, but patients of all ages are at risk.", "Using data from the recent CDC report on U.S. cases through May 30, we calculated that roughly 7.8% of U.S. COVID-19 patients under the age of 60 were hospitalized in that time, including about 5.3% of patients under 60 who reported no underlying medical conditions.", "There’s also plenty left to learn about the long-term effects of infection, experts said. Donald Thea, professor of global health at Boston University, told us that \"mild disease is oftentimes far from mild and can entail profound and prolonged disability.\"", "Scientists suspect there could be links between mild cases and blood clots, chronic fatigue, strokes and other ailments in young people, according to reports.", "Doctors have also found some cases in which children previously infected with COVID-19 have developed a rare condition called multisystem inflammatory syndrome.", "\"The more and more we learn, we’re seeing things about what this virus can do that we didn’t see from the studies in China or in Europe,\" said Dr. Anthony Fauci, the nation’s top infectious disease expert, during a May 12 Senate hearing. \"I think we better be careful (that) we are not cavalier in thinking that children are completely immune to the deleterious effects.\"", "We also don’t know how schools could change the spread and impact of the coronavirus, said Prins, the University of Florida epidemiologist. \"If you’re opening up and sending kids back to school, you’re under a whole different set of circumstances.\"", "Carlson said, \"To children and the vast majority of young and middle-aged adults and the vast majority of teachers, (the coronavirus) poses virtually zero threat.\"", "The risk of dying from COVID-19 does increase with age. But Carlson’s claim that the virus \"poses virtually zero threat\" to the groups he identified ignores the possibility that people from those groups could still wind up sick, hospitalized or facing long-term health conditions.", "Many teachers are in the particularly vulnerable age groups.", "We rate this statement Mostly False.", "Fox News, \"Tucker Carlson Tonight,\" July 7, 2020", "Centers for Disease Control and Prevention, \"Demographic Trends of COVID-19 cases and deaths in the US reported to CDC,\" July 12, 2020", "Orange County Health Care Agency, \"Orange County COVID-19 Dashboard,\" accessed July 9, 2020", "New Jersey Department of Health, \"COVID-19,\" July 9, 2020", "Our World in Data, \"Mortality Risk of COVID-19,\" July 8, 2020", "Centers for Disease Control and Prevention, \"Weekly Updates by Select Demographic and Geographic Characteristics,\" July 8, 2020", "The Guardian, \"Think a 'mild' case of Covid-19 doesn’t sound so bad? Think again,\" July 6, 2020", "Centers for Disease Control and Prevention, \"CDC updates, expands list of people at risk of severe COVID-19 illness,\" June 25, 2020", "Centers for Disease Control and Prevention, \"Older Adults,\" June 25, 2020", "Centers for Disease Control and Prevention, \"People Who Are at Increased Risk for Severe Illness,\" June 25, 2020", "The Lancet, \"COVID-19 in children and adolescents in Europe: a multinational, multicentre cohort study,\" June 25, 2020", "Healthline, \"Lifelong Lung Damage: The Serious COVID-19 Complication That Can Hit People in Their 20s,\" June 22, 2020", "Centers for Disease Control and Prevention, \"Coronavirus Disease 2019 Case Surveillance — United States, January 22–May 30, 2020,\" June 19, 2020", "Centers for Disease Control and Prevention, \"Keep Children Healthy during the COVID-19 Outbreak,\" June 14, 2020", "Medium, \"What have been the fatal risks of Covid, particularly to children and younger adults?\" June 13, 2020", "Forbes, \"Report Suggests Some ‘Mildly Symptomatic’ Covid-19 Patients Endure Serious Long-Term Effects,\" June 13, 2020", "Centers for Disease Control and Prevention, \"COVID-19 Pandemic Planning Scenarios,\" May 20, 2020", "Deloitte, \"COVID-19 Factbook,\" May 15, 2020", "C-Span, \"White House Coronavirus Task Force Members Testify on Coronavirus Response and Reopening Phases,\" May 20, 2020", "The Centre for Evidence-Based Medicine, \"COVID-19: What proportion are asymptomatic?,\" April 6, 2020", "National Center for Education Statistics, \"Characteristics of Public and Private Elementary and Secondary School Teachers in the United States: Results From the 2017–18 National Teacher and Principal Survey,\" April 2020", "PolitiFact, \"Some COVID-19 deaths have been children,\" July 10, 2020", "PolitiFact, \"California Lawmaker Makes ‘Oversimplified, Untrue’ Claim About COVID-19 And Lack Of Risk To Children,\" July 10, 2020", "PolitiFact, \"COVID-19 and children: What we know, what we don’t,\" July 10, 2020", "PolitiFact, \"Donald Trump’s false claim that 99% of COVID-19 cases are harmless,\" July 6, 2020", "PolitiFact, \"Yes, children do get coronavirus. It just might not be as serious,\" May 22, 2020", "PolitiFact, \"Pa. House Speaker says coronavirus only threatens children in poor health. That’s not true,\" May 14, 2020", "PolitiFact, \"Florida governor falsely claims novel coronavirus hasn’t killed anyone under 25 in the US,\" April 10, 2020", "PolitiFact, \"Young people are being hospitalized for COVID-19, too. Let’s look at the numbers,\" March 20, 2020", "Statement from Fox News, July 9, 2020", "Email interview with Andrew Noymer, associate professor of population health, disease prevention and public health at the University of California, Irvine, July 9, 2020", "Email interview with Donald Thea, professor of global health at Boston University’s School of Public Health, July 8, 2020", "Email and phone interviews with Cindy Prins, clinical associate professor of epidemiology at the University of Florida, July 8, 2020, and July 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]