["About this rating", "In June 2017, multiple news outlets reported that a small Kentucky town called Rabbit Hash had elected a dog as its mayor. As straightforward as this reporting may seem, there are multiple layers to the story.", "We'll start with the most obvious question.", "Was a Dog Elected Mayor of Rabbit Hash, Kentucky?", "Yes. Although this is more of a title-only sort of position that doesn't come with any mayoral powers.  In November 2016, the town elected a two-year-old American pit bull terrier named Brynn (who also goes by the name Brynneth Pawltro) as its \"unofficial\" mayor:", "With barks and tail-wagging aplenty, the fourth canine mayor of Rabbit Hash surveys the city she will soon take charge of.", "In a landslide victory Brynn was chosen to guard the steps of the General Store. The 2-year-old pit bull won the election by more than 1,000 votes.", "Brynn will govern Rabbit Hash, a quaint historical district nestled on the shores of the Ohio River. She will take office after the “i-dog-uration” in February 2017, a year after a fire destroyed most of the Rabbit Hash General Store.", "How does a dog become mayor?", "Rabbit Hash is a small unincorporated area in Boone County, Kentucky. As such, it doesn't have much of a need for a formal mayor.", "There is a longstanding tradition of electing nonhuman mascots as the town's mayor, which started in 1998 when the Rabbit Hash Historical Society held an \"election\" in order to raise funds to restore a church. The Historical Society charged a dollar to vote in the election, which resulted in the election of a dog named \"Goofy Borneman\" as the town's very first mayor:", "Mayor Goofy Borneman was the first elected mayor of Rabbit Hash. Born of unknown parentage and adopted in 1985 by the Borneman/Calhoun family of Rabbit Hash, Goofy was raised as any local dog-resident of the town. His early years were happy ones, playing with the Bornemans’ son, Mike Calhoun.", "According to Mike, it was the standard boy-dog relationship with Goofy a constant companion for Mike as they traveled up and down Lower River Road. While Mike was in school, Goofy would still take the familiar path between his home and the Rabbit Hash General Store visiting neighbors and eating any scraps along the way. In his adolescence, Goofy ran into trouble. Lounging in the road proved to be a dangerous past-time as he was hit by cars more than once. He also had a stinky reputation and fell into trouble with his owner, Ed Borneman, when Goofy was allegedly found to be poaching town chickens.", "In his older years, Goofy settled down and was content to remain on the straight and narrow. In June 1998, upon Boone County, Kentucky’s bicentennial celebration, the Rabbit Hash mayor’s race was announced. Although initially open to anyone in the area, only humans entered the race. After Jane and Randy Cochran entered their black Labrador Retriever, Herb, in the race, the Borneman family, finding that everyone in the town already held a relationship with their aging dog, Goofy, decided to enter him. The charisma of the Borneman family and the notorious reputation of Goofy led to a triumphant result as Goofy beat out famed woodcarver “Crazy Clifford” Pottorf and fellow four-legger Herb Cochran.", "Goofy died in office, and was succeeded by a black lab named Junior. When Junior died, the town elected a red and white border collie named Lucy Lou, who left office in 2015 to \"embark\" on a tongue-in-cheek run for United States President:", "The question Mayor Lucy Lou is most asked is, “How does a DOG become mayor”?", "Her answer: “As with politics in every corner of the earth, the candidate with the most money wins. In Rabbit Hash, we’re just honest about it. Anyone of any age can vote, you can vote as many times as you like, and we encourage drinking at the polls.” Lucy Lou’s executive staff have been heard to say on more than one occasion, “We bought that election fair and square!”", "Does Rabbit Hash elect other animals?", "The election in Rabbit Hash is largely a fundraiser for the Rabbit Hash Historical Society. Although the town has only elected canine mayors since its first election in 1998, it is not exclusive to dogs.  Other animals, including humans, have entered the race:", "The competition was stiff.", "\"There was a cat, the chicken, a donkey, a little boy,\" Bamforth said.", "Brynneth took them all down without much more than a bark. Believe it or not, the pooch is the fourth dog mayor to be unleashed on the city.", "Does Mayor Brynneth Pawltro have a staff?", "Although previous mayors of Rabbit Hash were the sole figures within their administrations, the Rabbit Hash Historical Society announced that two of this year's runner-ups, Bourbon and Lady, would serve as ambassadors for the town:", "BRYNN is the new Mayor of Rabbit Hash Kentucky!!! In an unprecedented move, the Rabbit Hash Historical Society has given official positions to the 1st and 2nd runner ups, Bourbon and Lady, as Ambassadors to Rabbit Hash. In the case that the official mayor is unavailable for an event or obligation, the Ambassadors will fill in.", "Here is the official tally:", "Brynn: 3367\nBourbon: 2336\nLady: 1621\nHiggins: 495\nStella: 400\nWalter: 397\nBossy: 216\nLouis: 76\nIzacc: 53", "Mayor Lucy Lou said that she has has been honored to serve for the past 8 years. Through the course of a tense evening of voting she sniffed the butts of all the candidates and has given her approval to the Mayor elect, Brynn. She looks forward to working with the new mayor and the Ambassadors as Rabbit Hash strives to restore the General Store.", "Brynn also has an owner. 23-year-old Jordie Bamforth, who is studying to be a veterinarian, adopted Brynn as a puppy.  She said that one of the reasons she wanted to enter to the race was to dispel rumors about pit bulls being aggressive:", "Bamforth told reporters:", "Brynn has declared to be peaceful with any human or animal that comes through Rabbit Hash, especially the cats. Brynn does like to chase the cats around here, but has pledged to refrain from it as much as possible.", "How much money was raised during the election?", "The mayoral race in Rabbit Hash is used to raise funds for the town's Historical Society, which then uses the money on various projects around the town. This year, the money will be used to help rebuild and restock the town's general store, which was destroyed in a fire:", "Bobbi Kayser, secretary of the Rabbit Hash Historical Society and mom of current Mayor Lucy Lou, said the election raised more than $8,900 for the historical society.", "“The money will go toward the restoration of the Rabbit Hash General Store. Although we are so blessed to have had so many corporate donations and benefits in our name, we still have not reached the original estimated goal to complete the project,” Kayser said.", "The General Store is looking nearly perfect, but that comes at a cost of nearly $400,000. The store should be open by September 2017.", "Brynneth Pawltro could not be immediately reached for comment.", "Rabbit Hash Historical Society.   \"Current Mayor - Brynn.\"\r\n    Retrieved 28 June 2017.", "Sutter, Chris.   \"For the Fourth Time, Small Kentucky Town Elects a Dog as Mayor.\"\r\n  WDRB.   23 June 2017.", "Hadley, Greg.   \"A Dog is Now the Mayor of a Small Kentucky Town. And She’s Not Even the First One.\"\r\n  Brandenton.   24 June 2017.", "Brookbank, Sarah.   \"Rabbit Hash Mayor-Elect Preaches Peace and Love.\"\r\n  Cincinnati.com   16 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]