["The photos were published in this Facebook post on January 13, 2020. The post has been shared more than 1,000 times.", "Below is a screenshot of the misleading post:", "The post caption, written in a mix of English and Tagalog, reads: “#TaalVolcano / The most amazing shots while Taal volcano was erupting last night”.", "The first photo in the misleading post was also shared in this Facebook post about the Taal volcano eruption.", "The volcano, one of the most active in the Philippines, erupted on January 12, 2020 and emitted billowing clouds of ash that were illuminated with bolts of lightning, AFP reported here on January 15, 2020.", "But one of the photos published in the Facebook post has been shared in a misleading context.", "A reverse image search on Google for the photo on the left-hand side of the post found it was taken by photographer Francisco Negroni during the 2015 eruption of Calbuco volcano in Chile.", "Negroni published the photo on his Instagram account here and on his website here in a series titled: “PostCards from Paradise...Volcanoes and Patagonia, Chile.”", "Below is a screenshot of Negroni’s photo on Instagram:", "The post’s caption, written in Spanish, reads: “Eruption of the Calbuco volcano in 2015. Photograph taken from the commune of Frutillar while a giant volcanic lightning was taking place.”", "Erupción del volcán Calbuco en el año 2015. Fotografía tomada desde la comuna de Frutillar mientras se producia una gigantezca tormenta sucia. www.francisconegroni.com www.toursytallerdefotografia.cl #puertovaras #frutillar #osornochile #chile #PuertoMontt #volcan #volcanes #volcanoes #volcancalbuco #erupcionvolcanica #tormentaderayos #apocaliptica #volcanophotographer #extremephoto #extremephotographer #extremelandscapes #dametravel #documentary #arte #topphoto #natureaddict #nature_perfection #earthhotspots #francisconegroni #wbpa #natgeotravel #natgeo #earthofficial @nikonusa @nikonmx #amazing_shots @chiletravel @frutillar @volcanes #pictas", "A post shared by  Francisco Negroni (@francisconegroni_fotografia) on Aug 15, 2019 at 12:56pm PDT", "The eruption in 2015 was Calbuco’s first major eruption in decades, according to the U.S. Geological Survey.", "Below is a screenshot comparison of the first photo in the misleading post (L) and the photo posted on Negroni’s Instagram page (R):", "The photo also placed first in “The beauty of the nature” category in the 2018 Siena International Photo Awards.", "Philippine news organisation Rappler fact-checked the same lightning storm photo here.", "A reverse image search on Google found the second photo in the misleading post published in this Facebook post on January 13, 2020 by photographer Paul Quiambao.", "The post's caption states: \"Taal Volcano eruption as of 4:02am.\n\tPhoto taken from Tagaytay area.\"", "Below is a screenshot comparison of the second photo in the misleading post (L) and the photo in Quiambao’s Facebook post (R):", "A similar photo credited to Quiambao, which appears to have been taken from the same vantage point and during the same lightning storm, was published on January 13 here by ABS-CBN, a Philippine media organisation.", "Quiambao has shared multiple other images he has taken of the volcano, including here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]