["During the first presidential debate, President Donald Trump did not condemn white supremacists when asked to. He did tell the Proud Boys — a far right hate group — to \"stand back and stand by.\"", "While Trump and his campaign maintain this statement was not an endorsement of the group, the Proud Boys appeared to see it as such. The group embraced the quote from the president, spreading it through social media groups and printing it on T-shirts.", "Trump's statement reignited conversations about other instances where he was accused of sidestepping questions or opportunities to condemn white supremacy, perhaps most notably after the violent white nationalist rally in Charlottesville, Virginia, in 2017.", "A few days after the rally, Trump was asked by reporters about the protests, to which he responded that there were \"very fine people on both sides.\"", "However, some people say they believe Trump also condemned white supremacists and neo-Nazis as part of his \"very fine people\" statement.", "Fact check:Quote attributed to Joe Biden about antifa is missing context", "One Facebook post shows a photo of Fox News anchor Chris Wallace — the first debate's moderator — paired with a supposed fact-check of what Trump really said about Charlottesville.", "The post starts with, \"Claim: Both moderator Chris Wallace and Democrat nominee Joe Biden claimed that President Trump said in response to riots in Charlottesville in 2017 that neo-Nazis were 'very fine people,'\"", "The post the states that Trump really said, \"There were very fine people on both sides, & I'm not talking about the Neo-nazis and white supremacists because they should be condemned totally.\"", "Facebook user Paul Strauss is among those who posted the viral meme. He pointed USA TODAY to a 2019 blog post from Scott Adams that describes the \"very fine people\" quote from Trump as a \"hoax\" in that the reference usually leaves off the full quote. \"In other words, the president believed there were non-racists in attendance who support keeping historical monuments,\" the blog post states. Strauss said this \"hoax\" is \"a lie that is tearing our country apart. Anything I can do to END it and make people aware that it was debunked two years ago, I will do.\"", "In August 2017, white nationalists held a \"Unite the Right\" rally in Charlottesville in response to the city's decision to remove a statue of Confederate Gen. Robert E. Lee.", "The rally escalated and ended in violence, prompting the governor to declare a state of emergency and the National Guard stepping in to help clear the area.", "After the crowd dispersed, a car ran into a group of counter demonstrators in the city's downtown area, killing 32-year-old Heather Heyer and injuring 19 others.", "Days later, Trump held a press conference to discuss a recent executive order about infrastructure permits, and reporters asked him about what happened in Charlottesville.", "'Stand back and stand by':Rhetoric some call racist has marked Trump's entire presidency", "According to a transcript from the White House, the Trump quote in question was in response to a reporter who asked, \"Mr. President, are you putting what you’re calling the alt-left and white supremacists on the same moral plane?\"", "Trump responded: \"Excuse me, excuse me. They didn’t put themselves — and you had some very bad people in that group, but you also had people that were very fine people, on both sides.\"", "After further questioning from the reporter, and responses from Trump about people who were at the Charlottesville rally to support keeping the Lee statue, the president said, \"You’re changing history. You’re changing culture. And you had people — and I’m not talking about the neo-Nazis and the white nationalists — because they should be condemned totally. But you had many people in that group other than neo-Nazis and white nationalists.\"", "When former Vice President Joe Biden announced his candidacy for president in April 2019, he cited Trump's response to Charlottesville as a core reason behind why he chose to run.", "\"With those words, the president of the United States assigned a moral equivalence between those spreading hate and those with the courage to stand against it,\" Biden said.", "At the Democratic National Convention in August, Biden said Trump's comments were a call to action, and \"at that moment, I knew I'd have to run (for president).\"", "During the first presidential debate on Sept. 29, Wallace started a line of questioning about race with a reference to Biden's motivation to run: \"Vice President Biden you say that President Trump's response to the violence in Charlottesville three years ago, when he talked about very fine people on both sides, was what directly led you to launch this run for president.\"", "Biden then repeated the phrase in his answer: \"A young woman got killed and when they asked the president what he thought he said there were very fine people on both sides.\"", "Neither said directly that Trump referred to neo-Nazis as \"very fine people.\"", "The claims in the post have been rated PARTLY FALSE. Following the 2017 white nationalist rally in Charlottesville, Trump did say that there were \"very fine people on both sides,\" when speaking about those who attended the rally in support, and those who demonstrated against it. But the meme misrepresents Trump's statements, because he did not say directly, \"There were very fine people on both sides, & I'm not talking about the Neo-nazis and white supremacists because they should be condemned totally.\" The two statements were separate, the second part coming later, after further questioning from reporters. During the first presidential debate, both Wallace and Biden referenced Trump's \"very fine people\" comment but did not say he applied it to neo-Nazis.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]