["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Florida’s lawmakers grapple with the opioid crisis, one U.S. representative says there’s a correlation between states that expanded Medicaid through Obamacare and states affected the worst by the epidemic.", "Republican U.S. Rep. Matt Gaetz shared this factoid on Twitter on Oct. 17: \"Opioid crisis the worst in ObamaCare expansion states!\"", "Gaetz’s claim quoted a Tucker Carlson tweet that questioned if \"big pharma\" is responsible for Congress’ inaction toward the opioid crisis.", "Information supplied by Gaetz’s office rests on the notion that patients in states that expanded Medicaid through Obamacare have more access to legal prescriptions that fuel the opioid epidemic. Experts said the theory ignores critical facts and does not take into account the other factors that have led to an increase in opioid deaths.", "\"It is important to avoid confusing association with causation,\" said David A. Fiellin, a professor of medicine at Yale School of Medicine. \"Just because one event (Medicaid expansion) occurred during a period of increasing opioid deaths, many from illicit sources doesn't mean that it caused the increase in deaths.\"", "Thirty-two states plus D.C. currently have adopted Medicaid benefits to all adults. The expansion for most states went into effect in January 2014. The timeframe matters because the most recent data is from 2015, meaning there’s not a lot of data to work with.", "In 2015, the five states with the highest rates of death due to drug overdose were West Virginia, New Hampshire, Kentucky, Ohio and Rhode Island, according to the Centers for Disease Control. All of those states expanded Medicaid.", "But there’s little evidence Medicaid expansion is the reason why. Many researchers, for instance, have noted that the overdose death rates were higher to begin with in those states.", "Richard Frank, a professor of Health Economics in the Department of Health Care Policy at Harvard Medical School sent PolitiFact Florida a research memo he co-wrote on the issue.", "Data he compiled from the CDC showed that the states that expanded Medicaid were experiencing higher levels of deaths due to opioids than non-expansion since 2010.", "(Chart courtesy of Richard Frank)", "\"The opioid epidemic had already hit those states hardest before the ACA even passed and well before the expansions were implemented,\" the memo said.", "Vanderbilt University economist Andrew Goodman-Bacon and Harvard’s Emma Sandoe posit that other factors, including the opioid epidemic itself, led states to adopt the ACA Medicaid expansion in their look on the issue.", "\"A state with rapidly rising opioid deaths may have decided to expand Medicaid in order to provide drug treatment to more residents,\" the pair wrote.", "Frank and his colleague also found another problem with the Medicaid theory. The memo said since 2013, nearly all the increases in opioid overdoses in the United States is due to heroin and synthetic heroin substitutes.", "In other words, it treats all drug overdoses the same. The data Gaetz cited from the CDC includes prescription and illicit drugs. Medicaid coverage does not provide access to illicit drugs.", "Data from the CDC shows that since about 2010 the number of deaths from commonly prescribed opiates has not fluctuated one way or another. In contrast, opioid deaths from heroin and other opioids, such as Fentanyl, have increased dramatically in that same time period.", "\"A significant portion of the increase in deaths was due to deaths involving synthetic opioids other than methadone, which includes Fentanyl,\" the CDC says.", "Gaetz’s team also cited CDC Morbidity and Mortality Weekly Report that said: \"opioid prescribing rates among Medicaid enrollees are at least twofold higher than rates for persons with private insurance.\"", "But the data they cited was last updated in 2009, so Gaetz’s evidence was before the Affordable Care Act was even passed. This argument is common among individuals who believe Medicaid makes drug abuse worse, but it’s not accurate, according to the Goodman-Bacon and Sandone analysis.", "\"Medicaid patients, especially those who qualify through a disability and many who do not, are more likely to have chronic conditions and comorbidities that require pain relief,\" the duo wrote.", "Lastly, it’s worth noting that Medicaid expansion helps pay for opioid addiction treatment, said Brendan Saloner of Johns Hopkins Bloomberg School of Public Health. Medicaid expansion covers costs treatments like detoxification, outpatient treatment, and treatment for masked health conditions.", "Gaetz said the \"opioid crisis (is) the worst in ObamaCare expansion states.\"", "Gaetz is isolating on one year’s worth of data that, by itself, is flawed. The CDC data at the heart of this claim includes drug overdoses from illicit drugs that are not prescription opioids. And by ignoring a larger window, Gaetz misses the fact that the Medicaid expansion states he’s talking about had an opioid problem before the health care legislation took effect.", "Experts were universal in saying that the evidence that Medicaid expansion is somehow fueling the opioid crisis doesn’t exist. In some ways, it’s not much different than saying that the opioid crisis is worst in states in the eastern time zone. You wouldn’t blame a clock.", "We rate this claim Mostly False.", "Interview, Brendan Saloner, associate professor at Johns Hopkins Bloomberg School of Public Health, Oct. 23, 2017", "Email interview with Richard Frank, a professor of Health Economics in the Department of Health Care Policy at Harvard Medical School, Oct. 23, 2017", "Email interview, David A. Fiellin, professor of medicine at Yale School of Medicine, Oct. 23, 2017", "Email interview with Sherry Glied, the dean of New York University’s graduate school of public service, Oct. 23, 2017", "Email exchanges, Kip Talley, Matt Gaetz chief of staff, Oct. 18 and 20", "Health Affairs Blog, Did Medicaid Expansion Cause The Opioid Epidemic? There’s Little Evidence That It Did. Aug. 23, 2017", "Associated Press, Has Medicaid’s expansion fueled the opioid epidemic? New GOP theory is challenged, Aug. 31, 2017", "Urban Institute, Rapid Growth in Medicaid Spending on Medications to Treat Opioid Use Disorder and Overdose, June 2017", "PolitiFact, Are a third of people with drug problems on Medicaid, as Elizabeth Warren said? July 18, 2017", "PolitiFact, What HHS Secretary Tom Price said about opioid addiction treatment, May 26, 2017", "Centers for Disease Control, Drug Overdose Death Data", "Centers for Disease Control, Opioid Data Analysis", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]