["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The political divide in Georgia these days often stretches as far and wide as rush-hour traffic on I-285 -- even to seemingly simple issues such as which forms of identification people can use to vote.\n\nSome say Georgia’s stricter policies on voter ID are a way to keep the poor and racial minorities from voting. Those in charge of enforcing the law counter that it helps prevent voter fraud.\n\n\"I can attest that every year we investigate and penalize hundreds of people guilty of election and voter fraud,\" Georgia Secretary of State Brian Kemp wrote The Washington Post in June.\n\nHe’s made similar statements in the The Atlanta Journal-Constitution. Some PolitiFact Georgia readers have asked us to fact-check such statements.\n\nIn June, PolitiFact Georgia checked out a claim by Kemp that the elections board had handed out about $275,000 in fines for violations of Georgia’s absentee ballot law. The number of cases since 2007, by our count, was 59.\n\nCould the state really have investigated and handed out fines in so many more cases each year?\n\nMatt Carrothers, a spokesman for the Georgia Secretary of State’s Office, sent us numbers outlining how many cases the State Elections Board reviewed in 2009, 2010 and 2011, along with the number of investigations Kemp’s office has opened.\n\nThe annual totals:\n\n-- 208 in 2009\n-- 234 in 2010\n-- 205 in 2011\n\nSome of the investigations consist of multiple people, so the actual number of people investigated could be higher, Carrothers said.\n\n\"The numbers that we based that original statement on are not only factual, but the base line,\" he said. \"The real numbers are higher.\"\n\nA detailed breakdown of each investigation wasn’t available, but the cases reviewed by the State Elections Board are on its website. The board reviewed 102 cases this year, as Carrothers said. The 2010 total we calculated of people who had cases before the board was about the same as what Carrothers told us. Some 2009 board public orders were not on the state’s website.\n\nFrom the information we’ve seen and what Kemp’s office shared with us, it appears Kemp’s office has investigated and penalized at least 200 people each of the past three years. That does qualify as \"hundreds\" as Kemp says.\n\nOur rating: True.", "Washington Post, \"How voter ID laws keep elections honest,\" June 24, 2011", "Atlanta Journal-Constitution op-ed by Georgia Secretary of State Brian Kemp, Dec. 1, 2011", "Email from Matt Carrothers, spokesman, Georgia Secretary of State’s Office, Dec. 8, 2011", "Georgia State Elections Board public orders database", "PolitiFact Georgia, \"Kemp claim on fines on the money,\" July 19, 2011", "Telephone interviews with Georgia Secretary of State communications director Matt Carrothers", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]