["About this rating", "In May 2020, in light of the dangers posed by the COVID-19 pandemic, California Gov. Gavin Newsom issued an executive order to provide mail-in ballots to all registered voters in the state. This executive order was challenged in court by Republicans. However, in June 2020, the state Legislature passed a similar law with GOP support.", "California's mail-in ballots were not \"unlawful,\" nor is there any indication that they will be considered \"void.\"", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Throughout 2020, U.S. President Donald Trump has demonized mail-in ballots as a \"scam,\" but at the same time promoted the idea of voting by mail as registration deadlines neared. Trump also called mail-in voting the \"biggest risk\" to his reelection efforts.", "In late May 2020, the president's efforts to cast doubt on mail-in ballots focused on California, a state that had delivered its Electoral College votes to Democratic presidential candidates every four years since 1992:", "Trump's tweets from May 26 followed a May 8 executive order from California Gov. Gavin Newsom that said all registered voters were to receive a mail-in ballot. At the time, the country was many weeks into the surging COVID-19 pandemic. The Associated Press reported that Republicans criticized the executive order:", "Setting up a potential legal showdown over California’s presidential election, Gov. Gavin Newsom on Friday announced the state will send every voter a mail-in ballot for the November contest, a move criticized by national Republicans as a pathway to possible large-scale abuse.", "With the state still under stay-at-home orders and facing a future of unknowns from the coronavirus outbreak, the Democratic governor said sending postage-paid ballots to every registered voter was the best solution to addressing the anxiety felt by many people about gathering in large groups that are breeding grounds for the virus.", "The story also noted that the state hoped to avoid issues faced by Wisconsin primary voters, \"where thousands of voters without protective gear were forced to wait for hours in long lines, while thousands more stayed home to avoid the potential health risks.\"", "Following the 2020 U.S. presidential election, in which The Associated Press projected Democrat Joe Biden was victorious, a viral tweet was shared that claimed California's mail-in ballots were \"unlawful.\" The same tweet also mentioned the state of Georgia, and used the word \"void\" in reference to \"unlawful mail ballots\":", "The tweet included a link to a news story from Just The News, with the headline: \"Judge rules California Gov. Newsom violated Constitution with election order\":", "\"Executive Order N-67-20 issued by the Governor on June 3, 2020 is void as an unconstitutional exercise of legislative power and shall be of no further force or effect,\" the ruling states. \"The California Emergency Services Act (CA Government Code §8550 et seq.) does not authorize or empower the Governor of the State of California to amend statutory law or make new statutory law, which is exclusively a legislative function not delegated to the Governor under the CESA.\"", "The executive order from Newsom included a section calling for registered California voters to receive vote-by-mail ballots. Newsom reportedly issued the order prior to the state legislature approving a similar law.", "\"As provided by Executive Order N-64-20, all Californians who are registered (and otherwise eligible) to vote in the November 3, 2020 General Election shall receive vote-by-mail ballots,\" part of Newsom's order said.", "Twitter users shared the story, with some appearing to believe that the judge's ruling would change the outcome of the 2020 election. \"Things are happening,\" one person tweeted. Another tweet linking to the story read: \"Invalidate CA mail in vote.\" A third tweet said: \"Our National election was made void and illegal by our elected official.\"", "It is true that Sutter County Judge Sarah Heckman issued a ruling on Nov. 14, which followed a similar ruling from another Sutter County judge in June. On Nov. 14, KCRA-TV reported that the judge said Newsom overstepped his executive authority by issuing mail-in ballots to all registered voters:", "In the ruling Friday, Judge Sarah Heckman said Newsom does not have the authority to amend or change existing law — even during a public emergency. The ruling also put a permanent injunction on Newsom, prohibiting him from changing existing law under CESA.", "\"Executive Order N-67-20 issued by the Governor on June 3, 2020 is void as an unconstitutional exercise of legislative power and shall be of no further force or effect,\" the ruling said. \"The California Emergency Services Act (CA Government Code §8550 et seq.) does not authorize or empower the Governor of the State of California to amend statutory law or make new statutory law, which is exclusively a legislative function not delegated to the Governor under the CESA.\"", "The ruling was in reference to a lawsuit that brought because of Newsom's executive order, but \"before the legislature passed a similar law.\" On June 18, Politico reported: \"California enacts November mail-ballot law — with surprising GOP support\":", "Gov. Gavin Newsom on Thursday bolstered his plan to mail every voter a ballot for the November election by signing legislation that passed earlier the same day with support from several Republicans, belying monthslong criticism of absentee voting from President Donald Trump and other GOP leaders.", "Newsom had already ordered county elections officials to send all eligible Californians ballots in an effort to prevent the general election from becoming a coronavirus health hazard. But that directive has drawn multiple legal challenges — including from the California Republican Party — so enshrining the all-mail mandate in statute puts it on stronger legal footing.", "In sum, a California judge ruled that Newsom overstepped his bounds by signing an executive order to issue mail-in ballots to all registered voters. However, the state Legislature passed a similarly worded measure weeks later, with GOP support. The issuing of mail-in ballots in the state of California was not \"unlawful,\" nor is there any indication that the 2020 ballots will be considered \"void\" in the future.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]