["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Ron Johnson, R-Wis., attributes the cause of recent growth to GOP policies, but there are many other factors at work.", "Republicans love praising the Trump economy.", "With one of the lowest unemployment rates in years and steady job growth, there’s a lot to boast about.", "But just how well does the Trump administration’s overall economic performance compare to his predecessor Barack Obama? And how has the business climate fared under the two presidents?", "Here’s what U.S. Sen. Ron Johnson, R-Wisconsin, claimed in a July 15, 2019 tweet:", "\"Republican policies have led to business investment growth that’s 10 times faster than what we saw under President Obama.\"", "The numbers don’t lie, he says. But how exactly is he measuring them?", "Although the tweet is a bit old, the issue will be an important one in the coming election, so we decided to take a look.", "The data", "To come to his conclusion, Johnson’s staff told us he used data from the Bureau of Economic Analysis -- an agency within the U.S. Department of Commerce that measures economic growth.", "Johnson pointed to statistics measuring \"private fixed investment, nonresidential\" which show how much businesses invest in structures, equipment and intellectual property, such as software and research and development.", "Johnson broadly said growth has been 10 times faster under Trump than Obama in his tweet. Those who read it would, presumably think it took in Obama’s entire eight year tenure.", "But in the data Johnson used, he only compared the final two years of the Obama administration, 2015 and 2016, to a little over the first two years of data for the Trump administration. That approach often signals cherry-picking.", "Let’s dig deeper.", "\"We use the final two years of the Obama administration for comparison because it constitutes a comparable length of time with the two years of data for the Trump administration,\" said Ben Voelkel, a spokesman for Johnson. \"It is a time adjacent to, rather than remote from, the Trump years.\"", "According to Johnson’s data points, Obama had an average of 0.6% growth in that period, compared to 6.4% under Trump.", "The Bureau of Economic Analysis updated the data shortly after Johnson made the statement. In doing so, figures for some of the quarters were slightly adjusted, but the overall trend was largely the same.", "The new numbers showed between 2015 and 2016, the Obama administration had an average business investment growth of 0.7%. Meanwhile, between 2017 and 2018 (and the first quarter of 2019), the Trump administration had a growth of about 5.5%.", "That’s not far off from the original numbers, though quite not as strong.", "The full picture", "Of course, Obama’s term did not start in 2015.", "Under the full eight years of the Obama administration, the rate of business investment growth was about 3.7%. When bringing Trump’s term to the overall latest numbers, overall growth has been about 4.9%.", "So, looking at all of Obama’s tenure, the numbers are much more comparable.", "What about the beginning of Obama’s term. How does it compare to the beginning of Trump’s term?", "In Obama’s first two years plus an additional quarter -- the period cited by Johnson -- the business investment rate actually declined by 0.3%. This was the period immediately after the Great Recession.", "That underscores the volatility of the numbers -- and how the timeframe you pick can make a major difference.", "Other measures, other factors", "There are other ways to examine business growth -- and another part of the claim to consider: Johnson asserts the growth was caused by GOP policies.", "Tara Sinclair, an economics professor at George Washington University, said average growth rates for business investment look stronger in recent years, but when measured as a share of Gross Domestic Product the picture is very similar under both administrations.", "Why? The nation’s GDP -- a conventional measure of the size of the economy -- has also grown over time.", "\"The share of GDP going to ‘private fixed investment, nonresidential’ is below the peaks seen in the 1980s and 2000s,\" Sinclair said in an email to PolitiFact Wisconsin.", "Sinclair said GOP policies that cut regulations may have helped lead to stronger business investment under the Trump administration, but it’s hard to blame or credit a presidential administration for most economic outcomes.", "Indeed, as we have noted time and again in fact checks, experts say it is wrong to attribute too much to individuals or particular policy changes. There are simply too many factors in the economy to boil it down to one.", "\"As you can see from the data, the quarterly growth rates are quite volatile, so more data to identify a clear trend will be helpful,\" Sinclair told us.", "Our rating", "Johnson said \"Republican policies have led to business investment growth that’s 10 times faster than what we saw under President Obama.\"", "That language may leave the reader thinking the comparison is to Obama’s full term. Johnson, though, said he was only comparing the first two years of Trump to the last two years of Obama. By that measure, there’s an element of truth here.", "But that element is undermined by the broader picture: When you look at all of Obama’s tenure and other measures, such as share of GDP, the picture is much closer to even between the two.", "In addition, Johnson over-attributes the cause of recent growth to GOP policies, when there are many other factors at work.", "Our definition for Mostly False is \"The statement contains an element of truth but ignores critical facts that would give a different impression.\" That fits here.", "Ron Johnson, tweet, July 15, 2019", "Ron Johnson, press release, July 15, 2019", "E-mail exchange with Ben Voelkel, communications director for Ron Johnson, Sept. 24, 2019", "Bureau of Economic Analysis, National Data trends", "FRED, Shares of gross domestic product: Gross private domestic investment: Fixed investment: Nonresidential, data", "Meet the Press, Ron Johnson interview, July 14, 2019", "E-mail exchange with Tara Sinclair, economics professor at George Washington University, Sept. 30, 2019", "The Hill, Trump’s economic advantage within the Democratic base, Sept. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]