["The collage was published in this Facebook post on August 16, 2020. It has been shared more than 3,000 times.", "Part of the post’s Tagalog-language caption translates to English as: \"HOUSING PROJECTS OF THE PAST ADMINISTRATION AND THE DUTERTE ADMINISTRATION\".", "The first photo, which shows a makeshift structure, is overlaid with Tagalog text that states: \"DURING TIME OF DECENT PEOPLE / Yolanda housing\".", "Yolanda is the local name for Typhoon Haiyan that struck the Philippines in November 2013, during the presidency of Aquino III, killing more than 6,200 people and leaving millions homeless.", "Text superimposed on the second photo, which shows a row of painted houses on a street, reads: “DURING THE TIME OF THE IRON-FISTED / Housing for heroic soldiers\".", "Rodrigo Duterte was elected president of the Philippines in May 2016, replacing Benigno S. Aquino III.", "The same photo collage was also shared here, here and here on Facebook alongside a similar claim.", "The claim, however, is misleading.", "A combined reverse image and keyword search found the second photo in the photo collage, that purports to show a government housing project under Duterte's administration, published here on the website for Johndorf Ventures, a private housing development company.", "The image is described as showing “a townhouse community that promotes an active and fun lifestyle with basketball court, clubhouse, jogging trails, pocket parks and playgrounds for homeowners to enjoy”, located in Lapu-Lapu, a city in central Philippines.", "A Johndorf Ventures representative told AFP by Facebook Messenger on August 20, 2020 the photo is an illustration of a housing project that the company is currently developing.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo on the Johndorf Ventures website (R):", "The first photo in the image in the misleading post was published in this November 5, 2015 article by Philippine television network GMA. It reports on housing for people displaced as a result of Typhoon Haiyan during Aquino's presidency.", "The claim was also debunked by Philippne news organisation Vera Files here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]