["West Bengal Congress’s official Twitter handle posted a photograph of a collapsed bridge with the claim that Prime Minister Narendra Modi had inaugurated this bridge just three months ago. “Planned by then CM Modi, inaugurated by PM Modi, Jamnagar-Junagarh highway bridge collapsed within 3 months of inauguration!”, reads the tweet posted on June 20, 2018. The tweet garnered more than 300 retweets and over 1000 likes so far. An identical post was also shared by the Facebook page of West Bengal Congress. The archived version of the tweet can be accessed here.", "Vaidehi Sachin, an individual Twitter user who claims to be the editor-in-chief of a tabloid newspaper Afternoon Voice had earlier posted photographs of the bridge with the identical claim.", "Jamnagar-Junagarh highway bridge collapsed within 3 months of inauguration!! Planned by CM Modi, inaugurated by PM Modi. Now who is accountable for this? pic.twitter.com/H2BDKKzw8Q", "— QueenBee (@vaidehisachin) June 20, 2019", "Alt News found that a bridge located on the Jamnagar-Junagadh highway near Satudad village of Jam Kandorna tehsil of Rajkot district, Gujarat had collapsed on June 19. One of the images shared on social media was published in Gujarati news article titled, “A bridge on Jamnagar-Junagadh highway collapses, see pics (translated)”.", "In conversation with Alt News, Jitendra Singh Jadeja, the sarpanch of Satudad village, said that the bridge was more than 50 years old and was not inaugurated by PM Modi. Moreover, Digubha Jadeja, a resident of Satudad village and a member of the Jam Kandorna Taluka Panchayat, said, “I am 46-year-old right now. I don’t remember the time when the bridge was built that means it’s older than me.”", "Alt News contacted GV Joshi, the executive engineer at Road and Buildings department in Rajkot to confirm the approximate time of construction. He said, “No it’s not all true. The bridge was built at least 45 years ago. It is also not true that the bridge was inaugurated by PM Modi.”", "By speaking with locals in Satudad village, Alt News was able to trace the location of the bridge on Google Maps. Looking at the historical satellite imagery, we could independently verify that the bridge existed at least since 2009. Thus, the claim that the bridge was inaugurated by Prime Minister Narendra Modi three months ago is false. In the image below, an intact bridge indicated by the pin can be seen in the 2009 imagery.", "West Bengal Congress tweeted images of a collapsed bridge in Gujarat falsely claiming that it was inaugurated by PM Modi three months ago.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]