["About this rating", "Stanley Kubrick, who directed such iconic films as Dr. Strangelove, 2001: A Space Odyssey, and A Clockwork Orange, was also a notorious control freak whom Randy Kennedy of the New York Times described as \"titanically exacting\" and was highly protective of his work. When Kubrick died in 1999, he left behind a vast trove of production materials: notes, sketches, letters and other detritus, some of which has since found its way online.", "In 2014, an image said to be a scan of an Aug. 27, 1970, typewritten letter from Kubrick to MGM president James T. Aubrey surfaced on the Internet and instantly went viral, for reasons that will be obvious on a single reading:", "August 27, 1970", "James T. Aubrey, Jr.\nMetro Goldwyn Mayer\n245 N Beverly Drive\nBeverly Hills, CA 90210", "Dear James,", "It has come to my attention that you and your studio are considering producing a sequel to \"2001: A Space Odyssey\" over my objections. My attorney informs me that you hold the option and, legally, there is little I can do to stop you.", "However, I'd like you to know that I own the tapir bone prop from 2001 - the one \"Moonwatcher\" throws into the sky. If you attempt to make a sequel, I will cram that femur up your so ass so far, it will take an undiscovered alien super-intelligence to figure out how to dislodge it. Seriously, don't fuck with me.", "Best regards,", "Stanley", "MGM Studios\nBoreham Wood\nHerts", "As popular as the letter became on social media, readers familiar with Kubrick's life and oeuvre were skeptical of its authenticity. For one thing, Kubrick wasn't known to have taken such a vehement stand against any 2001 follow-up. In fact, when the actual sequel, 2010, went into production in the early 1980s, Kubrick gave the project and its director, Peter Hyams, his blessing. For another thing, the aggression and profanity that make the missive so funny are lacking in other specimens of his correspondence.", "The doubters were proved correct when the facsimile was traced back to its source, a satire website called Gloss News. It appeared in an article published on 31 May 2014 and titled \"Corman Creates Catastrophe, Kubrick Cringes.\" The premise of the article was that MGM was so determined to make a sequel to 2001 over Stanley Kubrick's objections that studio executives went to extraordinary lengths to make it happen:", "Kubrick was dead-set against any sequel. He would not produce one himself, and he threatened legal action should MGM try to make one with a different director.", "Kubrick's threats were essentially empty because MGM owned the rights, but studio executives found that, in a show of solidarity, no reputable director would touch the project.", "Finally, in desperation, they contacted low-budget film impresario Roger Corman, who agreed to direct the sequel so long as he was given absolute creative control. Fearing that momentum built up by the original film's success would stall if they waited too long, the studio agreed to Corman's demands and hired him to direct the film.", "Corman chose to write the film himself and, three days after signing the deal, presented the finished screenplay to MGM executives. The executives were unsure what to make of the script, which Corman had titled 2002: Another Space Odyssey. In Corman's story, David Bowman returns to earth from the mysterious alien world that he inhabited at the end of the first film.", "In an attempt to reintegrate into society, he opens a car repair shop in Alabama with his pal Skeeter.", "Are we alone in wishing this film had actually been made?", "Ryan, Steve.   \"Corman Creates Catastrophe, Kubrick Cringes.\"    GlossyNews.com.   31 May 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]