["By Lori Robertson", "Posted on May 10, 2018 | Updated on May 11, 2018", "The White House has proposed rescinding $7 billion in unspent funds from a children’s health program, a move Sen. Chuck Schumer said would be “taking money away from kids who need health care.” But congressional budget experts say most of that money cannot be legally spent and the number of individuals covered would not be affected.", "The main point of contention is the Trump administration’s proposal to take $2 billion from a contingency fund used if states face a shortfall and higher-than-expected enrollment in the Children’s Health Insurance Program. CHIP, which is jointly funded by the federal government and the states, is for children and pregnant women in families with low incomes, but not low enough to qualify for Medicaid.", "Since fiscal 2009, when the Child Enrollment Contingency Fund was established, three states — Iowa, Michigan and Tennessee — have received payments from it, according to a 2018 report from the Congressional Research Service. The three states spent a total of $108.6 million in contingency funding.", "“States have not had to access the contingency funds that much over time,” Robin Rudowitz, associate director for the Kaiser Family Foundation’s Program on Medicaid and the Uninsured, told us. But, then again, “we don’t know what exactly might happen.” The fund was set up as a safeguard, she said.", "Several Democrats have criticized the White House proposal, and even Republican Sen. Susan Collins questioned why there would be a “cut” to CHIP. Schumer, the Senate minority leader, said in a statement that “millions of children rely on” this money “during outbreaks of the flu and other deadly illnesses.”", "Schumer, May 7: It appears that sabotaging our health care system to the detriment of middle-class families wasn’t enough for President Trump and Republicans; now they’re going after health care dollars that millions of children rely on, especially during outbreaks of the flu and other deadly illnesses. Let’s be honest about what this is: President Trump and Republicans in Congress are looking to tear apart the bipartisan Children’s Health Insurance Program (CHIP), hurting middle-class families and low-income children, to appease the most conservative special interests and feel better about blowing up the deficit to give the wealthiest few and biggest corporations huge tax breaks.", "It’s possible an outbreak of disease could cause states to need more money for CHIP, though they’d have to have higher enrollment and a shortfall in funds to qualify for a payment from the contingency fund. States “have to meet both of those conditions,” Rudowitz said.", "At a May 8 press conference, Schumer characterized the Trump proposal as “taking money away from kids who need health care.”", "Rescissions of unspent CHIP funds have occurred before, including from the contingency fund, as recently as this year, when Congress passed an omnibus spending bill.", "All told, the administration has proposed $15 billion for rescission — or pulling back of funding that had been authorized but not yet spent. Most of the funding isn’t expected to be used, in fact. The Committee for a Responsible Federal Budget wrote in a blog post that “most of these rescissions,” including the ones to CHIP, “would cut budget authority for money that will not otherwise be spent, resulting in no direct effect on the deficit.”", "CRFB points out that the White House’s Office of Management and Budget estimates that the $15 billion package would only reduce federal outlays (or spending), and therefore the deficit, by $3 billion. The plan requires congressional approval.", "Overall, since fiscal 2009, federal appropriations for CHIP have been more than enough to cover CHIP spending. Rudowitz explained that the program operates like a “block grant,” so the yearly appropriations don’t always equal the outlays.", "Through several appropriation bills, Congress has rescinded $42.8 billion from CHIP from fiscal 2011 to fiscal 2017, the Congressional Research Service report said. Most of the rescissions from CHIP came from a performance bonus payment fund for states that increased Medicaid enrollment of children. And $11.1 billion came from “unobligated national allotments,” or federal funds not allocated to states. The CRS report said that $1.7 billion was rescinded from the Child Enrollment Contingency Fund in fiscal 2016 — marking the first time rescissions were made to the emergency fund.", "The largest part of the Trump administration’s rescission request from CHIP is $5.1 billion from funds for fiscal 2017 “that can no longer be spent,” CRFB said. The nonpartisan Congressional Budget Office explained in a May 8 letter that those funds can no longer be distributed to states, because the authority to do so expired in 2017.", "So, the main issue — and the focus of Schumer’s criticism — is the $1.9 billion from the Child Enrollment Contingency Fund. CBO wrote that “based on information from the Centers for Medicare and Medicaid Services, CBO projects that the rescission from the Child Enrollment Contingency Fund would not affect payments to states over the 2018-2028 period.”", "It said that rescinding the $7 billion in CHIP money “would not affect outlays, or the number of individuals with insurance coverage.”", "The budget watchdog group CRFB said the contingency money “likely will not be used.” As we said, since the contingency fund was established in 2009, three states have received payments from it when they faced both a shortfall and higher-than-expected enrollment of children, according to CRS. (Total federal appropriations for CHIP were still more than enough to cover all states’ spending as a whole.)", "Michigan got a $52.6 million payment from the fund in fiscal 2015, according to a 2016 fact sheet from the Medicaid and CHIP Payment and Access Commission. Michigan Department of Health and Human Services spokesperson Angela Minicuci told us that the state had higher-than-expected enrollment, and a subsequent funding shortfall, due to federal poverty level changes in the Affordable Care Act.", "Tennessee received $226.7 million in September 2016 but only spent $27.1 million a few months later. It needed the money for “retroactive CHIP expenditures as a result of changes to the CHIP eligibility standards dating back to January 1, 2014,” according to Sarah Tanksley, director of communications, Division of TennCare. She said the state can no longer access the remainder of the unspent contingency payment.", "Iowa received $28.9 million in fiscal 2011, according to another MACPAC report. Matt Highland, public information officer at the state’s Department of Human Services, told us the money covered shortfalls in fiscal 2011 and 2012.", "CRFB noted that a rescission from the contingency fund was made in the bipartisan omnibus spending bill passed in March.", "The omnibus rescinded nearly $2 billion from the fund. It passed the Senate by a 65-32 vote, with many Democrats voting yes. “In other words, most who are attacking this policy now for ‘cutting’ CHIP supported nearly the same policy just a few months ago,” Patrick Newton, press secretary at CRFB, told us in an email.", "Schumer was asked in a May 8 press conference why he supported the omnibus but objects to a similar rescission now. He said the difference was that the omnibus money was used for “good things.” But now Trump is “not putting the money into good things; he’s just cutting.” Schumer went on to say: “They’re just taking money away from kids who need health care.”", "We asked his office how the senator could say the rescission was “taking money away from kids” when the money hadn’t been allocated and isn’t expected to be spent at all. Schumer’s office responded in an email: “It has been used in the past though. It’s there in case of emergency.”", "His office maintains the contingency money might be needed and should be preserved. “We shouldn’t be gambling with those programs and children’s health care in order to pay down a fraction of a percent of the deficit that Republicans created with their massive tax breaks to the wealthy,” Schumer’s office said.", "One additional issue is that the new request comes on top of that omnibus rescission, leaving about $500 million in the contingency fund for fiscal 2018, which ends in less than five months on Sept. 30.", "Schumer’s office referred us to comments by Joan Alker, executive director of Georgetown University’s Center for Children and Families, who told the Washington Post that this “sets a very dangerous precedent” for CHIP. Alker wrote on the center’s website that “rescinding $2 billion from the fund undermines the very assurance it was created to provide.”", "The contingency fund should get a fresh influx of money in fiscal 2019, which starts Oct. 1, if current practices are followed. Edwin Park, a research professor at Georgetown’s Center for Children and Families, told us that up to 20 percent of the national allotment for CHIP is allocated to the fund each budget year. That would mean up to about $4.5 billion should go into the contingency fund next fiscal year.", "Federal funding for the states for CHIP will total $22.6 billion for 2019. States recently faced a gap in federal CHIP funding of several months while Congress debated extending the program. In measures passed in late January and early February, Congress extended CHIP funding through fiscal 2027.", "Update, May 11: We updated this story to include information on contingency fund payments to Tennessee and Iowa.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]