["About this rating", "On March 14, 2021, the era's most popular music artists gathered in downtown Los Angeles for a socially distanced 63rd annual Grammy Awards. Among them was Beyoncé who left the award ceremony with four new honors, including best R&B performance for \"Black Parade\" and best music video for \"Brown Skin Girl.\"", "Following the show, which was broadcast live on CBS, social media posts claimed Bey surpassed the previously held record for most Grammy awards by a female artist.", "The assertion was true.", "Going into the 2021 show, Beyoncé tallied 24 Grammy wins, according to the show's records. She first won with Destiny's Child for their hit track \"Say My Name\" in 2000.", "With the additional four awards on March 14 (the above-mentioned wins plus the awards for best rap song and best rap performance for collaboration with Megan Thee Stallion on \"Savage\"), Queen B's total surpassed that of American singer-songwriter Allison Krauss, who secured her 27th win in 2017 and held the title of most decorated female artist since that time.", "With the new accolades, Beyoncé tied producer Quincy Jones for second place among all winners, no matter their gender, the records showed. Only the late conductor Georg Solti has more Grammy's (31 total).", "See Beyoncé accept her record-breaking Grammy here:", "\"As an artist, I believe it's my job to reflect the times, and it's been such a difficult time,\" she said. \"So I wanted to uplift, encourage, celebrate all of the beautiful black queens and kings that continue to inspire me and inspire the world.\"", "Furthermore, Beyoncé's family members also made history at the 2021 award show. Her husband, Jay-Z , won a Grammy for his work on \"Savage\" -- tying Kanye West for most wins among hip-hop artists -- and the couple's 9-year-old daughter, Blue Ivy Carter, became the second youngest act to receive the honor.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]