["The reports claim that staff at the Indonesian zoo had been mystified when an orangutan named Marilyn fell pregnant, since she had not been in contact with any other orangutans. Supposedly, hidden cameras revealed that a zookeeper had impregnated her.", "However, the first version of the story we can find, published in December 2015 and archived here, was on a website named World News Daily Report. The tagline of the website is “where facts don’t matter”, and in a disclaimer it says that all characters appearing in its stories are “entirely fictional”. The website is the source of numerous bizarre stories which have been subsequently been picked up by other websites that treat the stories as true rather than as fictional or satirical. We’ve previously debunked a couple of them here and here.", "The World Daily News Report’s zookeeper story has been shared more than 21,000 times on Facebook, according to social media analysis tool Crowdtangle.", "The story reemerged on various African websites in July 2019, reproducing many of the same details including the names of the officials cited in the World News Daily Report version and, in many cases, the same composite photo of a man and an orangutan. We’ve archived some of the newer posts, from Nigeria, Malawi, Zimbabwe and Ghana.", "However, officials at the Indonesian zoo dismissed the story as a hoax back in 2015 when it first emerged. As detailed in this article in Indonesia’s Jakarta Post newspaper, the zoo did not have an orangutan named Marilyn at the time, and nor did it have a director named Abdoel Hakim, who was quoted in the World News Daily Report story. There’s also no trace of an Indonesian news outlet named the Kalimantan Press, which was cited in the original hoax as the source of the story.", "The AFP Fact-Check team in Indonesia contacted the zoo again this week. Zoo officials declined to comment on the fresh reports spreading the hoax, but they directed us to this article where they debunked the story back in December 2015. In it, zoo chief Aschta Boestani confirmed the story was “not true” and added that the zoo had never had employees named Akhiroel Yahya or Abdul Hakim, both quoted in the false story.", "As for the photos used in the false posts, a Google reverse image search showed that the picture of the orangutan was taken at the Taman Safari Park in the West Java area of Indonesia -- more than 800 kilometres from Surabaya, to the east of the island. The image was used in this Daily Mail story from January 2011.", "We ran similar image searches for the picture of the man used in the false posts, but we have not yet been able to identify him. The World News Daily Report often takes photos from online image banks, news reports about court cases and police mugshot archives, meaning people’s images become associated with completely invented stories. We debunked one such story here.", "The idea of whether it would be possible for humans to produce offspring with other species has long interested scientists, not least as studies of DNA show evidence of interbreeding with Neanderthals, modern humans’ closest relatives who became extinct around 40,000 years ago.", "Scientists have similarly investigated the theory that early humans may have mated with chimpanzees, but the evidence is inconclusive. As this article notes, Soviet scientists attempted to create a human-chimpanzee hybrid in the 1920s, without success. We have found no documented case of a human impregnating an orangutan.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]