["The claim was shared in this Facebook post on February 14, 2020.", "The post includes a screenshot of another Facebook post, which makes the claim about a doctor’s office in Aberglasslyn, a small town about 170 kilometers (105 miles) north of Sydney.", "The text reads: “Just want to let everyone know that today I had a appointment at Aberglasslyn Doctors for my 3 month old son and was told 3 Asians had been in previously that had been exposed to Coronavirus (unaware If they have it) and I was asked to wait outside, I cancelled our appointment and left. Assuming they are local so perhaps keeping small children away from public places for a while may be best.\"", "Below is a screenshot of the misleading post:", "Other posts which feature the screenshot appeared on Facebook here, here, here, here, here, here, here, here, here and here.", "The claim is misleading.", "As of February 19, 2020, the Australian Department of Health had confirmed 15 cases of coronavirus nationwide. Of those, four were in New South Wales (NSW).", "The four patients, all of whom were confined to the Sydney metropolitan area, have recovered and been discharged from hospital, NSW Health, the state’s health department, announced on February 13, 2020.", "“NSW Health is aware of this Facebook post,” an agency spokesperson confirmed via email on February 17, 2020.", "“There remain four confirmed cases of COVID-19 in NSW. All patients have been discharged from hospital and none was in a regional area.”", "In a media release on January 25, 2020, NSW Health also made no indication that the first three coronavirus patients had travelled to the state’s regional areas.", "All three patients, the statement states, had travelled from China to Sydney in January 2020 and were all isolated in hospital by the end of the month.", "The fourth confirmed case was a University of New South Wales Sydney student who was diagnosed on January 27, 2020.", "“The student did not attend any classes at the University and stayed on her own in campus accommodation with no close contact before she was admitted to hospital,” the university’s statement reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]