["By Saranac Hale Spencer", "Posted on April 1, 2020", "April Fool’s Day brought a spate of false posts claiming students will have to repeat the school year. While many schools across the U.S. closed due to the coronavirus pandemic, there’s no indication they’ll call for repeating the school year.", "The combined forces of the COVID-19 pandemic and the internet have made this April Fool’s Day a treacherous one. Jokes that may have once been good for a laugh among friends now have the potential to mislead social media users at a time when dangerous misinformation on health and public policy is proliferating.", "One prank-generating website has been used to make dozens of false headlines, including many versions of a claim that students will have to repeat the school year:", "All of these posts, which were shared on Facebook, link back to the prank-generating website that shows this message: “April Fools!” But if users don’t click through, all they see is what looks like a regular news headline paired with a picture of a public official. In the case of the headlines above, most featured a picture of the governor of the state that was named.", "While many schools have closed in an effort to stop the spread of the novel coronavirus that causes COVID-19, we haven’t found any indication that students will have to repeat a grade. All of the states mentioned above — Virginia, California, Tennessee, Pennsylvania, New Jersey, and Illinois — have closed schools. Some have suspended testing requirements. But none have recommended repeating the school year.", "The same prank site has created a spate of other bogus headlines, including some that fuel rumors we’ve already debunked.", "So, be wary of alarming headlines shared on social media. Like the fake posts about the school year, they may not be true.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Prank Mania. About Prank Mania. Accessed 1 Apr 2020.", "“Governor Northam Orders Statewide Closure of Certain Non-Essential Businesses, K-12 Schools.” governor.virginia.gov. 23 Mar 2020.", "California Department of Education. “State Superintendent Tony Thurmond Issues Statement on 2019-20 School Year Amid Current School Safety Concerns.” 31 Mar 2020.", "Tennessee Office of the Governor. “Governor Lee Issues Statement Regarding Statewide School Closure.”  16 Mar 2020.", "Pennsylvania Department of Education. School Guidance — Answers to Common Questions. Accessed 1 Apr 2020.", "Murphy, Phil (@GovMurphy). “To slow the spread of #COVID19, I’m ordering: •Closure of ALL pre-K, K-12 schools, higher ed insts. beginning 3/18 •Closure of ALL casinos, racetracks, theaters, gyms •Closure of ALL non-essential retail, recreational, & entertainment bizs after 8pm •Banning gatherings of 50+” Twitter. 16 Mar 2020.", "Illinois State Board of Education. School Wellness — Coronavirus. Accessed 1 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]