["‘ARE YOU UNEMPLOYED?’ asks one of the posts, which we’ve archived here. ‘KFC IS HIRING EXTRA December workers’. It asks Facebook users to click on a link to apply and leave a comment with the name of their province in order to receive an application form.", "More than 400 people have commented on the post since it was published on November 19, 2019. Some have left their phone numbers and messages, ‘help please’ and ‘share’.", "The ad was published by ‘Sifunisana Imisebenzi’, a Facebook page with more than 24,000 likes which regularly posts about job vacancies.", "However, the advert is fake. A spokeswoman for KFC in South Africa, Taki Simeli, said it was nothing to do with the brand.", "“KFC can confirm that this is not an authentic KFC poster. Job seekers are advised to follow the correct and legitimate recruitment process at KFC,” she told AFP via email.", "A similar post published on the same Facebook page, ‘Sifunisana Imisebenzi’ on November 7, 2019 claims Coca-Cola is ‘looking for Students and Unemployed people for December jobs’.", "Again, hundreds of people have commented on the post with the name of their province in order to receive an application form.", "A keyword search on Facebook reveals that the advert has also been shared here on the ‘SA Job Seekers’ page, which has more than 90,000 likes.", "However, a spokeswoman for Coca-Cola told AFP via email that the advert was fake.", "“This is not our advert,” said Motshidisi Mokwena, Head of Reputation and Regulatory Affairs for Coca-Cola Beverages South Africa.", "The links featured on the fake ads bring Facebook users to pages here and here on a site called newtechideas.online. According to domain verification tool WhoIs, the website’s IP address is in Mumbai, India.", "You can find details of opportunities to work at KFC and Coca-Cola in South Africa on their websites.", "AFP has previously debunked fake job ads including a Facebook post claiming the Kenyan government was heading a huge recruitment campaign and that Africa’s richest man, Aliko Dangote, was recruiting thousands of people to work at an oil refinery in Nigeria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]