["About this rating", "In July 2015, a series of photographs purportedly showing a crow landing on and riding atop the back of an eagle in flight were a subject of social media fascination:", "The photographs, which followed on the heels of similar animal ride-hitching images such as a weasel riding a woodpecker and a raccoon riding an alligator, left many viewers questioning their authenticity.", "Although some commenters disclaimed the above-displayed photographs as depicting an aerodynamically impossible activity, according to Kevin McGowan, a biologist who specializes in crow behavior, they are indeed real:", "\"This would be kind of like a dog chasing a car and jumping up\" on it, says McGowan. \"Dogs always want to catch the car, but they never know what they'd do if they get it.\"", "But why didn't the eagle react to the crow landing? Since the crow wasn't pecking, it didn't warrant the Eagle's attention.", "As the largest bird of prey, eagles are harassed nonstop by birds of all species. Sometimes the hecklers are so persistent, it looks like the eagles \"are being followed by mosquitoes,\" says McGowan.", "Phoo Chan, the bird photographer who snapped the photographs back in May 2014, offered a similar explanation on his 500px page:", "Crows are known for aggressively harassing other raptors that are much bigger in size when spotted in their territories and usually these 'intruders' simply retreat without much fuss.", "However, in this frame the crow did not seem to harass the bald eagle at such close proximity and neither did the bald eagle seem to mind the crow's presence invading its personal space. What made it even more bizarre was that the crow even made a brief stop on the back of the eagle as if it was taking a free scenic ride and the eagle simply obliged.", "Chan's photographs may seemingly depict an impossible (or at least one-in-a-million) scene, but other images of crows \"riding\" eagles abound online.  In 2012, for example, Caters News photographer Hyeongchol Kim captured a similar occurrence in South Korea:", "I saw the crow flying towards the much bigger eagle, and prepared myself to capture the fight on camera. However, the bird just hovered above the eagle for a few seconds - and then appeared to just latch onto his back.", "The eagle didn't seem to mind at all — I think they must have been friends.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]