["A video is being shared on Facebook and Twitter in which multiple labourers from Haryana’s Bahadurgarh claim they haven’t been given the agreed-upon sum of ₹350 per person before coming to a protest rally. As per the video, about 118 people joined the rally. This has been shared with Hindi text claiming, “AAP party’s jihadi mentality, watch this ground report and understand the truth behind farmers’ protest.”", "This video was shared by @kapilthakur8938, a member of BJP Yuva Morcha, on December 3. It gained over 5,000 views. (archived link)", "BJP member Surendra Poonia also tweeted the video.", "350 रुपये दीजिये…क्रांति शुरू कीजिये", "केजरीवाल के क्रान्तिकारी 👇 pic.twitter.com/h1bbJydrva", "— Major Surendra Poonia (@MajorPoonia) December 7, 2020", "Another user @ArunDeshpande20 shared the clip and wrote, “Truth behind Farmers’ agitation Rs. 350/- a day pay to show big number gathering.”", "Truth behind Farmers’ agitation Rs. 350/- a day pay to show big number gathering. @HMOIndia pls make a note and stop innocents from getting fooled by #AAP, #Congress #AkaliDal #Leftists #FarmersBill_2020 #Farmers pic.twitter.com/fr4CunlAfY", "— Arun Deshpande (@ArunDeshpande20) December 5, 2020", "It was shared by multiple uses on Facebook including Shobha Joshi whose post drew about 4,000 views. (archived link)", "आप पार्टी कि जिहादी मानसिकता👌🏻ग्राउंड रिपोर्ट देखिए और समझिए किसान आंदोलन की सच्चाई क्या हैं।", "Posted by Shobha Joshi on Wednesday, 2 December 2020", "Based on our research, we found that the video is from 2018. Twitter user @AnkurMalviya6 had uploaded it on March 29, 2018, with the claim that AAP was bribing people to join their rally.", "On the same day, Aarti from AAP’s national social media team refuted the claim and tweeted a juxtaposed video — viral video and a video of the man seen in the viral video — stating that the man was threatened to give that statement. She wrote, “Another Fake Propaganda Bursted by the Same Man Right pointing backhand index They made him lie for the sake of their jobs.”", "AAP paid ₹ 350 to get Crowd for @ArvindKejriwal ‘s Haryana Bachao Rally झूठ झूठ झूठ Another Fake Propaganda Bursted by the Same Man 👉🏼 They made him lie for the sake of their jobs. pic.twitter.com/c0fIQ9GT9i", "— Aarti (@aartic02) March 29, 2018", "In 2018, ANI had published a video that shows labourers alleging that they were promised food and Rs 350 each to be present at Chief Minister Arvind Kejriwal’s public rally on March 26, 2018.", "#WATCH Labourers allege that they were promised Rs 350 each and food, to be present at Aam Aadmi Party chief Arvind Kejriwal’s public rally in Haryana’s Hisar yesterday but they neither got money nor food. pic.twitter.com/Qw9IJhp34w", "— ANI (@ANI) March 26, 2018", "Alt News has not independently verified if the bribery allegations against AAP are true. However, it was denied by the party. But more importantly, the video is not related to the ongoing farmers’ protest.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]