["About this rating", "A viral video supposedly showing an embarrassing Christmas gift mix-up was widely circulated on social media during the holiday season in 2019.  One version of the video, which shows a grandparent gifting a copy of Adolph Hitler's \"Mein Kampf\" to a grandchild who requested the video game Minecraft, racked up more than 5.5 million views in just a few days:", "This video does not document a grandparent's genuine attempt to gift a grandchild a copy of the Hitler manifesto. This is actually a staged comedy bit created by humorist Yann Stotz.", "Stotz posted the original video to his Instagram page on Christmas Eve. Soon after, uncredited versions started to circulate on Snapchat, Facebook, and Twitter, where they were often presented as if they showed a genuine Christmas mix-up.", "Stotz told the French news outlet 20 Minutes that he didn't intend to deceive anyone with this video, adding that those who encountered it on his own social media pages would have seen that it was created by a comedian.", "Stotz told 20 Minutes (translated via Google and edited):", "Originally, I put the video on Instagram on the evening of the 24th, to make a joke on this pun between Mein Kampf and Minecraft -- which I am not the first to have done, in my opinion. Someone took it up and shared it on Snapchat without crediting me and without the \"Yann Stotz - humorist\" link which gave the video context: the problem is that people took it seriously, and it made my family like something it is not.", "Of course it is a fake, but there was no intention to deceive, otherwise I would have posted an advertisement for my show!", "Stotz added that he first noticed the aural similarities between \"Minecraft\" and \"Mein Kampf\" when he gifted a copy of the video game to his godchild a few years ago. When Christmas rolled around this year, he decided to make a funny video about a grandparent mishearing his grandchild's request.", "Stotz told 20 Minutes:", "Three years ago we gave Minecraft as a gift to my godchild, and I said to myself 'it's funny, it looks like Mein Kampf,' so this year I printed the cover of Mein Kampf and put it on a book by Jules Verne and then I shot the video.", "The original version of Stotz' video featuring a grandparent gifting \"Mein Kampf\" to a grandchild who requested Minecraft can be seen below:", "Orsini, Alexis.   \"Non, Un Enfant n’a Pas Vraiment Reçu 'Mein Kampf' à la Place de 'Minecraft' à Noël.\"\r\n    20 Minutes.   27 December 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]