["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Gov. Rick Scott paid for college by working at a doughnut shop and getting help from the GI bill. Now he says he wants low-income students to have that same shot at the American dream that he did.", "Scott has called for lowering the cost of college, including challenging colleges to offer $10,000 degrees. On March 17, 2014, he repeated that message at a college affordability roundtable at Barbara Goleman High School in Miami Lakes.", "Democrats were watching. American Bridge 21st Century, a Democratic super PAC, used a video clip of a reporter interviewing Scott at the event to produce an online attack video.", "While a smiling Scott appears to be standing in a library, a reporter asks: \"In your first year in office you proposed millions of dollars in cuts to public education. Then in 2011-12 over those two years (you) signed off on tuition increases of 13 percent. You presided over cuts to the Bright Futures college scholarship program. To what extent is your recent efforts to boost education and hold the line on costs of education re-election politics?\"", "\"All of that is incorrect,\" Scott responded, and then the video cuts him off. Text on the screen says, \"Scott approved cuts to Bright Future scholarships,\" followed by, \"Rick Scott is bad for Florida.\"", "We heard the rest of Scott’s defense thanks to a recording by Miami Herald education reporter David Smiley. Scott talked up funding increases for K-12 education, \"record funding for universities\" and his fight to cut higher education tuition -- but he didn’t mention Bright Futures.", "Education funding has been a hot topic in the race between Scott and former Gov. Charlie Crist, the Democratic frontrunner. Here we will examine American Bridge’s charge that Scott presided over cuts to Bright Futures.", "Bright Futures", "Launched in 1997, Bright Futures is the college scholarship program funded by the Lottery and designed to keep high-achieving students at Florida schools.", "The Web ad cites a May 2011 article in The Ledger about Bright Futures cuts approved by the Legislature and Scott during the annual legislative session. American Bridge sent us many other articles that described cuts that year.", "Why would state legislators want to make the program less generous? They say it’s grown too expensive and that too many students qualify. In an effort to make the scholarships more competitive, they have increased test score requirements, a move that drew the attention of the U.S. Justice Department for making it harder for poorer students of minority backgrounds to get the grant.", "There are a few ways we can examine cuts to the program, by looking at the total number of students served, the total amount of money disbursed, and the average scholarship amount per student. (There are different levels of Bright Futures awards depending on grades and other factors, but we will cite the overall average.)", "Here are recent years’ numbers on Bright Futures. The spending picture is not settled for the current and future fiscal years, so we have included an estimate for 2013-14 and the proposed figures for 2014-15.", "Year", "Number of students served", "Amount of money disbursed", "Average award per student", "2007-08", "159,170", "$379.8 million", "$2,387", "2008-09", "169,366", "$429 million", "$2,533", "2009-10", "177,612", "$423.5 million", "$2,385", "2010-11", "179,076", "$423.3 million", "$2,364", "2011-12", "174,047", "$333.8 million", "$1,918", "2012-13", "162,980", "$312.1 million", "$1,915", "2013-14 estimated", "154,160", "$309.4 million", "$2,007", "2014-15 proposed", "127,573", "$266.2 million", "$2,086", "Source: Florida Department of Education", "At a glance, it appears the total amount of Bright Futures funding nose-dived after Scott took office. Crist vows on his campaign website to reverse the cuts under Scott.", "Reality is slightly more muddled. The decline in the total number of Bright Futures recipients and the program's total budget is a result of decisions by the Legislature under both Crist and Scott to rein in costs. (We asked the Crist campaign for a response; they didn’t provide one.)", "The program’s costs spiraled up from an initial price tag of $70 million in 1997 to $437 million in 2011. Some critics said the standards for getting the awards were too easy.", "In 2010, Crist’s last year as governor, the Legislature reduced Bright Futures scholarships by $1 dollar for every credit hour. The bill also raised SAT/ACT requirements incrementally, which was expected to lead to a drop in the number of students who would qualify. For example, the Legislature raised the minimum SAT requirement for Florida Medallion Scholars -- one subset of Bright Futures -- from 970 in 2010-11 to 1050 in 2013-14.", "In 2011, Scott’s first year as governor, the Legislature decided to further raise test scores for 2013-14 graduates. For example, those Medallion Scholars would now have to score 1170 on their SAT by 2013-14.", "Scott’s summary of his proposed 2014-15 budget states his proposal \"fully funds\" the scholarships for eligible students and that the decline in total funds is due to a projected decrease of students because they changed the standards.", "So both Crist and Scott signed legislation that had the effect of reducing funding for Bright Futures.", "Our ruling", "American Bridge’s video said that Scott presided over cuts to the Bright Futures college scholarship program.", "During his tenure, the program’s total budget and number of students served has dropped. The average award amount under Scott is smaller than during the Crist years.", "However, it's worth noting that the Legislature under both Crist and Scott tightened eligibility requirements, which reduced the number of students who received the money. Both Crist and Scott signed off on those changes.", "We rate this claim Mostly True.", "American Bridge 21st Century, Online video, March 18, 2014", "Florida Department of Education, Florida Bright Futures Scholarship Program, Accessed March 20, 2014", "Florida Department of Education, Florida student scholarships and grant programs, 1997-2012", "Florida Office of Economic and Demographic Research, Bright Futures consensus estimate, March 5, 2014", "Gov. Rick Scott, \"It’s Your Money FAQ,\" 2014-15", "Charlie Crist for governor campaign website, Economy and jobs, accessed March 24, 2014", "Miami Herald’s Naked Politics blog, \"Feds investigate Florida Bright Futures scholarships,\" March 24, 2014", "Tampa Bay Times The Buzz Blog, \"More money-saving Bright Futures changes looming,\" Feb. 4, 2010", "Tampa Bay Times, \"Bright Futures to raise the bar,\" April 30, 2010", "Miami Herald, \"Florida legislative scorecard: what passed, what didn’t,\" May 1, 2010", "Miami Herald, \"Are Bright Futures scholarships going to the right students?\" April 2, 2011", "Tampa Bay Times, \"College gets more expensive,\" April 30, 2011", "The Ledger, \"College students face drop in Bright Futures, jump in tuition,\" May 28, 2011", "Sun-Sentinel, \"Tuition increases, cuts in aid pinch Florida college students,\" June 5, 2011", "Miami Herald, \"Change to Bright Futures scholarships hits poor, minorities,\" April 6, 2013", "PolitiFact, \"Scott says all 4-year state colleges offer $10,000 degrees,\" March 4, 2014", "Interview, Jackie Schutz, spokeswoman Gov. Rick Scott, March 19, 2014", "Interview, Cheryl Etters, spokeswoman Florida Department of Education, March 19, 2014", "Interview, Tiffany Cowie, spokeswoman Florida Department of Education, March 25, 2014", "Interview, Gwen Rocco, spokeswoman for American Bridge, March 19, 2014", "Interview, Kevin Cate, spokesman for Charlie Crist, March 21, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]