["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news item used two unrelated photos to sell an invented tale of vigilante justice that continues to be shared on Facebook. We rate this Pants on Fire! (Screenshot)", "A Facebook post recycled an old story about a shopping mall Santa who learns that a child molester is near and, with the help of some friends, beats him up.", "A case of vigilante justice, or a hoax? The latter.", "A Nov. 7 post with a screenshot of what looks vaguely like a news article reported that \"Kid tells mall Santa a secret; seconds later, him (sic) and his friends are beating the cr*p out of a child molester.\"", "Two images are side by side. One shows police arresting a man in a Santa Claus costume. The other is a pixelated image of man’s face.", "\"A Wisconsin mall Santa decided to handle one of the naughty list members early this year, when a young girl told him her Christmas wish was for her step dad to stop molesting her,\" the article said. \"He and four of his elves attacked the guy, who was waiting nearby, and pummeled him unconscious.\"", "The story’s byline –– \"Thug Muncher\" –– gives the first hint that this might not be legit.", "The words of a purported eyewitness also seem over the top. The witness described the Santa on top of the man, \"screaming, ‘Ho,ho,ho mother****er!’\"", "Digging a little deeper, the photo of the police arresting Santa dates from 2013, when protesters, including a guy in a Santa suit, rallied for higher wages outside a California Walmart.", "What’s more, the story of this righteously indignant Santa first appeared in December 2016 on a click-bait website called Thug Life. That version placed the episode in Milwaukee. The Milwaukee police told the Associated Press soon after that they had no record of the event.", "The website Snopes traced the second photo, the one of the man, to a 2012 mugshot.", "No need to regift this bit of fake news.", "We rate it Pants on Fire!", "Facebook, Santa beats up child molester, Nov. 7, 2019", "Huffington Post, Walmart Wage Protest Leads To Arrest Of Man Dressed Like Santa, Nov. 29, 2013", "Chicago Tribune, A suburban Milwaukee mall Santa did not beat up child molester with help of elves. That's fake., Dec. 30, 2016", "CBSN Los Angeles, Protesters, Including Man Dressed As Santa, Arrested At Walmart Rally In Ontario, Nov. 29, 2013", "Snopes, Did a Mall Santa Beat Up a Child Molester?, Dec. 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]