["About this rating", "After the arrest of Kyle Rittenhouse, the 17-year-old accused of fatally shooting two people and severely injuring a third during a protest in Kenosha, Wisconsin, on Aug. 25, 2020, Snopes heard numerous rumors about people defending him — including an attorney named John Pierce.", "For example, a viral Twitter post alleged Pierce was on Rittenhouse's legal defense team, and had compared his client's alleged decision to open fire at the protest to the \"shot heard round the world\" on April 19, 1775, which started the American Revolutionary War and led to the creation of the U.S.", "The twitter handle @CaliKidMP is indeed for a person named John Pierce. And per a LinkedIn page connected to the Twitter account, Pierce is the founder of Pierce Bainbridge law firm and lives in the Los Angeles metro area. The law firm describes itself as a “state-of-the-art litigation law firm dedicated to the lost art of combat by trial,\" with past clients including U.S. President Donald Trump’s personal attorney Rudy Giuliani.", "Next, we used the State Bar of California's database of attorneys to find out if Pierce had an active license to practice law in the state. He did, as of this report.", "After that, we sought evidence to determine whether he was among defending attorneys representing Rittenhouse, who faces charges including first-degree intentional homicide, which carries a life sentence. Snopes found reports from media outlets including Reuters, the Chicago Sun-Times, Business Insider, WISN 12-Milwaukee, and Fox News, that indeed named Pierce as an attorney fighting the teenager's charges.", "The Reuters report stated:", "\"John Pierce told Reuters on Thursday that he and colleagues at Pierce Bainbridge would obtain justice for Kyle Rittenhouse ...\"", "As more proof, Pierce said on Twitter that he was \"coordinating a whole special forces team to HALO jump in\" regarding Rittenhouse's case. Based on that statement and the news reports, we deemed it accurate to call Pierce an attorney for the teenager.", "Then, we looked for evidence on Pierce's Twitter account of the alleged statement by him: \"Kyle Rittenhouse will go down in American history alongside that brave unknown patriot at Lexington Green who fired 'The Shot Heard Round The World' on April 19, 1775. A Second American Revolution against Tyranny has begun #FightBack.\"", "No such post existed, as of this report. However, a separate tweet in the early hours of Sept. 3 by Lin Wood, a prominent Atlanta attorney who was also on Rittenhouse's legal defense team, displayed a screenshot of the alleged statement by Pierce, word-for-word, as well as information about Twitter's terms of service that prohibit content that threatens, glorifies, or promotes violence.", "\"Censorship. Plain and simple,\" Wood wrote, suggesting the social media site wrongfully removed Pierce's comment that compared their client's actions to the start of the Revolutionary War.", "By about noon the same day, Pierce said he was \"back from the Twitter penalty box\" and indicated that, yes, the platform had removed the in-question tweet. He also shared an article by a website called Reclaim The Net that dedicates itself to pushing \"back against big tech and media gatekeepers,\" which stated:", "\"Twitter locked the account of John Pierce, the lead defense lawyer for Kyle Rittenhouse, over a tweet comparing Rittenhouse to the 'unknown patriot' who fired the opening shot of the Battle of Concord on April 19th, 1775 that started the American Revolutionary War.\"", "Based on that activity on Pierce and Wood's Twitter accounts, as well as the fact that Pierce was part of Rittenhouse's legal defense team, we rate this claim correctly attributed; the attorney did say the teenager will \"go down in history\" for starting a second American Revolutionary War.", "Groves, Stephen, and Condon, Bernard.   \"Teen Accused Of Killing 2 Thrust Into Debate Over Protests.\"\r\n   The Associated Press.   28 August 2020.", "Creitz, Charles.   \"Attorney For Kenosha Gunman Kyle Rittenhouse Says Client Was Hunted 'As Prey' Before Deadly Shooting.\"\r\n   Fox News.   1 September 2020.", "Sweet, Lynn.   \"How The Radical Right Is Embracing — And Fundraising For — Antioch Teen Charged In 2 Kenosha Killings.\"\r\n   Chicago Sun Times.   30 August 2020.", "Thomas, David.   \"Law Firm For Teenager Accused Of Kenosha Killings Has Represented Trump Lawyer Giuliani.\"\r\n   Reuters.   27 August 2020.", "Schapiro, Rich.   \"Law Firm Representing Rudy Giuliani Beset By Sordid Allegations, Partner Exodus.\"\r\n   NBC News.   2 February 2020.", "WISN-12.   \"Extradition Hearing Delayed For Teen Accused Of Shooting Protesters.\"\r\n   28 August 2020.", "Parker, Tom.   \"Kyle Rittenhouse Lead Defense Lawyer John Pierce Locked Out of Twitter Over Tweet Advocating For His Client.\"\r\n   Reclaim The Net.   3 September 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]