["As much as Assembly Majority Leader Lou Greenwald would like to call it something else, a tax increase is still a tax increase.\n\nA Democrat from Camden County, Greenwald has proposed raising the state income tax rate on taxable income exceeding $1 million, and then using that new revenue to offset property taxes for people earning up to $250,000.\n\nBut that’s not a tax increase, Greenwald claimed in a recent TV interview.\n\n\"First of all, it’s not a tax increase. A tax increase is when you increase a tax that brings in more revenue that you spend in government,\" Greenwald said during a July 15 interview on \"Inside Story\" on Philadelphia-based 6abc.\n\n\"What we’ve offered is to take 16,000 people and have every penny that comes in from them offset property taxes up to 20 percent for 2.6 million filers, the other 8.8 million. So, it’s not a tax increase. It’s a tax shift.\"\n\nGreenwald’s claim doesn’t make any sense, PolitiFact New Jersey found.\n\nFor the last few months, Greenwald has been leading the charge to raise taxes on millionaires in order to provide property tax relief for residents with annual incomes up to $250,000.\n\nThe tax hike was initially tied to a proposed income tax credit based on the amount of property taxes paid. More recently, the increase has been linked to providing roughly $800 million in additional property tax relief payments through the state’s Homestead Benefit Program.\n\nLegislation sponsored by Greenwald -- Assembly Bill A-3201 -- increases the tax rate on taxable income greater than $1 million from 8.97 percent to 10.75 percent. Through a separate piece of legislation sponsored by Greenwald -- Assembly Bill A-3202 -- that additional tax revenue would go toward the higher property tax relief payments.\n\nThe Democrat-led Legislature passed both bills last month, but Gov. Chris Christie vetoed A-3202 outright and conditionally vetoed A-3201. Instead, the Republican governor called on legislators to amend that legislation to implement an income tax credit for homeowners earning up to $400,000 in taxable income.\n\nIn the TV interview, Greenwald offered a definition of a \"tax increase\" to explain how his proposal is not one.\n\nBut that definition -- \"A tax increase is when you increase a tax that brings in more revenue that you spend in government\" -- matches exactly what those two bills would do. One bill would \"increase a tax,\" and the second bill would \"spend\" that extra revenue.\n\nBrian McGinnis, communications director for Greenwald, maintained in an e-mail that the assemblyman’s proposal is a \"tax shift\" that would benefit millionaires as well.\n\n\"When our plan is taking every additional income tax dollar to reduce a local property tax expenditure for 95% of families, it’s a tax shift that ultimately accrues benefits to every family in our state through a lower property tax burden, stabilized property values and increased economic competitiveness,\" McGinnis told us.\n\nThe spokesman added: \"The Majority Leader has frequently talked about the hidden tax on all New Jerseyans being the hit a family’s property values take because property taxes are so high. In providing significant property tax relief to 95% of New Jersey families, our plan would have addressed this problem—helping to stabilize property values and benefiting people throughout the state, including millionaires.\n\n\"Furthermore, as the Majority Leader said in the interview, lower property taxes for the middle-class makes our state a more attractive place to live, meaning millionaires (whom the Governor calls job creators) can attract more talented employees.\"", "We gave Greenwald a False for a related claim from the same interview in this fact-check.\n\nOur ruling\n\nDuring a TV interview, Greenwald offered this description of his proposal to raise the state income tax rate on millionaires and use the extra money to offset property taxes for people earning up to $250,000:\n\n\"It’s not a tax increase. It’s a tax shift.\"\n\nBut despite how the money would be spent, raising any tax rates is clearly a tax increase. Calling such a measure a \"tax shift\" doesn’t make any sense, and Greenwald should know better. So, here’s three more words to add to his vocabulary:\n\nPants on Fire!", "To comment on this ruling, go to NJ.com.", "6abc.com, Inside Story, July 15, 2012\n\nPolitiFact New Jersey, Assembly Majority Leader Lou Greenwald claims money in state budget would provide tax break for all New Jerseyans, including millionaires, July 18, 2012\n\nNJToday, Democrats Respond to Christie's Speech on Tax Relief, July 2, 2012\n\nPolitiFact New Jersey, Chris Christie claims Democrats \"don't want to cut your taxes under any circumstances\", May 25, 2012\n\nNorthJersey.com, Alternative tax plan from Democrats, May 20, 2012\n\nNew Jersey Assembly Democrats, Majority Leader Greenwald on Middle Class & Seniors Property Tax Relief, June 21, 2012\n\nAssembly Bill A-3202, Makes FY 2013 supplemental appropriation of $789,000,000 to Homestead Benefit Program and amends budget language provisions to provide for significantly enhanced property tax relief payments to beleaguered homeowners and tenants, vetoed by Gov. Chris Christie on July 2, 2012\n\nAssembly Bill A-3201, Increases the gross income tax rate on taxable income exceeding $1 million contingent on enactment of certain homestead benefit enhancement legislation, conditionally vetoed by Gov. Chris Christie on July 2, 2012\n\nNew Jersey Governor’s Office, Governor Chris Christie Calls on Legislature to Join Him and Immediately Act to Deliver Middle-Class Tax Relief, July 2, 2012\n\nNew Jersey Governor’s Office, Conditional veto of Assembly Bill A-3201, July 2, 2012\n\nPolitiFact New Jersey, Stephen Sweeney claims his tax cut proposal would lower property taxes, March 15, 2012\n\nE-mail interview with Brian McGinnis, communications director for Assemblyman Lou Greenwald, July 16-17, 2012\n\nNorthJersey.com, Assembly plan for middle-class tax relief, March 11, 2012\n\nNew Jersey Assembly Democrats, Greenwald, DeAngelo & Benson: Middle-Class Family Struggles Show Assembly Dem 20% Property Tax Relief Credit Best for N.J., April 18, 2012\n\nThe Star-Ledger, N.J. Democrats strike tentative $180M tax cut deal contingent on Christie hitting revenue projections, June 14, 2012\n\nThe Star-Ledger, Gov. Christie offers compromise tax cut at special Legislature session, July 2, 2012\n\nNew Jersey Assembly Democrats, Property Tax Relief Proposal, accessed July 17, 2012", "NorthJersey.com, Christie expects tax deal soon, June 9, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]