["About this rating", "For several years a message has been circulated via email and social media postings offering prayers on behalf of \"11 Marines that gave their lives this week for everyone in this country\":", "R.I.P. Justin Allen 23, Brett Linley 29, Matthew Weikert 29, Justus Bartett 27, Dave Santos 21, Jesse Reed 26, Matthew Johnson 21, Zachary Fisher 24, Brandon King 23, Christopher Goeke 23, and Sheldon Tate 27. All 11 were Marines that gave their lives this week for everyone in this country. There is no media for them, not even a mention of their names.", "I am honoring them by copying and pasting this post.", "Praying for their family and loved ones.\nThank you all for your service.", "Lindsay Lohan, 24, is all over the news because she's a celebrity drug addict.", "While Justin Allen, 23, Brett Linley, 29, Matthew Weikert, 29, Justus Bartett, 27, Dave Santos, 21, Chase Stanley, 21, Jesse Reed, 26, Matthew Johnson, 21, Zachary Fisher, 24, Brandon King, 23, Christopher Goeke, 23, and Sheldon Tate, 27 are all Marines that gave their lives this week, no media mention.", "Honor THEM by reposting.", "As in similar messages of this form, the use of a relative timeframe only (i.e., \"this week\") has caused this item to perpetually circulate as if it described a recent event.  However, the deaths of the men named above occurred over eight years ago.", "All twelve men (the original version of the list included Chase Stanley, whose name was dropped from later repostings for unknown reasons) were killed in the line of duty in Afghanistan during the course of a single week in mid-July 2010.  Contrary to what the message states, only two of the fallen men were U.S. Marines (one of them was British Army, and the rest were U.S. Army).", "Of course, the sacrifices of these servicemen are no less relevant today than they were several years ago, as summarized below.", "Army Sgt. Justin B. Allen died on 18 July 2010 in Zhari, Afghanistan, of wounds suffered when he was shot by insurgents while conducting combat operations.", "Staff Sergeant Brett Linley (who was British, not America) died in Afghanistan on 17 July 2010, killed by an explosion as he and his team were working to clear improvised explosive devices from a vital route in the Nahr-e Saraj District of Helmand Province, Afghanistan.", "Army Sgt. Matthew W. Weikert died on 17 July 2010 in Paktika province, Afghanistan, of wounds sustained when enemy forces attacked his unit with an improvised explosive device.", "Marine Staff Sgt. Justus S. Bartelt (not \"Bartett\") died 16 July 2010 while supporting combat operations in Helmand province, Afghanistan.", "Marine Cpl. Dave M. Santos died 16 July 2010 while supporting combat operations in Helmand province, Afghanistan.", "Army Spc. Chase Stanley, Army Spc. Jesse D. Reed, Army Spc. Matthew J. Johnson, and Army Sgt. Zachary M. Fisher all died 14 July 2010 in Zabul province, Afghanistan, of wounds sustained when insurgents attacked a military vehicle with an improvised explosive device.", "Army Pvt. Brandon M. King died on 14 July 2010 at Combat Outpost Nolen, Afghanistan, of wounds sustained when insurgents attacked his unit with small-arms fire.", "Army 1st Lt. Christopher S. Goeke and Army Staff Sgt. Sheldon L. Tate died on 13 July 2010 in Kandahar City, Afghanistan, of wounds sustained when insurgents attacked his unit with rocket-propelled grenades and small-arms fire.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]