["Protesters interrupted Gov. Rick Perry at a Washington, D.C. event by calling for the Republican to support Medicaid’s expansion in Texas as encouraged under Obamacare.", "According to video snippets of the Feb. 22, 2013, event posted on YouTube, Perry said at one point the protesters hailed from Alabama. After a protester replied that she was from Houston, another woman rose, saying: \"Excuse me, Mr. Perry, I’m from Houston, Texas, as well,\" before suggesting some Houston women lack health insurance.", "\"You know one of the interesting things,\" Perry replied, \"Houston, Texas, is home to more doctors, more nurses, more researchers than any other place in the world--and I'm really proud of what we've done.\"", "Is Houston first on the planet all those ways?", "To our inquiry, Perry spokesman Josh Havens said by email the governor was referring to the sprawling Texas Medical Center in Houston, and not to an across-the-board tally of doctors, nurses and researchers in the Bayou City. \"It is the largest medical complex in world,\" Havens wrote.", "Perry did not single out the center in his February remark, though in July 2010, he told a radio host: \"When you think about the medical center in Houston, there are more doctors, nurses, researchers go to work there than any other place in the world, every day.\" His comment was recapped in a July 29, 2010, blog post by the liberal-leaning Think Progress.", "In contrast, the medical center has not aired such a precise global claim, though its \"Facts and Figures\" web page refers to the center as \"the largest medical complex in the world\" employing 92,500 people in 54 entities including government agencies and non-profit health-related institutions on an annual total budget of $14 billion.", "Center spokeswomen told us by phone and email that they had no precise counts, or planet-wide comparisons, of its physicians, nurses and researchers, though spokeswoman Lisa Mayes said incomplete results from a 2011 survey indicate that more than 21,773 physicians, nurses and researchers worked at the center that year. Center official Laura Jordan said final results, being compiled, will break out the number of physicians, nurses and researchers.", "Another spokeswoman, Bobbi Gruner, said she doesn’t believe any other medical complex \"remotely compares in the entire world.\" In hosting delegations from more than 100 countries and 50 of the largest U.S. cities, Gruner emailed, \"we have found that none have medical assets as concentrated as is the case with the Texas Medical Center. If you look at size alone,\" she said, \"the Texas Medical Center is the 9th largest downtown area in the U.S.  If you look at patient visits, the Texas Medical Center had 7.1 million,\" according to the center’s 2010 survey. In contrast, Gruner noted, Johns Hopkins Medicine, headquartered in Baltimore, says it has more than 2.8 million \"outpatient encounters\" a year, while the Minnesota-based Mayo Clinic reports more than 1.1 million clinic patients a year.", "Granted, the Houston center is huge. Still, that alone doesn’t make Houston home to the world’s most doctors, nurses and researchers.", "We did not fare well scouring for independent confirmation of Perry’s statement.", "Spokespeople for the U.S. Bureau of Labor Statistics pointed out that its counts of health care professionals are based on the nation’s metropolitan statistical areas, which can fold in more than one city or county.", "For that reason, we were ready to set them aside.", "But the Greater Houston Partnership, which promotes the Houston-area economy, answered our inquiry by citing the bureau’s analysis. Spokesman Erik Noriega sent a chart drawing on the bureau’s work suggesting the Houston-Sugar Land-Baytown metro area has the fourth-most individuals (129,930) employed as \"healthcare practitioners and technical occupations,\" a grouping that he said folds in surgeons, doctors, nurses, therapists, medical/clinical technologists and healthcare technicians. The New York (265,020), Los Angeles (206,300) and Chicago (188,340) areas have more workers in the fields, according to the estimates.", "Separately, U.S. Census Bureau spokesman Robert Bernstein guided us to a table in its \"County and City Data Book: 2007\" stating the number of physicians by county for each state in 2004 as well as the ratio of physicians to every 100,000 county residents--a reasonable way of adjusting for population differences. In 2004, the table indicates, Harris County had 11,419 physicians, the fourth-highest total nationally behind California’s Los Angeles County (30,102 physicians); Illinois’s Cook County, home to Chicago (21,189); and New York County (19,849). Separately, a spokeswoman for the Harris County Medical Society, Jennifer Snyder, pointed out that according to the Texas Medical Board,, Harris County had 11,821 physicians as of September 2012.", "Harris County’s 2004 ratio of 314 physicians per 100,000 residents was lower than the ratios in 10 other populous counties, including Bexar County in Texas, home to San Antonio (375). Indeed, eight other Texas counties had more physicians per 100,000 residents than Harris County, according to the bureau’s table.", "Next, the Texas Department of State Health Services provided August 2011 counts of physicians and nurses for five big Texas cities. According to the information emailed by spokeswoman Christine Mann, Houston then had 6,946 physicians, topping Dallas (4,304), San Antonio (3,485), Austin (2,678) and Fort Worth (1,729).", "Mann said nearly 22,000 vocational and registered nurses practiced in Houston at that time, more than in San Antonio (13,491); Dallas (13,100); Fort Worth (7,385); and Austin (7,180).", "We adjusted these totals for each city’s population, as estimated by the census bureau for 2011. By this approach, Dallas had the lowest, or best, ratios of 284 and 93 residents per doctor and nurse, respectively. Austin narrowly bested Houston with 306 local residents per doctor, compared to Houston’s 308, while Houston had the second-lowest ratio of residents per nurse, 98.", "Our attempts to obtain comparative counts of physicians and nurses spanning the globe came up empty. We did not endeavor to compare the number of researchers in Houston against those in other cities.", "Our ruling", "Perry said Houston is \"home to more doctors, more nurses, more researchers than any other place in the world.\"", "Perry did not provide nor did we find evidence proving this claim, and there are signs that it’s not supported, including the census table indicating that Harris County ranked fourth nationally in total physicians in 2004 and trailed even more counties, including more than half a dozen in Texas, in physicians per 100,000 residents. Also, while Houston had the most doctors and nurses among five populous Texas cities in 2011, Dallas had greater concentrations of physicians and nurses.", "Finally, there is not yet any confirmation that the Texas Medical Center employs more doctors, nurses and researchers than any other place. That could be. But mights aren’t facts and regardless, Perry specified Houston in his recent statement, not the center.", "We rate this claim as False.", "Telephone interview and emails (excerpted), Lisa Mayes, director, Government and External Affairs; Laura C. Jordan, project management specialist, International Affairs, Government and External Affairs; Bobbi Gruner, Vice President, Corporate Communications, Texas Medical Center, Houston, Feb. 25 and 26, 2013", "Web page, \"Media Fact Sheet,\" Harris County Medical Society, last updated Nov. 30, 2012 (accessed Feb. 25, 2013)", "Telephone interview, Jennifer Snyder, director of communications, Harris County Medical Society, Houston, Feb. 26, 2013", "Web page, \"Physicians by County then Specialty, September 2012,\"Texas Medical Board (accessed Feb. 26, 2013)", "Web pages, \"May 2011 Metropolitan and Nonmetropolitan Area Occupational Employment and Wage Estimates Houston-Sugar Land-Baytown, TX,\" \"May 2011 Metropolitan and Nonmetropolitan Area Occupational Employment and Wage Estimates New York-Northern New Jersey-Long Island, NY-NJ-PA,\" \"May 2011 Metropolitan and Nonmetropolitan Area Occupational Employment and Wage Estimates Chicago-Joliet-Naperville, IL Metropolitan Division,\"  U.S. Bureau of Labor Statistics (accessed Feb. 26, 2013)", "Chart, \"Houston MSA ranks 4th in the nation in number of Healthcare Practitioners and Technical Occupations (SOC 29-0000),\" prepared by Greater Houston Partnership (received March 6, 2013)", "Telephone interview, Gary Steinberg, press officer, U.S. Bureau of Labor Statistics, Feb. 26, 2013", "Table, \"Counties — Physicians, Community Hospitals, Medicare, Social Security, and Supplemental Security Income\" in \"County and City Data Book: 2007\", U.S. Census Bureau (accessed Feb. 26, 2013)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]