["About this rating", "In August 2017 President Donald Trump famously defended white nationalists who had gathered for a \"Unite the Right\" rally Charlottesville (an event that resulted in the death of a counter-protester) by proclaiming that the group included “some very fine people.”  This occurrence led some critics to lament that the American political climate was now such that even the President of the United States \"cannot bring himself to denounce Nazis.\"", "This sentiment was summed up in a viral Facebook post featuring a photograph seemingly showing a member of the Nazi Schutzstaffel (SS) paramilitary organization holding a gun to the back of a baby's head:", "The scenario depicted in this image is not far-fetched, as children who were too young to be forced into labor were commonly killed to reduce the number of “useless eaters” among the populations the Nazis rounded up into concentration camps and ghettos during World War II. However, this chilling scene did not originate with a photograph taken during the Holocaust.", "This picture is a de-colorized version of a promotional image for the 2011 film Auschwitz, directed by Uwe Boll:", "A version of Boll's Auschwitz exists on YouTube, and the scene which this image represents (i.e., the cold-blooded murder of a crying child) can be glimpsed around the 28:58 mark:", "NSFW warning: Video contains nudity and violence", "https://youtu.be/utPM2YLUVxo\n\nAlthough this viral Facebook message employed an image from a film and not a real-life photograph, the visual reference to the killing of children by Nazis is unfortunately and undeniably true. According to the United States Holocaust Memorial Museum (USHMM), between 1 million and 1.5 million children died during the Holocaust, either through being deliberately killed or thrust into unsurvivable living conditions:", "When World War II began in September 1939, there were approximately 1.6 million Jewish children living in the territories that the German armies or their allies would occupy. When the war in Europe ended in May 1945, more than 1 million and perhaps as many as 1.5 million Jewish children were dead, targeted victims in the Nazis’ calculated program of genocide. As Warsaw ghetto historian Emanuel Ringelblum wrote in 1942, “Even in the most barbaric times, a human spark glowed in the rudest heart, and children were spared. But the Hitlerian beast is quite different. It would devour the dearest of us, those who arouse the greatest compassion—our innocent children.”", "In the ghettos, Jewish children died from starvation, exposure, and a lack of adequate clothing and shelter. The German authorities were indifferent to this mass death. They considered most of the younger ghetto children to be unproductive and hence “useless eaters.” Because children were generally too young to be used for forced labor, German authorities generally selected them, the elderly, ill, and disabled, for the first deportations to killing centers, or as the first victims led to mass graves to be shot.", "The documented camps include not only \"killing centers\" but also thousands of forced labor camps, where prisoners manufactured war supplies; prisoners-of-war camps; sites euphemistically named \"care\" centers, where pregnant women were forced to have abortions or their babies were killed after birth; brothels, where women were coerced into having sex with German military personnel.", "Lichtblau, Eric.   \"The Holocaust Just Got More Shocking.\"\r\n    The New York Times.   1 March 2013.", "United States Holocaust Memorial Museum.   \"Life in the Shadows: Hidden Children and the Holocaust.\"\r\n    28 August 2003.", "United States Holocaust Memorial Museum.   \"Children During the Holocaust.\"\r\n    Retrieved 3 October 2018.", "United States Holocaust Memorial Museum.   \"Documenting Numbers of Victims of the Holocaust and Nazi Persecution.\"\r\n    Retrieved 3 October 2018.", "Ecarma, Caleb.   \"I Was at the Sad White Supremacists Gathering. It Didn't Fool Me. Their Movement Is Rising.\"\r\n    USA Today.   13 August 2018.", "Reitman, Janet.   \"All-American Nazis.\"\r\n    Daily Beast.   2 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]