["About this rating", "In March 2020, some social media users encountered an open letter that was supposedly written by Mötley Crüe musician Tommy Lee to U.S. President Donald Trump, which started \"Dear fucking lunatic.\"", "Lee did not write this letter.", "The Mötley Crüe musician posted the letter to his Facebook page (which is likely why some people mistakenly assumed he had written it) on March 20, 2020, and attributed the letter to a man by the name of Craig Alan Wilkins.", "But \"Craig Alan Wilkins\" didn't write this letter, either.", "The majority of text in this letter — most everything except for the intro starting with \"Do you know how fucking insane you sound, you off-brand butt plug?\" — was published on the Daily Kos in December 2017 in an article by \"Aldous J Pennyfarthing.\"", "Pennyfarthing's letter was written in response to an interview Trump gave to The New York Times in 2017, in which he said, \"Yeah, China. … China’s been. … I like very much President Xi. He treated me better than anybody’s ever been treated in the history of China.\"", "Pennyfarthing's original letter started:", "Dear Fucking Lunatic,", "I read with interest your recent interview with The New York Times. I couldn’t get past the bit about your being the most popular visitor in the history of fucking China — a country that’s only 2,238 years old, give or take.", "It's unclear who amended the opening paragraph in this letter. It's possible that a Facebook user named \"Craig Alan Wilkins\" shared Pennyfarthing's open letter with a new introductory paragraph. While the author of the opening paragraph is still uncertain, the majority of this text was written by Aldous J Pennyfarthing, the pen name for author Tom Breuer, and was originally published on the Daily Kos in 2017. This open letter was subsequently published in Pennyfarthing's 2018 book Dear F*cking Lunatic: 101 Obscenely Rude Letters to Donald Trump.", "Pennyfarthing, Aldous.   \"Dear F*cking Lunatic: 101 Obscenely Rude Letters to Donald Trump.\"\r\n    Aldous J. Pennyfarthing.   1 April 2018.", "Pennyfarthing, Aldous.   \"Dear F*cking Lunatic: An open letter to Donald Trump.\"\r\n    Daily Kos.   29 December 2017.", "The New York Times.   \"Excerpts From Trump’s Interview With The Times.\"  \r\n  28 December 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]