["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidates Michael Bloomberg, Elizabeth Warren, Bernie Sanders, Joe Biden, Pete Buttigieg and Amy Klobuchar before a debate in Las Vegas. (AP)", "Sen. Elizabeth Warren loves to tout her plans for any and all policy questions, including climate change, child care and especially health care.", "This became a point of contention during the Democratic presidential debate in Las Vegas on Feb. 19, where she criticized her rivals over a lack of specificity in their health plans.", "Warren said a proposal from Pete Buttigieg is \"not a plan. It's a PowerPoint.\" Then she turned to Senate colleague Amy Klobuchar of Minnesota.", "\"And Amy's plan is even less,\" Warren said. \"It's like a Post-It note, 'Insert Plan Here.'\"", "After some additional digs and discussion, Warren and Klobuchar had this exchange:", "Warren: \"So I actually took a look at the plans that are posted. … Amy, I looked online at your plan. It's two paragraphs. Families are suffering, and they need …\"", "Klobuchar: \"OK, that's it.\"", "Warren: \"You can't simply stand here and trash an idea to give health care coverage to everyone without having a realistic plan of your own. And if you're not going to own up to the fact either that you don't have a plan or that your plan is going to leave people without health care coverage, full coverage, then you need to say so.\"", "Warren’s campaign told PolitiFact that she was referring specifically to Klobuchar’s plan for \"universal health care.\" Her campaign pointed to the two paragraphs at the end of a Klobuchar campaign web page that specifically follow the heading \"Propose legislation to get us to universal health care.\"", "However, this is a selective reading of the health care policy pages that Klobuchar posted on her website.", "Klobuchar supports building on the Affordable Care Act and adding a public option that expands Medicare and Medicaid.", "By contrast, Warren initially joined rival candidate Bernie Sanders in supporting a wholesale switch to a single-player plan — a more aggressive approach than Klobuchar’s — then later eased off. Warren currently backs two bills, one for a public option and another for a single-payer plan.", "The problem with Warren’s attack is that it focuses on two paragraphs, which ignores most of her rival’s health care plan. There is quite a bit of detail in Klobuchar’s plan.", "Klobuchar’s website has no fewer than four different web pages that address the topic — a main health care policy page, a more detailed sub-page, a sub-page on prescription drugs and a sub-page on mental health.", "Some of Klobuchar’s bullet-pointed priorities include:", "• \"Immediately suspend the Trump Administration’s efforts to eliminate the Affordable Care Act’s protections for people with pre-existing conditions.\"", "• \"Develop best models of care to address disparities in maternal and infant mortality and address the shortage of maternity care health professionals in underserved rural and urban areas.\"", "• \"Expand Medicaid reimbursement for people receiving mental health or substance use treatment.\"", "• \"Expand the open enrollment period for health insurance under the Affordable Care Act so more people can get insurance coverage.\"", "• \"Stop Trump sabotage of the ACA by ending workarounds that allow states to raise premiums for sicker people and shift ACA premium subsidies away from lower-income enrollees.\"", "All told, the four Klobuchar web pages by our count have 64 paragraphs, not counting overlap — far more than two.", "Warren said, \"Amy, I looked online at your (health care) plan. It’s two paragraphs.\"", "Warren’s campaign said she was referring to just the paragraphs that specifically addressed universal health care. That wasn't clear on stage, where she dismissed Klobuchar's health policy ideas as small enough to fit on a Post-It. Klobuchar's two paragraphs on universal health care are just one part of a four-webpage policy statement that collectively runs 64 paragraphs long.", "We rate the statement False.", "Las Vegas debate transcript, Feb. 19, 2020", "Amy Klobuchar health policy web pages, accessed Feb. 19, 2020: main health care policy page, more detailed sub-page, sub-page on prescription drugs, sub-page on mental health", "Elizabeth Warren, \"My First Term Plan for Reducing Health Care Costs in America and Transitioning to Medicare for All,\" Nov 15, 2019", "Washington Post, \"The Health 202: Elizabeth Warren is no longer a Medicare-for-all purist,\" November 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]