["About this rating", "An image circulated on Facebook shows small children in handcuffs being led into a law enforcement vehicle, along with claims that the pictured children were immigrants who had been taken by U.S. Immigration and Customs Enforcement (ICE) as part of the Trump administration's controversial \"zero tolerance\" policy. Under that policy, migrant parents caught crossing the U.S.-Mexico border between ports of entry were criminally charged and their children taken from them:", "Although hundreds of immigrant children, including some infants, were taken from their parents, the image seen here is unrelated to that activity. The photograph has been online since 2009 and is associated with a Tea Party protest in West Palm Beach, Florida, during which parents brought their kids for a mock arrest to demonstrate how they are being saddled with debt from government spending.", "The alternate weekly newspaper Broward Palm Beach New Times featured the image in a 14 April 2014 story about the demonstration under the caption \"Hopefully the cops won't mistake the protesters for real criminals.\" The New Times reported of the event that:", "If you have children, and you'd like to exploit those children for your political gains, and if you have the money to rent those children prison uniforms, you should totally bring them to downtown West Palm Beach on Wednesday. That's when people protesting government spending will bring 20-30 children dressed in prison uniforms and put them in fake debtor jails. It's meant to show how children will have to pay for wasteful government spending of today. And it's also a great way to ensure continued work for psychologists of tomorrow.", "The event is part of a nationwide Tea Party demonstration put on by Libertarians, Republicans, and others who think economic stimulus bills are a good occasion to put our children into fake debtor jails.", "Sid Dinerstein, chairman of the Republican Party of Palm Beach County and an organizer of the event, said the fake jails will be two dimensional, meaning the kids won't actually be held captive at any point. Except by the government's excessive debt.", "This same photograph was similarly used outside its original context as part of a meme in 2012, but that time it was employed to scare parents about the looming \"police state\" as behavioral issues in school were being treated as crimes:", "Barton, Eric.   \"Children with No Financial Future to Be Jailed.\"\r\n    [Broward Palm Beach] New Times.   14 April 2009.", "Shapiro, Leslie and Manas Sharma.   \"How Many Migrant Children Are Still Separated from Their Families?\"\r\n    The Washington Post.   8 August 2018.", "Ainsley, Julia and Jane C. Timm.    \"1,995 Children Separated from Families at Border Under 'Zero Tolerance' Policy.\"\r\n    NBC News.   15 June 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]