["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral Facebook post wrongly attributed a 500-word defense of President Donald Trump to actor Clint Eastwood.", "But it wasn’t the Hollywood icon who wrote the words in question. It was New Hampshire state Rep. Fred Doucette, the chair of Trump’s campaign in that state.", "The Dec. 28 Facebook post, which was shared more than 1,600 times, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post lifted almost word-for-word from Doucette, who published his defense of Trump on Sept. 30 as a letter to the Eagle-Tribune, a local news outlet covering parts of Massachusetts and New Hampshire. Eastwood was never mentioned in Doucette’s piece.", "\"I love it when people call President Donald Trump stupid,\" Doucette wrote. \"You mean the multi-billionaire who kicked every Democrat’s butt, buried 16 career Republican politicians, and continues to make fools out of once reputable news organizations?\"", "The confusion linking Eastwood to the letter likely came after the Massachusetts Republican Party reposted Doucette’s writing to its Facebook page in November.", "That post included a meme that showed a photo of Eastwood and quoted him as saying, \"If Congress really gave a rat’s ass about the American people, they would resign.\"", "For what it’s worth, we checked Google and Nexis and could not verify that Eastwood ever made that statement about Congress, either.", "In 2013, he did criticize Washington, saying, \"It’s almost like they don’t give a damn.\" He also spoke at the Republican National Convention in 2012.", "We rate this post False.", "Facebook post, Dec. 28, 2019", "Massachusetts Republican Party on Facebook, Nov. 24, 2019", "The Eagle-Tribune, \"Letter: Don’t be brainwashed by what the Democrats tell you,\" Sept. 30, 2019", "CNBC, \"Eastwood: If DC Doesn't 'Give a Damn,' How Can We?\" Feb. 8, 2013", "NPR, \"Transcript: Clint Eastwood's Convention Remarks,\" Aug. 30, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]