["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker says Superintendent of Public Instruction Tony Evers has failed to step up and take over failing schools. But does Evers have that authority?", "Have the problems facing Milwaukee Public Schools reached a point where the state should step in?", "They have in the eyes of Gov. Scott Walker, who said Superintendent of Public Instruction Tony Evers has failed to step up. Evers, not so coincidentally, is one of the many Democrats aiming to take on Walker in the November 2018 election.", "In an extended interview portion of WISN-TV’s May 13, 2018, episode of  \"UpFront with Mike Gousha,\" Walker left open the possibility of changing district boundaries and breaking MPS into smaller sections as \"things we realistically have to look at.\"", "After Gousha asked if the state has a responsibility to step in with MPS, Walker replied:", "By law, Democrats gave the superintendent of public instruction, back in 2009, the ability to take over failing schools. And for whatever reason the current superintendent has failed to do that … Maybe we have to look beyond that. If the superintendent is not willing to do that, then I think then maybe there are other things we need to look at. Maybe we shake things up a little bit.", "Is Walker right about Evers ignoring his ability to take over Milwaukee schools?", "The background", "When asked for backup to the claim, Walker spokeswoman Amy Hasenberg cited Wisconsin State Statute 118.42.", "The statute -- with the heading \"Low-performing school districts and schools; state superintendent interventions\" -- provides a list of scenarios under which the state schools superintendent can intervene in low-performing school districts and schools.", "The first part of the statute addresses what can happen to districts found to be in need of improvement for four consecutive school years:", "(a) Employ a standard, consistent, research-based curriculum that is aligned with the state's model academic standards, as determined by the state superintendent, and across grades in all schools.", "(b) Use pupil academic performance data, including data indicating improvement in pupil academic achievement and English language acquisition, to differentiate instruction to meet individual pupil needs. To the extent practicable, the school board shall assess pupils in the language and form most likely to yield accurate data.", "(c) Implement for all pupils a system of academic and behavioral supports and early interventions, including diagnostic assessments, instruction in core academic subjects, different instructional strategies for different pupils, and strategies to improve reading and mathematics instruction and promote positive behavior.", "(d) Provide additional learning time to address the academic needs of pupils who are struggling academically, including pupils whose proficiency in English is limited. The additional learning time may include an extended school day, an extended school year, summer school, or intersession courses.", "How it works in practice", "Department of Public Instruction spokesman Tom McCarthy told the Wisconsin State Journal in an article posted May 14, 2018, the department has never considered a \"takeover\" of Milwaukee schools because \"how schools are governed or run isn’t going to change the challenges kids in Milwaukee face.\"", "In an email, McCarthy told us \"not only is the governor mischaracterizing how 118.42 works, he's also incorrect in whether it can be currently used to intervene with MPS.\"", "McCarthy went on to say:", "The superintendent powers have a trigger for use (based on the performance of a district/school) and allowable interventions. The allowable interventions do not allow the superintendent to \"take over a school,\" but do allow for specific turn-around strategies to be required. Taking over a school, as we have historically known and used the phrase, means assuming all decision-making power. The superintendent powers do not permit that and no such power exists in 118.42.", "Meanwhile, an analyst at the state’s Legislative Reference Bureau referred PolitiFact Wisconsin to a  Wisconsin Legislative Council memo for statute 118.42.", "The memo includes criteria \"authorizing the State Superintendent of Public Instruction to intervene with the school district under certain conditions.\" But it contains no reference to the superintendent having the authority to take over failing schools.", "What’s more, McCarthy noted MPS no longer qualifies for these permitted interventions.", "The law’s trigger is based on performance on the school/district report card and whether that district has fallen into the bottom category. MPS -- having moved out of the bottom category -- no longer qualifies.", "A separate program", "In our interview with McCarthy, he did note there is a takeover provision in state law . Though it operates differently:", "\"It does exist in the Opportunity Schools Partnership Program,\" he said. \"In that scenario, the takeover authority is vested in the county executive and the commissioner. Not the state superintendent.\"", "Under that program, known as OSPP, the department of public instruction identifies districts that would qualify for the program due to performance triggers spelled out by the law, and notifies the county executive in the county that is home to the district", "\"The county executive appoints a commissioner and that person then has the ability to take over a school, provided they are on the list of low-performing schools within the district,\" said McCarthy. \"Again, no authority for (DPI) exists in the OSPP beyond simple identification.\"", "In November 2015, Milwaukee County Executive Chris Abele selected Demond Means, superintendent of the Mequon-Thiensville School District, as the special commissioner. By late July 2016, Means had resigned, saying the adversarial climate surrounding the program \"is the last thing our children need.\"", "Means was given a list of schools that qualified for takeover. The following school year, 2016-’17, those schools determined to be eligible could be taken over, but Means did not take over any schools. In 2017-'18, the just-concluded year, no schools were eligible for takeover.", "Alan Borsuk, senior fellow in law and public policy at Marquette Law School and weekly columnist for the Milwaukee Journal Sentinel, said the state superintendent does have options.", "\"The superintendent has strong options to seek change under that state law and had other options under the now-gone federal No Child Left Behind law, but they didn’t rise to what I would label taking over schools,\" Borsuk told PolitiFact Wisconsin.", "Our rating", "Walker said \"Democrats gave the superintendent of public instruction, back in 2009, the ability to take over failing schools. … The current superintendent has failed to do that.\"", "While the law in questions allows the superintendent to order various interventions, it does not have a provision for a complete takeover. A different law allows the local county executive to take action. That process was begun in Milwaukee, but did not advance.", "In addition, MPS no longer falls into the bottom category of the state's school and district report cards, and therefore no longer qualifies for the interventions under the state law.", "We rate Walker’s claim False.", "\"UpFront with Mike Gousha,\" WISN-TV (Channel 12), May 13, 2018. Scroll down to extended interview, 2:10 mark.", "Milwaukee Journal Sentinel, \"Gov. Scott Walker hints at state action on Milwaukee Public Schools, says it might be time to ‘shake things up,’ May 14, 2018.", "Wisconsin State Legislature: Statutes 118.42", "Wisconsin State Journal, \"Scott Walker: Tony Evers ‘failed’ to take over Milwaukee schools,’ May 14, 2018.", "WUWM 89.7 \"All Things Considered, May 15, 2018, 1:58 mark", "Email, Amy Hasenberg, press secretary for office of Gov. Scott Walker, May 23, 2018.", "Emails, Thomas G. McCarthy, Department of Public Instruction spokesman, June 1, 2018.", "Email, Alan Borsuk, Marquette University Law School, June 13, 2018.", "Email, legislative analyst with Legislative Reference Bureau, June 27, 2018.", "Wisconsin Legislative Council memo", "PolitiFact Wisconsin, \"Debunking claim that Demond Means said Milwaukee Public Schools district ‘needs to be gutted,\" May 18, 2016.", "Milwaukee Journal Sentinel, \"Demond Means resigns as leader of Milwaukee school turnaround district,\" June 29, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]