["The photo was published in a Facebook post here on November 5, 2019. It has received more than 400 likes.", "The image shows a beauty contestant on a catwalk runway wearing a sash displaying the words; “Republic of Malaysia”.", "The post's Malay-language caption translates to English as: “Since when did Malaysia become a REPUBLIC…!?”", "A republic is “a government having a chief of state who is not a monarch and who in modern times is usually a president”, according to the Merriam-Webster dictionary.", "Below is a screenshot of the misleading Facebook post:", "The photo was also published on Facebook here with a similar claim. It has been shared more than 300 times.", "Footage of the same beauty contestant, alongside a similar claim, was also posted on Facebook here, here and here, where it has been viewed more than 12,000 times.", "The claim is misleading; the beauty pageant's organisers in Myanmar apologised for labelling the sash incorrectly.", "A keyword search on Google found the beauty pageant's organisers issue an apology for the error here.", "The November 5, 2019, statement reads: “Official announcement", "“We from the organizers of the Miss Crystal Angel International organization of Myanmar 2019 wish to apologize to the Malaysians for the mistake of having misused the name of the republic of Malaysia. This mistake did not come from Malaysian participants but it is from our side. Again we apologize for the misunderstanding.", "“Sincerely by,\n\tMiss Crystal Angel International 2019\n\t#LoveMalaysia\n\t#OfficialAnnouncement\n\t#Apologize”.", "The organisers also said in the comments section: “All Our Dear Malaysian ,\n\tMCAI already changed name from Republic of Malaysia to Borneo. Malaysia Organization need this name. We already discuss with Malaysia Organization. So Sorry for disturb all dear. And then we apologize already. So we don't need any negative word for this case anymore. WE LOVE MALAYSIA.\n\tThank You ❤️”.", "Malaysian news outlet The Star reported on the incident here on November 5, 2019.", "The report's headline states: “Please welcome our next contestant from the ‘Republic of Malaysia’?”", "The report's first three paragraphs state: “Malaysians on social media are seemingly outraged by a beauty pageant that referred to the country as the ‘Republic of Malaysia’.", "“Miss Crystal Angel International 2019 pageant, which took place on Monday (Nov 4) in Yangon, Myanmar, apparently had two contestants from Malaysia – one dubbed Miss Malaysia, and the other as Miss Republic of Malaysia.", "“However, the event organisers later apologised and changed all usage of the ‘Republic of Malaysia’ to ‘Borneo’ on its official Facebook page on Tuesday (Nov 5).”", "Malaysia is a constitutional monarchy.", "“Malaysia practices parliamentary democracy with constitutional monarchy. His Majesty the King is the head of state,” says the official website of the Malaysian parliament here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]