["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Sen. Bernie Sanders, I-Vt., speaks during First in the South Dinner, Monday, Feb. 24, 2020, in Charleston, S.C. (Associated Press)", "The Socialist Workers Party did criticize the Carter administration’s approach to the hostage crisis and said some of the hostages were spies.", "Bernie Sanders supported the Socialist Workers Party but was never a member or leader.", "We couldn’t find any public statements by Sanders on the subject.", "Bernie Sanders is facing stepped-up attacks over his record of friendly words for authoritarian regimes as he gains support in the early Democratic primaries and caucuses.", "A viral social media post criticizes Sanders as \"standing alone\" in support of Iran during the 1979 hostage crisis, when militants took over the U.S. Embassy in Iran and held over 50 Americans hostage for 444 days. The post (which wrongly says 70 hostages were held) features images of Sanders, Iran’s former leader Ayatollah Khomeini and President Jimmy Carter and says:", "\"Socialist Workers Party leader Bernie Sanders supported Ayatollah Khomeini against the US, condemned president Carter for imperialism, and accused the hostages of being CIA spies.", "\"Is this what Democrats stand for? Bernie Sanders for president? Maybe in Iran. Not in the US.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This claim exaggerates Sanders’ involvement in the Socialist Workers Party and wrongly says Sanders, like the party, labeled some of the hostages spies.", "Sanders, who describes himself as a democratic socialist, supported the Socialist Workers Party and spoke at some of the organization’s events in the 1980s, but he was neither the leader nor a member. The organization did criticize the Carter administration’s approach to the crisis and suggested some of the embassy hostages were spies. But Sanders did not.", "The post’s claims appear to come from a January 2020 Daily Beast opinion column by Ronald Radosh headlined, \"When Iran Took Americans Hostage, Bernie Backed Iran’s Defenders.\"", "The Socialist Workers Party is a far-left revolutionary group that originally supported Leon Trotsky, a Soviet communist and Marxist theorist whose beliefs are commonly known as \"Trotskyism.\"", "In the piece, Radosh wrote that in 1980, Sanders \"aligned himself with the Socialist Workers Party (SWP), the self-proclaimed Trotskyist revolutionary party. (The column goes too far in saying Sanders joined the party.)", "The social media post inaccurately jumbles this information. Here’s the historical context.", "In 1979, Islamic revolutionaries overthrew the Shah of Iran, who had been installed and supported by successive U.S. administrations. Militants took over the American embassy in Tehran and held 52 hostages from Nov. 4, 1979, until Jan. 20, 1981 — the day Ronald Reagan assumed the presidency from Carter, who had faced wide public disapproval over the protracted crisis.", "The Socialist Workers Party criticized the U.S. government’s approach during the crisis, writing in its newsletter The Militant that Carter’s administration was \"defying the wishes of the vast majority of the American people\" and called on the government to meet Khomeini’s demands, as well as suggesting that some of the hostages were spies.", "At the time of the hostage crisis, Sanders was in Vermont, running for mayor of Burlington as an independent, though he identified himself at the time as a socialist. Still, we could find no record of any public statements by Sanders on the crisis.", "Sanders, who was mayor from 1981 to 1989, was not a member of the Socialist Workers Party during or after the Iran hostage crisis, according to multiple contemporaneous news reports.", "But Sanders was affiliated with the party, even though Vermont in 1980 did not have a branch, according to The Militant. Sanders served as one of the Vermont Electoral College electors for SWP leader and presidential candidate Andrew Pulley. But Pulley’s candidacy was futile, because he was only 29 years old at the time, too young to be president under the U.S. Constitution (the minimum age is 35).", "Sanders also spoke at some of the party’s campaign events in 1982 and 1984.", "In 1980, Sanders said he didn’t support all of the party’s positions, telling the Rutland Daily Herald newspaper (hat-tip Snopes): \"Although I am not in agreement with the SWP on all issues, I strongly support that party’s attempt to become a nucleus for a national labor party, which will fight for the interests of low-income and working people.\"", "Sanders' relationship with the party seems to have largely diminished since then, and he hasn’t publicly addressed his affiliation with the organization during his current campaign for president.", "A Sanders campaign spokesperson referred us to their comment for the Snopes story: \"Sen. Sanders did not think the hostages were spies nor did he support their captivity. Any suggestion otherwise is nonsense.\"", "We rate this False.", "Facebook post, Feb. 18, 2020", "The Daily Beast, When Iran Took Americans Hostage, Bernie Backed Iran’s Defenders, Jan. 17, 2020", "PolitiFact, Fact-checking the Jan. 17 news shows, Jan. 18, 2016", "The Washington Examiner, Bernie Sanders campaigned for Marxist party in Reagan era, May 30, 2019", "Snopes, Did Bernie Sanders Express Support for Iran During ’79 Hostage Crisis?, Feb. 5, 2020", "New York Times archives, Socialist Vows to Be Capitol Outsider, Nov. 12, 1990", "The Militant, Oct. 24, 1980 issue, accessed Feb. 24, 2020", "The Militant, Nov. 30, 1979 issue, accessed Feb. 24, 2020", "Email interview with Mike Casca, spokesperson for Bernie Sanders campaign, Feb. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]