["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An image taken from video provided by the Russian Defense Ministry showing a Russian bomber dropping bombs on a target in Syria on Dec. 9, 2015. (Russian Defense Ministry Press Service via AP)", "The multi-sided conflict in Syria had already been bedeviling policymakers and diplomats for years by the time Russia began launching airstrikes there on Sept. 30, 2015. But did the United States \"invite\" Russia to pursue this sudden escalation? That’s what New Jersey Gov. Chris Christie said during the Republican presidential debate in Las Vegas.", "\"I'll tell you what reckless is,\" Christie said during the debate on Dec. 15, 2015. \"What’s reckless is is calling Assad a reformer. What reckless is allowing Russia to come into Crimea and Ukraine. What reckless is is inviting Russia into Syria to team with Iran. That is reckless. And the reckless people are the folks in the White House right now. Barack Obama and Hillary Clinton are the reckless people.\"", "This statement includes a lot of charges by Christie. But for this fact-check, we’ll zero in on Christie’s claim that the Obama administration invited Russia into Syria.", "Russia’s airstrikes", "The situation in Syria is complex, but we’ll start by trying to offer a concise summary.", "Syrian rebels -- some considered moderates, some considered extremists -- have been trying for several years to topple Bashar Assad whose family has run the country in authoritarian fashion for decades. The chaos has contributed to the rise of ISIS, which has effectively seized control of portions of Syria, including Raqqa, the city ISIS is using as its \"capital.\"", "Most of the world has no love for the Assad government, but Syria has long relied on two countries for support -- Iran and Russia. Russia’s ties to Syria include a leased naval base, which is Russia’s only Mediterranean port and thus a crucial geopolitical asset. Russia has generally supported Assad, but until recently, Russia’s military role in Syria had been fairly low-profile. By contrast, since the ISIS threat became clear, the United States -- along with a coalition of more than 60 countries -- has been taking an active military role in Syria. For the United States and a few other allies, that has meant launching airstrikes against ISIS targets.", "The longstanding U.S. position regarding Russia and Syria has been to convince Russia to forgo its support for Assad.", "For instance, in a Sept. 11, 2015, town hall at Ft. Meade in Maryland -- about two and a half weeks before Russian airstrikes began -- Obama took note of Russia’s efforts to send military advisers and equipment to Syria.", "\"That won't change our core strategy, which is to continue to put pressure on ISIL in Iraq and Syria, but we are going to be engaging Russia to let them know that you can't continue to double-down on a strategy that’s doomed to failure,\" Obama said. \"And if they are willing to work with us and the 60-nation coalition that we've put together, then there’s the possibility of a political settlement in which Assad would be transitioned out and a new coalition of moderate, secular and inclusive forces could come together and restore order in the country.\"", "White House Press Secretary Josh Earnest echoed that in a press briefing on Sept. 24, less than a week before Russia began its airstrikes. Earnest was asked by a reporter, \"Where do we stand in terms of possible U.S.-Russian military cooperation on Syria?\"", "Earnest responded, \"President Obama will make clear once again that Russia doubling down on their support for the Assad regime is a losing bet. The likely consequence of them doing so is only to deepen and expand the ongoing crisis in that country that doesn’t serve the interests of either the Russian people or the American people. President Obama will encourage President Putin to consider constructive contributions to the ongoing counter-(ISIS) effort. There are more than 60 nations that are involved in implementing a strategy to degrade and ultimately destroy ISIL, and we’d like to see the Russians make a constructive contribution to that ongoing effort.\"", "If you squint, it’s possible to see an \"invitation\" for Russian military intervention in Earnest’s comment. However, the administration has couched this \"invitation\" in diplomatic terms, focusing on a broad effort to promote a peaceful end to the crisis rather than a desire for Russia to start bombing away.", "Moreover, the immediate aftermath of the first airstrikes suggests that the administration was not happy -- at all -- to learn about the escalation to airstrikes ordered by Russian President Vladimir Putin.", "Shortly after the airstrikes became public, Defense Secretary Ashton Carter called Russia’s move tantamount \"to pouring gasoline on the fire.\" The same day, Deputy Defense Secretary Robert Work told members of the House Armed Services Committee that the United States was \"alarmed\" by the beginning of Russian airstrikes. He called it \"an aggressive action by Russia.\"", "Immediately after the Russian airstrikes began, Earnest said the United States was continuing to encourage \"constructive\" moves by Russia but expressed skepticism about its recent military actions.", "\"If Russia is willing, we would welcome their constructive contribution to this effort,\" Earnest said in his Sept. 30 briefing. \"The fact that they have not decided to make a constructive contribution to our counter-(ISIS) effort means that Russia is not doing exactly what we would like them to do in Syria, and that’s not unusual in the relationship between our two countries. … Obviously, we would like to see Russia do something different. I’m not trying to suggest to you that this is what we would like to see Russia do.\"", "What the experts say", "When we checked with diplomatic and regional experts, they generally agreed with the White House that Christie’s words -- if taken literally -- were inaccurate.", "\"Russia decided to intervene in Syria on its own. There was no U.S. invitation,\" said Barnett R. Rubin, director and senior fellow at New York University’s Center on International Cooperation.", "\"No, Obama did not invite Russia into Syria. Just wrong,\" said Bruce Riedel, a senior fellow at the Brookings Institution.", "Joshua Landis, director of the Center for Middle East Studies at the University of Oklahoma, agreed.", "\"It isn't true,\" Landis said. \"The United states tried to oppose Russia moving aircraft and weaponry into Syria. The U.S. government convinced Greece and other countries to close its airspace to Russian planes. Russia flew over Iran and Iraq, which allowed the Russian resupply planes to overfly them. The U.S. could have attacked the Russian planes and ships and did not. I presume Chris Christie is confusing that with an invitation.\"", "The Christie campaign doesn’t contest the idea that Christie’s claim isn’t literally true. Instead, the campaign argues that the administration’s fault was one of omission rather than commission.", "\"The governor was suggesting that the president's actions or lack thereof invited Putin to fill the vacuum left by a lack of leadership, not that he sent a written invitation,\" said Mike DuHaime, a senior strategist with the Christie campaign.", "At least one expert said DuHaime’s argument has some validity.", "\"I don’t think Christie meant it to be taken literally,\" said Daveed Gartenstein-Ross, a senior fellow at the Foundation for Defense of Democracies. \"Obviously we did not invite Russia in. But what I think he’s very clearly referring to is a weakness that led to Russia coming in. The fact that the administration has had an awful Syria policy has moved beyond a matter of opinion.\"", "The Christie campaign also pointed us to a comment Christie made to CNN’s Jake Tapper on Oct. 8 in which he explains that by the \"invitation\" he means the cooperation between the United States and Russia on removing chemical weapons from Syria in 2013.", "Obama \"invited Putin in to broker an agreement with Assad to give up his chemical weapons, which Assad has not done,\" Christie told Tapper. \"Once you invite Putin in for that part of it, you can't then pick and choose given the Obama approach what you do. So he did invite him in, Jake. And it was wrong.\"", "Our ruling", "Christie said the Obama administration \"invit(ed) Russia into Syria.\"", "We found wide agreement that the statement, if taken literally, is inaccurate. However, another interpretation -- that the Obama administration’s policy failures created a vacuum that Putin filled militarily -- has some validity, experts say. We rate the statement Mostly False.", "https://www.sharethefacts.co/share/57ffb42c-34aa-4359-b2ca-90dd626043f3", "Chris Christie, comments at the CNN Republican presidential debate in Las Vegas, Dec. 15, 2015", "White House, remarks by the president in a town hall at Ft. Meade, Md., Sept. 11, 2015", "White House, press briefing by press secretary Josh Earnest, Sept. 24, 2015", "White House, press gaggle by press secretary Josh Earnest aboard Air Force One, Sept. 29, 2015", "White House, press briefing by press secretary Josh Earnest, Sept. 30, 2015", "White House, press conference by the president, Oct. 2, 2015", "The Guardian, \"US accuses Russia of 'throwing gasoline on fire' of Syrian civil war,\" Sept. 30, 2015", "BBC, Syria timeline, accessed Dec. 18, 2015", "Reuters, \"U.S. 'alarmed' Russia launched Syria air strikes without prior talks: official,\" Sept. 30, 2015", "Email interview with Barnett R. Rubin, director and senior fellow at New York University’s Center on International Cooperation, Dec. 16, 2015", "Email interview with Bruce Riedel, senior fellow at the Brookings Institution, Dec. 16, 2015", "Email interview with Daveed Gartenstein-Ross, senior fellow at the Foundation for Defense of Democracies, Dec. 16, 2015", "Email interview with David Schanzer, director of the Triangle Center on Terrorism and Homeland Security at Duke University, Dec. 16, 2015", "Email interview with Joshua Landis, director of the Center for Middle East Studies at the University of Oklahoma, Dec. 17, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]