["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton says that Donald Trump’s favorite defense line if he’s losing is to claim the process is rigged. He’s made the accusation several times so far during the 2016 presidential election.", "But he also said it when his reality TV show The Apprentice didn’t win an Emmy in 2012, 2013 or 2014.", "\"There was even a time when he didn't get an Emmy for his TV program three years in a row and he started tweeting that the Emmys were rigged,\" Clinton said Oct. 19 at the third and final presidential debate.", "We decided to examine Trump’s Twitter feed to see what he had to say.", "In the case of the Emmys, Trump clearly does a lot of whining about not winning.", "April 29, 2013: \"I should have many Emmys for The Apprentice if the process were fair-in any event, it's not my day job.\"", "Sept. 24, 2012: \" 'Amazing Race' winning an Emmy again is a total joke. The Emmys have no credibility -- no wonder the ratings are at record lows.\"", "Sept. 22, 2013: \"The Emmys are soooooo boring! Terrible show. I'm going to watch football! I already know the winners. Good night.\"", "March 2, 2014: \"Which is worse and which is more dishonest - the #Oscars or the Emmys?\"", "Sept. 24, 2012: \"The Emmys are all politics, that's why, despite nominations, The Apprentice never won--even though it should have many times over.\"", "Jan. 14, 2013: \"According to many, and while nominated, I would have won the Emmy many times except for my politics. @PrimetimeEmmys.\"", "Sept. 22, 2013:  \"#CelebApprentice should be part of the Emmys nominations! Pure politics!\"", "That’s a lot of angst. But Trump never directly says the Emmys process is rigged in the way he has characterized the U.S. election system.", "In most cases, Trump is complaining that politics plays a role in deciding who wins, which is not a particularly surprising assertion when it comes to the selections made by award shows, or by voters trying to decide whom to pick for United States president for that matter.", "Our ruling", "Clinton said, \"There was even a time when (Donald Trump) didn't get an Emmy for his TV program three years in a row and he started tweeting that the Emmys were rigged.\"", "Trump never directly makes that accusation. He calls the system unfair and political, but he doesn’t go as far as to allege that the process is being rigged or tampered.", "We rate Clinton's claim Half True.", "https://www.sharethefacts.co/share/2b1d7f48-b399-4796-980c-d228a6cb2dca", "The Washington Post, \"The final Trump-Clinton debate transcript, annotated,\" Oct. 19, 2016", "Email, Josh Schwerin, spokesman, Hillary Clinton campaign, Oct. 19, 2016", "AmericaBlog.com, \"Trump says the election was rigged . . . when he didn't win an Emmy,\" Oct. 16, 2016", "PoliticsUSA, \"Donald Trump Whined the Emmys Were Rigged Too — Three Years in a Row,\" Oct. 17, 2016", "Emmys.com, \"Infographic: How an Emmy is Won,\" Aug. 2, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]