["Cobb made her statement during a protest outside Planned Parenthood's Richmond office. (AP Photo)", "At a recent protest outside Planned Parenthood’s office in Richmond, several hundred anti-abortion activists heard accusations that Gov. Terry McAuliffe is refusing to enforce many abortion laws.", "Victoria Cobb, president of the Family Foundation -- a socially conservative lobbying and public interest group -- made the charges in a speech. She said McAuliffe, a Democrat, is ignoring the laws as payback to the \"abortion industry\" for contributing to his 2013 campaign.", "Records from the Virginia Public Access Project show that abortion rights groups, led by Planned Parenthood, backed McAuliffe with nearly $1.8 million in contributions.", "Among Cobb’s accusations was this:", "\"Inspections of abortion centers around Virginia have found multiple violations of state parental consent laws but, because it’s the abortion industry, Governor McAuliffe and his administration have done nothing.\"", "Fact-checking Cobb’s statement requires two determinations: Have inspections turned up \"multiple violations\" of the parental consent law for abortions on minors and, if so, did the McAuliffe administration do \"nothing\"? Let’s start with some background.", "For many years, Virginia abortion clinics were regulated under the general category of \"physicians offices,\" and the Virginia Department of Health Professions inspected them only for cleanliness or in response to a complaint.", "That changed after the General Assembly in 2011 passed a bill -- signed by then-Gov. Bob McDonnell, a Republican -- requiring that the clinics adhere to hospital standards.", "Regulations passed later that year by the State Board of Health required that all clinics receive at least one unannounced inspection every two years to determine if they were complying with building codes and a variety of rules regarding medical treatment, sanitation, drug storage and record-keeping.", "When violations are found, the administrator of the clinic is required to implement a plan of correction within 30 days. The Virginia Department of Health may suspend or revoke a clinic’s license if it determines the facility is \"permitting, aiding or abetting\" illegal abortions.", "The inspections began in 2012, and among the checklist items is determining whether clinics are following Virginia’s parental consent law that requires physicians, before performing an abortion on an unemancipated minor, to receive notarized permission from a parent or legal guardian, or an order from a judge.", "Inspectors randomly pull the files of three or four minors who received abortions at each center to see whether the requirement is being followed, said Erik Bodin, director of licensure and certification for the Virginia Department of Health.", "There were 20 abortion clinics in Virginia when the inspection program began. Today, there are 18.", "Chris Freund, spokesman for the Family Foundation, backed Cobb’s statement by referring us to the inspection reports of three clinics that have been cited for not following parental consent mandates. Let’s explore these citations and see what, if any, corrective action was taken.", "Roanoke Medical Center for Women", "On Dec. 18, 2012, inspectors found violations in three of four records of minors they pulled. In one case, no parental consent record was found for a 16-year-old who received an abortion. An unidentified staff member at the clinic said, \"I don’t know how it slipped through the cracks.\"", "In the other two cases, consent letters were on file, but they were not notarized and, therefore, did not properly validate the relationship between the patient and her parent or guardian. Inspectors demanded an immediate correction plan, and the administrator of the clinic obtained certification as a notary public and installed a system of checks to make sure all records are in order before minors get abortions.", "A March 27, 2013, inspection found the corrections had been carried out. Although the Family Center sent us the original report, it should be noted that all of these actions occurred under McDonnell’s administration, which ended in January 2014.", "Charlottesville Medical Center for Women", "Three records of minors were reviewed during a July 9, 2014, inspection. Two of the consent forms were notarized but had no notary seal. A staff member reported \"he/she left the official notary stamp in Richmond,\" according to the citation.", "The clinic’s administrator promised to correct the problem by having more staff members certified as notaries to ensure a seal always is on hand and by improving the review of patients’ charts before abortions are performed.", "A subsequent unannounced inspection on Oct. 8, 2014, found no deficiencies with the center’s parental consent procedures.", "Planned Parenthood Metro Washington-Falls Church", "A review of electronic records on Oct. 30, 2014, found no parental or guardian consent signature for a 17-year-old who had received an abortion six months earlier.", "A staff member told inspectors the clinic had experienced \"a problem with the system capturing electronic signatures,\" according to the citation. The administrator promised to create special red files and electronic checklists for minors to ensure required steps are carried out before abortions.", "Bodin said the clinic has not been re-inspected, because the violations there \"did not require a revisit.\"", "Our ruling", "Cobb said, \"Inspections of abortion centers around Virginia have found multiple violations of state parental consent laws but, because it’s the abortion industry, Governor McAuliffe and his administration have done nothing.\"", "Inspections since McAuliffe took office in 2014 have turned up consent problems in two of the state’s 18 abortion clinics. Inspectors found one instance where there was no record of parental or guardian consent for a minor who had received an abortion.  And there were two instances when the consent forms were not properly notarized.", "Some might say that the cited problems have been few and accidental. Cobb is technically correct in using the term \"multiple violations.\"", "But Cobb’s claim that McAuliffe did \"nothing\" about the violations doesn’t hold up. The Department of Health followed state regulations by requiring both clinics to adopt procedures to prevent the violations from recurring. The department followed up with an unannounced re-inspection at one of the facilities.", "The response largely was identical to actions taken under the previous governor, McDonnell, when inspectors in 2012 found a Roanoke clinic had given abortions to one minor for whom there was no parental consent record and to two minors whose forms were not notarized.", "On the whole, Cobb’s statement contains an element of truth, but it ignores critical facts that would give a different impression. That makes it Mostly False.", "Victoria Cobb, Speech at protest of Richmond Planned Parenthood, Aug. 22, 2015.", "Email from Chris Freund, Vice president of government relations and communications for The Family Foundations, Sept. 2, 2015.", "The Family Foundation, Abortion center inspection reports, accessed  Sept. 2, 2015.", "Virginia Department of Health, Inspection reports for Charlottesville Medical center for Women, July 10, 2014 and Oct. 8, 2014.", "Virginia Department of Health, Inspection record for Planned Parenthood of Metro Washington - Falls Church, Oct. 31, 2014.", "Virginia Department of Health, Inspection records for the Roanoke Medical Center for Women, Dec. 19, 2012, March 27, 2013 and July 2, 2014.", "Virginia Department of Health, Inspection records for A Tidewater Women’s Health Clinic, Aug. 25, 2014.", "Interview with Erik Bodin, director of licensure and certification for the Virginia Department of Health, Sept. 9, 2015.", "Code of Virginia, \"16.1-241: consent for abortion,\" accessed Sept. 2, 2015.", "Virginia Public Access Project, McAuliffe donations from single-issue groups, assessed Sept. 10, 2015.", "Interviews with Michael Kelly, director of communications for Virginia Atty. Gen. Hark Herring, Sept. 10, 2015.", "Richmond Times-Dispatch, \"Hundreds protest in Richmond at Planned Parenthood Clinic,\" Aug. 23, 2015.", "PolitiFact Virginia, \"Susan B. Anthony List says new Virginia regulations put abortion clinics on par with dental offices,\" April 28, 2013.", "Legislative Information System, SB 924, signed March 26, 2011.", "Legislative Information System, \"Regulations for licensure of abortion facilities,\" accessed Sept. 10, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]