["The graphics show a “COVID-19 Carrier” in three different scenarios, saying that if the carrier does not wear a mask and a nearby person does, the risk of contagion is 70 percent.", "If the carrier wears a mask and a nearby person does not, the risk is five percent, and if both the carrier and the nearby person wear a mask, the risk is 1.5 percent, they say.", "Some graphics also include the message “WEAR IT.”", "Posts making the claim have been shared on Facebook here, here and here, on Instagram here and here, and on Twitter here.", "Dr. Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas at Austin, explained that while the relative order of risk shown in the graphic is correct, “the actual numbers will depend on a number of factors, including amount of virus shed by the case or carrier, distance between the two individuals, type of mask material, fit of the mask.”", "Too many variables and a lack of experimental data -- except in hospital settings with standardized masks -- make the risk of contagion hard to calculate, Payne told AFP by email.", "“I don’t think there are reliable numbers on how much protection a face mask provides,” she said.", "But “the probability of spread is highest if the carrier or case is not wearing a mask and lowest if both the carrier and contact are masked,” Payne said.", "“Not all masks are created equal,” said Dr. Brandon Brown, associate professor at the University of California, Riverside School of Medicine.", "“We don’t know the transmission percentages and protection provided for against COVID-19 for any specific mask, but we do know that N95 is the gold standard,” Brown said in an email, referring to masks that the US Centers for Disease Control and Prevention says are “critical supplies” that should be reserved for health care workers.", "A similar graphic shared hundreds of times in South Africa (here and here) claims that sponge masks and cotton or cloth masks are “useless fashion”.", "However, the CDC recommends that the general public use cloth masks to slow the spread of the novel coronavirus, which has killed more than 251,000 people worldwide. Simple cloth coverings can help prevent transmission for those who don't know they are infected, the website says.", "Dr. John Criscione, professor of biomedical engineering at Texas A&M University, researched solutions for mask shortages by testing common household items such as air filters, pillow cases, shower curtains and vacuum bags.", "While the graphics shared on social media may not provide an accurate assessment of the exact risk, the point rings true that COVID-19 carriers should wear a mask, Criscione says: “Any covering is better than no covering at all.”", "AFP Fact Check has debunked more than 400 examples of false and misleading information about the novel coronavirus. You can find the complete list of our fact-checks on the topic in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]