["A Facebook post published on April 4, 2020 has been viewed more than 1,900 times and shared 62 times. The video caption reads: “81 days lockdown wat the hell (sic).”", "The video has been shared here and here on other Facebook posts -- it’s also been adopted as a text post from a fake Ramaphosa Facebook page.", "The clip shows the logo of South African broadcaster News24, giving credibility to the misleading video. However, the media company has refuted the misleading video as false.", "“The clip was created by manipulating an old News24 video. This video clip is fake,” the broadcaster said in a post on its verified Facebook page on April 6.", "The original video shows Ramaphosa speaking about students and teachers who were repatriated by South Africa after spending almost two months in lockdown in Wuhan, China.", "\"The experience of these South Africans who returned from Wuhan should give us the courage to carry on with the lockdown that the government has decided on; they were able to go through an 81-day lockdown,” Ramaphosa said during an address to the nation on March 30, 2020, four days after South Africa’s confinement period began.", "Ramaphosa addressed the nation on March 23 to announce the 21-day lockdown. There has been no announcement of a lockdown extension on any of his official platforms.", "President @CyrilRamaphosa briefs the nation on escalation of measures to combat the #COVID19 pandemic #CoronaVirusSA https://t.co/8eKVRg2x84", "Ramaphosa defended the three-week lockdown earlier this week, saying an assessment would be done in the coming days.", "\"We will be able to make a proper scientific assessment in a few days time to see how well this lockdown is serving the people of our country,\" he said.", "On April 7, South Africa had recorded a total of 13 deaths to COVID-19, with 1,749 people infected.", "For updates, follow the presidency’s official Facebook and Twitter pages, as well as Ramaphosa’s verified Twitter account.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]