["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In November 2020, as news broke that a vaccination for COVID-19 was being prepared for distribution, a rumor started circulating on social media that the pharmaceutical company GlaxoSmithKline owned a laboratory in Wuhan, China -- the Wuhan Institute of Virology -- where conspiracy theorists falsely maintain the COVID-19 pandemic originated.", "This rumor, which reads like a game of six-degrees of separation, attempts to trace a line from GlaxoSmithKline, to the Wuhan Institute of Virology, to the pharmaceutical company Pfizer, to billionaire philanthropist and frequent right-wing boogeyman George Soros, and, in some iterations of this rumor, to Microsoft CEO Bill Gates.", "Here's one version of the rumor that was posted to Twitter:", "This tweet reads: \"The Chinese biological laboratory in Wuhan is owned by Glaxo! Who, by cnance [sic], owns Pfizer! (the one who produces the vaccine!) Which, by chance, is managed by Black Rock finances. Who, by chance, manages the finances of the Open Foundation Company (SOROS FOUNDATION)!\"", "This nonsensical game of connect the dots starts with a false assertion. The pharmaceutical company GlaxoSmithKline does not own the Wuhan Institute of Virology.", "The Wuhan Institute of Virology — a research lab in China that has been the center of conspiracy theories since the beginning of the COVID-19 pandemic — is operated by the Chinese Academy of Sciences (CAS), and is funded, in large part, by the Chinese government. It is not owned by GlaxoSmithKline or any other private company.", "\"Over the past 40 years, half of its income has come directly from central-government investment; the rest has been from competitive funding or technology transfer. CAS could not develop without the funding and support of the central government.\"", "It's also false to say that GlaxoSmithKline owns the pharmaceutical company Pfizer.", "While these two companies share some common interests — in 2018, they announced a joint venture that combined their consumer health businesses — they remain two distinct companies. The Wall Street Journal reported at the time:", "Pfizer Inc. and GlaxoSmithKline PLC plan to combine their consumer health-care units and eventually spin off the joint venture, creating the world’s largest seller of drugstore staples like Advil and Sensodyne toothpaste.", "The deal, announced Wednesday, will free up both companies to concentrate on prescription medicines, which tend to be more profitable if also higher risk.", "The joint venture represents an unexpected conclusion to a yearlong process by Pfizer to shed its consumer business, as it and other pharmaceutical companies focus on higher-margin prescription drugs. While Glaxo has shared that focus, the British drugmaker had remained committed to its consumer business, which its chief executive led before her promotion to the top job last year.", "This joint venture, however, did not involve one company buying the other.", "This rumor appears to have been created with the intent of stirring up confusion and skepticism over the COVID-19 vaccine by connecting pharmaceutical companies to a laboratory in Wuhan, China. GlaxoSmithKline, however, does not own the Wuhan Institute of Virology. Furthermore, claims that COVID-19 was \"manufactured,\" or that it \"escaped from\" this Chinese lab, are nothing more than baseless conspiracy theories.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]