["About this rating", "In May 2016, the web site Real News Right Now reported that the Portland City Council had voted to allow members of the \"furry\" community the ability to use dog parks in the same manner as actual dogs:", "Portland’s city council on Wednesday voted 3 to 1 in favor of the Equal Use Act, a new resolution granting individuals who identify as furries the same rights afforded to dogs and their respective owners who frequent popular off-leash areas and dog parks in the greater Portland area.", "The decision comes on the heels of a four-day sit-in organized by PDX Furs, a regional furry community based in the Portland metro area, which staged the protest at Portland’s city council offices on Milwaukie Avenue last weekend. “This is a huge victory,” said Bo Kirkman. “Not just for furries here in Portland but furries living all across the United States.”", "The story is false: no such vote took place, and there is no such thing as the \"Equal Use Act,\" which the post promoted as the impetus for the decision. The story also attributed invented quotes to city council member Amanda Fritz and Mayor Charlie Hales.", "The \"furry\" story is par for the course for Real News Right Now, a humor site which bills writer R. Hobbus J.D. as a winner of \"three Nobel Peace Prize nominations\" and recognition from \"the prestigious Stephen Glass Distinction in Journalistic Integrity,\" a nod to the former New Republic reporter who was exposed as a serial fabricator in 1998.", "\"Hobbus's\" website has also reported that President Donald Trump planned to reinstate a U.S. military draft, and that right-wing radio host Alex Jones was taken from a Texas Starbucks coffee shop by \"shapeshifting reptilians.\"", "Bizziger, Buzz.   \"Shattered Glass.\"\r\n  Vanity Fair.   September 1998.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]