["About this rating", "Editors' Note: Snopes reviewed Judy Mikovits' court case and debunked several of her claims in a piece written by Alex Kasprak in 2018. After the \"Plandemic\" video went viral in May 2020, an outpouring of reader inquires prompted us to add to our reporting in the interests of ensuring that search engines connect readers with the full story.", "In the midst of the COVID-19 coronavirus disease pandemic, millions of viewers in America and elsewhere were exposed in May 2020 to a 22-minute installment from the forthcoming film \"Plandemic,\" a conspiracy-based \"documentary\" holding that (as synopsized by The Washington Post) \"doctors and experts shaping public policy in response to the novel coronavirus pandemic have silenced dissenting voices and misled the public for sinister reasons.\"", "The primary (and virtually sole) source offered by filmmaker Mikki Willis for the contentions made by the movie in that 22-minute installment is Judy Mikovits, who over the course of the segment spins a tale of a government conspiracy led by Dr. Anthony Fauci, who has served as the director of the National Institute of Allergy and Infectious Diseases since 1984 and has been the prominent public face of the White House Coronavirus Task Force.", "That one installment of \"Plandemic\" offers far too many bits of misinformation to debunk in a single fact check, so we'll start here by attempting to unpack the introduction of Mikovits the film offers in its opening in an attempt to establish her as a credible expert voice.", "The installment opens with the following voice-over narration describing Mikovits' background, then segues into a Q&A dialog between Willis and Mikovits:", "Dr. Judy Mikovits has been called one of the most accomplished scientist of her generation. Her 1991 doctoral thesis revolutionized the treatment of HIV/AIDS. At the height of her career. Dr. Mikeovits published a blockbuster article in the journal Science. The controversial article sent shockwaves through the scientific community, as it revealed that the common use of animal and human fetal tissues were unleashing devastating plagues of chronic diseases. For exposing their deadly secrets, the minions of Big Pharma waged war on Dr. Mikovits, destroying her good name career and personal life.", "Now, as the fate of nations hang, in the balance, Dr. Mikovits is naming names of those behind the plague of corruption that places all human life in danger.", "\"So you made a discovery that conflicted with the agreed-upon narrative?\"", "\"Correct.\"", "\"And for that they did everything in their powers to destroy your life?\"", "\"Correct.\"", "\"You were arrested?\"", "\"Correct.\"", "\"And then you were put under a gag order.\"", "\"For five years, if I went on social media, if I said anything at all, they would find new evidence and put me back in jail. And it was one of the few times I cried, and it was because I knew there was no evidence the first time, and when you can unleash that kind of force to force someone into bankruptcy with a perfect credit score. And so that I couldn't bring my 97 witnesses, which included the heads, Tony Fauci and Ian Lipkin, the heads of public health in HHS, who would have had to testify that we did absolutely nothing wrong.\"", "\"And so what did they charge you with?\"", "\"Nothing.", "\"But you were in jail.\"", "\"I was held in jail with no charges. I was called a fugitive from justice. No warrant, literally drug me out of the house. Our neighbors are looking at 'What's going on here?' You know, they search my house without a warrant, you literally terrorize my husband for five days, they said if you don't find the notebooks, if you don't find the material -- which was not in my possession but planted in my house as if you took intellectual property from the laboratory -- it was intended to appear as if I took confidential material, names, and intellectual property from the laboratory and I could prove beyond a shadow of a doubt that I didn't. Heads of our entire HHS colluded and destroyed my reputation, and the Department of Justice and the FBI sat on it and kept that case under seal, which means you can't say there's a case or your lawyers are held in contempt of court. So you can't even get a lawyer to defend you. So every single due process right was taken away from me, and to this day remains the same. I have no constitutional freedoms or rights.\"", "The \"blockbuster article\" of Mikovits' that this opening refers to was a paper published in the journal Science in 2009 that seemingly tied chronic fatigue syndrome (CFS) to a retrovirus called XMRV -- a finding that, if true, could be a boon to developing treatment for CFS patients. But \"Plandemic\" makes absolutely no mention of the fact that, as we detailed in a previous article here at Snopes.com, other scientists couldn’t replicate the results of the study, mounting evidence suggested that Mikovits' findings were actually the result of lab contamination, questions arose over whether Mikovits' had misrepresented data, and in December 2011 the editors of Science retracted the paper in full, saying they had \"lost confidence in the Report and the validity of its conclusion.\" Chicago Tribune reported in 2011:", "Not long after she arrived [at WPI], Mikovits' team announced a breakthrough. The scientists said they had found evidence of a retrovirus called XMRV significantly more often in the blood of patients diagnosed with CFS than in blood from healthy peers. The journal Science published their paper online Oct. 8, 2009.", "But as the [Chicago] Tribune reported, Mikovits and others quickly galloped ahead of the findings, which had not been replicated by other scientists. Though she lacked published data to back her up, Mikovits began tying XMRV to autism and other mysterious disorders. A lab offered an XMRV blood test. Patients took antiretroviral drugs meant for HIV patients.", "At the same time, other scientists began reporting that they could not find evidence of the retrovirus in the blood of patients with CFS — or in anyone else's. Researchers wondered publicly whether lab contamination could explain Mikovits' results, and one scientific team published evidence that XMRV was, indeed, a lab contaminant.", "Mikovits vehemently denied contamination had occurred and attacked scientists unable to replicate her findings. \"Some are not trying in completely good faith,\" she said in a 2010 interview with the Tribune.", "Then, a study published in September [2011] showed that the WPI could not reliably find evidence of XMRV in the blood of patients. On Sept. 29, WPI fired Mikovits, according to court filings, and Science said a few days later that it was investigating allegations of data manipulation.", "\"Plandemic\" also grossly misrepresents events that occurred shortly before and after the retraction of Mikovits' paper by Science, presenting them as the result of Mikovits' having \"made a discovery that conflicted with the agreed-upon narrative\" -- an act that supposedly made Mikovits the target of a vast conspiracy -- by the ubiquitous and powerful \"they\" -- to \"destroy [her] life.\"", "What \"Plandemic\" doesn't mention was that in September 2011, a few months before Science retracted her paper, Mikovits was fired by her employer, the Reno-based Whittemore Peterson Institute (WPI), for insubordination connected with her refusal to share a cell line with a former collaborator, Dr. Vincent Lombardi (the first author of 2009 Science paper that proposed the XMRV-chronic fatigue link). According to an affidavit provided in subsequent legal proceedings by another WPI employee, Max Pfost, after learning of her firing, Mikovits asked Pfost to remove notebooks and samples from WPI's facility and provide them to her.", "Pfost, who said he \"worked closely\" with Mikovits and \"considered her my boss\" at WPI (and whom Mikovits called her \"assistant\"), stated in his affidavit that he complied with Mikovits' request, and that Mikovits planned to transfer \"grants and research and projects away from WPI based upon the information she [had] stolen\":", "On Sept. 27, 2011, there was a package delivered to the laboratory at WPI from Japan. The package was addressed to Dr. Lombardi. I opened the package and discovered that it contained cell lines that he was not allowed to have according to Mikovits. I called Judy Mikovits and informed her about the cell lines from Japan addressed to Dr. Lombardi. Mikovits informed me that she \"would take care of it.\" I have since been told by Annette Whittemore, the Founder, President, and CEO, that Dr. Lombardi was indeed allowed to use the lines from Japan.", "Judy called [me at home on Sep. 29, 2011] and said she had been fired for insubordination and insolence. She was very angry. She stated that she had had enough of WPI ... She stated that WPI would go down and that I should get out too.", "... [Mikovits] stated that she planned to move the grants from WPI. She stated that she was going to try to move the RO 1 grant and the Department of Defense (DOD) grants and stop the Lipkin study. I expressed some skepticism to Mikovits about whether she could take the research and samples, and stated that Dr. Lombardi would take over the projects and continue on behalf of WPI. Mikovits stated that she was in charge of the research at WPI so technically it was her research and she could move it somewhere else at any time. ... Mikovits gave me the keys to her desk and the keys to her office in order that I could gain access and take the WPI materials for [her].", "Mikovits then directed me to remove samples from the lab at WPI and all the notebooks from WPI containing irreplaceable research and data and provide them to her at a later date. She kept her laptop computer with the information from WPI with her.", "[The next day] I went to WPI to attempt to obtain the samples and notebooks for Mikovits ... I went into Mikovits' office and retrieved the materials ... I took between 12-20 notebooks for Mikovits. I put half of the notebooks in a backpack and carried the remaining [notebooks] out ... I took the notebooks to my car and concealed the notebooks ... I drove the notebooks to my mother's home in Sparks, Nevada, where I stored them in her garage.", "On or about October 16, 2011, Mikovits flew back to Reno for the purpose of retrieving the notebooks and WPI property ... I gave her all of the notebooks I took from WPI ... She informed me that she would store them in a safe location. Mikovits rented another car and drove the notebooks to the Los Angeles area. Mikovits informed me that she was hiding out on a boat to avoid being served with papers from WPI.", "... [Mikovits] has been in contact with Lipkin through others about transferring grants and research and projects away from WPI based upon the information she has stolen.", "The materials that Mikovits asserts in \"Plandemic\" were \"not in my possession but planted in my house\" as part of a conspiracy to make it look like she \"took intellectual property from the laboratory\" are presumably the notebooks and samples that her subordinate attested he took from the WPI lab at Mikovits' direction, after she had been terminated by WPI and locked out of her lab, and subsequently delivered to her.", "In \"Plandemic,\" Mikovits declares that she was arrested without a warrant and \"held in jail with no charges.\" But according to contemporaneous reporting, WPI filed a civil lawsuit against Mikovits to compel the return of their \"misappropriated property,\" and WPI reported the lab notebooks and other materials as stolen to the police force of the University of Nevada at Reno. Mikovits was subsequently arrested as a fugitive in California (where Pfost said she was \"hiding out on a boat\" to avoid being served in the WPI lawsuit) pursuant to a warrant issued by University of Nevada at Reno police, which listed two felony charges: possession of stolen property and unlawful taking of computer data, equipment, supplies, or other computer-related property.", "Mikovits spent several days in a California jail until she was released following an arraignment hearing upon posting $100,000 bail and promising to return to court for a Nevada extradition hearing. She subsequently surrendered to police in Reno and returned some of the notebooks taken from WPI at that time.", "Mikovits also asserts in \"Plandemic\" that the indefinite conspiratorial \"they\" searched her house without a warrant, yet in her 2014 book \"Plague\" she described three Ventura County (California) Sheriff's deputies arriving at the door \"brandishing a yellow piece of paper\" and informing her that they had a search warrant, and later in that same book she referred to a search warrant for her home in Nevada issued by the Washoe County District Attorney's office. As well, in \"Plague\" she mentioned her attorney questioning the court as to \"why Mikovits was arrested on a no bail warrant\" -- thereby describing a specific aspect of the arrest warrant which she maintains did not exist.  (A copy of the California search warrant, which includes reference to the existence of a separate arrest warrant, is viewable here.)", "Although the criminal charges against Mikovits were eventually dropped, WPI was successful in civil court, obtaining an injunction preventing Mikovits from altering or distributing misappropriated materials and requiring her to return them to WPI. When Mikovits failed to comply with the injunction order \"because of concerns for the safety of patient data,\" WPI submitted a motion for an Order to Show Cause why Mikovits should not be held in contempt of court:", "Mikovits, who is also facing related criminal charges for possessing stolen property, returned some of the notebooks and a laptop after being briefly jailed. But WPI filed an affidavit from a computer expert that said all the files had been recently deleted on the laptop. WPI attorney Ann Hall further asserts that Mikovits returned only 18 of the notebooks, withholding half a dozen more that include experiments done between 2006 and 2009.", "After a flurry of motions were filed by each party, Judge Brent Adams in the Second Judicial District Court in Washoe County ruled in favor of WPI, which fired Mikovits in September for insubordination. In essence, the judge's \"default judgment\" rejected Mikovits's replies to the complaint and upheld all of WPI's claims, which include breach of contract and misappropriation of trade secrets. \"It is so surprising,\" [WPI attorney Ann] Hall says of the judge \"striking\" Mikovits's reply, noting that that the judge emphasized that he had never taken this action in his 22 years on the bench.", "In court documents, Mikovits pled the Fifth Amendment, the right not to testify against yourself. Hall charges that the Fifth Amendment defense \"was overly broad and kind of an abuse of the process.\"", "Hall says it's unclear whether WPI will ever retrieve the property it seeks, and the civil case will now focus on damages.", "It appears from the court docket that the civil case was stayed after Mikovits filed for bankruptcy in September 2012, citing among her unsecured creditors a $15,000,000 debt owed to WPI as damages in connection with the default ruling issued against her in WPI's lawsuit.", "Mikovits’ claims about her research, a conspiracy between \"Big Pharma\" and the U.S. federal government to discredit and destroy her, and her arrest are contradicted by multiple documentary sources (including her own words). But, as Snopes reporter Alex Kasprak noted in his earlier reporting, although she may have lost the support of the scientific community, Mikovits appears to have found a new home in the pseudoscientific conspiracy community.", "Tsouderos, Trine.   \"Hope Outrunning Science on Chronic Fatigue Syndrome.\"\r\n    Chicago Tribune.   7 June 2010.", "Cohen, Jon.   \"Civil Court Rules Against Chronic Fatigue Syndrome Researcher.\"\r\n    Science.   20 December 2011.", "Akst, Jef.   \"Court Rules Against Mikovits.\"\r\n    The Scientist.   21 December 2011.", "Gever, John.   \"Chronic Fatigue Researcher Jailed Following Controversy.\"\r\n    ABC News.   2 December 2011.", "Tsouderos, Trine.   \"Discredited Chronic Fatigue Researcher in California Jail.\"\r\n    Chicago Tribune.   22 November 2011.", "Cohen, Jon.   \"Criminal Charges Dropped Against Chronic Fatigue Syndrome Researcher Judy Mikovits.\"\r\n    Science.   13 June 2012.", "Cohen, Jon.   \"Chronic Fatigue Syndrome Researcher Fired Amidst New Controversy.\"\r\n    Science.   4 October 2011.", "Shepherd, Katie.   \"Who Is Judy Mikovits in ‘Plandemic,’ The Coronavirus Conspiracy Video Just Banned from Social Media?\"\r\n    The Washington Post.   8 May 2020.", "Callaway, Ewen.   \"Institute Claims Victory in Civil Suit Against Judy Mikovits.\"\r\n    Nature.   20 December 2011.", "Kasprak, Alex.   \"Was a Scientist Jailed After Discovering a Deadly Virus Delivered Through Vaccines?\"\r\n    Snopes.com.   8 December 2018.", "Heckenlively, Kent and Judy Mikovits.   Plague: One Scientist's Intrepid Search for the Truth about Human Retroviruses and Chronic Fatigue Syndrome, Autism, and Other Diseases.\r\n    Skyhorse Publishing, 2014.   ISBN 978-1-5107-1394-9.", "Associated Press.   \"Scientist Surrenders in Reno in Research Theft Case.\"\r\n    29 November 2011.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]