["About this rating", "Amid the seemingly increasing number of unproven reports of trafficking in various localities, a Michigan man's account of a \"possible sex traffic operation\" was shared hundreds of times. Jacob Courtad's 5 June 2017 Facebook post detailed his experience with a \"strange man\" at the Grand Traverse Mall in Traverse City:", "This guy with a white curly hair mullet walked past her 5-6 times in circles and kept smiling, I sat down and he walked past us twice and did a circle and sat about 6 tables behind us and kept starring [sic] at her and smiling and constantly on and off his phone. Security guards were in the corner watching him. Eventually he got on his phone and suddenly stood up and walked all the way to the other side of the food court through the tables and looped back to continue on towards the center of the mall. The security guards watched him the whole time and then as he was speed walking out of the food court they followed him. Not sure how long he was there and what happened to get the guards attention but this shit is real and you must keep your eyes peeled for situations like this. To odd not to share with my fellow TC locals and honestly Anyone who reads this.", "Courtad posted a follow-up statement on 8 June 2017:", "Everyone who knows me would agree that I wouldn't make this crap up. Whether it was \"sex trafficking\" or not I or anyone else will never know. I have many friends with kids and loved ones that I care about and if they atleast [sic] thought about this evil crap and talked about it with their children/loved ones then everything beyond that was WELL WORTH my time! Thanks again.", "We were unable to find much information about this specific incident. The mall did make reference to an incident it called a \"complete fabrication\" on its own Facebook page two days after Courtad's initial post, but did not specifically reference it:", "The alleged incident referenced on Social Media is complete fabrication and totally untrue. We reviewed our security footage and checked with the Traverse City Police Department, which confirms this is the case. This “story” has been circulating on many mall Facebook pages throughout the country for the past few weeks in any attempt to create a viral fake news story. We assure you that your safety is our top priority and we have robust measures in place to ensure your well-being. We have reported this user to local authorities and Facebook.", "Local police told us they did not speak to Courtad regarding his post. So while there is no way to refute Courtad's account of the encounter, there also is not enough information to definitively classify it as a trafficking attempt. Cathy Knauf, founder of the Southwest Michigan Human Trafficking Task Force, told us that trafficking itself \"has to have force, fraud, or coercion taking place\" and this incident does not qualify:", "Somebody just following you or smiling at you or looking at you, it may be creepy or it may be uncomfortable but if there's no force, fraud or coercion going on, by definition that's not trafficking.", "She also said that misconceptions abound surrounding the nature of trafficking itself:", "When people tell me, \"Oh I understand trafficking because I saw 'Taken,'\" I say \"Well your dad must be like Liam Neeson.\" Then they laugh and say \"No.\" That's when I say, \"That's about how realistic that movie is to [trafficking].\"", "Local officials have expressed concern in the past, however, that Grand Traverse County is seeing more trafficking activity. County Prosecutor Bob Cooney said in 2015:", "I'll acknowledge that I think there’s more of a problem than I even see with the complaints coming across my desk, just from what I’m hearing from the police officers. I don't think the public is seeing it that much because we just don’t have that many cases where we’re able to prosecute or where we even get a complaint.", "The National Human Trafficking Hotline, which services victims and survivors and is funded in part by the federal Health and Human Services Department, reported 246 trafficking cases out of Michigan in 2016, ranking it seventh in the nation for that type of crime. It also calls the idea that trafficking is invariably tied to \"physical restraint, physical force, or physical bondage\" a misconception:", "Psychological means of control, such as threats, fraud, or abuse of the legal process, are sufficient elements of the crime. Unlike the previous federal involuntary servitude statutes (U.S.C. 1584), the new federal crimes created by the Trafficking Victims Protection Act (TVPA) of 2000 were intended to address “subtler” forms of coercion and to broaden previous standards that only considered bodily harm.", "National Human Tracking Hotline.\r\n   \"Hotline Statistics.\"", "National Human Tracking Hotline.\r\n  \"Myths & Misconceptions.\"", "Northern Express.\r\n  \"Sex Trafficking Slowly Spreading Into Northern Michigan.\"   30 October 2015.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]