["In touting Tampa’s fiscal health, an ad that Mayor Bob Buckhorn’s re-election campaign is running on television says that he \"secured the highest possible bond rating\" for the city.", "Four times this year, credit rating agencies have looked at the city’s finances and \"said, not only is this a well-run operation, it is a superior operation, and our ratings reflect that,\" Buckhorn told PolitiFact Florida in an interview at his office in City Hall on Jan. 13, 2015.", "In September 2014, Standard & Poor's raised its rating on what's considered to be the city's general credit from AA+ to AAA, its highest rating for municipalities. Also in September 2014, Standard and Poor’s upgraded the city's occupational license revenue bonds from AA to AA+.", "In July 2014, Fitch Ratings raised its rating on Tampa's water and sewer bonds from \"AA+\"' to \"AAA,\" its highest rating.", "In November 2014, Moody's Investors Service upgraded its rating on $101.1 million in solid waste bonds from A3 to A2. (Its highest rating is Aaa.)", "Higher ratings let the city hold down costs by borrowing money at lower interest rates. City officials say they also validate difficult choices they've had to make in balancing the budget during the recession and its aftermath.", "But the city has hundreds of millions of dollars in other bonds, including utilities tax bonds, sales tax bonds and special purpose bonds, that do not have the highest ratings assigned by those credit rating agencies. All of them are rated \"investment grade,\" which is better than being rated speculative grade. But for different bond issues, at least some -- and sometimes all -- of the ratings from the three rating agencies are a notch or more below the top.", "In addition, Standard & Poors is the only agency to give its top grade so far to Tampa’s general credit rating. Moody’s rates it Aa1, just below Aaa. Fitch rates it AA, just below its top rating of AAA.", "Buckhorn said it wouldn’t have been possible to summarize all of the city’s bond ratings in a 60-second commercial, but he checked with his chief financial officer to make sure he made the most accurate statement possible. And he acknowledged that Tampa could earn even higher credit ratings on some of its debt.", "\"We strive for that,\" he said. \"So is all of our debt Triple-A? No. I would venture to say there’s probably not a city in America where all of the debt is Triple-A. Is a big portion of our debt Triple-A? You betcha. ... I’m proud and I’ll say it wherever I go. The folks who vote for me should be pretty happy with that.\"", "Buckhorn’s campaign ad said he had \"secured the highest possible bond rating.\" Loking at the campaign’s use of the phrase \"highest possible,\" we find there’s still room for improvement in the ratings on some of the city’s debt. We rate this statement Half True.", "\"Swagger\" television commercial, accessed Jan. 15, 2015", "Interview with Tampa Mayor Bob Buckhorn, Jan. 13, 2015", "Interview with Tampa interim chief financial officer Sonya Little, Jan. 14, 2015", "\"Smarter investments for tomorrow’s Tampa: Recommended Operating and Capital Budget, Part 2, Fiscal Year 2015,\" pages 440-443, accessed Jan. 14, 2015", "Tampa Bay Times, \"Standard & Poor's upgrades Tampa general credit rating to AAA,\" Sept. 12, 2014, accessed Jan. 14, 2015", "Tampa Bay Times, \"Moody's raises credit rating on Tampa's solid waste bonds,\" Nov. 12, 2014, accessed Jan. 15, 2014", "Moody’s Investors Service, \"Rating Update: Moody’s upgrades Tampa Solid Waste Enterprise (FL) to A2 from A3; outlook revised to stable,\" Nov. 10, 2014, PDF accessed via city of Tampa website Jan. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]