["About this rating", "A video purportedly showing a gunman attempting to rob a store, only to be confronted (and shot) by several gun-carrying customers is frequently shared by pro-gun groups on social media with the caption: \"Armed suspect robs convenience store gets shot by every customer inside\":", "The video footage of the incident (which can be glimpsed at the bottom of this article) is real, but it is often shared with incomplete or inaccurate information.", "This incident was captured by a security camera at a pharmacy in Brazil, not the United States. Also, the \"customers\" seen pulling their weapons in this video were actually plainclothes police officers.", "The video comprises security camera footage of an incident that took place on 31 May 2017 at a pharmacy in Itumbiara, a municipality in the southern Brazilian state of Goiás, which resulted in the death of a 17-year-old. Although the video is frequently accompanied with the claim that it shows the teenager being shot by \"every customer,\" a contemporaraneous report from Globo 1 News noted that it was unclear how many officers actually fired their weapons at the robber:", "The crime took place around 9 PM at a pharmacy on Avenida Afonso Pena. The video shows the robber entering the store wearing a helmet. While several customers wait in line, he points his gun at the woman behind the counter.", "From another angle, it is possible to see that one of the policemen notices what is occurring and shoots the young robber, who drops his gun and then falls to the ground.", "According to the PM, a mobile emergency service unit (Samu) went to the scene, but the teenager was already dead. According to the police, he already had a record involving several different crimes.", "In a statement to the G1, the Military Police's communications adviser reported that the four military police officers involved in the case appeared before the police station \"with their respective firearms, which were made available to the competent authority.\"", "According to the Civil Police, the case will be investigated by the 2nd Police District of Itumbiara, and it is not yet known how many police officers shot the youth.", "This security footage (as well as a second angle of the shooting) can be glimpsed in a video news report from Globo 1:", "Curtis, Brandon.   \"Thug Tries to Rob Store Where Every Person Inside Was Armed.\"     Concealed Nation.   8 June 2017.", "G1.   \"Menor é Morto por Policiais à Paisana ao Assaltar Farmácia de Itumbiara; Veja Vídeo.\"     1 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]