["One Facebook post, published here on January 9, claims there had been “180 people so far charged with arson.\" It has been shared more than 600 times.", "Below is a screenshot of the post:", "The misinformation on arson charges related to the bushfires, which have killed at least 27 people and destroyed more than 2,000 homes, was widely reported in the media.", "The figure was published here by The Sun and here by Breitbart, a far-right US news website.", "It was also reported here by The Australian in an article that was shared on Twitter by Donald Trump Jr., the son of US President Donald Trump. The Australian is a newspaper published by News Corp Australia, a company owned by Rupert Murdoch's News Corp.", "Other posts on Facebook were published here and here.", "However, the claim is false.", "Police departments across Australia record bushfire-related offenses differently, with only some states parsing bushfire offences from total fire offences and Victoria not releasing any figures at all. Still, AFP reviewed all the publicly available police statistics and found far fewer than 180 people have actually been charged with arson specifically related to the current bushfires.", "Below is a breakdown of the latest state figures:", "In New South Wales, the state most devestated by recent bushfires, the police did announce that it took legal action against 183 people for bushfire-related offences since November 8, 2019.", "However, just 24 people were charged for “deliberately-lit bushfires,” the police said in this press statement released January 6, 2020.", "The release adds that legal action was taken against 53 people for allegedly failing to comply with a total fire ban and against 47 people for allegedly discarding a lighted cigarette or match on land.", "There is currently no available bushfire related police statistics from Victoria.", "A police spokesperson told AFP by email that data on bushfire arson related offences and charges was only available up until September 2019, and new data would be released in March 2020.", "The Queensland Police Service told AFP in a statement via email on January 10, 2020, that 109 people (36 adults and 73 juveniles) have been dealt with for offences relating to “recklessly and/or deliberately setting fires.”", "These offences include “unauthorised lighting of fires, contravening local fire bans, and endangering property.”", "Under fire bans, the lighting of all fires is prohibited and certain types of fires are restricted.", "As of January 8, 2020, there have been 1,068 reported bushfires in Queensland since September 10, 2019.", "Of these, 114 fires have been deliberately or maliciously lit through human involvement, police said. These fires have been subject to police enforcement action including charging, restorative justice or cautioning, the force said.", "In Western Australia, police told AFP that from November 25, 2019 to January 8, 2020 seven people were charged for deliberately lighting bushfires.", "\"Strike Force Vulcan detectives have charged 5 adults and 2 juveniles with bushfire arson related offences,” a police spokesperson said via email on January 10, 2020.", "South Australia Police told AFP by email on January 10, 2020 that a total of 85 people have been arrested or reported for all fire offences since September 1, 2019. Of that, 10 were arrested for causing “a bushfire intentionally or recklessly.”", "Below is a screenshot of the offences breakdown provided by police:", "A Tasmania Police spokesperson said one person had been charged for unlawfully setting a fire on a total fire ban day on December 30.", "“Bushfire offences generally come under ‘unlawfully setting fire to vegetation’, but this offence can also include less catastrophic fires (ie not limited to bushfires),” the spokesperson told AFP via email on January 10.", "From July 1, 2019 to date, there were 2 charges of the offence, police added.", "An ACT Policing spokesperson told AFP via email on January 14, 2020 that one person had been charged since September 2019 for lighting a grass fire.", "The spokesperson added that from October 1, 2019 to December 31, 2019, another seven people were charged with arson offences, which included \"structure fires, deliberately lit vehicle fires and grass/bushfires.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]