["About this rating", "The town's officials and residents cannot use a planning meeting to criticize Islam or those who practice it. The meeting in question was set by a religious discrimination lawsuit settlement for the purpose of approving a mosque's building permit.", "Private citizens are not barred from discussing Islam.", "On 2 August 2017, the blog American News posted a story reporting that a New Jersey town had prohibited residents from criticizing Muslims or Islam, in keeping with sharia law (a code of behavior conduct practiced by observant Muslims), citing a story posted by the conspiratorial blog World Net Daily (WND).", "Both stories misleadingly feature 2009 photographs from a demonstration against a Dutch politician in London, which is completely unrelated to the events in New Jersey. The American News story reports:", "According to reports from World Net Daily, a New Jersey township that was sued by a group of Muslims for refusing to approve a massive mosque project is now returning to court because of a settlement agreement that restricts anyone from commenting on “Islam” or “Muslims.”", "It’s important to note that a key tenet of Shariah bans any negative comments about the religion. According to the Thomas More Law Center who sued the township on behalf of two residents whose home is within 200 feet of the proposed mega-mosque, the settlement “reads more like an instrument of surrender.”", "The settlements came in May 2017 after the  Islamic Society of Basking Ridge and the Department of Justice sued the township for violating the Religious Land Use and Institutionalized Persons Act of 2000, a law that requires all religious persons and institutions to be treated equally when seeking building permits for places of worship.", "Both American News and WND are referring to a portion of the settlement between ISBR and the local government of Bernards Township in New Jersey, which agreed to pay $3.25 million and allow ISBR to build a mosque on property they already own after four years of public hearings. (The Justice Department also settled separately with the town.)", "The agreement outlines a single Planning Commission meeting in which ISBR's final site plan approval will be discussed and voted upon. Per the settlement, the meeting discussion will be tightly limited to items on the agenda. The meeting will not adjourn until it is complete, and cannot be extended beyond one session, \"even if the hearing must continue beyond 12:00 midnight and into the next day.\" At this hearing, witness testimony is also tightly curtailed, and one of the rules is:", "No commentary regarding Islam or Muslims will be permitted.", "In response to the limitation on discussion of Islam or Muslim people, Thomas More Law Center — a conservative activist law firm — has filed a lawsuit on behalf of two residents who live near the proposed mosque site, Christopher and Loretta Quick, claiming that the limitation on discussion of Islam and Muslims during the planning meeting is a violation of their \"right to engage in constitutionally protected speech at an upcoming public hearing.\" It is on their lawsuit that these stories are based, but they are crafted to lead readers to believe that all city residents are prohibited from any criticism of Islam or its followers. This is untrue.", "We were unable to reach a Bernards Township city official for an explanation as to why the rule was put in place to begin with, but it is generally legally accepted that local governments can reasonably limit public comments at public meetings in the interest of efficiency — although this is periodically the subject of lawsuits challenging the constitutionality of such limitations. What a court will determine about the limitation in this instance is yet to be decided.", "The settlements bring to a close years of hostility surrounding the project's approval process. ISBR officially sought government approval for the mosque in 2012. In intervening years between 2012 and the commission denying their request in 2016, they were subjected to anti-Muslim sentiment both at and outside public meetings in which people accused them of everything from supporting terrorism to animal sacrifice, according to court documents.", "Members of the public have been instructed not to discuss Islam or Muslims during one public meeting prescribed by a legal settlement in which city officials have limited time to consider and approve a project that has a track record of being dragged out for years and also inspiring heated emotions. However there is no over-arching law in Bernards Township \"forbidding\" citizens from criticizing Islam or its followers outside of that one extremely limited setting.", "Further, contrary to the claim made by both publications that sharia bans criticism of Islam, Omar Suleiman, Islamic Studies professor at Southern Methodist University and president of the Yaqeen Institute for Islamic Research told us that if someone berates Islam, verses 6:68 and 4:140 in the Koran urge Muslims to \"simply ignore it\" and walk away until the subject changes. Suleiman also noted that Muslims have historically debated their Christian counterparts and members of other faiths about religion in public settings.", "American News. \"US Town Forbids Citizens From Criticizing Islam Or Muslims… Residents Are Furious.\"\r\n  2 August 2017.", "The Islamic Society of Basking Ridge, et al v. Township of Bernards.\r\n  2016.", "United States v. Township of Bernards, et al.,\r\n  2016.", "Quick et al v. Township of Bernards.\r\n  2017.", "Kennedy, Merrit. \"N.J. Town Must Pay Islamic Group $3.25 Million to Settle Discrimination Lawsuit.\"\r\n  NPR.30 May 2017.", "Laidman, Dan. \"Circuit Upholds City Council's Ejection of Audience Member Based on Nazi Salute Norse v. City of Santa Cruz.\"\r\n  UCLA Law Review.", "Taylor, Adam. \"Dutch Far Right Leader Geert Wilders Tweets a Fake Image of a Rival With a ‘Shariah for the Netherlands’ Sign.\"\r\n  The Washington Post. 6 February 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]