["About this rating", "On 7 October 2016, the web site The People of Lancaster web site published an article reporting that a Weather Channel photographer had captured an image of a dolphin caught in the strong winds of Hurricane Matthew:", "A photographer with The Weather Channel captured the strength and tragedy of severe weather this evening when he photographed a dolphin that was caught in Hurricane Matthew’s winds.", "A dolphin caught in Hurricane Matthew's winds was photographed by a Weather Channel photographer.A dolphin caught in Hurricane Matthew’s winds was photographed by a Weather Channel photographer.", "“I have photographed hundreds of tornados and four hurricanes. I’ve never seen winds so strong that dolphins were blown from the ocean.” said Ernie Schwartz of The Weather Channel.", "<", "People of Lancaster updated their article later in the day, claiming that the photographer had captured a second image of the flying dolphin:", "Neither of these images was real. The first photograph was taken in 2004 and captured the Florida coast during Hurricane Frances. The second photograph was also taken in Florida, but back in 2005 as Hurricane Dennis approached the state. Neither of those pictures originally featured flying dolphins:", "Although The People of Lancaster clearly tagged their article as \"satire,\" these images were circulated outside their original satirical context and led some viewers to believe that dolphins were getting sucked up out of the ocean by the strong winds of Hurricane Matthew.", "The People of Lancaster page posted the first image again almost three years later, in September 2019, with a caption saying the photograph was taken during Hurricane Dorian.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]