["About this rating", "On Jan. 10, 2021, an anecdote went viral on Twitter about a street vendor named \"nah\" who supposedly told a reporter he was selling $100 sweatshirts to \"stupid\" supporters of U.S. President Donald Trump:", "This is a genuine photograph of two people selling Trump merchandise in Washington, D.C. The displayed caption, however, does not capture a genuine exchange between a journalist and these vendors.", "The text below the image originated with an article published on Medium in which the editors of the publication \"Level\" reimagined captions for various photographs that were taken on the day that a pro-Trump mob stormed the Capitol, Jan. 6, 2021. The editors explained in the article's title and opening paragraph that these captions were not factual:", "We Added Some Details to Getty Photos of Those Terrorists Who Stormed the U.S. Capitol", "[...]", "See, most of the captions that come with those photos are minimally descriptive: “Thousands of Donald Trump supporters storm the United States Capitol building following a Stop the Steal rally on January 6, 2021, in Washington, D.C.” The world needs to know who these people are, so we went digging. Are these really their names and circumstances? Nope — but that’s not going to stop us from thinking they are!", "While the viral caption for this picture is not real, the photograph is. It was taken near the U.S. Capitol the day of the insurrection and shows two unidentified vendors selling Trump merchandise. As lamented in the aforementioned article, the real caption on Getty Images does not provide much additional detail about these vendors:", "Street vendors selling President Donald Trump memorabilia are seen on the sidewalk near the U.S. Capitol Building on January 6, 2021 in Washington, DC. A pro-Trump mob stormed the Capitol, breaking windows and clashing with police officers. Trump supporters gathered in the nation's capital today to protest the ratification of President-elect Joe Biden's Electoral College victory over President Trump in the 2020 election. (Photo by Jon Cherry/Getty Images)", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]