["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Instagram post making a political point about abortion in the United States muffs the landing by claiming that no one has died from COVID-19, the disease caused by the novel coronavirus.", "\"Death toll in America,\" the March 1 post says. \"Coronavirus 0, abortion 63,000,000.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Though any count of abortions in the United States can’t be precise, the abortion number seems to be a reasonable estimate. (Read our 2012 fact-check for details.)", "But for COVID-19, the post is simply wrong. As of March 3, there have been nine deaths from COVID-19 in the United States. The Centers for Disease Control and Prevention have reported six deaths on their website while the Seattle Times reported three more deaths that afternoon. The victims were all in Washington state.", "Of course, the Instagram post was published on March 1. But the first death was reported on Feb. 29. Officials announced four more deaths on March 2.", "We rate this Instagram post False.", "Instagram post, March 1, 2020", "Centers for Disease Control and Prevention, Coronavirus disease 2019 (COVID-19) in the U.S., updated March 3, 2020", "Los Angeles Times, The death toll from coronavirus in Kirkland, Wash. — and the United States — rises to six, March 2, 2020", "Oregonian, Man in Washington state first in US to die from new coronavirus, Feb. 29, 2020", "The Washington Post, 15 states treating coronavirus patients as virus death toll in U.S. reaches 6, officials say, March 2, 2020", "The Seattle Times, Seventh Washington state resident’s death linked to coronavirus disease, March 3, 2020", "The Seattle Times, Three more Washington state residents’ deaths linked to coronavirus disease, bringing total COVID-19 fatalities in the state to 9, March 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]