["About this rating", "In April 2018 an image was widely circulated via Facebook and blogs, one which purportedly depicted a man washing aborted fetuses in Brazil in preparation for burial:", "Abortion is generally illegal in Brazil except for a few particular circumstances (e.g., pregnancy resulting from rape, when the life of the woman is at risk, the fetus has a fatal brain disorder), and these posts appear to be co-opted versions of material that originated in Vietnam.", "This same photograph had earlier been distributed as part of a larger set published by the Vietnamese news site Emdep. The text accompanying that set of photographs described a volunteer who ritually washes the remains of aborted fetuses, stillborn births, and/or premature or abandoned infants (the translation is ambiguous) in preparation for burial.", "This information is consistent with other accounts from that part of the world, including news reports indicating that Vietnam has one of the highest abortion rates in the world:", "Between 250,000 and 300,000 abortions are completed across Vietnam every year on average, according to official reports, with the actual number of abortions, including those conducted illegally at private facilities, estimated to be much higher.", "Vietnam ranks first in Asia for abortion, and remains among the countries with the highest abortion rates in the world, the ministry said, citing data from the World Health Organization.", "According to Mai Xuan Phuong, a family planning official from the Ministry of Health, the average age of people’s first sexual intercourse experience in some countries, including Vietnam, has dropped in recent years.", "“Youths having sex without understanding birth control can lead to unintended pregnancies,” Phuong said.", "As well, the Vietnamese news report that published these photographs referenced the volunteers' holding a burial ceremony every two weeks at a cemetery in Doi Coc:", "Even during the winter monsoon, when people are asleep, at the Doi Coc cemetery a group of volunteers works together to bathe the fetuses.", "The ceremony on Sunday, March 20, 2018, drew tears from many witnesses. For Cuong as well as other members of the group, the ceremony was both sad and shocking.", "\"The ceremony included twins and over 600 babies. Every two weeks we do a burial; each month more than 1,000 babies are buried, a terrible number.\"", "\"During the ceremony, both mothers and fathers witnessed the burial of their children. I think if they witness the burial of hundreds of fetuses, it will really awaken their consciences,\" Cuong shared.", "Other local news accounts have described a cemetery in the hamlet of Doi Coc that serves as a resting place for (aborted) fetuses:", "A quiet cemetery in Doi Coc hamlet is similar to any other, but the perfectly lined rows of white tombs hold thousands of abandoned dead foetuses villagers brought back and buried.", "For years, the locals in the hamlet in Thanh Xuan Village in Soc Son District, did not want outsiders to know about their selfless act in finding a resting place for the abandoned foetuses. They said it was simply acting out of sympathy for the unborn.", "But a few months ago, word about the cemetery reached the media. Suddenly, the topic has received a massive attention.", "\"We did not want the focus to be on us,\" said Nguyen Van Thao, who takes care of the cemetery. He was one of the first villagers to become involved in the task. \"We try our very best to make sure that our acts help ease the suffering of these souls.\"", "Volunteers involved with the effort have attributed the necessity of their work to a combination of Vietnam's high abortion rate and the dumping of aborted fetuses by private abortion clinics (which may involve abortions carried out later in term than would otherwise be legally allowed):", "According to Thao, in the year 2000, a local saw an abandoned foetus on the street side — and buried it.", "\"We believe that each has a soul,\" he said. \"They were supposed to be born, but for some reason they were not, but they do not deserve to be abandoned.\"", "Word spread and since then, hundreds of villagers here have repeated the act. Some even travel many kilometres to private abortion clinics to rescue aborted foetuses.", "The task of collecting the unborn babes often starts at dawn. Burials are usually performed in the afternoon.", "The Health Ministry estimates that about 300,000 abortions are carried out for women between 15 and 19 years old each year. But that's only the numbers from public hospitals, not the other 31,000 private clinics in the country.", "Most major public hospitals in Ha Noi bury foetuses after abortions, while many private clinics pay no attention to the issue and dump the little bodies.", "And that might explain why the number of dead foetuses in the village cemetery is rising.", "Emdep.   \"The Tattooed Man Cried As He Picked Up 29-Week-Old Twins at Night.\"\r\n    29 March 2018.", "Tuoi Tre News.   \"Vietnam’s Abortion Rate Among World’s Highest as Contraception Fails.\"\r\n    27 September 2017.", "Wurth, Margaret.   \"Why Brazil Should Decriminalize Abortion.\"\r\n    Human Rights Watch.   28 September 2017.", "Huong Le, Thu.   \"Rising Abortions Stretch Foetus Cemetery.\"\r\n    Viet Nam News.   24 July 2012.", "Buu, Phuoc.   \"Catholics Build Graveyard for Aborted Fetuses.\"\r\n    Viet Nam News.   15 October 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]