["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a May 4 forum that included six gubernatorial candidates, independent Lincoln Chafee was asked by Vanessa Volz, of R.I. National Organization for Women, about the high rate of teen sexual activity, the social and economic costs of teen pregnancy, and whether he would support a bill requiring age-appropriate and medically accurate sex education in Rhode Island's public schools.He said he would.\"I travel around the state visiting senior centers and I was visiting a Central Falls senior center and the Central Falls social agency was in the same building and office. And the social agent that was there said, 'You wouldn't believe the teen pregnancy in Central Falls. It's 53 percent.' Fifty-three percent of teens in Central Falls are getting pregnant,\" Chafee said.Later in his response, he made it clear he wasn't including males in that statistic:\"We talk about the high dropout rate in Central Falls. Well it's obvious. Fifty-three percent of the young women are getting pregnant and have to take care of a child at home.\"But still. Fifty-three percent?So we contacted Chafee's campaign manager, J.R. Pagliarini, who conceded that the statistic, which Chafee has used on more than one occasion, is inaccurate.\"The senator visited Central Falls late last year and was told by a social worker working for the city that the teen pregnancy rate was over 50 percent.  That individual misread page 4 of the attached November 2 press release from Kids Count that stated that 'the teen birth rate among girls ages 15-17 in Central Falls was 59.2 births per 1,000 teen girls, about three times the state rate of 19.1 per 1,000 teen girls ages 15-17.' \"Those numbers translate to 5.92 percent for Central Falls girls 15 to 17 and 1.91 percent statewide.That's about one ninth the rate cited by Chafee during the candidate forum and other appearances.Since then, the Central Falls numbers have gotten worse.  The 2010 Rhode Island Kids Count Factbook reported that the teen birth rate for Central Falls had risen to 6.13 percent while the Rhode Island average had declined to 1.89 percent. When you include 18- and 19-year-olds into the mix, the birth rate is 3.07 percent statewide and 9.55 in Central Falls.And that doesn't include women who were pregnant but never delivered because of abortion or miscarriage.Clearly, Central Falls has a disturbingly high teenage pregnancy rate, but it’s not nearly as high as Chafee has portrayed it. When it comes to getting his numbers right, Chafee fails the pregnancy test. We rate his claim as False.", "Interview, J.R. Pagliarini, campaign manager, Chafee campaign, June 17, 2010Audio tape, May 4, 2010, candidate forum sponsored by the Rhode Island Poverty Institute and Women's Fund of Rhode Island, Lincoln School, ProvidencePress release, Rhode Island Kids Count, Rhode Island Kids Count Presents: Central Falls Data in Your Backyard, accessed June 17, 20102010 Rhode Island Kids Count Factbook, page 81", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]