["About this rating", "U.S. Sen. Elizabeth Warren became the subject of increased scrutiny and rhetorical attacks from the right in January 2019, after she declared she was in the running for the Democratic nomination for president in 2020.", "Against that background, a viral meme re-emerged on social media that attributed an eye-catching viewpoint on abortion to the Massachusetts senator:", "\"'Having an abortion is no different than someone having their tonsils removed.' -- Liberal Democrat Senator Elizabeth Warren. Yes, she really said this and is really this damn crazy and stupid.\"", "In reality, Warren did not make these remarks.", "On 24 July 2018, an opinion column she wrote was published in Marie Claire magazine, one speculating that the confirmation of Brett Kavanaugh as a Supreme Court justice would create a conservative-leaning majority on the court that could bring a reversal of the landmark 1973 Roe v. Wade decision:", "\"The threat of overturning Roe v. Wade is also serious. When abortions are illegal, women don’t stop getting them — they just risk their lives to do it. Today, thanks to Roe, getting an abortion is safer than getting your tonsils out. Before Roe v. Wade, many women turned to back-alley butchers to end their pregnancies.\"", "In September 2018, the pro-life website LifeNews published an article that created a misleading impression of what Warren had actually said under the headline \"Elizabeth Warren Compares Abortion to 'Getting Your Tonsils Out.'\" That article went on to state that \"A pro-abortion Democrat from Massachusetts, Warren even likened the killing of an unborn baby in an abortion to getting tonsils removed.\"", "In January 2019, the right-leaning NewsTarget website went even further in misrepresenting Warren's actual remarks, with an article that carried the headline \"Senator Elizabeth Warren likens an abortion to getting your TONSILS YANKED, because population control freaks think human babies in the womb are just worthless tissue.\"", "Actually, Warren was making a very different point. Her column linked to a Time magazine article about a 2015 study published in the peer-reviewed medical journal Obstetrics & Gynecology. The lead author of that study, Dr. Ushma Upadhyay, told Time that the rate of complications observed after abortion procedures was lower than that seen after wisdom tooth removals and tonsillectomies.", "That's a point Upadhyay has made elsewhere in support of the comparative safety of abortion procedures, and in opposition to laws restricting access to abortion or imposing stricter requirements before a woman can undergo the procedure.", "In an op-ed published by USA Today on 21 January 2019, Dr. Upadhyay wrote:", "\"Advocates of these [restrictive] laws usually use the misconception that abortion is unsafe to make arguments in favor of admitting privileges requirements and other abortion restrictions. In reality, less than one-third of 1 percent of abortions result in a major complication. Abortion is safer than wisdom tooth extraction and tonsillectomy, so it’s clear that these laws aren’t actually about protecting patients. Indeed, my research shows these policies have no observable effects on patient safety.\"", "So when Warren wrote that \"getting an abortion is safer than getting your tonsils out,\" she was making a point about the relative safety of the procedure as part of a broader argument in defense of Roe v. Wade.", "Contrary to the impression created by the LifeNews and NewsTarget articles, Warren was not likening a human fetus to a set of tonsils. Furthermore, the quotation included in the meme that re-emerged in January 2019 was a fabrication: Warren simply did not say, \"Having an abortion is no different than someone having their tonsils removed.\"", "Warren, Sen. Elizabeth.   \"If You're Not Worried About Justice Kavanaugh Overturning Roe v. Wade -- You Should Be.\"\r\n    Marie Claire.   24 July 2018.", "Bilger, Micaiah.   \"Elizabeth Warren Compares Abortion to 'Getting Your Tonsils Out.'\"\r\n    LifeNews.   12 September 2018.", "Wells, S.D.   \"\"Senator Elizabeth Warren Likens an Abortion to Getting Your Tonsils Yanked, Because Population Control Freaks Think Human Babies in the Womb Are Just Worthless Tissue.\"\r\n    NewsTarget.   21 January 2019.", "Oaklander, Mandy.   \"Abortion Complication Rates Are 'Lower Than That for Wisdom Tooth Extraction,' Study Says.\"\r\n    Time.   9 December 2014.", "Upadhyay, Ushma et al.   \"Incidence of Emergency Department Visits and Complications After Abortion.\"\r\n    Obstetrics & Gynecology.   Vol. 125, Issue 1, January 2015.", "Marcotte, Amanda.   \"Abortion Is Extremely Safe: But the Anti-Choice Movement Has Convinced People Otherwise.\"\r\n    Salon.   15 June 2018.", "Upadhyay, Ushma.   \"Abortion Restrictions Can Harm Women. Let's Follow Evidence, Not Ideology, in 2019.\"\r\n     USA Today.   21 January 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]