["By Angelo Fichera and Saranac Hale Spencer", "Posted on September 29, 2020 | Updated on October 1, 2020", "Unsubstantiated posts spreading on Facebook and Twitter claim former Vice President Joe Biden “got tonight’s debate questions in advance” and that he will be wearing an earpiece. There is no evidence for either assertion.", "In the hours before the first presidential debate, baseless and unsubstantiated claims about former Vice President Joe Biden swirled on social media.", "The unfounded assertions included claims that Biden was given the questions ahead of time and that he will wear an electronic earpiece during the debate.", "On Twitter and Facebook on Sept. 29, a conservative radio host pushed a baseless story that Biden was given the questions for the first presidential debate in advance.", "“Word on the street is that @JoeBiden got tonight’s debate questions in advance – per  @KXEL1540,” Todd Starnes wrote in a tweet shared more than 11,000 times.", "An article on his website spreading the claim was shared on Facebook nearly 3,000 times, according to CrowdTangle data. Its sole source was a recent interview conducted with Jerome Corsi, a known purveyor of conspiracy theories and a key figure in Roger Stone’s conviction stemming from the investigation into Russia’s interference in the 2016 election.", "Chris Wallace, a Fox News anchor, is moderating the first debate.", "A Fox News spokesperson rejected the claim, telling FactCheck.org that Wallace had not sent out any questions prior to the debate.", "“This is entirely false and any assertion otherwise is patently absurd,” the spokesperson said in a statement.", "In a Sept. 28 segment about Wallace’s preparation, Fox News’ Martha MacCallum said: “Wallace says his questions for Tuesday night’s high-stakes, primetime matchup will not be shared with either campaign or the debate commission ahead of time.” (3:27)", "The nonpartisan host of the debate, the Commission on Presidential Debates, publicly announced on Sept. 22 that Wallace had selected the topics for the debate. The topics include the records of President Donald Trump and Biden, the Supreme Court, COVID-19, the economy, election integrity and race and urban unrest.", "Two days later, on Sept. 24, Corsi made the unsubstantiated claim about Wallace giving Biden the questions in an interview with KXEL.", "“The information that I’ve just gotten — and I think, well, it’s always been accurate — is that Joe Biden has been given the questions from Fox’s Chris Wallace and he’s being prepared on the exact questions he’s going to be asked,” Corsi said in the interview.", "But Corsi — who also called Biden the “worst presidential candidate in my lifetime” during the interview — provided no evidence or sourcing to support his claim.", "We reached out to Corsi to ask what evidence he had to back up his allegation, but didn’t hear back.", "The Trump campaign added more fuel to the pre-debate frenzy online when it released a statement claiming that Biden had refused to comply with an inspection for electronic earpieces and had requested “multiple breaks.”", "By the end of the day, conservative Facebook pages were rife with baseless memes asserting that the former vice president would actually be wearing an earpiece.", "Biden’s deputy campaign manager, Kate Bedingfield, reportedly called the claim “absurd” on a call with journalists and said, “Of course, he is not wearing an earpiece, and we never asked for breaks.”", "The Commission on Presidential Debates didn’t immediately respond to our request for comment.", "But the New York Times outlined what it called “The Long History of ‘Hidden Earpiece’ Conspiracy Theories,” detailing the various partisan claims about surreptitious electronic communications used by presidential candidates since Rush Limbaugh accused Al Gore of using an earpiece during an appearance on NBC’s “Meet the Press” during the 2000 election.", "None of the earpiece claims noted in the New York Times story were ever proven to be true.", "The Trump campaign’s claim appears to have developed out of its request “to allow a third party to inspect the ears of each debater for electronic devices or transmitters,” according to an early report from Fox News published on the morning of the debate.", "Although Biden’s campaign has denied the rumor that the former vice president would wear an electronic listening device during the debate, the memes that claim otherwise have spread widely. There’s no evidence to support that claim, though.", "Update, Oct. 1, 2020: In Facebook ads that largely targeted voters in swing states, the Trump campaign promoted both the claim that Biden had requested breaks and the unfounded suggestion that Biden would wear an earpiece, according to Facebook’s political ad library.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Kroll, Andy. “Pro-Trump Conspiracy Peddler Jerome Corsi Apologizes to Seth Rich’s Family.” Rolling Stone. 4 Mar 2019.", "“Moderator Announces Topics for First Presidential Debate.” Commission on Presidential Debates. 22 Sep 2020.", "Stein, Jeff. “KXEL Live & Local.” News Talk 1540 KXEL. 24 Sep 2020.", "Donald J. Trump for President. Press release. “Trump Campaign Statement on Debate Rules.” 29 Sep 2020.", "Rivera, Madeleine (@madeleinerivera). “Biden Deputy Campaign Manager @KBeds responded to this during a debate preview call today: ‘It is completely absurd. Of course, he is not wearing an earpiece, and we never asked for breaks.’” Twitter. 29 Sep 2020.", "Roose, Kevin. “The Long History of ‘Hidden Earpiece’ Conspiracy Theories.” New York Times. 29 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]