["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton gives an address at the Schomburg Center for Research in Black Culture on Feb. 16, 2016, in New York City. (Photo by Andrew Burton/Getty Images)", "Calls to raise the minimum wage -- something that hasn’t been done in seven years -- are a staple of many Democratic campaigns. Hillary Clinton’s presidential bid is no exception.", "In a Feb. 12 Medium post, Clinton wrote, \"As president, I will work to raise the federal minimum wage back to the highest level it’s ever been  —  $12 an hour in today’s dollars  —  and support state and local efforts to go even further.\"", "Here we’re checking if Clinton’s proposal to raise the minimum wage to $12 an hour would bring the minimum wage \"back to the highest level it’s ever been.\"", "We began by looking at the history of the inflation-adjusted minimum wage and found that the highest-ever inflation-adjusted value was $10.69 an hour in February 1968. The second-highest was $9.69 an hour in February 1967. You can see the data here and in the following graph.", "So Clinton’s $12 minimum wage actually would go beyond restoring, or bringing back, the minimum wage to its highest level ever. It would be $1.31 an hour higher in purchasing power than the previous record -- or 12 percent higher.", "What’s going on?", "When we asked the Clinton campaign for an explanation, they pointed to a paper by the Economic Policy Institute, a left-of-center think tank. This paper looked at how the minimum wage compared to the median wage at the time.", "According to the paper, in 1968, the minimum wage was about half as high as the median wage at the time -- 52.1 percent. By 2014, that had fallen to 37.1 percent, meaning that wages overall had risen while the minimum wage failed to keep up.", "Looking ahead to a proposed $12 minimum wage, the paper estimated that raising the minimum wage that high would bring the ratio back up to between 49.9 percent and 54.1 percent, or roughly what it was in 1968. And it found similar results when using a different benchmark -- the average hourly earnings of nonsupervisory production workers.", "Economists we checked with thought this was a credible standard for Clinton to use, and using this statistic supports her overall point. Indeed, Clinton would have been correct if she’d said she would work to raise the federal minimum wage back to where it was in comparison to the median wage at its historical record.", "But outside the economics department lounge, that’s a much bigger mouthful than saying she’d bring the minimum wage \"back to the highest level it’s ever been — $12 an hour in today’s dollars.\"", "The problem for Clinton’s streamlined phrasing is that it oversimplifies in a way that could give readers a misleading impression. The term \"today’s dollars\" usually means \"inflation-adjusted,\" and using the inflation-adjusted minimum wage, she’s wrong that a $12 minimum wage has historical precedent.", "Our ruling", "Clinton said she will \"work to raise the federal minimum wage back to the highest level it’s ever been — $12 an hour in today’s dollars.\"", "The minimum wage has never previously been \"$12 an hour in today’s dollars\" -- it’s gone as high as $10.69 an hour. However, Clinton has a point using other economic data. The data suggests that a $12 minimum wage would be similar to the 1968 wage when compared to median wages at the time.", "Clinton’s statement is partially accurate but leaves out important details, so we rate it Half True.", "Hillary Clinton, \"Organizing to raise wages\" (Medium post), Feb. 12, 2016", "Congressional Research Service, \"Inflation and the Real Minimum Wage: A Fact Sheet,\" Jan. 8, 2014", "Economic Policy Institute, \"We Can Afford a $12.00 Federal Minimum Wage in 2020,\" April 30, 2015", "Email interview with Dean Baker, economist with the Center for Economic and Policy Research, Feb. 16, 2016", "Email interview with Tara Sinclair, George Washington University economist and chief economist at the jobs site Indeed, Feb. 16, 2016", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, Feb. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]