["The screenshot can be seen on a Facebook post, archived here, which has been shared more than 1,100 times since it was published on July 18. “This is the insanity we deal with on a daily basis in SA!\" reads the caption.", "Other posts following the same narrative can be found archived here and more recently here.", "The remark is attributed in the posts to Khehla Sitole, South Africa’s national commissioner of police, although his name is spelt incorrectly in the posts. The SAPS released a statement on December 22, 2018 from its verified Facebook account, strongly condemning the false news story.", "“These utterances are clearly aimed at portraying the National Commissioner in a negative light as well as to undermine excellent collaboration between the SAPS and Community toward the fight against crime. These continuous fake news postings should be condemned in the strongest possible way,” said the statement.", "The screenshot itself appears to have been taken from a news article that expands on the false quote at greater length. A wider crop of the screenshot suggests it was taken from a website called “News Updates SA” which is no longer available. We did, however, find an archived version of the October 2018 article which also goes on to touch on the contentious debate around land ownership and reform in South Africa -- see this AFP Fact Check for more on this topic.", "The same text was also posted on a South African website calling itself ABC News -- not to be confused with the major US and Australian news organisations of the same name. News24 ran an expose of the site in November 2018, which detailed how they identified the website owner and confirmed that it was peddling false claims.", "South Africa has long suffered high crime rates. Last year Police Minister Bheki Cele said the country’s murder rates were bordering on those of “a war zone” with about 57 people killed a day, reflecting a 6.9 percent year-on-year increase -- see this AFP report for more.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]