["By Jessica McDonald", "Posted on November 11, 2020", "In a series of tweets, President Donald Trump claimed — without evidence — that the pharma company Pfizer and his own Food and Drug Administration purposely held off on releasing positive interim results about a COVID-19 vaccine candidate until after the election.", "Pfizer has said the timing of its announcement was not politically motivated and was dictated only by science.", "The president also implied that the FDA had already approved Pfizer’s vaccine. The agency hasn’t commented on the shot at all, let alone authorized it.", "Trump made his groundless claims in a string of tweets the evening of Nov. 9. Early that morning, Pfizer and BioNTech announced in a press release that its vaccine had been “more than 90% effective” in preventing symptomatic COVID-19 in people without prior evidence of infection with the novel coronavirus. The result was an initial readout based on a total of 94 people developing COVID-19 in its phase 3 clinical trial.", "As I have long said, @Pfizer and the others would only announce a Vaccine after the Election, because they didn’t have the courage to do it before. Likewise, the @US_FDA should have announced it earlier, not for political purposes, but for saving lives!", "— Donald J. Trump (@realDonaldTrump) November 10, 2020", "The @US_FDA and the Democrats didn’t want to have me get a Vaccine WIN, prior to the election, so instead it came out five days later – As I’ve said all along!", "— Donald J. Trump (@realDonaldTrump) November 10, 2020", "Several Trump allies have similarly intimated that the timing of Pfizer’s announcement is suspicious, including Sen. Ted Cruz and the president’s eldest son, who asked in a tweet, “Nothing nefarious about the timing of this at all right?”", "But the timing is coincidental. “At Pfizer, we are moving at the speed of science and only science guides all the decisions regarding our vaccine candidate,” the company told us in an email. “There are absolutely no political considerations involved in this process.”", "In an interview with Axios, Pfizer CEO Albert Bourla said that if he had received the results prior to the election, he would have released them then. But the findings didn’t become available until Nov. 8.", "Bourla explained that the data came in several days after Election Day and then had to be reviewed by an independent committee, which met on Sunday, Nov. 8 at 11 a.m. Bourla didn’t learn of the news until the afternoon.", "Bourla, Nov. 9: So the data came in on Thursday or Friday. And on — but you know, from the time that the data comes in, before the committee meets, some people need to prepare for each case a very big and accurate narrative. And the physician should sign it. So there’s a lot of work that needs to be done. But we did it with the speed of light. And once we had the 94 cases, they worked on the narratives, they worked on the tabulation of the results. So on Sunday morning, we didn’t want to lose a day, right? They didn’t do it Monday. They did it Sunday. The committee met and they reviewed the data.", "While widely viewed as exceeding expectations, the greater than 90% efficacy number is still preliminary and does not mean the vaccine is ready to roll out.", "As Pfizer noted in its own press release, “the final vaccine efficacy percentage may vary.” The company has not shared details on its efficacy data — including the exact breakdown of how many of the 94 volunteers who developed COVID-19 had been vaccinated — and the results have not yet been peer-reviewed.", "“It’s important to note that we cannot apply for FDA Emergency Use Authorization based on these efficacy results alone,” Bourla wrote in a Nov. 9 statement. “More data on safety is also needed, and we are continuing to accumulate that safety data as part of our ongoing clinical study.” He added that the company also still needed to generate data to show that the vaccine can be consistently manufactured.", "Scientists say other important questions remain, including how well the vaccine, which is given in two doses, works in different groups of people, such as the elderly; if the shots can protect against severe disease; whether the vaccine can prevent people from becoming infected or only from becoming sick; and how long protection lasts. The trial is designed to continue until at least 164 people become sick with COVID-19 and will include two years of follow-up to collect safety data.", "In fact, despite the positive news, Pfizer hasn’t changed its estimate of when it thinks it will be able to submit an application to the FDA for authorization. Because of FDA guidance that asks for a median of two months of safety data after the second vaccine dose, the company still estimates that it will be ready to submit in the third week of November. That’s the same timetable Pfizer gave in mid-October.", "The company did amend its protocols to require more COVID-19 cases than originally planned before the independent committee would take its first peek at the data. But there is no indication that this was done for political reasons, either.", "Pfizer’s press release explains that the first interim analysis was initially scheduled to occur after 32 people in the trial developed COVID-19, but after discussion with the FDA this was set at a minimum of 62 cases. By the time those conversations concluded, the case count had reached 94 people, triggering the committee’s first look.", "“We hope that analysis of efficacy at 94 cases will inspire greater public trust in our vaccine candidate than a potential readout at 32 cases,” Pfizer told us in an email. “In addition, it was important that the protocol changes required to omit the interim analysis after accrual of 32 cases and add new secondary endpoints to the study were agreed upon with FDA prior to conducting the interim analysis.”", "In any case, Pfizer’s news also doesn’t change the fact that any authorized COVID-19 vaccine will not be widely available at first. Globally, the company anticipates having up to 50 million doses — enough for 25 million people — by the end of 2020. But as Bourla said in his Axios interview, even if the U.S. gets half of those doses, that means only about 12 million people would get the shots this year — “a small part of the population.”", "In another Nov. 9 tweet, Trump repeated the unsupported claim that vaccine development would have gone more slowly under a different administration — and falsely suggested that the FDA had already approved a coronavirus shot.", "If Joe Biden were President, you wouldn’t have the Vaccine for another four years, nor would the @US_FDA have ever approved it so quickly. The bureaucracy would have destroyed millions of lives!", "— Donald J. Trump (@realDonaldTrump) November 10, 2020", "As we’ve written, there is no reason to think that vaccine development under Biden or any other American president would be significantly slower.", "And, of course, the FDA has not authorized any COVID-19 vaccine yet. The Pfizer news is promising — and bodes well for such an authorization — but the company still has to wait for more safety data and must first submit an application to the agency.", "The FDA hasn’t even commented on the new Pfizer results. There is nothing on the agency’s COVID-19 vaccine page about the interim results nor is there a reference to the news on the agency’s official Twitter account or that of FDA Commissioner Dr. Stephen Hahn as of Nov. 10.", "Trump and others have sought to cast Pfizer’s announcement as a win for the administration. In a Nov. 9 tweet, for example, Vice President Mike Pence attributed the interim trial results to Operation Warp Speed.", "HUGE NEWS: Thanks to the public-private partnership forged by President @realDonaldTrump, @pfizer announced its Coronavirus Vaccine trial is EFFECTIVE, preventing infection in 90% of its volunteers.", "— Mike Pence (@Mike_Pence) November 9, 2020", "And in a Nov. 9 interview with Fox News, Health and Human Services Secretary Alex Azar also suggested the progress was due to Trump’s “leadership” and Operation Warp Speed.", "Pfizer, however, has noted that unlike other companies, it did not bankroll its vaccine development or trials with the help of the government.", "Kathrin Jansen, a senior vice president and head of vaccine research and development at Pfizer, told the New York Times on Nov. 8, “We were never part of the Warp Speed” and the company has “never taken any money from the U.S. government, or from anyone.”", "But Pfizer did strike a $1.95 billion deal with the U.S. in July under the auspices of Operation Warp Speed. If its vaccine candidate is authorized, the government has promised to buy 100 million doses with the possibility of purchasing another 500 million doses.", "The company clarified in a statement to FactCheck.org that it is a participant in Operation Warp Speed as a vaccine supplier — but emphasized that so far, development and manufacturing costs have been self-funded. “We have already invested about $2 billion at risk and are prepared to continue bearing the costs of all development and manufacturing,” a spokesperson wrote.", "It’s not the case, then, that Trump’s “public-private partnership” is the only reason for Pfizer’s success to date, as Pence’s tweet may have implied.", "But several experts have pointed out that the administration should get at least some credit. That’s because the future promise of the purchase of a large number of vaccine doses arguably helps reduce the financial risk for the company.", "Dr. Peter Hotez, the dean of the National School of Tropical Medicine at Baylor College of Medicine, for instance, told CNN: “I think Operation Warp Speed helped with the clinical trial design and helped provide the financial incentive, knowing that there was going to be an advance purchase commitment for the vaccine. I think those were critical elements.”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]