["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Actress Alyssa Milano drew attention to gun background checks after a shooting at a Texas church left at least 26 people dead.", "\"There are no background checks on long guns (AR15s) in Texas. Thanks for the info @shannonrwatts,\" Milano tweeted on Nov. 5, crediting for the information Shannon Watts, founder of Moms Demand Action, an organization seeking stronger gun laws.", "There are no background checks on long guns (AR15s) in Texas. Thanks for the info @shannonrwatts.", "That means he’s prohibited purchaser, but there’s absolutely no regulation of long guns (AR15s) in Texas. No background check required. https://t.co/H0oqxgEsx9", "By mid-day Nov. 6, Milano’s message had been retweeted more than 3,200 times and \"liked\" by more than 7,800 Twitter users.", "Given the controversial national discourse on gun control, we wanted to know if Milano was right about background checks and long guns in Texas. We found her tweet to be partly accurate: licensed manufacturers, importers, and dealers must conduct a background check for the transfer of all firearms, but private sellers are not required to run such background checks.", "We reached out to Milano for comment but did not hear back.", "Law enforcement officials identified 26-year-old Devin Patrick Kelley as the gunman who killed 26 people and injured 20 others at First Baptist Church in Sutherland Springs, Texas, on Nov. 5.", "Freeman Martin, a regional director of the Texas Department of Public Safety, said at a Nov. 6 press conference that the shooting was not over religious beliefs. The suspect’s mother-in-law attended the church (though not present during the shooting) and had received threatening texts from Kelley. \"There was a domestic situation going on with this family,\" Martin said.", "Kelley dropped a \"Ruger AR assault-type rifle\" and fled the church, according to Martin. Kelley was found dead in his vehicle after a car chase and crash. Details on the cause of his death are developing.", "Milano tweeted that in Texas there are no background checks on long guns, such as AR-15-style rifles. (AR-15-style rifles look like military rifles \"but function like other semi-automatic civilian sporting firearms, firing only one round with each pull of the trigger,\" according to the National Shooting Sports Foundation.)", "Texas does not have a state law requiring any seller to run a background check on purchasers of any gun, said Ari Freilich, a staff attorney at the Giffords Law Center to Prevent Gun Violence.", "But there is federal law requiring background checks in some cases, she said.", "\"Federal law requires federally licensed gun dealers, importers, and manufacturers to run background checks before selling firearms of any kind to an unlicensed buyer,\" Freilich said.", "However, unlicensed, private sellers are not required by federal law to run background checks on individuals purchasing firearms.", "Many Twitter users pointed out this distinction to Milano. Appearing to have noticed the challenges to her claim, Milano tweeted less than two hours later: \"Background checks aren’t REQUIRED in Texas on long guns. If you buy from Walmart, they’ll do one. If you buy privately they don’t have to.\"", "Background checks aren’t REQUIRED in Texas on long guns. If you buy from Walmart, they’ll do one. If you buy privately they don’t have to.", "Watts, whom Milano credited for her information, also later specified in tweets that no background checks were required for private sales of long guns.", "Some states do have restrictions on the private sale of firearms. For instance, in California such sales must be done through a licensed dealer.", "A study published in January 2017 asked 1,613 adult gun owners where and when they acquired their last firearm, including whether it was purchased, and whether they had either a background check or were asked to show a firearm license or permit. Twenty-two percent said they obtained their gun without a background check.", "Milano tweeted, \"There are no background checks on long guns (AR15s) in Texas.\"", "Federal law does require background checks when a firearm is sold or transferred by licensed gun dealers, importers, and manufacturers. That includes long guns. But private, unlicensed sellers are not required to conduct background checks under federal or Texas law, even though other states have added requirements to that effect. Milano noted these distinctions in a follow-up tweet, but her original tweet lacked important context.", "We rate Milano’s claim Mostly False.", "Twitter, @alyssa_milano tweet, Nov. 5, 2017", "Twitter, @shannonrwatts tweet, tweet, Nov. 5, 2017, tweet Nov. 6, 2017", "Email interview, Ari Freilich, a staff attorney at the Giffords Law Center to Prevent Gun Violence, Nov. 6, 2017", "National Shooting Sports Foundation, Modern Sporting Rifle Facts", "ATF,  Is a NICS background check required for the transfer of long guns as well as handguns?, Last Reviewed Sept. 14, 2015", "PolitiFact, No, the Texas church shooter was not on the DNC payroll. That’s fake news., Nov. 6, 2017", "Fox Carolina, Man hailed a hero after chasing down Texas church shooter, Nov. 6, 2017", "NBC News, Texas Church Shooting: More Than Two Dozen Parishioners Killed, Nov. 6, 2017", "CNN, What we know about Texas church shooting suspect Devin Patrick Kelley, Nov. 6, 2017", "New York Times, Gunman Kills at Least 26 in Attack on Rural Texas Church, Nov. 5, 2017", "NRA, Buying and Selling a Firearm: Private Sales Explained, March 10, 2016", "Giffords Law Center to Prevent Gun Violence, Background Checks in Texas, Last updated Nov. 3, 2017", "Giffords Law Center to Prevent Gun Violence, State Private Sales of Guns, Last updated Nov. 4, 2016", "Houston Chronicle, Explained: gun laws in Texas, July 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]