["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Some Columbia schools in Toalson Reisch’s district have low annual performance rates. But there are other schools in Boone County with similar or lower scores.", "On Oct. 6, Cheri Toalson Reisch joined community members for a protest in support of returning children to in-person classes. Toalson Reisch is the Republican incumbent running for Missouri House District 44.", "In a Facebook post supporting students re-entering classrooms, she spoke about how Columbia Public Schools in her district are affected by the pandemic.", "\"All schools are open in Boone County except Columbia. Their kids are suffering,\" Toalson Reisch wrote.", "Toalson Reisch then made this claim: \"The Columbia school buildings in my district have the lowest test scores in all of Boone County.\"", "She linked the scores to the fact that CPS schools are online, while other school districts in Boone County are teaching in person, such as the Hallsville R-IV school district. Toalson Reisch’s district includes Hallsville and parts of Columbia.", "Words like \"most\" or \"lowest\" are warning bells at PolitiFact. So we decided to look deeper into this claim.", "In an email, Toalson Reisch said she was referring to Annual Performance Reports, or \"APR\" scores, specifically for Blue Ridge Elementary, Alpha Hart Lewis Elementary, and Eliot Battle Elementary in the Columbia schools district. We used other elementary and intermediate schools in the county as a comparison.", "Missouri APR scores rate schools on their performance using these terms: floor, approaching, on track or exceeding. Floor is the worst rating, while exceeding is the best. A floor rating means the school improved by less than 1% on Missouri Assessment Program tests. An exceeding rating means the school improved by 5% or greater.", "According to Mallory McGowin, a spokesperson for the Missouri Department of Education, the APR is calculated based on three principles: status, progress and growth. Each school gets a rating in one of these principles, as well as a category. For example: growth in math, status in language arts, etc.", "Here’s how McGowin explained each principle:", "Status: Student achievement levels.", "Progress: A school district’s improvement from prior years.", "Growth: The gains students are making over time.", "Columbia Public Schools spokesperson Michelle Baumstark says state assessments weren’t given this year due to the pandemic, and she said APR scores weren’t calculated at the school building level for the 2017-18 or 2018-19 school years.", "The data that Toalson Reisch is referencing wasn’t calculated since the 2016-17 school year. Any data she is referencing is over three years old.", "However, McGowin was able to provide building level data for Boone County. The school data showed how each school performed in different categories like language arts and math scores.", "We looked at each school based on the number of \"floor\" ratings it received. Floor ratings ranged from 2 to 21. High schools in Boone County had the most floor ratings on average, between 12 and 21. The range for middle and elementary schools was from two to 12.", "According to the data provided by the Missouri Department of Education, here’s how the Columbia schools Toalson Reisch spoke about performed in the past two school years.", "Blue Ridge Elementary: 10 floor ratings", "Alpha Hart Lewis Elementary: 12 floor ratings", "Eliot Battle Elementary: Seven floor ratings", "But some other schools in Toalson Reisch’s district performed as bad or worse during the past two school years. These schools are in her district but are not in Columbia:", "Centralia Intermediate: 12 floor ratings", "Cedar Ridge Elementary: 12 floor ratings", "Harrisburg Elementary: 12 floor ratings", "While Alpha Hart Lewis had as many floor ratings as these schools, the other schools Toalson Reisch provided are actually doing better.", "Toalson Reisch said, \"The Columbia school buildings in my district have the lowest test scores in all of Boone County.\"", "Elementary schools such as Alpha Hart Lewis Elementary and Blue Ridge Elementary have some of the lowest APR scores in Boone County. However, there are other schools in Boone County that are just as low or lower.", "We rate her claim Mostly False.", "Facebook, Cheri Toalson Reisch’s Post, Oct. 9, 2020", "Missouri Department of Education, MCDS Portal, Oct. 19, 2020", "Missouri Department of Education, Reports, Oct. 19, 2020", "Michelle Baumstark, Emails, Oct. 19, 2020", "Cheri Toalson-Reisch, Emails, Oct. 19, 2020", "Mallory McGowin, Emails, Oct. 22, 2020", "Missouri Department of Education, Spreadsheet, Oct. 22, 2020", "ZipDataMaps, Boone County, Oct. 22, 2020", "Missouri Department of Education, MAP Information, Oct. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]