["About this rating", "A photograph meme supposedly showing three U.S. soldiers in Syria \"crying and visibly shaken saying they could stop this in 10 minutes but Trump won’t let them\" was circulated on social media in October 2019:", "The meme started circulating in the wake of U.S. President Donald Trump's decision to withdraw troops from Syria. The move left the United States' Kurdish allies open to attack by Turkey and was criticized by several Republican and Democrat politicians, as well as numerous current and former military officials:", "I generally support @POTUS on foreign policy & don't want our troops fighting other nations' wars, but a HUGE mistake to abandon Kurds. They've never asked us to do THEIR fighting-just give them tools to defend themselves. They have been faithful allies. We CANNOT abandon them.", "— Gov. Mike Huckabee (@GovMikeHuckabee) October 7, 2019", "Trump's decision to withdraw troops from Syria was controversial, but the above-displayed photograph does not depict U.S. soldiers in Syria in 2019 criticizing their commander-in-chief.", "The picture was taken in December 2011 and shows three soldiers from the 3rd Brigade Combat Team at Camp Virginia in Kuwait. The photograph was taken by Lucas Jackson and is available via Reuters with the following caption:", "Soldiers from the 3rd Brigade Combat Team, 1st Cavalry Division rest while waiting to pack their weapons for shipment back to the United States at Camp Virginia, Kuwait December 19, 2011. The 3rd Brigade, 1st Cavalry Division was the last U.S. Military unit to depart Iraq and is processing to return to Fort Hood, Texas. REUTERS/Lucas Jackson", "Although the photograph is clearly miscaptioned, the sentiment of the attached quote may not be a complete fabrication.", "The text accompanying this viral picture appears to be a pared-down version of an anecdote related by \"Botin Kurdistani,\" a Twitter account supposedly belonging to an \"Independent Kurdish journalist.\" On Oct. 13, 2019, this account posted a five-message thread that started with a news segment from Kurdistan 24 showing a distressed woman talking about the situation in Syria:", "msg to #American,#German,#French mothers:", "1/\" Two of my son lost their lives on the U.S-led coalition's campaign against ISIS in Raqqa\nMy 3rd son was an ISIS held prison guard killed, by Turkey’s rocket & ISIS prisoners freed\nMy husband was badly injured in Turkish bombardment\" pic.twitter.com/SbBYTDMG8l", "— Botin Kurdistani (@kurdistannews24) October 14, 2019", "Kurdistani's Twitter thread appears to provide a translation for this woman's statements, and it ends with the following message (which was later paraphrased and spread on social media):", "However, we have been unable to verify this translation. Furthermore, it's unclear which parts of this Twitter thread are anecdotal and which can be directly attributed to the news segment it links.", "While it's possible that a U.S. soldier said something similar to the quote posted above, the accompanying photograph is unrelated because it was taken in Kuwait in 2011 and not Syria in 2019.", "Sonmez, Felicia.   \"Trump Faces Bipartisan Criticism for Syria Withdrawal.\"\r\n    The Washington Post.   13 October 2019.", "Breuninger, Kevin.   \"Trump: Others Have to ‘Figure the Situation Out’ After US Announces Withdrawal from Northern Syria.\"\r\n    CNBC.   7 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]