["By Eugene Kiely", "Posted on March 16, 2021 | Updated on May 24, 2021", "Sen. Ron Johnson, as he predicted, got himself in trouble for saying he “never felt threatened” by those who attacked the Capitol on Jan. 6, but he “might have been a little concerned” if they were “tens of thousands of Black Lives Matter and antifa protesters.”", "In response to critics who found his remarks to be racist, Johnson wrote an op-ed in the Wall Street Journal — “I Won’t Be Silenced by the Left” — that distorted a report’s findings on last year’s demonstrations against racial injustice.", "In his op-ed, Johnson cited the Armed Conflict Location & Event Data Project to “push back” at “leftists” who claim that last year’s protests were “mostly peaceful.” But the September report Johnson cited found that “more than 93% of all demonstrations connected to the movement” were non-violent.", "“[T]he senator is taking the overall figures out of context and distorting the report’s key conclusions,” Sam Jones, an author of the report, told us in an email.", "Jones also said that Johnson’s op-ed overstated the number of demonstrations that involved violence and the number of people who died during them.", "The controversy began on March 12 when radio host Joe Pagliarulo interviewed the Republican senator from Wisconsin. About six minutes into the 15-minute interview, Pagliarulo said Johnson’s Democratic colleagues are playing a political “game” when they accuse him of racism.", "Pagliarulo, March 12: There’s no way people that you go to work with every day really think that you and I are white supremacists because we believe in conservative values, right?", "Johnson: No, and I’m also criticized because I’ve made the comment that on January 6th, I never felt threatened, because I didn’t. And mainly because I knew that even though those thousands of people that were marching to the Capitol —", "Pagliarulo: Yeah.", "Johnson: –were trying to pressure people like me, to vote the way they wanted me to vote, I knew those are people that love this country, that truly respect law enforcement, would never do anything to break a law. And so, I wasn’t concerned.", "Now, had the tables been turned — and Joe, this could get me in trouble — had the tables been turned and President Trump won the election, and those were tens of thousands of Black Lives Matter and antifa protesters, I might have been a little concerned.", "Johnson may have thought that the pro-Trump supporters wouldn’t break the law that day, but he turned out to be wrong. So far, there have been more than 300 arrests, according to a database created by NPR.", "In his op-ed, Johnson didn’t mention the number of arrests stemming from the Capital riot. He also didn’t provide the number of deaths related to the riot (five, including a Capitol Police officer) or people who were injured (including at least 138 Capitol and Metropolitan Police Department officers). But he did provide such statistics for what he called “last summer’s political violence.”", "Johnson wrote that he felt “compelled to push back” at liberals who say the demonstrations that happened in the months after George Floyd’s death in police custody were peaceful. In the op-ed, Johnson favorably compared the largely white mob that attacked the Capitol on Jan. 6 with those who turned violent at demonstrations for racial justice.", "“Thousands of protesters — no one knows the actual number — marched to the Capitol,” Johnson wrote about the pro-Trump mob. “Only about 800 people illegally entered the Capitol. Still fewer engaged in violent acts.” He then cited the Armed Conflict Location & Event Data Project, a nonprofit that collects data on political violence and protest events.", "Johnson, March 15: Leftists who want to memory hole last summer’s political violence immediately started lecturing me that the 2020 protests were mostly peaceful. Apparently they’ve forgotten that, according to the Armed Conflict Location & Event Data Project, 570 leftist protests became riots last year. Twenty-five people lost their lives and 700 law enforcement officers were injured.", "The Armed Conflict Location & Event Data Project did not say that “570 leftist protests became riots last year” and did not find that 25 people were killed during those demonstrations.", "The report found that there were more than 10,100 political demonstrations in the U.S. from May 24 to Aug. 22 and less than 570, or about 5%, resulted in violence. That included all political demonstrations, including those against COVID-19 restrictions and counter demonstrations to the protests against racial injustice.", "The report said that during that time — actually from May 26 to Aug. 22 — there were “over 7,750 demonstrations linked to the BLM movement across more than 2,440 locations in all 50 states and Washington, DC.”", "“More than 93% — approximately 7,208 events — involved no violent or destructive activity, and under 7% — approximately 543 events — did involve violent or destructive activity,” Jones, one of the authors, told us.", "But, he added, “it would be inaccurate to say that those 543 events were riots caused by BLM or by ‘leftists,’ as the senator suggests.”", "“These events include cases where violence was instigated by actors other than the demonstrators. ACLED data indicate that BLM-linked demonstrations faced much higher levels of police intervention and force than other types of demonstrations, for example, and in many of these cases police took a heavy-handed approach to break up the protests, prompting clashes with demonstrators and escalating the events into violence,” Jones said. “Additionally, in some cases, violent or destructive behavior may have broken out as a result of aggressive intervention by counter-demonstrators or non-state actors like militia groups, and BLM-linked demonstrations were also targeted in dozens of car-ramming attacks throughout the year. It would be misleading to frame all of these events as ‘BLM riots.'”", "Ben Voelkel, a spokesman for the senator, told us in an email that the senator’s op-ed “doesn’t ascribe causation, but instead a result.” The senator’s op-ed was “worded exactly this way: ‘became riots last year,’” Voelkel said.", "Jones also said that Johnson’s reference to 25 people who died during the demonstrations is inaccurate. The figure doesn’t come from the report, but rather an article by the Guardian. The article, based on ACLED data, reported that “at least 11 Americans” were killed “while participating in political demonstrations” and another 14 died “in other incidents linked to political unrest.”", "Of the 11 killed during political demonstrations, nine were “demonstrators taking part in Black Lives Matter protests” and “two were conservatives killed after pro-Trump ‘patriot rallies,'” the Guardian reported.", "“So it is incorrect to suggest that all of these 25 people were killed by BLM or ‘leftist’ demonstrators, or that all of the deaths were at BLM or ‘leftist’ demonstrations,” Jones said.", "Update, May 24: The Washington Post reported on April 19 that District of Columbia Chief Medical Examiner Francisco J. Diaz found that Capitol Police Officer Brian Sicknick suffered two strokes nearly eight hours after being sprayed with a chemical irritant during the riot. Diaz told the Post that Sicknick died of natural causes, but “all that transpired played a role in his condition.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]