["The warning was published on Facebook here on March 3, 2021. The post includes a screenshot of the warning shared on the Line chat application.", "The Thai-language message reads: “Tonight at 00:30 to 03:30 am don’t forget to turn off your phone, mobile, tablets and etc. and place them far away from your body. Singapore TV announced this news. Please tell your family and friends. Tonight from 12:30 a.m. until 3:30 a.m. our planet will emit a very high radiation. Cosmic rays will pass close to Earth, therefore please turn off your mobile phones, don’t leave your device close to your body, as it can cause you terrible bodily harm! If you don’t believe, check Google and NASA BBC News. Send this message to people that you love.”", "The same claim was shared on Facebook in Thai here, here and here; and in English here, here and here. It was also shared on Twitter here in 2010.", "The claim, however, is false.", "Supalerk Karuehanon, who heads the Astronomical Academic Services Division of the National Astronomical Research Institute of Thailand, said that the warning message is “fake news”.", "“Although the warning contains scientific terms, they are used in a manner that lacks an understanding of the scientific principles,” he told AFP by phone on March 11, 2021. “This is essentially what you would call pseudoscience.”", "Supalerk explains that “cosmic rays, which are emitted from the sun or from cosmic events outside our solar system such as black holes or a supernova, can affect electronic devices such as computer chips on satellites. However this doesn’t mean the rays will affect our bodies in the same way.”", "The US National Aeronautics and Space Administration (NASA) adds here that cosmic rays are “high energy particles that move through space at nearly the speed of light”.", "The US National Oceanic and Atmospheric Administration (NOAA) also stated here that cosmic rays  pose “little threat to humans and systems” on Earth.", "The European Space Agency explains further here: “Earth’s magnetic field and atmosphere protect us from the constant bombardment of galactic cosmic rays”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]