["Ahead of the contest between Senate Majority Leader Mitch McConnell and his challenger, Democrat Amy McGrath, a meme about the senator's wealth relative to that of the state he represents has spread online.", "\"Mitch McConnell is the richest senator in the U.S. Senate. Kentucky is the poorest state in America. They have voted for him 30 years in a row. Let that sink in,\" the meme reads.", "It attributes the quote to comedian Chris Rock, though it's unclear if he made the remark. It was also posted to Instagram by fellow comedian D.L. Hughley.", "Rock and Hughley did not respond to requests from USA TODAY for comment.", "More:Fact check: Republicans, not Democrats, eliminated the Senate filibuster on Supreme Court nominees", "McConnell is not the richest member of the Senate, though he is in the top 10.", "According to OpenSecrets.org — run by the nonpartisan, nonprofit Center for Responsive Politics — the richest member is Sen. Rick Scott, R-Fla., whose estimated net worth is nearly $260 million. The rankings — released in April and based on the lawmakers' most recent financial disclosures through 2018 — show that McConnell is the ninth wealthiest senator, with an estimated $34 million in assets.", "It's also worth noting that some lawmakers have yet to file financial disclosures. Sen. Kelly Loeffler, R-Ga., who took office by appointment in January, has an estimated net worth of over $500 million.", "McConnell was not remarkably wealthy when he entered the Senate in 1985, and only began to rank above average in the last decade. His net worth ballooned in 2008, likely due to an inheritance from his wife's mother, per the Washington Post.", "Other wealthier senators include Sen. Mark Warner, D-Va., with an estimated net worth of $214 million; Sen. Mitt Romney, R-Utah, at $174 million; and Sen. Dianne Feinstein, D-Calif., at $88 million.", "More:Fact check: No evidence Dianne Feinstein helped husband secure a USPS real estate contract", "Kentucky is not the poorest state, either, though it also consistently ranks in the top 10.", "There are various metrics for evaluating a state's wealth, including poverty rate and median household income.", "Kentucky has the sixth highest poverty rate in the nation, at 16.9%, per U.S. News and World Report. Mississippi has the highest rate, at 19.7%.", "Kentucky also has the sixth lowest median household income, at $48,392 in 2018, per the Urban Institute, based on data from the federal Bureau of Economic Analysis. The state's per capita income is the fifth lowest, at $44,017.", "Based on our research, the claim that Mitch McConnell is the richest senator and his home state of Kentucky is the poorest state is FALSE. Though McConnell is estimated to be among the richest and Kentucky consistently ranks among the poorest, neither is No. 1.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]