["Multiple images of a man photographed with Islamic preacher Zakir Naik are being circulated on social media with the claim that he is the Sri Lanka suicide bomber. A former officer of the Indian army and a newly-inducted member of the BJP, Major Surendra Poonia was among those who shared the photograph. He also shared an image of Congress MP Digvijay Singh with Zakir Naik in an attempt to link an alleged terrorist with the Congress party.", "From a Twitter handle Chowkidar, The Activist (@AhmAsmiYodha), the post received nearly 4,000 retweets. He addressed controversial Islamic preacher Zakir Naik as “Congress party’s maternal uncle.”", "Images of the same man posing with Naik are viral on Facebook as well.", "The man photographed with Zakir Naik is not one of the suicide bombers of the Sri Lanka terrorist attack. He is an Islamic preacher and Naik’s disciple. Reverse-searching the image with the keyword “Zakir Naik” redirected us to an article published in Malaysia-based newspaper Malaymail on April 28. The man is Muhammad Zamri Vinoth Kalimuthu who was arrested in Perlis, Malaysia on Sunday for alleged blasphemous remarks on Hinduism.", "“A brief video said to show Zamri Vinoth being taken into custody was posted on Facebook this morning by Seberang Perai Municipal City Councillor David Marshel,” reported Malaymail.", "Polis menahan Zamri Vinot A/L Kalimuthu di Arau Perlis 2 pagi ini 28/4/2019.. Inilah Padah jika mana mana pihak menghina agama lain!!! #Syabas #PDRM #SialKenaTahan #DakwaSiSialIni", "Posted by David Marshel on Saturday, 27 April 2019", "There are several other photographs of Zamri with Naik on the former’s Twitter account.", "Hanya Allah sahaja yang boleh memuliakan seseorang dan menghina seseorang manusia tidak berkuasa untuk itu.Dr Zakir. pic.twitter.com/TRqgErnXNU", "— Zamri Vinoth (@Zamri_Vinoth) April 22, 2016", "All nine suicide bombers were identified as Sri Lanka citizens. Zamri is a Malaysian who was arrested on April 28 hence, could not have been a suicide bomber in the Sri Lanka terror attack.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]