["About this rating", "An image purportedly showing a \"Blood of Jesus on the Cross\" flower appeared in April 2017, along with the claim that this plant species only blooms, showing what appears to be a Christian symbol, during Holy Week:", "This beautiful flower grows in New Zealand and called “Blood of Jesus on the Cross”", "This flower grows only in the Holy week. You can see the Cross in the centre of the flower.", "We found no mention of a flower with this name on the plant databases compiled by the National Gardening Association or the United States Department of Agriculture. The flower shown in this image is most likely a metrosideros excelsa, commonly known as the New Zealand pohutukawa or New Zealand Christmas tree.", "This photograph was taken by Dr. Zoe Popper for Fascination of Plants Day:", "The claim that this flower only blooms during Holy Week, a moveable feast Christian observance that culminates in the Easter celebration, is also false. However, the New Zealand Christmas tree does have an unusual blooming season around another Christian holiday -- as its name suggests, this flower tends to bloom around Christmas:", "The blazing red flowers of pōhutukawa around Christmas time have earned this tree the title of New Zealand's Christmas tree. Pōhutukawa and rātā belong to the genus Metrosideros. In New Zealand, this genus is represented by two pōhutukawa (mainland and Kermadec), six species of rātā vine, a related shrub, and three tree rātā.", "Mainland pōhutukawa (M. excelsa) occurs naturally in the upper half of the North Island (north of New Plymouth and Gisborne) although it grows from one end of the country to the other. It is easily distinguished from rātā by the hairs on the underside of the leaves.", "New Zealand History.    \"Pohutukawa Trees.\"\r\n    Retrieved 12 April 2017.", "New Zealand Department of Conservation.    \"Pohutukawa.\"\r\n    Retrieved 12 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]