["“पूरे भारत मे मज़हबी उन्मादियों का खौफनाक रूप सड़को पर. नंगी तलवारों के साथ लग रहे नारे- चड्ढा चड्ढी वालों को, गोली मारो सालों को. मौत का इशारा @RSSorg व अन्य हिन्दू संगठनों के कार्यकर्ताओं की तरफ. @HMOIndia @AmitShahOffice @AmitShah @narendramodi @PMOIndia @naqvimukhtar (Horrible scenes of religious fanatics can be seen on the streets of India. People are shouting slogans with naked swords raised – Shoot those who wear shorts. The incitement to kill is aimed at workers of RSS and other Hindu organisations)”", "A video shared by Sudarshan News with above claim shows a group of people allegedly shouting slogans that roughly translate to “Allahu Akbar, kill the murderers of Tabrez, RSS murdabad, shoot the half-pant guys, the blood of Tabrez will bring a revolution”. The video (archive) was retweeted 2,700 times at the time of writing this article.", "The video, now deleted, can be watched below:", "The same video was shared by Twitter user, Dr. Jitendra Nagar (@NagarJitendra) with the claim that the sloganeering took place in Bhopal, Madhya Padesh., “भोपाल मे सडको पर डरे हुए शांतिदूत @RSSorg के खिलाफ हाथो मे गंडासे और तलवारें ले के निकले है… इसमे एक अंतराष्ट्रीय षडयंत्र नजर आता है कि किसी भी तरह देश मे भय का वातावरण बने और विश्वमंच पर मोदीजी और भारत को बदनाम किया जा सके। MP मे कोंग्रेस की सरकार है तो साजिश ही हो सकती है (Fearful ‘Shantidoots’ are out on the streets of Bhopal with swords in their hands while opposing RSS…There seems to be an international conspiracy in this according to which they want to create an atmosphere of fear around the country so that Modiji and India get ridiculed internationally. Since MP has a Congress Government, this can only be a conspiracy)”", "The video was also shared by several facebook pages on June 30.", "Alt News broke the video into multiple key frames using InVid. On reverse searching one of the key frames on Google, we found it matched a video claimed to be of a Muharram procession in Dehri, Bihar. It was uploaded on YouTube on Nov 17, 2017. Unlike the video posted by Sudarshan News, this video has no incendiary slogans with reference to the lynching of Tabrez Ansari. The only audio that can be heard is a loudspeaker announcement saying “dheere dheere badte rahe… Aapse guzarish hai ke dheere dheere badte rahe (Keep moving, you are requested to keep moving slowly)“. The traditional Moharram chants of “Hassan Hussain” can be heard in the background.", "To illustrate that an old video was shown by Sudarshan News as recent, we did a side-by-side comparison of frames taken from the Sudarshan News broadcast and the 2017 video that Alt News found, an example of which can be seen below. In the juxtaposition below, a hand holding a blue coloured mobile can be seen in both the videos. However, the original video has none of the incendiary slogans shown by Sudharshan News. Moreover, this is a 2017 video thus, cannot be representative of any protest against the mob-attack on Tabrez Ansari in Jharkhand in June 2019.", "Alt News found the same audio morphed into the video broadcast by Sudarshan News in a clip of a recent SDPI protest rally against Tabrez Ansari’s mob lynching.", "We also found other videos of the rally where similar sloganeering can be heard.", "An old video of a Moharram procession, where people can be seen carrying swords, was doctored to include slogans calling for the killing of RSS workers. Sudarshan News shared the video in its broadcast thereby misinformation its viewers. The channel and its host Suresh Chavhanke have often been found circulating communally sensitive misinformation in the past as well (1,2,3 and 4).", "[UPDATE: A video of a recent SDPI protest rally against Tabrez Ansari’s mob lynching, where the same anti-RSS sloganeering can be heard, has been added to this article. After this fact-check was published, Sudarshan News took down the morphed video. The broadcast was downloaded by Alt News and a link has been included in the article.]", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]