["America is nervously watching COVID-19 sweep its way across the top ranks of government. Now, online speculation and the administration's lack of transparency are paving the way for misinformation about President Donald Trump’s health to go viral.", "“Breaking News: HOSPITAL RECORDS EXPOSE TRUMP’S WEIGHT TO BE A WHOPPING 322 POUNDS!” @JerasIkehorn posed on Twitter Oct. 5", "Soon the hashtags #322PoundPotus and #322Pounds gained traction, @JerasIkehorn's tweet received 9,000 retweets, 1,400 quote tweets and nearly 29,700 likes, and the claim made its way across social networks.", "“Hospital Record shows Trumps Weight 322! His Last Doctor said: 239! They understated by 83 Pounds! Could Other Info be Inaccurate!” asserted a similar claim, posted on Facebook on Oct. 5.", "However, the White House has not released Trump’s hospital records from his stay at Walter Reed National Military Medical Center and Trump’s latest physical results reveal he’s far from 322 pounds.", "More:Fact check: Trump could have been exposed to COVID-19 before Sept. 29 presidential debate", "The Facebook user who shared the claim has not responded to USA TODAY’s request for comment.", "Trump’s health records, like those of any American, are protected from public release without his consent by the Health Insurance Portability and Accountability Act (HIPAA).", "Since Trump announced his and his wife’s positive COVID-19 diagnosis on Oct. 2, Trump’s physicians and administration officials have updated the public on his condition via press conferences and written statements. In these correspondences, Trump’s team discussed his treatment and symptoms, but they never revealed his weight.", "“The doctors are not going to get on television and contravene the narrative. It’s the president’s privacy. If he doesn’t want to share information with the public, they can’t,” Dr. Russell Buhr, a pulmonologist and critical care professor at UCLA, told USA TODAY.", "If a doctor were to divulge the president’s health information without his consent, that physician would risk criminal penalties ranging between $50,000 and $250,000, as well as sanctions from professional medical boards and loss of a state medical license.", "More:Fact check: Claim that Trump's positive COVID-19 test result is a 'con' has no basis in fact", "Trump weighs 244 pounds according to his latest annual physical exam results released by the White House on June 3. The 6-foot-3, 74-year-old president was up one pound from his previousphysical released in February 2019, which showed his weight as 243 pounds. The year before, he weighed in at 239 pounds.", "There is no indication the president has gained 78 pounds over the past few months or that his administration has lied about his physical results for the past several years.", "Trump’s weight places him just over the boundary of what medical professionals consider obese.", "After he announced his positive results, the country debated how Trump's weight might make him more vulnerable to contracting a serious case of COVID-19. Trump’s weight makes him three times more likely to suffer a serious COVID-19 infection than someone at a healthier weight, USA TODAY reported.", "More:Fact check: False claim that Trump wearing neural stimulator device in resurfaced photo from 2016", "More:Fact check: Satirical post falsely claims Trump would be fine if he hadn't gotten tested", "The White House never released hospital records from Trump's stay at Walter Reed National Military Medical Center that revealed he weighs 322 pounds. HIPAA prevents Trump's medical records from being released without his consent. The president's latest physical results shared by the White House reveal he weighs 244 pounds. We rate this claim FALSE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]