["About this rating", "Pat Sajak's daughter was purportedly featured in an online advertisement with the \"Wheel of Fortune\" host. At least two children were visible in the misleading ad, which had been displayed since at least February 2021.", "It read: \"[Photos] Pat Sajak's Daughter Looks Like Her Iconic Mom.\"", "However, this was misleading. The picture in the ad did not feature his daughter. The real story behind the photograph was published by the Chicago Tribune in 2019. We blurred the faces of the children for this story, since their parents likely did not provide permission for the improper use of the photo. The caption read:", "Celebrity Spokesperson Pat Sajak, pictured with children who have benefitted from services provided by the Hope Institute, continues to support the raffle which raises critical funds for children with autism spectrum disorders and developmental disabilities in Illinois. (Posted By olliealexander, Community Contributor)", "Readers who clicked the misleading ad were led through hundreds of pages of a slideshow article. Its headline was: \"Celebs and Their Parents at the Same Age - They Inherited Their Parents’ Good Luck & Their Credit Score, What a Bargain!\" It was published by the Mortgage After Life website.", "The first page of the lengthy story featured Heidi Klum. Under the photos of the model and businesswoman was the all-caps text: \"CLICK ‘NEXT’ TO SEE PAT SAJAK’S DAUGHTER WHO LOOKS JUST LIKE HER MOM.\"", "Pat Sajak and his real daughter finally appeared on page 101. This meant that readers would need to click \"next page\" around 100 times to reach the promised reveal.", "Pat Sajak is a TV star, ex weatherman, and talk-show and game-show host, known mainly for hosting the game show Wheel of Fortune. He has been hosting the show since 1981. Pat’s wife is Lesly Brown Sajak, a photographer and they have 2 kids – their son Patrick (born in 1990), and their daughter Maggie (born in 1995).", "Maggie Sajak is an upcoming country musician. Her musical style draws comparisons to Sheryl Crow, Carrie Underwood, Jewel & Eva Cassidy. If Maggie inherited her father’s showbiz skills she’ll definitely become a huge star.", "Pat Sajak's real daughter is named Maggie. The American country music singer appeared on \"Wheel of Fortune\" in January 2020:", "Game show television hosts have been a fixture of such misleading online advertisements for years. Their familiar faces likely made them a solid pick for clickbait advertisers because they appear trustworthy to many readers.", "This was true of both Sajak and the late Alex Trebek, who was the longtime host of \"Jeopardy.\" He was also featured in misleading ads that led to lengthy slideshow articles. Viewers have invited both Sajak and Trebek into their living rooms every weeknight for decades. To some, they may have felt like members of the family.", "In sum, a misleading online advertisement did not show Pat Sajak posing with his daughter. The photograph actually showed Sajak posing with children who have benefited from the Hope Institute.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]