["The video was posted here and here on Facebook March 23, 2019 and has been viewed thousands of times.", "Below are screenshots of the misleading posts:", "The misleading posts’ caption says:", "\"Conquest of Islam. Parents in New Zealand are sending their kids to Masjid to learn about Islam. New Zealand children take courses about Islam. This has brought about great interest in Islam in themselves to practice Islam. The New Zealand mosque massacre has led to a dramatical rise in interest in Islam all over the Western world among more and more non Muslims seeking knowledge about Islam and more mosques opening doors to all.", "\"The world is watching. We have to get this right. We have to make good use of it. We have to demonstrate to the rest of the world that love, peace, and compassion, sincerity, harmony and humanity are the basic principles of Islam.\"", "The same footage and a similar claim has also been shared on other social media including Instagram, for example here, on YouTube, for example here, and on Twitter, for example here.", "Below are screenshots of the misleading video and claim on different social media platforms:", "The footage used in the misleading posts has circulated online since at least 2016.", "The exact same footage was posted to YouTube here on December 26, 2016 with a Dutch-language caption saying: “Indoctrination at Dutch schools”.", "Below is a screenshot comparison of the misleading video (l) and the YouTube video (r):", "In the video in the misleading posts, a banner written in Dutch appears at the bottom of the screen which says: “bidden in de islam is nog niet zo simpel”.", "A journalist at AFP’s bureau in the Hague translated this to English as: “praying in Islam is not that simple yet”.", "The man standing in front of the children can also be heard speaking Dutch while the children bowed their heads.", "\"Look between your feet. Alright, that's good. You stay in this position? I'll have a coffee.\" [Children can be heard laughing]. Elbows should not touch the ground. And hands near your ears,” he said, according to AFP’s translation of the Dutch comments.", "An online keyword search for mosque visits by Dutch schoolchildren led to this December 30, 2016 report by magazine De Stentor, based in Zwolle, Netherlands, which contains a screenshot of the video in the misleading social media posts.", "Below is a screenshot of the article:", "The Dutch headline translates to English as: \"Zwolle imam puzzled over video clip fuss.\"", "The first paragraph of the story translates to English as: “Zwolle imam Mawlana Tahier Wagid Hosain Noorani of the Ghulzar-e-Medina mosque said he did not understand the commotion around a video clip of children who had visited his mosque. 'It was two years ago,' Noorani said. 'In the past two years we’ve hosted several schools and groups of interested people. This was one of many tours.'”", "The report says the video was filmed at the Ghulzar-e-Medina mosque in Zwolle in 2014.", "This is the Facebook page for the Ghulzar-e-Medina mosque in Zwolle, which gives its address as Koningin Wilhelminastraat 95 Zwolle, Netherlands.", "Below is the location of the Ghulzar-e-Medina mosque on Google maps:", "AFP compared the video in the misleading posts with this photo taken inside the Ghulzar-e-Medina mosque published on a local news site named ‘Zwolle in Beeld’.", "Below is a screenshot comparison of the video (l) with the image on Zwolle in Beeld (r). Certain key distinguishing features can be seen in both, including the red patterned prayer mat floor, and two ornately carved pieces of wooden furniture at the front of the room:", "AFP contacted the Ghulzar-e-Medina mosque but they did not respond to requests for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]