["AAP councillor Tahir Hussain has been linked with the murder of IB staffer Ankit Sharma who was found dead in a drain close to Hussain’s house on February 26. Since then, the AAP leader has been suspended from the party and is now under police custody. The reportage around Tahir Hussain and communal riots in Delhi comprises several reports that weren’t journalistically sound.", "One such report was published by Sudarshan News.  On February 27, the channel tweeted (archived link) a two-minute “ground report” from Tahir Hussain’s house. In the video, the reporter introduced an unnamed person as “witness”. According to this witness, a girl was dragged into Hussain’s residence, murdered and dumped into a drain nearby. The camera pointed at burnt clothes on the ground. The witness and the reporter claimed that these belonged to the girl whose corpse was found by the police on February 27.", "Sudarshan News tweeted, “Girl’s burnt clothes, bag and undergarments found at Tahir Hussain’s house. It is speculated that something untoward had happened with the girl. As per sources, police found the girl’s dead body in a drain. Chances are that the girl was dragged into Tahir’s house and brutally killed.” This video has been retweeted over 9,500 times and gained close to four lakh views.", "[Translated from #ताहिर_हुसैन के घर पर मिले एक लड़की के जले कपड़े, जले बैग और अंडरगारमेंट्स..अनुमान है कि लड़की के साथ हुई है अनहोनी. सूत्रों के अनुसार पुलिस को नाले में मिली लड़की की लाश. लड़की को घसीट कर ताहिर के घर में बेरहमी से कत्ल की आशंका].", "#ताहिर_हुसैन के घर पर मिले एक लड़की के जले कपड़े, जले बैग और अंडरगारमेंट्स..", "अनुमान है कि लड़की के साथ हुई है अनहोनी. सूत्रों के अनुसार पुलिस को नाले में मिली लड़की की लाश. लड़की को घसीट कर ताहिर के घर में बेरहमी से कत्ल की आशंका.@sharmarekha @ArvindKejriwal @smritiirani pic.twitter.com/gK7WFpPymt", "— Sudarshan News (@SudarshanNewsTV) February 27, 2020", "The Sudarshan News broadcast or the claim that a girl was murdered at Hussain’s residence was shared by multiple BJP members – Amit Malviya (archive link), Kapil Mishra (archive link), Abhijat Mishra (archive link), Jawahar Yadav (archive link) and Arun Yadav (archive link).", "Alt News was unable to locate any reports by mainstream media claiming that a female dead body was recovered near Tahir Hussain’s house. However, several social media users and right-wing websites had shared an image of a minor girl, asserting that her corpse was found in a drain close to his place. Alt News found that the photograph was of a girl who was found dead in her house in an unrelated incident in Madhya Pradesh.", "Speaking with Alt News Alok Kumar, joint commissioner of police, eastern range New Delhi, said, “No female dead body has been recovered from the Chand Bagh drain, where IB staff Ankit Sharma was found, in our ongoing investigations.”", "Nitisha Kashyap, special correspondent, CNN News18, was reporting from Chand Bagh on February 27. At 4:20 minutes into the broadcast below, she informed, “The police briefed that no female dead body has been found from the Chand Bagh drain where Ankit Sharma was found.”", "Over 50 victims have been identified who died in the communal violence in Delhi. On March 2, The Polis Project, a non-profit research and journalism organisation, published a report which lists the names of the ones who died during targeted violence in northeast Delhi between February 23 to 29. According to the report, only one female dead body was recovered – an 85-year-old woman. The Scroll and The Quint reported on it. The list also includes Ankit Sharma’s name.", "Alt News spoke with Vasundhara Sirnate, co-founder and director of research at The Polis Project. She said, “So far, Akbari is the only confirmed female victim on the list.”", "Oxford dictionary defines the word witness as “a person who sees something happen and is able to describe it to other people.” So how did Sudarshan News find a witness to a crime that has been denied by the police?", "Alt News analysed the two-minute broadcast and here’s what we observed:", "In conclusion, Sudarshan News ran a broadcast claiming that a girl (or a woman – the channel doesn’t clarify) was murdered at Tahir Hussain’s house during communal riots in Delhi. Oddly enough, the ‘witness’ used by the channel hadn’t witnessed the crime at all, yet his statements were held as the gospel of truth. The police have denied that a female corpse was found in the drain near Hussain’s residence but the channel hasn’t taken down its broadcast or clarified/ apologised for misleading viewers at a time of communal violence.", "The provocative misinformation circulated by Sudarshan News is a reminder of a similar report carried by Gujarati daily Sandesh at the time of the 2002 Gujarat pogrom. The outlet published a false story about the breasts of two Hindu women chopped off in Godhra.", "The broadcast was shared by Divya Kumar Soti (archive link) and Vikas Saraswat (archive link), writers at right-wing media platforms OpIndia and Swarajya respectively.", "Alt News found that many unverified yet influential social media accounts also shared the video/claim. Tweets by the following handles have over 1,000 retweets – @janardanmis (archive link), @JayHind11544289 (archive link), @deep_mani1 (archive link), @Amritapandeyy (archive link), @ThePoojaSingh1 (archive link) and @sharmaAvl (archive link). The last two accounts are followed by Prime Minister Narendra Modi.", "Other accounts followed by PM Modi which amplified the claim include @iBackModi (archive link), @chintanvedant (archive link), @SaffronJay (archive link), @Priyankabjym (archive link), @JhaRahul_Bihar (archive link), @modivanibharat (archive link) and @jaiprakashshah2 (archive link).", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]