["The image and claim were published on Facebook here by a Pakistan-based page with more than 9,500 followers.", "Below is a screenshot of the misleading post on Facebook:", "The text in the post states in part: “Man who had woman’s brain transplanted had five car crashes in two weeks.", "It also says: “53-year-old man named Phil Robertson from Scranton in Pennsylvania was miraculously saved from a brain cancer a few months ago by undergoing a successful brain transplant.", "“He received the brain of a 37-year old woman who had died in a car accident and the operation had unforeseen consequences for the poor man.”", "Posts making a similar claim were also shared here and here on Facebook and here on Twitter.", "The claim is false; the photo previously appeared in news reports about a 55-year-old cancer survivor named Jim Boysen, who was the first man to receive a partial skull and scalp transplant in May 22, 2015, at Houston Methodist Hospital.", "Below is a screenshot of this Indonesian-language BBC report from the time which contains the image, translated to English:", "Some of the false posts also included a photo of a man referred to as Dr. James Ford.", "But a reverse image found the same photo published here on November 8, 2011 on a Flickr page that describes itself as the official \"Army Medicine\" account of the US military.", "Below is a screenshot of the photo as it appears on Flickr:", "The caption states in part: \"Army Col. (Dr.) George E. Peoples explains how cancer vaccines help to combat breast cancer during an interview at San Antonio Military Medical Center.\"", "The story about a man who had five car crashes after a brain transplant was previously published on the satirical site World News Daily Report  here on November 29, 2018.", "Below is a screenshot of the satire story, headlined \"Man who had woman’s brain transplanted has five car crashes in two weeks\":", "The tagline of the World News Daily Report website is \"Where facts don't matter\" and it carries a disclaimer here stating that all its stories are satirical and fictional in nature.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]