["By Saranac Hale Spencer", "Posted on January 17, 2018", "Q: Were three Democratic state senators arrested in New Jersey for running a prostitution ring?", "A: No. The senators named in the story don’t even exist.", "Sixty-three cases of sex trafficking were reported in the state of New Jersey in 2017, according to the National Human Trafficking Hotline.", "None of them involved state senators named “Sharat,” “Longwell” or “Mackelroy.”", "In fact, nobody by any of those names is serving in the New Jersey Senate.", "But a story that originated on a site called Ladies of Liberty is circulating with the headline: “BREAKING: Three Democrat Senators Busted Running Underage Prostitution Ring.” It named those three fictional senators as the ringleaders.", "Ladies of Liberty is part of a network of sites that describe themselves as satirical and intended to poke fun at conservatives. Each of them has a disclaimer that says, “Everything on this website is fiction.” However, the story has been picked up and reposted by several other sites that include no such disclaimer.", "Facebook users flagged the story as being potentially false. It is.", "The story starts out with a reference to the so-called “pizzagate” conspiracy theory, which spread the fiction that Democratic Party heavyweights, including the Clintons, were running a pedophile ring in the basement of the Comet Ping Pong pizza shop in Washington, D.C. That hoax drove Edgar Maddison Welch to show up at the shop with an AR-15 rifle.", "The story also includes a made-up quote from former New Jersey Gov. Chris Christie’s office that links to a Mr. Potato Head meme that says: “DID YOU ALL TAKE STUPID PILLS THIS MORNING?”", "Another clue that the story isn’t true is the author’s bio, which shows a stock photo of a woman in lingerie wielding a pistol in each hand. We’ve written about this before.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "National Human Trafficking Hotline. New Jersey statistics. Accessed 16 Jan 2018.", "New Jersey State Legislature. Legislative Roster. Accessed 16 Jan 2018.", "“BREAKING: Three Democrat Senators Busted Running Underage Prostitution Ring.” LadiesofLiberty.net. 9 Jan 2018.", "Samuelson, Kate. “What to Know About Pizzagate, the Fake News Story With Real Consequences.” Time. 5 Dec 2016.", "Welch, Edgar Maddison. Guilty plea. United States District Court for the District of Columbia. 24 Mar 2017.", "Hale Spencer, Saranac. “No Cash, No Corpses for Made-up Mayor.” FactCheck.org. 4 Jan 2018.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]