["The video was published here on Facebook on June 4, 2020. It has been viewed more than 25,000 times.", "The 43-second clip shows a dog approaching uniformed police officers after they detained a black man on the street. One police officer is then seen shooting the dog dead with his gun.", "The post’s Sinhala-language caption translates to English as: “Situation in America today / The way a dog that came forward on behalf of its master was killed.”", "The post was published after protests broke out across the US over the death of George Floyd in police custody in Minneapolis on May 25, 2020. His death also sparked global protests against racism and police brutality, as reported here by AFP.", "The video was also shared here and here alongside a similar claim.", "The claim is misleading; the video has circulated since 2013 in reports about an incident in California.", "A reverse image search on Google using video keyframes extracted with InVID-WeVerify, a digital verification tool, found part of the video published in this July 1, 2013 report by the US television channel, NBC Los Angeles.", "The article is titled: \"Video Shows Hawthorne Police Killing Dog While Arresting Owner.\"", "It reads, in part: “An officer shot and killed a Southern California man's dog after it jumped from an open car window and lunged at officers who were taking the Rottweiler's owner into custody on suspicion of interfering with a SWAT stand-off.", "“The Hawthorne Police Department statement continued, \"Fearing that the attacking Rottweiler would imminently bite the officer(s), one officer fired his duty weapon several times, striking and killing the dog.\"", "The clip in the misleading Facebook video corresponds, in part, to the NBC Los Angeles video at the 17-second mark and the one-minute six-second mark.", "Below is a screenshot comparison of the video in the misleading posts (L) and a frame in the NBC Los Angeles clip (R):", "The incident was also reported by local television channels CBS Los Angeles here and WPIX here in July 2013.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]