["“देश मे बढ़ती हुई मुस्लिम आबादी, भारत को मुस्लिम राष्ट्र बनाने की ओर बढ़ता हुआ कदम है और हमारे कुछ गद्दार नेता भी इस काम मे उनके साथ हैं। समय रहते इस पर ध्यान न दिया गया तो बहुत ही गम्भीर समस्या हो सकती है। जनसँख्या नियंत्रण कानून बनाओ, देश को सशक्त ,समृद्ध और खुशहाल बनाओ।” (The growing Muslim population of the country is one more step in the direction of making India a Muslim nation, and some of our traitor politicians are supporting this. If not checked, this can become a serious issue over time. Bring a population control law, make the country strong, prosperous and happy- translation).", "The above message has been shared widely on social media and messaging platforms along with two infographics. In the infographic on the top, a picture of a young girl can be seen. It has been claimed that she is a 14-year old Rohingya Muslim girl named Sakhra, who has a 54 year old husband and has already given birth to two children. It further says that if she has two children at the age of 14 years, she will produce at least 20 children during her lifetime.", "The bottom infographic has a picture of Bihar CM Nitish Kumar along with the words, “हम जनसँख्या कानून नियंत्रण का विरोध करते हैं” (We oppose the population control law- translation).", "देश मे बढ़ती हुई मुस्लिम आबादी, भारत को मुस्लिम राष्ट्र बनाने की ओर बढ़ता हुआ कदम है और हमारे कुछ गद्दार नेता भी इस काम मे उनके साथ हैं।", "समय रहते इस पर ध्यान न दिया गया तो बहुत ही गम्भीर समस्या हो सकती है।", "जनसँख्या नियंत्रण कानून बनाओ, देश को सशक्त ,समृद्ध और खुशहाल बनाओ। pic.twitter.com/e4k0TAhcja", "— Pushpendra Kulshrestha (@Nationalist_Om) June 22, 2019", "The above message and infographic has been posted on Facebook as well.", "देश मे बढ़ती हुई मुस्लिम आबादी, भारत को मुस्लिम राष्ट्र बनाने की ओर बढ़ता हुआ कदम है और हमारे कुछ गद्दार नेता भी इस काम…", "Posted by Bk Mishra on Saturday, June 22, 2019", "It has also been circulating on WhatsApp.", "The above is a classic example of hate-mongering through the use of misinformation. The image of the girl used in the viral message has been lifted from a video report by BBC chronicling the plight of Rohingya refugees fleeing persecution in Myanmar. The video has been posted below. The relevant portion can be viewed from 2:06 to 2:13 minutes. No claim about the young girl bearing children has been made in the BBC footage.", "Using this picture, a story was concocted, which has been circulating in the social media ecosystem since at least 2017.", "Will “Human Rights Wala” Look at her innocence!!#Rohingya girl, just 14 has 2 kids. 1 of the six wife’s of her 56yr old husband Humanity? pic.twitter.com/B4cB3UZHai", "— Raman Malik (@ramanmalik) September 24, 2017", "The second infographic, which has attributed a statement to Bihar CM Nitish Kumar on population control, is based on a 2016 news item. In December 2016, Kumar had slammed BJP MP and Union Minister Giriraj Singh after the latter had suggested nasbandi (sterilization) as a means for effective population control. Nitish Kumar had called Giriraj Singh’s suggestion ‘nonsense’.", "Alt News searched Google with the keywords ‘Nitish Kumar on population control’ and found several news articles which have documented his position on the issue.", "The Bihar CM has repeatedly raised concern over the issue of growing population and had in fact in 2012, suggested stepping up the literacy rate to address the high fertility ratio in Bihar in order to bring it at par with the national average.", "Images showing Rohingya children have been misused in the past. The community has been targeted incessantly through misinformation, with false allegations ranging from child abduction to cannibalism.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]