["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "People wait outside a polling place to cast their ballots in the 2020 on Election Day, Tuesday, Nov. 3, 2020, in Media, Pa. (AP)", "A poll watcher was denied access to one polling site in Philadelphia because the person in charge of that particular polling place was not up to date on the law, which allows watchers to enter any site, not just the ward and division site specified on the watcher’s certificate, said a spokesperson for Philadelphia City Commissioners.", "The spokesperson also said that the same poll watcher went to another site and was allowed to go in, and there is \"no evidence that it was a systemic problem.\"", "As Pennsylvania voters headed to the polls for their last chance to vote in the 2020 election, posts on social media claimed there was a lack of transparency in the election process.", "\"A poll watcher in Philly was just wrongfully prevented from entering the polling place,\" Will Chamberlain, editor-in-chief of the conservative magazine Human Events, tweeted Nov. 3. His tweet includes a video that shows two people standing at a doorway and telling a third person that he cannot go in. \"You are not letting me in?\" the man asks the couple. \"No,\" they replied.", "\"I have a city-wide watcher’s certificate,\" the man starts saying.", "\"It’s not for this location,\" a woman at the door tells him. The man seeking entry tells the couple that the certificate says it’s \"good in every ward and division in the city.\"", "The 33-second video, which has been viewed more than 2.3 million times, ends with the man remaining outside.", "Chamberlain’s tweet was retweeted by Mike Roman, director of Election Day operations for President Donald Trump’s campaign. \"DEMOCRAT ELECTION OFFICIALS BANNING TRUMP POLL WATCHERS IN PHILLY. This is happening all over the City. The steal is on!\" Roman tweeted.", "Kevin Feeley, a spokesperson for the Philadelphia City Commissioners, which is in charge of elections in the city, told PolitiFact that what happened in the video was \"a mistake\" on behalf of the people running the polling site.", "\"It was a misunderstanding of the law,\" Feeley said. However, the man eventually went to another polling site, where staff who better understood the law let him inside, Feeley said.", "Feeley said this is what happened: the poll watcher went to a polling site in Philadelphia this morning, but the judge of election (the person who runs that particular polling place) thought that the watcher could not be let into that particular location, because a ward and division number on the watcher’s certificate did not correspond with that site. That used to be an old rule — that a watcher could only be admitted to a specific ward and division.", "\"That is no longer the law,\" Feeley said.", "The judge of election was eventually told the watcher could be admitted into that location. \"We corrected the problem with the judge of election, we addressed it,\" Feeley said.", "Feeley said that the poll watcher left the site shown in the video and went to another site, \"and the judge there correctly understood the law and (the poll watcher) was admitted into that site.\"", "\"We regret that it happened, it was an honest mistake,\" Feeley said. \"It appears to be the only mistake of its kind.\"", "Chamberlain in a follow-up tweet posted a picture that he said showed the poll watcher’s certificate. The picture says that the watcher’s name is \"Gary Feldman,\" representing Trump.", "The picture of the certificate does not include any other identifying information. PolitiFact was unable to reach Feldman to confirm if he was the person in the video and whether he was able to enter another site as a poll watcher.", "Tweets claimed that poll watchers in Philadelphia were prevented from entering polling places.", "A poll watcher was denied access to one polling site in Philadelphia because the person in charge of that particular polling place was not up to date on the law, which allows watchers to enter any site, not just the ward and division site specified on the watcher’s certificate, said Feeley, a spokesperson for Philadelphia City Commissioners. The same poll watcher went to another site and was allowed to go in, according to Feeley.", "Feeley said that the judge of election who had inaccurate information was updated on the new rules, and that there is \"no evidence that it was a systemic problem.\"", "The posts are partially accurate but leave out important details or take things out of context. We rate them Half True.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Twitter, @WillChamberlain, tweet, tweet, Nov. 3, 2020", "Twitter, @MikeRoman tweet, Nov. 3, 2020", "Phone interview, Kevin Feeley, a spokesperson for the Philadelphia City Commissioners, Nov. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]