["By Angelo Fichera", "Posted on March 10, 2020", "A popular blog post being shared on Facebook falsely claims that former President Jimmy Carter has endorsed Sen. Bernie Sanders for president. The post was lifted — almost verbatim — from an old story about Carter’s support for Sanders’ 2016 bid.", "Former Democratic President Jimmy Carter hasn’t yet endorsed anyone in the 2020 presidential primary, but a story shared by thousands on Facebook falsely claims he has.", "The post, published on March 7 by a blog called “Liberty Inquiries,” has a fictitious headline that reads: “Former President Jimmy Carter Has Endorsed Bernie Sanders.”", "The text of the blog post is actually lifted mostly verbatim from a May 2017 article from the website Talking Points Memo, which reported on Carter’s belated revelation that he voted for Sanders in the 2016 Democratic primary in Georgia.", "Both the blog post and the Talking Points article quote Carter as saying, “Can y’all see why I voted for him?” — something the 39th president actually said at a May 2017 Carter Center event alongside Sanders, referencing the 2016 election.", "But the false blog post now circulating deceivingly frames it as a story about an endorsement for Sanders’ 2020 candidacy.", "The original Talking Points story reads: “Carter previously stayed mostly mum about the 2016 election, declining to endorse either candidate in the primary and quietly endorsing Hillary Clinton in the presidential election, calling her ‘unpopular’ in his endorsement.”", "That was changed in the false blog post to read: “Carter previously stayed mostly mum about the 2020 election.”", "The blog post ends with four sentences about Carter’s time in office; we found that was taken from a brief Carter profile published by the University of Virginia Miller Center.", "The false story appeared in Facebook groups supportive of Sanders and surfaced in the lead-up to the March 10 Democratic contests in six states. The primary election in Georgia, where Carter lives, will take place March 24  — which also disproves the bogus story, whose first sentence says Carter “slyly revealed who he voted for in the Democratic primary Monday.”", "We could find no record of Carter endorsing any candidate in the primary yet — and it’s unclear if he will. He did not announce an endorsement in the 2016 primary, and didn’t publicly reveal his vote for Sanders until 2017.", "In September 2019, Carter was asked about what the 2020 Democratic candidates should be talking about. He emphasized his desire to see them promote world peace and human rights. He said at the time that he hadn’t settled on a preferred candidate.", "“I’m going to vote for one of them and I haven’t decided yet which one,” he said. “I voted for Bernie Sanders last time … but I’m going to keep an open mind. One of the major factors that I will have in my mind is who can beat Trump. Because I think it would be a disaster to have four more years of Trump.”", "A USA TODAY/Suffolk Poll in 2019 asked likely Democratic voters about the effect of past presidential nominees’ endorsements for 2020; 11 percent of those surveyed said an endorsement by Carter would influence their vote.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2020 State Elections and Voter Registration Calendar.” Georgia Secretary of State. Accessed 10 Mar 2020.", "“A Conversation with the Carters (Sept. 17, 2019).” The Carter Center. YouTube. 23 Sep 2019.", "Page, Susan, et. al. “How much sway do past Democratic nominees have? Unless you’re Barack Obama, not much.” USA Today. 1 Nov 2019.", "Salaky, Kristin. “Jimmy Carter Reveals That He Voted For Bernie Sanders In Democratic Primary.” Talking Points Memo. 9 May 2017.", "Strong, Robert A. “Jimmy Carter: Life in Brief.” Miller Center, University of Virginia. Accessed 10 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]