["About this rating", "In a speech given in January 2018, Biden did say he had \"no empathy\" for the plight of younger people. However...", "Biden was making a specific and emphatic comparison between the relative progress and civility of the present moment, on one hand, and the upheaval and civil discord of his own youth, in the late 1960's. He was not speaking in general or absolute terms.", "In May 2019, Joe Biden, former U.S. vice president and 2020 presidential candidate, came under renewed scrutiny for purportedly saying he had \"no empathy\" for the plight of younger people.", "On 2 May, the Twitter account @IbrahimAS97 posted a 16-second video of Biden on a stage and in conversation with an interviewer. The tweet contained the following excerpted quote: \"The younger generation now tells me how tough things are, give me a break ... I have no empathy,” while the video featured a longer portion of Biden's remarks:", "\"... And so, the younger generation now tells me how tough things are — give me a break! [Audience laughs and applauds]. No no, I have no empathy for it. Give me a break. Because here's the deal, guys — we decided we were going to change the world, and we did. We did ...\"", "“The younger generation now tells me how tough things are, give me a break ... I have no empathy” - Joe Biden pic.twitter.com/UWswJDJLMI", "— Ibrahim (@IbrahimAS97) May 3, 2019", "The viral spread of @IbrahimAS97's tweet in May 2019 prompted several Snopes readers to inquire about any wider context or meaning behind Biden's comments.", "Biden did indeed say he had \"no empathy\" for the plight of younger people, but he was not speaking in general or absolute terms. Rather, he was making a specific, emphatic comparison between the relative progress and civility of the present moment, on one hand, and the upheaval and civil discord of his own youth, in the late 1960s. That important context was not shown in the viral 16-second clip posted to Twitter by @IbrahimAS97.", "The former vice president made the remarks in question on 10 January 2018, during his appearance at the Los Angeles Times \"Ideas Exchange\" at the Orpheum Theatre in Los Angeles. His appearance was partly centered around his book “Promise Me, Dad: A Year of Hope, Hardship, and Purpose.”", "The Times published an edited, two-minute video excerpt of Biden's conversation with columnist and author Pat Morrison. It's not clear what immediately preceded and followed those portions of the discussion, although the interview appears to have been wide-ranging and eclectic, according to two reports published by the Times afterwards. The following is a transcript of the edited exchanges shown in that two-minute clip:", "Morrison: ...And that's a lot of what the book is about -- the public service that your son [Beau Biden] did, as well as you and your family. His commanding general in Iraq said he expected that your son would be leading the country one day. And yet, public service seems now not to be held in very high esteem. [Audience laughs].\nBiden: No, it's not. And -- no, it's no just because -- I'll be very blunt -- it's not just because of our president, it's a whole lot of things...", "[Video cuts]", "Biden: ...I only had two political heroes in my whole life -- and this is not new, I've said this since 1972 -- Dr. [Martin Luther] King and Robert Kennedy. And up to that point there was a war raging, there was a bitter fight over even whether we should talk about the environment, women were still viewed as second-class citizens and not prepared to have significant jobs -- thought that. And we were told -- people didn't talk to one another over the war -- and we were told 'Drop out, go out to Haight-Ashbury, get engaged.' You know, shortly after I graduated in '68, Kent State, 17 kids shot dead. And so, the younger generation now tells me how tough things are -- give me a break! [Audience laughs and applauds]. No no, I have no empathy for it. Give me a break. Because here's the deal, guys -- we decided we were going to change the world, and we did. We did. We finished the civil rights movement to the first stage. The women's movement came into being. So my message is 'Get involved.' There's no place to hide. You can go out and you can make all the money in the world, but you can't build a wall high enough to keep the pollution out. You can't not be diminished when your sister can't marry the man or woman, the woman she loves. You can't -- when you have a good friend being profiled -- you can't escape this stuff. And so, there's an old expression my philosophy professor would always use, from Plato: The penalty good people pay for not being involved in politics is being governed by people worse than themselves. It's wide open, go out and change it.", "We were not able to obtain any more footage from Biden and Morrison's conversation, but based on a summary of the event that the Times subsequently published, there does not appear to have been anything within the discussion which would alter the meaning or sense of Biden's \"empathy\" remarks.", "As shown in @IbrahimAS97's viral May 2019 video, Biden did say he had \"no empathy\" for the plight of younger people. However, the 16-second clip did not show the former vice president making a specific, emphatic comparison between the relative calm of the present moment and the social and political tumult of his own youth in the late 1960s. He was not saying, in absolute or general terms, that he had no empathy for younger people.", "In omitting this important context, IbrahimAS97's video gives an incomplete and somewhat misleading presentation of what Biden actually said.", "Biden's 2020 presidential campaign declined to comment for this fact check.", "Mai-Duc, Christine.  \"Joe Biden to President Trump: 'Grow Up.'\"\r\n  The Los Angeles Times.  10 January 2018.", "Mai-Duc, Christine.  \"Oprah Needs Foreign Policy Experience, Garcetti is 'Smart as Hell' and Other 'Bidenisms' From the L.A. Times Ideas Exchange.\"\r\n  The Los Angeles Times.  11 January 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]