["In an attempt to condemn media manipulation, Twitter user @doveywan juxtaposed two images, one of a large fire in front of the Arc de Triomphe, a Paris landmark, and another of a toy scooter on fire, surrounded by individuals capturing the seemingly inconsequential moment. The caption, \"perspective matters,\" suggests that content-hungry journalists manipulated images and thus distorted reality. The tweet was shared more than 35,000 times.", "But, the alleged example of media manipulation in the aforementioned tweet and others in the same vein in English and Spanish is not an accurate characterization of manipulated \"perspective.\" These photos were taken at a separate place and time… and no shot of a toy scooter on fire in front of the Arc de Triomphe in Paris was found by AFP in any news media.", "In Spanish, the juxtaposition was framed as, \"Here is how photographers covering a demonstration in Paris turn a small fire into hell.\" This website flatly accuses AFP of deception… even though AFP did not take either photograph.", "The first image was taken on December 1, by Katerine Pierre, a photographer for Hans Lucas agency. It can be found here (number 35).", "The second photo was taken on December 8 on Friedland avenue in Paris by a staff photographer at French magazine Le Point, who posted it on Twitter. It is unclear whether the four individuals capturing the scene are journalists.", "Une trottinette brûle avenue de Friedland. pic.twitter.com/uKIyMhYqVP", "The juxtaposition of two photos from two different weekends is a clever move: by positioning oneself on the spot where the burning scooter was photographed, on Friedland avenue in Paris, the perspective of the Arc de Triomphe is the same.", "Here is a juxtaposition of both photos:", "The two photos above are not of the same place. Place de l’étoile, the square on which the Arc de Triomphe sits, is the converging point for 12 large avenues, and the perspective from each of them can include the iconic white stone structure. The Hans Lucas photo was taken on the avenue exactly opposite of the Arc de Triomphe, Foch avenue.", "This is verifiable by looking at: 1) this lamp post 2) this stoplight 3) this fence and the beginning of Traktir Street on the right.", "This debunk illustrates the globalized nature of disinformation: the information was verified by our journalist in Mexico City after she was alerted by a Chilean national who had noticed the image. An AFP Factuel journalist contributed to the verification from Paris.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]