["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A radio station Instagram account gets to $2,400 a month by multiplying $600 times four weeks. But that amount is not available to all Americans. The $600 a week is for unemployed people eligible for federal help.", "The $600 a week benefit under the Federal Pandemic Unemployment Compensation is only available through the end of July.", "An Instagram post from a New York radio station misleads by claiming that there’s $2,400 a month that people can get from the government besides the one-time $1,200 stimulus check.", "\"The (CARES) Act saw the Treasury Department send $1,200 stimulus checks to millions of eligible Americans. ⁠What many citizens might not know though is that those checks aren't the ones available to them, in fact, a lot of people can get an additional $2,400 — and they can do it every month!\" said a Power 105.1 Instagram post from May 19.", "The post image shows a person’s hand raising dollar bills, below it is text that says: \"There’s another $2,400 a month from the government you can get right now.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Instagram is owned by Facebook.", "The Instagram post directs to a link that clarifies that the additional $2,400 a month isn’t as available as was the one-time $1,200 stimulus check. It says that unemployed Americans can get $600 a week, or $2,400 a month, if they qualify for federal unemployment help under the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act.", "The U.S. Department of Labor says that the $600 a week benefit under the Federal Pandemic Unemployment Compensation is only available through the end of July. The radio station does not make that clear.", "Several Instagram users commented on the post, calling it \"very misleading\" and \"click bait.\"", "\"Stop giving us fake news,\" wrote one user.", "The Instagram post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Instagram, Power 105.1 post, May 19, 2020", "Power105.1iheart.com, There's Another $2400 A Month From The Government You Can Get Right Now, May 19, 2020", "U.S. Department of Labor, U.S. Department Of Labor Publishes Guidance on Federal Pandemic Unemployment Compensation, April 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]