["Social media has been rife with claims that Russia’s President Vladimir Putin recently issued a law prohibiting Muslims in the country from marrying non-Muslims.", "A musl!m man cannot marry non-musl!m woman in Russia. Ordered by President Vladimir Putin", "Posted by The Innocent Politician on Wednesday, November 18, 2020", "This claim is viral on Twitter, garnering thousands of likes. @ThePushpendraK, @_Pb_swain_, @dixit_purva are some of the prominent names among the users circulating the claim.", "A website named ‘Humlog’ also made this claim in an article dated November 20. (Archive link)", "Alt News did not find any reports about an announcement by the Russian government that Muslims could no longer marry non-Muslims.", "However, a report published in Moscow Times on November 12 stated that a group of Russian Muslim scholars decided to ban non-Muslims from marrying Muslims in a ruling that sparked a lot of criticism across the country. According to the report, “The ruling by the Spiritual Administration of Muslims of Russia (DUM)’s advisory council of scholars says that interfaith marriages between Muslim men and non-Muslim women are allowed ‘in isolated cases’ that only local muftis can approve.”", "“The DUM scholars later clarified that non-Muslim women could marry Muslim men as long as they ‘respect Islamic canon and don’t prevent husbands from raising children in Islamic traditions,’” stated the Moscow Times article. This information was also published on the DUM website.", "Since the move was heavily criticized, the first deputy chairman of DUM, Damir Mukhetdinov, clarified that Russia is a secular country and the Council’s decision did not reflect the Russian Federation’s policies in any way. This information was also released on the DUM website on November 10. Media website RFE/RL covered the controversy surrounding the clerics’ ruling to ban interfaith marriages and how it had no bearing given Russia’s secular status.", "Therefore, the Russian government has not made any policy or announcement banning Muslims from marrying people of other religions. However, an Islamic religious institution had issued such a ruling some time ago, generating a lot of backlash.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]