["By Angelo Fichera", "Posted on November 15, 2019", "A meme falsely attributes a quote to CNN anchor Don Lemon about Islamic State leader Abu Bakr al-Baghdadi’s death.", "A popular meme circulating on Facebook wrongly attributes a quote to Don Lemon, the CNN anchor who hosts “CNN Tonight.”", "The meme — which uses photos of Lemon and the Islamic State leader Abu Bakr al-Baghdadi, who died during a U.S. raid last month — purports that Lemon said that President Donald “Trump killed an unarmed father of three.”", "“Yes, the idiot really said this on live television,” the meme continues.", "The meme claims that Lemon made the remark on Oct. 27 — a Sunday, and the day Trump publicly announced al-Baghdadi’s death. But in reality, Lemon’s show only airs on weekdays and a CNN spokeswoman confirmed to FactCheck.org that Lemon was not on air that day.", "We also checked CNN’s transcripts for episodes of “CNN Tonight” for the days following al-Baghdadi’s death and found no instances of Lemon saying the dubious quote.", "Other fact-checkers, including PolitiFact, have written about very similar images that were manipulated to look as if the “unarmed father of three” reference appeared in a chyron on CNN — which it didn’t.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Jones, Christal. Spokeswoman, CNN. Email to FactCheck.org. 15 Nov 2019.", "“Remarks by President Trump on the Death of ISIS Leader Abu Bakr al-Baghdadi.” White House. 27 Oct 2019.", "“Transcripts – CNN Tonight.” CNN.com. Accessed 15 Nov 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]