["By Lori Robertson", "Posted on October 20, 2016", "In the final presidential debate, Hillary Clinton claimed that her proposals would “not add a penny to the debt.” But a nonpartisan budget watchdog group estimates that what she has detailed thus far would add $200 billion to the debt over 10 years.", "The same budget experts estimate Trump’s proposals would add significantly more — $5.3 trillion — to the debt over 10 years. Clinton, however, made the misleading claim that Trump’s tax cuts would “add $20 trillion to the debt.” That’s a two-decade figure — a point Clinton leaves out — and it doesn’t account for any spending cuts Trump has proposed.", "And these budget estimates are on top of the $9 trillion growth in the federal debt projected under current law over the next decade.", "The Democratic nominee made the disputed boast about her plans a few times during the debate, telling moderator Chris Wallace at one point: “But if you look at the debt, which is the issue you asked about, Chris, I pay for everything I’m proposing. I do not add a penny to the national debt.” And in one instance, she drew the misleading comparison to Trump’s tax plan.", "Clinton, Oct. 19: I also will not add a penny to the debt. I have costed out what I’m going to do. He will, through his massive tax cuts, add $20 trillion to the debt.", "This isn’t the first time Clinton has claimed she would pay for all of her initiatives, and as we’ve said before, we can’t predict the future, of course. But the nonpartisan Committee for a Responsible Federal Budget has analyzed both of the candidates’ spending and revenue proposals, finding that neither pays for everything they’ve put forth.", "It’s true that Clinton comes a lot closer to paying for her spending proposals than Trump does in covering his tax cuts, according to the CRFB analysis, but she would add well more than a penny to the debt under what she has detailed thus far. CRFB estimates, updated as of Sept. 21, found that Clinton’s plans “would increase the debt by $200 billion over a decade above current law levels.” Trump’s proposals “would increase the debt by $5.3 trillion.”", "Those numbers include “rough and preliminary estimates” of new policies that the candidates announced after CRFB did its initial report in June, when it had calculated higher debt-increasing numbers for both Clinton and Trump.", "The group, which was founded by a former Democratic and a former Republican lawmaker in 1981, wrote that Clinton could pay for all of her proposals, and even cause a “modest deficit reduction,” if she released details on her business tax changes that she says would cover her infrastructure plan. CRFB said that Clinton could generate $275 billion over 10 years, enough to make up her gap, through a business tax plan, but the campaign hasn’t provided specifics on that proposal.", "As for the comparison to her opponent, Clinton could have cited CRFB’s sizable $5.3 trillion estimate for what Trump’s proposals would do to increase the debt over a decade — but she went much further than that, claiming a $20 trillion increase, nearly four times what the CRFB’s budget experts estimated. Where did she get her figure? The $20 trillion figure is an estimate for what Trump’s tax plan alone would add to the debt, including interest costs, over 20 years.", "It comes from the Urban-Brookings Tax Policy Center, which said in its Oct. 18 report on Trump’s revised tax plan: “Federal revenues would fall by $6.2 trillion over the first decade before accounting for added interest costs and macroeconomic effects. Including those factors, the federal debt would rise by at least $7.0 trillion over the first decade and by at least $20.7 trillion by 2036.”", "That analysis is only of Trump’s tax plan. Although Trump’s spending cuts are far from sufficient to pay for his tax cuts, according to CRFB’s analysis, he has proposed a spending reduction of $1.2 trillion net over a decade.", "Clinton’s tax plan, meanwhile, would reduce the federal debt. The Tax Policy Center found that her plan “would increase revenue by $1.4 trillion over the next decade, before accounting for reduced interest costs and macroeconomic effects. Including those factors, the federal debt would be reduced by at least $1.5 trillion over the first decade and by at least $5.4 trillion by 2036.”", "But, as CRFB has explained, Clinton has proposed several spending initiatives as well. And as we said, CRFB’s estimates are on top of what projections show would happen under current law — which is a $9 trillion increase in the debt over 10 years.", "So even if Clinton is able to pay for all of her plans, the debt would still increase by trillions over the next decade without additional budget maneuvers to change that.", "https://www.sharethefacts.co/share/06d346e4-f186-4e96-81c9-48fa60a2471a", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]