["By Saranac Hale Spencer", "Posted on November 15, 2019", "A meme circulating on Facebook exaggerates the role played by President Donald Trump in funding a 1995 Veterans Day parade in New York. He donated $200,000, which was less than 10% of the total raised, according to press reports at the time.", "When President Donald Trump was a real estate developer in New York City in 1995, he donated money to an organization hosting a parade in the city on Veterans Day.", "That fact has been exaggerated in a Facebook meme that claims: “25 years ago, the City of New York refused to fund the Veterans Day Parade. Donald Trump financed it!”", "Trump didn’t pay for all of it, but he did make a contribution that organizers credited with jump-starting their fundraising.", "“Donald Trump saved the parade,” the parade director reportedly said at the time. News stories put Trump’s donation at $200,000 and the total cost of the parade at more than $2 million. One story also said Trump, who was the grand marshal of the parade, was given the honor in exchange for his donation.", "Trump explained in his own words how he became the grand marshal during an appearance on “The Howard Stern Show” two days before the parade.", "Robin Quivers, Nov. 9, 1995: How’d you get to be the grand marshal?", "Trump: Well, it seems that they went to numerous corporate people in America and a lot of people didn’t step up to the plate.", "Stern: And you did.", "The organization that hosted the event, the United War Veterans Council, didn’t return our calls and the nonprofit organization’s tax forms from that year aren’t available online. But press reports at the time estimated Trump’s donation to be $200,000, and said that he helped raise more from other businesses.", "His participation in the parade was a point of pride for Trump, who did not serve in the military himself. As a candidate for president in 2015, Trump was asked how he had “best demonstrated patriotism.” He called his role in the parade “one of my proudest accomplishments.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“More than 500,000 watch Nation’s Parade.” United Press International. 11 Nov 1995.", "Blood, Michael. “Nation’s Parade on Veterans Day Marks End of World War II.” Associated Press. 11 Nov 1995.", "Agostini, Evan. “The Nation’s Parade On Veterans Day.” Getty Images. 10 Nov 1995.", "Martin, Douglas. “Veterans Day Parade Tries for a Comeback.” New York Times. 10 Nov 1995.", "“Presidential hopefuls discuss patriotism on July 4th.” Des Moines Register. 4 Jul 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]