["Sen. Joe Manchin, D-W.Va., speaks to reporters after a debate with his Republican challenger, Patrick Morrisey, on Nov. 1, 2018, in Morgantown, W.Va. (AP/Raymond Thompson)", "Did Sen. Joe Manchin, D-W.Va., say he wanted to \"beat the living crap out of\" his Republican opponent during a debate with his Republican opponent, Republican Patrick Morrisey? The West Virginia Republican Party says so.", "On Nov. 3, the West Virginia Republican Party tweeted, \"What did Joe Manchin say about civility? Today, he said he wanted to ‘beat the living crap out of’ his Republican opponent during their debate, at a campaign rally in Marmet. #WVSen\"", "What did Joe Manchin say about civility? Today, he said he wanted to \"beat the living crap out of\" his Republican opponent during their debate, at a campaign rally in Marmet. #WVSen https://t.co/2QwJcCbL3A", "The tweet linked to an article in the Washington Free Beacon, a conservative publication, that included verbatim text from the campaign appearance in Marmet, W.Va., as well as an audio clip.", "Here’s what Manchin said:", "\"You might have seen the debate the other night. (Applause) I want to tell you something. It took every bit of my discipline not to beat the living crap out of them. You don't come to someone's state. You don't come in here and not knowing who we are and just be spewing out horrible things. Every other word was trust, liberal, trust, dishonest, and I'm thinking, ‘Trust?' Here's a man who ran for Congress, Patrick Morrisey ran for Congress in New Jersey in 2000. He ran in the primary and got beat, only got 9 percent of the vote. Who trusts who?\"", "Morrissey picked up on the \"beat the living crap\" remark, tweeting that \"the national media should look at so-called Mr. Civility in action.\"", "But the West Virginia Republican Party’s tweet twisted Manchin’s words by not reporting his entire remark.", "In Marmet, Manchin did express his frustration with Morrisey’s attacks in the recent debate -- enough frustration to feel an impulse to \"beat the living crap out of\" his opponent.", "But the tweet leaves out an element of what Manchin said -- that \"it took every bit of my discipline\" not to do it. In other words, by the time he was speaking in Marmet, he had already extinguished that impulse.", "That said, even what Manchin did say does seem to conflict with a prior pledge in favor of civility.", "In February 2018, Manchin took to the Senate floor to pledge \"an era of bipartisan cooperation and agreement in order to restore civility to the United States Senate and our political discourse.\" Manchin urged his colleagues to join him in co-signing his pledge and \"taking the first step to show the American people that they are here to work towards a better United States.\"", "The West Virginia Republican Party tweeted, \"What did Joe Manchin say about civility? Today, he said he wanted to ‘beat the living crap out of’ his Republican opponent during their debate, at a campaign rally in Marmet. #WVSen\"", "This uses a portion of Manchin’s remarks, leaving out the fact that Manchin had prefaced that comment by saying, \"It took every bit of my discipline not to\" beat up Morrisey. That said, even the substance of what Manchin did say conflicts with a high-profile civility pledge he made in February 2018.", "The tweet needs clarification, so we rate it Mostly True.", "West Virginia Republican Party, tweet, Nov. 3, 2018", "Washington Free Beacon, \"Manchin: ‘It Took Every Bit of My Discipline Not to Beat the Living Crap Out’ of Republican Opponent,\" Nov. 3, 2018", "Washington Free Beacon, audio clip of Joe Manchin, published Nov. 3, 2018", "Patrick Morrissey, tweet, Nov. 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]