["About this rating", "In perhaps one of the worst miscalculations in modern political history, Adolf Hitler was appointed chancellor of Germany in January 1933 in the hopes that he could successfully form a coalition government amidst a collection of competing minority parties (including his own Nazi Party) and that the worst impulses of Hitler and the Nazis could be \"controlled\" or \"tamed\" once they bore responsibility for leading the national government (rather than criticizing others' administration of it).", "But shortly after Hitler's swearing-in as chancellor on Jan. 30, 1933, the Nazis began to systematically suspend civil liberties and eliminate political opposition, with the passage of the Enabling Act two months later effectively establishing Hitler's government as a legal dictatorship that could issue decrees without the involvement of the German parliament (Reichstag) or president.", "One example of the naïveté that held sway in Germany at that time caught the attention of Americans in February 2020, in the wake of impeachment proceedings against U.S. President Donald Trump.  That example took the form of a snippet from a purported 1933 Wall Street Journal article which was widely circulated via social media:", "This article did in fact appear in the Feb. 2, 1933, edition of the Wall Street Journal (WSJ).  Under the headline \"Berlin Views Hitler Calmly,\" the report from the WSJ's Berlin bureau briefly referenced contemporaneous assessments of Hitler -- that \"there is usually wide discrepancy between the speeches of opposition politicians and the actions of the group when it gains power,\" that Hitler would not \"disrupt the nation's affairs,\" that it was \"not believed\" Hitler would \"accomplish a change in the constitution\" -- and that a rise in stock prices indicated public confidence in these assessments:", "Rise in Stocks Reflects Confidence He Will Not Disrupt Nation's Affairs", "Berlin is settling down to pass judgment on political developments. Politicians, economists and bankers declare there is usually wide discrepancy between the speeches of opposition politicians and the actions of the group when it gains power.", "Consequently, it is not believed that Hitler will accomplish a change in the constitution or that [Reich Minister of Economics Alfred] Hugenberg will bring about a general reduction of interest rates. The government wants to obtain an adjournment of the Reichstag for several months, but it is questionable whether the Centre [Party] will approve of such action.", "After calmly dismissing the threat that Hitler posed (and which would come to pass in just a few short months) the article provided a short summary of the \"considerable gains in stocks\" that supposedly indicated good times were ahead under the new government -- including, ironically, a rise in the price of stock in I.G. Farben,  the German chemical company that manufactured the Zyklon B gas later used to kill millions of Jews during the Holocaust:", "The Boerse closed with considerable gains in stocks. Rhenish Coal advanced 7, Mannesmann Tube 5, I.G. Farben 4 and Rhine-Westphalia Electric 4. Bonds registered average losses of 2 points.", "Common stocks were favored as being less susceptible to talk of devaluing the currency or of other inflationary experiments. Furthermore, profits are expected to increase for many industries from expanded public works projects.", "The Wall Street Journal.   \"Berlin Views Hitler Calmly.\"\r\n    1 February 1933   (p. 12)", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]