["Titled “रॉबर्ट क्लाइव द्वारा लिखी गई बात” (Words written by Robert Clive) is a post shared by the Facebook page Doval Fan Club on June 4, that claims that these are the words written by the Commander-in-Chief of British India, Robert Clive in his autobiography.", "The page has nearly 40 lakh followers and the share count for this post is massive. When last checked, close to 70,000 Facebook users had shared it. It says: “When we won the first battle to colonise India and took out celebratory processions, Indians clapped in our honour. They rejoiced at the loss of their own kings. If every Indian had at the time picked up a stone and thrown at us, India would’ve gained her freedom in the year 1700 as we (Britishers) were only 3,000 in number” (translated). The post ends with the comment: “Even today India has not improved. Our condition prevails.”", "Posted by Doval Fan Club on Monday, June 4, 2018", "The image of the text has also been shared by individual users across social media platforms.", "The post has some blatant slights that betray its falseness. The extract from the autobiography mentions neither date nor source, but it does mention a year when an apparent war took place and Indians celebrated a British victory. To understand the text and context, we need to go back in time during the advent of the British East India Company and the role Robert Clive played in the politics of the subcontinent.", "Firstly, the post claims Clive wrote that Indians were busy celebrating a British victory and that “had they thrown stones at Britishers instead of rejoicing their own loss, India would have gained freedom in the year 1700”. However, Clive was born in 1725. It is thus impossible for him to have written his autobiography chronicling the late 17th century.", "Secondly, it talks about the “first battle to colonise India”. Let us take a look at the history of the East India Company and its attempt to gain a foothold in India in the 18th century when the subcontinent was parceled out into numerous kingdoms.", "The British East India Company (EIC) was founded in 1600 as a private joint stock company to trade with East Indies (present-day maritime Southeast Asia), mainly for spices. The establishment of the company kick started an era that culminated in British hegemony. Its interests shifted to building an empire in India after the East Indies came under the control of the Dutch. With the Mughal empire only a shadow of its former glory after the death of Aurangzeb, the EIC fought with the French East India Company which was locked in a contest with the British for supremacy over the subcontinent, and later with Mysore, Hyderabad and the Marathas, ultimately emerging victorious. It was however the conquest of Bengal which laid the foundation for British rule in India.", "The Battle of Plassey, fought in 1757 between the East India Company army and Siraj-ud-Daulah, the Nawab of Bengal ended in a crushing defeat for the latter and marked the first serious territorial conquest for the company. It was in this battle that the British contingent led by Robert Clive had a troop strength of 3,000 (of which only 650 were English soldiers), suggesting that the Doval Fan Club post might be referring to the Battle of Plassey. However, the battle was fought in 1757 unlike the war mentioned in the post, dated 1700.", "Thirdly, all information given in the post is attributed to an autobiography. Alt News searched and found that no autobiography had been written by Robert Clive.", "Clive died a rich man in 1774, owing to his success as a military general and civil administrator. He was twice appointed governor of Bengal, first in 1757 and later in 1765. His crowning glory is arguably the Treaty of Allahabad, signed in 1765 which granted the company the right to collect ‘Diwani’ or revenue on behalf of the empire in Bengal, Bihar and Odisha and opened the flood gates for British domination. The treaty was the outcome of the victory of the British over the combined might of the Nawab of Bengal, Nawab of Awadh and Mughal emperor Shah Alam II in the Battle of Buxar in 1764. The treaty enabled the company’s employees to exact revenue from these provinces which were plundered mercilessly. They were also permitted to engage in private trade. Clive made a fortune during his stint as the governor of Bengal which he then repatriated to England.", "History has always been a contested battle ground for ideological face-offs, and the use of history to further favourable narratives has been a tried and tested strategy. However, for fake news peddlers, history is more convenient than contested. It is easy to manipulate history by making false claims which lay readers may rarely ever be inclined to verify. This plays into the hands of purveyors of misinformation who are encouraged by the fact that readers are likely to believe what is presented.", "Donate Now", "Follow @free_thinker", "What’s in a name? Apparently, a lot, if social media trends and raging political discourses…", "As Karnataka is set to go to the polls in two months’ time, all parties…", "The Qutub Minar is a UNESCO world heritage site in South Delhi. The name literally…", "On February 21, external affairs minister S Jaishankar gave an interview to ANI journalist Smita…", "An image of an apparently ancient sculpture is viral with the claim that it was…"]