["The photo was published on Twitter here on March 16, 2021.", "The tweet reads: “Many peaceful protesters are brutally and mercilessly arrested. More than 120 civilians were killed and thousands were injured by Junta after 42 days Coup. They turn Myanmar to slaughter ground.”", "The post circulated as Myanmar security forces continue to violently crack down on  anti-coup protests, which erupted after the military seized power from the former civilian government on February 1, 2021, as AFP reported here.", "Assistance Association for Political Prisoners, a local monitoring group, stated on March 16, 2021, that at least 180 people have been killed since the unrest began, AFP reported here.", "The photo has also appeared alongside a similar claim here, here and here, where it has been retweeted more than 220 times.", "The picture was also posted with a similar claim on Korean discussion forum Gasengi here.", "The claim, however, is false.", "A keyword search on Google has found the same photo published here on Myanmar Update News, a local news website, on July 3 2020, nearly seven months before Myanmar’s military coup.", "The article is titled: “Images of Hpakant landslide burying unidentified victims”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the Myanmar Update News photo (R):", "The photo was also published on a blog here on July 2, 2020. The post is titled: “Hpakant landslide update”.", "Hpakant is a township in Kachin state, in northern Myanmar.", "As AFP reported here on July 2, 2020, more than 160 jade miners were killed in Hpakant following a landslide that occurred after heavy rain in the area.", "Similar photos of the landslide fatalities were also published in July 2020 by local news organisations such as Narinjara here and Khit Thit News here, and by local photographer Zaw Moe Htet here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]