["Sen. Tom Coburn, R-Okla., said on MSNBC's \"Morning Joe\" that violent crimes in national parks fell 85 percent after a gun ban was lifted in 2010. Is that correct?", "During an interview on the MSNBC show Morning Joe, Sen. Tom Coburn, R-Okla., argued for legislation he’s proposing that would allow guns to be carried into lands controlled by the Army Corps of Engineers.", "To make the case that guns make places safer, Coburn cited a dramatic before-and-after statistic that stems from the lifting of a ban on guns in national parks. Coburn was a leader in the effort to get Congress to approve the change. President Barack Obama signed the national park provision into law, and it took effect in February 2010.", "\"In 2010,\" Coburn said on Morning Joe, \"everybody said you can't dare let guns go into the national parks, and of course the rapes, murders, robberies and assaults are down about 85 percent since we did that.\"", "That’s a pretty stunning drop. Is it accurate?", "When we checked with Coburn’s office, John Hart, a spokesman, acknowledged that his senator had misspoken in a way that overstated the decline.", "Hart said Coburn’s office had compared FBI crime data on National Park Service land from 2008 to 2011, the most recent year available. By the office’s calculations, the number of violent incidents actually dropped by 12 percent, not 85 percent.", "\"The numbers show crime rates have declined, but he misspoke when he mentioned 85 percent,\" Hart said. \"On balance, the facts support our conclusion that crime rates would go down under our policy, not the conclusion of the amendment’s critics who said that allowing guns in national parks would lead to more crime.\"", "However, before we bless Coburn’s revised analysis, let’s look at the original data. Here’s a summary chart for violent crimes in the national parks between 2008 and 2011.", "Year", "Murder and", "non-negligent manslaughter", "Forcible rape", "Robbery", "Aggravated assault", "Total violent crimes", "2008", "5", "37", "66", "259", "367", "2009", "3", "34", "64", "206", "307", "2010", "15", "45", "58", "251", "369", "2011", "7", "34", "58", "224", "323", "Change, 2008-11", "+40%", "-8%", "-12%", "-14%", "-12%", "Change, 2009-11", "+133%", "0", "-9%", "+9%", "+5%", "A few issues jump out to us. First, murders actually went up between 2008 and 2011, contrary to what Coburn said.", "More importantly, using 2008 as the \"before\" year in this before-and-after comparison amounts to cherry picking.", "As we noted, the law went into effect in 2010, so the most obvious way to frame the comparison would be to use the data from 2009 (the last full year before the gun ban was lifted) and 2011 (the most recent year). And as it turns out, the comparison to 2009 is not nearly as favorable to Coburn’s overall point.", "Between 2009 and 2011, these four categories of violent crimes actually rose collectively by 5 percent. Robberies did decline by 9 percent, but murders more than doubled (from a very small base), the number of rapes was stable and the tally of aggravated assaults -- by far the most common of these four crimes -- rose by 9 percent.", "Meanwhile, it’s also worth noting that the number of crimes in national parks is generally pretty small, which makes it unclear how much stock anyone should place in year-to-year percentage increases and decreases.", "Finally, we’ll point out that Coburn’s stated decline may -- or may not -- have been caused by the deterrence of having guns around. But if they were a cause for the decline from 2008 to 2011, what’s to stop someone from arguing that they were the cause of the increase from 2009 to 2011? The numbers alone simply don’t tell us.", "Our ruling", "On Morning Joe, Coburn said, \"In 2010, everybody said you can't dare let guns go into the national parks, and of course the rapes, murders, robberies and assaults are down about 85 percent since we did that.\"", "Coburn’s office acknowledges that he misspoke; they actually calculated a decline of 12 percent, which is dramatically lower than 85 percent.", "But we find even the revised statistic to be questionable. It hinges on using 2008 data, when 2009 data would be more appropriate -- and a comparison using data from 2009 actually shows an increase in violent crime in national parks since the gun ban was lifted. Meanwhile, it’s far from clear that guns had an influence on the relatively small number of crimes that take place in national parks.", "We rate Coburn’s statement False.", "Tom Coburn, interview on MSNBC’s Morning Joe, May 9, 2013", "FBI, \"Offenses Known to Law Enforcement, by State, Tribal, and Other Agencies,\" 2008", "FBI, \"Offenses Known to Law Enforcement, by State, Tribal, and Other Agencies,\" 2009", "FBI, \"Offenses Known to Law Enforcement, by State, Tribal, and Other Agencies,\" 2010", "FBI, \"Offenses Known to Law Enforcement, by State, Tribal, and Other Agencies,\" 2011", "NBC News, \"New law allows loaded guns in national parks,\" Feb. 19, 2010", "Public Employees for Environmental Responsibility, \"Rising Tide of Violence,\" accessed May 9, 2013", "Email interview with Jeff Ruch, executive director for Public Employees for Environmental Responsibility, May 9, 2013", "Email interview with Kurt Repanshek, founder and editor-in-chief of National Parks Traveler, May 9, 2013", "Email interview with Mike Litterst, acting chief spokesman for the National Park Service, May 9, 2013", "Email interview with John Hart, spokesman for Tom Coburn, May 9, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]