["About this rating", "At the end of 2016, images (often unaccompanied by any explanatory news story) began circulating online suggesting that California's iconic \"Hollywood\" sign had been altered to read \"Hollyweed\" (presumably as an homage to the state's recent passage of Proposition 64, which legalized recreational use of marijuana beginning in 2018).", "Owing to the number of humorous digitally created images to be found on the Internet at any given time, a skeptical social media public was unsure if the \"Hollyweed\" picture was one of the funny-but-not-real photographs going viral on any given day. But it was true that the sign was briefly altered to read \"Hollyweed\" on the night of 31 December 2016, an event that was extensively covered by local news outlets:", "Authorities say someone managed to modify the famed Hollywood sign to read “Hollyweed” in an overnight act of trespass.", "Sgt. Guy Juneau with the Los Angeles Police Department’s Security Services said the incident unfolded around midnight after a thrill-seeker climbed the mountain and threw two tarps over the “O’s” to make them appear like “E’s.” It was caught on city surveillance cameras.", "The Perrot family visiting from Australia said they noticed the sign from their hotel. At the time, it read “Hollywoed,” while city park rangers were switching it back.", "“We looked out this morning, and the Hollywood, the double O, there was actually only one E left,” Lia Perrot said.", "The sign was restored to “Hollywood” by 10:45 a.m. [the following morning]. It remains unclear who was involved in the incident, which was being investigated as a misdemeanor charge of trespassing, according to Los Angeles police.", "According to Los Angeles television station KCAL, the prank wasn't the first time the sign had been altered (nor the first incidence of its being changed to \"Hollyweed\"):", "Back on Jan. 1, 1976, a man named Danny Finegood altered the sign to read “Hollyweed,” the same day a marijuana law took effect, according to published reports. In November [2016], California voters approved Proposition 64, which legalized the recreational use of marijuana.", "It was one of several times Finegood altered the sign. In 1979, to mark Easter, he changed it to read “Holywood.” In the 1980s, during the Iran-Contra hearings, he changed it to “Ollywood” to mock Lt. Col. Oliver North.", "Images of the prank were rife on social networks:", "Hollyweed!!! I think security took the night off last night in Hollywood?. pic.twitter.com/ycQXzjsyjG", "— Sd3gaughC (@Sd3gaughC) January 1, 2017", "The Hollywood sign right now pic.twitter.com/wHNRir6KHL", "— Vsauce (@tweetsauce) January 1, 2017", "What the fuck. #hollyweed pic.twitter.com/KzNYeEib3A", "— Adam Singer (@singy) January 1, 2017", "Likewise, documentation of the sign's restoration was reported contemporaneously:", "UPDATE: Crews have restored the Hollywood sign, which was altered overnight to read \"Hollyweed.\" #LIVE @ https://t.co/w3oJ4nTd1g pic.twitter.com/yKiufGQhku", "— CBS Los Angeles (@CBSLA) January 1, 2017", "Unlike most other cleverly edited images, the \"Hollyweed\" sign was one that was shared in numerous versions showing it from multiple angles and at many resolutions concurrently. Although digitally edited images sometimes come in sets, the number of variants appearing at the time of this vandalism incident was another indicator that the photographs indeed depicted a legitimate event and not merely someone's having fun with image editing software.", "KCAL-TV [Los Angeles].   \"Vandal Changes Famed Hollywood Sign Overnight to Read ‘Hollyweed.'\"\r\n    1 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]