["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Arizona saw the highest COVID-19 weekly average per capita in the first few days of 2021 when compared to any other state in the nation — and countries, for that matter.", "The uptick in cases was reported by ABC15 on Jan. 4, 2021, and included information from a seven-day moving average of new COVID-19 cases based on data from Johns Hopkins University. Between Dec. 29, 2020, and Jan. 4, 2021, the Grand Canyon State reported the highest number of newly confirmed COVID-19 cases per day in the world.", "The graphic below showed newly confirmed COVID-19 cases in Arizona in the seven days leading up to Jan. 4. It comes from 91-Divoc (COVID-19 spelled backward), an interactive visualization tool created by Wade Fagen-Ulmschneider, an associate professor of computer science at the University of Illinois, to track the spread of COVID-19. The data is based on normalized numbers, which streamlines case counts to provide a more equitable comparison between different populations sizes, allowing for case rates to be comparable between states like California and Alaska, for example. Fagen-Ulmschneider described the process as taking the data values — in this case, total cases — and dividing it by the total population multiplied by 100,000.", "And when it came to Arizona, it was estimated by 91-Divoc that 121.8 newly confirmed cases per 100,000 people were reported daily as of Jan. 4. During the same time period, California logged an estimated 97.8 cases per day — lower than the national average of 65.4 cases that the U.S. reported in the week leading up to Jan. 4, totaling over 215,000 new cases in a one-week period.", "\"This math is done for every state in the US and country in the world and, on the 91-DIVOC graphs, you can mouse over all of that data to view each data point and see the value for every country,\" said Fagen-Ulmschneider.", "When it comes to the country with the highest rate during this same timeframe, Czechia logged 99.4 new cases per day — still much smaller than totals seen in Arizona in the first week of 2021.", "In the days that followed the initial ABC15 report, new confirmed cases declined slightly but still topped the national average. Numbers published by the Centers for Disease Control and Prevention at the time of this writing confirmed that Arizona still led the nation in new daily cases with an average of 118.3 reported each day, totaling more than 60,000 new cases within the last week.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]