["About this rating", "California physician Dr. Simone Gold gained national notoriety in the summer of 2020 when her group, America's Frontline Doctors, held a news conference on the steps of the U.S. Supreme Court in Washington, D.C. The newly formed group claimed they were dispelling disinformation about the COVID-19 pandemic, but in reality, they ended up amplifying false or unsupported claims.", "As we previously reported, Gold separately had made a video in which she falsely presented herself as working for Cedars-Sinai Medical Center, a major hospital in Los Angeles, prompting the hospital to publicly clarify that she doesn't work there.", "Gold attracted attention online again on Jan. 6, 2021, when the FBI posted a bulletin to social media, seeking the identifications of people who broke into the U.S. Capitol during a violent attack that left five people dead.", "Supporters of U.S. President Donald Trump, incited by his incendiary and false rhetoric about a stolen presidential election, had broken into the Capitol, committing vandalism, stealing, breaking into legislators' offices, and threatening to kill U.S. Vice President Mike Pence. In the violence, five people, including a Capitol police officer, were killed. Pence and members of Congress, who were in the process of affirming President-elect Joe Biden's electoral victory, were forced to evacuate.", "In the days following the riot, a nationwide manhunt for perpetrators has been underway:", "Social media users flagged Gold in the top row of photographs in the FBI bulletin, holding a megaphone. She admitted in an interview with The Washington Post that she was indeed in the Capitol during the riot. She said she gave a speech in the building before police ushered people out, adding she was inside for about 20 minutes and that in retrospect, she regretted having been there.", "Gold had been one of the people who, along with Trump, baselessly promoted hydroxychloroquine, an anti-parasitic drug often used to treat malaria, as a treatment for COVID-19.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]