["A claim viral on social media suggests that dog meat has been recovered from the kitchen of one Ashoka hotel in Howrah, West Bengal. This claim is accompanied by a set of photographs, one of which shows hung carcasses.", "The above post of May 2018 is by the page The Siliguri Mirror. Although the page has a modest following of less than 12,000, the above post was shared over 27,000 times. The same was posted on the page PROUD TO BE AN INDIAN. The post was shared over 5700 times. Several Facebook users too have posted this information on their timelines.", "Alt News found that this identical claim with the accompanying pictures had circulated on Twitter as well.", "Raid in Ashoka Hotel, Howrah, Kolkata. Dog’s Meat found in Kitchen.😯 @MamataOfficial pic.twitter.com/egJPbKM0MB", "— 🇮🇳Sandeep Singh🇮🇳 (@sandeepfromvns) May 10, 2018", "Most of these posts date back to May 2018. Using specific keywords, Alt News came across news reports which stated that stale meat had been recovered from several eateries in Kolkata following raids by the Kolkata Municipal Corporation. One of the restaurants from which stale meat was seized was Ashoka hotel in Howrah. According to officials, the meat and fish which were seized were fungal-infected. However, it may be noted that there is no reference to dog meat. Posted below is a video report of the same by NDTV.", "Alt News reverse-searched the photograph which has been circulated along with this claim, showing hung dog carcasses, and found it posted on the website www.change.org, in 2012, with reference to Vietnam. The photograph thus cannot be representative of the raids on eateries which took place in Kolkata in May 2018, where no dog meat was reportedly found.", "Alt News reverse searched the second photograph which shows a pack of dogs, and found it posted in a report on dog meat in Southeast Asia. The report is of September 2013.", "Hence, the above image too cannot be representative of the raids on restaurants in Kolkata.", "Reverse-searching the third photograph showing a skinned dog, we found the same on an Iranian news website. The report referred to dog meat reportedly being seized from Mashhad in Iran. The image was featured in this report in 2011.", "In conclusion, the claim that dog meat was recovered from a hotel in Howrah, Kolkata is baseless. Moreover, photographs of dogs, used to convey the same, are old, unrelated and not from India.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]