["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An email published by the New York Post that outlines a business arrangement with a Chinese company makes reference to \"the big guy.\" A former business partner of Joe Biden’s son, Hunter Biden, has said that refers to the Democratic presidential nominee.", "But an image on social media that appears to corroborate that claim is doctored.", "\"Even in 2015, Joe’s license plate read ‘THE BIG GUY’!!!!!\" reads the description of an image of Biden standing next to his Corvette Stingray. The blue-and-yellow Delaware license plate visible in the image says: \"THEBIGGUY.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The original image comes from an ad Biden’s campaign put out in August in which the former vice president talks about the American auto industry.", "Around the 47-second mark, you can see the image that appears in the Facebook post. There isn’t a license plate on the front of the car.", "In 2016, Biden and the car appeared on the show, \"Jay Leno’s Garage.\" At the 2:29 mark, a Delaware license plate on the back of the car is visible as Biden drives the comedian around. It shows a series of numbers, not \"THEBIGGUY.\"", "In Delaware, \"THEBIGGUY\" isn’t even a possible vanity plate. Personalized plates can’t exceed seven letters or numbers. \"THEBIGGUY\" is nine letters.", "We rate this Facebook post Pants on Fire.", "Facebook post, Oct. 26, 2020", "Fox News, Hunter Biden business partner calls email ‘genuine,’ says Hunter sought dad’s advice on deals, Oct. 22, 2020", "The New York Times, Hunter Biden and the New York Post star in new Trump ad, Oct. 22, 2020", "YouTube, Joe Biden gets vetted, Aug. 5, 2020", "YouTube, Joe Biden does a burnout in his corvette stingray, Oct. 26, 2016", "Delaware DMV, Vanity plate search and reservation, visited oct. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]