["If you’ve been binge-watching Netflix shows to get through the lows of the coronavirus pandemic, you might have been shocked to see online claims about the alleged criminal behavior of the company’s CEO.", "\"Kim Martin Morrow the CEO of Netflix has just been charged with 15 charges for child pornography and 31,000 files have been found on his personal computers for child porn from ages 8 and as young as toddlers,\" reads the text of a post that has been copied numerous times on different social media platforms. \"So, I think the investigation was needed. #SaveOurChildren.\"", "The text often accompanies a link to a story titled: \"Sen. Ted Cruz calls for a criminal investigation into Netflix film 'Cuties.'\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Netflix’s CEO has not been charged with these crimes. The claims have been debunked several times, but some social media users continue to spread the misinformation.", "First, the claim incorrectly identifies Netflix’s CEO. Reed Hastings is the CEO and co-founder of Netflix.", "PolitiFact searched news archives and found no evidence that Hastings had been charged with any crime.", "It’s not clear where the name ‘Kim Martin Morrow’ originated; our searches find it solely used with these inaccurate claims. Not one of Netflix’s eight senior officers or 12 directors is named Kim Martin Morrow.", "So why are social media users falsely linking a fake Netflix CEO to child pornography charges? That’s a bit complicated.", "The child pornography claims come after Netflix’s release of the French film ‘Cuties’ was met with criticism from subscribers and other internet users.", "Many say the film inappropriately sexualizes girls as young as 11, leading internet users to call for subscribers to #CancelNetflix.", "Netflix has defended the film.", "\"‘Cuties’ is a social commentary against the sexualization of young children,\" a spokesperson said in a statement to Variety. \"It’s an award-winning film and a powerful story about the pressure young girls face on social media and from society more generally growing up — and we’d encourage anyone who cares about these important issues to watch the movie.\"", "Film director Maïmouna Doucouré, who won a directing award at Sundance for ‘Cuties,’ maintains that her film criticizes, rather than promotes, hypsersexualization of children.", "\"I’m eager to see their reaction when they realize that we’re both on the same side of this fight against young children’s hypersexualization,\" Doucouré said of critics during an interview.", "The Instagram post we’re checking also uses the \"SaveOurChildren\" hashtag, which is linked to the baseless QAnon conspiracy theory. QAnon followers promote the belief that President Donald Trump is working covertly to bring down a child trafficking ring organized by popular celebrities and prominent Democrats. The FBI considers QAnon a potential domestic terrorism threat.", "But airing a controversial film is not a crime, and Netflix’s CEO hasn’t been charged with any, as the post claims.", "Social media posts claim, \"Kim Martin Morrow the CEO of Netflix has just been charged with 15 charges for child pornography.\"", "Netflix’s CEO is Reed Hastings, and he has not been charged with any crime. The claims appear to be the result of backlash over a Netflix film that many say hypersexualizes young children.", "We rate this claim False.", "Snopes.com, \"Was the Netflix CEO Arrested on Child Pornography Charges?\" Sept. 14, 2020", "Lead Stories, \"Fact Check: 'Kim Martin Morrow' Is NOT The CEO Of Netflix And Was NOT Charged With 15 Counts Of Child Pornography,\" Sept. 16, 2020", "USA Today, \"Fact check: False claim that Netflix CEO Reed Hastings was arrested for child pornography,\" Sept. 17, 2020", "NPR, \"Netflix CEO Embraces 'No Rules,' But Work Is Anything But Chill,\" Sept. 15, 2020", "ABC Action News, \"Sen. Ted Cruz calls for a criminal investigation into Netflix film 'Cuties,'\" Sept. 14, 2020", "Netflix Investors, \"Officers & Directors,\" accessed Sept. 18, 2020", "Variety, \"‘Cuties’ Backlash Led Netflix U.S. Cancellations to Spike Nearly Eightfold, Analytics Firm Says,\" Sept. 15, 2020", "Associated Press, \"Netflix’s ‘Cuties’ becomes target of politicized backlash,\" Sept. 14, 2020", "USA Today, \"Is Netflix losing subscribers over 'Cuties'? Maybe.\" Sept. 17, 2020", "Decider, \"‘Cuties’ Director Issues Statement Amid Controversy: ‘We’re on the Same Side Against Young Children’s Hypersexualization,’\" Sept. 14, 2020", "Twitter, Antenna Tweet, Sept. 17, 2020", "Zora Medium, \"The Director in the Middle of the #CancelNetflix Backlash Speaks Out,\" Sept. 10, 2020", "Sundance Institute, \"Cuties,\" accessed Sept. 18, 2020", "Variety, \"Netflix Defends ‘Cuties’ as ‘Social Commentary’ Against Sexualization of Young Children,\" Sept. 10, 2020", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]