["“30 million Americans has diabetes. Trump signed an executive order DRAMATICALLY lowering the cost of insulin. Joe Biden just rescinded a Trump’s order,” claims an ungrammatical January 23, 2021 tweet from an account that is currently restricted by Twitter for “unusual activity.”", "While the tweet received limited engagement, a screenshot posted by an account with the same name on Instagram was liked more than 5,800 times.", "A second similar tweet claiming that “Biden is now reversing” Trump’s executive order on insulin prices has been retweeted more than 36,200 times since January 22.", "More claims can be found on Facebook here, here and here.", "Annually rising insulin costs are a burden for the 7.4 million American adults who use it to manage their diabetes. If insulin becomes unaffordable, individuals may try to ration it, a step decried as having led to several deaths in 2017, 2018 and 2019.", "But the executive order, which was signed by Trump on July 24, 2020, has not been revoked.", "The final rule implementing the order was to take effect on January 22, 2021 but, two days earlier, on the first day of his administration, Biden’s Chief of Staff Ronald Klain issued a memorandum for a regulatory freeze. It aimed “to ensure that the President’s appointees or designees have the opportunity to review any new or pending rules.”", "This action did not automatically reverse or rescind Trump’s order regarding insulin, as claimed in the social media posts.", "Such a freeze is also not unusual for an incoming administration, Jing Luo, an assistant professor of medicine at the University of Pittsburgh, told AFP via email.", "Trump’s chief of staff Reince Priebus issued a similar memorandum on January 20, 2017.", "During the 2020 presidential campaign, Trump touted his order on insulin in ways that made it seem as if it would have a broad impact on prices, but the rule was narrowly targeted, according to Rachel Sachs, associate professor at the Washington University in St Louis School of Law.", "“The rule as it was finalized would never have applied to all or even most Americans,” she said by phone.", "If implemented, it will require that Federally Qualified Health Centers (FQHCs) -- which serve about one in 11 Americans, including homeless and vulnerable populations -- offer the discounted price they receive when they purchase insulin and injectable epinephrine (EpiPens) through a federal program called 340B.", "Sachs said these centers already provide some free care and discount drugs for people living at less than 200 percent of the federal poverty level, meaning $34,840 for a family of two. The new rule would expand those discounts to FQHC patients with incomes up to 350 percent of poverty -- $60,970 for a family of two.", "“Those are very important patients that we should be caring for,” Sachs said, but the exact number of additional patients who would have seen discounts is far from all diabetics who are facing large insulin bills.", "The University of Pittsburgh’s Luo agreed that “the number is small since only about 30 million total people receive care at FQHCs and certainly a minority of them have diabetes and a minority of those use insulin.”", "While the Biden administration has not yet indicated how it views the rule, the freeze was welcomed by the National Association of Community Health Centers (NACHC).", "“Certainly, the high cost of prescriptions remains a national crisis – but health centers are already part of the solution to this problem, and the regulation would have burdened them with excessive red tape without doing anything to lower how much drug companies charge for drugs,” Tom Van Coverden, President and CEO of NACHC said in a press release.", "Karyn Schwartz, a senior fellow at the Kaiser Family Foundation (KFF), a non-profit organization focused on national health issues, said by phone: “This rule did not impact the drug industry directly at all. They’re not going to be paying for the fact that some people would be getting insulin at lower prices.”", "Rather, the cost of new beneficiaries of the insulin discount would have to be covered by existing FQHC funding.", "Such a rule could decrease the amount of money available for other services, according to Schwartz.", "More than 100 members of Congress signed a September 20, 2020 letter calling for the rule to be repealed or not enforced.", "One voluntary program initiated by the Trump administration and impacting insulin prices did go into effect in January 2021.", "The program, announced in May 2020 by the Centers for Medicare & Medicaid Services, sees more than 1,750 Medicare Part D prescription drug plans and Medicare Advantage plans cap co-payments for insulin patients at $35 per month.", "This savings is now available to many of the 3.3 million Medicare beneficiaries who use one or more of the common forms of insulin.", "Sachs said that the voluntary price cap “is the Trump administration policy with the largest impact to date on drug pricing.”", "A second set of Facebook posts that do not mention the executive order claim that individuals are paying higher insulin prices under Biden than they were under the Trump administration.", "AFP Fact Check contacted the individuals for more information on their claims -- two did not respond by the time of publication -- but Connie Daniels said via Facebook Messenger, “I personally do not use insulin or any other medication.”", "The KFF’s Schwartz said that most people with traditional private insurance face a deductible at the start of each calendar year.", "“So their costs for insulin could go up at the beginning of the year versus what they were at the end of last year -- it would have nothing to do with Biden.”", "Insulin prices in some places may also be lower in 2021 due to state legislation.", "The US state of Maine passed a law to cap insulin costs at $35 for a 30-day supply in 2021. A cap of $100 went into effect in the states of Utah, Washington and New York on January 1, 2021 and will take effect in July 2021 in West Virginia.", "A third set of Facebook posts claim that Biden is responsible for the high price of insulin in text accompanying a video of a mother desperately explaining that she cannot afford the drug for her nine-year-old son.", "“Because of Joe Biden’s executive order reversing President Trump’s order to reduce/discount on insulin costs, this sweet mother can’t afford to buy her sons prescription of insulin which is now $1000!” claims a January 27 post that includes the video.", "More examples can be found here, here and here.", "But another Facebook post shared an article from Britain’s Daily Mail newspaper that linked to the original video, which was uploaded to TikTok on December 23, 2020, prior to Biden’s inauguration.", "In it, a woman identified as Katie Schieffer does not mention Biden or anything political, but cries as she expresses her anguish that despite working full-time she cannot afford the $1,000 prescription to treat her son’s type 1 diabetes.", "After tens of thousands of responses to her video, Schieffer posted on December 24, 2020 to clarify that it was not insulin, but a specific brand of blood sugar monitor not covered by her insurance that cost $1,100.", "A month later, she posted on TikTok to say that her son was doing well after they were flooded with offers of help.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]