["There’s no evidence that Amy Coney Barrett made such a statement.", "The words appear to have originated from an anonymous post on Reddit.", "As the Republican-controlled Senate moves ahead to confirm Amy Coney Barrett to the U.S. Supreme Court, false attacks and fake quotes attributed to the judge continue to be shared widely on social media.", "Multiple Facebook posts claim Barrett, a conservative judge on the 7th U.S. Circuit Court of Appeals in Chicago, once called breastfeeding \"child molestation.\"", "\"I have a 6 month old that I fed breast milk from a bottle not directly from the breast,\" the quote reads, \"if you force your child to suck your nipples, You are molesting YOUR child, Making an infant suck your breast is a sexual Act and you should be in prison for CHILD MOLESTATION.\"", "RELATED: What social media posts get wrong about Amy Coney Barrett’s religious beliefs", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There’s no evidence that Barrett said this, and the words appear to be lifted from an anonymous post that was recently shared on a Reddit sub thread called \"insane parents.\"", "Barrett’s background and biography has received considerable news coverage since she was announced as President Donald Trump’s pick to replace the late Justice Ruth Bader Ginsburg. We found nothing to suggest, in recent clips or in a search of news archives, that Barrett shares these views on breastfeeding and no statements from her calling it \"molestation.\"", "We rate this Pants on Fire!", "Facebook post, Oct. 13, 2020", "Facebook post, Oct. 13, 2020", "Nexis, database search, Oct. 13, 2020", "Reddit, \"Insaneparents subthread,\" Accessed Oct. 13, 2020", "Yahoo.com, No, QAnon, Parents Who Breastfeed Should Not 'Be in Prison For Child Molestation', Oct. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]