["The photo was published here in a Facebook post on February 12, 2021.", "The post’s caption in Hindi translates to English as: “Thirteen villages in Chamoli’s Tapovan region have been reduced to ruins. There are no roads left, bridges have been washed away. Rashtriya Swayamsevak Sangh’s workers are leading from the front, carrying sacks of grain on their shoulders so that no one has to go to sleep hungry or die of disease. We are grateful.”", "The caption refers to the devastation caused by a flash flood in Chamoli district of Uttarakhand on February 7, 2021, as AFP reported here.", "A deadly flood -- apparently triggered by a glacial burst -- smashed through two mountain dam projects, leaving scores missing, destroying bridges and roads, hitting two hydroelectric power plants and killing 60, the AFP report says.", "The Rashtriya Swayamsevak Sangh (RSS) is right-wing Hindu nationalist organisation.", "The photo was also shared here, here, here and here on Facebook; here, here and here on Twitter alongside identical claims.", "However, the claim is false.", "A reverse image search on Google found the same photo published here in a report about the RSS’s relief works in flood-hit areas of Uttarakhand on July 1, 2013.", "“Day-12: RSS Relief Works at Uttarakhand – A Report in Brief; Needs more helping hands,” reads the headline.", "Below is a image comparison screenshot of the photo published in the misleading Facebook post (L) and the photo published in the 2013 report:", "The report and photo were also published on a blog on the same day.", "The RSS’s relief work was highlighted in a statement published on their website on June 19, and their efforts were reported here a week later by The Hindu on June 26, 2013.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]