["About this rating", "On 3 November 2017, \"satirical\" web site ReaganWasRight.com published an entirely fabricated story about the fictional death of a fictional Baltimore woman who had leaked information relating to Robert Mueller's fictional investigation into Bill Clinton's half-brother Roger Clinton, Jr.:", "As you have probably heard, one of the grand jurors in the Mueller investigation leaked one of the names on the sealed indictments handed down so far in the Russia probe: Roger Clinton Jr., half-brother of Bill. The woman, whose name we now know is Caroline Dans La Ville from Baltimore, reportedly texted her nephew excitedly when the grand jury voted unanimously to indict Clinton...", "The Washington Tribune reports:", "Dans La Ville took a bus to 2nd Street, where she began her usual walk to her second-floor apartment on nearby Kruger Ave. Street cameras captured her rounding the corner, but she never arrived home according to a police report filed by her two children.", "Hours later, she was found in the bushes with her throat slit.", "According to D.C. Sheriff Bob Halley, it is still unclear if she was the victim of a random mugging or if the attack was targeted.", "No suspects are in custody, and area police are urging residents to use caution when traveling.", "Very little about this is true. Roger Clinton, Jr. has not been named in relation to Robert Mueller's Russia investigation, and therefore Fox News did not report that \"Clinton could face up to 25 years in prison\"; no woman named \"Caroline Dans La Ville\" was found dead in Baltimore in recent weeks, and therefore the Washington Tribune did not write about her.", "Furthermore, Bob Halley did not say anything about an attack, as there is no \"D.C. Sheriff Bob Halley\". The District of Columbia does not have a sheriff; it has a Metropolitan Police Department and a Chief of Police named Peter Newsham. The photograph included in the story is in fact taken from a 2009 news article about the discovery of a man's body in bushes in Costa Mesa, California.", "ReaganWasRight.com appears to be affiliated with similar \"satirical\" web sites run by Christopher Blair, a purveyor of fake news who writes under several pseudonyms and also operates the Last Line of Defense, FreedumJunkshun, and As American As Apple Pie.", "The \"About\" page on Reagan Was Right shows the same disclaimer as is shown on As American As Apple Pie:", "When no one can trust the lying fake news liberal media anymore because they hate us and guns and Harley Davidson and meat and OUR president, As American as Apple Pie is here to be your beacon of something you can kinda rely on sometimes but not really.", "The ReaganWasRight.com home page gives this additional disclaimer:", "Our mission is to provide a safe haven from reality for those who truly just don't know the difference. There is zero truth to anything on this site.", "Orange County Register.  \"Man Found Dead in Bushes Near Apartments.\"\r\n  Orange County Register.  23 March 2009.", "Palma, Bethania.  \"Fake News Purveyors Apologize for 'Satire' Story Calling Fallen Soldier a Deserter.\"\r\n  Snopes.com.  30 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]