["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rosie O'Donnell speaks at a rally calling for resistance to President Donald Trump, Tuesday, Feb. 28, 2017, in Lafayette Park in front of the White House in Washington, prior the president's address to a joint session of Congress. (AP)", "Fake news reports said without evidence that celebrities threatened to go on strike unless President Donald Trump quit.", "\"Hollywood celebs: We will go on ‘total strike’ if Trump does not resign,\" said a Dec. 30 headline on Nourtey.com, a fake news website that attacks Democrats.", "The story suggested Rosie O’Donnell was among the celebrities threatening to go on strike.", "Facebook users flagged the Nourtey.com post as being potentially fabricated, as part of the social network’s efforts to combat fake news. This story mimics earlier reports that have circulated for at least a year.", "Shortly before Trump’s inauguration, a similar story surfaced on therightists.com that said celebrities were calling for a strike within the movie industry in hopes that it would urge Trump to resign.", "Snopes found that the rumor stemmed from an ad in the New York Times by the group Refuse Fascism. The group, which included O’Donnell, called for millions to hold a protest to \"create a political crisis that prevents the Trump/Pence fascist regime from consolidating its hold on the governance of society.\" Thousands of people, including musicians, actors, professors and authors, signed the petition as of Jan. 6, 2017.", "The celebrities were not calling for a strike barring Trump’s resignation.", "O'Donnell told NBC Late Night host Seth Meyers in November 2017 that she has been in a \"severe depression\" since Trump won the presidency and that she spends \"90 percent of my waking hours tweeting hatred towards\" Trump.", "The pair have bad blood going back to O’Donnell’s time on ABC’s The View, when she criticized Trump on multiple personal and professional fronts after his decision not to fire a Miss USA accused of drug use and other wrongdoing.", "We messaged O’Donnell on Facebook to ask if she had threatened to strike and received an automated message: \"Please use my memes and articles as a resource to fight against Trump. I read all of my messages. #LoveTrumpsHate #ResistTrump Please don't leave hateful comments or memes on my page. Stay Rosie.\"", "So Nourtey.com said, \"Hollywood celebs: We will go on ‘total strike’ if Trump does not resign.\" While O’Donnell was among the celebrities who signed a Refuse Fascism petition calling for protests leading up to Trump’s inauguration and has continued to criticize Trump, we found no evidence that there was a plan for a mass strike among celebrities. We rate this headline False.", "Nourtey.com, \"Hollywood celebs: We will go on ‘total strike’ if Trump does not resign,\" Dec. 30, 2017", "Therightists, \"Celebrities Call For A Massive, All-Round Strike In Hollywood ‘Until The Fascist Trump Resigns,’\" Jan. 6, 2017", "Refuse Fascism, Ad in the New York Times, Jan. 4, 2017", "Snopes, \"Hollywood deletes,\" Jan. 10, 2017", "Factcheck.org, \"Hollywood strike hoax,\" May 24, 2017", "Billboard.com, \"How Musicians Are Helping Fuel the Resistance In 2017,\" March 10, 2017", "Refusefascism.org, \"Congress Certifies Trump. Growing 1000s Say NO! Vow To STOP Trump/Pence Fascist Regime Before It Starts!\" Jan. 6, 2017", "PolitiFact, \"Donald Trump says 'he didn't say' the things about women that Megyn Kelly asked him about in debate,\" Aug. 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]