["“The COVID package costs every single American $5,750 and then gives SOME people $1,400,” said a March 7, 2021 Facebook post by “Dear America” podcast host Graham Allen that has been shared more than 7,000 times.", "“ALSO, Your children’s children will be paying off this 1.9 TRILLION dollar addition to our National Debt long after you and I are gone....PATHETIC!” the post continued.", "Similar posts, including on this Donald Trump fan page, used a screenshot of text tweeted by Republican Representative Dan Crenshaw. His tweet was retweeted and shared from his Facebook page more than 40,000 times, as well as from his Instagram account, where it was liked more than 170,000 times.", "The posts circulated as Congress considered the American Rescue Plan Act of 2021 which spreads $1.9 trillion worth of aid across broad sections of pandemic-stricken US society. It received final passage by the House on March 10 and was signed into law by President Joe Biden on March 11.", "No Republicans voted for the bill, which they criticize for addressing “left-wing priorities” that go beyond the pandemic.", "The plan comes after two earlier pandemic relief packages during the administration of former president Donald Trump, one worth $900 billion and the earlier CARES Act valued at $2.2 trillion.", "Claims that the latest relief package will cost every American $5,750 are roughly based on dividing the total $1.9 trillion price tag by estimates of the US population, economists told AFP.", "Although that is one way of understanding the cost to “the average American,” the plan wouldn’t literally cost everybody the same amount, said Alex Brill, resident fellow at the American Enterprise Institute. He was a staff economist with the President’s Council of Economic Advisors during the George W Bush administration.", "“That’s not how our system works. We don’t have a system where... when we have the bills we just split them evenly like we all went out to dinner or something like that,” Brill said by phone.", "It is unknown, however, how the cost will vary from that average between individuals, Brill said. The federal government is borrowing $1.9 trillion to pay for the relief package, but it is still not clear how that debt will be paid back, although taxes will be used to do so, he said.", "“It could be that we raise taxes on the rich and the rich pay it back or it could be that we raise taxes on everybody,” or perhaps, in the future, spending on Medicare, defense or something else will be cut so that taxes don’t have to be raised, Brill added.", "“But in either scenario taxes will go to paying off the money... being borrowed today,” he said.", "At the end of fiscal year 2019, publicly held debt was $16.8 trillion, or 79 percent of US gross domestic product.", "The Penn Wharton Budget Model, a non-partisan research initiative at the University of Pennsylvania, found that the American Rescue Plan produces a net present loss in GDP of $16,512 per capita. This “suggests that the cost is potentially higher than the $5,750,” Marcos Dinerstein, an economist from the team, said by email.", "“But it cannot be directly translated into what it costs for each individual” without further analysis, he emphasized.", "The Budget Model figure “takes into account all losses in GDP from now into the future and puts it in 2020 dollars so we can have a number that summarizes the policy impact,” Dinerstein said. “Many people will not be alive that long and hence their cost would be much lower.”", "In its analysis, the Budget Model found that the relief plan’s expenditures would stimulate the economy in 2021, when wages and tax revenue would rise. In subsequent years, though, as investors buy government debt with savings that would have gone to “productive capital,” wages would fall along with GDP and government revenue, the Budget Model said.", "Gray Kimbrough, an economist with American University’s School of Public Affairs, said the social media claims about the Rescue Plan are “kind of based on misleading portrayals of ways that you can think about this.”", "The package needs to be viewed in a much broader context than the stated cost of $5,750 and the $1,400 payments, Kimbrough said by phone.", "“What they’re doing here is comparing specific numbers that may be calculated in a way that makes sense but are not necessarily getting at what this act really accomplishes and what it really costs,” he said.", "The posts and tweets ignore the fact that, in addition to the stimulus checks of up to $1,400, the package includes many other things, he said.", "Among them: an extension of $300 a week unemployment benefits, expansion of the Child Tax Credit, billions of dollars for vaccines, assistance for health insurance, and aid for schools as well as for state and local governments.", "“The idea is that spending is worth it when it increases growth to pay for itself or it otherwise attains things that we want to have happen,” Kimbrough said.", "“In this case we have to address the pandemic to enable the economic growth to pay for things like this, and so it is certainly a leap to say that this leads to a direct payment of $1.9 trillion in additional debt that will have to be paid off.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]