["About this rating", "In January 2021, the antifa.com URL began redirecting users to whitehouse.gov, the official website for the newly inaugurated U.S. President Joe Biden. Previous versions of the redirect link pointed users to other websites, including joebiden.org, buildbackbetter.org, kamalaharris.org, and the self-described anarchist website itsgoingdown.org.", "However, there are no apparent links between the website redirects and the president or his cabinet — anyone who owns or has access to a domain can establish either a temporary or permanent URL redirect, which essentially tells a search engine that the page has moved.", "As of late January 2021, it is unknown who was responsible for the web redirects.", "As U.S. President Joe Biden was sworn into office on Jan. 21, 2021, his newly edited official presidency webpage was under internet sabotage. According to some media reports, including the below screenshot of conservative conspiracy site RT News, the antifa.com URL redirected to whitehouse.gov.", "Snopes readers asked us to determine whether the redirect was authentic. A closer l ook on Jan. 20 revealed that as of this publication, the antifa.com URL did in fact redirect users to whitehouse.gov, the official website for the newly inaugurated president. But there are some important caveats to note, which we’ll explore below.", "RPReplay_Final1611173056", "We used the Google Chrome extension Link Direct Trace to verify that antifa.com forwarded to whitehouse.gov using both permanent 301 and temporary 302 redirects – and the new page, whitehouse.gov, was also connected using a 200 connection.", "And it’s not the first time Biden has been the subject of such a redirect. As we have previously reported, the antifa.com URL has a long history of being redirected, including forwarding users to joebiden.org, buildbackbetter.org, kamalaharris.org, and the self-described anarchist website itsgoingdown.org. But that doesn’t mean that Biden or his campaign were responsible or affiliated with Antifa or its alleged website. Anyone who owns or has access to a domain can establish either a temporary or permanent URL redirect. A redirect serves a somewhat similar role as call forwarding, by telling a search engine that the URL in question has moved and redirecting site visitors to a different URL, according to Squarespace.", "It is not immediately clear who was responsible for the redirect, and Biden’s press team has denied any association with previous links to antifa.com URL redirects. Snopes contacted Rob Flaherty, the White House director of digital strategy, but did not hear back at the time of publication.", "A look through internet domain search engine Whoxy confirmed that antifa.com was previously registered through a domain privacy service located in Saint Petersburg, Russia, but a cross-reference with WhoIs, an online domain registry record, found that the URL was registered in Panama as of Jan. 20. The antifa.com URL was initially registered on April 24, 2002, and was last updated on Jan. 20, 2021.", "And in the first three weeks of 2021, the link went through a handful of alterations. Here’s what we found using the internet archival service, Wayback Machine:", "In summary, just because the antifa.com URL redirected to the official website of the White House — and previously to a number of those affiliated with Biden — does not prove any connection to the president and his new office.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]