["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story on Facebook claims that while the liberal media \"ridiculed\" President Donald Trump over his claim that former President Barack Obama spied on him during the election, America has now learned that Obama did indeed spy and will be indicted.", "\"Obama did in fact unconstitutionally spy on Trump throughout the presidential election,\" stated a Feb. 1 article by The Global Headlines, a fake news website that bashes Democrats.", "The clickbait article declares at the conclusion: \"Share this story if you want to see Obama behind bars for the rest of his treasonous life!\"", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. There is no evidence that Obama is poised to be indicted or that he wiretapped Trump.", "A similar, shorter version of this story appeared on freedomnewscenter.com in September and follows a pattern of fake news stories over the past year that said that Obama wiretapped Trump’s phones during the election. Some photos included a doctored photo of Obama in handcuffs in court.", "On March 4, 2017, Trump tweeted that Obama ordered surveillance on him during the election.", "As we explained following his tweets, it’s possible the Trump White House is privy to investigative activities that aren’t in the public record. However, it appeared more likely that Trump took several media reports about legitimate intelligence investigations into his associates’ possible Russia ties and wove them into a new, unsubstantiated theory that Obama himself did something illegal.", "The New York Times and Washington Post reported — based on anonymous sources — that FBI Director James Comey asked the Justice Department to publicly refute Trump’s tweets because they wrongly imply the FBI broke the law.", "Additionally, an Obama spokesman has categorically denied that the Obama White House ordered any wiretapping.", "The Global Headlines story focused on comments by former CIA analyst and retired Army Lt. Col. Tony Shaffer, who was interviewed following Trump’s tweets. Shaffer, who is frequently interviewed on Fox News and works for the conservative London Center for Policy Research, told Newsweek in 2016 that the incoming Trump administration asked him to apply for a job.", "The Global Headlines mentioned a \"recent\" interview by Shaffer on the radio show \"Trending Today USA,\" but that interview was actually 11 months ago.", "The interviewer asked Shaffer if Obama should be arrested:", "\"This could be first time a former president could be indicted for a felony, because I think that it’s very possible that he acted outside the scope of his duties, responsibilities and authorities to turn the resources of a nation’s state on a candidate,\" he said in a clip of the interview. \"This is, as I said before, Soviet dictator-level wrongdoing.\"", "There is no evidence that Obama himself ordered wiretapping to spy on Trump during the election and is now headed toward an indictment. Trump tweeted in 2017 that Obama had ordered surveillance on him. While there have been media reports about intelligence investigations into Trump’s associates’ possible Russia ties, there is no proof that Obama himself ordered wiretapping of Trump.", "We rate this story False.", "The Global Headlines, \"BREAKING: Intel officer reveals Obama could be ‘first president in History’ to be hit with a felony indictment,\" Feb. 1, 2018", "Freedom News Center, \"Breaking: intel officer reveals how Obama will be first president in history to be hit with a felony indictment,\" Sept. 2017", "Trending Today USA, Interview with Lt. Col Shaffer, March 2017", "Fox, \"Lt. Col. Shaffer: Potential Obama Wiretapping Is 'Soviet-Level Wrongdoing,'\" March 4, 2017", "Newsweek, \"Trump team considering Anthony Shaffer, controversial Army officer, for senior defense intelligence role,\" Dec. 14, 2016", "PolitiFact, \"Why the White House defense of Trump wiretap accusation is misleading,\" March 5, 2017", "PolitiFact, \"Image of Obama in handcuffs for wiretapping Trump is fake photo,\" March 9, 2017", "PolitiFact, \"Donald Trump says he learned Obama tapped his phones from the New York Times,\" March 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]