["About this rating", "In late August 2017, Facebook user Jennifer Sondey claimed that a \"friend of a friend\" was drugged and nearly abducted at a Meijer in Shelby Township, Michigan. Although the original post was quickly deleted, various versions of it remained in circulation on Facebook:", "Urgent ... please, share!!!!!!!!!\nShelby TWP ...", "My clients daughter wanted me to share. So while at work today I found something very important for all you parents to know about! PLEASE be very vigilant while out at the Meijer on hall Rd in Shelby TWP mi! According to her pastor, one of their member was almost abducted from the bathroom inside of the Meijer. This woman and her daughter who is 25 years old went to this Meijer and while they were there, the 25 year old had to use the bathroom. Well her mother started to worry when she hadn’t came out for awhile, so she went to check on her. As she was walking up to the bathroom door, 2 women had her daughter by each arm and was dragging her daughter out of the bathroom saying move out of my way we need to get my friend help! she was passed out. The woman’s mother immediately started yelling at these women saying you’re not my friend’s daughter, I don’t know you! you leave her alone I’m calling the police. They then ran out of the store and into a van with 2 other males in it. 911 was called and she was transported to the hospital and her stomach was pumped. The doctors still don’t know what these people drugged her with but suspect chloroform. She is almost 25 and almost abducted for sex trafficking in broad daylight inside the Meijer bathroom. Please watch your loved ones close and stay together. This is too close to home!! Please share to as many people as you can so they can be on the lookout too. Thank-you!", "So according to the rumor, Jennifer Sondey's client's daughter's pastor said that a 25-year-old congregant from her church was drugged and nearly abducted from a Shelby Township Meijer bathroom. Medical personnel purportedly surmised afterward that she had been subdued and incapacitated with chloroform so that she could be transported to a waiting van. The purpose of the ruse was, predictably, so that the woman could be abducted \"in broad daylight\" for sex trafficking purposes.", "Social media users might recognize this as yet another iteration of human trafficking abduction urban legends, but one citizen who reported the story to the Shelby Township Police Department via Facebook added that Sondey was adamant the story was legitimate, because according to her, police were investigating:", "The gal who posted is arguing with people on the post that the police are investigating and she believes her client. ??‍♀️", "In a comment on that post, a police department representative denied the claim:", "Nope, we have had no reports of abductions or attempted abductions like this in Shelby Twp. Thanks for checking and thanks for looking out for your community!", "Trafficking warnings began to take on a new life on Facebook in mid-2015, perhaps reaching critical mass with a claim about kidnappers in IKEA in March 2017. Warnings abounded of unsubstantiated tactics such as the use of jewelry, windshield-blocking shirts, and stolen license plates.", "These tales are designed to quell fears relating to the randomness of crime and offer a sense of control in a world that often seems horribly random. We have looked at dozens of identical warnings over the years about sex trafficking and human trafficking and how its perpetrators purportedly operate, and noted the toll they take on communities and targeted businesses:", "The promise of receiving virtual back-pattings for “spreading the word” lures eager users into sharing such accounts, thereby spreading useless parables about dangers that do not exist in the forms in which they are so often presented.", "Such reports are inconsistent with the patterns typically exhibited by kidnappers or sex traffickers (as reported, for example, in the United Nations Office on Drugs and Crime FAQ about human trafficking). In instances where we have managed to track down and communicate with the people who originated such claims, they are usually reluctant to answer inquiries or provide additional information, and they generally act affronted or defensive about our taking a skeptical approach to their tales ... In addition to sapping resources from law enforcement and harming local businesses who have done nothing to deserve being targeted by spurious rumors, such claims have a secondary adverse effect: passed on under the guise of being useful information, such attention-seeking Facebook posts serve to spread misinformation about serious matters such as human trafficking and thereby hamper the public’s understanding of real risks and dangers from criminals.", "As a survivor of legitimate human trafficking once wrote in a Los Angeles Times editorial, experts agree that stories such as these never align with legitimate tactics, which almost invariably target at-risk populations.", "Powers, Lara.   \"Why a Mom's Facebook Warning About Human Traffickers Hurts Sex-Trafficked Kids.\"\r\n    Los Angeles Times.   3 April 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]