["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Joaquin “El Chapo” Guzmán didn’t testify that he paid off any Democrats during his trial. He never took the stand and the trial received widespread media coverage.", "Did federal agents \"close\" the courtroom during the trial of Mexican drug lord Joaquin \"El Chapo\" Guzmán because he started naming Democrats he paid off?", "No. The three-month trial received widespread media coverage and was never abruptly \"closed\" off. Also, Guzmán didn’t testify.", "The claim was shared on the official Facebook page of country singer and conservative activist Ted Nugent. The post displays an image of Guzmán and reads: \"The feds closed the courtroom when El Chapo started naming Democrat’s who he paid off. Imagine that!!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is another variation of many rumors that falsely claim Guzmán gave up information during testimony in the trial. We previously fact-checked one that said Guzmán stated in court that former FBI director James Comey helped launder $150 million cartel money for House Speaker Nancy Pelosi. We rated that Pants on Fire!", "And like the previous claims, this one ignores the fact that Guzmán didn’t take the stand during his trial.", "Guzmán was found guilty in February 2019 on 10 counts of federal charges and sentenced to life in prison after the trial exposed the inner workings of his Sinaloa cartel, which funneled drugs into the United States for decades.", "According to the trial’s transcript and several media reports, Guzmán chose not to testify at the trial and his defense only called one witness, FBI agent Paul Roberts. The agent was called to discuss notes he took about a drug trafficker previously involved with Guzmán, in an attempt to highlight discrepancies.", "Alex Cifuentes, a former Guzmán associate, took the stand and testified that former Mexican president Enrique Peña Nieto took a $100 million bribe from the kingpin. But there was no testimony about any American officials.", "A post shared by Ted Nugent claims that federal agents \"closed\" the courtroom when Joaquín \"El Chapo\" Guzmán started naming Democrats he paid off.", "This claim is unfounded. The trial was covered by media organizations around the world and federal agents couldn’t have closed off Guzmán’s testimony because he never gave one.", "We rate this Pants on Fire!", "Facebook post, May 11, 2020", "PolitiFact, No, El Chapo didn’t testify that Comey laundered $150 million for Pelosi, Oct. 1, 2019", "New York Times, The Prosecution Rests Its Case, and El Chapo Decides Not to Testify, Jan. 28, 2019", "Reuters, 'El Chapo' paid former Mexican president $100 million bribe: trial witness, Jan. 15, 2019", "PBS,  The ‘remarkable’ courtroom revelations in trial of ‘El Chapo’, Jan. 21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]