["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Miami-Dade Circuit Judge Milton Hirsch, pictured here at a hearing in March, on July 3 declared the state’s new self-defense law unconstititutional. Roberto Koltun [email protected]", "Florida House Speaker Richard Corcoran disagreed with a ruling by a Miami judge that Florida’s updated \"stand your ground\" self-defense law is unconstitutional.", "Miami-Dade Circuit Judge Milton Hirsch ruled that state legislators overstepped their authority in modifying the law earlier this year to force prosecutors to disprove a defendant’s self-defense claim at a pre-trial hearing. Any such change should have been crafted by the Florida Supreme Court rather than the state Legislature, he ruled.", "Hirsch’s July 3 ruling doesn’t apply statewide, but it does start the process that could ultimately lead to Florida Supreme Court review.", "Corcoran, a Land O’Lakes Republican and lawyer, laid out his opposition to Hirsch’s ruling in three tweets:", "\"It is the role of the Legislature to write the laws that govern how Floridians may exercise their statutory and constitutional rights. The Florida House will continue to stand with ordinary citizens who exercise their right to self-defense. There's a reason this judge is constantly overturned. We look forward to this decision being reversed on appeal.\"", "There's a reason this judge is constantly overturned. We look forward to this decision being reversed on appeal 3 https://t.co/emJlUmSt1l", "Corcoran’s spokesman provided no data about how often Hirsch is overturned. Instead, Fred Piccolo pointed to a handful of cases in which Hirsch had been overturned and one case that remains pending in appeals.", "\"The speaker used the term ‘constantly overturned’ -- which is not quantifiable,\" Piccolo said. \"But the insinuation is that the judge has been overturned on substantive/controversial issues often.\"", "Hirsch has handled thousands of cases since he was elected in 2010.", "PolitiFact searched for Hirsch’s individual rulings in the Third District Court of Appeal and found that he was upheld about 160 times. We found that the appeals court overturned Hirsch six times. In six other cases he was upheld in part and reversed in part. (In a couple of other cases, the appeals court was critical of actions by Hirsch. The court disagreed with his ruling as a substitute judge in one case, and in another case the court said he should have granted a prosecutor’s motion to recuse himself.)", "(Hat tip to Carolina Bolado, a writer for Law 360, who looked at Hirsch’s appeals record first.)", "We sent a summary of our findings to a spokeswoman for the Miami-Dade courts, Eunice Sigler. She didn’t dispute our overall findings but offered caveats related to a couple of cases, including that in one case the appeals court reversed based upon a Florida Supreme Court decision that occurred after the judge ruled.", "We interviewed five law professors and all of them rejected the idea that Hirsch is \"constantly overturned.\"", "Stetson law professor Charles Rose described Corcoran’s statement as \"scurrilous.\"", "\"I don’t think there is any credible evidence that the judge is prone to being overturned,\" he said. \"A comment on how often a judge is overturned is an example of what we teach as ‘pivoting.’ When you are losing an argument you are making, you want to pivot and change the conversation.\"", "The fact that a judge has been appealed doesn’t mean the judge is right or wrong, Rose said. There is a valuable purpose in the appeals process.", "\"If judges weren’t willing to be overturned, the law couldn’t grow and change to reflect society,\" he said.", "University of Florida professor Darren Lenard Hutchinson said it would be extremely rare for a trial judge's rulings to be \"constantly overturned.\"", "\"Doctrines in federal and state courts often require appeals courts to extend deference to lower courts, particularly regarding findings of fact,\" he said.", "While judges and lawyers keep an eye on overturned cases, a more interesting question is whether a judge takes a stand on high-profile controversial legal issues, said Nova professor Megan Chaney.", "\"This just means he has the courage to do his job and force the appellate courts to clarify the law where it is unclear or potentially unconstitutional,\" she said.", "Piccolo pointed to an article in the Miami Herald that summarized some of Hirsch’s other high-profile rulings including some that had been overturned. Here is a summary:", "State vs. James Lacroix: In March, Hirsch ruled that Miami-Dade Mayor Carlos Gimenez’s decision to allow county jails to hold undocumented immigrants awaiting deportation by federal agents was unconstitutional. The county is appealing.", "State vs. Gaiter: In 2016, Hirsch ruled that a new death-penalty sentencing structure was unconstitutional because it didn’t require a unanimous jury verdict. The Florida Supreme Court ruled the same months later in a separate case.", "State vs. Bailey: An attorney stole $700,000 from a trust account. Hirsch sentenced him to probation only. The court reversed Hirsch and called for the imposition of a prison term.", "State vs. Borrego: A prosecutor made a motion for Hirsch to recuse himself based on his comments about fingerprints in another case, but Hirsch suggested that the prosecutor file a motion to disqualify him. The appeals court ruled that Hirsch should have granted the prosecutor’s motion.", "Hall vs. Ryan: Hirsch, acting as a substitute judge, released a man convicted of child abuse accused of violating probation on his own recognizance on the condition that he stay away from a minor. The appeals court ruled that Hirsch didn’t have jurisdiction to revisit the presiding judge’s decision to hold the defendant in custody without bond.", "State vs. Washington: When a Tampa federal judge ruled in 2011 that Florida's drug law was unconstitutional, Hirsch was the only local state judge to follow suit, the Herald wrote. He tossed out more than two dozen cases, but Miami's appeals court later reversed Hirsch.", "Following Hirsch’s ruling in a \"stand your ground\" case, Corcoran tweeted \"There's a reason this judge is constantly overturned.\"", "But Corcoran didn’t point to any data about how often Hirsch has been overturned after ruling in thousands of cases since 2010. Instead, Corcoran pointed to Hirsch’s rulings in six other cases. Corcoran is exaggerating when he suggests this handful of cases constitutes being \"constantly overturned.\"", "We found Hirsch had been upheld about 160 times and overturned six times and then affirmed in part in another six cases.", "We rate this claim False.", "Florida House Speaker Richard Corcoran, First, second and third tweet about Miami-Dade Judge Milton Hirsch, July 3, 2017", "Third District Court of Appeal, Search on website, Accessed July 7, 2017", "Law 360 writer Carolina Bolado, Twitter, July 3, 2017", "Miami Herald, \"Miami judge rules Florida’s new Stand-Your-Ground law is unconstitutional,\" July 3, 2017", "Miami Herald, \"Miami-Dade absentee ballot law upheld by court,\" Oct. 15, 2014", "Interview, Eunice Sigler, Miami-Dade 11th Judicial Circuit of Florida spokeswoman, July 5, 2017", "Interview, Fred Piccolo, Florida House Speaker Richard Corcoran spokesman, July 7, 2017", "Interview, Darren Lenard Hutchinson, Stephen C. O'Connell Chair & Professor of Law University of Florida Levin College of Law, July 5, 2017", "Interview, Mary Adkins, director of Legal Writing and Appellate Advocacy and a Master Legal Skills Professor at the University of Florida Levin College of Law, July 5, 2017", "Interview, Stephen J. Ware, Professor of Law, University of Kansas, July 6, 2017", "Interview, Charles Rose, Director, Center for Excellence in Advocacy; Professor of Excellence in Trial Advocacy, July 6, 2017", "Interview, Megan Chaney, Director, Trial & Appellate Advocacy & Professor of Law Nova Southeastern University, July 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]