["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Shred-It truck outside RPOF headquarters, documented by the Capitol News Service", "When one of his challengers switched from being a Republican to the Tea Party, Orlando Democrat Alan Grayson issued a news release that included another memorable series of one-liners.", "Yes, he's the guy who compared former Vice President Dick Cheney to a vampire and called Sarah Palin a wild Alaskan dingbat.\"I read (Peg) Dunmire’s announcement,\" Grayson said in a March 23, 2010, press release. \"I then forwarded it to the Guinness Book of World Records, for consideration under the category 'Most Consecutive Cliches.' This kind of right-wing drivel gave America $4-a-gallon gas and two endless wars, and drove us all to the brink of national bankruptcy. Was she living in a cave for eight years?\"Grayson then explained why he thought Dunmire decided not to run as a Republican. \"Dunmire is not running as a Republican, because the Republican Party of Florida smells worse than a rotting carcass,\" he said. \"The stench reaches all the way to the Georgia state line. For goodness' sake, on the day that their state leader resigned in disgrace, a 'Shred-It' truck rolled up to Republican headquarters.\"At PolitiFact Florida, we wanted to thoroughly analyze Grayson's claim about the Guinness Book of World Records. But alas, there is no \"Most Consecutive Cliche\" category. (We checked).So we settled on Grayson's accusation that on the day former Republican Party of Florida chairman Jim Greer resigned, a \"Shred-It\" truck was spotted at the party headquarters.Greer, who was chosen by Gov. Charlie Crist, resigned under pressure from big GOP donors Jan. 5, 2010, after a series of stories documented troubled spending patterns of state party political donations. Greer suggested he was a victim of a witch hunt.On the day he resigned, reporters working in Tallahassee did notice a white \"Shred-It\" truck parked outside RPOF headquarters. Indeed, it was a mobile paper shredding company.Whitney Ray of the Capitol News Service filed the first report that day:", "\"It was a quiet and somber day outside the Republican Party of Florida headquarters, the only noise was traffic, and the sound of a paper shredding truck.", "\"The driver came out wheeling an empty cart and a blue bag, one hour before embattled chairman Jim Greer made this announcement, on a conference call with reporters.\"", "A party spokeswoman said the timing of the Shred-It visit was just a coincidence. The mobile shredder comes monthly and just happened to coincide with the day Greer was announcing his resignation.But there was the image nevertheless.In mocking Republicans and his new Tea Party challenger, U.S. Rep. Alan Grayson said that on the day the state party chairman resigned, \"a 'Shred-It' truck rolled up to Republican headquarters.\" It did. We rate his statement True.Now about those Guinness world records ...", "Orlando Sentinel, \"Grayson: Tea Party foe is 'undead minion' in Palin 'zombie army',\" March 23, 2010", "PolitiFact Florida, \"GOP says Alan Grayson likens Dick Cheney to a vampire and U.S. health care system to the Holocaust,\" March 2, 2010", "Alan Grayson campaign, press release on Sarah Palin's Orlando visit, March 2010", "Guinness World Records, search for \"cliches\"", "St. Petersburg Times, \"Bowing to pressure, Republican Party of Florida chair Jim Greer steps down,\" Jan. 6, 2010", "Shred-It company Web site", "Capitol News Service, \"GOP Chairman Resigns, Paper Shredder Parked Outside HQ,\" Jan. 5, 2010", "Center for Responsive Politics, candidates running for Fla. U.S. House District 8, accessed March 26, 2010", "St. Petersburg Times, \"RPOF: Shredding truck outside HQ was a coincidence,\" Jan. 5, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]