["Mainstream Sinhala language daily newspaper, Divaina, published this story on May 23, 2019 which claimed that some 4,000 Sinhalese Buddhist women had been sterilised without their knowledge by a Muslim doctor at a hospital in Kurunegala, a town in Sri Lanka’s northwest.", "The report is headlined:", "“Thawheed Jamath doctor has sterilized Sinhala Buddhist mothers after C-section surgeries. Details revealed with proof. Widespread investigations carried out to arrest the doctor”.", "“Thawheed Jamath” is a reference to National Thawheed Jamath, an Islamic group that Sri Lankan authorities have blamed for the Easter Sunday attacks on April 21, 2019, which left more than 250 people dead. Here is an AFP report on the attacks.", "Below is a screenshot of the Divaina report:", "The Divaina report claims the secret sterilisations were performed by tubal ligation while the women were undergoing cesarean section surgeries.", "Subsequent Sri Lankan media reports, for example here in the English-language Sunday Times newspaper, identified the doctor as Seigu Shihabdeen Mohamed Shafi and said he was arrested by Kurunegala Police on May 24, 2019.", "Multiple local television channels picked up the Divaina report, for example, this report by Hiru TV, and this clip uploaded by Sinhalese-language Derana on May 25, 2019 titled: ‘A Kurunegala doctor who performed over 8000 C-sections arrested’.", "Multiple posts on Facebook shared screenshots of the Divaina front page report or the television clips, for example here and here.", "The post’s Sinhalese-language caption says: “Realise the danger now? This is Wahabism. He is a worse terrorist than the terrorist who carried out the bombings.”", "This Facebook post, uploaded May 23, 2019, called for the doctor to be given “punishments meted out during the era of ancient kings” -- a reference to torture.", "Citing the purported sterilisations as justification, one of Sri Lanka’s most senior Buddhist figures, Asigiri Chapter Prelate Warakagoda Sri Gnanarathana, publicly called for the doctor to be stoned.", "The false reports were also shared in India, for example this June 9, 2019 tweet, alongside calls for an investigation into whether Hindus were being sterilised.", "Below is a screenshot of the tweet:", "The claim is false; an investigation by Sri Lanka’s Criminal Investigation Department (CID) which was presented in court hearings found that the doctor in question, Seigu Shihabdeen Mohamed Shafi, had not performed any sterilisations.", "Shafi was arrested on May 24, 2019 and charged under Sri Lankan terrorism laws on May 27, but the CID probe found no evidence of his involvement either in sterilisations or terrorism and called for him to be released, according to court documents seen by AFP.", "The case accusing him of mass sterilisation was brought before the Kurunegala Magistrate’s Court on June 27, 2019 and, in a 210-page report submitted to the court, the Criminal Investigation Department of Sri Lanka said no evidence was found to link Shafi to non-consensual sterilisation procedures, adding that the Divaina report was baseless.", "Below is a screenshot of the relevant section of the report:", "The document translates as:", "“An investigation was carried out on the lead story of the Divaina newspaper published on 2019.05.23 titled ‘Thawheed Jamath Doctor has sterilized 4,000 Sinhala Buddhist mothers after cesarean operations details revealed with proof widespread investigation to arrest the doctor’, under the instructions of the Inspector General of the Police. According to the statements obtained so far, the said story has been mentioned to the journalist who drafted the news by the Kurunegala Deputy Inspector General, as follows - ‘...there are rumours of sterilisation procedures having been performed.’ The investigation into the newspaper report has revealed that this journalist, Hemantha Randunu, published the news item without necessary verification of facts.", "“I would like to respectfully report to Court that considering the above mentioned observations, the suspected Dr. Shafi is presently being detained under the Section 9 (1) of the 1979 No: 48 Prevention of Terrorism Act (temporary provisions) since 2019.05.27 for a period of 90 days upon obtaining a detention order to proceed with the investigation. As it is not justifiable to hold the suspect under the stated regulations to investigate, steps will be taken to bring this before the attention of the State Defense Minister and take necessary action.”", "According to the documents seen by AFP, the CID investigation, led by Inspector Adrian Nishantha Silva, interviewed more than 40 employees at the Kurunegala Teaching hospital, including operating room nurses, OBGYN specialists, resident doctors and hospital attendants, who had worked with Shafi.", "The CID report said that some of the staffers had assisted Shaffi in over 500 C-sections.", "According to the witness testimonies cited in the CID report, no one witnessed Shafi “using his hands or any surgical equipment to damage the fallopian tubes” of any patient on the surgical table.", "The court records show that the complaint against Shafi was lodged by Kurunegala Deputy Inspector General Kithsiri Jayalath on May 22, 2019, who accused him of aiding ISIS suicide bombers in Sri Lanka.", "According to reports from all of Sri Lanka law enforcement and intelligence agencies, including police, the State Intelligence Service, and the Terrorist Investigation Division, there is no evidence of Shafi having any links to terrorist activity.", "Below is a screenshot of the relevant section of the report:", "The documents translate as: “To determine whether this suspect has links to any other crime, terror activity or check if he is a wanted suspect, reports have been obtained from defense and law enforcement agencies and the response by each agency is listed below.”", "The document then lists 13 Sri Lankan law enforcement and intelligence agencies, all of which cleared Shafi of terrorist links -- Kurunegala Police, Police Special Task Force, State Intelligence Service, Criminal Archives, Terrorist Investigation Division, Western Intelligence Unit, Police Special Bureau, Dambulla Police Station, National Intelligence Bureau, Intelligence units of the army, navy, airforce.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]