["Ballot counting remains underway in several key battleground states. While former Vice President Joe Biden appears to have won Wisconsin, some on social media are calling foul when looking at vote tallies.", "\"WISCONSIN REPORTING 101+% VOTER TURNOUT,\" reads a heading within a meme containing a chart tabulating the number of registered voters in select states and what percentage they comprise of the state's population. The meme then claims the number of Wisconsin votes counted is 3,170,206 and registered voters only at 3,129,000, indicating a discrepancy of a little over 41,000 between the two.", "Fact or fiction:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "\"The Democrats have officially committed #Election 20202 fraud. This crime is a felony and falls under 18 US Code Chapter 115: Sedition & Treason,\" the text declares.", "The meme shared by Facebook user Mike Boss has received over 2,700 interactions and 2,500 shares since being posted on Wednesday. It has also gained significant attention elsewhere on Facebook, as well as on Twitter.", "USA TODAY has reached out to Boss for further comment.", "According to Wisconsin Elections Commission, there are 3,684,726 active registered voters as of Nov. 1. This figure, as well as denial that the state has more ballots than registered voters, was affirmed by the commission on its official Twitter account.", "Voter turnout is reported to have topped 3.2 million, the highest turnout Wisconsin has seen since the 2004 election.", "The chart used in the Facebook image appears to be taken from a website called World Population Review, which claims its number of registered voters by state reflects 2020 and cites the U.S. Census Bureau's Voting and Registration page as a source. USA TODAY found the figure actually used is from the November 2018 election. It is important to note, 2020 census results will not be available until late 2020 to early 2021.", "By late afternoon Wednesday, World Population Review updated its data and appears to have appropriately cited voter registration statistics available by each state.", "More:Fact check: Video misrepresents timing and severity of Scranton ballot-scanning machine outage", "More:Fact check: Trump ballots were not thrown out as claimed by fake poll worker", "We rate this claim FALSE because it is not supported by our research. The number for registered Wisconsin voters stated by the Facebook image is incorrect and instead is confirmed to be at over 3.6 million as of Nov. 1, according to the Wisconsin Elections Commission. The commission has denied there being more ballots than registered voters. The total votes counted in the state has topped 3.2 million.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]