["About this rating", "On 13 June 2019, the Twitter account \"Red Neighbor\" claimed it had some news about Disney's slate of future films, including a live-action remake of the movie Hercules:", "Several red flags indicated \"Red Neighbor\" may not be the most reliable source for Disney news. For one, the account didn't appear to be associated with any reputable news outlets. The account is also relatively new, having only joined the social media site in February 2019, four months before sending this viral tweet. As of this writing, \"Red Neighbor\" has only posted seven tweets, and this account isn't verified and uses a stock photograph of a silhouette as its profile picture.", "In other words, a relatively new, unverified account run by an anonymous Twitter user isn't exactly what we'd call a reliable source of news.", "A spokesperson for Walt Disney Studios told us via email: \"These tweets are not true. We are not casting for a live-action Hercules film.\"", "While \"Red Neighbor\" may not be a reliable source for entertainment news, a live-action remake of Hercules certainly isn't far-fetched. Walt Disney Studios has already remade a number of its classic animated films, such as Alice in Wonderland, Cinderella, The Jungle Book, Beauty and the Beast, Dumboand Aladdin, and the studio is set to release live-action remakes of The Lion King, Lady and the Tramp, and Mulan. The studio has also announced that it will be working on modernized versions of The Sword in the Stone, Pinocchio, The Hunchback of Notre Dame, and Lilo & Stitch.", "It is plausible that Hercules will eventually get the live-action remake treatment. As of this writing, however, Walt Disney Studios has made no announcements about the existence of the project, let alone its alleged director or cast.", "Gajanan, Mahita.   \"Here Are All of Disney's Upcoming Live-Action Movies.\"\r\n    Time.   28 May 2019.", "Updated [19 June 2019]: Changed status from Unproven to False after receiving statement from Disney representative.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]