["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "You can call off your emergency trip to the liquor store — states aren’t really stopping the sale of alcohol. But recent Facebook posts would have you think otherwise.", "\"No beer or alcohol sales in state of Illinois as of 3pm starting Monday March, 30th,\" reads an image posted by one account. Then there are links to stories with headlines like this one: \"NC Governor to stop all alcohol sales beginning Friday, April 3rd. Another one claims \"Gov. Gavin Newsom suspends alcohol in CA as of March 28.\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Some of these posts, such as one about Mississippi banning booze that has since been pulled down, appear to be screenshots of a news story. But if you click on the links in other posts, it brings you to a page that says \"you got pranked.\"", "The joke, however, is getting lost on many Facebook users as they share both these blog posts and images of seeming media stories with this tee-totaling news.", "Searching for actual news stories about states banning alcohol, we found none. However, Pennsylvania, where the state runs liquor stores, has closed down all of its off-premise locations indefinitely, Forbes reports. \"It remains the only part of the country where residents have such limited access to distilled spirits,\" the publication says.", "People in Pennsylvania can still buy alcohol, however. One distillery is selling bottles from a drive-thru and shipping to folks’ front doors. Another shop is selling vodka and whiskey for curbside pickup. California, meanwhile, is among the states to loosen alcohol rules for restaurants, allowing them to sell beer, wine and cocktails to go as people are preventing from dining in due to shelter-in-place orders to slow the spread of the coronavirus.", "We rate these Facebook posts False.", "Facebook post, March 30, 2020", "Portal24hs.com, NC governor to stop all alcohol sales beginning Friday, April 3rd, visited March 20, 2020", "Portal24hs.com, Gavin Newsom suspends alcohol sales in CA as of March 28, March 30, 2020", "Los Angeles Times, California eases rules for restaurants, allowing to-go…, March 20, 2020", "Forbes, In Pennsylvania, state liquor stores remain closed and people are getting thirsty, March 29, 202", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]