["The video was shared on Facebook here on July 12, 2020. It has been viewed more than 727,000 times.", "The post’s caption reads: “Amitabh Bachchan Tested Positive for Covid-19. He Shared this video from the Hospital !!\"", "The video also features superimposed text that reads: “Amitabh Bachchan Shared Video From Nanavati Hospital!”", "Bachchan and members of his family tested positive of COVID-19 on July 11, 2020, AFP reported here. The actor was admitted to Nanavati Hospital, a major hospital in Mumbai.", "The video was also shared alongside a similar claim here, here, here and here on Facebook; and here, here and here on YouTube; and here on Twitter.", "The claim, however, is misleading.", "A keyword search found Nanavati Hospital issued a statement on July 12, 2020, clarifying that Bachchan’s video was “created in April 2020 to motivate the frontline nurses, doctors and staff working in COVID wards.”", "The video was also published online elsewhere in April 2020 -- for example on Twitter here by a Mumbai-based journalist and on YouTube here by a regional news outlet.", "“@SrBachchan inspiring message to all the doctors and nurses who are working tirelessly and fearlessly to save lives,” reads the tweet.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]