["A video viral on social media is being circulated with the narrative that Congress made people take a pledge to not vote for the BJP. From a Twitter handle Ultimate Dangerous (@KING_OF_TROLL_) the video was shared on October 3 at 6:11 pm and has since received 200 retweets.", "dirty politics by congress, they are making people to promise to not vote BJP, shameless creatures. pic.twitter.com/M7b8VC5mgC", "— Ultimate dangerous (@KING_OF_TROLL_) October 3, 2018", "BJP supporter Shubharastha also retweeted the video with the caption – “Looks like Hitlers’ pledge! Bloody Fascists! Anti Democracy Emergency Fame Fascists! Die Congress!” Her tweet was liked over 800 times and was retweeted nearly 500 times.", "Looks like Hitlers’ pledge! Bloody Fascists! Anti Democracy Emergency Fame Fascists! Die Congress! @INCIndia doesn’t deserve survival in a democracy. Crying shame on our free political culture! https://t.co/SkXch8oLwN", "— Shubhrastha (@Shubhrastha) October 3, 2018", "The video has been shared by individual users on Facebook as well. It shows a group of youth taking a pledge saying – “I will not vote for Bharatiya Janata Party in the elections. I will also not provide any support to any worker of the Bharatiya Janata Party. I pledge that I will make at least three people take this oath. I will also spread awareness about the corruption and injustice of the Bharatiya Janata Party to the people of my village and my district.”", "Alt News found that the video did not pertain to a recent event and was being shared with a false narrative. Furthermore, its first few seconds were clipped. In the original video, which was reported by several media outlets, the youth can be heard saying, “Till online examinations are not closed, I will not vote for the Bharatiya Janata Party…”", "#WATCH Teachers of Vijaylaxmi Industrial Training Institute in Itarsi ask students to take pledge not to vote for BJP in the upcoming elections & support it in any manner until it stops online examinations #MadhyaPradesh (26.01.18) pic.twitter.com/PY3S721Mbq", "— ANI (@ANI) January 28, 2018", "The identical video viral on social media does not include the ‘online examination’ part to veil the fact that these were students protesting for a cause. The incident took place on January 26, 2018, Republic Day, in Vijaylaxmi Industrial Training Institute, Itarsi ahead of Madhya Pradesh Legislative Assembly Elections. The students were protesting online examinations, demanding that they are scrapped. The Times of India, Outlook, India Today, NDTV, News18, Dainik Jagran, Firstpost, Punjab Kesari and The Wire were among the many media outlets that had reported the incident. None of these reports mentions the Congress’ involvement in the incident.", "A subsequent article published by Dainik Bhaskar in February reported that the college was sent a notice for removal of accreditation by the Ministry of Skill Development and Entrepreneurship. The reason cited by the government was that the institute’s facilities were not at par with the necessary parameters. The Dainik Bhaskar report further mentioned that the decision to derecognise the college was taken after a complaint was filed by BJP state spokesperson Rahul Kothari.", "The video of an unrelated, old incident was clipped to facilitate the creation of a false narrative. With multiple state elections approaching there will be a spike in such motivated propaganda, as it has been observed in the past. Social media users are advised to always be alert.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]