["By Angelo Fichera", "Posted on March 25, 2019", "A viral meme claims that environmentalists littered a California park on Earth Day, but the image is from a 2009 college football tailgate in Georgia.", "A meme that has accrued thousands of shares on Facebook casts blame on environmentalists for littering a supposed California park — “on Earthday,” no less.", "But the meme’s claim is littered with falsehoods. The featured photo was not taken in California, it is not from an Earth Day event (which isn’t until April 22), and it is not proof of hypocrisy on the part of environmentalists, as the text suggests.", "The photo actually shows the aftermath of a football tailgate from nearly a decade ago at the University of Georgia.", "Using reverse image searches, we found the same image used in posts about the September 2009 game. A local radio station’s 2011 story about tailgating policies at the university uses the same photo, credited to the Atlanta Journal-Constitution, with a caption noting that it was “in front of the University of Georgia Law Library one Sunday morning in September 2009, the aftermath of tailgating activities during a football game the night before.”", "The Journal-Constitution, citing university officials, reported days after the Sept. 12, 2009, home opener against South Carolina that clean-up crews collected about 70 tons of trash.", "Similar images of the littered area can be seen on the photo-hosting website Flickr in an album belonging to Sharon Bradley, special collections librarian at the university’s School of Law.", "Bradley confirmed in a phone interview with FactCheck.org that the image in the meme shows the same scene as her photos of a tailgate’s remnants in a quad outside the law school.", "The photo in the meme shows the view from “the steps of the main library,” Bradley said. “It certainly is not California.”", "Bradley said trash from football tailgates was an ongoing issue at the time, until changes at the university led to improvements.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Black, Jay. “UGA relaxes tailgating restrictions.” WSBRadio.com. 25 Mar 2011.", "Bradley, Sharon. Special collections librarian, University of Georgia School of Law. Phone interview with FactCheck.org. 25 Mar 2019.", "Towers, Chip. “UGA tailgaters warned to clean up their trash.” Atlanta Journal-Constitution. 17 Sep 2009.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]