["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Seeking to unseat U.S. Rep. Lloyd Doggett, D-Austin, Republican nominee Donna Campbell of Columbus paints him as a \"career politician\" with some questionable positions.", "In an ad posted online Oct. 19, the narrator compares Doggett and Campbell, an \"emergency room doctor.\" \"They disagree on ObamaCare: Doggett voted yes, Dr. Campbell says repeal. Stimulus spending: Doggett voted yes, Dr. Campbell says it's a waste of money. Cap and trade: Doggett voted yes, Campbell says job killer.\"", "We're not weighing in on whether the stimulus was a waste of money, or if cap and trade is a job killer. But since earlier this month we rated True Doggett's statement that he voted against \"big bank bailouts,\" we were curious whether Campbell accurately recapped his votes on other high-dollar issues.", "Amanda Tyler, Doggett's campaign manager, told us by e-mail that Doggett voted for each piece of legislation, though the campaign has reservations about the visuals in Campbell's ad; for example, she said, a shot of a foreclosure sign doesn't make sense in connection with his vote for stimulus aid.", "Let's review Doggett's votes one at a time.", "Health care", "On Nov. 7, 2009, the U.S. House voted on its version of health care legislation in a 220-215 vote. Doggett joined 218 Democrats and one Republican, Rep. Anh Cao of Louisiana, in passing the legislation.", "On March 21, 2010 , Doggett voted for legislation reconciling Senate and House versions of the proposal. The compromise passed 220-211, with no Republicans in support. Doggett said in a floor speech \"with this reform, every insured American gets valuable consumer protections, and every uninsured American can become insured.\" We later rated that statement as True.", "Stimulus", "On Jan. 28, 2009, the House passed the $819 billion economic recovery bill 244-188 without a single Republican vote. Doggett voted \"aye.\" \"One way this bill promotes economic recovery is by promoting educational opportunity,\" he said on the House floor the day before. \"$13.5 billion of targeted tax relief to help young people and not-so young people attend college. Today, one out of five graduating high school students does not qualify for this assistance. But because we provided a refundable tax credit, we help them, just as the appropriations section of this bill helps with expanded Pell Grants and other direct aid.\"", "We asked Campbell's campaign why it showed an image of foreclosure sign while describing Doggett's vote for the stimulus legislation. Mike Asmus, Campbell's campaign manager, told us \"the stimulus spending Lloyd Doggett has voted for has prolonged the narrative of economic malaise, running from joblessness to foreclosure and beyond.\"", "Cap and trade", "Doggett voted for a cap-and-trade measure aimed at reducing greenhouse gases. With Doggett's vote, that proposal cleared the House 219-212 on June 26, 2009, though Doggett also aired objections about the measure being too soft, saying the plan stripped too much oversight from the Environmental Protection Agency and encouraged new coal-fired plants.", "\"I struggled deeply about whether to support this flawed bill, but I finally determined that voting for it was my best hope for making it better,\" he said on the floor that day. \"I've been listening to the debate — not so much to those who support a bill that I'm not all that enthusiastic about, but listening to the Flat Earth Society and the climate-change deniers, and some of the most inane arguments I have heard against refusing to act on this vital national security challenge.\"", "Tyler also told us that Doggett hoped to improve the bill by being tapped to serve as a House member of a possible House-Senate conference committee on the plan. That panel never was named; the House-approved bill stalled in the Senate.", "Our vote? The ad's imagery might be objectionable (at least to Doggett). He still gave his 'aye' for all the legislation cited by Campbell. We rate her statement True.", "Donna Campbell ad posted on YouTube Oct. 19, 2010", "PolitiFact Texas, U.S. Rep. Lloyd Doggett says he voted against the bank bailout, Oct. 7, 2010", "GovTrack.us, House Vote on passage: H.R. 3962: Preservation of access to care for Medicare beneficiaries and pension relief act of 2010, Nov. 7, 2009, accessed Oct. 20, 2010", "GovTrack.us, House vote on passage: H.R. 4872 Health care and education reconciliation act of 2010, March 21, 2010, accessed Oct. 20, 2010", "GovTrack.us, House vote on passage: H.R. 1: American Recovery and Reinvestment Act of 2009, Jan. 28, 2009, accessed Oct. 21, 2010", "GovTrack.us, House vote on passage: H.R. 2454: American Clean Energy and Security Act of 2009, June 26, 2009, accessed Oct. 21, 2010", "Project Vote Smart, Doggett's speech on the House floor re: stimulus, Jan. 27, 2009", "Austin American-Statesman, Doggett knocked cap-and-trade plan on day he backed it, July 9, 2009", "E-mail interview with Amanda Tyler, campaign manager for Lloyd Doggett, Oct. 20, 2010", "E-mail interview with Mike Asmus, spokesman for Donna Campbell, Oct. 20, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]