["About this rating", "In late August 2018, a number of English-language websites rehashed a story about a young Chinese couple who had reportedly struggled with infertility issues for years, until they visited a doctor who informed them that they could not become pregnant through anal sex alone.", "The woman’s symptoms led Doctor Liu to believe that she may have had some sort of gynaecological disease.", "But following an examination, the wife was revealed to be a virgin.", "Doctor Liu then inspected the woman’s anus and discovered that she ‘could fit three fingers’ inside.", "It was then that the medic is said to have learned the couple had been mistakenly having anal sex for four years, resulting in their failure to conceive.", "Doctor Liu reportedly handed the couple each a sex-ed handbook and also gave them ‘guidelines’ before they were sent home.", "The advice appeared to work, as news of the wife’s pregnancy arrived just a few months later.", "The doctor said: ‘Four years of marriage and neither the husband nor wife knew how to get pregnant. Couples so lacking in general knowledge are very rare.’", "Multiple news outlets, including the Daily Mail, the Sun, Metro, and Newsweek all aggregated their own versions of this story, all citing a single report from the Guiyang Evening News as the source of their information:", "Our search to verify this information raised a number of red flags which indicated that the story may have been a humorous (or denigrating) anecdote about the importance of sex education and awareness rather than an account of a genuine medical incident.", "The Guiyang Evening News is a real Chinese newspaper, but we were unable to locate this story on their website or their Weibo (a Chinese social media site similar to Facebook) page. Our search for information about obstetrician Liu Hongmei (刘红梅) turned up a number of pages on the Guiyang Evening News website, none of which dealt with the possibility (or lack thereof) of getting pregnant via anal sex.", "We did find an article attributed to the Guiyang Evening News on the new.qq.com. website which appears to be the source used in the aforementioned English-language articles. However, we are skeptical about the authenticity of that source.", "The web site QQ.com features a news client that appears to pull stories from various sources in order to serve the community of WeChat, a multi-purpose messaging and social media app that was developed by Tencent. As we could not find this story on the official web site of the Guiyang Evening News, it's possible this story was erroneously credited to them on QQ.com, or that they deleted the original article after it was pulled by the QQ.com news client.", "Either way, many readers of the original Chinese article were skeptical that the story relayed a true event. Here is the most popular comment about the article published to QQ.com (roughly translated via Google):", "这篇文章的可信度几乎为零，这是贬低农村人，当今的年轻人虽然是农村的但也不至于愚昧到如此程度啊？我们成年人都知道，男女双方一旦接触就会有生理反应，二反应的部位，自然是最需要的器官，自然而然的相互就找到了部位。根本不是谁告诉你的，有过性生活的人，你是谁告诉的？谁教你的？纯粹是胡编乱造并且太低级了。", "The credibility of this article is almost zero. This story is intended to degrade rural people. Although some young people today come from rural areas, they are not ignorant to this degree. We all know that when men and women engage in physical contact with each other, they will experience a physiological reaction. The second part of the reaction is naturally to use the appropriate body parts. They figure out how to make it work on their own. Do you really have to depend on someone who has had sex to explain it to you or teach you how?", "We attempted to locate a second source in the hopes of turning up some supporting evidence for this story, but we found only near-verbatim copies of the original article. With the primary source apparently missing from the Guiyang Evening News web site and no secondary source available to substantiate the reporting, we are skeptical of this rather implausible story.", "This story appears to be a slight variation of another piece of folklore concerning couples who discover the reason they’re childless is because they’re not having sex at all.  It's also a near-identical retelling of a tale attributed to a Romanian newspaper back in 2001:", "A Romanian couple who went to their local fertility clinic to complain that, despite frequent sex, they could not conceive. They went home however with new hope after doctors explained to them that they were doing it all wrong. That one cannot get pregnant having anal sex.", "It's difficult to prove a negative, but typically when we see familiar legends and humorous anecdotes playing out as \"real\" news taken from a questionable single source, it's a sign someone's leg is being pulled.", "QQ.com.   \"夫妻结婚4年“不孕” 医生一查：女方仍是处女.\"\r\n    21 August 2018.", "Zhao, Christina.   \"Couple Couldn't Conceive Because They'd Been Having Sex the Wrong Way for Four Years.\"\r\n    Newsweek.   24 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]