["About this rating", "Internet legend has it that an Irish plumber spent 15 years digging a tunnel from his house to a local pub so that he could enjoy a drink at his leisure without his wife's permission. This story has appeared on several web sites over the years, and despite its rather ludicrous premise it has repeatedly taken in some gullible social media users.", "This rumor started with a September 2014 post on the web site \"Tyrone Tribulations\" entitled \"Omagh’s ‘Shawshank Husband’ Dug Tunnel from Bedroom to Pub Over 15 Years\":", "An Omagh plumber tunnelled a hole from under his bed to the local pub 800 feet from his house over the course of 15 years, a court heard today.", "Patsy Kerr had been summonsed to Omagh County Court after it emerged he had been the cause of a collapsed sewage pipe from a neighbouring house. Kerr told the court about his secret tunnel and the reasons behind it:", "“The wife has a bad snore on her and after watching the Shawshank Redemption on RTE one night in 1994, I decided to do something about it so I waited til she was in a deep sleep and then set about digging a hole under the bed in the direction of the pub. I used all manner of tools from spoons to a heavy duty tunnel boring machine I managed to sneak down there when she was at the shops. It wasn’t until 2009 that I hit the jackpot and came up through the women’s toilet mop and bucket room.”", "The story was picked up by viral web sites such as Boing Boing and BuzzFeed (both of which later admitted that they had been fooled) before it spread to less reputable sites such as 8shit.net. As of October 2018, web sites such as mens-corner.net were still presenting this story as if it were a genuine piece of news.", "This tale, however, is just a humorous bit of fiction.", "Tyrone Tribulations did not specifically mark this story as satire, but it was replete with sufficient  ridiculous details to clearly indicate that it was a work of fiction. The most telling aspect is likely found in the closing paragraph, which depicts a wife who simply shrugged off the fact that her husband routinely smelled of sewage:", "The tunnel was finally discovered after the DOE performed a survey on a sewage problem which turned out to be caused by a pipe Kerr had hit accidentally, causing sewage to leak into his tunnel over five years. The judge questioned Kerr’s wife as to why she never smelt the sewage odours from her husband. Mrs Kerr simply shrugged.", "\"Gombeen,\" the author of the article, also provided some humorous explanations when readers questioned the authenticity of his reporting. When asked how this Irish plumber could have seen the Shawshank Redemption in 1994 when the film wasn't released in Ireland until 1995, Gombeen remarked that years work strangely in the Emerald Isle. And when queried why this man would bother digging a tunnel when he could have just walked out of the front door given that his wife was such a sound sleeper (she apparently wasn't bothered by the noise of his power tools), Gombeen averred that the floorboards in Omagh are extra squeaky:", "Tyrone Tribulations frequently publishes humorous material that pokes fun at life in Ireland. Although the site does not carry a disclaimer explicitly labeling its content as satire, they do state that the accuracy of their stories \"cannot be guaranteed.\"", "We reached out to the site to confirm that this was a bit of fiction and asked the proprietor, \"Paudge McGaudge,\" what it was like to unwittingly fool thousands of people:", "I completely made the story up -- that's what my website does ... short local fictional stories. I've written 1000s now since 2012 but that was by far the most successful. I just thought about it driving home from work and wrote it up on my kitchen table in about 20-30 mins in Sept 2014. Within days it took off. I think the big pulls were: it being read out on BBC Radio 2 during the day as a funny real story; John Cusack tweeting about it; and Buzzfeed running with it before they realised it was fake. I don't mean to catch people out and take no pleasure in doing that -- I just like writing stories to make people laugh.", "Tyrone Tribulations.   \"Omagh’s ‘Shawshank Husband’ Dug Tunnel from Bedroom to Pub Over 15 Years.\"\r\n    25 September 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]