["About this rating", "In March 2021, a massive cargo ship called the Ever Given got stuck in the Suez Canal, blocking one of the world's busiest shipping routes. As authorities began working on a way to dislodge the stuck ship, conspiracy theorists went to work spreading unfounded rumors claiming that the ship was being used by former U.S. Secretary of State Hillary Clinton in a child-trafficking scheme.", "The claim that Clinton is trafficking children via the stuck cargo ship is based on a pair of seemingly odd coincidences.", "First, the company that owns this ship is Evergreen Marine Corporation. According to journalist Ronald Kessler's book \"In the President's Secret Service: Behind the Scenes with Agents in the Line of Fire and the Presidents They Protect,\" \"Evergreen\" was the name the Secret Service once used for Clinton.", "Second, the call sign for this boat is \"H3RC,\" which, with a little fudging, appear to be Hillary Rodham Clinton's initials.", "Why Clinton would leave behind clues to implicate herself in this alleged crime has not been explained. Furthermore, if there were any truth to these claims, one would expect a massive police presence at the Suez Canal as children are removed from these ships, as well as the announcement of an investigation into Clinton. None of that has come to pass, however, as this is nothing more than a perceived coincidence.", "Conspiracy theories are often built by people in search of dots to connect. In this case, some social media users noticed that this international incident bore some superficial coincidences to Clinton — who has been the target of a variety of baseless QAnon and Pizzagate conspiracy theories concerning the occult and child trafficking since her run for president in 2016 — and concluded that the only explanation was that Clinton was trafficking children through the Suez Canal via cargo ship. With the same barrier of evidence (taking two random factoids and forcibly drawing a line to connect them), one could argue that since this ship's International Maritime Organization (IMO) number is the same as a dentist's office in Jacksonville, Mississippi (minus the area code), this cargo ship was clearly carrying thousands of pounds of dentures.", "The conclusion that this ship was trafficking children (and that Clinton was somehow involved) was reached despite the fact that no children have been seen in the containers aboard this ship, no records have been unearthed that would connect Clinton to this company, or that the Evergreen Marine Corporation has been in operation since the 1960s, long before Clinton first warranted Secret Service protection. It should also be noted that anti-trafficking organizations such as the National Center for Missing and Exploited Children, the Coalition to Abolish Slavery and Trafficking, and The Polaris Project, have made no statements suggesting that this cargo ship could be carrying trafficked children.", "In July 2020, a similarly baseless rumor was circulated that claimed the furniture store Wayfair was involved in child trafficking. This rumor was based almost entirely on the perception that some of Wayfair's cabinets seemed overpriced. Polaris, the organization that runs the U.S. National Human Trafficking Hotline, released a statement at the time saying that its phone lines had been clogged by conspiracy theorists, which had made it \"difficult for the Trafficking Hotline to provide support and attention to others who are in need of help.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]