["About this rating", "On Jan. 6, 2021, hundreds of American right-wing extremists descended on the U.S. Capitol to try to block Congress from affirming the outcome of the presidential election in Joe Biden's favor. Meanwhile, a slew of rumors about the insurrection circulated online, including the below-displayed tweet (linked here) alleging a TikTok video showed police officers on the north side of the federal building removing barricades to help the rioters enter.", "\"[The] police opened the fucking gates,\" the viral tweet read, referring to video footage by a separate account on the other social media platform.", "[A similar rumor: Does this video shot from the east side of the Capitol show police waving in rioters?]", "The 14-second clip — which garnered more than 15 million views on Twitter alone, as of this report — showed iron barricades in the distance briefly separating a crowd of extremists and a handful of men wearing black uniforms marked \"U.S. Capitol Police.\" It was unclear where on the Capitol grounds, or when, the scene was captured during the chaos on Jan. 6.", "At the video's five-second mark, about a dozen rioters pushed past the waist-high gates, and a crowd of them walked into the previously blocked area of the federal property. With yelling and cheering in the background, a narrator said: \"Police are squabbling with protesters — ope, there we go. And they just breached the Capitol again.\"", "Based on our frame-by-frame analysis of the footage, it was indiscernible whether police or the extremists moved the barricades. The videographer zooms in and out from the action and maintains a vertical positioning — the standard format for TikTok — and does not show who exactly \"opened\" the gates to the federal property.", "However, after that brief moment, the footage showed U.S. Capitol police officers slowly walking away from the breached access point seemingly without any visible or forceful attempt to block the rioters from entering. There was no evidence of any use of force by police against the rioters.", "We tracked down the original creator of the TikTok video, freelance journalist Marcus DiPaola. On his account, which he said he used to report on Trump and the White House, he posted the viral footage around 2:30 p.m. EST, with the caption: \"Group just pushed Capitol police.\"", "In sum, while it was true video footage showed police at the U.S. Capitol seemingly giving up on barricades designed to block trespassers from entering the federal building, the clip did not provide enough evidence to determine who exactly moved the iron barricades, extremists or police. Additionally, the video's producer described the scene as rioters \"pushing\" past police, not as officers moving physical barricades. For those reasons, we rate this claim \"Unproven.\"", "This article was updated to note that the in-question video was taken from the north side of the U.S. Capitol.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]