["Before Congress finished counting the electoral votes and Vice President Mike Pence declared Joe Biden the winner of the presidential election, a rumor started to spread on social media that seemed to suggest Pence had abandoned his party.", "\"Things get even more bananas as VP Mike Pence unfollows Trump and changes his Twitter banner photo to Biden and Harris,\" reads a screenshot of a tweet posted on Facebook.", "The tweet featured a picture of the header photo on Pence’s Twitter account. It shows a man with white hair and a woman with brown hair photographed from behind as they hold hands and wave at a crowd.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Twitter has banned President Donald Trump from Twitter but before that happened, Snopes among others found that Pence still followed the president on the social media platform.", "As for the header photo, the white-haired man is Pence, and he’s holding the hand of his wife, Karen.", "Archived pages of Pence’s Twitter account show that in May 2020 his header photo was an image of him standing at a podium flanked by Trump and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases.", "On Nov. 3, he changed it to the image that appears in the tweet. Which means that he didn’t change it on Jan. 6, as the post alleges.", "He also changed it the day after a Trump rally in Grand Rapids, Mich. on Nov. 2. In the early hours of Nov. 3, he tweeted four other photos that are similar to the scene in his header photo. Bright spotlights shine on the stage and the crowd, which has gathered in the dark. Red, white and blue bunting adorns the adorns the podium. Red hats — such as those that Trump supporters wear — are visible.", "And of the four photos shows Pence holding his wife’s hand as they both wave. Like in the header photo, they are wearing gloves, long dark jackets and Karen Pence is wearing a hat.", "We rate the claim that Pence changed his header photo to one of Biden and Vice President-elect Kamala Harris False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Jan. 6, 2020", "The Washington Post, Pence declares Biden winner of the presidential election after Congress finally counts electoral votes, Jan. 7, 2021", "Politico, Trump went ‘ballistic’ after being tossed off Twitter, Jan. 8, 2021", "Snopes, Did Pence unfollow Trump on Twitter following Jan. 6 DC riots?, Jan. 6, 2021", "BuzzFeed News, No, Mike Pence did not unfollow Donald Trump on Twitter, Jan. 6, 2021", "Mike Pence Twitter, visited Jan. 11, 2021", "Mike Pence Twitter, archived May 2020", "Mike Pence Twitter, archived Nov. 16, 2020", "Mike Pence Twitter Wayback Machine archives, visited Jan. 11, 2021", "Mike Pence tweet, Nov. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]