["About this rating", "Roger Stone told his followers on the messaging app Telegram that he was not invited to speak at the 2021 Conservative Political Action Conference (CPAC) — a who's who of American conservatism held this year in Orlando, Florida. \"It [doesn't] matter because I am Roger Stone and the party is always where I am,\" he explained.", "True to form, Stone told his followers on Telegram on Feb. 26, 2021, that he was \"scheduled to shoot a music video at an undisclosed location in Orlando with my friend and rocker #BrysonGray.\" Later, in a since-deleted post on Parler, he added more detail, explaining that he'd be \"recording a music video with my patriot pal @ForgiatoBlow with @RealBrysonGray today in Orlando.\"", "A fervent ally of former U.S. President Donald Trump currently facing scrutiny for his alleged role in the Jan. 6, 2021, Capitol riot, Stone was pardoned by Trump on Dec. 23, 2020, after being \"sentenced to 40 months in prison on seven counts of witness tampering, lying to Congress, and obstructing the inquiry by the House into the Trump campaign's possible ties to Russia.\"", "Bryson Gray is a pro-Trump rapper from North Carolina. Forgiato Blow is a rapper \"known for other major factors, such as his support of Trump and hosting extravagant parties in the St. Petersburg area.\" In a video filmed by Daily Caller reporter Jorge Ventura that went viral on Feb. 27, Stone can be seen dancing with Forgiato Blow in front of a large pickup that reimagines the former president as Rambo:", "https://streamable.com/2wjwuq", "While it is unclear if this video is only part of a larger musical effort that, perhaps, involves Bryson Gray, the viral clip of Roger Stone rapping is authentic. As such, the claim is \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]