["About this rating", "Mustafaa Carroll, a CAIR leader in Texas, said \"if you're a true, practicing Muslim, you're above the law of the land\" during a 2013 speech.", "Carroll was not advocating for Muslims to ignore the laws of the United States, nor did he say that Sharia law supersedes the U.S. constitution.", "In January 2017, several disreputable and spammy web sites such as \"Focus News,\" \"Ultimate Flash News,\" and \"My Food Epic\" published nearly identical articles claiming that Muslim leader Mustafa Carroll had made a \"shocking\" statement at a Muslim rally in Texas when he said that Sharia law was greater than the constitution:", "MUSLIM LEADER: \"America Must Understand Sharia Law Is Greater Than The Constitution, Therefore Muslims Are ABOVE The Law", "The Director of the Dallas Council on American- Islamic Relations (CAIR), Mustafa Carroll, made a surprising and shocking statement during a Muslim rally in Austin, Texas.", "He said, “If we are practicing Muslims, we are above the law of the land.”", "He firmly believes that the message of the Qur’an is supreme over the United States constitution.", "The statement would be shocking to most citizens of the United States, unless they had some perspective on who CAIR really is.", "While these article were all published in January 2017, most likely to capitalize on the controversy surrounding the arguably misnamed \"Muslim ban\" imposed by President Trump, these web sites simply rehashed a (since deleted) article  published by the Supreme Patriot web site back in December 2015. Even the original was an outdated news item, however, as the event it referred to took place in 2013.", "The photograph included with this article (shown above) also does not show Mustafa Carroll. Carroll, the executive director of the Texas branch of the Council on American-Islamic Relations (CAIR), can be seen in his profile picture below:", "Carroll's statement was also taken out of context. According to the Texas Tribune, Carroll (during a Texas Muslim Capitol Day event in a 2013) was explaining how \"following the law of the land\" was an element  of Sharia law:", "A video taken of Carroll's statements at Texas Muslim Capitol Day in 2013 does show him saying, \"If we're practicing Muslims, we are above the law of the land.\"", "The quotation, however, comes at the end of a longer passage that places it in full context, and indicates that Carroll's intent was to express the opposite of what [was] alleged. Carroll was stressing that no one wanted to make Sharia \"the law of the land.\"", "\"Following the law of the land is part of Sharia,\" Carroll said, according to the video. \"And we follow the law of the land. In fact, Muslims, if we're practicing Muslims, we are above the law of the land. The law doesn't affect us at all.\"", "Carroll told the newspaper that he was aware of how his message was misunderstood, and added that he did not intend to imply that Muslims should ignore the laws of the United States:", "Carroll said he could understand why his words may have been misconstrued. But \"it's definitely not intended to mean we don't have to follow the law,\" he said. By saying Muslims were \"above the law,\" he said, he meant that true, practicing Muslims should behave in a way that would put them above any possibility of breaking the law. \"If you're a practicing Muslim, then you should be above all of that,\" he said.", "Satija, Neena.   \"Rep. White Explains Her Views on Muslims.\"\r\n    The Texas Tribune.   2 February 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]