["About this rating", "In the late summer and fall of 2020, a conspiracy theory spread on social media claiming that the catastrophic wildfires that raged on the West Coast were started by advanced laser weaponry.", "Conspiracy theories about direct energy weapons and wildfires have been circulating online since at least 2018, the same year the Camp Fire killed 88 people and destroyed thousands of homes in northern California.", "Direct energy weapons are weapons of war. The U.S. Department of Defense in August 2020 said it is partnering with the private sector to develop both high-powered laser and microwave weapons. The weapons would be used in battlefield or military defense scenarios to hit targets like drones and rockets, and eventually defend aircraft against missiles and bring down ballistic missile threats.", "In late 2020, in the wake of yet another round of devastating wildfires — this time raging in California, Oregon, and Washington state — Facebook users shared the following meme as evidence that the fires were caused by direct energy weapons:", "The original image was included in a gallery of photographs published by ABC News depicting the 2015 Valley Fire, which tore through Lake County and Napa County, about 90 miles north of San Francisco. According to investigators, the Valley Fire was caused by a hot tub with improperly installed wiring at a residential home in the town of Cobb.", "Even without that information, if you inspect the image, you will notice that the plastic slide isn't the only thing undamaged by fire. A number of trees, in addition to a swing set in the background — which appears to be made of metal components and not microwave safe — were also undamaged", "\"While some of the [2020] fires are still under investigation, we have no reason to believe any were caused by energy weapons,\" Lynne Tolmachoff, spokesperson for the California Department of Forestry and Fire Protection, told Snopes by phone.", "While many of the fires were started by dry lightning strikes, some were caused by human activities — for example, the El Dorado fire was caused by a pyrotechnic device used by a family at a gender reveal party. Experts say that the intensity and frequency wildfires in California as a whole are being exacerbated by climate change.", "ABC News. \"Wildfires Ravage the West Coast.\"   13 September 2015.", "Vergun, David. \"DOD Officials Discuss Framework for Advancing Directed Energy Weapons.\"   Defense.gov. 11 August 2020.", "Waterman, Shaun. \"Directed Energy Weapons Move Closer to Prime Time.\"   Air Force Magazine. 29 October 2019.", "The New York Times. \"The Climate Connection to California's Wildfires.\"   8 September 2020.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]