["About this rating", "Within days of a 4 January 2018 article in The Hill reporting that the FBI had launched an investigation into alleged illegal activities by the Clinton Foundation, several fake news web sites published stories alleging that 22 arrests had already been made in connection with the probe.", "The identically-worded posts also reported that the organization's founder, former president Bill Clinton, and his wife, former secretary of state and presidential candidate Hillary Clinton, are known to have murdered a U.S. senator and have \"100 bodies between them\":", "The first day of the investigation into the Clinton Foundation has already netted 22 criminals the FBI was already looking at. The charges range from drug trafficking to money laundering to perjury and there will be no leniency, according to US Attorney Jeff Sessions.", "The most prominent arrest was Frank Murphy, who ran the Clinton “security” company, meaning he facilitated all of the illegal transactions and was witness to all of it. If the FBI can crack him, the Clintons would be all over. Cracking him, however, won’t be easy.", "You have to remember that these people have gone so far as to murder a US Senator to keep themselves out of prison. With over 100 bodies between them, nobody, especially someone who knows them as well as Murphy, is going to cross them.", "Besides regurgitating long-discredited rumors about the Clintons' supposed involvement in the \"mysterious\" deaths of dozens of people connected with them, the articles name an alleged Clinton associate (\"Frank Murphy\") who does not appear to exist. They also cite U.S. Attorney General Jeff Sessions as the source of the information about the arrests -- had Sessions indeed commented on the (fabricated) arrests, both his comments and the arrests themselves would have been covered in reliable media outlets.", "According to anonymous government sources cited by The Hill, FBI investigators have interviewed \"at least one witness\" and \"additional activities\" are expected, but there were no revelations about arrests (or planned arrests) in the case.", "The claim that 22 arrests have taken place is a complete fabrication and can be traced to a web site that describes its own content is fiction. It was originally published on Ladies of Liberty, which bills itself as \"a whimsical playland of conservative satire\" and offers the following disclaimer:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "Solomon, John.  \"FBI Launches New Clinton Foundation Investigation.\"\r\n  The Hill.  4 January 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]