["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Margaret Sanger, the founder of the organization that became Planned Parenthood, ruffled some feathers in her day, namely for her vocal support of birth control and women’s reproductive rights. We have previously examined multiple claims about her.", "An outspoken activist, Sanger has also been a popular target for misattribution and fake quotes.", "One such phrase is currently being shared on social media. A post alongside an image of Sanger claims that in 1922 she said the following: \"Slav, Latin and Hebrew immigrants are human weeds...a deadweight of human waste. Blacks, soldiers and Jews are a menace to race.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We could not locate any record of Margaret Sanger ever saying that, though it appears to have circulated on social media since approximately July 2015, as other fact-checkers have noted.", "We did find an April 1923 New York Times article in which she said the word \"weeds,\" but she didn’t link it to any race or ethnicity:", "\"I was merely thinking of the poor mothers of congested districts of the East Side who had so poignantly begged me for relief, in order that the children they had already brought into the world might have a chance to grow into strong and stalwart Americans . . . Birth Control is not contraception indiscriminately and thoughtlessly practiced. It means the release and cultivation of the better racial elements in our society, and the gradual suppression, elimination and eventual extirpation of defective stocks — those human weeds which threaten the blooming of the finest flowers of American civilization.\"", "While Sanger has been routinely criticized for supporting eugenics—the belief of improving the population by controlled breeding for desirable characteristics—historians and scholars who have studied Sanger’s life challenge the idea that she was racist, and say her opinions concerned public health, not race.", "In a PolitiFact New Hampshire story, Ruth Engs, professor emerita at the Indiana University School of Public Health and an expert in the eugenics movement, said that while subscribers to this ideology included some who wanted to create some sort of master race, \"a minority of eugenicists\" said they believed this.", "At the time that Sanger was active, Engs wrote, \"the purpose of eugenics was to improve the human race by having people be more healthy through exercise, recreation in parks, marriage to someone free from sexually transmitted diseases, well-baby clinics, immunizations, clean food and water, proper nutrition, non-smoking and drinking.\"", "The philosophy ultimately fell out of favor during World War II, however, as Nazis adopted eugenics to support exterminating non-Aryan races.", "We spoke with Ellen Chesler, a Sanger biographer and senior fellow at the Roosevelt Institute in New York, about the quote.", "\"She never said that. It’s a completely incorrect, made-up quote,\" Chesler told us. \"The people on the left of eugenics (at the time) believed in a truly democratic society, that opportunity should not be based on the color of someone’s skin or ethnic background, but on ability, that opportunity should rest with those who are the most able … Sanger believed that if you were able you should be given opportunity, no matter what you looked liked or where you came from.\"", "An image circulating on social media claims Sanger said, \"Slav, Latin and Hebrew immigrants are human weeds...a deadweight of human waste. Blacks, soldiers and Jews are a menace to race,\" in 1922.", "The closest quotation we could find was from a 1923, not 1922, New York Times article, and it doesn’t even come close to the phrase in the meme.", "Margaret Sanger did leave behind a complicated legacy and, at times, said some outlandish things – but she never said this.", "This is Pants on Fire!", "Facebook post, Jan. 24, 2019", "TIME, What Margaret Sanger Really Said About Eugenics and Race", "Salon, \"Was Planned Parenthood's founder racist?, Nov. 2, 2011", "New York Times archives, Margaret Sanger article, April 8, 1923; Accessed Jan. 25, 2019", "PolitiFact New Hampshire, Did Margaret Sanger believe African-Americans \"should be eliminated\"? Oct. 5, 2015", "Phone interview, Ellen Chesler, Sanger biographer and senior fellow at the Roosevelt Institute, Jan. 25, 2019", "History.com, \"Eugenics,\" accessed Jan. 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]