["A viral message doing rounds on social media ascribes the following quote to Bollywood actor Shah Rukh Khan – “पाकिस्तान के कलाकारों का बहिष्कार हुआ तो मे देश छोडुंगा (I will leave the country if Pakistani artists are boycotted).” From a Facebook group नमो भक्त। हर नमो समर्थक जुड़ते ही अपने 50 मित्रो को अवश्य जोड़े। (Namo Bhakt), the message has 1,400 likes and 358 shares.", "The message has been shared on other right-wing Facebook groups as well – BJP SOCIAL MEDIA(बीजेपी सोशल मिडिया), Sudhir Chaudhary, भा.ज.पा : Mission 2019, Modi Mission 2019.", "It has also been circulated by a few Twitter users.", "पाकिस्तान के कलाकारों का बहिष्कार हुआ तो मे देश छोडुंगा -शाहरुख खान", "— Sumaira Khan (@Sumairakhan_) February 22, 2019", "Bollywood actor Shah Rukh Khan did not make the aforementioned statement. No media reports substantiate the claims that Khan said that he will leave India if the country bans Pakistani artists.", "The actor had condemned the Pulwama attack on February 15, offering condolences to the families of the martyred soldiers.", "Heartfelt condolences to the families of our valiant jawans. May the souls of our countrymen who laid their lives down for us rest in peace. #Pulwama", "— Shah Rukh Khan (@iamsrk) February 15, 2019", "On February 18, All India Cine Workers Association announced a total ban on Pakistani actors and artists working in the Indian film industry.", "All India Cine Workers Association announce a total ban on Pakistani actors and artists working in the film industry. #PulwamaAttack pic.twitter.com/QpSMUg9r8b", "— ANI (@ANI) February 18, 2019", "The above-mentioned piece of misinformation wasn’t the sole instance when Shah Rukh Khan was targetted after the Pulwama terror attack. Earlier, fake news that the actor had donated Rs 45 crores to Pakistan but did not offer aid to martyred soldiers in India was viral. The actor has, in fact, found himself in the crosshairs of misinformation several times in the past.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]