["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After U.S. airstrikes killed fighters of Iran-backed militia in Iraq, protesters broke into the U.S. Embassy compound in Baghdad on Dec. 31, 2019, in what the Associated Press called \"one of the worst attacks on the embassy in recent memory.\"", "Several days later, social media posts including this one on Facebook identified a man photographed in a crowd as the \"guy who led the storming of the U.S. embassy.\"", "The Jan. 4 post paired the image with a second photo captured at the White House on Dec. 12, 2011. The post says that one of the people photographed with then-President Barack Obama and then-Iraqi Prime Minister Nouri al-Maliki is the same person. \"Also guy who led the storming of the U.S. embassy,\" the wording over the Facebook image reads.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We looked into it. And while it we can’t verify what role this man played in the Dec. 31 U.S. Embassy raid (we find nothing indicating he \"led\" it as the post suggests), it does appear he was in attendance there as well as being a White House visitor years earlier during the Obama administration.", "News outlets like the Associated Press are reporting that a man named Hadi al-Amiri was among commanders of militia factions loyal to Iran who joined protesters outside the embassy on Dec. 31. In 2011, Amiri, then Iraq’s transportation minister, did indeed visit the White House. (You can read more on the criticism his appearance drew here.)", "Secretary of State Mike Pompeo tweeted the first photo that appears in the Facebook post alongside two others on Dec. 31.", "\"The attack today was orchestrated by terrorists — Abu Mahdi al Muhandis and Qays al-Khazali — and abetted by Iranian proxies — Hadi al Amari and Faleh al-Fayyad,\" he wrote. \"All are pictured below outside our embassy.\"", "This photo of that 2011 White House meeting is similar to the one that appears in the Facebook post, though Obama is obscured by a lamp. If you zoom in on the man in the blue tie, it appears to be Hadi al-Amiri, though the photo caption doesn’t identify him.", "We don’t know Amiri’s role in the December attack. Fox News reported \"it is unclear what Amiri’s level of involvement was in the siege.\" The Associated Press said he \"joined the protesters outside the embassy in a strikingly bold move.\" In a story headlined, \"These 3 pro-Iran militia leaders are provoking protesters at the U.S. Embassy in Baghdad,\" the Washington Post said he was \"also in attendance.\"", "But he is the same person who visited the White House in 2011.", "A viral Facebook post displays two pictures — one taken at the White House in 2011 and one taken at a protest outside the U.S. Embassy in Baghdad in December 2019 — and says they show the same man was at both. We rate this True.", "Facebook post, Jan. 4, 2019", "UPI, Obama meets with IraqiPrime Minister al-Maliki, Dec. 12, 2011", "Getty Images, Hadi al-Amiri photos, visited Jan. 8, 2019", "The Associated Press, Protesters attack US Embassy in Baghdad after airstrikes, Dec. 31, 2019", "The Washington Post, An Iraninan ‘terrorist’ in the White House?, Dec. 20, 2011", "Mike Pompeo tweet, Dec. 31, 2019", "Fox News, Iraqi official spotted outside embassy attack visited Obama White House in 2011, Jan. 3, 2020", "The Washington Post, These 3 pro-Iran militia leaders are provoking protesters at the U.S. Embassy in Baghdad, Dec. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]