["The three photos were published here in a Facebook post on August 7, 2019 by a page with more than 5.8 million followers.", "The caption in Hindi says: “After scrapping Article 370, this is called new Kashmir.”", "Article 370 refers to the special arrangement in the Indian constitution that granted semi-autonomous status to India’s northern state of Jammu and Kashmir since independence in 1947.", "Article 370 was revoked by the Indian government on August 5, 2019. Here is a series of tweets by Indian Prime Minister Narendra Modi on the development.", "Below is a screenshot of the misleading Facebook post:", "These photos were also shared here, here and here on Facebook, and here on Twitter alongside similar claims.", "But the photos do not show Kashmir after Article 370 was revoked; they have circulated online since at least 2017.", "A reverse image search on Google found the photo was tweeted here by journalist Aditya Raj Kaul June 10, 2017.", "The photo was also published here in a blog on July 10, 2017.", "The second photo dates back to at least 2010. A reverse image search on Google found the picture was published here on a website named Pakistan Defence on April 8, 2010.", "The same picture was published multiple times on Indian news and entertainment web portal rediff.com alongside articles on Kashmir, for example this and this story on April 4, 2012 and May 10, 2017 respectively.", "The third photo has been used in multiple news reports on Indian websites, for example here on June 26, 2017 and here on June 29, 2018.", "“An army jawaan (soldier) distributes sweets in commemoration of Eid to an old man,” reads a caption below the photo published here in a news report on The Quint website on June 26, 2017. The photo is credited to Indian news agency ANI.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]