["During a video interview with the Texas Tribune, U.S. Rep. Chip Roy, a Republican from Austin, discussed the status of coronavirus in the state and spoke about a number of policies under consideration — including whether mail-in voting should be expanded for the general election in November.", "Citing concerns about voter fraud, Roy said it doesn’t make sense to \"flip our system on its head and convert to all, or significant, mail voting\" or online voting.", "Instead, he said state officials should be able to find a way to make in-person voting safe by the time the November election rolls around. He pointed to Wisconsin as evidence that in-person voting could be safe, even during a pandemic.", "Wisconsin’s presidential primary election was held April 7, after a legal fight and much public debate about whether it was safe for voters to go to the polls in the middle of the pandemic.", "\"If you look at Wisconsin, I’ve yet to see a spike or anything (in coronavirus cases) that anybody has said was statistically significant related to the fact that they had voting,\" Roy said.", "Evan Smith, chief executive officer of the Texas Tribune, interjected and said: \"In fact, the Wisconsin Health Department said that 36 people at least are believed to have gotten the virus as a consequence of voting in person. There has been reporting on this.\"", "Roy replied: \"I’ve looked at that report and I’ve looked at studies and I’ve not seen any significant study that has shown a spike as a result of their election. By the way, that was in the heat of the initial outbreak a few weeks ago. What we’re talking about is laying out a system where this can work, and we’ve got until November to do it.\"", "PolitiFact Wisconsin has examined other claims related to its election, but is it true that there was no statistically significant spike in COVID-19 cases as a result of the election?", "Roy’s office did not return a request for comment.", "Tracking cases", "In the weeks since April 7, health experts in Wisconsin have attempted to track the number of COVID-19 cases with links to the election.", "The tally includes people who tested positive for COVID-19 after April 9 who reported having voted in person or who worked at the polls on the day of the election. The tally does not include people who voted or worked the polls but started to display symptoms after April 21.", "As of May 7, Wisconsin had identified 67 people who fit this criteria, according to Jennifer Miller, spokeswoman for the Wisconsin Department of Health Services.", "But that does not guarantee that these individuals contracted the virus while voting, a point state health officials have emphasized.", "In an interview with the Milwaukee Journal Sentinel (a PolitiFact Wisconsin partner), Darren Rausch, lead for the Milwaukee County COVID-19 Epidemiology Intel Team, said the election’s timing makes it difficult to link cases to the voting.", "\"What complicated our analysis is also included in this time frame is both the Easter and Passover holiday weekends, and both of those included the opportunity for significant breaches of the safer-at-home order,\" he said. \"So that was complicating our work from the beginning.\"", "In total, Wisconsin had reported 8,901 cumulative positive coronavirus tests on May 6, when Roy made this statement. That total includes 335 new cases recorded that day.", "On election day, an estimated 413,000 people voted in person across Wisconsin, according to the Milwaukee Journal Sentinel. Experts said a surge tied to the election would have appeared in statewide data at the end of April, given the incubation period of the coronavirus. But, no surge appeared.", "One factor could be mitigation efforts in place across the state at the time, as cellphone data analyzed by researchers showed residents complying with stay-at-home orders in the week after the election.", "Since then, the number of cases linked to the election increased from about 40 to 67.", "Dr. Ryan Westergaard, the chief medical officer at the Wisconsin Department of Health Services, said there is reason to believe the election did expose some individuals to the virus, but there is not enough data to point towards a statewide trend.", "\"With the data we have, we can't prove an association,\" Westergaard said in an interview with the Milwaukee Journal Sentinel. \"It would be speculative to say that was definitely the cause without really investigating closely and being clear that somebody really had no other potential exposure to infected people. I don’t think we have the resources to really do that to know definitely.\"", "Public figures have repeatedly tried to connect trends in coronavirus cases in Wisconsin with the election, but other factors have impacted the data. On April 22, the state saw a spike in cases, but the spike was tied to outbreaks at meatpacking plants in the state — not the election.", "A different spike, identified earlier in April, was due to a change in the number of tests being administered. Facebook posts suggested that the state was seeing more cases, but this was due to a dip in the number of tests administered and a subsequent increase in testing.", "Our ruling", "Roy said Wisconsin has not had a spike in coronavirus cases that was \"statistically significant related to the fact that they had voting.\"", "Wisconsin has linked 67 coronavirus cases to the April 7 primary election in the state, a small fraction of the state’s total cases. But the data is limited. Health officials said there is significant uncertainty surrounding these figures, and the election’s true impact might be impossible to determine.", "We rate this claim Mostly True.", "Texas Tribune, Watch: U.S. Rep. Chip Roy discuss the federal response to the coronavirus outbreak and its effects on workers and families, May 6, 2020", "PolitiFact Wisconsin, No proof (yet) of a post-election \"surge\" in Wisconsin coronavirus cases, April 21, 2020", "PolitiFact Wisconsin, Chris Larson has no basis to connect spike in new coronavirus cases to election, April 24, 2020", "Milwaukee Journal Sentinel, 26 Milwaukee residents may have been infected with COVID-19 during in-person voting April 7, but report is inconclusive, May 6, 2020", "Milwaukee Journal Sentinel, Wisconsin spring election results, April 13, 2020", "Milwaukee Journal Sentinel, In-person voting didn't lead to spike in COVID-19, but concerns remain, April 29, 2020", "Wisconsin Watch, Wisconsin set to hold more elections during coronavirus pandemic, as clerks scramble to ensure safety, May 5, 2020", "CBS News, No spike, but no certainty on fallout of Wisconsin election, May 7, 2020", "ABC News, 52 who worked or voted in Wisconsin election have COVID-19, April 29, 2020", "Email interview with Jennifer Miller, spokeswoman for the Wisconsin Department of Health Services, May 8, 2020", "Wisconsin Department of Health Services, COVID-19: Wisconsin Cases, accessed May 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]