["A photograph of India’s first Prime Minister Jawaharlal Nehru has been shared widely on social media, along with an elaborate message which reads,", "“When Nehru got a slap on the face ( virtual gan* pe laat ) by Swami Vidyanand Videh post 62 debacle . Reason : Nehru in his speech had said that Aryas were refugees in India , hearing this Swami who was also the Chief guest got up went up to the stage and slapped Nehru , pulled the mike to him and said ” The Aryas were not refugees they were my ancestors and they were original inhabitants of Bharat but your ( Nehru’s ancestors ) were of Arabian descent and in your veins flow arab blood so you in fact are not the original inhabitants of this great Country … if Sardar Patel was the P.M instead of you , we would not be in such a sorry state “", "From : (विदेह गाथा: एक आर्य संन्यासी की डायरी, पृष्ठ 637 संस्करण भाद्रपद 2037 विक्रमी…से साभार)", "(बाद मे इन आर्य संन्यासी ने एक किताब लिखी नेहरू : उत्थान और पतन… जो 1963 मे बैन हो गई थी।)", "Pic : Nehru after the slap wanting to retaliate but held back”", "Please read 2 times. So are the decendents.", "Posted by Gurmeet Singh Sandhu on Saturday, 13 February 2021", "The message claims that Nehru was publicly slapped in 1962 after he had said in a speech that “Aryas were refugees in India”. He was apparently slapped by the chief guest and Vedic scholar Swami Vidyanand Videh, who objected to Nehru’s remark and retorted that Aryans are the original inhabitants of Bharat and that it is Nehru who has Arab blood in his veins. It is further mentioned that the same is cited in a book penned by the swami.", "To what extent it is true, we can judge .As Nehru was among Statesman, whom India trust . When Nehru got a slap on the…", "Posted by Om Sharan on Wednesday, 20 January 2021", "The photo and the message with identical text were posted by several individual users on Facebook in 2019.", "The same has been shared on Twitter. Alt News also found the same text in a blog published in 2016.", "1. When Nehru got a slap on the face (virtual gan*pe laat) by Swami Vidyanand Videh post 62 debacle. Reason:Nehru in his speech had said “Aryas were refugees in India”, hearing this Swami who was also the Chief guest got up went up 2 the stage and slapped Nehru,pulled d mike 1/3 pic.twitter.com/y6pDsH54jq", "— G V Nair🇮🇳NaMo🙏 (@gvnair91) September 18, 2019", "The social media claim which accompanies the photograph is false. Alt News had earlier fact-checked this photograph of Jawaharlal Nehru, wherein he appears to be restrained by being held from the back, when it was circulated with a false narrative referring to 1962 and the Sino-Indian war.", "While it is true that this photograph is from 1962, it is in no way related to the Sino-Indian war or its political aftershocks. Reverse-searching the image on Google, Alt News found that it had appeared in an article in Outlook magazine published in 2014. The photograph was captioned, ‘Braced for the worst: Nehru is prevented from plunging into a riotous crowd in 1962, before the war’. The image was credited to Associated Press (AP).", "Searching the Associated Press archives with the key words ‘Nehru 1962’, Alt News found the picture and also the correct narrative describing it – “A security man grabbed Indian Prime Minister Nehru to keep him from plunging into a riotous crowd at a meeting of the Congress Party in Patna, India, January 1962. Later in the year, Communist China’s attack on India plunged Nehru into new troubles.” This implies that the photograph was taken before the Indo-Sino war in 1962.", "Alt News looked at newspaper reports of January 1962, and found that the photograph was clicked at the Congress session in Patna, which was held in January, 1962. The crowd at the plenary session had swelled, and as it moved closer to the dais to get a glimpse of the Prime Minister, pandemonium broke out, resulting in a stampede. The photograph was clicked at the moment when Nehru, in “personal effort to restore order”, was restrained by security personnel from plunging into the crowd.", "Moreover, Alt News found no trace of the references cited in the message, two books named विदेह गाथा: एक आर्य संन्यासी की डायरी and नेहरू : उत्थान और पतन.", "Alt News had fact-checked this image earlier, when it was shared with the false narrative of Nehru thrashed by a mob after failure in the 1962 war. It is noteworthy that the photograph was clicked in January 1962, whereas the Sino-Indian war broke out in October that year. The same image has been circulated with one more false narrative- of Nehru arrested in Kashmir in 1946 as he attempted to enter without a visa.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]