["About this rating", "The act of setting fire to an LGBT rainbow flag in Ames, Iowa, in June 2019 did ultimately result in Adolfo Martinez receiving a total sentence of 16 years in prison.", "Several news articles failed to mention that Martinez' sentence would not have been nearly so long if he had not already been convicted of two previous felonies and treated as an \"habitual offender,\" in keeping with Iowa state law. In that circumstance, his criminal history tripled the maximum available sentence for arson from five years to 15 years.", "In December 2019, we received multiple inquiries from readers about news reports that claimed an Iowa man, 30-year-old Adolfo Martinez, had been given a 16-year prison sentence for burning an LGBT rainbow flag.", "For example, the right-leaning Western Journal website reported that:", "\"As leftists are free to torch U.S. flags across the nation, an Iowa man is paying a heavy price for burning a rainbow LGBT pride flag. Adolfo Martinez of Ames was sentenced Wednesday to a whopping 15 years in prison for the hate crime of arson, according to The Associated Press. In addition to spending a decade and a half in prison for burning the LGBT flag, the 30-year-old Martinez also will be serving an additional year for his use of fire and 30 days for harassment.\"", "For its part, the UK tabloid newspaper the Sun compared Martinez' punishment to what it claimed was the average sentence in rape convictions in the United States:", "\"A homophobe who wanted to 'punish' gays has been jailed for 16 years for burning a LGBT pride flag — a tougher sentence than for rape. Adolfo Martinez, 30, stole the flag from United Church of Christ in Ames, Iowa, because he hated gay people before burning it outside Dangerous Curves lap dancing club ... Martinez was found guilty last month of third-degree arson in violation of individual rights, third-degree harassment, and reckless use of fire. Story County Attorney Jessica Reynolds said Martinez was the first person in the county's history to be convicted of a hate crime. For this he received a hefty 16 year prison sentence which far exceeds the average sentence for rape in the United States, which is about 10 years.\"", "The website Disrn wrote that: \"Martinez's lengthy sentence stemmed from the state's successful prosecution of a 'hate crime.' The prosecution believed that Martinez had burned the flag due to its LGBT connotations.\"", "Further reports were published by Metro UK, the LGBT interest website The Advocate, and the pro-life, right-leaning website LifeSiteNews.", "The aforementioned news articles told only part of the story of Martinez' unusually long prison sentence, and none of them mentioned the key factor that resulted in his facing 15 years in prison for third-degree arson: that Martinez had two previous felony convictions, meaning that under Iowa law, he was sentenced as an \"habitual offender.\" It was this legal provision, triggered by the hate crime charge, that multiplied his prison sentence to 15 years.", "If Martinez' act of arson had not constituted a hate crime, he would have faced a maximum sentence of two years in prison. With the hate crime enhancement, he would ordinarily have faced a maximum sentence of five years in prison. It was only because of his status as a habitual offender, triggered by the hate crime enhancement, that he faced a maximum sentence of 15 years, which the judge imposed.", "Ames, Iowa, police arrested Martinez in the early hours of June 11, after police said he had caused a disturbance at a local bar and threatened to burn down the establishment, before returning with an LGBT rainbow flag he stole from the Ames United Church of Christ, and setting fire to it outside the bar. Martinez admitted to his crimes in an interview with KCCI, saying he was motivated by an antipathy towards homosexuality and that he had \"burned down their pride, plain and simple.\"", "Despite his on-screen confession, Martinez pleaded not guilty to three charges, the Story County Attorney's Office told Snopes: Third-degree arson, an aggravated misdemeanor which typically carries a maximum sentence of two years in prison; third-degree harassment, a simple misdemeanor; and reckless use of fire or explosives, a serious misdemeanor that typically carries a maximum prison sentence of one year.", "On Nov. 6, a jury in Story County convicted Martinez on all three charges. The County Attorney's Office confirmed to Snopes that Martinez was given a 30-day prison sentence for the charge of third-degree harassment, and a one-year sentence for reckless use of fire or explosives.", "In the normal course of events, a conviction for third-degree arson would yield a maximum sentence of two years in prison. However, because the flag burned by Martinez was an LGBT symbol, and because Martinez himself said this was his motivation for setting fire to it, prosecutors added a hate crime enhancement to the arson charge.", "Iowa law requires that certain offenses, if prosecuted as a hate crime, must be \"classified and punished as an offense one degree higher than the underlying offense.\" Thus, Martinez's conviction for third-degree arson was elevated from an aggravated misdemeanor to a Class D felony.", "In Iowa, a Class D felony is typically subject to a maximum prison sentence of five years. However, Martinez had two previous felonies, details of which were not immediately available. Iowa law designates as an \"habitual offender\" anyone \"convicted of a class 'C' or a class 'D' felony, who has twice before been convicted of any felony in a court of this or any other state, or of the United States.\" Therefore, Martinez was sentenced as an habitual offender.", "Iowa law states that the maximum sentence for an habitual offender is 15 years in prison. In this case, prosecutors recommended that maximum sentence, on the basis that they believed Martinez to be \"very dangerous\" and because of his lack of remorse. Story County Attorney Jessica Reynolds told KCCI that Martinez \"stated that there was nothing the judge could do to stop him from continuing this behavior, and that he would continue to do this, no matter what.\"", "On Dec. 18, the judge imposed that maximum sentence, to be served consecutively with the one-year sentence for reckless use of fire and 30-day sentence for third-degree harassment, yielding a total prison sentence of 16 years. Due to his status as an habitual offender, Martinez will not be eligible for parole until he has served a minimum of three years.", "It's true that the action that garnered Martinez a total prison sentence of 16 years was setting fire to an LGBT flag outside a bar in Ames, Iowa, in June 2019. However, this does not account for the length of his prison sentence.", "If the object Martinez burned had been a neutral one (for example, a banner or flag bearing the logo of a brand of beer) then his third-degree arson conviction would not have been enhanced as a hate crime, and he would have received a sentence of no more than two years in prison, likely yielding a total sentence of three years, taking into account the one-year sentence he received for reckless use of fire. So it's true that the fact it was an LGBT rainbow flag, specifically, did cause Martinez' punishment to be increased. Because the hate crime enhancement converted the arson offense from an aggravated misdemeanor to a Class D felony, it also triggered the habitual offender mechanism.", "However, that habitual offender mechanism would not have been triggered if Martinez did not already have two felony convictions. Without that criminal history, Martinez would simply have been given a sentence commensurate with a Class D felony, after the addition of the hate crime enhancement. Instead, because of his own previous convictions, his sentence for third-degree arson was tripled, from five years to 15 years.", "The websites mentioned at the beginning of this article served their readers poorly by failing to provide this crucial contextual information and created the false impression that anyone, in any circumstances, was liable to be imprisoned for 16 years for burning an LGBT rainbow flag in the state of Iowa.", "Harris, Jared.  \"Iowa Man Gets 16 Years for Burning LGBT Flag.\"\r\n  Western Journal.  19 December 2019.", "Knox, Patrick.  \"Homophobe Jailed for 16 Years for Tearing Down LGBTQ Flag and Setting Fire to It in Iowa.\"\r\n  The Sun.  20 December 2019.", "Payne, Daniel.  \"Iowa Man Gets 16 Years in Prison for Stealing Church's LGBT Flag, Burning it Elsewhere.\"\r\n  Dsrn.  19 December 2019.", "McCloskey, Jimmy.  \"Homophobe Who Wanted to 'Punish' Gays Jailed for 16 Years for Burning LGBT Pride Flag.\"\r\n  Metro UK.  19 December 2019.", "Ogles, Jacob.  \"Iowa Man Gets 16 Years for Burning Rainbow Flag.\"\r\n  The Advocate.  20 December 2019.", "Mainwaring, Doug.  \"US Man Gets 16 Years in Prison for Stealing, Burning LGBT 'Pride' Flag.\"\r\n  LifeSiteNews.  19 December 2019.", "Gothner, Chris.  \"'I'm Guilty As Charged': Man Says He Doesn't Regret Burning Church LGBTQ Banner at Gentlemen's Club.\"\r\n  KCCI.  19 June 2019.", "The Iowa Legislature.  \"The Iowa Code.\"\r\n  Accessed 20 December 2019.", "Gehr, Danielle.  \"Pastor of Ames Church Targeted With Hate Crime Says Christians Have a Duty to Fight Bigotry.\"\r\n  The Des Moines Register.  6 November 2019.", "The Des Moines Register.  \"Iowa Man Sentenced to 16 Years for Setting LGBTQ Flag on Fire.\"\r\n  19 December 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]