["Prime Minister Narendra Modi will be visiting his parliamentary constituency, Varanasi on Saturday. Before his visit to Varanasi, PM made a stop at Ghazipur, Uttar Pradesh to release a commemorative postage stamp of Maharaj Suheldev and address a public rally. Addressing the rally, Modi took a jibe at the ruling coalition regime in Karnataka and claimed that while they had promised loan waivers for lakhs of farmers till date only 800 farmers have been benefited.", "#PMInGhazipur: Karnataka mein laakhon kisaano ka karz maafi ka vaada kiya tha lekin sirf 800 kisaano ka karz maaf hua. Ye kaisa khel hai, kaisa dhoka hai? pic.twitter.com/JtIj2W3noD", "— ANI UP (@ANINewsUP) December 29, 2018", "In July this year, Karnataka CM HD Kumaraswamy had announced a conditional waiver of farm loans, setting aside Rs 34,000 crore in the first budget presented by the JD(S)-Congress coalition government. Later, the figure had shot up to Rs 44,000 crore as the government decided to waive all crop loans of Rs 1 lakh in cooperative banks availed till July 1, 2018.", "PM Modi’s claim that only 800 farmers have availed the farm loan waiver is outdated. The origin of this claim is a December 13, Times of India report in which it was reported that the Karnataka government has distributed the sum of Rs 44,000 cr mandated for farm loan waiver scheme to 800 farmers. It further stated,“Cooperation minister Bandeppa Kashempur told the legislative that only about 800 farmers have availed the benefits of the scheme announced, by the CM on July 5.”", "Since then, there have been multiple reports which illustrate the progress in the disbursement of loan waiver by the Karnataka government. A reality-check report by NDTV on December 19, 2018 said that almost 27,000 Karnataka farmers have received their cooperative bank loan waiver certificates at a total cost of almost 150 crores. Although, the loan limit was capped at Rs 2 lakh per each family what is being waived now is an initial Rs 50,000 per loan.", "An article by The Mint on December 27, 2018 presented the updated figures of the farm loan waiver disbursement that matched the figures as reported by NDTV.", "A report published by The Hindu on December 28 stated that So far, about 70,000 farmers specifically in the cooperative sector have availed benefited from the scheme and the total waiver was pegged around Rs 348 crore.", "In conclusion, Prime Minister Narendra Modi’s claim that so far only 800 farmers have been benefited by the loan waiver promised by the Karnataka government is false. Even though multiple media outlets have published the updated figures since the Times of India report, PM Modi chose to refer to the outdated numbers.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]