["About this rating", "On Aug. 22, 2019, TMZ first reported that former U.S. President Barack Obama and former first lady Michelle Obama were “locking down [an] incredible Martha's Vineyard estate.” The gossip website cited several local sources, reporting that the Obamas were in escrow for a Vineyard property currently owned by Boston Celtics owner Wyc Grousbeck:", "Multiple island sources tell us the Obamas are in escrow for the estate owned by Boston Celtics owner, Wyc Grousbeck. The former Prez and First Lady have been renting the house this summer and loved it so much, we've learned they made an offer. The property is listed at $14,850,000. Our sources say they're paying less, but we don't know how much.", "The details of the potential sale were not made public at the time and, as TMZ reported, “it's not a done deal just yet. We're told there are contingencies so it's possible it could fall apart.” The property in question in the affluent Massachusetts community was listed at just shy of $15 million and does have waterfront access.", "As of Sept. 6, 2019, no sales report of the purchase had been logged with the Dukes County Registry of Deeds. We reached out to the Obama family press office to inquire about the status of the transaction but have not received a response. All major reporting on the topic, at that point, stemmed from TMZ’s \"multiple island sources.\" Neither the realtors nor representatives for Grousbeck provided statements to the news media.", "In December 2019, the Martha's Vineyard Gazette reported that the sale had been completed and that the new deedholder is a nominee trust representing the Obamas:", "Former President Obama and his family are now permanent homeowners on Martha’s Vineyard, after completing the purchase this week of a large home situated on nearly 30 acres in the coastal perimeter of Edgartown.", "The purchase price, recorded at 3:31 p.m. Wednesday with the Dukes County Registry of Deeds, is listed at $11.75 million. The buyer is a nominee trust representing the former First Family. The sellers are Wycliffe Grousbeck and Corinne Basler Grousbeck. Mr. Grousbeck is a private equity investor and owner of the Boston Celtics basketball team.", "The deed lists the buyer as \"James F. Reynolds, as trustee of The 79 Turkeyland Cove Road Nominee Trust.\" Multiple news reports have identified Reynolds as a longtime friend of the former first family, but none of the documents available through the Dukes Country Registry of Deeds mentioned the Obamas by name at the time.", "In August 2021, however, news coverage of plans for Obama's 60th birthday party made clear he is the owner of the property. As such, the claim is true.", "TMZ.   “Barack and Michelle Obama Locking Down Incredible Martha's Vineyard Estate!!!”\r\n    22 August 2019.", "Dukes County Registry of Deeds.   “Quitclaim Deed.”\r\n    Accessed 2 January 2020.", "Dukes County Registry of Deeds.   “Declaration of Trust.”\r\n    Accessed 2 January 2020.", "Dukes County Registry of Deeds.   “Mortgage.”\r\n    Accessed 2 January 2020.", "Dukes County Registry of Deeds.   “Sales Reports”\r\n    Accessed 13 September 2019.", "Dorman, Sam.   “Obamas Placed an Offer on 'Mega-Expensive' Estate in Martha's Vineyard: Report.”\r\n    Fox News.   22 August 2019.", "Reiss, Jaclyn.   “Barack and Michelle Obama Are Reportedly Buying a Martha’s Vineyard Mansion.”\r\n    The Boston Globe.   22 August 2019.", "Stieb, Matt.   “Barack and Michelle Obama Are Reportedly Buying a Mansion in Martha’s Vineyard.”\r\n    New York.   22 August 2019.", "Wells, Julia.   \"President Obama Buys Home on Edgartown Great Pond.\"\r\n   The Vineyard Gazette.   4 December 2019.", "UPDATE [Jan. 2, 2020]: Updated to report that the property sale was completed in December 2019 with a nominee trust named as the purchaser.", "UPDATE [Aug. 4, 2021]: Changed rating from \"Unproven\" to \"True\" based on coverage of Obama's 60th birthday party, which was to be held at this property.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]