["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Emily's List is stoking the abortion debate in Colorado's 6th Congressional District race with a fundraising email saying Republican incumbent Mike Coffman \"co-sponsored a bill to redefine rape.\"", "Emily's List -- a political organization that supports the election of Democratic women who support abortion rights -- has endorsed Coffman's opponent, state Sen. Morgan Carroll, an Aurora Democrat. Its mailer focused on reproductive rights, abortion and Roe v. Wade.", "In the email, titled \"2016 goal: A Congress that fights for women and families,\" Emily's List said, \"We wish Congress was less like this\" -- citing Mike Coffman's co-sponsorship of the 2011 bill -- \"and more like this … Morgan Carroll sponsored a bill to make emergency contraception available to sexual assault survivors.\"", "We wanted to check the accuracy of Emily's List's characterization of Coffman's role in the legislation.", "Coffman did co-sponsor the No Taxpayer Funding for Abortions Act, which attempted to redefine a ban on federal funding for abortions to exempt \"forcible rape\" -- and not rape in broader terms.", "Critics said the \"forcible rape\" language could rule out other forms of sexual assault that are considered rape, including statutory rape, attacks where women are drugged or threatened, and date rapes.", "Facing a backlash from women's groups, Republicans amended the bill in committee to remove the word \"forcible\" and make the exemption for \"rape.\" Coffman wasn't on this committee and didn't vote on the removal.", "\"The bill was amended in committee, and Congressman Coffman supported the amended bill on the floor,\" a Coffman campaign spokesman later said.", "Congressional records show that Coffman voted for the amended bill in a floor vote, which passed the House but not the Senate.", "In recent years, Coffman has tempered his position on abortion in one of the country's most competitive \"swing\" districts, which is nearly evenly divided among Democrats, Republicans and independents.", "In 2012, he said, \"I am against all abortions, except when it is necessary to protect the life of the mother.\"", "But a year later, Coffman said that while he supported a House bill to limit late-term abortions, \"I strongly support the exceptions for rape, incest, and protecting the life of the mother that have been included in this legislation.\"", "Coffman's Democratic opponent, Morgan Carroll, had blunt criticism of his co-sponsoring the 2011 bill's original \"forcible rape\" language.", "\"Rape is about the lack of consent -- not the degree of force -- and this definition takes us backwards,\" Carroll told Denver7.", "\"I unequivocally support a woman's right to make her own decisions about her own body, including her health care,\" she said.", "Coffman's spokeswoman complained that political opponents have repeatedly raised the 2011 bill and \"will twist the facts any way they can in an attempt to mischaracterize and demonize Rep. Coffman.\"", "Our ruling", "Emily’s List said that Coffman \"co-sponsored a bill to redefine rape.\" The record shows Coffman did co-sponsor the bill to redefine a ban on federal funding for abortions to exempt \"forcible rape.\" Yet he later voted on the floor for an amended version that had removed the \"forcible\" modifier from the bill.", "Given the totality of his actions on the legislation, we're rating this claim Mostly True.", "Correction: This story has been corrected to note that Coffman did not serve on the committee that removed the word \"forcible\" from the bill.", "Govtrack.us, \"Text of the No Taxpayer Funding for Abortion Act,\" January 20, 2011", "House.gov, Final House Vote on No Taxpayer Funding for Abortion Act, May 4, 2011", "Washington Post, \"Legislative proposal puts abortion rights supporters on alert,\" February 1, 2011", "MotherJones, \"The House GOP's Plan to Redefine Rape,\" Jan. 28, 2011", "Denver Post, \"Candidate Joe Coors won't endorse Colorado abortion-ban initiative,\" August 9, 2012", "Denver Post, \"Democrats highlight Coffman’s support for measure that could have redefined rape,\" August 20, 2012", "Coffman statement, \"Representative Coffman's Statement on H.R. 1797,\" June 18, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]