["An ad goes after Sen. John McCain for being just like President George W. Bush, hitting McCain on\n\nIraq, oil companies and health care.\n\nIt also criticizes him on tax policy.", "\"A millionaire who's for tax cuts for millionaires. McSame as Bush,\" the ad states.", "It's true that Bush and McCain are both millionaires, with McCain being somewhat wealthier. Bush's net worth in 2006 was between $7.6-million and $20.1-million, based on his personal financial disclosures required by law and analyzed by the nonpartisan Center for Responsive Politics.", "McCain, meanwhile, is worth somewhere between $27.8-million and $45-million. (Sen. Hillary Clinton's net worth is between $10.4-million and $51-million, while Sen. Barack Obama's is between $456,012 and $1.1-million.) So McCain and Bush are both millionaires, and that part of the statement is correct.", "We couldn't find any proposals John McCain supports that offer new tax cuts for millionaires, so we suspect this is a reference to McCain's support of the Bush tax cuts.", "Bush's tax cuts lowered rates across the board for those who pay federal income taxes, so they benefited both millionaire and nonmillionaire taxpayers. But data compiled from the Congressional Budget Office indicate that millionaires saw the most sizable drops to their tax rates measured as a share of income. Those tax cuts will expire during the next presidential administration unless Congress acts to keep them in place.", "McCain actually opposed the Bush tax cuts before changing his mind and supporting them now. He said the reason for his change of heart is that rescinding the tax cuts would be the equivalent of a tax increase after they had been in effect for so long. (Both Obama and Clinton want to roll back the Bush tax cuts for higher incomes.)", "If you're trying to identify the candidate who supports the Bush tax cuts, McCain is your man. But we're concerned that the ad leaves the impression that McCain advocates new, additional tax cuts for millionaires rather than keeping the present situation in place. For that reason, we knock this claim down one peg on the Truth-O-Meter and find it Mostly True.", "Center for Responsive Politics,\n\nGeorge W. Bush personal financial disclosure\n\n, 2006", "Center for Responsive Politics,\n\nJohn McCain personal financial disclosure\n\n, 2006", "Congressional Budget Office,\n\nHistorical Effective Federal Tax Rates: 1979 to 2005\n\n, December 2007", "New York Times,\n\nTax Cuts Offer Most for Very Rich, Study Says\n\n, Jan. 8, 2007", "U.S. Senate,\n\nMcCain 2001 vote opposing tax cuts", "U.S. Senate,\n\nMcCain 2003 vote opposing tax cuts", "U.S. Senate,\n\nMcCain 2006 vote favoring tax cuts", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]