["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Tim Kaine tweeted out a geography quiz on a recent visit to Southwestern Virginia.", "\"When I stood at Pinnacle Overlook above the Cumberland Gap today, I was closer to 8 other state capitals than to Richmond,\" Kaine wrote on Aug. 20. \"Can you name them?\"", "The Pinnacle Overlook is part of the Cumberland Gap National Historic Park in the Southwest corner of Virginia. Sitting 2,440 feet high, it offers scenic views of three states: Virginia, Kentucky and Tennessee.", "Jon Baliles, the first district city councilman in Richmond, took up Kaine’s challenge and on Twitter rattled off a list of state capitals that are closer to the overlook than Richmond: Frankfort, Ky.; Nashville, Tenn.; Columbus, Ohio; Atlanta; Columbia, S.C.; Indianapolis; Raleigh, N.C.; and Charleston, W.V.", "Kaine sent a congratulatory tweet to Baliles.", "\"Well done! You got them all,\" Kaine wrote.", "We took the quiz, too, and got a different answer.", "There were actually nine state capitals that were closer to where Kaine was standing than Richmond. The senator and the councilman omitted Montgomery, Ala.", "We checked the driving distance between various state capitals and the Cumberland Gap National Historic Park, measuring by the most direct route recommended by Google Maps:", "Frankfort, Ky. -- 162 miles", "Nashville, Tenn. -- 226 miles", "Charleston, W.V. -- 228 miles", "Atlanta -- 272 miles", "Columbia, SC -- 289 miles", "Indianapolis -- 315 miles", "Columbus, Ohio -- 318 miles", "Raleigh, NC -- 342 miles", "Montgomery, Ala. -- 387 miles", "Richmond, Va. -- 417 miles", "We also used an \"as the crow flies\" straight line measurement between the Pinnacle Overlook and various state capitals, using daftlogic.com. Although the distances changed, the number of closer state capitals did not.", "Frankfort -- 129 miles", "Charleston -- 164 miles", "Nashville -- 176 miles", "Atlanta -- 202 miles", "Columbia  -- 234 miles", "Columbus -- 235 miles", "Indianapolis -- 257 miles", "Raleigh -- 287 miles", "Montgomery  -- 329 miles", "Richmond  -- 350 miles", "Our ruling", "Kaine says Pinnacle Overlook in far Southwestern Virginia is closer to eight state capitals than Richmond. Actually, it’s nine.", "So Kaine gets a \"B+\" on his own quiz. On PolitiFact’s grading scale, that translates to Mostly True.", "Sen. Tim Kaine’s tweet, Aug. 20, 2014.", "Google Maps, accessed Aug. 27, 2014.", "Daftlogic.com, Google Maps Distance Calculator, accessed Aug. 27, 2014.", "National Park Service, \"Skyland Road and the Pinnacle Overlook,\" accessed Aug. 27, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]