["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "David Alameel, the Democratic U.S. Senate nominee in Texas, told delegates to his party’s convention that he joined the military when his Republican foe, U.S. Sen. John Cornyn, was ducking the Vietnam War.", "Alameel, a wealthy investor, said in June 2014: \"My wife and I struggled. There were times when we couldn’t even afford to buy milk for our baby. … So I joined the military at a time in the early 1970s when John Cornyn decided to dodge his draft simply to go to college.\"", "A day earlier, according to a news blog post by Jonathan Tilove of the Austin American-Statesman, Alameel told the party’s veterans caucus: \"I served and Cornyn refused to serve. He sent a letter, `I can’t serve because I'm simply going to go to college.’\"", "Draft dodger – the term conjures up images of Americans unwilling to serve their country and sneaking off to Canada or faking injuries or pulling strings to avoid military service.", "Then again, according to a 1993 book on the draft by George Q. Flynn, more than 2 million college-going men put off being drafted in the era by seeking and receiving student deferments from the government that legally sheltered them as long as they stayed in school and kept up grades.", "Cornyn, who received his bachelor’s degree from San Antonio’s Trinity University in 1973, has said he was among them.", "Alameel declines to elaborate", "Drew Brandewie, a spokesman for Cornyn’s campaign, asked us to review Alameel’s claim.", "For starters, we asked Alameel, who served in the Army in 1974-77, how he reached his assessment. Sergio Cantu, an Alameel spokesman, said by email the campaign would discuss \"Cornyn’s draft dodging at the appropriate time.\"", "Earlier, Cornyn’s campaign said he had a student deferment in his Trinity years, according to a July 4, 2014, Statesman news story.", "How the draft worked", "PolitiFact New Jersey said in a 2013 fact-check the draft was in place for young men from August 1964 through December 1972. In the end, some 25 percent of the 6 million men who served during the Vietnam conflict were draftees, Flynn said in his book.", "Generally, men who received a draft notice in the mail had about three weeks to return paperwork requesting a hearing for a deferment, a Selective Service System spokesman advised. A local draft board decided whether to grant any requested waiver. \"For the Vietnam war and World War II, any time there was a draft, there were classifications of deferments,\" Pat Schuback of the Selective Service System said. \"If you were eligible for it, you were entitled to claim that deferment.\"", "Another factor emerged. Flynn wrote that President Richard Nixon, with congressional approval, launched an annual lottery in November 1969 that was pitched as randomizing which men were most likely to be called up through the draft.", "Cornyn’s draft status", "Cornyn has previously said he landed a low draft lottery number, 28, which meant he was likely to be called up, according to a Sept. 29, 2002, Associated Press news story. According to a Selective Service System web page, that number went to every man with Cornyn’s birth date, Feb. 2, 1952. After that August 1971 lottery, anyone with a lottery number of 95 or lower and who was classified as available for military service was called to report for possible induction, the page says.", "But Cornyn, on the verge of his junior year at Trinity, wasn’t classified as available for service.", "In 2002, he said he’d sought a student deferment. \"I thought college was important,\" Cornyn said, \"and I think certainly I would have been willing to go if we had continued to have a draft at the end of my college deferment.\"", "To our inquiries, Selective Service emailed us a form showing Cornyn, listing his occupation as a Trinity student, registered for the draft as he turned 18 in February 1970.", "We also fielded an undated Selective Service roster with handwritten entries for Cornyn and more than 25 other draft registrants showing how each man was annually classified by the government. The Cornyn entry on the roster states he initially fielded a 2-S (student) deferment on April 15, 1970 and that status was renewed in October 1970 and November 1971, or about three months after he drew his lottery number.", "According to the document, though, Cornyn was classified as 1-A, or available immediately for military service, on Nov. 17, 1972 before being classified as 2-S afresh on Jan. 18, 1973, a few months before he fielded his degree. Meantime, Nixon, who sought an all-volunteer Army, had announced in June 1972 that no more draftees would be sent to Vietnam, Flynn wrote in his book.", "Did Cornyn dodge draft?", "After the Democratic convention, Alameel told the Statesman he had a copy of Cornyn’s letter (which Alameel did not make public) saying he couldn’t serve because he was going to college. Alameel said the letter was the standard student deferment request. \"That’s the standard definition of dodging the draft — `I want a deferment, and I want to go to college’ — and then he never went back,\" Alameel said. \"He didn’t say, `Give me four years, and I’ll come back and serve.’", "\"I don’t know how else to define that,\" Alameel said.", "Alameel’s definition of a draft dodger isn’t generally embraced.", "Schuback previously told PolitiFact New Jersey a draft dodger isn’t someone who received a legitimate and legal deferment from military service. \"A draft dodger is someone who got drafted and has then fled, or it also might be a person who made a statement by not registering (for the draft),\" he said.", "We reached out to historian Michael S. Foley, author of a book on draft resistance during the Vietnam War. By email, Foley said that before the draft lottery began, seeking and receiving a student deferment was \"totally legal and millions of men did it. That’s not draft dodging, certainly not in the way that emigrating to Canada or faking a physical/mental ailment or getting an influential father to pull strings with the draft board would be considered draft dodging.\"", "On the other hand, Foley said, if \"you believe that every draft-age man should have made himself available for service during the Vietnam War, then that means 20+ million men were draft dodgers -- a pretty extreme view.\"", "Foley also viewed the documents we’d fielded touching on Cornyn’s Selective Service history. He then wondered, by email, how Cornyn could have still not been drafted despite getting a low lottery number.", "We asked Selective Service about that. By email, Schuback provided the agency’s summary of changes in regulations after Nixon signed a September 1971 act into law described in Flynn’s book as giving the president the discretion to phase out student deferments.", "According to the summary, men who had qualified for a student deferment in the regular 1970-71 school year would \"be able to obtain deferments\" going forward at least \"until they graduate.\" Cornyn (who got his lottery number after that school year) fit that description, according to the documents we received.", "The summary went on to say men not qualified for a student deferment in 1970-71 would not be qualified to get one going forward.", "Our ruling", "Alameel said Cornyn \"dodged\" the draft during the Vietnam War.", "This claim puts no stock in Cornyn registering for the draft and qualifying for student deferments, which many men eligible for service took. These men weren’t draft dodgers in the conventional sense of that term; none fled the country or the like. A government document even suggests Cornyn was briefly classified as available for immediate service.", "Alameel offered nothing but mention of Cornyn seeking a deferment as the basis of his claim which, all told, we find factually unsupported and ridiculous. Pants on Fire!", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Book, \"The Draft, 1940-1973,\" by George Q. Flynn, the University Press of Kansas, 1993", "Email, Sergio Cantu, deputy communications manager, David Alameel campaign, July 17, 2014", "Truth-O-Meter article, \"Liberal group claims Mitt Romney, Dick Cheney, Donald Trump, others are draft dodgers,\" PolitiFact New Jersey, March 24, 2013", "News story, \"Alameel lobs ‘draft dodger’ charge at Cornyn,\" Austin American-Statesman, posted online July 4, 2014", "Documents, John Cornyn’s draft registration card; Selective Service System roster showing annual draft classifications of men including Cornyn, undated; \"1971 Changes in Draft Policy,\" agency regulations related to act signed into law by President Richard Nixon in September 1971 (received by email from Jennifer Burke, public affairs specialist, Public and Intergovernmental Affairs, Selective Service System, July 21, 2014; Patrick Schuback, Public and Intergovernmental Affairs, Selective Service System, July 25, 2014)", "Web page, \"RESULTS FROM LOTTERY DRAWING - Vietnam Era  1972,\" Selective Service System (accessed July 21, 2014)", "News story, \"Kirk, Cornyn debate defense amid national wrangling over issue,\" the Associated Press, Sept. 29, 2002 (as posted online by the Abilene Reporter-News)", "Email, Jennifer Burke, public affairs specialist, Public and Intergovernmental Affairs, Selective Service System, July 21, 2014", "Emails (excerpted), Michael S. Foley, professor of American Political Culture and Political Theory, Department of American Studies, University of Groningen, The Netherlands, July 24-25, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]