["About this rating", "A meme frequently shared on social media presents a disturbing image of a woman described as having been subjected to the punishment of a severe flogging in Iran for having been caught with a can of beer in her hand (thus violating Islam's prohibition on the consumption of alcohol):", "Despite the widespread distribution of this meme, information about when and where the accompanying photograph was taken, and what it depicts, is scarce. Even the particular claim for the version seen here is inconsistent, as the woman pictured is variously described as either an Iranian woman or a tourist of some other nationality who was merely visiting Iran.", "In fact, this picture has been circulating online since at least 2010, and it has been used to illustrate a myriad of different reports with varying details.", "Generally the photograph is claimed to show a woman ordered flogged by authorities in a Muslim country for violating a law (religious or otherwise), and we've turned up examples identifying Iran, Saudi Arabia, Egypt, Sudan, and the Maldives as the location where the punishment took place.", "We've also found versions identifying the punished woman's infraction as engaging in a same-sex relationship, seeking gender equality, having a \"falling out\" with a member of a royal family, engaging in prostitution, refusing to wear proper dress (such as a hijab), insulting a government official, being raped, taking part in an extra-marital affair, and drinking or possessing alcohol.", "In addition to not knowing when or where the picture was taken, we don't know whether it shows someone suffering from the results of an illness (or other medical condition), an injury, an accident, an assault, or a form of punishment. And if the latter, we don't know what offense might have prompted the punishment.", "We do know, however, that this photograph was online for several years, presented in many different contexts, before it became attached to the claim that it depicted someone subjected to a flogging for the offense of being caught holding a can of beer.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]