["About this rating", "It's theoretically possible that one could catch sexually transmitted disease (STD) from an improperly cleaned tanning bed.", "It's highly unlikely that one would catch an STD in this manner.", "According to long-standing rumors, tanning beds can be dangerous — not just because the ultraviolet light can potentially deliver a nasty burn to your skin, but because they purportedly can be vectors for various viruses and bacteria. The possibility has spawned a plethora of stories that are long on scares but relatively short on facts:", "Genital herpes is highly contagious and spreads from one person to another via skin-to-skin contact.", "It is commonly passed on through sex and oral sex.", "Once a person is infected with the virus it can reactivate every so often to cause a new episode of painful genital herpes.", "There is no complete cure for the infection - rather, a sufferer will be given treatment each time they suffer a flare up.", "Dermatologist Dawn Marie Davies, an associate professor of dermatology at the Mayo Clinic in Minnesota, warns the virus, and other bacteria, can survive on tanning beds, despite the heat.", "'In my practice, I've seen acquired bacterial infections, warts, and herpes infections from tanning beds,' she told Yahoo.", "Despite the range of Dr. Davies's quote (she says it's \"possible\" to acquire infections from fecal bacteria as well as various viruses) many news outlets naturally seized on the disease with the most stigma.  However, as with so many stories, the truth is far less dire than the warnings.", "It is possible, in theory, to pick up sexually transmitted infections such as herpes from tanning beds, because the ultraviolet light doesn't necessarily kill viruses or bacteria (and many people slip into the beds nude without cleaning them first), and overexposure to UV rays can depress the immune system. However, such an infection would have to take place under a very specific set of circumstances, and you're much more likely to get staph or some other bacterial infection than herpes.", "\"As you can imagine, this issue varies greatly by type of infection and the conditions outside the body,\" Brian Katzowitz from the Centers for Disease Control and Prevention told us:", "Although studies have demonstrated that some STDs (eg, herpes virus) can survive on some surfaces or in water, or that some STDs (e.g, trichomonasis) can survive for up to 45 minutes on toilet seats, wash cloths, clothing and in bath water, transmission of such STDs is overwhelmingly by direct genital contact.", "However, even if you're not guaranteed a case of the clap with your tan, it's always best practice to wipe down the tanning bed before and after each use, or to not use tanning booths at all.  While the risk of contracting a sexually transmitted disease from a tanning salon or a sunlamp may be infinitesimal, the risk of burns, blisters, and skin cancer is not: melanoma risks increase dramatically with indoor tanning.", "Molecular Biology of the Cell.   \"Introduction to Pathogens.\" \r\n    National Center for Biotechnology Information   (4th edition, 2002).", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]