["About this rating", "Multiple news outlets have confirmed HHS's plans to build tent cities.", "They have not yet been constructed; the practice is not new.", "On 13 June 2018, the Facebook page \"The Other 98%\" shared the following meme:", "The Twitter handle @krassenstein appeared at the lower left corner of the meme, and Twitter user Brian Krassenstein shared the text as a tweet a day earlier. Neither \"The Other 98%\" (whose caption simply stated \"Unbelievable\") nor Krassenstein provided a citation for the meme's text, which read:", "BREAKING: President Trump is planning to construct tent cities in Texas to house unaccompanied immigrant children.", "That's right. We're now going to build \"camps\" in order to \"concentrate\" the kids into a small area, as Trump attacks & marginalizes them.", "Sound Familiar?", "Both the tweet and meme appeared to reference a 12 June 2018 article from McClatchy entitled, \"Trump looking to erect tent cities to house unaccompanied children.\" That piece quoted an unnamed source from the Department of Health and Human Services as saying officials were considering building a tent city on military land:", "The Trump administration is looking to build tent cities at military posts around Texas to shelter the increasing number of unaccompanied migrant children being held in detention.", "The Department of Health and Human Services will visit Fort Bliss, a sprawling Army base near El Paso in the coming weeks to look at a parcel of land where the administration is considering building a tent city to hold between 1,000 and 5,000 children, according to U.S. officials and other sources familiar with the plans.", "HHS officials confirmed that they’re looking at the Fort Bliss site along with Dyess Air Force Base in Abilene and Goodfellow AFB in San Angelo for potential use as temporary shelters.", "At the time of publication, the HHS official said the agency had yet to determine whether \"any of the three sites assessed are suitable.\" The Texas Observer reported that notions of \"locking up families in penal-like facilities, or even 'tent cities' for immigrants, including kids\" is \"both new and not new,\" resulting from the enforcement of far harsher detention policies:", "On one level, these tent cities, as they’ve been branded on social media, have a practical purpose. They are provisional solutions to an artificial overcrowding problem. Jeff Beauregard Sessions ... has decided to criminally prosecute anyone who crosses the border without authorization, including parents traveling with children. Since kids can’t (yet) go to prison with mom and dad, the federal government must — by its cruel logic — seize the children and turn them over to the temporary custody of the U.S. Department of Health and Human Services. But HHS facilities are at 95 percent capacity. There’s no more room at the inn for Sessions’ growing collection of traumatized youngsters. The attorney general, however, is not a man easily deterred by human rights, laws protecting asylum-seekers, or the “optics” of stacking kids like cordwood near the 1st Armored Division. Thus, the brain trust has landed on tents.", "Like many Trump border/immigration proposals, this is both new and not new. What’s new is the extreme cruelty of prosecuting parents, many of them asylum-seekers fleeing unbearable violence in their home countries, for the misdemeanor offense of illegal entry. The law has been on the books for a long time, but previous administrations have exercised discretion in a way that excluded families. What’s new is the zealousness with which the administration has treated children, some reportedly as young as 18 months, as collateral damage from its increasingly draconian immigration policies. Let’s be clear: Sessions et. al have chosen to split apart families in the name of tamping down lawlessness.", "On 14 June 2018, The New York Times profiled a shelter for immigrant children in Brownsville, Texas. Sen. Jeff Merkley (D-Oregon) visited that center on 3 June 2018, putting up a video that later went viral on social media. That article reported that HHS had announced that temporary tent cities would be constructed near Tornillo, Texas:", "The teeming, 250,000-square-foot facility is a model of border life in Trump-era America, part of a growing industry of detention centers and shelters as federal authorities scramble to comply with the president’s order to end “catch and release” of migrants illegally entering the country. Now that children are often being separated from their parents, this facility has had to obtain a waiver from the state to expand its capacity.", "Cots are being added to sleeping areas. The staff is expanding. But even that is not enough. Federal authorities are considering establishing tent cities on Army and Air Force bases, and have already transferred hundreds of immigrant detainees to temporary housing at federal prisons.", "On Thursday, the Department of Health and Human Services announced that temporary tent housing would be set up near the border station in Tornillo, Tex., to house up to 360 youths.", "NBC reiterated that the policy was not new:", "It will not be the first time the U.S. government has erected tent cities to house immigrants. U.S. Customs and Border Protection used tents to house an influx of immigrants in 2014 and at the end of the Obama administration.", "Multiple news organizations obtained HHS confirmation that tent cities were being constructed to accommodate a massive influx of child detainees, largely due to changes made to border policy in May and June 2018. Many noted that the primary difference in circumstance was that a change in how families were processed in detention led to an abrupt need for increased shelter capacity.", "Fernandez, Manny.   \"Inside The Former Walmart That Is Now A Shelter For Almost 1,500 Migrant Children.\"\r\n    New York Times.   14 June 2018.", "Giaritelli, Anna.   \"360-Person Tent City For Unaccompanied Minors Being Set Up In El Paso, Texas: HHS Official.\"\r\n    Washington Examiner.   14 June 2018.", "Ordonez, Franco.   \"Exclusive: Trump Looking To Erect Tent Cities To House Unaccompanied Children.\"\r\n    McClatchy DC.   12 June 2018.", "Soboroff, Jacob.   \"Administration Will House Migrant Kids In Tents In Tornillo, Texas.\"\r\n    NBC News.   14 June 2018.", "Texas Observer.   \"How We Got Here: The Disturbing Path That Leads To Child Prison Camps.\"\r\n    Accessed 15 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]