["“An update gives Biden 100% of new votes - 128k+,” claimed a November 4, 2020 tweet from a Texas Republican columnist with 36,000 followers. Below the text, two electoral maps of the US show that a vote count update appeared to grant the former Vice President 138,339 votes and not a single one to his rival President Donald Trump.", "The tweet was deleted with an apology, but the same maps were shared tens of thousands of times on Twitter, Instagram, Facebook and in an article that pointed to a discrepancy of 138,339 votes in Michigan. Most posts denounced the numbers as proof of fraud by Democrats in the Midwestern state.", "However, the maps actually show a 138,339 drop in Biden votes after a correction due to human error.", "Caroline Wilson, county clerk for the central Michigan county of Shiawassee, told AFP by phone, “I added an extra zero accidentally,” thereby reporting 153,710 votes for Biden instead of 15,371.", "“The minute it was discovered, it was corrected, probably within 20 minutes, so I’m amazed how fast this spread,” Wilson added.", "She said the state of Michigan alerted her office of the mistake “because we don’t even have that many voters.”", "The central Michigan county only has 55,612 registered voters.", "When Biden’s 153,710 votes were lowered to 15,371 votes in a correction, 138,339 votes were removed from the Democrat’s total tally without any changes to Trump’s numbers.", "“The information contained in the graphic is entirely false,” Michigan Department of State spokeswoman Tracy Wimmer told AFP in an email about the map on Twitter.", "The image in the tweet showed two screenshots of the interactive vote results map from election data analyst Decision Desk HQ (DDHQ).", "The two screenshots were taken at different times in the early hours of November 4.", "At 4:59 am, DDHQ reported results for Michigan that indicated 153,710 votes for Biden in Shiawassee county, prompting Twitter user @ENGOLD to point out a mistake.", "DDHQ acknowledged the mistake later on November 4, calling it a “clerical error” from the Shiawassee County data, and updated results on its website to reflect the changes, giving Trump a victory in the county with 23,154 votes.", "AFP Fact Check also found other claims of voter fraud that turned out to be genuine mistakes, such as residents receiving mail-in ballots for deceased parents or previous tenants.", "With an unprecedented number of mail-in ballots cast, the presidential race remains too close to call. President Trump accused Democrats of trying to “steal the election” on November 4.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]