["About this rating", "Most of the topics we cover at Snopes.com require us to track down sources, examine photographs, or dig through historical records in order to determine an item's veracity. But for some, all we have to do is click a link.", "In October 2018, a number of social media users expressed concern about rapper Kanye West after the musician donned a MAGA hat and delivered a rambling pro-Trump speech during his appearance on Saturday Night Live, called for the 13th Amendment (which outlawed slavery) to be abolished, and sat down for a surreal meeting with President Trump at the White House.", "Several celebrities issued statements condemning some of Kanye's actions, and when Ashlee Marie Preston posted a message on Twitter reporting that Kanye's wife Kim Kardashian was filing for divorce, many social media users bit on the tweet hook, line, and sinker:", "Welp...it’s official...Kim Kardashian finally decided to divorce Kanye West... https://t.co/C2p25mxWJO", "— Ashlee Marie Preston (@AshleeMPreston) October 12, 2018", "But the link in Preston's tweet did not direct readers to a news article reporting on Kim Kardashian's decision to divorce Kanye West. Rather, clicking on the link took readers to a voter registration page on the Vote.gov website.", "Preston's tweet was issued less than a month before the 2018 midterm elections, at the time when a number of organizations, politicians, and celebrities were urging young people to make sure that they were registered  to vote. Although Preston's tweet may have been  deceptive, its apparent purpose was to divert people's focus from arguably unimportant bits of celebrity gossip to their civic duties.", "On 18 October 2018, the official Twitter account for Elle magazine imitated Preston's bit of political misdirection:", "Kim Kardashian and Kanye West are splitting up ?? https://t.co/epwKG7aSBg pic.twitter.com/u7qqojWVlR", "— ELLE Magazine (US) (@ELLEmagazine) October 18, 2018", "Again, the link embedded in Elle's tweet did not lead to news about Kardashian and West divorcing, but to a \"Register to Vote\" page on the When We All Vote website.", "In addition to diverting some of the public into thinking about voting, these tweets also highlighted a potentially deleterious habit shared by many social media users: a 2016 study conducted by computer scientists at Columbia University and the French National Institute found that nearly 60% of people on social media shared links without first clicking them.  More information about that study can be viewed here.", "Willis, Kim.    \"Celebs React to Kanye West's Post-'SNL,' Pro-Trump, Anti-13th Amendment rant.\"\r\n    USA Today.   1 October 2018.", "Lockhart, P.R.      \"The Controversy Over Kanye West’s 13th Amendment Tweets, Explained.\"\r\n    Vox.   1 October 2018.", "NPR.   \"'Quite Something': Kanye West Makes a Statement in the Oval Office.\"\r\n    11 October 2018.", "Baumgartner, Scott.   \"Chris Evans Slams Kanye West for His MAGA Tweet and People Are Loving It.\"\r\n    Yahoo News.   30 September 2018.", "Dewey, Caitlin.   \"6 in 10 of You Will Share This Link Without Reading It, A New, Depressing Study Says.\"\r\n    The Washington Post.   16 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]