["A video of a man dressed in monk’s dress getting beaten up by a mob inside a train carriage is being shared by social media users. One Renee Lynn tweeted the video with the narrative that a Hindu monk was beaten by members of the Christian community for boarding a train carriage which was “predominantly Christians”. Her tweet has garnered more than 9,000 retweets so far.", "This is Horrible! On this train an old Hindu Saint is being beaten by Christians because he got into a compartment which was predominantly Christians & they did not want this Hindu man to sit with them. If I was on that train I swear I would have went berserk on those Christians! pic.twitter.com/5gLywPSg0w", "— Renee Lynn (@Voice_For_India) March 15, 2020", "[READ: Renee Lynn shares old video from Rajasthan as Hindu woman assaulted by Muslims in Pakistan.]", "Another Twitter user Akash RSS posted the video with the claim, “On Train to Nagercoil, Xtians Kick and Beat Hindu Swamiji Since he Dared to Sit with Them!” Akash RSS is ‘Akash Soni’. In 2017, Alt News had investigated and found that he was the man behind a popular fake news website Coverage Times. Another report published in June 2018 revealed that he was one of the individuals running misinformation and propaganda Facebook page ‘BJP All India’.", "On Train to Nagercoil, Xtians Kick and Beat Hindu Swamiji Since he Dared to Sit with Them! pic.twitter.com/h54SyNORpz", "— Akash RSS (@Satynistha) March 14, 2020", "Several other users on Twitter posted the video with a similar narrative. Tweets by @Uslasher and @RajeAiyer have garnered close to 2,500 retweets so far.", "Twitter user Fatima Rasool posted the video with a message in Hindi that reads, “बेरहमी की हद है! एक हिंदू संत गलती से उस डब्बे में बैठ गया जिसमें सिर्फ इसाई बैठे हुए थे। फिर क्या जो हुआ वह आपके सामने है।”", "बेरहमी की हद है! एक हिंदू संत गलती से उस डब्बे में बैठ गया जिसमें सिर्फ इसाई बैठे हुए थे। फिर क्या जो हुआ वह आपके सामने है। pic.twitter.com/rddzpINRVE", "— Fatima Rasool دوست (@FatimaRasoolS) March 15, 2020", "With a keyword search on Twitter, Alt News found the same video tweeted on March 11 with a Tamil text. According to the text, this Hindu monk had misbehaved with a child and was later beaten by the public. The incident took place on a Nagercoil-Coimbatore train. A child was sleeping on the floor and the monk allegedly tried to misbehave. The sadhu was manhandled by the passengers and asked to leave (the train) at Tamil Nadu’s Dindugal station.", "சிறுமியிடம் சில்மிஷம் செய்த சாமியாரை பொதுமக்கள் வெளுக்கும் காட்சி. //நாகர்கோவில் – கோயம்பத்தூர் விரைவு இரயிலில் தரையில் தூங்கிக் கொண்டிருந்த சிறுமியிடம் சாமியார் சில்மிஷத்தில் ஈடுபட்டான், இதை கவனித்த சக பயணிகள் அவனை சரமாரியாகஅடித்து திண்டுக்கல் இரயில் நிலையத்தில் இறக்கி விட்டனர் pic.twitter.com/67Y4bnnmaD", "— சாணக்கியன் (@thechanakkiyan) March 11, 2020", "At 4:24 AM on March 11, Shekinah Santhosh posted the video on Facebook. We found that Santhosh was one of the firsts to post this video on social media.", "In a conversation with Alt News, Santhosh, who was travelling on the same train, informed, “I was sleeping on an upper berth. I got up when heard noises of the crowd involved in a fight with two guys in the compartment. They were beating the two men for misbehaving with a 10-12-year-old girl. The angry passengers forced them to get down from the carriage at Dindigul station. But there was one more monk who was sitting with these two guys. He (monk) was also misbehaving with the girl. I only started shooting the video when I saw this Hindu monk (the third-man) getting beaten up by the crowd. He was subsequently forced to deboard from the carriage. The crowd also wanted him to be handed over to the police but later didn’t.”", "He further informed that the man in the orange shirt who was beating the monk was a relative of the girl. You can see the original video shot by Santhosh here.", "A frame of the video shows that it was shot from a higher angle. This corroborates that Santhosh was sitting on the upper berth while he shot the video.", "Posted below is a screenshot of the timestamp data from Santhosh’s phone gallery which shows that the video was shot on March 11 at 3:17 am.", "This timing also aligns with the expected arrival time of the Nagercoil-Coimbatore Super Fast Express on the Dindigul Junction. The video was shot at 3:17 am whereas, the time of expected arrival of the train was at around 3:00 AM.", "That the sadhu was beaten by the public for misbehaving with a child can also be corroborated with the conversation heard in the video. Posted below is the transcription in English.", "Sadhu: I have put mala. Leave me Crowd: Yeah putting mala is what is important! Doing this and wearing a mala (punches) Sadhu: Don’t pull the mala. Crowd: Pull him inside. Pull him in Crowd: What if you are wearing mala? If you wear mala then you will misbehave? Crowd: First I will thrash you Sadhu: Wait. Ask him to leave me Crowd: @#_#@ abuses Sadhu: Police (RPF) Crowd: Call them, call them Crowd: If it were your kid, will you do it?", "If one listens to the conversation, both the parties – the crowd and the sadhu – are calling for the police. Moreover, in one of the frames, the man in the light orange shirt (who is throwing punches at the monk) can be seen wearing a Kada and a thread. A ‘Kada’ is a metal bracelet often worn by Hindus, and Sikhs. There is no evidence to suggest that a Christian mob thrashed the Sadhu.", "Alt News contacted Madurai DRM and Dindigul Railway police regarding this matter. Both were unaware of this incident.", "Here’s what we know so far", "Alt News could independently verify that the video was shot at Tamil Nadu’s Dindigul station. We spoke to the passenger who shot the video and confirmed to us that the crowd was beating the monk over allegations of misbehaviour with a child. Moreover, the conversation in the video certainly doesn’t give the sense that the passengers didn’t want the sadhu in their coach due to his religious identity. The incident was thus given a communal colour with a false message claiming that a ‘Christian crowd’ beat up a Hindu monk.", "[Update: The article referred to timestamp data as EXIF data which has been rectified.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]