["About this rating", "On 7 November 2017, the Sacramento Bee reported on a draft of legislation circulated to California legislators by the California Chapter of the NAACP aimed at replacing \"The Star-Spangled Banner\" as the United States’ national anthem:", "When California lawmakers return to the Capitol in January, the state chapter of the NAACP will be seeking their support for a campaign to remove “The Star-Spangled Banner” as the national anthem.", "The organization last week began circulating among legislative offices two resolutions that passed at its state conference in October: one urging Congress to rescind “one of the most racist, pro-slavery, anti-black songs in the American lexicon” [...].", "As we have written about in detail, the view that \"The Star-Spangled Banner\" is racist stems from the third stanza of the original Francis Scott Key poem (\"The Defence of Fort McHenry\") from which the lyrics to the song come. This section has been interpreted by some historians as glorifying the death of runaway American slaves fighting on the side of the British during the War of 1812:", "And where is that band who so vauntingly swore,\nThat the havoc of war and the battle’s confusion\nA home and a Country should leave us no more?\nTheir blood has wash’d out their foul footstep’s pollution.\nNo refuge could save the hireling and slave\n From the terror of flight or the gloom of the grave,\nAnd the star-spangled banner in triumph doth wave\nO’er the land of the free and the home of the brave.", "Jason Johnson, a professor of political science at Morgan State’s School of Global Journalism and Communication wrote in The Root:", "The story, as most of us are told, is that Francis Scott Key was a prisoner on a British ship during the War of 1812 and wrote this poem while watching the American troops battle back the invading British in Baltimore. That [...] is less than half the story.", "To understand the full “Star-Spangled Banner” story, you have to understand the author. Key was an aristocrat and city prosecutor in Washington, D.C. He was, like most enlightened men at the time, not against slavery; he just thought that since blacks were mentally inferior, masters should treat them with more Christian kindness. He supported sending free blacks (not slaves) back to Africa and, with a few exceptions, was about as pro-slavery, anti-black and anti-abolitionist as you could get at the time.", "Of particular note was Key’s opposition to the idea of the Colonial Marines. The Marines were a battalion of runaway slaves who joined with the British Royal Army in exchange for their freedom. The Marines were not only a terrifying example of what slaves would do if given the chance, but also a repudiation of the white superiority that men like Key were so invested in.", "As reported in a piece for Public Radio International’s \"The World\", Johnson is not alone in this view, though other interpretations have been proffered:", "Many historians agree with Johnson, but some disagree. They point out that Key never told anyone what he actually meant, and some historians interpret his mention of hirelings and slaves to reference all of the invading British forces.", "They say it echoes similar rhetoric used since the Revolutionary War to describe the forces of the king of England, especially those units purchased from German princes. American writers contrasted these miserable hirelings and slaves with the virtuous all-volunteer citizen armies of America.", "In an interview with a Sacramento CBS affiliate, Alice Huffman, the president of the California NAACP, said:", "This song is wrong. It should never have been there, and just like we didn't have it until 1931, it won't kill us if it goes away.", "At the moment, the bill lacks a legislative sponsor in the California legislature. We have reached out to the California NAACP and Huffman for additional comment.", "Koseff, Alexei.   \"Remove ‘The Star-spangled Banner’ as National Anthem, California NAACP Urges.\"\r\n    The Sacramento Bee.   7 November 2017.", "The Library of Congress.   \"Defence of Fort M'Henry.\"\r\n    Accessed 8 November 2017.", "Johnson, Jason.   \"Star-Spangled Bigotry: The Hidden Racist History of the National Anthem.\"\r\n    The Root.   4 July 2016.", "Woolf, Christopher.   \"Historians Disagree on Whether 'The Star-Spangled Banner' Is Racist\"\r\n    PRI.   30 August 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]