["About this rating", "This fake report came and went more quickly than an Amazon Prime order.", "The 4 November 2017 post pushing the claim that the tech corporation had chosen to build a second headquarters (or \"HQ2\") in San Diego, California was initially published on chicagotimesnews.com, but by the time it came to our attention, it had been taken down.", "A cached version of the site shows little more than a headline and one line from the story:", "A Google search also shows the fake headline topping searches for \"Amazon chooses San Diego,\" with no advisory for readers:", "Not surprisingly, a search for \"Amazon San Diego\" on Twitter reveals that several users blindly shared the big news, only to later realize it was bogus.", "It is true that the company received 238 bids from prospective host sites for its planned new campus. Amazon has said that it would create up to 50,000 jobs for HQ2.", "But while Amazon signed a lease for a new office in San Diego in September 2017, the final decision on where HQ2 will be located has not been announced. The San Diego Regional Economic Development Corporation confirmed to us on 6 November 2017 that it submitted a bid on behalf of the region for the facility.", "Dastin, Jeffrey. \"Amazon Receives 238 Proposals For Its Second Headquarters.\"\r\nReuters. 23 October 2017.", "Radin, Danielle. \"Amazon Signs Lease For New Office in University City.\"\r\nKNSD-TV. 16 September 2017.", "Freeman, Mike. \"San Diego's Bid For Amazon HQ2: Can It Win?\"\r\nSan Diego Union-Tribune. 16 October 2017.", "Updated [6 November 2017]: Added confirmation from the San Diego Regional Economic Development Corporation that the city bid for the second Amazon headquarters.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]