["About this rating", "In September 2017, following the arrival of Hurricane Irma in the Caribbean and Florida, several reports emerged featuring remarkable photographs and videos that appeared to show beaches in the Bahamas and Florida devoid of water.", "The Huffington Post wrote:", "Hurricane Irma is so powerful that it has temporarily sucked the ocean away from beaches in Florida and the Bahamas in recent days.", "Twitter user @Piznack, one of multiple people to share videos of the strange scene, tweeted on Saturday: “Y’all my family in the Bahamas said Irma sucked up all the water. There’s literally no water. The beach and ocean are gone.”", "Long Island, Bahamas: Where's the ocean? pic.twitter.com/YCmWzUVBKI\n— piz (@Piznack) September 9, 2017", "Long Island, Bahamas: Where's the ocean? pic.twitter.com/YCmWzUVBKI", "— piz (@Piznack) September 9, 2017", "The Atlantic wrote:", "We got an extraordinary look at the physical reality of storm surge this weekend as Hurricane Irma seethed across the Straits of Florida. Storm surge doesn’t just mean there’s an excess of water in one place; it also mean there’s water missing from somewhere else. All that water didn’t come from nowhere, after all.", "The Atlantic included the same video as the Huffington Post, but attributed it to Twitter user @Kaydi_K, even though it was posted two hours earlier by @Piznack. It's not clear who owns this particular video. \n\n\nI am in disbelief right now... This is Long Island, Bahamas and the ocean water is missing!!! That's as far as they see #HurricaneIrma wtf pic.twitter.com/AhPAonjO6s\n— #ForeverFlourish (@Kaydi_K) September 9, 2017\n\nThe strange phenomenon was also captured on video by a city official in Clearwater, Florida:\n\n\nCreepy site - water in Tampa Bay is already being sucked out. This is view from downtown St. Pete waterfront. #HurricaneIrma pic.twitter.com/4hqRDSrDsh\n— Jason Beisel (@JasonBeisel) September 10, 2017", "I am in disbelief right now... This is Long Island, Bahamas and the ocean water is missing!!! That's as far as they see #HurricaneIrma wtf pic.twitter.com/AhPAonjO6s", "— #ForeverFlourish (@Kaydi_K) September 9, 2017", "Creepy site - water in Tampa Bay is already being sucked out. This is view from downtown St. Pete waterfront. #HurricaneIrma pic.twitter.com/4hqRDSrDsh", "— Jason Beisel (@JasonBeisel) September 10, 2017", "These videos appear to show a real meteorological phenomenon called \"negative surge.\"", "Jamie Rhome, a storm surge specialist at the National Hurricane Center, confirmed to us that Hurricane Irma had caused negative surge. Rhome told us that the phenomenon occurs when \"Winds ahead of the storm blow the water off the coast.\"", "It's the same force that blows the water towards land [positive surge], except it's blowing the water away from land.", "Receding tides could play a role in this phenomenon, but according to Rhome, hurricane-strength winds are the key force at play.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]