["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Robert De Niro has called President Donald Trump a \"fool,\" a \"bozo\" and an \"idiot,\" among other digs. Did this motion picture icon take it one step further and also call the commander in chief a village idiot?", "\"I preferred the time in America when the president and the village idiot were two different people,\" reads the text below a photo of Robert De Niro speaking. It was posted on June 23 on the Occupy Democrats Facebook page, where commenters cheered the actor on.", "\"Thank you Robert!\" one account said. \"I wish I could have said it better.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "After searching for the quote as it appears in the post online we only found one result: a February post on another Facebook page that doesn’t attribute the statement to De Niro.", "The image in the post comes from a 2016 video released by Anonymous Content as part of a \"Get Out the Vote\" campaign featuring celebrities. But De Niro doesn’t make the statement in the Facebook post in that video.", "He also didn’t say it at last year’s Tony Awards in June 2018, when he walked on stage and declared, \"f--- Trump.\"", "Searching the Nexis news database for \"Robert De Niro\" and \"village idiot\" and \"Donald Trump\" we found no results. Searching for the same words online, we found instances of the insult slung at both De Niro and Trump, but not De Niro calling Trump a \"village idiot.\"", "If evidence surfaces proving the actor made this statement, we’ll reconsider our ruling. For now, we rate this Facebook post False.", "Facebook post, June 23, 2019", "Facebook post, Feb. 12, 2019", "The New Yorker, \"Robert De Niro is always doing something,\" Dec. 30, 2018", "CBS News, \"Robert De Niro on Trump: ‘I’d like to punch him in the face,’\" Oct. 8, 2016", "Guardian News, \"Robert De Niro’s ‘F--- Trump’ at Tony awards,\" June 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]