["The 30-second video was published here on Facebook on December 17, 2020.", "It was shared more than 200 times in a Facebook group with more than 19,000 members.", "The post's Chinese-language caption translates to English as: “Inner Mongolian monster”.", "Inner Mongolia is an autonomous region situated in northern China.", "The video was also shared on Facebook such as here, here and here, all alongside a similar claim.", "The claim is false.", "A keyword search found this same video published on the official Instagram account for Mojosemi Forest Park, an Indonesian outdoor adventure park.", "A post shared by Mojosemi Forest Park (@mojosemiforestpark)", "Below are two screenshot comparisons of the video in the misleading Facebook posts (L) and the Instagram video uploaded by the park (R):", "The Instagram video's Indonesian-language caption translates to English as: “Finally Mojosemi Park has a new collection..”", "Honggo Utomo, representative for Mojosemi Forest Park, told AFP the video shows a triceratops puppet.", "“The video is part of our marketing strategy or our promotion ahead of Christmas and New Year holidays. We present the triceratops to entertain Indonesians during the holidays,” he told AFP by WhatsApp message on December 18, 2020", "“Inside the costume, there are two people controlling the movement, but it is also supported with a mechanical electronic system to move other body parts such as mouth, eyes, tail even stomach to make it look like it can breathe.”", "The same video was also debunked by fact-checking organization MyGoPen here and Snopes here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]