["About this rating", "U.S. President Donald Trump's immigration policies came under renewed scrutiny in March 2019, when photographs emerged that appeared to show relatively large numbers of undocumented immigrants being housed behind wire fencing under a bridge in El Paso, Texas.", "On 27 March, the website Grit Post published an article with the headline \"Trump Administration Cages Immigrants Under Bridge Because Detention Center Is Full,\" which went on to report that:", "Several photos that have emerged show what appear to be hundreds of immigrant families caged under the Paso Del Norte Bridge in El Paso, Texas.", "The photos were initially tweeted by Washington Post immigration reporters Nick Miroff and Bob Moore, who said the immigrants are being held there because the border patrol station in El Paso — just beyond Ciudad Juarez in Mexico — is full.", "That report prompted multiple inquiries from Snopes readers about the authenticity of the photographs in question and the facts surrounding them.", "On 27 March, Miroff and Moore did indeed post photographs showing the scene under the bridge. Miroff gave the following description of one of the photographs: \"This is El Paso right now, where hundreds of migrant families are being held in the parking lot of a Border Patrol station because there is no room for them inside, or anywhere else.\"", "This is El Paso right now, where hundreds of migrant families are being held in the parking lot of a Border Patrol station because there is no room for them inside, or anywhere else. pic.twitter.com/lFGZ9zRcZk", "— Nick Miroff (@NickMiroff) March 27, 2019", "For his part, Moore tweeted: \"Hundreds of migrants are being held under the Paso Del Norte Bridge in El Paso, near the site of [Customs and Border Protection agency] Commissioner [Kevin] McAleenan’s press conference.\"", "Hundreds of migrants are being held under the Paso Del Norte Bridge in El Paso, near the site of @CBP Commissioner McAleenan’s press conference. pic.twitter.com/FeHWauFD53", "— Bob Moore (@BobMooreNews) March 27, 2019", "Setting aside the somewhat colored language used by Grit Post, which stated that the Trump administration had \"caged\" the immigrants, we find the substantive claim — that crowds of undocumented immigrants had been detained under a bridge in El Paso in March 2019 due to a backlog at the nearest official immigration center — was true.", "On 27 March, U.S. Border Patrol spokesperson Ramiro Cordero largely confirmed the facts as presented by the Post's Nick Miroff and Bob Moore, as well as in the Grit Post article, in an interview with the Texas Tribune. But Cordero indicated that the typical time spent by immigrants at the improvised facility was relatively short.", "The following are excerpts from the edited interview with Cordero that the Texas Tribune published on 27 March:", "Cordero: When illegal immigrants are apprehended, they are [usually] taken to the [processing center]. As people are being processed inside the facility and sent out to Immigration and Customs Enforcement or wherever else they go, then more people are being brought in [from the camp] It’s just a transitional facility. Weeks ago, the community had issues that the [undocumented immigrants] were camping out outside on the levee road [south of the border fence]. They said we were leaving them there overnight. So we built the tent to keep people from the elements.", "Texas Tribune [TT]: How long are the people there?", "Cordero: It could be a couple of hours, it could be 12 hours. During that time, they get blankets, food, bathroom facilities, water, snacks -- they have it all there ...", "TT: There were some tweets and reports that said some people under the bridge said they have been there for two or three days. Is that possible because you said 12 hours or longer? What’s the maximum?", "Cordero: So for example, let’s say you get picked up at 6 p.m. and you end up at the river’s edge waiting to be transported for a few hours. Then you end up at that [camp] the next morning maybe at 9 a.m. Then you don’t get processed because there is a bottleneck until the following day. Did you stay there overnight? Yes, you sure did. So a lot is just perspective. The sun went down, it came back up. So for them that’s two days.", "TT: You said that as of 6 a.m. Wednesday that about 3,500 people were in Border Patrol custody in the El Paso Sector. Has that figure remained steady?", "Cordero:  This morning in custody, we had 3,369. The vast majority were at the El Paso station.", "On 28 March, the Associated Press published the following footage of the makeshift facility under the bridge:", "At a press conference held close to the Paso Del Norte bridge on 27 March, Border Commissioner McAleenan said the U.S. immigration system's \"breaking point has arrived,\" adding that the agency was facing \"an unprecedented humanitarian and border security crisis\" along the southwestern border, especially at El Paso.", "﻿", "Cahill, Tom.   \"Trump Administration Cages Immigrants Under Bridge Because Detention Center Is Full.\"\r\n    Grit Post.   27 March 2019.", "Aguilar, Julián.   \"What We Know About Undocumented Migrants Being Housed Underneath a Bridge in El Paso.\"\r\n    The Texas Tribune.   28 March 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]