["About this rating", "In September 2018, Nike's announcement of an endorsement deal with free agent quarterback Colin Kaepernick prompted a wave of controversy and debate. Kaepernick had become a central figure in ongoing National Football league protests again racial injustice after he first \"took a knee\" during the playing of the national anthem before games in the 2016 season.", "The deal was met with calls for a boycott of Nike products as well as criticism of the tenor and theme of the advertising campaign that accompanied it. One promotional image shows a close-up of Kaepernick's face with the message \"Believe in something. Even if it means sacrificing everything\":", "Believe in something, even if it means sacrificing everything. #JustDoIt pic.twitter.com/SRWkMIDdaO", "— Colin Kaepernick (@Kaepernick7) September 3, 2018", "This could be interpreted as an allusion to Kaepernick's own football career. Since 2017, when Kaepernick opted out of the final year of his contract with the San Francisco 49ers, no NFL team has signed him for two consecutive seasons, despite his reputation as a talented quarterback.", "Kaepernick is suing NFL owners for allegedly colluding and conspiring not to hire him after he rose to prominence for leading the national anthem protests.", "In the days after Nike's announcement, several mostly conservative websites reported that Taya Kyle, wife of U.S. Navy SEAL Chris Kyle, whose life was depicted in the film American Sniper, had spoken out against the slogan of Nike's new ad campaign. The Daily Caller, for example, reported:", "Kyle took to Facebook to level a brutal critique of Nike and their decision to promote a player who has regularly disrespected the American flag. “Sacrificing what exactly? A career?” Kyle asks in her viral post, “At best, that is all Colin sacrificed … some money, and it’s debatable if he really lost his career over it.”", "“How about other warriors? Warriors who will not be on magazine covers, who will not get lucrative contracts and millions of followers from their actions and who have truly sacrificed everything,” Kyle asked. “They did it because they believed in something. Take it from me, when I say they sacrificed everything, they also sacrificed the lives of their loved ones who will never be the same. THAT is sacrificing everything for something they believe in.”", "Similar articles appeared on PatrioticExpress.com, UpdateAmerica.com and FaithWire.com, prompting inquiries from readers about the authenticity of Kyle's remarks.", "Taya Kyle did indeed post a scathing criticism of the slogan in Nike's campaign with Kaepernick, saying it was \"insulting to those who really have sacrificed everything.\" (Eddie Ray Routh, a veteran with a history of mental health problems, shot dead Kyle's husband Chris, along with another man, while on a gun range near Dallas in February 2013.)", "On 4 September, Taya Kyle wrote on Facebook:", "Nike, I love your gear, but you exhaust my spirit on this one. Your new ad with Colin Kapernick, I get the message, but that sacrificing everything thing…. It just doesn’t play out here. Sacrificing what exactly? A career? I’ve done that both times I chose to stay home and be with my kids instead of continuing my business climb… and it wasn’t sacrificing everything. It was sacrificing one career and some money and it was because of what I believe in and more importantly, who I believe in.", "At best, that is all Colin sacrificed ... some money and it’s debatable if he really lost his career over it. Maybe he sacrificed the respect of some people while he gained the respect of others. Or maybe he used one career to springboard himself into a different career when the first was waning. I don’t know. What I do know is, he gained popularity and magazine covers he likely wouldn’t have gotten without getting on his knees or as you say, “believing in something.” I’m also thinking the irony is that while I am not privy to the numbers, it’s likely he gained a lucrative Nike contract. So yeah… that whole “sacrificing everything” is insulting to those who really have sacrificed everything.", "You want to talk about someone in the NFL sacrificing everything? Pat Tillman. NFL STARTING, not benched, player who left to join the Army and died for it. THAT is sacrificing everything for something you believe in.", "How about other warriors? Warriors who will not be on magazine covers, who will not get lucrative contracts and millions of followers from their actions and who have truly sacrificed everything. They did it because they believed in something. Take it from me, when I say they sacrificed everything, they also sacrificed the lives of their loved ones who will never be the same. THAT is sacrificing everything for something they believe in.", "Did you get us talking? Yeah, you did. But, your brand recognition was strong enough. Did you teach the next generation of consumers about true grit? Not that I can see.", "Taking a stand, or rather a knee, against the flag which has covered the caskets of so many who actually did sacrifice everything for something they believe in, that we all believe in? Well, the irony of your ad..it almost leaves me speechless. Were you trying to be insulting?", "Maybe you are banking on the fact we won’t take the time to see your lack of judgement in using words that just don’t fit. Maybe you are also banking on us not seeing Nike as kneeling before the flag. Or maybe you want us to see you exactly that way. I don’t know. All I know is, I was actually in the market for some new kicks and at least for now, I’ve never been more grateful for Under Armour.", "Taya Kyle has also criticized the national anthem protests, characterizing them as divisive and angry.", "Maaddi, Rob.   \"Colin Kaepernick's Nike Deal Prompts Flurry of Debate.\"\r\n    Associated Press.   5 September 2018.", "Wagoner, Nick.   \"Colin Kaepernick to Opt Out, Become Free Agent.\"\r\n    ESPN.   1 March 2017.", "ESPN.   \"QB Colin Kaepernick Files Grievance for Collusion Against NFL Owners.\"\r\n    16 October 2017.", "Kaepernick, Colin.   \"Kaepernick vs National Football League et al. -- Demand for Arbitration.\"\r\n    15 October 2017.", "Johnson, Benny.   \"Taya Kyle Has a Brutal Message for Colin Kaepernick on What Real 'Sacrifice' Means.\"\r\n    The Daily Caller.   4 September 2018.", "Fernandez, Manny and KAthryn Jones.   \"'American Sniper' Jury Finds Chris Kyle's Killer Guilty of Murder.\"\r\n    The New York Times.   24 February 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]