["The clip was altered and was produced for a “Jimmy Kimmel Live” segment. The original video shows Trump speaking about the impeachment inquiry in 2019.", "A viral video circulating online appears to show movers carrying President Donald Trump’s belongings out of the White House as he speaks about the 2020 presidential election results.", "Text on the video in one Instagram post reads: \"Movers carry out Trump belongings from the White House as he still complains about the election.\"", "But the video of Trump speaking is from 2019, and it was altered to add in laughter and the movers throwing boxes inside a truck in the background. It’s a satirical clip produced by the late-night talk show \"Jimmy Kimmel Live.\"", "Some users seemed to realize the clip is a joke, while others did not.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The altered video, which the show posted on its social media accounts on Nov. 14, has an ABC watermark in the bottom right corner, which was cropped out of some versions that were shared in other posts.", "\"What’s going on now is the single greatest scam in the history of American politics,\" Trump says in the clip. \"The Democrats want to take away your guns, they want to take away your health care, they want to take away your freedom, they want to take away your judges.\"", "Trump made those remarks at the White House, but not about the 2020 election. The footage is from Sept. 28, 2019, shortly after House Speaker Nancy Pelosi announced that the House would begin its impeachment inquiry into Trump.", "The video was altered for comic effect. We rate it False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Instagram post, Nov. 14, 2020", "Facebook, Jimmy Kimmel Live post, Nov. 14, 2020", "Twitter, President Trump video, Sept. 28, 2019", "USA Today, Fact check: Viral 'Jimmy Kimmel Live' video showing movers at the White House is satire, Nov. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]