["A video of a mob beating up a man adorning white clothes is being circulated widely on social media platforms. Several users have claimed that the person being thrashed is Health Minister Dr Harsh Vardhan. The clip is viral with the message, “The people have had enough. This group is now beating BJP MP Harsh Vardhan with their shoes. (ਲਓ ਭਰਾਵੋ ਕੰਮ ਚਲ ਪਿਆ ਜੁੱਤੀਆਂ ਦਾ BJP ਸੰਸਦ ਹਰਸ਼ਵਰਧਨ ਦੀ ਸੇਵਾ ਕਰਤੀ ਜ਼ਿਮੀਂਦਾਰਾ ਨੇਂ.)” A Facebook user had posted the video with this Punjabi message. It had garnered over 1.34 lakh views at the time of writing. (archived link to the post)", "ਲਓ ਭਰਾਵੋ ਕੰਮ ਚਲ ਪਿਆ ਜੁੱਤੀਆਂ ਦਾ b j p ਸੰਸਦ ਹਰਸ਼ਵਰਧਨ ਦੀ ਸੇਵਾ ਕਰਨੀ ਜ਼ਿਮੀਂਦਾਰਾ ਨੇਂ", "Posted by Harjit Nagra on Monday, 28 September 2020", "Another Facebook user posted the clip with the same message. His post drew over 7,300 views at the time of writing. (archived version of the post)", "ਲਓ ਜੀ ਭਰਾਵੋ ਕਿਸਾਨਾਂ ਖਿਲਾਫ ਕਨੂੰਨ ਬਣਾਕੇ BJP ਦੇ ਮੰਤਰੀ ਜੁੱਤੀਆਂ ਖਾਣ ਲੱਗ ਪਏ। BJP ਦੇ ਸੰਸਦ ਮੈਂਬਰ ਹਰਸ਼ਵਰਧਨ ਕਿਸਾਨਾਂ ਕੋਲੋਂ ਮਾਣ ਸੰਮਾਨ ਲੈਂਦੇ ਹੋਏ।", "Posted by Bagicha Singh Waraich 08872419720 on Monday, 28 September 2020", "It has also been widely shared on Facebook since the last few days.", "Fact-check", "This video was debunked by Alt News in July 2020 when it was doing the rounds as an attack on a Bharatiya Janata Party (BJP) leader in Bihar. But the visuals show an attack on BJP MP Babul Supriyo’s convoy in October 2016 in West Bengal. ABP News had stated in a video report dated October 19, 2016, that the Supriyo’s convoy had been attacked by Trinamool Congress (TMC) supporters in Asansol.", "In a piece dated October 20, 2016, Patrika reported that BJP supporters in the state had beaten several butchers, accusing them of cow smuggling. They planned to protest in front of TMC leader Moloy Ghatak’s house. However, Supriyo was attacked before they could put this in motion. District BJP leader Subrata Mishra was also injured during the ruckus. After the incident, Supriyo took to Twitter accusing TMC leader Ghatak of orchestrating the whole affair.", "News agency ANI had also reported the incident.", "West Bengal: Ruckus during Union Minister Babul Supriyo’s visit in Asansol pic.twitter.com/d6Z4N4SefR", "— ANI (@ANI) October 19, 2016", "To sum it up, a video of an attack on BJP leader Babul Supriyo’s convoy from October 2016 has been falsely shared as Union Health and Family Welfare Minister Dr Harsh Vardhan beaten. In fact, BJP leader Subrata Mishra was also injured in this incident from four years ago.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]