["About this rating", "On 13 April 2016, the Facebook page Thinking Humanity published a video that purported to show orchestra players bringing whales to the surface of the ocean with its music:", "This Facebook post went viral and racked up more than 3 million views within a week of its initial posting. While Thinking Humanity presented the video as if it showed a genuine event, it isn't real.  The video is actually a commercial for Optus, an Australian telecommunications company:", "This \"whale song\" campaign was developed by advertising agency M&C Saatchi, and was first published in 2009:", "“Whale song is a form of communication,” says Ben Welsh, executive creative director, M&C Saatchi Sydney.  “It’s a form of communication that the scientists at The University of Queensland have been able to decipher and learn. I was intrigued by this fact and so we asked ourselves whether it would be possible to emulate a male humpback: to write our own love song and then play it, using the instruments of an orchestra? Could we serenade a humpback ourselves? Then imagine what could happened if the whales were to hear our song. We thought that would prove that when it comes to communication, anything is possible.”", "While M&C Saatchi set out to create music that would be reminiscent of whale song, but still appealing to humans, the whales in the video were not real, but instead were created by digital arts studio Animal Logic. The \"whale song\" ad campaign also consisted of a web site which allowed users to \"interact\" with whales through their keyboards:", "Optus is a leading Australian telecommunications company. They were involved in a prolonged, retail price war, and desperately wanted their brand to stand for something again, so consumers would consider them on more than price.", "Solution\nScientists at the University of Queensland have been conducting some groundbreaking research. They have found that whales communicate wth each other across vast tracts of ocean, by singing complex love songs to each other.", "This inspired us to create the Whale Song project. We took this research and imagined how whales would respond if we played our own \"whale song\" to them, with a real orchestra.", "We launched the project with a TV spot. It was an immediate hit, with people loving its inspirational nature. We supported it with a massive outdoor campaign. But that wan't enough. We really wanted people to connect with the brand, so we created interactive sound banners that directed people to our online Whale Song experience. People were encouraged to create their own whale song, and play it to a lifelike 3D whale, which responded to their song.", "People have been making music with whales for decades.  In 1970, \"Song with a Humpback Whale\" (recorded by a team led by marine scientist Roger Payne) was released, and became the most popular environmental album in history; singer Judy Collins used some of those recordings in her album Whales and Nightingales, which subsequently went gold:", "Whether whales actually like human music is up for debate.  In 1999, Seattle's Cantabile Choir organized a concert around Washington state's San Juan islands:", "...as the Odyssey made its way through Haro Strait and the western skies turned orange and pink over the Canadian peaks nearby, the group of about 20 sang and a handful of musicians played: Yeman-ja, the Afro-Brazilian music; \"Plovi, Barko,\" a Serbo-Croatian song about the sea; a French Christmas carol; Renaissance madrigals; South African children's songs and the Christian hymn \"For the Beauty of the Earth.\"", "\"Whales coming at 7 o'clock!\" reported Lynn Danaher, the skipper of the Odyssey and a former commercial fisherwoman in Alaska, referring to the orcas' location and not the time. ''Keep singing! Keep singing!\"", "As two orcas moved slowly along the port side, surfacing now and then, Ms. Danaher, whose company, San Juan Excursions, runs tours every day from early May to late September, said she had little doubt the whales were intrigued. \"But I'm really wondering right now if they want something a little faster. Like 'Johnny B. Goode.'\"", "No whales surfaced dramatically from the deep to \"dance\" to the orchestra in that case, but about a dozen orcas reportedly showed up.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]