["On March 5, the Reserve Bank of India (RBI) announced that it was superseding the board of directors at Yes Bank for a period of 30 days “owing to a serious deterioration in the financial position of the Bank”. The RBI also imposed a moratorium on Yes Bank under section 45 of the Banking Regulation Act, 1949, effective till April 3. The regulator of the entire Indian banking system has capped the limit of regular withdrawals for Yes Bank customers at Rs 50,000 for the moratorium period.", "Now, a graphic enlisting four companies, supposedly owned by Congress leaders, which are “wilful defaulters of Yes Bank”, is doing the rounds on social media. The top four purported wilful defaulters are – “Full Innovations” owned by P. Chidambaram, ‘Young Indian’ owned by members of Gandhi family, Jindal Steel by Congress leader and industrialist Naveen Jindal, and “Rehmat foundation” by Ahmed Patel. According to the claim, the amounts owed to the banks by these companies are Rs 40,000 cr, Rs 70,000 cr, Rs 49,000 cr, and Rs 80,000 cr respectively.", "Alt News has also received several requests on its official app to fact-check this claim.", "The same was also shared by individuals on Twitter and Facebook.", "#Yes_Bank 1st top list of defaulters", "1) Rehmat Foundation: 8,00,000 cr Owner: Ahmed Patel(MP) PA to Sonia 2) Young India: 7,00,000 cr Owner: Sonia & Rahul Gandhi", "3) Jindal Steel: 4,90,000 cr Owner: Congress MP Naveen Jindal", "4) Full Innovations: 4,00,000 cr Owner: P Chidambram", "— Bainktesh Nandvansi (@bainktesh) March 12, 2020", "Alt News couldn’t find any media reports where the name of these companies crop-up. Finance Minister Nirmala Sitharaman addressed a presser where she referred to the very stressed corporations whom Yes Bank had lent. She cited Reliance Group, Essel Group, DHFL, IL&FS and Vodafone Idea.", "“I wouldn’t even mind taking their names as they are in public domain and I am not violating any customer’s privacy. Anil Ambani Group (Reliance Group), Essel Group (of Subhash Chandra), DHFL (Dewan Housing Finance Corp. Ltd.), Infrastructure Leasing & Financial Services Ltd. and Vodafone are some of those very stressed corporates to whom Yes Bank has been exposed. This is from prior to 2014,” said the minister. She can be heard saying this starting from 14 minutes in the video below.", "According to a report by The Indian Express, at least nine companies of the Anil Ambani Group accounted for NPAs worth Rs 12,800 cr. While at least 16 companies of the Subhash Chandra’s Essel Group accounted for bad loans worth Rs 8,400 cr, the Dewan Housing Finance Corporation and Belief Realtors Private Ltd of the DHFL group had taken loans worth Rs 4,735 cr.", "A table of the top defaulters clearly shows that Anil Ambani Group reportedly owes the highest sum to Yes Bank. Anil Ambani Group’s loan amount stands at Rs 12,800 cr. Hence, it can be said that the amount cited in the viral graphic to four Congress-linked companies, is fictitious. It may be reiterated that the Finance Minister specifically emphasised the names cited during the press conference are of “very stressed corporates to whom Yes Bank has been exposed”.", "Therefore, the claim that four companies owned by Congress leaders – Rahul Gandhi, Sonia Gandhi, Ahmed Patel, P. Chidambaram and Naveen Jindal – were the major wilful defaulters of Yes Bank that led to the recent crisis is baseless. It may be noted that Alt News couldn’t even find the names of two companies – Full innovations and Rehmat Foundation – which have links with P. Chidambaram and Ahmed Patel. As stated by the Finance Minister herself, the very stressed corporations include the likes of Anil Ambani Group and Subhash Chandra’s Essel Group.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]