["About this rating", "The size of the crowds attending his public events has always been supremely important to President Donald Trump, so much so that he has been known to inflate attendance numbers on more than one occasion.", "The tendency for exaggeration seems to have rubbed off on some of Trump's supporters, a few of whom posted on social media after his 5 February 2019 State of the Union (SOTU) address that more people had watched the president's speech on TV than had watched the 2019 Super Bowl (which is typically the most-watched television broadcast in any given year).", "Even though the Nielsen ratings for the State of the Union wouldn't be released until late the next day, Trump partisans wasted no time in claiming victory for the speech:", "The SOTU had more viewers than the Super Bowl and with the same result.\nPatriots WIN!???????????????? #MAGA", "— ChickArOO ?? (@RepMarinochick) February 6, 2019", "The SOTU had more viewers than the Super Bowl and with the same result.", "Patriots WIN!", "??????????????", "— ? Pink Lady 4 Trump? (@pink_lady56) February 6, 2019", "It should be noted that the odds were massively against the SOTU beating the Super Bowl going in. Despite racking up the lowest Nielsen ratings of any Super Bowl in the past 10 years, 2019's Patriots vs. Rams match-up drew a total viewing audience of 98.2 million watchers -- more than twice the viewership of any State of the Union address (including Trump's previous outing) from the past decade.", "Social media interactions are now included in the Nielsen Company's ratings estimates, and those numbers were similarly huge for the Super Bowl:", "When it comes to the social nature of the game, in the U.S., there were 32.3 million social media interactions across official Facebook, Instagram and Twitter accounts and fan Twitter accounts about Super Bowl LIII on CBS on Feb. 3, 2019.", "The top social minute of the telecast on Twitter occurred at 8:23 ET p.m., during which 171,000 Twitter interactions were sent as fans reacted to the halftime show performance wrapping up. The second most social minute occurred after the game at 10:09 ET p.m., during which 102,000 Twitter interactions were sent discussing the Patriots’ victory over the Rams. The third most social moment occurred at 9:34 ET p.m., when nearly 74,000 Twitter interactions were sent about the Patriots scoring the first touchdown of the night.", "On 6 February 2019, Nielsen released the viewership stats for the State of the Union address. They could not have been happy-making numbers for those who had rushed to declare Trump's speech the ratings winner:", "An estimated 46.8 million people tuned in to watch President Donald Trump deliver his State of the Union address in Washington, D.C., on Tuesday, Feb. 5, 2019.", "While coverage varied by network, 12 aired live coverage from approximately 9:00 p.m. ET to 10:30 p.m. ET.", "In terms of the social nature of the address, the State of the Union 2019 was the No. 1 most social program on Feb. 5, 2019. There were 15.2 million total interactions across Facebook, Instagram and Twitter about the State of the Union 2019. Of the 15.2 million total interactions measured, 12% occurred on Facebook, 5% occurred on Instagram and 84% occurred on Twitter.", "More than twice as many people (98.2 million, as compared to 46.8 million) watched the Super Bowl than watched the State of the Union address in February 2019. The roughly 2:1 ratio also held for social media interactions related to the events.", "In terms of prior-year SOTU ratings performance, Trump bested the figure for his last appearance before a joint session of Congress (45,551,000 in 2018), but not his first (47,741,000 in 2017), and failed to beat the viewership numbers of President Barack Obama's most-watched addresses, 52.3 million in 2009 and 48 million in 2010.", "Stelter, Brian.   \"Trump's Second State of the Union Clocks Higher Ratings Than His First.\"\r\n    CNN.   6 February 2019.", "Sullivan, Sean and Jenna Johnson.   \"Yes, Donald Trump's Crowds Are Big -- But Not Quite as 'Yuge' as He Often Claims.\"\r\n    The Washington Post.   29 October 2016.", "The Nielsen Company.   \"Nearly 47 Million Viewers Watch President Trump's State of the Union Address.\"\r\n    6 February 2019.", "The Nielsen Company.   \"Super Bowl LIII Draws 98.2 Million TV Viewers, 32.3 Million Social Media Interactions.\"\r\n    4 February 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]