["About this rating", "During a speech commemorating Independence Day in 2019, U.S. President Donald Trump made a statement erroneously indicating that American rebels had taken over not-yet-existent airports during the Revolutionary War:", "Trump gave the 45-minute speech during a rain-soaked spectacle in Washington, D.C., on July 4, 2019, during which military hardware such as tanks and aircraft were displayed on parade.", "During a passage in the speech in which Trump was describing the American Revolutionary War in soaring rhetoric, he remarked: \"The Continental Army suffered a bitter winter of Valley Forge, found glory across the waters of the Delaware, and seized victory from Cornwallis of Yorktown. Our army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do. And at Fort McHenry, under the rockets' red glare, it had nothing but victory.  And when dawn came, their Star Spangled Banner waved defiant.\"", "Because no airports existed in the 18th century (the first successful airplane  wasn't flown until 1903), that portion of Trump's speech inspired some jokesters to take to Twitter using the #RevolutionaryWarAirports hashtag, sharing humor and altered images of famous Revolutionary War artwork edited onto photographs of airports:", "There are just too many funny #RevolutionaryWarAirports images. Here are some such as the famed \"Battle of LaGuardia\" to onward to JFK!#TrumpParadeFail pic.twitter.com/FD4BPFkXu2", "— (((DeanObeidallah))) (@DeanObeidallah) July 5, 2019", "Dearest George,\nWe never expect to find ourselves in Laguardia airport fighting through the TSA line. We prayed hard but never made it to the gate. Remember us fondly. Do not let our struggle be for naught.", "#RevolutionaryWarAirports", "— Molly Jong-Fast (@MollyJongFast) July 5, 2019", "Trump blamed a faulty teleprompter for the goof, telling NBC News, \"The teleprompter went out. It kept going on, and then at the end, it just went out. It went kaput.\"", "Shear, Michael D.   \"With Flyovers and Flags, Trump Plays M.C. for the Fourth.\"\r\n    The New York Times.   4 July 2019.", "Gregorian, Dareh.   \"Trump Blames Teleprompter for Revolutionary War 'Airports' Flub.\"\r\n    NBC News.   5 July 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]