["A video of a man surrounded by policemen lying on the ground is being shared on social media. The man can be seen constantly coughing and demanding water. Alt News has received several requests to fact-check the video on its official mobile application. It has been shared with the message, “A top official of Bhagalpur jail infected with corona. (भागलपुर जेल का बड़ा बाबू कोरोना पीड़ित.)”", "On 11 April 2020, Facebook user Gulam Sarwar posted this video with the same message. The clip was viewed 11,000 times at the time of writing (archive).", "भागलपुर के सेंट्रल जेल में बड़ा बाबू को करोना हुआ।", "Posted by Gulam Sarwar on Saturday, 11 April 2020", "The video is also viral on Facebook with an identical message.", "Upon searching with keywords ‘bhagalpur central jail corona’, we found the same video uploaded on YouTube on April 11, 2020. The YouTube channel described the video as a mock drill in Bhagalpur Central Jail.", "A subsequent search led us to an article published by Dainik Jagran on April 14. The report said a mock drill on how to rescue a coronavirus patient was conducted in Bhagalpur Central Jail. The patient seen in the video is the prison cell keeper. According to the report, this video quickly became viral on social media with the false claim that a jail official was infected with the virus. Following this, the administration complained to SSP Ashish Bharti who said that action will be taken against those who circulate unverified videos on the outbreak.", "Dainik Bhaskar had also reported on the case.", "Media outlets The Lallantop and The Quint had published fact-check articles when the video was viral in April.", "Therefore, a video of a coronavirus mock drill conducted in Bhagalpur Central Jail in April was shared with the false claim that a jail official contracted the virus.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]