["Two videos of a woman held hostage by a mob which is accusing her of child-lifting is viral on social media. In the first video, the mob is questioning the woman dressed in a black saree about her team of ‘child-kidnappers’. Facebook user Sunita Jairam posted the video with the message, “सावधान पूरे हिन्दुस्तान में रोहिंग्या की 2000 लोगो की टीम आयी है जो बच्चों को उठा के ले जा रही है कोई बेचता है कोई बलि के लिये ले जाता है खुद देखो सुनो ओर ज्यादा से ज्यादा इसे फैलाओ (a team of 2,000 Rohingyas are on a prowl across the country to kidnap children. They either sell these kids or sacrifice them. Watch and listen to it yourself and share it as much as possible -translated)”. The post has garnered close to 5,000 shares.", "सावधान पूरे हिन्दुस्तान में रोहिंग्या की 2000 लोगो की टीम आयी है जो बच्चों को उठा के ले जा रही है कोई बेचता है कोई बलि के लिये ले जाता है खुद देखो सुनो ओर ज्यादा से ज्यादा इसे फैलाओ", "Posted by Sunita Jairam on Monday, 19 August 2019", "Another video of the same woman, where is she is inquired by the mob about the number of abducted children and their whereabouts, is also circulating on social media. Facebook user Vikram Singh shared this video with a similar narrative.", "Alt News looked at multiple news reports related to incidents where people mistaken for child-kidnappers were caught in Uttar Pradesh. We found that this woman was held hostage by a mob in Dimrauni village of UP’s Jhansi district. A YouTube Channel Bharat News 24 Live claimed that the woman was a child-lifter. The reporter in the video is speaking to the woman in Badagaon police station.", "On August 3, Amar Ujala reported that the woman held captive by a mob in Dimrauni village over suspicion of her being child-kidnapper was later handed over to the police. Contrary to the above report, Amar Ujala’s report said that the police has declared her to be mentally ill.", "Alt News contacted Badagaon police station to confirm the incident and inquire about its status. We were informed that the incident is at least 15-20 days old and the woman was a mentally-challenged person. The villagers had mistaken her for being a child-lifter. SI RK Pandey said, “we have not arrested any child-kidnapper recently.”", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]