["A photo of a tiger in flames has been shared tens of thousands of times on Facebook alongside a claim that millions of animals have been killed in the deadly Australian bushfires. However, the photo is being shared in a misleading context; it was actually shows a stuffed tiger that was set ablaze in Indonesia in 2012.", "The image was published in this Facebook post on January 5, 2020 and has more than 84,000 shares.", "The post’s text reads: “Huge wildfire in Australia has resulted in deaths of more than 480 milion animals.Hundred of rare koalas are also reported dead among them. End of era. One after another. Lets pray for Australia. Source:University of sydney report #wildfire”", "Below is a screenshot of the post:", "The image also appears in this Facebook post, which has over 85,000 shares, and in other posts seen here, here and here.", "On Twitter, the image was published here, here, here, here, here and here. It can also be seen in YouTube videos here and here.", "The photo is being shared in a misleading context; it actually shows a stuffed tiger after it was set ablaze by Indonesian authorities in 2012.", "The original photo was published here on November 12, 2012 by Shutterstock Editorial, an international photo agency.", "The photo’s caption reads: “Hundreds of stuffed rare and endangered animals are seen being burnt by authorities in Jakarta, Indonesia. In total 258 animals from different 48 species - including 15 tigers, 2 sun bears and 48 deer - were destroyed. The animals in question had all been killed by poachers before being stuffed and sold to be displayed in people's homes. In Indonesia trading in or being in possession of certain protected animals or their body parts - such as the Sumatran tiger - is a criminal offense.”", "Below is a screenshot of the website:", "The other three images visible in the Facebook post are also unrelated to Australia’s recent bushfires.", "The photo of a horse being led through smoke was shot on October 30, 2019 in southern California, USA and can be viewed here on Shutterstock.", "The picture of a deer standing in front of a torched residence and the photo of a burnt cat were both taken in November 2018 following deadly wildfires in northern California. They were published respectively here by AFP and here by The Mercury News, a San Jose, California-based newspaper.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]