["A video of a man dressed in Indian army fatigue, claiming to be a Sikh officer, has been shared amidst the farmers’ protest. “21 sikh regiment of the indian army has refused to fight for india. A Sikh soldier vows to fight for Sikh homeland Khalistan,” was the message used to the share the video by Pakistani Twitter handle @TeamPZBofficial.", "Big News", "21 sikh regiment of the indian army has refused to fight for india. A Sikh soldier vows to fight for Sikh homeland Khalistan.🔥#IndiaShutDown pic.twitter.com/xDm1a8KSCW", "— #TeamPakistanZindabad🇵🇰 (@TeamPZBofficial) December 8, 2020", "The same video also found its way to Facebook. A similar message is circulating online without the video.", "Breaking News", "Just now 300 Sikh soldiers from 21 Sikh regiment of Indian Army have resigned as Modi tried to use Sikhs on Sikhs today at #IndiaShutDown pic.twitter.com/Maazh8ELQ4", "— محمد اویس (@amanulla1231) December 8, 2020", "The man can be heard speaking in Punjabi, condemning the incident where an auto-driver was thrashed by the Delhi police. He called the act “shameful” and claimed that Sikhs do not feel safe in India. “It’s violence such as this that prompts us to demand a separate state of Khalistan,” he says.", "ਪੁਲਿਸ ਸਿੱਖਾਂ ਨੂੰ ਵਾਰ ਵਾਰ ਨਿਸ਼ਾਨਾ ਬਣਾਉਣ ਤੋਂ ਗੁਰੇਜ ਕਰੇ ਇਹ ਚੰਗਾ ਨਹੀ ਹੋਵੇਗਾ", "Posted by Justice Fan Club on Wednesday, 19 June 2019", "The video was circulated with the caption – “ਪੁਲਿਸ ਸਿੱਖਾਂ ਨੂੰ ਵਾਰ ਵਾਰ ਨਿਸ਼ਾਨਾ ਬਣਾਉਣ ਤੋਂ ਗੁਰੇਜ ਕਰੇ ਇਹ ਚੰਗਾ ਨਹੀ ਹੋਵੇਗਾ (Police should refrain from targeting Sikhs repeatedly it’ll not be good for them)”", "The following is a gist of his speech – “Waheguru ji ka Khalsa Waheguru ji ki Fateh. I am Satvir SIngh am an Indian army soldier, a resident of Uttar Pradesh. It’s been two days since the video of a Sikh auto-driver brutally thrashed by Delhi police was uploaded. They played with our religious sentiments. This was a shameful act. The Sikhs who have fought for this country and saved this country were beaten in the capital. Sikhs are not safe in India. This is not an isolated incident. The police have resorted to hooliganism. Stand for Sarabjit Singh and Balwant Singh. We are united. Because Sikhs don’t feel safe in this country, we want Khalistan. The atrocities will not end…You think we are only 2% so we aren’t capable of doing anything? The day this 2% loses their mind, they will stir up the entire world….The largest statue is built here, you are saying you have taken strong stands against Pakistan and China, but little girls are raped here. What has the progress been? There has been no progress in India. Elections are won on religion. This election was won on religion…I want to tell the police that if you have so much pride for your uniform, take Sikhs head-on. Then you will see what happens. I want to tell the police that if you want you can contact me, my numbers are 731******* and 941*******. I will meet you wherever you want…But don’t piss off Sikhs. If we are angry, you don’t know what will happen…waheguru ji ka khalsa waheguru ji ki fateh.”", "While challenging the police, the man gave two mobile numbers – 731******* and 941*******. According to Truecaller, the second one belongs to ‘Fozi TV.’ Google search results of ‘Fozi TV’ throw up a bunch of links of an online video streaming platform. The number was switched off when we called.", "Incidentally, the first number was saved as ‘Satvir on Truecaller’. The man in the video had introduced himself as ‘Satvir’ Singh. The person who answered the phone when we called claimed to be unaware of the video. “I’ve received 5-7 calls today regarding the video,” he said. The conversation was interrupted as we forwarded the video to him. All subsequent phone calls went unanswered or were disconnected. Alt News was unable to confim if the number belonged to the man who made the video.", "The ADG PI of the Indian Army had tweeted from its official handle in 2019 that the man in the video is an imposter. “Imposter wearing Indian Army combat uniform in video spreading disinformation,” read the tweet. “Soldiers of #IndianArmy are committed to uphold the core values of our Constitution and the rich history of Courage, Valour and Sacrifice,” it furthered.", "‘Be Cautious – Be Vigilant’", "❌Imposter wearing Indian Army combat uniform in video spreading disinformation.❌", "✅Soldiers of #IndianArmy are committed to uphold the core values of our Constitution and the rich history of Courage, Valour and Sacrifice. ✅", "We are at it. pic.twitter.com/GHPYtZAwnA", "— ADG PI – INDIAN ARMY (@adgpi) June 22, 2019", "A few Pakistani social media users, therefore, shared a video of an imposter posing as a Sikh army man during farmers’ protest. Furthermore, there is no news report suggesting that Sikh regiments have resigned from the Indian army. In fact, the same message was widely circulated by Pakistani media and social media in March last year using a morphed Republic TV graphic plate.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]