["Don’t feel too bad if you’ve never heard of the Consumer Financial Protection Bureau. It’s the new kid in Washington, as far as government agencies go, created by the passage of the 2010 massive financial regulation overhaul known as Dodd-Frank.", "The bureau, which opened in 2011, has rulemaking powers, supervises certain financial institutions and checks out complaints from consumers about lending practices that may violate the law.", "An editor of the conservative news website Townhall claimed it has more nefarious aims.", "A reader asked us to look into the thrust of a June 19 story by news editor Katie Pavlich, also a Fox News contributor and conservative author, who said the agency granted itself authority to shut down businesses for basically any reason.", "\"Last week the Consumer Financial Protection Bureau, through the power of Dodd-Frank, passed a rule giving the agency unprecedented power to shut down businesses, no matter what the reason, at any time it wishes through a cease-and-desist order,\" Pavlich wrote.", "That seemed like a lot of unilateral power, so we wanted to look into her claim.", "Federal rulemaking fun", "We tried to reach Pavlich through email and Twitter, but she did not respond. Her article links to a post on CFPB Monitor, a blog maintained by the Ballard Spahr law firm, about the agency adopting a final rule on temporary cease-and-desist orders.", "Just one problem: The cease-and-desist order isn’t what Pavlich thinks it is.", "One of Ballard Spahr’s attorneys told us the rule Pavlich referenced is not meant to gut businesses’ rights and is typical of other federal and state financial regulators.", "\"It’s not like a blank check to put somebody out of business,\" said Christopher Willis, a Ballard Spahr partner and consumer finance attorney who represents financial institutions that would be subject to the rule. \"It’s supposed to be tied to stopping someone from violating the law.\"", "Here’s how Willis explained it to us:  When the agency thinks a business has broken the law, the agency can file a lawsuit, pursue administrative proceedings or do a cease-and-desist order. But a cease-and-desist order is to cease-and-desist violating the law -- not to stop existing.", "Moreover, the agency didn’t give itself the power to issue cease-and-desist orders, Congress did. Section 1053(c) of the Dodd–Frank Wall Street Reform and Consumer Protection Act allows the Consumer Financial Protection Bureau to conduct cease-and-desist proceedings.", "So, in September 2013, the agency developed an interim rule that spells out how to do what Congress wanted. Essentially, the rule says the agency’s director may issue a temporary cease-and-desist order when he or she finds a company’s alleged unlawful action will render it unable to pay debts or \"otherwise prejudice the interests of consumers.\"", "An earlier CFPB Monitor post equated this kind of order with a temporary restraining order in a judicial proceeding. The order is enforceable once served.", "The agency published its final rule June 18, effective July 18. The Consumer Financial Protection Bureau received just one public comment about the regulation, which appears to have been intended for the Food and Drug Administration.", "Power with precedent", "So we know the agency didn’t just assign itself this power. But there are more issues to address with Pavlich’s claim that the rule gives the Consumer Financial Protection Bureau \"unprecedented power to shut down businesses, no matter what the reason, at any time it wishes.\"", "Is the cease-and-desist authority unprecedented?", "Not really. Other banking agencies have had this power for a long time, Willis said.", "Agency spokesman Samuel Gilford sent us an alphabet soup of federal financial regulators with similar power, including the Federal Deposit Insurance Corporation, Securities and Exchange Commission, Federal Reserve, OCC and Financial Industry Regulatory Authority, as well as many state banking regulators (see examples in Texas, Connecticut, North Carolina).", "Can the agency shut down businesses for any reason?", "The agency is tasked with overseeing a large amount of businesses -- mainly payday lenders, non-bank mortgage lenders, banks and credit unions with assets over $10 billion, and private student loan lenders. Still, we’re not talking about mom and pop’s pizza shop. The agency can only go after the businesses it’s tasked with overseeing.", "Gilford said the agency has not yet issued a cease-and-desist order. But when it does, it can’t just do it for any reason.", "\"Any temporary cease-and-desist order issued by the CFPB must describe the basis for the order, the alleged violations of the law, and the harm that is likely to result without the issuance of an order,\" Gilford said.", "That said, the agency is powerful and operates with more autonomy than other agencies, Willis said. Its budget is not controlled by Congress, and its director is insulated from the political process after the president appoints him or her.", "\"So there’s a lot of criticism against the agency for lack of democratic accountability,\" Willis said. \"But it has nothing to do with cease-and-desist programs.\"", "Our ruling", "Pavlich recently wrote for Townhall, \"the Consumer Financial Protection Bureau, through the power of Dodd-Frank, passed a rule giving the agency unprecedented power to shut down businesses, no matter what the reason, at any time it wishes through a cease-and-desist order.\"", "She is mistaken, an attorney who represents the financial services industry told us.", "Pavlich ignores several key facts about the agency’s temporary cease-and-desist authority. Namely, it’s not unprecedented, it’s not issued without reason, and it’s meant to stop violations of law, not the business altogether.", "We rate her claim Pants on Fire.", "Interview with Sam Gilford, Consumer Financial Protection Bureau spokesman, Aug. 4, 2014", "Interview with Christopher Willis, consumer finance attorney and partner at Ballard Spahr, Aug. 1, 2014", "Townhall, \"Consumer Financial Protection Bureau grants itself power to shut down any business at any time,\" June 19, 2014", "CFPB Monitor, \"CFPB issues final rule on temporary cease and desist orders,\" June 18, 2014", "Federal Register interim rule for Consumer Financial Protection Bureau, Sept. 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]