["About this rating", "U.S. President Joe Biden was sworn into office on Jan. 20, 2021. More than a week later, some online advertisements were still being displayed as if President Donald Trump were still in office. They appeared to claim that former first lady Melania Trump had her own private bedroom on Air Force One. The ads read: \"Take a Look at Melania's Bedroom inside Air Force One.\"", "The ads led to websites Livestly and The Delite. Both had lengthy slideshow stories lasting a total of more than 70 pages.", "However, neither revealed anything about a separate bedroom for Melania Trump.", "On Sept. 11, 2001, White House photographer Eric Draper captured a picture inside the president's private suite on Air Force One. The room was located in the nose of the plane. In the photograph, President George W. Bush and White House Chief of Staff Andrew Card were shown standing in the suite while discussing the U.S. terrorist attacks:", "\"Technically, 'Air Force One' is used to designate any Air Force aircraft carrying the President,\" a page on the White House website explained. \"But it is now standard practice to use the term to refer to specific planes that are equipped to transport the Commander-in-Chief.\" The \"Air Force One\" name \"refers to one of two highly customized Boeing 747-200B series aircraft.\"", "In 2018, reports suggested that President Trump had requested a bigger bed be brought on board for his private suite. A 2019 book also purportedly revealed that Melania Trump had her own bedroom in the White House.", "The misleading advertisement and article from the Livestly website appeared to contain a number of inaccuracies. For example, it claimed that there were \"two massive kitchens\" on board and that \"each kitchen holds up to 100 people.\" It's true that Air Force One has two food-prep areas. However, they're referred to as galleys, not kitchens.", "An ABC News video from 2015 showed the size of one of the galleys. They appeared to be very small. It would likely be quite difficult to fit even 10 people in one of the galleys, much less 100. The video was reposted by an unofficial Air Force One Facebook fan page:", "ABC News also reported that \"a team of chefs prepares the meals to be served on Air Force One.\" The food is prepared on the ground \"inside a secure kitchen facility at Joint Base Andrews in Camp Spring, Md.\"", "High quality food is a top priority of the flight attendants aboard Air Force One. A team of five prepares the trays served to the roughly 100 guests on board. \"They make sure everything is perfect, the steaks are in position, the green beans are exactly where they need to be for every single plate,\" said Technical Sergeant Brenda Rodriguez, who leads the team in the forward galley.", "In sum, at least two clickbait ads promised a look at former first lady Melania Trump's private bedroom on Air Force One. Neither article showed any such bedroom, because it did not exist. Other claims in the stories were also misleading.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]