["About this rating", "In November 2018, as California suffered a historically destructive and deadly outbreak of wildfires, conspiracy theorists pushed absurd notions about nefarious, powerful actors intentionally starting the blazes. On 13 November, five days after a wildfire effectively wiped the entire town of Paradise off the map, egregiously faulty memes began to emerge implying that the fires were set to clear the way for the construction of California’s High Speed Rail:", "Sure, by placing two extremely low-res images sort of near each other and hoping your readers squint their eyes, one might convince a few that the red outline purported to be the extent of the California wildfires looked similar to the proposed map of the California high-speed rail. There are, of course, several problems with the comparison presented.", "First and probably most significant is the fact that the map purporting to show the extent of the wildfires (which, astute observers may have noted, appears to have consumed wholesale the cities of San Diego, Los Angeles, San Jose, San Francisco, and Sacramento) is actually a map of “red flag” warnings put out by Cal Fire on 11 November 2018. A red flag warning “is issued for weather events which may result in extreme fire behavior that will occur within 24 hours” and does not, as implied by the meme, represent areas that have burned.", "A #RedFlagWarning has significantly increased in size, now spanning across California through Monday, due to gusty winds and low humidity. This is #CriticalFireWeather and precautions should be taken when outdoors to avoid any potential sparks. https://t.co/jRrR4hFuqh pic.twitter.com/RzwVF7Fagw", "— CAL FIRE (@CAL_FIRE) November 12, 2018", "Second, and no less significant, is the fact that the area representing the red flag warning for that day does not even line up at all (let alone “exactly”) with the proposed path of the California high-speed rail. The meme makes use of a map presented on the website America2050.org, but below we used a more recent map produced by the California High-Speed Rail Authority in May 2016, which shows the “proposed statewide alignment” for the railway, and overlaid it with the (largely irrelevant) map of the red flag warning issued on 11 November 2018. It is far from an exact match:", "Boxall, Bettina et al.   \"California’s Most Destructive Wildfire Should Not Have Come as a Surprise.\"\r\n    Los Angeles Times.   10 November 2018.", "Fry, Hannah et al.   \"Death Toll from the Paradise Fire Jumps to 42, Making it the Worst in California History.\"\r\n    Los Angeles Times.   12 November 2018.", "Murphy, Paul P.   \"Before and After Photos Show How Wildfire Reduced Paradise, California, to Ashes.\"\r\n    CNN.   14 November 2018.", "Cal Fire.   \"Red Flag Warnings & Fire Weather Watches.\"\r\n    Accessed 15 November 2018.", "California High Speed Rail Authority.   \"Proposed Statewide Alignment.\"\r\n    May 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]