["About this rating", "On Nov. 13, 2019, the Ohio House of Representatives passed House Bill 164, titled the \"Ohio Student Religious Liberties Act of 2019.\" A provision of that bill gave rise to multiple articles bearing headlines such as \"Ohio Law Would Allow Students to Give Wrong Answers Because of Religious Belief\" and \"Ohio House Passes Bill Allowing Student Answers to Be Scientifically Wrong Due to Religion.\"", "One such article from Cincinnati television station WKRC, for example, stated that:", "Ohio lawmakers are weighing in on how public schools can teach things like evolution.", "The Ohio House passed the \"Student Religious Liberties Act.\" Under the law, students can't be penalized if their work is scientifically wrong as long as the reasoning is because of their religious beliefs.", "Instead, students are graded on substance and relevance.", "The actual text of the bill was more nuanced in its wording, however, and did not necessarily support the claims of such headlines. The passage in HB 164 read as follows:", "Sec. 3320.03. No school district board of education, governing authority of a community school established under Chapter 3314. of the Revised Code, governing body of a STEM school established under Chapter 3326. of the Revised Code, or board of trustees of a college-preparatory boarding school established under Chapter 3328. of the Revised Code shall prohibit a student from engaging in religious expression in the completion of homework, artwork, or other written or oral assignments. Assignment grades and scores shall be calculated using ordinary academic standards of substance and relevance, including any legitimate pedagogical concerns, and shall not penalize or reward a student based on the religious content of a student's work.", "Given the wording of this section, it seems fairly clear that under the proposed law students could not, for example, be prohibited from, or downgraded for, crafting essays or art projects around subjects such as Jesus, the Quran, or missionary work when the related assignments afforded students the latitude to choose their topics. But would Sec. 3320.03 really allow students to answer questions about evolution in a biology class by referencing passages from Genesis that contradicted the information imparted by their teachers and offered in their textbooks?", "Some opponents have asserted the latter would indeed be the case:", "ACLU of Ohio Chief Lobbyist Gary Daniels called HB 164 a mixed bag. On the one hand it removes some restrictions on students’ religious rights.", "On the other hand, Daniels said that if a student submitted biology homework saying the earth is 10,000 years old, as some creationists believe, the teacher cannot dock points.", "“Under HB 164, the answer is ‘no,’ as this legislation clearly states the instructor 'shall not penalize or reward a student based on the religious content of a student’s work,” he said.", "Others, including the bill's sponsor, maintained that students would still be required to provide answers that conformed to the curriculum as taught:", "[Rep. Timothy] Ginter, the bill’s sponsor, said that the student would get a lesser grade in a biology class for an evolution assignment. Even if the student doesn’t believe in evolutionary theory, the student must turn in work that accurately reflects what is taught.", "“It will be graded using ordinary academic standards of using substance and relevance,” he said.", "“This doesn’t give student a get-out-of-jail free card.\"", "Critics have proclaimed that however the bill is applied, it unnecessarily duplicates constitutional and state freedom of speech and religion protections and would place teachers and school administrators in the position of having to interpret and judge students' religious convictions and beliefs.", "What HB 164 might ultimately allow or not allow in the intersection of education and religion cannot be definitively determined until it is put into effect and applied to specific cases. As of now the bill still has to be approved by the Ohio Senate and signed by the governor before it becomes law, so any application of it will not take place unless and until those events occur.", "Hancock, Laura.   \"Ohio Lawmakers Clear Bill Critics Say Could Expand Religion in Public Schools.\"\r\n    Cleveland.com.   13 November 2019.", "Stone, Michael.   \"Ohio Law Would Allow Students to Give Wrong Answers Because of Religious Belief.\"\r\n    Patheos.   14 November 2019.", "WKRC-TV.   \"Ohio House Passes Bill Allowing Student Answers to Be Scientifically Wrong Due to Religion.\"\r\n    13 November 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]