["By Caroline Wallace", "Posted on June 24, 2016", "Libertarian presidential nominee Gary Johnson claimed that “no politicians outside of Bernie Sanders and myself support legalizing marijuana” at the “congressional, gubernatorial, senatorial level.” He’s wrong.", "There are at least 20 other members of Congress and one governor who, as Johnson and Sanders do, support the legalization of marijuana.", "Johnson, a former governor of New Mexico, made the claim in a June 16 interview with USA Today‘s Susan Page. Page asked Johnson about his efforts to appeal to young voters who supported Democratic presidential candidate Bernie Sanders.", "Page, June 16: Some people think you have the potential to be appealing to millennial voters, who were, many of them supported Bernie Sanders, now have to consider Hillary Clinton. In part because you’re a longtime and the most prominent supporter in the country of legalized marijuana. Is that a good issue for you, do you think?", "Johnson: I think it’s a litmus test for having a brain, myself. When 56 percent of Americans now support legalizing marijuana and no politicians outside of Bernie Sanders and myself support legalizing marijuana — and I’m talking now at the congressional, gubernatorial, senatorial level — it’s amazing. It’s an unbelievable disconnect.", "Johnson is wrong that no other governor, representative or senator, besides Sanders, supports legalizing marijuana at the federal or state level.", "We reached out to Johnson’s campaign for an explanation of his position on legalizing marijuana, but did not hear back.", "Johnson, who also ran for president in 2012, explained his position this way at the time:", "Johnson 2012 campaign website: Proposals to regulate marijuana similarly to alcohol have been considered in several states, and Governor Johnson has supported those efforts; he believes the federal government should end its prohibition mandate and allow each state to pursue its own desired policy.", "Sanders introduced a bill in 2015 that would do exactly that. The bill, “Ending Federal Marijuana Prohibition Act,” would remove marijuana from the list of federally controlled substances and repeal all federal penalties for growing, possessing or using marijuana. States, on the other hand, would be allowed to impose their own restrictions on the drug.", "The Sanders proposal has no cosponsors and has never been brought up for a vote in the Senate. But a similar bill in the House of Representatives has 18 cosponsors.", "The “Regulate Marijuana Like Alcohol Act” was introduced earlier in 2015, by Democratic Rep. Jared Polis of Colorado. It would also declassify marijuana as a federally controlled substance and make it subject to the same regulations as alcohol under federal law, while allowing for state-specific restrictions.", "“It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don’t want, to have legal marijuana within their borders,” Polis said in a statement announcing the bill.", "Also, Democratic Sen. Jeff Merkley supported legalizing marijuana for recreational use in his home state of Oregon in 2014. Merkley was reportedly the first U.S. senator to do so.", "“I lean in favor of this ballot measure,” Merkley said, referring to Measure 91, which Oregon residents voted into law that year.", "So, at least 20 “congressional level” politicians, other than Sanders, support the legalization of marijuana. And at least one “gubernatorial level” politician does as well.", "Democratic Vermont Gov. Peter Shumlin, in his State of the State address in January, outlined a legalization plan in his state. Sanders’ home state of Vermont decriminalized marijuana in 2013.", "“I believe we have the capacity to take this next step and get marijuana legalization done right,” Shumlin said.", "Johnson’s statement that “no politicians outside of Bernie Sanders and myself support legalizing marijuana” at the “congressional, gubernatorial, senatorial level” is inaccurate. At least 20 others in Congress and one governor favor legalizing the drug.", "https://www.sharethefacts.co/share/3b9c7234-317a-4e2a-8f51-0d832f7764d2", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]