["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A video claims to show Gianna Bryant being ushered through a hospital, surrounded by medical staff. But that didn’t happen.", "Bryant died with her father Kobe Bryant in a helicopter crash on Jan. 26.", "The next day, a video titled, \"Kobe Bryant Daughter Gianna Bryant Final Hours\" was uploaded to YouTube. The video shows a young girl laying motionless on a hospital bed. She is slowly moved down a hallway lined with doctors and nurses in the first part of the video, and in the second she is surrounded by hospital staff and mourners.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Together, they’ve been shared thousands of times. As of Jan. 28, the video has 485,771 views on YouTube and 112,600 likes on the original TikTok it appeared in.", "While this video does feature a young woman who was killed in an accident, that woman is 28-year-old Ariana Cervantes. The original video was titled \"Ariana’s Honor Walk\" and was uploaded to YouTube on Sept. 4, 2019.", "The Pacific Attorney Group reported that Cervantes was one of two people killed by a traffic collision on Aug. 28, 2019, in Downey, Calif. She died two days later in the hospital. The video description says that Cervantes was an organ donor who received an honor walk, a ritual described by the New York Times as a way to show respect to dying patients planning to donate their organs.", "The full version of this video was uploaded more than four months before Gianna Bryant’s death. We rate this claim Pants On Fire.", "Youtube video, Kobe Bryant Daughter Gianna Bryant Final Hours, Jan. 27, 2020", "TikTok video, Jan. 27, 2020", "Youtube video, Ariana’s Honor Walk, Sept. 4, 2019", "Pacific Attorney Group, Ariana Cervantes Killed in Downey Pedestrian Accident at Imperial Highway and Barlin Avenue, Sept 11, 2019", "Tim Lahey, Rituals of Honor in Hospital Hallways, April 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]