["About this rating", "In late August 2020, readers inquired about a meme circulating on Facebook that claimed falsely that U.S. House Speaker Nancy Pelosi had rigged legislation to help her husband benefit financially from selling off property belonging to the U.S. Postal Service.", "The meme's text reads:", "This is Paul Pelosi (aka, Nancy’s Husband). He owns Financial Leasing Services LLC, a San Francisco based Real Estate and Venture Capitalist Firm. His net worth is 120 million. Why is this important? His wife sits on the “House Appropriations” committee. This committee appropriates funds to the United States Postal Service ( and others). Why is this important? Easy. She passed a bill to sell off 9 billion dollars ( yes 9 BILLION WITH a [smile emoji] worth of FEDERALLY OWNED POST OFFICE PROPERTY AND AWARDED THE THE CONTRACT TO, none other, Financial Leasing Services LLC. Her husbands firm. Why is this important? The commissions rate was set at 9%. That is almost a 1 BILLION dollar contract. If that’s not enough, let’s look at the new stimulus package. Nancy wants 25 billion in the stimulus package for the postal service where only 1.25 billion goes to making sure voting ballots are legit. The other 23.5 billion is going to “upgrading” the facilities so they are more attractive to potential buyers for her husbands firm. Corrupt to the core.", "It's true that Speaker Pelosi's husband Paul Pelosi owns and operates Financial Leasing Services, a San Francisco-based investment company. Financial disclosures in 2018, the most recent available, show Speaker Pelosi's estimated net worth to be $114 million.", "But Speaker Pelosi doesn't sit on the House Appropriations Committee. Her spokesman Drew Hammill told us by email she hasn't been on the committee since 2002. Furthermore, we found no evidence that a bill to sell off $9 billion-worth of federally-owned U.S. Postal Service property exists.", "It's true that the U.S. House of Representatives passed a bill that would, if signed into law, provide $25 billion to shore up the Postal Service and rectify delays in mail delivery service, but it doesn't allocate $1.25 billion toward \"making sure voting ballots are legit.\" The funding was originally on the table during negotiations over a coronavirus stimulus package, but those negotiations broke down. Whether the stand-alone Postal Service funding bill will be signed into law by U.S. President Donald Trump seems unlikely.", "The meme seems to be a rehash of a similar one that dates back to 2013 — except in that case the subject of the claim was Richard Blum, the husband of U.S. Sen. Diane Feinstein, D-Calif., who like Pelosi hails from San Francisco.", "Mikkelson, David.   \"Did Dianne Feinstein Get Her Husband’s Company a USPS Contract?\"\r\n    Snopes.   23 April 2013.", "Rayome, Alison DeNisco.   \"What the New USPS Bill Means for the Next Stimulus Package.\"\r\n    CNET.   24 August 2020.", "Pramuk, Jacob.   \"House Passes Bill to Put $25 Billion Into USPS and Reverse Changes Amid Uproar.\"\r\n    CNBC.   22 August 2020.", "Henney, Megan.   \"How Much Money is Nancy Pelosi Worth?\"\r\n    Yahoo! News.   17 July 2020.", "Wildermuth, John.   \"Pelosi's Husband Prefers a Low Profile.\"\r\n    San Francisco Chronicle.   1 January 2007.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]