["U.S. Rep. Alan Grayson, a Democratic candidate for the U.S. Senate, in an Oct. 14, 2015, file photo from a speech in Tallahassee. (AP)", "In the race for Marco Rubio’s Senate seat, Democratic Rep. Alan Grayson warned that Rep. Patrick Murphy’s campaign contributions from Wall Street make him far less progressive than what Democrats need in the upper chamber.", "Grayson made the comment during an interview with the Tampa Bay Times editorial board June 30 when probed about why he doesn’t see eye-to-eye with Sen. Chuck Schumer, D-N.Y. Grayson cited Schumer’s long history of Wall Street support to explain why their ideologies don’t connect. Then he hypothesized why Schumer backed Murphy over him.", "\"Guess who has taken more money than any Democrat from Wall Street?\" Grayson said, adding that the person was a \"certain second-term congressman from Florida who serves in the financial services committee and has no standing in the committee other than the simple right to vote.\"", "He continued: \"His name is Patrick Murphy, and he's taken more money from Wall Street than any other member of Congress other than the speaker and the majority leader.\"", "Murphy, of Jupiter, has only been in Congress since 2013, after he switched his party affiliation from Republican to Democrat. We wondered if it was really possible that Murphy received so much money from Wall Street, and why.", "For this fact-check we’re only looking at direct contributions made to Murphy’s campaign committee, not super PACs or other organizations that can accept unlimited contributions on his behalf.", "2016 contributions check out", "When looking at just the House, Grayson’s point checks out.", "But technically, Grayson’s statement to the editorial board said Murphy received more money than anyone else in Congress — which comprises two chambers. When you add senators into the mix, Murphy’s contributions from Wall Street-types rank No. 19 overall. (Not bad for 535 members, but still not No. 3)", "That said, it’s pretty clear from context that Grayson was limiting his statement to members of the House, and for some, the House is \"Congress\" and the Senate is the Senate.", "\"​While Congress can — and probably should — mean both chambers, many people use ‘Congress’ to refer to the House, and Senate to refer to the Senate,\" said Christopher Mann, an associate professor in the political science department at Skidmore College.", "Senators typically receive more Wall Street money because there are fewer of them, so they have more impact on legislation. In addition, senators have more expensive races and therefore ask for more money.", "Let’s go back to the House. Grayson was referencing a study by the Center for Responsive Politics, a nonpartisan research group that analyzes campaign donations, that showed Murphy received $1.41 million from the \"finance, insurance and real estate\" sector in the 2016 election cycle.", "That amount placed Murphy third among all members of the House, with Speaker Paul Ryan at No. 1 with nearly $2 million, and Majority Leader Kevin McCarthy, R-Calif., at No. 2 with $1.58 million.", "For similar fact-checks, the Center for Responsive Politics has said the best method to find how much money is being donated by Wall Street workers is to look at a subset of this category, called the \"securities and investment\" sector. This subcategory captures the greatest number of companies associated with Wall Street, without the other fields under the \"finance, insurance and real estate\" umbrella.", "Even if you look at it this way, Murphy still places third for those kind of contributions among members of the House. Murphy received $352,500 from the securities and investment sector, according to a 2016 analysis from the Center for Responsive Politics. Ahead of Murphy is Ryan with $831,272 and McCarthy with $497,850.", "Murphy’s money from Wall Street-related industries amounts to about 4.5 percent of the $7.71 million he’s received so far.", "Why all the love?", "So why does Wall Street support Murphy so much? A couple of reasons.", "As Grayson said, Murphy is a member of the House Committee on Financial Services. Even though he is not a ranking member, he is on two subcommittees that deal with laws related to capital markets and another on monetary policy and trade.", "These industries want to be on Murphy’s \"good side,\" Mann said.", "The bigger reason probably has more to do with Murphy’s goal and its location: The U.S. Senate, representing Florida. Florida is an \"expensive state\" for political races, Mann said, and Murphy is going to the industries he knows.", "Murphy has raised more money from three other sectors than Wall Street in his 2015-16 campaign. Murphy raised $721,969 from employees of law firms and lawyers, $595,238 from retirees, and $474,600 from the real estate industry.", "Also keep in mind that Grayson’s talking point only works for the 2015-16 election cycle. He didn’t specify a point in time for the donations. In his first bid for office in 2012, Murphy received $100,600 from the securities and investment sector. In his 2014 race, Murphy received $255,880 from the securities and investment sector, making him No. 22 among all House members.", "For the curious, the majority of Grayson’s $2.5 million in contributions comes from retirees, law firms and lawyers, miscellaneous issues, which includes a variety of groups that focus on a single-issue, non-profit institutions and real estate.", "Our ruling", "Grayson said Murphy has \"taken more money from Wall Street than any other member of Congress other than the speaker and the majority leader.\"", "Grayson is right that in the 2015-16 cycle, Murphy raised more money from employees of Wall Street-related fields than any other House member after the House speaker and majority leader. Murphy did not raise as much in his previous two congressional bids, but in context it is clear that Grayson was talking about their current race for the Senate.", "We rate this statement Mostly True.", "https://www.sharethefacts.co/share/8373c4d3-f23b-40ca-a0a0-0b0e845b7522", "PolitiFact Florida, \"Hillary Clinton: Barack Obama set new Wall Street fundraising record when he first ran for president,\" March 7, 2016", "The Atlantic, \"Patrick Murphy Rakes in Cash From Banking PACs,\" April 22, 2015", "Interview, Galia Slayen, Patrick Murphy spokesperson, July 5-6, 2016", "Email interview, David Damron, Alan Grayson spokesperson, July 5, 2016", "The Center for Responsive Politics, \"Securities and Investments,\" for 2012, 2014, and 2016, accessed July 5-6", "The Center for Responsive Politics, \"Securities and Investments\" for Top 20 Members, accessed July 5-6", "The Center for Responsive Politics, \"Finance/Insurance/Real Estate\" accessed July 5-6", "Interview, Viveca Novak, Center for Responsive Politics, July 6", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]