["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Senate hopeful Cory Booker supports a woman’s right to choose, according to his campaign website.", "But to hear two conservative groups tell it, Booker supports much more than choice.", "The American Commitment Action Fund, a conservative Political Action Committee behind the #BookerFAIL website, and the Susan B. Anthony List, an anti abortion-rights group, funded a new ad that claims Booker, a Democrat and Newark’s mayor, condones abortion at any stage of pregnancy and without restrictions.", "\"He supports late-term and partial-birth abortion and opposes safety regulations,\" the ad states.", "Conservative activist Steve Lonegan is Booker’s challenger in an Oct. 16 special election for a Senate seat left vacant after Democratic Sen. Frank Lautenberg’s death in June.", "The groups say Booker’s support of the Democratic National Committee’s platform gives credence to their claim, but the Truth-O-Meter has determined there’s a little more to this story than what the ad portrays.", "Let’s begin by reviewing how the groups came to identify Booker’s supposed support of late-term and partial-birth abortions, and opposition to safety regulations.", "Mallory Quigley, communications director for the Susan B. Anthony group, directed us to Booker’s support of the national committee’s platform.", "\"We’re taking a look at the Democratic Party platform which unequivocally supports a woman’s right to choose without any restrictions and regardless of ability to pay,\" Quigley said. \"That was supported by Booker and a host of others.\"", "Indeed, the ad shows a clip from Booker’s Sept. 4, 2012 address during a Planned Parenthood rally at the Democratic National Convention in Charlotte, N.C", "\"I was a co-chair for the DNC platform, when we affirmed a woman's right to choose,\" Booker said during the rally.", "So Quigley is correct that Booker and others supported the Democratic National Committee platform and women having the right to choose.", "Now let’s review the national committee’s platform on abortion.", "The platform makes no mention of specific procedures such as late-term or partial-birth abortion, and states support for a woman’s right to make decisions about her pregnancy, \"including a safe and legal abortion, regardless of ability to pay,\" according to a statement from the Democratic National Committee.", "The committee also supports a woman’s decision to carry a pregnancy to term.", "\"We strongly and unequivocally support a woman's decision to have a child by providing affordable health care and ensuring the availability of and access to programs that help women during pregnancy and after the birth of a child, including caring adoption programs,\" the platform states.", "Next, we checked with Booker campaign spokesman Kevin Griffis about the mayor’s stance on abortion.", "\"We can all agree that we want to prevent unintended pregnancies, and therefore the need for abortion,\" Griffis said in an e-mail. \"Fundamentally, Mayor Booker believes that a woman's health decisions should remain between her and her doctor. Mayor Booker supports Roe v Wade, which allows women the right to choose up to the point of viability.\"", "As for late-term and partial-birth abortions?", "\"Cory Booker does not oppose restrictions on post-viability abortions if exceptions are made for the health and the life of the mother,\" Griffis said, meaning the mayor would support a woman’s choice in that case to decide the fate of her pregnancy with her doctor.", "The American Commitment Action Fund did not respond to our request for comment.", "Our ruling", "A new ad targeting Booker claims, \"He supports late-term and partial-birth abortion and opposes safety regulations.\"", "A spokeswoman for one of the groups behind the ad notes that Booker’s stance on abortion comes from his support of the Democratic National Committee’s 2012 platform, which Booker co-chaired.", "The platform, though, makes no mention of late-term or partial-birth abortion, which a Booker spokesman agreed the Democrat would support a woman’s right to choose if her life or health is in danger. The platform says nothing else about safety regulations, which some states – such as Texas – have cited in attempts to ban abortion after a certain point in pregnancy.", "That makes this claim partially accurate, but lacking important details -- and that fits the definition of Half True.", "To comment on this story, go to NJ.com.", "NJ.com, Ad by conservative PAC attacks Cory Booker on abortion, Aug. 23, 2013, accessed Aug. 27, 2013", "#BookerFAIL: Too Extreme (Cory Booker), Aug. 24, 2013, accessed Aug. 27 and 30, 2013", "WashingtonPost.com, Conservative groups target Booker on abortion, Aug. 23, 2013, accessed Aug. 27, 2013", "LifeNews.com, Blistering Ad Exposes New Jersey Candidate Cory Booker’s Pro-Abortion Record, Aug. 23, 2013, accessed Aug. 27, 2013", "Mediaite.com, Cokie Roberts: DNC ‘Really Over The Top’ On Abortion, Risks ‘Alienating’ Pro-Life Dems, Sept. 9, 2012, accessed Aug. 27, 2013", "Philly.com, Lonegan-Booker rhetoric gathers momentum, Aug. 25, 2013, accessed Aug. 27, 2013", "Phone interview with Mallory Quigley, communications director, Susan B. Anthony List, Aug. 28, 2013", "E-mail interviews with Kevin Griffis, Booker for Senate spokesman, Aug. 29 and 30, 2013", "Democratic National Committee website and 2012 platform, accessed Aug. 29 and 30, 2013", "YouTube, Cory Booker speaks at the Planned Parenthood Rally at the Democratic National Convention, Sept. 4, 2012, accessed Aug. 30, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]