["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Standing on a stage in Iowa, amid all his competitors for the Republican presidential primary, former Arkansas governor Mike Huckabee made a bold claim. Of all the candidates, he said, he owned \"the most impressive\" education record.", "\"We raised standards, we measured and we held people accountable for the results,\" he said.", "It might seem an easy thing to prove. He had 10 years of executive leadership under his belt, compared to Mitt Romney's four and Rudy Giuliani's eight. The others, of course, had none, leaving this a contest where only three could compete.", "Huckabee also had a pretty hefty resume behind him, including past chairmanships of the Education Commission of the States and the Southern Regional Education Board. And under his watch, he pushed for or signed legislation that improved Arkansas teacher pay, curriculum standards and education funding.", "The results were quite remarkable. As the Education Trust reports, Arkansas was the biggest gainer in fourth-grade math and second best in eighth-grade math over seven years of the national exam known as the \"nation's report card.\"", "By the time of the debate, in fact, Huckabee had become the only Republican to be endorsed by the New Hampshire chapter of the National Education Association.", "But as is the case with all claims of being the best or worst of something, Huckabee's takes just a small amount of poking to find points that deflate the logic.", "First, consider Romney's record. Though in office a shorter time than Huckabee, Romney certainly can claim as strong, if not stronger, results. Massachusetts fourth- and eighth-graders rated first in the nation in both math and science on the \"nation's report card\" in both 2005 and 2007.", "Education Week rated Massachusetts as fifth on its 2007 \"chance for success\" index, compared to Arkansas' 39th.", "Second, consider Huckabee's critics, who say the former governor claims too much credit.", "Tom Kimbrell, a former superintendent who now heads the Arkansas Association of Educational Administrators, minces no words in assessing Huckabee's tenure: \"He was the governor of Arkansas, but as far as being part of the process, he was not present. There was no leadership at all.\"", "Kimbrell, who was knee-deep in many of the state's education issues during Huckabee's tenure, said the Legislature and the state's education organizations made things happen on most key issues.", "And when Huckabee did press his views, such as on arts education and consolidation of small school districts, Kimbrell contended the results were not positive. Consolidation did not save money as promised, though it did disrupt many small rural communities. And a mandate for arts education came without funding and ended up as part of a lawsuit.", "Gary Ritter, an associate professor of education and public policy at the University of Arkansas, put it this way: \"He took unpopular stands in favor of strategies he believed would work. I'm not sure if they worked.\"", "Did Huckabee act on education issues? Yes. Was his record the \"most impressive\" of the bunch? Romney certainly competes. So we rate Huckabee's boast Half True.", "Interview, Tom Kimbrell, executive director, Arkansas Association of Educational Administrators, Dec. 19, 2007", "National Assessment of Educational Progress,\n\nData Explorer 2007", "The Education Trust,\n\nStatement on the 2007 Math and Reading Results from The Nation's Report Card", "National Access Network of Columbia University,\n\nArkansas school finance litigation information\n\n, July 2007", "Concord (N.H.) Monitor,\n\nHuckabee has varied record on education; Teachers union endorses him\n\n, Dec. 12, 2007", "Education Week,\n\nQuality Counts 2007\n\n, Jan. 4, 2007", "Education Commission of the States,\n\nPutting the Arts Front and Center on the Education Agenda\n\n, July 2004", "The Encyclopedia of Arkansas History & Culture,\n\nMike Huckabee entry", "Huckabee for President Exploratory Committee, Inc.,\n\nMaking the grade in education", "Los Angeles Times, Giuliani's poor school marks, Sept. 13, 2007", "Boston Globe,\n\nNew governor to face test on student achievement\n\n, Sept. 5, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]