["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wagner’s campaign has received more than $3 million in donations from corporately-affiliated political action committees over the past decade.", "There are dozens of other candidates who have received more money from special interests in a single year and over the duration of a career in Congress.", "It’s all about following the money.", "The Democratic Congressional Campaign Committee ran an ad on the 2020 Priorities website calling out Missouri’s 2nd District Rep. Ann Wagner. Among other claims, it asserted:", "\"Wagner’s campaign has taken millions of dollars from special interests, more than almost anyone else in Congress.\"", "Money plays an ever-growing role in politics, so it’s worth looking into.", "According to DCCC spokesperson Courtney Rice, Wagner received more than $3 million from corporate political action committees throughout her political career, which started in the 2012 election cycle when she was elected. In that same vein, Wagner also received more than $2 million \"from the broader financial industry,\" according to Rice.", "We were directed to searches from MapLight and the Center for Responsive Politics, two non-partisan research groups that track campaign contributions, political donors and the influence of money on politics.", "According to MapLight, since 2011 Wagner received $3.1 million from \"corporate PACs,\" which MapLight defines as when a political action committee identifies its affiliation to a corporation in a \"statement of organization\" filed with the Federal Election Commission.", "The Center for Responsive Politics, also known by its website name OpenSecrets.org, tracks all kinds of PACs, and showed higher numbers. According to the center, Wagner received more than $6.4 million from a variety of PACs, including corporate political action committees. Of that $6.4 million, more than $2.6 million came from PACs affiliated with the finance, insurance and real estate industries.", "In addition, she received:", "$226,022 from registered lobbyists;", "$1.7 million from non-PAC sources in the finance, insurance or real estate industries;", "$547,291 from non-PAC law firms and lawyers.", "Wagner received $4.3 million from the financial/insurance/real estate sector, as coded by the Center for Responsive Politics from both individuals and political action committees.", "Out of the more than 1,500 U.S. representatives listed who have served between 1990 and 2020, Wagner ranked 82nd for most contributions received from this sector.", "This is behind other politicians from Missouri, including U.S. Sen. Roy Blunt and U.S. Rep. Blaine Luetkemeyer, who received more than $8 million and $5 million respectively during their terms in Congress.", "Senate Minority Leader Charles Schumer received the most money from the financial/insurance/real estate sector, over $28 million.", "In the 2020 election cycle, Wagner received $668,560 from corporate PACs, according to MapLight.", "She was No. 54 out of 435 members of the House when she received $56,471 from lobbyists this election cycle.", "Fellow Republican congressmen from Missouri — Billy Long, Jason Smith and Luetkemeyer — received more from lobbyists than Wagner in this cycle.", "From the financial/insurance/real service sector, Wagner was No. 20 out of all House members in this cycle as she received $1,137,674.", "In an ad, the Democratic Congressional Campaign Committee said, \"Wagner’s campaign has taken millions of dollars from special interests, more than almost anyone else in Congress.\"", "We can break this claim down into two parts:", "Wagner’s campaign has received millions of dollars from special interests.", "That amount received is more than almost anyone else in Congress.", "It’s true that Wagner’s campaign has received millions of dollars from corporate political action committees, more than the majority of elected representatives and senators. MapLight and the Center for Responsive Politics both confirm this.", "However, a significant number of senators and representatives have received more than Wagner from special interest groups, both in this election cycle and over the course of their respective political careers. For these reasons, we rate this claim as Half True.", "2020 Priorities, Ann Wagner Ad, accessed October 23, 2020", "MapLight, MapLight FAQs, accessed October 28, 2020", "Center for Responsive Politics, Ed Markey - Contributions by Industry, accessed September 28, 2020", "Center for Responsive Politics, Ann Wagner - Contributions by Industry, accessed September 28, 2020", "Center for Responsive Politics, 2020 Lobbying Spending, accessed September 28, 2020", "Center for Responsive Politics, Lobbying - Top Contributors to Federal Candidates, Parties and Outside Groups, accessed September 28, 2020", "Center for Responsive Politics, Contribution Sectors, accessed September 29, 2020", "Center for Responsive Politics, Money to Congress from the Finance/Insurance/Real Estate Sector - All Members of the House across All Cycles, accessed September 28, 2020", "Map Light, Ann Wagner Contributions from Corporate PACs in 2019-2020, accessed September 29, 2020", "Map Light, Ann Wagner Contributions from Corporate PACs 2011-2020, accessed September 28, 2020", "Email, Courtney Rice, Midwest Regional Press Secretary for the DCCC, September 27, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]