["About this rating", "With humanitarian and rescue operations underway in response to Tropical Storm Harvey in Texas, rumors are cropping up that could discourage the rescue of animals in danger.", "Snopes readers wrote in to ask about the following warning:", "State law says until [animals are] chest deep [in water or mud], they can’t be touched by anyone other than the owner, otherwise it’s horse theft. Even law enforcement officers can't pull them until that point.", "What the law says", "There is no law in Texas that specifically states when an animal rescue is or is not a theft -- either because of water and mud levels or any other circumstance.", "Stealing horses, cattle, \"exotic livestock\", or ten or more sheep, goats or pigs is a third-degree felony in Texas if the total value of the animals is up to $150,000. (Sec 31.03 e 5).", "While there is no provision in Texas law which allows an exception specifically for rescuing an animal from a flood, it is extremely unlikely -- almost unimaginable -- that someone who rescued an animal from death or injury would be prosecuted for theft (unless, of course, they later refused to return the animal to its owner).", "For one thing, prosecutors (usually district attorneys) have limited resources and have to prioritize only the most urgent and egregious crimes. A herd of cattle or a dozen horses being removed from their owner's possession during a devastating natural disaster of historic proportions would not fall into this category.", "Secondly, prosecutors generally avoid pursuing cases they are not likely to win -- and they are not likely to convince a jury to convict of theft a person who acted to save an animal's life. Moreover, such a case would probably bring the prosecutor, who is usually an elected official, negative attention.", "Jeremy Rosenthal, a Texas-based criminal defense attorney and former prosecutor at the Collin County District Attorney's office, told us that, according to Texas law, prosecutors can and should refuse to prosecute cases that do not advance the cause of justice. Article 2.01 of the Texas Code of Criminal Procedure says that the \"primary duty\" of prosecutors is \"not to convict, but o see that justice is done.\"", "Rosenthal calls this \"the common sense factor.\"", "A prosecutor's job isn't to hit somebody with the maximum that they can hit them with, it's to see that justice is done.", "However, even if a prosecutor - for whatever reason - decided to pursue an individual who had taken an animal from its owner in order to save its life, that individual would have several legal defenses available to them which would make conviction extremely unlikely.", "Both Rosenthal and Marcia Kramer, a lawyer and Director of Legal and Legislative Programs for the Animal Law Resource Center at the National Anti-Vivisection Society, both told us that the first line of defense in a case like this would likely be the defense of \"necessity.\"", "The Necessity Defense", "Texas Penal Code Section 9.22 offers a kind of blanket defense against criminal prosecution of many kinds, which would include theft:", "Conduct is justified if:", "(1) the actor reasonably believes the conduct is immediately necessary to avoid imminent harm;\n(2) the desirability and urgency of avoiding the harm clearly outweigh, according to ordinary standards of reasonableness, the harm sought to be prevented by the law proscribing the conduct; and\n(3) a legislative purpose to exclude the justification claimed for the conduct does not otherwise plainly appear.", "\"Necessity,\" Rosenthal says, \"is basically where there is greater harm that results from not taking the action.\"", "You could make the case - very clearly - that this horse, these cattle were going to die unless I acted.", "The 'Deprivation Defense'", "Both Kramer and Rosenthal also pointed out that the very definition of theft in Texas seems to exclude a good faith animal rescue.", "The Texas Penal Code (Sec. 31.03 a) states that \"A person commits an offense if he unlawfully appropriates property with intent to deprive the owner of property.\"", "However, \"deprive\" is defined as follows (Sec. 31.01 2):", "(A) to withhold property from the owner permanently or for so extended a period of time that a major portion of the value or enjoyment of the property is lost to the owner;\n(B) to restore property only upon payment of reward or other compensation; or\n(C) to dispose of property in a manner that makes recovery of the property by the owner unlikely.", "Kramer says:", "Since the rescue is not meant to deprive the owner of the enjoyment of the value of their property (animal), but rather to preserve the value (the life) of the animal, a rescue does not qualify as a theft under Texas law. The element of “intent” is absent from animal rescue.", "Rosenthal pointed out that if someone who rescued an animal later refused to return it to its owner, that could, of course, be treated as theft.", "Texas Penal Code.  \"Title 7. Offenses Against Property. Chapter 31. Theft.\"\r\n  Texas Legislature.  November 2015.", "Texas Penal Code.  \"Title 2. General Principles of Criminal Responsibility. Chapter 9. Justification Excluding Criminal Responsibility. Subchapter A. General Provisions.\"\r\n  Texas Legislature.  November 2015.", "Texas Code of Criminal Procedure.  \"Title 1. Code of Criminal Procedure. Chapter 2. General Duties of Officers.\"\r\n  Texas Legislature.  November 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]