["Rick Perry stresses his military service in a web ad noted by Politico on Feb. 27, 2015, describing himself as unique among milling presidential prospects. \"At this particular point in time, looking at the field,\" Perry tells listeners around a table, \"there’s only one individual that’s ever had the uniform of his country on—and that’s me.\"", "The Politico story went on: \"No other 2016 presidential contender — except for Sen. Lindsey Graham (R-S.C.), arguably a long-shot candidate — has served in the military.\" According to the Associated Press, Graham said in January 2015 he’d set up a committee to explore running for president.", "Perry’s biographical entry, on his website, says: \"Between 1972 and 1977, Perry served in the U.S. Air Force flying C-130 tactical airlift aircraft in Europe and the Middle East.\"", "And when the then-governor of Texas ran for president in 2012, he was nearly the only candidate with a military record, The Washington Post said in an Aug. 16, 2011, news blog post;  the only other candidate with military experience was Rep. Ron Paul, R-Texas, formerly a flight surgeon in the Air Force and the Air Force National Guard.", "Paul has since left the House and the presidential hustings, seemingly giving buoyance to this new claim.", "Prospects who have worn the uniform", "Perry aides did not respond to our inquiry about how Perry reached his \"only one individual\" conclusion. So we don’t know why he overlooked Graham, whose time as an Air Force lawyer is mentioned in his Senate biographical entry. By email, Graham spokesman Kevin Bishop said Graham was a senior prosecutor at Rhein-Main Air Force Base in Germany from 1984-1988. He left active duty in 1989, but remains a colonel in the Air Force Reserves, Bishop said.", "It's worth noting, too, that no candidate has already declared for president, a factor leading us to root our review of Perry's declaration in a list of Americans believed to be considering a run. The list is kept up by Politics1.com, a website run by Florida attorney Ron Gunzburger that tracks candidates for federal office.", "And it looks like besides Perry and Graham, a couple of possible longshot Republican hopefuls could be stumping with military experience:", "--Former Virginia Gov. Jim Gilmore was a U.S. Army counterintelligence agent in West Germany before entering the University of Virginia Law School, from which he graduated in 1977, according to a biographical entry posted by the National Governors Association. Gilmore’s entry in Who’s Who specifies  he was an Army agent in West Germany from 1971-74. In December 2014, Gilmore declined to rule out a presidential bid in an interview with The Washington Post.", "--Former United Nations Ambassador John Bolton, who like Perry spoke at the February 2015 Conservative Political Action Conference, spent time in the National Guard (signing up, he’s said, because he wanted to diminish his chances of dying in a rice paddy in Vietnam). In January 2015, The Boston Globe quoted Bolton, then about to venture to New Hampshire (home to the nation’s first-every-four-years presidential primaries), saying he was considering a run for president.", "Democrat fought in Vietnam", "In his video, Perry--who has said he’ll reveal if he’s running for president in May or June 2015--didn’t say if he was limiting his focus to Republicans. If not, he also overlooked former Democratic Sen. Jim Webb of Virginia, who was a Marine in Vietnam before later serving as Secretary of the Navy.", "Webb served in the Marine Corps from 1968 to 1972 as a second lieutenant and platoon commander in Vietnam, according to Who’s Who. In a video posted online as he launched his presidential exploratory committee in November 2014, Webb said: \"I came from a family of citizen-soldiers\" including his father, a 26-year pilot. \"My brother, my son and I all became Marines. I fought on one of the Vietnam war’s harshest battlefields,\" Webb said, adding that he spent eight years on active duty.", "Bush to Walker to Biden to O’Malley; no military service touted", "Biographical information posted online by more than a dozen other possible Republican candidates or groups didn’t reveal a personal military record for former Florida Gov. Jeb Bush; surgeon Ben Carson; New Jersey Gov. Chris Christie; Texas Sen. Ted Cruz; business executive Carly Fiorina; former Arkansas Gov. Mike Huckabee; Louisiana Gov. Bobby Jindal; Ohio Gov. John Kasich; former Alaska Gov. Sarah Palin; Florida Sen. Marco Rubio; Indiana Gov. Mike Pence; Kentucky Sen. Rand Paul; former Pennsylvania Sen. Rick Santorum; Michigan Gov. Rick Snyder; and Wisconsin Gov. Scott Walker.", "Similarly, possible Democratic aspirants--Vice President Joe Biden; former Secretary of State/former Sen. Hillary Clinton; and former Maryland Gov. Martin O’Malley--show no military background in their lives.", "What to make of all of this?", "Next, we queried a Duke University political scientist, Peter Feaver, who offered his opinion by email: \"If the field of prospects is limited to what Gov. Perry would plausibly consider to be the Republican top tier, meaning those who poll at his level or higher, then his statement is demonstrably true. None of the Republican candidates that are currently running ahead of Perry in the polls has served in uniform.\"", "Feaver continued: \"If the field of prospects is expanded to include every person who has expressed an interest in running for president, then of course some of that vast multitude have served in uniform.\"", "Our ruling", "In a web video, Perry said: \"At this particular point in time, looking at the field, there’s only one individual that’s ever had the uniform of his country on—and that’s me.\"", "Perhaps Perry’s definition of the \"field\" leaves out possible aspirants who haven’t surged in early polls. We also can see Perry making a case for being the best-known possible Republican nominee with military experience. However, there are others who might bid—a sitting senator, another former governor, a former ambassador and a Democratic former senator—who also were in the military.", "On balance, we rate his absolute statement Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "UPDATE, 5:10 p.m., March 4, 2015: We updated this story by adding details of Graham's military service, drawing on information provided by his spokesman. Our rating of the claim was not affected.", "News blog post, \"Rick Perry almost alone in military service,\" The Washington Post, Aug. 16, 2011 (accessed Feb. 27, 2015)", "Web page, \"About (Rick Perry),\" RickPerry.org website (accessed Feb. 27, 2015)", "Email, Peter D. Feaver, professor of Political Science, Duke University, March 2, 2015", "News story, \"Lindsey Graham Explores 2016 GOP Presidential Run,\" The Associated Press, Jan. 29, 2015 (accessed Feb. 27, 2015 on Huffington Post website)", "Web page, \"About Senator Graham,\" Sen. Lindsey Graham government website (accessed Feb. 27, 2015)", "News story, \"Gilmore raises national profile, won’t rule out presidential bid,\" The Washington Post, December 29, 2014 (accessed Feb. 27, 2015)", "News story, \"Never Shy, Bolton Brings a Zeal to the Table,\" The New York Times, May 1, 2005 (accessed Feb. 27, 2015)", "Telephone interview, Clint Riddle, staff assistant, U.S. Sen. Lindsey Graham, Washington, D.C., Feb. 27, 2015", "Web page, \"Virginia Governor James S. Gilmore III,\" National Governors Association (accessed Feb. 27, 2015)", "News story, \"Former UN ambassador Bolton still weighing presidential run,\" The Boston Globe, Jan. 27, 2015", "Database, Marquis Who’s Who (accessed Feb. 27, 2015)", "Web page, \"About Jeb,\" Right to Rise PAC (Jeb Bush group) (accessed Feb. 27, 2015)", "Paper, \"Ben Carson, A Healer Beyond the Operating Room,\" Johns Hopkins University, 2005", "Web page, \"Governor Christie,\" Office of New Jersey Gov. Chris Christie (accessed Feb. 27, 2015)", "Web page, \"About Senator Cruz,\" Office of U.S. Sen. Ted Cruz (accessed Feb. 27, 2015)", "Web page, \"Carly Fiorina, Chairman, Unlocking Potential Project,\" the Unlocking Potential Project (accessed Feb. 27, 2015)", "Web page, \"About Mike Huckabee,\" Mike Huckabee exploratory campaign website (accessed Feb. 27, 2015)", "Web page, \"Early Life, Gov. Bobby Jindal,\" Gov. Bobby Jindal’s political website (accessed Feb. 27, 2015)", "Web pages, \"About Gov. John R. Kasich,\"  Office of Gov. John R. Kasich; \"Meet John,\" Kasich-Taylor for Ohio website  (accessed Feb. 27, 2015)", "Web page, \"Her Story: Sarah Heath Palin,\" Sarah PAC website (accessed Feb. 27, 2015)", "Web page, \"About Rand,\" Sen. Rand Paul political website (accessed Feb. 27, 2015)", "Web page, \"Marco Rubio, Biography,\" Office of Sen. Marco Rubio (accessed Feb. 27, 2015)", "Web page, \"About the Governor,\" Indiana state government website (accessed Feb. 27, 2015)", "Web page, \"Arena Profile: Rick Santorum,\" Politico, undated (accessed Feb. 27, 2015)", "Web page, \"Meet the Governor,\" Office of Michigan Gov. Rick Snyder (accessed Feb. 27, 2015)", "Web page, \"About Gov. Walker,\" Office of Wisconsin Gov. Scott Walker (accessed Feb. 27, 2015)", "Video, \"A Message from Jim Webb, November 19, 2014,\" Jim Webb 2016 Exploratory Committee (accessed Feb. 27, 2015)", "Web page, \"Vice President Joe Biden,\" whitehouse.gov (accessed Feb. 27, 2015)", "Web page, \"Hillary Rodham Clinton,\" whitehouse.gov (accessed Feb. 27, 2015)", "Web page, \"Arena Profile: Martin O’Malley,\" Politico, undated (accessed Feb. 27, 2015)", "Email, Kevin Bishop, communications director, Office of U.S. Sen. Lindsey Graham, March 4, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]