["About this rating", "In September 2019, whistleblower allegations that U.S. President Donald Trump held back military aid to Ukraine in an effort to obtain damaging information on a political rival led to an impeachment inquiry and an ongoing scandal.", "It wouldn't be the 2010s if the fallout didn't include a conspiracy theory circulating in the right-wing media ecosystem. In this case, the conspiracy theory was given a major platform in the form of a tweet by Trump that his supporters widely shared:", "WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT? DRAIN THE SWAMP!", "— Donald J. Trump (@realDonaldTrump) September 30, 2019", "The claim originated on The Federalist website, which published a story on Sept. 27 that was not only inaccurate but played on the \"deep state\" conspiracy theory, an idea now popular among both fringe fanatics and White House officials alike. It posits that U.S. intelligence agencies are scheming against Trump.", "The Federalist story implied that the intelligence community changed existing rules so that the \"anti-Trump complaint\" could be filed on Aug. 12 using secondhand information. \"Between May 2018 and August 2019, the intelligence community secretly eliminated a requirement that whistleblowers provide direct, first-hand knowledge of alleged wrongdoings,\" The Federalist reported.", "The Federalist story included purported screenshots of previous and current versions of the Disclosure of Urgent Concern form. The current form allows the whistleblower to check a box indicating that the person either learned of the information firsthand or from others, whereas the previous form contained the following language:But as Julian Sanchez, senior fellow at the libertarian think tank Cato Institute, pointed out, even the previous version shown above doesn't say there was a “requirement that whistleblowers provide direct, first-hand knowledge of alleged wrongdoings.” The law has never required them to do so.", "Sanchez pointed out that the form pictured above contains a \"description of the Inspector General’s (IG) standard for making a credibility determination, as required by statute, within 14 days of the submission of a complaint. According to that guidance, the IG would not make a finding of credibility, and thus transmit the complaint to the [Director of National Intelligence], unless the DNI was in possession of direct evidence supporting the claim.\"", "It does not say, Sanchez continued, \"that whistleblowers may not submit reports based on secondhand knowledge, but rather that such reports will not be escalated to the DNI unless the IG can obtain more.\"", "The Intelligence Community Inspector General's Office (ICIG) was forced to issue a statement on Sept. 30 correcting the record. The statement read, in part:", "The Disclosure of Urgent Concern form the Complainant submitted on August 12, 2019 is the same form the ICIG has had in place since May 24, 2018, which went into effect before Inspector General [Michael] Atkinson entered on duty as the Inspector General of the Intelligence Community on May 29, 2018, following his swearing in as the Inspector General of the Intelligence Community on May 17, 2018. Although the form requests information about whether the Complainant possesses first-hand knowledge about the matter about which he or she is lodging the complaint, there is no such requirement set forth in the statute. In fact, by law the Complainant – or any individual in the Intelligence Community who wants to report information with respect to an urgent concern to the congressional intelligence committees – need not possess first-hand information in order to file a complaint or information with respect to an urgent concern. The ICIG cannot add conditions to the filing of an urgent concern that do not exist in law. Since Inspector General Atkinson entered on duty as the Inspector General of the Intelligence Community, the ICIG has not rejected the filing of an alleged urgent concern due to a whistleblower’s lack of first-hand knowledge of the allegations.", "In other words, the entire premise of The Federalist story is wrong. No requirement exists that whistleblowers provide firsthand knowledge of alleged wrong-doings, and changing the rules would have required an act of Congress.", "Tom Devine, legal director for the watchdog non-profit Government Accountability Project, called The Federalist story a \"shameless legal bluff.\"", "\"No bureaucrat has the lawful authority to change the rules of the game for whistleblower rights,\" Devine told us. \"Not even the president can change that unilaterally.\"", "So how did the claim come about? It's true that the wording on an explanatory form for whistleblowers was changed, but the rules were not. The ICIG's statement notes that the wording was revised because \"certain language in those forms and, more specifically, the informational materials accompanying the forms, could be read — incorrectly — as suggesting that whistleblowers must possess first-hand information in order to file an urgent concern complaint with the congressional intelligence committees.\"", "Devine added that government whistleblowers who report allegations of wrongdoing based on hearsay are still valuable resources in ferreting out government waste, corruption, and wrongdoing.", "\"If we restricted all credible government investigations to those with whistleblowers who have firsthand information, we'd cancel out 90% of law enforcement activity,\" Devine said. \"Whistleblower investigations are routinely based on hearsay.\"", "The ICIG's Sept. 30 statement additionally noted that the whistleblower's complaint did not contain only secondhand, \"unsubstantiated assertions.\" The whistleblower \"checked two relevant boxes: The first box stated that, 'I have personal and/or direct knowledge of events or records involved'; and the second box stated that, 'Other employees have told me about events or records involved.'\"", "In summary, the ICIG statement said:", "[The] whistleblower submitted the appropriate Disclosure of Urgent Concern form that was in effect as of August 12, 2019, and had been used by the ICIG since May 24, 2018. The whistleblower stated on the form that he or she possessed both first-hand and other information. The ICIG reviewed the information provided as well as other information gathered and determined that the complaint was both urgent and that it appeared credible. From the moment the ICIG received the whistleblower’s filing, the ICIG has worked to effectuate Congress’s intent, and the whistleblower’s intent, within the rule of law. The ICIG will continue in those efforts on behalf of all whistleblowers in the Intelligence Community.", "NBC News. \"Trump Admits to Discussing Biden in Scrutinized Talk with Ukrainian Leader.\"\r\n  23 September 2019.", "Office of the Inspector General of the Intelligence Community. \"Statement on Processing of Whistleblower Complaints.\"\r\n  30 September 2019.", "Carter, Brandon. \"READ: House Intel Committee Releases Whistleblower Complaint On Trump-Ukraine Call.\"\r\n  NPR. 26 September 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]