["This Facebook post is one of the many social media posts which sent the image around the internet again. The September 16, 2018 post has been shared more than 35,000 times with over 40,000 reactions.", "The caption reads: “It was considered the best photo of this century. A lioness and her cub were crossing the savannah but the heat was excessive and the puppy was in great difficulty walking. An elephant realized that his cub would die and carried him in his trunk to a pool of water walking beside his mother. And we call them wild animals.”", "A Google reverse image search showed that the photo originated in an April 1, 2018 tweet by Kruger Sightings, a service that crowdsources sightings and images of wildlife in South Africa’s Kruger National Park.", "“We were following a lioness carrying her cub & she was getting really tired. An elephant showed up wanting to help the lioness. The elephant put its trunk down, the cub jumped up & the elephant carried the lion cub!!\u2028S28, 3km from S entrance Tinged by Sloof Lirpa,” Kruger Sightings said in the tweet.", "“Sloof Lirpa”, is an anagram of “April Fools”, a clue that the image was one of the many spoof images and news articles put out on April 1, the day traditionally reserved in Western countries for playing practical jokes and spreading hoaxes.", "The original tweet was liked more than 300,000 times and retweeted more than 116,000 times, spawning further posts even months later such as the one cited above.", "Nadav Ossendryver, who runs the Kruger Sightings account, said in a tweet the next day that the image had been a hoax.", "“Yesterday I shared an April Fool's joke that went super viral. It reached a total of 6million people with an engagement coming in every 0.5 seconds!”", "Ossendryver told AFP that he had photoshopped the image.", "\"I was the photoshopper :) At the time it reached around 40m people with in a few days. Now probably hundreds of millions because it's gone viral in so many places, even made news papers.\"", "Additional reverse image searches found two of the photographs which were spliced together to help create the image: the lioness and the elephant.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]