["“The central gov’t has taken custody of all the masjids in Kashmir and see yourself, why Masjids are taken into custody.”", "The above message has been circulated on social media and WhatsApp along with a set of photographs. According to the claim, a large stash of arms was recovered from mosques in Kashmir.", "The central gov’t has taken custody of all the masjids in Kashmir and see yourself, why Masjids are taken into custody. pic.twitter.com/YjcxJaBJLC", "— 🚩हर हर महादेव (ब्रजेश सिंह अखण्ड भारत)🇮🇳🚩 (@Brajesh1980Bs) August 7, 2019", "The same has been posted by several individual users on Facebook.", "The photos with the accompanying narrative have also been circulated on WhatsApp.", "The claim that the Central government has ‘taken custody of mosques in Kashmir’, is utterly false. There has been no such development. Insofar as the photographs shared with this false narrative are concerned, Alt News found that they are old and pertain to separate incidents, none of which are in relation to Kashmir.", "Alt News reverse-searched the above image on Google, and found a post on Tumblr with this photograph, dated March 2019.", "Alt News reverse-searched the above picture and found a tweet by Shamli (UP) police which carried this photograph. According to the tweet, the photograph is representative of arrests which took place after a raid at a madrasa, in which forged documents, along with foreign currency and mobile phones were seized. The incident is of July 2019.", "शामली पुलिस ने 04 विदेशियों व तीन विभिन्न मदरसों से संबंधित 03 नफर मोहतमिम/मदरसा संचालक समेंत 07 संदिग्ध किये गिरफ्तार,नाजायज दस्तावेज,देशी-विदेशी मुद्रा समेत कई मोबाईल फोन बरामद। @Uppolice @policenewsup @adgzonemeerut @digsaharanpur pic.twitter.com/BeCYFbbZi3", "— Shamli Police (@shamlipolice) July 29, 2019", "The above photograph is from a raid which took place at a hotel which was running an illegal arms racket, on the Ahmedabad-Rajkot highway in March 2016.", "Alt News reverse-searched the above image on Google and came across an article by India Today which stated that this photograph is actually from a ‘kirpan’ factory in Patiala, Punjab. According to the article, the photo is from the ‘Khalsa Kirpan’ factory in the city. Alt News contacted ‘Khalsa Kirpan’ factory and confirmed that the picture is indeed from the factory at Patiala.", "In conclusion, the claim that the Central government has taken custody of mosques in Kashmir, is false. Moreover, the pictures circulated along with the claim are old and unrelated. Earlier, the same photographs were shared with the false narrative that these weapons were seized from a mosque in Rajkot, Gujarat.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]