["About this rating", "On 3 March 2017, the web site USPOLN published an article which contained several quotes ostensibly uttered by Senator Paul Ryan, including one statement in which he supposedly asserted about birth control that \"If there was a legitimate way to have intercourse and not get pregnant, God would have included it in His holy books\":", "This article was framed as presenting portions of a discussion between Ryan and CNN host Jake Tapper, and the introductory paragraph replicated a legitimate exchange between Ryan and Tapper about health care reform and birth control that took place on 13 November 2016:", "House Speaker Paul Ryan (R-WI) refused to say if some women would lose access to birth control benefits after Republicans repeal President Barack Obama’s health care reform law. The Wisconsin Republican promised during an interview on CNN that the repeal of Obamacare would lower the costs of health care by providing “vouchers” to poor Americans. CNN host Jake Tapper noted that many women were paying nothing for birth control thanks to an Affordable Care Act mandate. “Is that going to end?” he wondered. “Look, I’m not going to get into all the nitty-gritty details of these things,” Ryan replied curly.", "The remainder of the article, however, was completely fabricated.", "For instance, Paul Ryan never said this:", "“I’m not a preacher, nor am I a holy man, but the fact to the matter is that Obamacare is bad for our economy, it’s bad for Americans, both poor ones and ones who aren’t, overall, it’s a bad program and a bad piece of legislation and that’s why it’s gotta go,” Ryan argued stubbornly, all the while ignoring the question. “And if our biology allowed for a safe way to have intercourse, if we were meant to have intercourse completely naturally and not get pregnant because of it, then God would have included something about it in one of his Holy Books. Now, I haven’t found anything on the subject — and not for lack of looking, Jake — have you, perhaps?”", "Or this:", "“Now, how would you feel, Jake, if someone were to take a huge chunk of your hard-earned money and use it to give something to someone you’ve never met?” Ryan asked the host. “And the worst part is — nobody asked Americans whether or not they agree to their taxes being raised to help people they don’t know, that very fact goes against the essence of capitalism. It’s not effective and it’s not efficient, which makes it the wrong solution from the start. That’s why it needs to be repealed. The other part of the reason why women shouldn’t be allowed to use birth control at all is the fact that, in doing so, they’re committing murder and that goes against everything this country stands for.”", "Ryan didn't say any of this during his CNN interview with Jake Tapper on 13 November 2016, or at any other time and place.", "USPOLN bills itself as a \"hybrid\" site that publishes a mixture of \"satire\" and real news, but unlike other hybrid sites such as Newslo, which allow users to click a button revealing which portions of articles are true and which are not, USPOLN provides readers with no mechanism for distinguishing between fact and fabrication. If they did, the introductory paragraph would have been highlighted as \"true\" while the remainder of the article would have been marked as \"satire.\"", "The actual interview between Tapper and Ryan can be viewed below:", "Edwards, David.   \"Paul Ryan: Access to Birth Control for Women Is ‘Nitty-Gritty Detail’ Not Worth Talking About.\"\r\n    Raw Story.   16 November 2016.", "USPOLN.   \"Paul Ryan: 'If There Was A Legitimate Way To Have Intercourse And Not Get Pregnant, God Would Have Included It In His Holy Books.'\"\r\n    3 March 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]