["About this rating", "One of the most popular historical exhibits at Mount Vernon, originally the estate of the first President of the United States and now a monument to his life and legacy, is a set of the great man's dentures. The crude, handmade prosthesis, comprising both upper and lower teeth, is displayed in a circular glass case permitting a 360-degree view. The majority of Mount Vernon's one million visitors per year, one presumes, pause to stare at the famous choppers for at least a moment before moving on to the table settings.", "The fascination with George Washington's false teeth could be attributable to various factors — that they're a medical curiosity from the 18th century, when dentistry was still just this side of barbaric; that they're an intimate vestige of the man himself, letting us feel closer to him; or, maybe, that we're all just eager to see if the scuttlebutt we heard and repeated as kids is true: that the Father of Our Country had wooden teeth.", "The exhibit does not disappoint. One look at the contraption itself, which is actually made out of metal, ivory, and real teeth (both animal and human), is enough to see that it wasn't carved out of wood:", "Plus, there's a plaque that lays out the facts in black and white:", "Dentures\nWorn by George Washington", "Lead base fitted with cow and human teeth, elephant ivory, brass, and steel. ca. 1775-1799.", "Although George Washington brushed his teeth regularly, by the time he took the oath of office as president at age 57, he was wearing full dentures. Contrary to popular myth, Washington's false teeth were not made of wood but of human and cow teeth as well as elephant ivory. The dentures required frequent adjusting to function naturally, and Washington repeatedly sent them to John Greenwood, his dentist in New York City, for repairs.", "As was common at the time, the dentures were ill-fitting, awkward, and sometimes painful. They distorted Washington's appearance, mainly by making his lower lip protrude, as can be seen in contemporaneous portraiture of the first president. According to historian Michael Beschloss, his teeth were an embarrassment to him:", "He once pleaded with his dentist, John Greenwood, by letter, to avoid any change to the denture \"which will, in the least degree force the lips out more than now do, as it does this too much already.\" Members of his cabinet sadly noted how rarely the tight-lipped president smiled or laughed. Others insisted that his embarrassment about his dentures, which sometimes caused him to hiss as he spoke, made him reclusive.", "Washington was plagued by dental problems throughout most of his adult life. He attributed the misfortune to \"cracking of walnuts in his youth,\" his friend John Adams wrote, though heredity must have played a part, as well. Bad hygiene, too, though Washington wouldn't have been entirely to blame. \"It’s not that George Washington was sloppy about dental hygiene,\" John L. Smith notes in Journal of the American Revolution, \"it’s just that dental hygiene was practically non-existent in the late eighteenth century\":", "In fact, in some social groups, taking care of your teeth was even considered effeminate or vain. But Washington was very wise about the message an image can send, and knew that in the Continental Congress, and as commander-in-chief and president, he had to look the part of a leader ... which meant at least having teeth. Aside from the possible constant pain Washington endured from his bad teeth, he stayed on a constant life quest to (simply said) — have teeth in his mouth. And he paid a lot for professional dental care all through his lifetime.", "George Washington wore several different sets of dentures over the course of his lifetime, none made of wood. Instead, the dentists treating him would have used the cutting-edge materials of the time: bone, ivory, lead, brass, gold, and the castaway teeth of horses, donkeys, cows, and, yes, human beings. Washington is said to have saved his own extracted teeth for future use in dentures. A longstanding rumor that Washington purchased teeth from his slaves may be true, as well, Michael Beschloss writes:", "According to his account books, in 1784, emulating some of his affluent friends, he bought nine teeth from unidentified \"Negroes\" — perhaps enslaved African Americans at his beloved Mount Vernon; the price was 122 shillings.", "As to how and why the rumor of Washington's wooden teeth took hold in the first place, no one knows for sure, but there are two main theories, both based on the assumption that his dentures must have looked like they were made of wood. One holds that they turned mottled and brown with age, the other that their \"woodiness\" was due to Washington's habit of drinking fortified wine:", "Ivory and bone both have hairline fractures in them, which normally can’t be seen. With Washington’s fondness for Madeira wine, a very dark wine, over time the darkness of the wine started to darken the false teeth of the dentures. Then the thin fractures in the bone started to darken even more than the rest of the tooth, making the lines look like the grain in a piece of wood \"that misled later observers.\"", "Two hundred fifty years later, we're still talking about Washington's \"wooden teeth.\" Like the cherry tree he never chopped down as a child, they are forever enshrined in American legend.", "Beschloss, Michael.    \"George Washington's Weakness: His Teeth.\"\r\n    The New York Times.    28 April 2014.", "Bingham, Warren L.    George Washington's 1791 Southern Tour.\r\n    Mount Pleasant, NC: Arcadia Publishing, 2016.    ISBN 9781625857538.", "Smith Jr., John L.    \"Drilling Holes in George Washington's Wooden Teeth Myth.\"\r\n    Journal of the American Revolution.    5 October 2014.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]