["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An attack ad, which was released in mid-July, states that Montana Gov. Steve Bullock, a Democratic candidate for the Senate, supports a government-run health care program that would wreak havoc on the state’s health care infrastructure.", "\"Bullock’s health care plan will force rural hospitals to close. Medicare as we know it will change, replaced by a government-run program with fewer doctors and longer wait times,\" says the narrator in the dark and grainy advertisement paid for by the National Republican Senatorial Committee (NRSC).", "Bullock is running against first-term incumbent Republican Sen. Steve Daines in a race viewed as a toss-up. Given the COVID-19 pandemic, both candidates have been focusing on health issues.", "Because this race is critical to determining whether Democrats or Republicans control the Senate, and considering that its themes are likely to be repeated in many congressional campaigns, we thought it was important to check the ad’s validity.", "We first asked the NRSC for the evidence on which the ad was based. A spokesperson pointed to Bullock’s support for a \"public option\" health plan and provided us with a report predicting this proposal’s negative impact on rural hospitals, as well as quotes from both Republicans and Democrats about how the public option could lead to the eventual implementation of a \"Medicare for All\" program. (Medicare for All refers to the single-payer health system, advocated by Vermont Sen. Bernie Sanders, which would eliminate private insurance and replace it with a government-run health care system.)", "We also reached out to the Bullock campaign for its response.", "In a statement, Sean Manning, spokesperson for Montanans for Bullock said, \"The claims in this ad are false. Montana hasn't lost one rural hospital under Governor Bullock, and he will continue to support policies that protect rural hospitals while making affordable healthcare available to all Montanans in the Senate.\" (According to the University of North Carolina Sheps Center for Health Services Research, no rural hospitals have closed in Montana since 2005.)", "The ad vaguely refers to Bullock’s \"health care plan\" but doesn’t say outright what the candidate supports.", "According to Bullock’s campaign website, he supports the creation of a public option.", "A public option is generally defined as a health plan administered by the federal government that exists alongside and competes with private health insurance plans on the Affordable Care Act exchanges. Public option proposals differ by political candidate, and can take various forms, including Medicare or Medicaid buy-ins as well as a new government-run entity.", "Opponents of such plans say that a public option, which would have the scale and regulatory power of the federal government to set lower reimbursement rates to providers, would have a competitive advantage and could put private insurance companies out of business. This would leave Americans with only one choice ― government-backed insurance. But that conclusion is debatable. Some health care scholars argue a public option would increase competition, leading to expanded access to health coverage, lower health care costs and lower premiums for consumers.", "In the end, the outcomes from implementing this approach are difficult to predict unless a specific plan is released, said Benedic Ippolito, a health care research scholar at the American Enterprise Institute.", "\"Things can be radically different based on what the public option looks like,\" said Ippolito. \"The two big variables are, who is covered? And how does that insurer actually pay health care providers? You can imagine two public options looking totally different.\"", "Now to tackle the first part of the ad, which says that \"Bullock’s health care plan will force rural hospitals to close.\"", "This argument stems from the idea that a public option would lead to lower reimbursement rates, based on the model provided by Medicare, which pays less than private insurance. And, because many rural hospitals are already severely financially strapped, lowered payments would do them in, the argument goes.", "When we asked the NRSC for the evidence to support this position, a spokesperson provided an August 2019 study conducted by Navigant, a consulting firm. The study was commissioned by the Partnership for America’s Healthcare Future, a health industry coalition including  drugmakers, insurance companies and private hospitals. The organization opposes Medicare for All and a public option.", "The study modeled what would happen to rural hospitals if three separate public option approaches were implemented.", "While it found that a public option could, depending on the scenario, cause a revenue reduction for rural hospitals of between 2.3% and 14%, the study reached these findings by assuming that the hospitals would be paid at Medicare rates.", "Bullock’s campaign website, though, under his rural health care policy proposals, specifically states: \"We need a public option that includes higher reimbursements for rural hospitals.\"", "We asked the Bullock campaign if it could provide us with details about what the \"higher reimbursement\" rate would be based on. It declined. A campaign staffer told us Bullock would support a public option that pays rural hospitals above Medicare rates. Since the reimbursement rates would be higher than Medicare’s, the assumptions in the Navigant study cannot be applied here.", "\"If the public option is a reasonably generous payer, that won’t be the end of rural health care,\" said Ippolito. \"But, you can easily imagine due to budgetary concerns, a public payer could have a lower reimbursement, which would have consequences.\"", "Some health policy experts argue that a public option would help rural hospitals by increasing the number of people in rural areas who have health insurance.", "This would \"benefit rural hospitals, since getting virtually nothing from uninsured patients is worse than getting a reasonably good rate from the public option,\" said Gerard Anderson, a professor of health policy and management at Johns Hopkins University in Baltimore.", "Next, we’re on to the NRSC ad’s second claim: \"Medicare as we know it will change, replaced by a government-run program with fewer doctors and longer wait times.\"", "As several experts pointed out, this sentence doesn’t make a lot of sense. Medicare is already a government-run program.", "Also, the design of most public option proposals thus far keeps Medicare and the public option as two separate government programs, said Linda Blumberg, a health policy analyst at the Urban Institute, a think tank.", "The NRSC clarified its position and told us it was referring to the idea that a public option would stifle competition in the insurance market, eventually leading to only government-run insurance or Medicare for All. The evidence the NRSC provided to support this claim were quotes from a selection of Republicans, Democrats, professors, and experts from conservative think tanks saying that the public option is a stepping stone to this single-payer approach.", "But others suggest that’s a big leap in logic.", "\"I think that analysis is almost surely wrong,\" said Matthew Fiedler, a fellow with the Brookings Institution. \"In a world where there is a public option, the negotiating dynamics between insurers and providers would change substantially.\"", "This would likely create an environment in which private insurers could negotiate lower rates and providers would have to respond to that change in revenue with more efficiencies, he added. However, depending on how a public option plan is structured -- specifically if providers can opt out of participating -- some in-demand providers may choose to stay in private-plan networks where they could negotiate higher payments. This would keep private plans competitive.", "\"I don’t think it’s reasonable to argue that a public option would drive all other plans out of the market,\" Fiedler said.", "Again, Ippolito said it all depends on how the public option program is designed, and he allowed that if providers and hospitals were paid at Medicare rates, the public option would have a huge competitive advantage over commercial insurers because it would be paying out less for services and then could charge lower premiums, and \"there’s no question in the short run, that it would be disruptive.\"", "As we noted earlier, the prediction of any outcome is difficult without specifics. Without details of Bullock’s public option plan, it’s misleading to characterize the outcome of the public option as surely leading to Medicare for All.", "The race between Bullock and Daines is indicative of a trend occurring in campaigns across the country. Republicans often paint Democrats as left of the general public and health care has often been one of the issues the GOP highlights in that effort.", "In this case, the NRSC ad links  Bullock to Medicare for All, despite his expressed support for a public option. Sean Manning, Bullock’s campaign spokesperson, said the governor does not support Medicare for All.", "Jeremy Johnson, an associate professor of political science at Carroll College in Helena, Montana, said that even before COVID-19 became a major campaign issue, Daines, echoing a Trump theme, had pushed the idea that he stood for freedom versus socialism.", "\"One of the things [Daines] gives as a symbol of socialism is Medicare for All,\" said Johnson. \"Because Bullock says he favors a public option, there is a conflation of that on the Republican side to mean Medicare for All.\"", "But the public option and Medicare for All are not the same program and it’s misleading to lump them together.", "The NRSC claimed in a television ad that Steve Bullock’s support for the public option would cause rural hospitals to close.", "While the NRSC did provide us with one study that offered support for its rural hospital claim, the study was industry-funded and based on broad assumptions that don’t accurately reflect positions outlined on Bullock's website. Thus, this claim doesn’t stand up.", "The second part of the ad asserts that the public option would lead to the implementation of Medicare for All. While supporters and critics debate how a public option would affect the private health insurance market and some on both sides consider it a \"glide path\" to a single-payer health care system, it’s too big of a jump to say it would definitely trigger this outcome.", "We rate this False.", "Cato Institute, \"Kamala Harris Admits \"Medicare for All\" Would Kill Private Insurance ― But So Would a Public Option,\" Jan. 31, 2019.", "Congressional Budget Office, \"An Analysis of Private-Sector Prices for Hospital Admissions,\" April 2017.", "Email interview with Gerard Anderson, professor of health policy and management, Johns Hopkins University Bloomberg School of Public Health, Aug. 7, 2020.", "Email interview with Linda Blumberg, institute fellow, Health Policy Center at the Urban Institute, Aug. 10, 11, 2020.", "Email statement from Sean Manning, spokesperson for Montanans for Bullock, Aug. 10, 2020.", "Forbes, \"Want to Put a Stake in Obama’s Legacy? Try the Public Option,\" Aug. 25, 2016.", "Health Affairs, \"Differences Between Public and Private Hospital Payment Rates Narrowed 2012-16,\" January 2020.", "Health Affairs, \"Varying Trends in the Financial Viability of US Rural Hospitals, 2011-17,\" June 2020.", "The Heritage Foundation, \"The \"Public Option\": Government-Run Health Care on the Installment Plan,\" Feb. 12, 2020.", "The Hill, \"GOP Senator Introduces Resolution to Formally Condemn Socialism,\" July 29, 2019.", "Kaiser Family Foundation, \"10 Key Questions on Public Option Proposals,\" Dec. 18, 2019.", "Kaiser Health News, \"Pandemic’s Bumps and Backlash Shape Montana Race Poised to Steer US Senate,\" Aug. 5, 2020.", "KTVH News, \"TV Ad Watch: Does Bullock Support ‘Government Controlled Health Care’?,\" July 20, 2020.", "National Republican Senatorial Committee, \"NEW AD: Steve Bullock’s Plan for Government-Controlled Health Care,\" July 17, 2020.", "National Republican Senatorial Committee tweet, July 17, 2020.", "Navigant, \"The Potential Impact of a Medicare Public Option on U.S. Rural Hospitals and Communities: A Scenario Analysis,\" August 2019.", "The New Republic, \"The Public Option Bait and Switch,\" Oct. 17, 2019.", "The New York Times, \"The Lessons of Washington State’s Watered Down ‘Public Option,’\" June 27, 2019.", "OpenSecrets News, \"Big Pharma, Insurers, Hospitals Team Up to Kill Medicare for All,\" March 7, 2019.", "OpenSecrets News, \"Healthcare Giants Attack 2020 Democrats’ Healthcare Plans With Iowa Ad Blitz,\" August 12, 2019.", "Partnership for America’s Health Care Future, \"About Us,\" Accessed Aug. 12, 2020.", "Phone interview with Matthew Fiedler, fellow, USC-Brookings Schaeffer Initiative for Health Policy, Aug. 7, 2020.", "Phone interview with Benedic Ippolito, resident scholar, American Enterprise Institute, Aug. 10, 2020.", "Phone interview with Jeremy Johnson, associate professor of political science, Carroll College, Aug. 10, 2020.", "PolitiFact, \"John Delaney’s Debate Claim That ‘Medicare for All’ Will Shutter Hospitals Is Unsubstantiated,\" June 27, 2019.", "Politico, \"The Army Built to Fight ‘Medicare for All,’ Nov. 25, 2019.", "RealClear Policy, \"The Heavy Hand of the Public Option,\" June 18, 2019.", "Steve Bullock Campaign Website, \"On the Issues ― Healthcare,\" accessed Aug. 12, 2020.", "Steve Daines tweet, July 17, 2019.", "University of North Carolina Cecil G. Sheps Center for Health Services Research, \"172 Rural Hospital Closures: January 2005 to Present,\" accessed Aug. 13, 2020.", "Vox, \"Sen. Murphy Thinks He Can Build an On-Ramp to Single-Payer Health Care,\" Sept. 8, 2017.", "The Washington Post op-ed, \"I’m the Administrator of Medicaid and Medicare. A Public Option Is a Bad Idea,\" July 24, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]