["Akombe announced her resignation from the IEBC last October and fled to the United States, saying the re-run of the presidential election could not be a credible vote. It was the latest twist in the election drama after the Supreme Court ruled that the election held the previous election was invalid. As reported by AFP here, she claimed her life was in danger.", "This article published on June 24, 2019 on the Kenyan-Report website claimed that Akombe had been found strangled in her New York apartment.", "“Breaking News: Roselyn Akombe found dead in her house in U.S.A,” the headline read.", "Among other places, the story has been posted in numerous Facebook groups, some of which have more than 150,000 followers.", "According to social media analysis tool CrowdTangle, the article has racked up more than 80 shares and 2,600 interactions on Facebook. We’ve archived one of the Facebook posts here.", "But hours after the article began spreading online, Akombe responded on Twitter to confirm that she was very much alive.", "Thank you Leon. I was chairing a meeting, unaware of my demise, thus the delay in responding to your calls. And those of many others I have been unable to respond to personally. Thank you for the ❤️", "Akombe, who now works for the United Nations, followed up with a photograph of herself and a second tweet.", "I’m grateful and overwhelmed by your calls and messages of support. I don’t take any of them for granted. And to those who mourned me, I am really sorry for the pain caused to you. But I am equally touched by the kind words you had for my ‘obituary’?????", "Akombe told AFP via WhatsApp that she has since received countless messages from concerned family and friends.", "\"I hope at some point we'll figure out a way of minimizing the impact these things have on families. The worst in my case was actually not just Facebook but WhatsApp given the large number of these groups and its accessibility to many,\" she said.", "Akombe's employers also confirmed that the death claim was bogus.", "\"I have not seen the reports but I can confirm that Ms. Akombe works for the UN Department of Political and Peacebuilding Affairs in New York. And she is very much alive,\" a UN spokesman told AFP.", "Rumours of the deaths of prominent Kenyan personalities are not a new occurrence. Just in April AFP debunked here the false news of the death of Ken Okoth, an MP who is battling cancer.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]