["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Heather Brown, right, is tested for COVID-19 at a new walk-up testing site at Chief Sealth High School on Aug. 28, 2020, in Seattle. (AP)", "The World Bank created a list of exports of COVID-19 testing equipment, drawing from an older list of existing diagnostic testing equipment.", "Some equipment now used for COVID-19 testing existed prior to 2019 and was marked as being available before that year.  But COVID-19 tests did not exist in 2018.", "A popular Facebook post erroneously cites a list of medical exports as evidence that coronavirus tests existed prior to the pandemic.", "A Sept. 8 post shows a screenshot of a database from an online portal maintained by the World Bank. It shows a list of products described as \"COVID-19 diagnostic test instruments and apparatus\" next to the countries that export them.", "But the year of those exports, 2018, predates the coronavirus.", "\"Hello!! Is anyone paying attention?\" reads red text over the screenshot.", "\"People wonder why we question s---,\" the poster wrote in a caption.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "Similar posts have been shared thousands of times, including by Ben Swann, a former television news reporter with a history of making false claims. The rumor appears to have originated on 4chan, a fringe internet platform.", "We’ve previously fact-checked misinformation that suggests the coronavirus was planned or manipulated, but we wanted to look into this list of exports. We reached out to the original poster for their evidence, but we haven’t heard back.", "The table cited in the post is real, but it does not show exports of COVID-19 tests in 2018. The table has been updated to clarify that the page refers to medical devices that weren’t specifically designed for the coronavirus. Several other fact-checkers have debunked Facebook posts that misconstrue the data.", "First, let’s take a closer look at the portal, which is called World Integrated Trade Solution (WITS).", "The World Bank maintains the portal in partnership with the United Nations Conference on Trade and Development. The website offers a compilation of trade and tariff data from different UN divisions and other international organizations, such as the World Trade Organization. It allows users to search for things like the top products exported by certain countries.", "The table shown in the Facebook post lists the top exporters of \"instruments used in clinical laboratories for in vitro diagnosis\" and \"colorimetric end tidal CO2 detectors,\" which is the scientific name for a carbon dioxide detector. CO2 detectors help doctors monitor intubated patients.", "Both of those things existed prior to the coronavirus pandemic. So why was the table previously billed as a list of \"COVID-19 Diagnostic Test\" exporters?", "It has to do with guidance from the World Health Organization and a related database.", "In April, the WHO and the World Customs Organization classified CO2 detectors and diagnostic testing equipment, along with hand sanitizer and surgical masks, as critical to fighting COVID-19. Both received the same WCO code — \"902780\" in the Facebook post. COVID-19 test kits were assigned two different codes.", "The WHO gave some products less technical, coronavirus-related descriptions to make them easier to track. But the broad classification, which was applied to some testing equipment that predated COVID-19, carried over to a WITS database of products related to the virus.", "RELATED: No, the CDC did not ‘quietly adjust’ US coronavirus deaths", "\"The WITS team created a special database using the WCO list (along with the new WHO/WCO labels/descriptions),\" the World Bank said in a Sept. 8 statement. \"The goal was to put information about key COVID-related medical supplies in one easy-to-find place.\"", "That resulted in what many Facebook users are confused about: a list of export data about diagnostic testing instruments that appear to predate the coronavirus. The World Bank has since revised the title of the table to read: \"Medical Diagnostic Test instruments and apparatus.\"", "\"In light of misinterpretations that have occurred in recent days, the labeling in the WITS site has been updated to reflect the reality: COVID-19 tests did not exist before 2020,\" the organization said in its statement.", "The Facebook post is inaccurate. We rate it False.", "CrowdTangle, accessed Sept. 9, 2020", "Facebook post, Sept. 6, 2020", "Facebook post, Sept. 8, 2020", "Food and Drug Administration, In Vitro Diagnostics, accessed Sept. 9, 2020", "Health Feedback, \"COVID-19 test kits were not purchased in 2017 and 2018; claim is based on mislabeled data,\" Sept. 8, 2020", "MedTronic, Nellcor™ Adult/Pediatric Colorimetric CO2 Detector", "StatPearls, \"Carbon Dioxide Detector,\" Aug. 3, 2020", "The World Bank, \"Statement on Trade Data Related to COVID-19-Related Medical Supplies,\" Sept. 8, 2020", "World Customs Organization, \"HS classification reference for Covid-19 medical supplies 2nd Edition,\" April 9, 2020", "World Customs Organization, \"HS Nomenclature 2017 edition, Chapter 90: Optical, photographic, cinematographic, measuring, checking, precision, medical or surgical instruments and apparatus; parts and accessories thereof\"", "World Integrated Trade Solution, About WITS, accessed Sept. 9, 2020", "World Integrated Trade Solution, Medical Diagnostic Test instruments and apparatus (902780) exports by country in 2018, accessed Sept. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]