["The Affordable Care Act is helping people in Ohio get the treatment they need for opioid addiction, said U.S. Sen. Sherrod Brown, D-Ohio.", "\"Right now in Ohio 200,000 people are getting opioid treatment because they have insurance under the Affordable Care Act,\" he said in an April 9 speech to the City Club of Cleveland.", "This is a common talking point by Brown, who will face the winner of the May 8 Republican primary that features U.S. Rep. Jim Renacci and businessman Mike Gibbons, among other candidates.", "Ohio is one of the states that expanded Medicaid as part of the 2010 federal health care law, and is one of the hardest hit states in the nation by the opioid epidemic. Experts have said that the program for the poor has helped treat those with opioid addiction.", "Brown was citing a valid study about the Affordable Care Act, but he didn’t precisely explain what the researchers found. We learned it is difficult to pinpoint how many have gotten this type of treatment as a result of the law.", "Brown cited research by Harvard Medical School. The research, conducted by health economics professor Richard Frank and New York University Dean Sherry Glied, was released in January 2017 when Republicans were vowing to repeal the Affordable Care Act, though that didn’t happen.", "\"Repealing the ACA — and its behavioral health provisions — would have stark effects on those with behavioral health illnesses,\" the researchers concluded.", "Nationwide, the researchers estimated that approximately 1.25 million people with serious mental disorders and about 2.8 million Americans with a substance use disorder, of whom about 222,000 have an opioid disorder, would lose some or all of their insurance coverage if the federal health care law was repealed.", "In Ohio, the researchers found that 220,512 people with addiction or mental health disorders had coverage under the Affordable Care Act in 2016. (Brown said \"right now,\" but this data is two years old.) About 151,200 obtained coverage through the Medicaid expansion and 69,225 obtained plans through the marketplace.", "While Brown specifically said that 200,000 were getting opioid treatment, the research was more broad, because it addresses addiction and mental health disorders in general.", "Sometimes Brown has more precisely explained that 200,000 figure, including in a press statement when the study was released. But at other times, he has said that 200,000 Ohioans were getting opioid treatment through the Affordable Care Act.", "One of the researchers confirmed for PolitiFact that the 220,000 figure referred to significant behavioral health or substance use disorder needs.", "\"The data we had analyzed do not indicate how many in this group used substance use treatment services,\" said Glied of NYU.", "It’s clear that more broadly, Medicaid expansion has helped Ohioans seek drug treatment.", "Glied said that about half of all medication-assisted treatment for substance abuse treatment in Ohio is paid by Medicaid.", "Brown’s office spokeswoman, Jennifer Donahue, pointed to news reports showing that 500,000 low-income Ohio adults received mental health and addiction services under the state’s Medicaid expansion, including many for drug addiction.", "Donahue also cited news reports showing Republican Gov. John Kasich credited the Medicaid expansion for helping treat opioid addicts.", "Other health care experts, including the Kaiser Family Foundation, have expressed similar views that the Affordable Care Act will play a key role in tackling the opioid epidemic.", "Spokespersons for state departments of health, addiction services and Medicaid told us they didn’t have any data showing how many Ohioans had received opioid treatment as a result of the Affordable Care Act.", "However, between the time Ohio expanded Medicaid in 2014 through August 2017, more than 633,000 Ohioans with behavioral health needs had accessed services, including addiction treatment and mental health, through expanded Medicaid coverage. But we don’t know how many in this group received opioid treatment. The state data suggests that those receiving services may be even higher than the Harvard study, which was based on 2016 data, if we include additional years.", "Brown said, \"Right now in Ohio 200,000 people are getting opioid treatment because they have insurance under the Affordable Care Act.\"", "Harvard and New York University researchers concluded that about 220,000 people with addiction or mental health disorders had coverage through the Affordable Care Act, either through Medicaid expansion or purchasing insurance on the exchange, in 2016.", "But Brown oversimplified the study. The statistic is more broad than those who have received treatment for opioid addiction.", "Other state data suggest the number could be higher than 220,000, if we include multiple years.", "Brown’s general point that the Affordable Care Act has benefited people who need opioid treatment is supported by experts. We rate this claim Mostly True.", "U.S. Sen. Sherrod Brown, Speech to the City Club of Cleveland, April, 9, 2018", "The Hill Op-Ed by Harvard Medical School professor Richard G. Frank and Sherry Glied, Ph.D. is Dean of the Wagner School of Public Service at NYU., \"Keep Obamacare to keep progress on treating opioid disorders and mental illnesses,\"  and background information, Jan. 11, 2017", "U.S. Sen. Sherrod Brown, Brown Highlights New Report Detailing How Healthcare Repeal Would Cripple Efforts to Fight Opioid Epidemic, Jan. 11, 2017", "U.S. Sen. Sherrod Brown, Brown at Healthcare Hearing: Graham-Cassidy Takes Away Number One Tool in Opioid Fight, Sept. 25, 2017", "U.S. Sen. Sherrod Brown,  Brown, Northwest Ohio Families Condemn Harmful Cuts to Nursing Homes in Senate Health Bill, July 17, 2017", "U.S. Sen. Sherrod Brown, \"Brown to Senate panel: opioid epidemic hurts economy,\" June 8, 2017", "U.S. Sen. Sherrod Brown, \"Brown Blasts House Healthcare Vote to Take Care from 900,000 Ohioans,\" May 4, 2017", "U.S. Sen. Sherrod Brown, Brown Announces $26 Million in Federal Resources to Combat Opioid Epidemic in Ohio April 20, 2017", "U.S. Sen. Sherrod Brown, Brown Calls on President Trump to Release Critical Resources to Combat Opioid Epidemic, April 3, 2017", "U.S. Sen. Sherrod Brown, Brown Statement on CBO Analysis of Republican Healthcare Plan March 13, 2017", "Henry J. Kaiser Family Foundation, Medicaid’s Role in Addressing the Opioid Epidemic, Feb. 27, 2018", "The Herald (Circleville, Ohio), \"Ohio's opioid epidemic spotlighted as GOP health care repeal plan flops,\" (Accessed in Nexis) March 28, 2017", "Ohio Department of Health press release, Fentanyl, Carfentanil and Cocaine Drive Increase in Drug Overdose Deaths in 2016, Aug. 30, 2017", "Centers for Disease Control and Prevention, \"U.S. drug overdose deaths continue to rise; increase fueled by synthetic opioids,\" March 30, 2018", "ASPE.HHS.gov, \"Continuing progress on the opioid epidemic: the role of the Affordable Care Act,\" Jan. 11, 2017", "Shatterproof, \"New Harvard-NYU research shows ACA repeal would drain $5.5 billion per year from opioid epidemic fight and mental health treatment,\" Jan. 11, 2017", "Akron Beacon Journal, \"Ohio’s opioid epidemic spotlighted as GOP health care repeal plan flops,\"  March 25, 2017", "Cleveland Plain Dealer, \"Obamacare repeal would leave more than 220,000 Ohioans without mental health or drug addiction services, study says,\" Jan. 11, 2017", "Columbus Dispatch, \"Medicaid expansion covers nearly 500,000 Ohioans for mental health, drug treatment,\" July 17, 2016", "Columbus Dispatch, \"OBAMACARE REPLACEMENT; Health-care debate underway,\" (Accessed in Nexis) July 26, 2017", "Columbus Dispatch, \"DRUG CZAR IN TOWN; If opioid crisis is emergency, what's next?\" (Accessed in Nexis) Sept. 23, 2017", "ABC News, \"Senate health bill means choosing between 'children, seniors, the disabled,' Kasich says,\" July 2, 2017", "PolitiFact, \"Donald Trump declares public health emergency over opioid crisis. Here’s what that means,\" Oct. 30, 2017", "PolitiFact, \"Portman: Drug overdoses 'exceeded car accidents as the No. 1 cause of death in Ohio,'\" May 23, 2016", "PolitiFact, \"Are a third of people with drug problems on Medicaid, as Elizabeth Warren said?\" July 18, 2017", "PolitiFact, \"No evidence to prove Medicaid expansion is fueling the opioid crisis,\" Oct. 23, 2017", "PolitiFact, Truth-O-Meters for U.S. Rep. Jim Renacci and Mike Gibbons, Accessed April 18, 2018", "Interview, Jennifer Donohue, U.S. Sen. Sherrod Brown office spokeswoman, April 13, 2018", "Interview, Russ Kennedy, Ohio Department of Health spokesman, April 13, 2018", "Interview, Sherry Glied, New York University, Dean of New York University’s Robert F. Wagner Graduate School of Public Service, April 13, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]