["By Robert Farley", "Posted on January 19, 2018", "Making a pitch for border wall funding, President Donald Trump falsely tweeted that Mexico is “now rated the number one most dangerous country in the world.” That’s wrong.", "Although the number of homicides reached a record high in Mexico in 2017, the homicide rates were higher in numerous other countries in that region — let alone around the world.", "Trump’s tweet came as Congress attempts to pass a temporary budget bill to avert a government shutdown. The House on Jan. 18 passed a temporary spending bill, and the issue now moves to the Senate. One of the sticking points to a budget bill is Trump’s insistence that it include funding for a border wall, a demand Democrats have opposed.", "Trump made his case for wall funding in a Jan. 18 tweet.", "We need the Wall for the safety and security of our country. We need the Wall to help stop the massive inflow of drugs from Mexico, now rated the number one most dangerous country in the world. If there is no Wall, there is no Deal!", "— Donald J. Trump (@realDonaldTrump) January 18, 2018", "As we have written before, the bulk of illicit drugs passes undetected through legal ports of entry, mostly in hidden compartments of passenger vehicles and tractor trailers.", "But here, we are focusing on Trump’s erroneous claim that Mexico is “now rated the number one most dangerous country in the world.”", "Trump’s tweet drew quick rebuke from Mexico’s Foreign Ministry, which released a press release stating that it is “manifestly false that Mexico is the most dangerous country in the world.”", "Mexico’s Foreign Ministry, Jan. 18: While Mexico has a significant problem of violence, it is manifestly false that Mexico is the most dangerous country in the world. According to UN figures for 2014 (the most recent international report), Mexico is far from being one of the most violent countries. In Latin America alone, other countries have homicide rates higher than Mexico’s (16.4), which is far below several countries in the region.", "The press release went on to say that Mexico’s problem with violence is a “shared problem” caused by “the high demand for drugs in the United States and supply from Mexico (and other countries).”", "Trump’s claim is “just not defensible,” said David Shirk, a global fellow at the Wilson Center’s Mexico Institute and a professor at the University of San Diego.", "Although data from December are not yet available, Shirk told us the number of homicides in Mexico in 2017 apparently will top 28,000. That would be the highest number in the country’s history, and would be at or near a record on a per capita basis, he said.", "That’s an alarming rise. But it’s still about 50 percent lower than the number of homicides in Brazil, Shirk said. And considered per capita, other countries in the region including El Salvador, Honduras and Guatemala have far higher rates of homicide, according to the latest Global Study on Homicide compiled by the United Nations Office on Drugs and Crime.", "That’s just homicides. These figures don’t include war-related killings and deaths from internal conflicts, which are far higher in countries such as Syria, Iraq, Afghanistan and Yemen, Shirk said. Nor are homicides alone a full measure of a country’s violence.", "Mexico is ranked the 22nd least peaceful country in the Institute for Economics and Peace’s 2017 Global Peace Index. And Mexico did not appear in the Top 20 of the least “safe and secure” countries ranked in the World Economic Forum’s 2017  Travel and Tourism Competitiveness Report.", "We reached out to the White House press office for support for the president’s claim, but we did not hear back. That leaves us once again guessing what the president may have been referring to.", "Back in June, Trump tweeted that “Mexico was just ranked the second deadliest country in the world, after only Syria.”", "Mexico was just ranked the second deadliest country in the world, after only Syria. Drug trade is largely the cause. We will BUILD THE WALL!", "— Donald J. Trump (@realDonaldTrump) June 22, 2017", "That was based on a report from the International Institute for Strategic Studies that concluded, “Mexico’s 2016 intentional homicide total, 23,000, is second only to Syria.” But that report was subsequently removed because, the group explained on its website, “there was a methodological flaw in our calculation of estimated conflict fatalities that requires revision.”", "In a press release issued on June 23, IISS said it anticipated its recalculation would result in Mexico’s “conflict remaining among the ten most lethal in the world, by estimated fatalities attributable to an armed conflict.” An IISS spokesperson told us via email that the recalculation of Mexico’s 2016 fatalities figure has not been completed. Nonetheless, as the June press release went on to explain, its surveys “do not measure homicides on either an absolute or per capita basis. We estimate deaths directly related to conflict. We do not provide an assessment of the levels of violence in any country.”", "A Mexico Daily News story speculated that Trump could have been referring to a recently revised travel advisory for Mexico issued by the U.S. State Department, which warns against travel to five Mexican states due to high crime. Those states received the highest Level 4 warning, the same as given to countries like Afghanistan and Somalia, the New York Times noted. But overall, Mexico was ranked as a Level 2 country, which recommends travelers “exercise increased caution.” Specifically, the travel advisory says, “Violent crime, such as homicide, kidnapping, carjacking, and robbery, is widespread.” But, as the New York Times notes, that Level 2 ranking is the same for countries such as France, Italy and Britain.", "Again, we don’t know what prompted the president to claim that Mexico is “now rated the number one most dangerous country in the world.” All available independent analyses we found contradicted the president’s claim. We’ll update this item if the White House responds.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]