["Homemade face masks for sale blow in the wind outside of a business, Tuesday, May 12, 2020, in San Antonio. San Antonio continues to encourage face masks or coverings as well as social distancing in an an effort to fight the coronavirus pandemic. (AP)", "Multiple studies have suggested mask mandates can lead to a decline in COVID-19 cases.", "Researchers caution that factors like compliance and enforcement should be taken into consideration, but masks have ultimately proven to be an effective tool in combating the virus", "Masks have once again become a political volleyball in the Wisconsin State Capitol.", "Assembly Republicans voted on Feb. 4, 2021 to overturn Gov. Tony Evers’ order requiring people to wear face coverings to mitigate the spread of COVID-19 — sealing the deal after the Senate took action a week prior. Evers responded by immediately issuing a new mandate.", "The next day, Democrats in the Assembly introduced legislation requiring masks, a measure that is likely to go nowhere in the GOP-controlled Legislature.", "Amid the back and forth, Democrats chastised their Republican colleagues for playing politics with public health and argued masks are necessary to push the state through the final stages of the pandemic.", "Among those to speak out was Assembly Minority Leader Gordon Hintz.", "\"At the end of the day we know mask mandates work,\" the Oshkosh Democrat said in a Feb. 5, 2021 interview on the Wisconsin Public Television program Here & Now. \"There’s enough evidence out there between counties that have done it and counties that haven’t.\"", "Is Hintz onto something? Let’s take a look.", "When asked for evidence to support Hintz’s claim, his office pointed to a study by the Centers for Disease Control and Prevention and Kansas Department of Health and Environment that analyzed the impact of mask mandates on Kansas counties.", "Kansas’ governor issued an executive order requiring face coverings in public spaces starting July 3, 2020. A state law enacted the month prior allowed counties to opt out of the state mandate, which 81 of 105 did without implementing their own mask rules.", "Researchers found the seven-day rolling average of new daily cases per 100,000 people decreased by 6% in the 24 counties with mask mandates after the governor’s order. In counties without a mandate, COVID-19 incidence increased by 100%.", "The study noted that 13 counties with mask mandates and seven counties without mandates also had other mitigation strategies in place, such as limiting the size of gatherings and how many could eat in restaurants. Still, researchers concluded that \"strategies related to mask use mandates appear to be important.\"", "\"The decrease in cases among mandated counties and the continued increase in cases in nonmandated counties adds to the evidence supporting the importance of wearing masks and implementing policies requiring their use to mitigate the spread of SARS-CoV-2,\" the study stated.", "The Wisconsin Medical Society cited the Kansas study in a Feb. 1, 2021 memo to Assembly lawmakers asking them to oppose the repeal.", "The group also referenced research from Goldman Sachs estimating that mandates gradually increase the number of people who \"always\" or \"frequently\" wear masks by about 25 percentage points, and the number who \"always\" wear masks by 40 points.", "Another study published in June 2020 found a \"significant decline\" in daily COVID-19 cases in states with mask mandates, with the effect increasing over time. Researchers cautiously estimated that 230,000 to 450,000 COVID-19 cases may have been averted by May 22, 2020 due to the mandates.", "Meanwhile, researchers in Canada found a 25 to 46% average weekly reduction in new cases in the first few weeks after mandates were adopted, while the number of people who reported always wearing a mask in public increased by about 30 percentage points.", "When studying the impact of mask mandates, it’s important to consider whether people follow them and if they’re enforced, said Ajay Sethi, an epidemiologist and associate professor at the University of Wisconsin-Madison. He said it can be difficult to assess mandates individually when they’re issued with other public health guidelines, but he believes the Kansas study offered compelling data on the matter.", "\"You could argue that with or without a mandate, people might wear a mask because that’s what they do and the mandate is just confirming what they do,\" he said. \"At the end of the day, an entire county had fewer cases.\"", "And ultimately, Sethi said, mandates remind people about the importance of wearing face coverings to guard against COVID-19.", "\"If we didn’t have mandates, would you expect mask use to go up?\" he said. \"I wouldn’t.\"", "In a TV interview, Hintz said, \"At the end of the day we know mask mandates work. There’s enough evidence out there between counties that have done it and counties that haven’t.\"", "Multiple studies have suggested mask mandates can lead to a decline in COVID-19 cases. Researchers caution that factors like compliance and enforcement should be taken into consideration, but masks have ultimately proven to be an effective tool in combating the virus.", "We rate Hintz’s claim True.", "Milwaukee Journal Sentinel, Gov. Tony Evers issues new statewide mask mandate an hour after Republican lawmakers eliminated it, Feb. 4, 2021.", "TMJ4, Wisconsin Democrats propose mask mandate that would last for entire pandemic, Feb. 5, 2021.", "Email from Joanna Beilman-Dulin, communications director for Rep. Gordon Hintz, Feb. 2, 2021.", "Centers for Disease Control and Prevention, Trends in County-Level COVID-19 Incidence in Counties With and Without a Mask Mandate — Kansas, June 1–August 23, 2020, Nov. 27, 2020.", "Wisconsin Medical Society, RE: 2021 SJR 3, Feb. 1, 2021.", "Goldman Sachs, Face Masks and GDP, June 29, 2020.", "Health Affairs, Community Use Of Face Masks And COVID-19: Evidence From A Natural Experiment Of State Mandates In The US, June 16, 2020.", "MedRxiv, Face Masks, Public Policies and Slowing the Spread of COVID-19: Evidence from Canada, Oct. 16, 2020.", "Interview with Ajay Sethi, associate professor of population health sciences at the University of Wisconsin, Feb. 10, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]