["By Eugene Kiely, Lori Robertson and Robert Farley", "Posted on October 2, 2017", "Democrats have used outdated or inflated figures to attack the GOP tax plan, when sticking to the facts would have served them just as well.", "To be sure, there are many details missing from the outline of a tax plan that the White House and GOP leaders released on Sept. 27, and there are several measures in that outline that would benefit the wealthy.", "The tax plan would cut the corporate tax rate from 35 percent to 20 percent; abolish the alternative minimum tax; collapse the seven income tax brackets, which range from 10 percent to 39.6 percent, to three (12 percent, 25 percent and 35 percent); increase the standard deduction but eliminate exemptions; eliminate most itemized deductions except for mortgage interest and charitable giving; increase the child tax credit; and abolish the estate tax.", "In a Sept. 29 analysis of the GOP plan, the nonpartisan Tax Policy Center estimates that the average tax bill would decline in 2018 for “all income groups,” but “[t]hose with the very highest incomes would receive the biggest tax cuts.” Half of the “total tax benefit” would go to the top 1 percent of taxpayers who have incomes of more than $730,000.", "The Democrats, of course, have the right to criticize the tax plan for favoring the wealthy. But we found several instances where they went too far.", "Sanders tweeted an image of a chart that exaggerates how much Trump, some members of his cabinet and other wealthy people would benefit from the repeal of the estate tax.", "Who benefits from Trump's plan to repeal the estate tax? Only the top 0.2% — Trump, his cabinet, and other millionaires and billionaires. pic.twitter.com/UQilM6MaRb", "— Bernie Sanders (@SenSanders) September 28, 2017", "As indicated in the chart, the Democratic staff of the Senate Budget Committee produced the scratched-out figures. Sanders, an independent from Vermont who ran for the Democratic presidential nomination, is the ranking member on the committee.", "Notice that the first column says “max estate tax under current law.” The maximum statutory estate tax rate is 40 percent (see Table A of IRS instructions for the estate tax). But the actual rate that estates pay — known as the effective rate — is much less.", "The Tax Policy Center estimates the highest average effective rate is 18.8 percent — less than half the 40 percent applied by the Democratic staff.", "Sanders’ spokesman Josh Miller-Lewis, who provided us with a copy of the analysis, confirmed for us that the committee staff did “a straight 40% tax on assets (minus the current law exemption for the first $11 million)” when calculating the tax break for Trump and others on the chart. (The first $5.49 million in an estate’s assets, or nearly $11 million for a couple, are exempt from the tax.)", "The Democratic analysis also assumes, in Trump’s case, that the president is worth $10 billion. That is based on Trump’s own estimate of his net worth. But, as we have written, independent estimates use a much lower figure.", "During the transition in December, Bloomberg did its own calculations on how much Trump (then the president-elect) and some candidates for his cabinet would benefit if the estate tax was repealed. In its calculations, the news service estimated that Trump is worth about $3 billion, not $10 billion.", "If the estate tax is repealed, “Trump’s estate would save $564 million, based on his estimated net worth of $3 billion” and an effective tax rate of 18.8 percent, Bloomberg writes. Even if Trump is worth $10 billion, as he says, the tax windfall for Trump’s estate would be $1.9 billion — less than half the $4 billion figure used in the chart that Sanders posted on Twitter.", "Asked about the Bloomberg estimate, Miller-Lewis said: “Bloomberg probably assumed that most people with this wealth will take advantage of all the ways to shield assets from the estate tax and not pay the top rate. We accounted for this in the graphic by saying ‘maximum.'”", "Bloomberg’s calculations also showed less of a tax break for two of Trump’s cabinet officers.", "The news service estimated that Commerce Secretary Wilbur Ross “might save about $545 million, based on estimated net worth of $2.9 billion,” and Small Business Administrator Linda McMahon and her husband, Vince, “might save more than $250 million based on their shared net worth of at least $1.35 billion,” Bloomberg said. Both of those figures are about half of the tax breaks that the Democratic staff projects.", "FactCheck.org Rating:", "Read More", "Schumer said in a press conference on Sept. 27: “The plan will add anywhere from 5 to 7 trillion dollars to our deficit.” But on Twitter the same day, he phrased it slightly differently: “On top of that, this would cost anywhere from 5 to 7 TRILLION dollars and they have no credible plan to pay for it.”", "The figures come from Americans for Tax Fairness, a group that advocates “progressive tax reform” that “requires big corporations and the wealthy to pay their fair share,” but Schumer doesn’t quite get them right. ATF said the cost of the plan could be $7 trillion to $8 trillion over 10 years, while the portion added to the deficit could be $3 trillion to $5 trillion over 10 years. The headline on the analysis said: “Trump’s Unpaid-For Tax Cuts May Total $5 Trillion In New Tax Plan.”", "Schumer’s office told us that in the press conference, the senator meant to say he was referring to the total cost.", "The ATF calculations rely heavily on several past reports from the Tax Policy Center, but ATF’s high-end estimate on deficit spending — $5 trillion over a decade — surpasses what TPC has found. For instance, TPC’s July 12 report on what the administration had outlined then estimated a loss in revenue of $3.5 trillion over the first 10 years. It then estimated a revenue loss of $5.7 trillion over the second decade.", "More recently — but two days after Schumer made his comments — TPC estimated that the latest tax framework from the president and Republican congressional leaders “would reduce federal revenue by $2.4 trillion over ten years and $3.2 trillion over the second decade.”", "As we said, there are many details missing from the tax plan that has been released so far. But Republicans on the Senate Budget Committee have drafted a 2018 budget that would allow the tax plan to contribute up to $1.5 trillion over 10 years to the deficit — far less than the figures Schumer cited. Republicans announced that framework before the tax plan was revealed, though the full Senate would still need to pass the budget and reconcile it with the House version.", "Under budget reconciliation rules, the Senate could pass the tax cuts with a simple majority, and Republicans control 52 seats in the Senate.", "FactCheck.org Rating:", "Read More", "Wyden criticized the Republicans’ plan to reduce the corporate tax rate, saying at the Sept. 27 press conference: “Back-of-the-napkin estimates show that the Trump plan on the corporate side will result in $1.8 trillion in tax cuts for the multinationals and the powerful CEOs.”", "But not all of the benefits from a corporate tax cut would go to the rich and powerful. Many economists — including those with the nonpartisan Joint Committee on Taxation, the Congressional Budget Office and Tax Policy Center — say workers bear some of the burden of corporate taxes.", "The Americans for Tax Fairness analysis of the GOP plan says the reduction in the corporate tax rate from 35 percent to 20 percent, and the repeal of the corporate alternative minimum tax, would cost $1.8 trillion over 10 years. It cites the Tax Policy Center, which indeed included that figure in an analysis of a 2016 House Republican plan. But the TPC assigns 20 percent of the corporate tax burden to labor, with the rest falling on capital and shareholders.", "That would mean that $1.44 trillion — not the full $1.8 trillion estimate — of the corporate tax cut would benefit those who control the corporations, “multinationals and the powerful CEOs,” as Wyden put it.", "We recently wrote about this issue when fact-checking the near opposite claim from Treasury Secretary Steven Mnuchin, who said, “most economists believe that over 70 percent of corporate taxes are paid for by the workers.” We found there were economists who agreed with Mnuchin, but many others who didn’t. In fact, the three nonpartisan organizations we mentioned — JCT, CBO and TPC — say most, but not all, of the corporate tax burden falls on shareholders. The Treasury Department reached the same conclusion in 2008 and 2012 analyses. (Treasury has now removed the 2012 analysis from its website, the Wall Street Journal reports.)", "We found that the pro-business Tax Foundation also estimated that reducing the corporate tax rate to 20 percent would cost $1.8 trillion over a decade. But the foundation goes on to say that 30 percent of that would be passed on to labor.", "Wyden’s claim is another case of Democrats overstating the impact of the tax plan on the wealthy, and an example of how both sides are spinning the facts on Trump’s tax plan.", "FactCheck.org Rating:", "Read More", "Ryan used an outdated and inflated figure when he said, “Since the recession ended, about 85 percent of income growth went to the top 1 percent.” The latest estimate is 52 percent.", "Ryan’s comment came during an interview with Neil Cavuto on Fox News on Sept. 28. The Ohio Democrat said he would “absolutely not” support the tax plan proposed by Trump. Ryan argued the plan would disproportionately benefit the wealthy.", "Ryan, Sept. 28: Let’s … take a step back and look at this whole thing. Since the recession ended, about 85 percent of income growth went to the top 1 percent, OK?", "So, this is just another supply-side economic plan, where you’re getting rid of the alternative minimum tax, you’re getting rid of the estate tax, which doesn’t start until 10 million bucks. So, this is going clearly to the top 1 percent. They’ve seen all of the income growth in the last seven to 10 years.", "Ryan’s office referred us to a Time magazine story about a study released on June 16, 2016, by the Economic Policy Institute that did, in fact, report: “For the United States overall, the top 1 percent captured 85.1 percent of total income growth between 2009 and 2013.”", "But that study is now outdated.", "The EPI study mirrors the work of economist Emmanuel Saez of the University of California, Berkeley, who wrote in January 2015 that after the Great Recession, “the top 1% captured 91% of the income gains in the first three years of the recovery.” At the time, that was an update with 2013 preliminary estimates. The report has been updated twice since then, once on June 25, 2015, (updated with 2014 preliminary estimates) and again on June 30, 2016 (updated with 2015 preliminary estimates).", "According to the most recent update, the “[t]op 1% families still capture 52% of total real income growth per family from 2009-2015 but the recovery from the Great Recession now looks much less lopsided than in previous years.”", "Mark Price, a labor economist at the Keystone Research Center and one of the co-authors of the EPI study, told us the updated Saez figure of 52 percent is the “most accurate” figure to use now.", "As Price explained, early in an economic recovery, most of the income growth goes to the very wealthiest. But as the recovery continues and the unemployment rate comes down, he said, income and wage gains tend to spread out to lower income levels.", "The current 52 percent level is about where the historical average has been for the last 36 years, he said, and the top income groups overall capture a disproportionately large share of income growth.", "“The overall point is that a disproportionate share of income growth is captured by the Top 1 percent,” Price said.", "Nonetheless, Ryan should use the more updated, and accurate, figure.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]