["The harmful traditional practice of female genital mutilation is still an accepted part of many Nigerian cultures.", "The harmful traditional practice of female genital mutilation is still an accepted part of many Nigerian cultures", "Reporting on the threat to Nigerian girls’ survival and their development, a reporter in the country’s Guardian newspaper last month claimed that national statistics show “27% of Nigerian women between 15 and 49 are victims of female genital mutilation or cutting”", "Is the statistic accurate?", "Female genital mutilation includes all procedures or practices involving the removal of the external female genitalia or injury to it for non-medical purposes, the World Health Organisation explains.", "The mutilations are mostly done by traditional circumcisers and local birth attendants. The United Nations terms the practice a violation of the rights of girls and women and to eradicate it is one of the organisation’s sustainable development goals.", "Since May 2015, female genital mutilation is illegal in Nigeria after former president Goodluck Jonathan signed into law the Violence Against Persons (Prohibition) Act. It stipulates a jail term of up to four years or a N200,000 (US$550) fine for offenders.", "The author of the newspaper report told Africa Check he got the data from a contact.", "“I contacted one of my trusted sources for statistics on female genital mutilation; he then informed me about the claim,” Oluwaseun Akingboye said. He didn’t state which document or report was cited by his contact, however.", "Without a specific source, Africa Check turned to the country’s statistics agency, the National Bureau of Statistics. The 2016/17 Multiple Indicator Cluster Survey contains the most recent data on female genital mutilation, according to the data agency’s statistical information officer, Leo Sanni.", "Done as part of its global indicator surveys, the United Nations Children's Fund (Unicef) partners with local health and statistics agencies to carry out the nationally representative survey, which is usually done every five years.", "During the latest round, 34,376 women between 15 and 49 were interviewed across Nigeria’s six geopolitical zones and asked whether they had gone through some form of genital mutilation or cutting.", "The survey found that 18.4% of the women had been subjected to female genital mutilation. This is a drop from the previous round in 2011, when 27% of women aged 15-49 reported having experienced a form of mutilation or cutting. In 2007, the prevalence was estimated at 26%.", "Despite the drop, the data showed that more girls below 14 are still being cut. Successive multi-indicator surveys indicate the share of girls in this group who underwent the custom almost doubled in the past 10 years. While it stood at 13% in 2007, by 2016/17 it had increased to 25.3%.", "The survey has also revealed new regional hotspots for the practice, Atul Kumar, a Unicef spokesman, told Africa Check.  While states such as  Zamfara, Kaduna and Jigawa had a prevalence of under 20% during the 2011 survey, this rose significantly in the latest round. The share in Zamfara increased from 2.5% to 26.4%, in Kaduna from 19% to 39.3% and from 2% to 14.4% in Jigawa.", "Kumar noted that “more worringly”, prevalence also rose in girls below 14 in these states. Zamfara recorded an increase from 5% to 58.2%, Kaduna from 38.3% to 63.1%, Jigawa from 36.9% to 66.9%. In Kano state, it went from 51.4% to 71%.", "(Note: Kumar has not yet elaborated on possible reasons for the increase in this age group. We will update this report with his response.)", "A public health expert, Dr Sunday Aderibigbe, said the rise could be due to increased reporting as more mothers become aware of the dangers of female genital mutilation. Aderibigbe teaches public health and community medicine at the University of Ilorin.", "“A good number of them are coming out to say their child has undergone the practice,” he said.", "Still, 21.6% of the sampled mothers approved of the practice. This could be due to traditional myths around it and the perception that it is cultural, an anti-FGM campaigner, Jolaoluwa Aina, told Africa Check.", "“I remember meeting a practitioner who told me the practice was handed down to him from his grandfather. Many of them feel they have to continue the act as a way to protect their culture,” said Aina, who is a member of the EndCuttingGirls initiative.", "“We also need to look in the direction of traditional and religious leaders. We need their support to help checkmate this activity. They have a strong hold on their people.”", "To draw attention to the serious issue of female genital mutilation in Nigeria, a newspaper reported that 27% of Nigerian women between 15 and 49 have been subjected to it.", "While that was the estimate in 2011, the latest data from a Unicef survey shows that it has fallen to 18.4% in 2016/7. In contrast to this, the number of girls younger than 14 that their mothers reported as being cut has almost doubled since 2007. Some states also reported a big jump.", "Whether this is due to increased reporting or other factors, Unicef couldn’t say. But these variances need to be teased out if campaigners want to make headway.", "Please complete this form to receive the HTML sharing code.", "In this guide, we’ve taken it back to basics to explain how to identify images and videos where not everything is as it appears to be.", "This step-by-step guide explains how to do a reverse image search to check whether the photo you saw on social media is the real thing.", "Zombie claims don’t bite, but they’re annoying. Do your part to stop them resurrecting by following our tips for spotting recycled hoaxes.", "With movement restrictions in place due to Covid-19, unverified information still found a way of travelling, whether among family, colleague...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]