["Sunny Larson, left, and Zak McCutcheon pick produce while gathering provisions to take home at the Augusta Food Bank in Augusta, Maine, on March 27, 2017. (AP/Robert F. Bukaty)", "In a recent tweet, the West Virginia Republican Party praised President Donald Trump for his role in reducing the number of Americans who rely on food stamps.", "\"Thanks to President Trump and Republican leadership, the number of people collecting food stamps has declined by more than two million. Our economy is (in) recovery and more jobs are available! #WVGOP,\" the party tweeted Aug. 1.", "Thanks to President Trump and Republican leadership, the number of people collecting food stamps has declined by more than two million. Our economy is recovery and more jobs are available! #WVGOP https://t.co/taRt2i2O0O", "Is this correct?", "We looked at the official data from the U.S. Department of Agriculture, which runs the program formally known as SNAP, the Supplemental Nutrition Assistance Program.", "When Trump took office in January 2017, there were 42.7 million Americans on food stamps. By May 2018, there were 39.3 million Americans collecting food stamps. That’s a decrease of 3.4 million -- an even bigger decrease than the tweet had touted.", "Measured another way, the number of households with at least one food-stamp recipient declined over the same period by almost 1.5 million.", "But the tweet drew a connection between Trump’s policies and the downward trend. Is there one?", "That’s less clear.", "Food stamp usage peaked in late 2012 and has been declining ever since -- under both Trump and his predecessor, President Barack Obama.", "The Agriculture Department wrote in an April 2018 report that the decline in 2017 \"in large part\" reflected \"the continued improvement in economic conditions in recent years. Because eligibility for SNAP is based largely on a person’s financial situation, program participation is countercyclical, expanding during economic downturns when people lose their jobs and see their incomes fall, and contracting during periods of economic growth when unemployment falls and people’s incomes rise.\"", "The department’s report noted that in 2017, the unemployment rate was 4.4 percent, well below the 7.4 rate in 2013. And the share of Americans with incomes below the poverty line fell, from 14.8 percent in 2013 to 12.7 percent in 2016.", "Michael Wiseman, a professor of Public Policy at George Washington University said the biggest reason for the drop to \"the ongoing economic recovery that begin in the first year of the Obama administration.\"", "No president can be fully credited with (or blamed for) economic conditions on their watch, but to the extent that a president can reasonably claim a share of the credit, both Obama and Trump can. There was no sudden turnaround after Trump took office.", "Another likely reason for the decline in food stamp usage was a tightening of restrictions on SNAP participation by those who fall into the category of \"able bodied adults without dependents.\" Childless adults, aged 18 to 50, who aren’t employed or in a training program for at least 20 hours a week may only receive SNAP benefits for up to three months.", "However, these restrictions began before Trump took office.", "\"While the Trump administration has proposed various restrictions on SNAP access, none have been implemented,\" Wiseman said.", "The West Virginia Republican Party tweeted, \"Thanks to President Trump and Republican leadership, the number of people collecting food stamps has declined by more than two million.\"", "That’s actually an undercount -- the number of Americans collecting food stamps has decreased by 3.4 million. But the decline began years before Trump took office, so it’s a stretch to attribute sole credit to Trump or his policies.", "We rate the statement Mostly True.", "West Virginia Republican Party, tweet, Aug. 1, 2018", "U.S. Department of Agriculture, data for food stamp usage, accessed Aug. 22, 2018", "U.S. Department of Agriculture, \"Number of People Participating in USDA's Supplemental Nutrition Assistance Program Continues To Fall,\" April 2, 2018", "Center on Budget and Policy Priorities, \"Waivers Add Key State Flexibility to SNAP’s Three-Month Time Limit,\" Feb. 6, 2018", "Email interview with Michael Wiseman, professor of Public Policy at George Washington University, Aug. 21, 2018", "Email interview with Brynne Keith-Jennings, analyst on food assistance policy for the Center on Budget and Policy Priorities, Aug. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]