["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Funeral participants for Ryan Guider stand outside Victory For The World Church folllowing a shooting at the service on June 7, 2012 at the church near Stone Mountain. Photo by HYOSUB SHIN / [email protected]", "It’s been a month since House Bill 60 became law and cleared the way for Georgians to carry concealed weapons in several new venues – all bars, many government buildings and, generating the most news coverage, churches that allow it.", "Jerry Henry, executive director of GeorgiaCarry.org --- a pro-gun group that advocates for fewer gun restrictions --- repeated a strikingly high and somewhat specific number in defending allowing guns in sanctuaries.", "More than 440 people have been killed in attacks on church property since 1999, he told Georgia Public Broadcasting this spring.", "A reader questioned that figure shortly after the bill became law on July 1. We decided it was a worthy target for the AJC Truth-O-Meter.", "Already, PolitiFact found flaws in a specific count from the other side of the gun debate. Everytown for Gun Safety claimed there were 74 school shootings in the United States since Sandy Hook, a tally that included incidents such as a teacher who committed suicide in a school parking lot overnight. We rated that claim Mostly False.", "Henry told PolitiFact Georgia that he relied on two specific websites, Cops and Cross and Carl Chinn's church security site, for the statistic. He used the term church generically, to cover all houses of worship.", "Cops and Cross is run by Jimmy Meeks, a former police officer who teaches church safety across the country. A recent banner on the site listed more than 470 \"violent deaths on church and faith-based property since 1999,\" but does not include sources for those figures.", "Instead, it directs users to the site run by Carl Chinn, a former building engineer for Focus on the Family. Chinn was among responders when a gunman took four people hostage at the conservative Christian group’s headquarters, and later surrendered, in 1996.", "Chinn said in an email that he relies on news reports, official records and blog items for his figures. Many incidents have multiple sources.", "That count, though, includes broad incidents not likely to be considered attacks. For instance, the first page of incidents for 2014 show at least two suicides on church property that, according to news reports, are not connected to the house of worship.", "GeorgiaCarry.org’s claim could also not be backed up with unimpeachable data elsewhere. The Centers for Disease Control found that the majority of the 166 deaths that occurred at houses of worship between 2003 and 2011 were suicides.", "But the National Violent Death Reporting System covers only 17 states, including Georgia. The CDC cannot provide specific numbers on suicides from the total figure, a spokeswoman said, because that sample is too small.", "That means the figures are not nationally representative and cannot be used to create an estimate to verify or refute Chinn’s numbers.", "There is similar incomplete coverage from the National Incident-Based Reporting System, with only about 38 percent of Uniform Crime Reporting agencies providing information, according to the FBI. Without more data, the FBI cannot verify the statistic.", "The federal government has generally stopped funding such research over political battles between gun control advocates and gun rights advocates.", "Several prominent social scientists have asked that barriers to firearms research be lifted, and President Obama has signed an executive order for the CDC to research causes and prevention of gun violence.", "Without reliable statistics, Chinn’s data could be the best approximation of data available. And although advocates often speak with more certainty than data supports, David Kopel, the research director at the Libertarian-leaning Independence Institute, said there is value in stories behind some of the numbers.", "Anecdotally, backers of Georgia’s law need only to point to Matthew Murray, who killed two missionaries in a Colorado church’s mission training center in 2007, Kopel said.", "Murray continued his spree by killing two more people at the New Life Church in Colorado Springs. A congregant volunteering to help with security shot Murray, who then took his own life.", "There have been incidents closer to home. In July 2012, two people were killed in a shootout with each other outside a funeral at Victory for the World Church near Stone Mountain.", "In October of that year, Floyd Palmer gunned down Greg McDowell as he led a prayer at World Changers Church International in College Park. Palmer also was charged in 2001 with shooting a man outside a Maryland mosque.", "\"Are there incidents where someone comes into church with a gun, with the intent to commit suicide? I’m sure,\" said Clayton Cramer, an adjunct history professor at the College of Western Idaho who specializes in firearm history. \"How often? We don’t know.\"", "\"Until such time that we have some real, hard data,\" Cramer added, \"the best thing to say is, there are examples where a churchgoer having a gun during a confrontation mattered or would have mattered,\"", "And that is where the claim of specific counts falls short. The data has some value in capturing the number of attacks on or at religious institutions. But there is no way to remove suicides from the death counts to ensure a more strict definition of attacks as understood by the general public.", "Without that ability, even a claim with some truth gives the wrong impression.", "We rate it Mostly False.", "Emails and Interview with Jerry Henry, executive director, GeorgiaCarry.org, between July 7 and July 31, 2014.", "Georgia Public Broadcasting, \"Gun Bill: Some Small Changes, Some Large Ones,\" April 9, 2014.", "Cops and Cross website", "Carl Chinn website", "Reading Eagle, \"Gunman frees four hostages, then surrenders,\" May 3, 1996.", "Email interviews with Centers for Disease Control and Prevention, July 25 and July 29, 2014", "Centers for Disease Control and Prevention's National Violent Death Reporting System", "Email interviews with Federal Bureau of Investigation, July 29, 2014", "University of Chicago appeal letter to Vice President Jospeh Biden, accessed July 30, 2014", "President Barack Obama's Jan. 16, 2013 Executive Order, accessed July 31, 2014.", "Fox News, \"Colorado Church Gunman Had Grudge Against Christian Group, Cops Say,\" Dec. 10, 2007", "Atlanta Journal-Constitution, \"Funeral shooting victims identified,\" June 8, 2012.", "Atlanta Journal-Constitution, \"Church shooting victim's family breaks silence,\" Oct. 26, 2012.", "Email interview with Carl Chin, July 30, 2014", "Interview with David Kopel, research director, Independence Institute, July 29, 2014.", "Interview with Clayton Cramer, adjunct history professor, College of Western Idado, July 30, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]