["About this rating", "On 30 March 2018, the hoax-spreading, self-described conservative blog FellowshipoftheMinds.com posted a story reporting that organizers of the \"March for Our Lives\" rally in Washington, D.C., had applied for march permits months before the 14 February 2018 school shooting in Parkland, Florida.", "The story was based on an e-mail exchange between James Fetzer, a retired philosopher-turned-conspiracy theorist, and Scott Earhardt, an officer with the Washington, D.C. Metropolitan Police Department (MPD). In the message, Earhardt appeared to suggest the permit for the 24 March 2018 rally had been submitted well before the 14 February 2018 school massacre at Marjory Stoneman Douglas High School in which seventeen people were murdered, saying that \"In reference to your inquiry concerning the March For Our Lives Demonstration, here in the District of Columbia on March 24, 2018. MPD received a permit application several months prior to the actual event, and there was several months of planning for this large event.\"", "FellowShipoftheMinds and other disreputable web sites predictably took this statement at face value and ran with it without verifying whether it was true — and it's not.", "We called Earhardt, but he declined to comment because he was not authorized to do so and instead referred us to MPD's public affairs department. However, Earhardt told non-partisan fact checker PolitiFact that he had confused the \"March for Our Lives\" rally with an annual event in January bearing a similar name: March for Life.", "MPD spokeswoman Karimah Bilal told us that the permit application for the March for Our Lives rally was received on 21 February 2018, one week after the massacre. We obtained a copy of the march permit application via a Freedom of Information Act request and confirmed that it was submitted on 21 February 2018, one week after the massacre. The document can be viewed below.", "A pervasive, but consistently unfounded trope among conspiracy theorists and \"hoaxers\" is that any mass casualty incident, particularly mass shootings, are \"false flags,\" or events engineered by the government in a widespread plot to install an authoritarian global government (often referred to as the \"New World Order\"). Hoaxers generally appear to believe that such tragedies are precursors to a nationwide gun grab, and they have regularly targeted survivors and family members of mass shooting victims from incidents like the 2012 Sandy Hook Elementary School shooting, the 2017 church massacre in Sutherland Springs, Texas and most recently the Parkland shooting as a result.", "Ohlheiser, Abby. \"How the Parkland Teens Became Villains on the Right-Wing Internet.\"\r\n  The Washington Post. 27 March 2018.", "Lapowsky, Issie. \"Parkland Conspiracies Overwhelm the Internet's Broken Trending Tools.\"\r\n  Wired. 21 February 2018.", "Nicas, Jack, and Frenkel, Sheera. \"Facebook and Google Struggle to Squelch ‘Crisis Actor’ Posts.\"\r\n  The New York Times. 23 February 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]