["About this rating", "A lawsuit filed against Subway claimed that the company does not use real tuna or fish in their sandwiches. Subway has denied the complaint and says it delivers “100% cooked tuna” to their restaurants.", "The lawsuit offers no details about the ingredients plaintiffs claim Subway used to replace the tuna.", "Independent investigations into Subway's tuna meat differ widely. Under the franchise system, some owners manage their own ingredients, making it unclear if the same tuna is used across all Subway franchises.", "Subway’s tuna meat may not have the ingredients consumers think, if a lawsuit filed in California in January 2021 is to be believed. The lawsuit alleges that the tuna ingredient in Subway’s sandwiches contains absolutely no tuna, a claim that Subway has denied.", "Two plaintiffs have sued Subway for fraud, intentional misrepresentation, unjust enrichment, and other claims under federal and state laws. Their lawsuit stated that the tuna was “made from anything but tuna.” It also said that based on “independent lab tests,” the tuna was “a mixture of various concoctions that do not constitute tuna, yet have been blended together by defendants to imitate the appearance of tuna.” It contended that the plaintiffs \"were tricked into buying food items that wholly lacked the ingredients they reasonably thought they were purchasing,\" based on its labeling. An attorney also told The Washington Post, \"We found that the ingredients were not tuna and not fish.\"", "Shalini Dogra, one of the lawyers for the plaintiffs, did not share what ingredients were found in the “tuna.” Alex Brown, another attorney on the lawsuit, told CBS, “We are conducting tests to figure out what it is. The lab tests thus far have only told us what it isn't.”", "Subway has categorically denied the claim in the lawsuit. Their full statement:", "There simply is no truth to the allegations in the complaint that was filed in California. Subway delivers 100% cooked tuna to its restaurants, which is mixed with mayonnaise and used in freshly made sandwiches, wraps and salads that are served to and enjoyed by our guests. The taste and quality of our tuna make it one of Subway’s most popular products and these baseless accusations threaten to damage our franchisees, small business owners who work tirelessly to uphold the high standards that Subway sets for all of its products, including its tuna. Given the facts, the lawsuit constitutes a reckless and improper attack on Subway’s brand and goodwill, and on the livelihood of its California franchisees. Indeed, there is no basis in law or fact for the plaintiffs’ claims, which are frivolous and are being pursued without adequate investigation.", "Unfortunately, this lawsuit is part of a trend in which the named plaintiffs’ attorneys have been targeting the food industry in an effort to make a name for themselves in that space. Subway will vigorously defend itself against these and any other baseless efforts to mischaracterize and tarnish the high-quality products that Subway and its franchisees provide to their customers [...].", "According to Subway’s nutritional information page, their tuna is: “Flaked tuna blended with creamy mayo then topped with your choice of crisp, fresh veggies.” The tuna also contains an additive to “protect flavor.”", "As a fast-food chain, Subway operates with numerous franchises around the country and the world. With this in mind, it is likely that the ingredients are not uniformly sourced across franchises, and so tuna in one Subway franchise may have a different source than another even if they are both in California.", "In June 2021, a New York Times reporter set out to investigate whether the Subway sandwich did contain real tuna, and the results were more complicated than ever. After the reporter sent samples off to a lab, the lab responded with, “No amplifiable tuna DNA was present in the sample and so we obtained no amplification products from the DNA. Therefore, we cannot identify the species.”", "A spokesperson from the lab elaborated: “There’s two conclusions. One, it’s so heavily processed that whatever we could pull out, we couldn’t make an identification. Or we got some and there’s just nothing there that’s tuna.”", "In February 2021, Inside Edition also sent Subway tuna for testing, and they found that the sandwiches did indeed contain tuna.", "The conclusion? Food processing has become so complicated that the further the fish gets from its source, the harder it is to identify it. Once tuna has been cooked, according to the New York Times, its DNA gets denatured, or its characteristic properties get destroyed. Furthermore, according to the U.S. Food and Drug Administration (FDA), there are 15 species of nomadic saltwater fish that can be labeled “tuna.”", "Even the lawsuit has softened its language, their complaints now center on whether Subway's product was “100% sustainably caught skipjack and yellowfin tuna.”", "The New York Times reporter concluded that it was \"probably\" tuna, and she could not imagine Subway's motivation for it not to be. She added:", "The larger issue was not “Is this real tuna?” but rather “What does it take to find out where your food is coming from, and why is it so difficult?” [...] Everyone I talked to said that if it’s anyone’s fault, it isn’t Subway’s. It’s really hard to trace the process when you buy canned food. Of course, corporations should be responsible for making sure you’re getting what you’re ordering, but, in the larger picture, you’re asking them to give you the cheapest possible product, in the quickest way, whenever you want it. Do I expect they’ll cut corners if I want a $6 sandwich at 3 a.m. with these specific toppings? That’s a lot to ask for — and it shouldn’t necessarily be — but when you reframe it that way, we have such a convenience culture. We need to look at more equitable and sustainable ways of sourcing our food.", "Given that even independent investigations widely differ, we rate this claim as “Unproven.” We will update this story if more information is made available.", "July 7, 2021: Added details from the New York Times and Inside Edition investigations, and update to lawsuit. Edited rating details.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]