["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With midterm elections on the horizon, Republicans have targeted incumbent U.S. Sen. Jeanne Shaheen, D-N.H., for her support of President Barack Obama and his health care reform law.", "Even though Obama won New Hampshire twice, a majority of residents now disapprove of his job performance, and his signature legislative accomplishment -- the Patient Protection and Affordable Care Act -- remains unpopular in the state, according to findings from the WMUR Granite State Poll, conducted by the University of New Hampshire Survey Center.", "The New Hampshire Republican Party released a web video in March 2014 aimed at capitalizing on those trends. Titled \"99 Percent,\" the video asserts that Shaheen consistently supports the president and \"votes with Obama 99 percent of the time.\"", "\"Sen. Shaheen can run, but she can’t hide from her loyal and unwavering support of the Obama-Biden agenda,\" NHGOP Chairwoman Jennifer Horn said in a statement that accompanied the clip.", "Democrats across the country have been targeted with similar critiques, with varying degrees of accuracy. In 2012, the Ohio Republican Party claimed that Democratic U.S. Sen Sherrod Brown voted with Obama 95 percent of the time. PolitiFact found that claim to be True.", "In Alaska, one of Sen. Mark Begich’s Republican opponents claimed Begich supported the president’s economic policies 97 percent of the time. That statement earned a Mostly False rating, because the numbers looked at more than just Obama’s economic policies.", "In reality, most politicians fall in line with the president when their party controls the White House. Still, we decided it would still be useful to dig into Shaheen’s voting record. The 2014 New Hampshire Senate race is shaping up to be a closely watched contest with former Massachusetts Sen. Scott Brown entering the race on the GOP side.", "We asked the NHGOP for some evidence to back up their statement about Shaheen’s support for Obama. Executive Director Matt Mowers pointed us toward Congressional Quarterly’s annual presidential position votes report.", "CQ examines voting patterns for every member of Congress and sorts them in ways that allow comparisons. One of those ways is an annual examination of presidential support, or the number of votes by each lawmaker on bills in which the sitting president has staked a position.", "The 2013 CQ analysis shows that, out of the pool of votes on which Obama took a clear position, Shaheen’s vote matched the president’s stance 99 percent of the time.", "We found similar figures across CQ reports since Shaheen took office. CQ put her voting with Obama at least 95 percent of the time each year.", "Overall, during the five years since Shaheen took office, Shaheen’s votes have aligned with the president’s position 98 percent of the time.", "That’s pretty close to the figure offered by the state Republican party. However, it’s important to note some limitations of judging Shaheen’s support for the president based solely on the CQ analysis.", "Shaheen communications director Shripal Shah said the former New Hampshire governor only votes with Obama when it \"makes sense for New Hampshire.\" At times, she has broken with the president, and in some cases on issues that have not come to a vote.", "For instance, Shah noted that Shaheen opposes an Internet sales tax -- something Obama has endorsed. She also spoke out against another round of military base closures, an idea the Obama administration advanced in budget proposals, and opposed a proposal floated by the president to change Social Security benefits.", "There are also other ways to measure Shaheen’s voting tendencies. OpenCongress, a nonpartisan legislative tracking service, found that in 2013, Shaheen voted with the majority of Democrats 93.1 percent of the time. That’s less frequently than the average Democrat in the Senate, putting her on the bottom half of the list.", "In October 2013, a column published in The Telegraph of Nashua by veteran New Hampshire political reporter Kevin Landrigan stated that Shaheen \"has had success throughout her political career by carving out issues over which she has crossed party lines to try to get results.\"", "And in June 2013, Shaheen was featured as a \"Bipartisan Champion\" by the Bipartisan Policy Center for her work on energy efficiency legislation.", "Shaheen’s camp also pointed to the relatively small set of votes considered in the Congressional Quarterly analysis of presidential support. In 2013, for example, the Senate took 291 roll call votes. CQ registers Obama as having taken a clear stance on only 108 of those votes, or about one third. Many were votes on presidential nominations.", "\"It's disingenuous to draw conclusions about Sen. Shaheen's record by only looking at a small number of votes,\" Shah said.", "That’s a valid point. But Shaheen didn’t show the same reluctance to evaluate politicians based on presidential support when she first ran for a U.S. Senate seat.", "During a 2008 debate with then-Sen. John E. Sununu, Shaheen said that Sununu voted with President George W. Bush 90 percent of the time. The NHGOP directed us to a video recording of the debate.", "Our ruling", "The New Hampshire Republican Party said that Shaheen votes with Obama 99 percent of the time.", "Indeed, in 2013, Shaheen took the same position as the president 99 percent of the time when Obama outlined a clear position, based on analysis by Congressional Quarterly. And overall, her votes have aligned with the president’s wishes 98 percent of the time since she took office.", "We should note that it’s fairly common for a senator to vote in support of a president of the same party and in some cases Shaheen has broken from the President. Still, NHGOP’s claim about Shaheen wasn’t far off. If the party had specified it was referring only to votes in 2013, the advertisement would have been right on the money. We rate the claim Mostly True.", "NHGOP, \"AS BIDEN HEADS TO GRANITE STATE, NHGOP LAUNCHES NEW WEB VIDEO: ‘99 PERCENT,’\" March 24, 2014.", "PolitiFact, \"Begich supports 97 percent of Obama's economic policy, GOP challenger says,\" Feb. 21, 2014.", "PolitiFact, \"Connie Mack says Bill Nelson votes 98 percent of the time with Obama,\" Oct. 17, 2012.", "PolitiFact Ohio, \"Sherrod Brown ‘has voted with Barack Obama 95 percent of the time,’\" Jan. 25, 2012.", "Email interview with Shripal Shah, spokesman for the office of U.S. Sen. Jeanne Shaheen, April 3, 2014.", "Email interview with Matt Mowers, executive director of the New Hampshire Republican Party, April 2, 2014.", "Bipartisan Policy Center, \"A Bright Idea in Energy Policy,\" June 3, 2013.", "Huffington Post, \"Red-State Democrats Buck Obama On Social Security Cuts,\" May 6, 2013.", "U.S. Senate roll call vote on S. 743 (Marketplace Fairness Act of 2013), accessed April 2014.", "American Research Group, Quarterly Survey - March 2014, March 17, 2014.", "American Research Group, The New Hampshire Poll, March 17, 2014.", "American Research Group, Obama Overall Job Approval Unchanged, March 21, 2014.", "The WMUR Granite State Poll, \"Obama’s approval ratings slide as sixth year begins,\" Jan. 28, 2014.", "The WMUR Granite State Poll, \"Health care law still unpopular in NH, most think health care costs will increase,\" Feb. 3, 2014.", "CQ Weekly, Vote Studies 2009, accessed April 2014.", "CQ Weekly, Vote Studies 2010, accessed April 2014.", "CQ Weekly, Vote Studies 2011, accessed April 2014.", "CQ Weekly, Vote Studies 2012, accessed April 2014.", "CQ Weekly, Vote Studies 2013, accessed April 2014.", "OpenCongress, \"Voting with Party,\" accessed April 11, 2014.", "YouTube, \"Shaheen: Sununu Has Voted With Bush 90%,\" Feb. 27, 2014.", "The Telegraph of Nashua, \"Bragdon goes on offense in offering defense,\" Oct. 20, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]