["Bollywood actor Akshay Kumar’s recent ‘non-political’ interview with Prime Minister Narendra Modi raised eyebrows with respect to the timing of the interaction. The interview was held mid-elections and telecast across mainstream news channels thus, drawing its fair share of criticism and reviving the controversy over Kumar’s citizenship – whether he is an Indian or a Canadian citizen.", "The actor recently ducked the question of voting in the ongoing Lok Sabha elections and the video of the event gained vigorous momentum on social media. Kumar subsequently put out a statement on Twitter on May 3 saying, “I have never denied or hidden that I hold a Canadian passport.”", "pic.twitter.com/i0JEmbFh9c", "— Akshay Kumar (@akshaykumar) May 3, 2019", "“About the Canadian thing, I am an honorary citizen. I’ve been given an honorary thing. I think it’s something people should be proud about. I also have a doctorate, doesn’t mean I am a ‘doctor doctor’. This is what people need to understand,” said Kumar in a Times Now interview broadcast on August 11, 2017.", "I am an honorary citizen of Canada. I think people should be proud of: @akshaykumar #AkshayOnTheNewshour pic.twitter.com/GB2qTz18eB", "— TIMES NOW (@TimesNow) August 11, 2017", "He reiterated the same in a public interaction available on YouTube. When a reporter questioned Kumar on his Wikipedia page mentioning that he is a Canadian national, the actor replied, “That is honorary. It is not what you think.”", "The website of Canadian Prime Minister Justin Trudeau lists the people who have been given honorary Canadian citizenship. Only six individuals in the world have been so far named honorary citizens of the country, the latest being Pakistani Noble Laureate Malala Yousafsai. The five others are Raoul Wallenberg, Nelson Mandela, the 14th Dalai Lama, Aung San Suu Kyi, and the Aga Khan.", "Myanmar politician Aung San Suu Kyi’s honorary citizenship was, however, revoked by Canada last year citing human rights violation by the Burmese military and the government against Rohingya Muslims. Based on the information available on the Canadian PM’s website, only five people currently hold the title of honorary citizens of Canada and Akshay Kumar is not one among them.", "During a 2014 debate on honorary citizenship in the Canadian Parliament, Senator Stephen Greene mentioned that the country bestows the title to only those who have achieved “historic accomplishment that advances freedom.” Kumar evidently does not fall under this category of individuals.", "In his recent tweet, Kumar said that he holds a Canadian passport. This statement itself is sufficient to debunk his own claim of being an honorary citizen of the country. Honorary citizenship is a purely symbolic gesture. “It does not come with any rights or privileges, such as a Canadian passport or the right to vote in national elections,” per a report in Al Jazeera.", "Bollywood actor Akshay Kumar was never an honorary citizen of Canada. His recent tweet debunks a piece of misinformation propagated by the actor himself. If Kumar holds a Canadian passport, he cannot be an honorary citizen of the country.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]