["About this rating", "Fans of actor Tom Cruise were in for a bit of a bait-and-switch at Comic-Con in San Diego, California, when an impersonator bearing a striking resemblance to the \"Top Gun\" star made an appearance on July 21, 2019.", "It's easy to see why people were confused. The real Tom Cruise did make an appearance at the convention to promote \"Top Gun: Maverick,\" the forthcoming sequel to the original 1986 movie.", "But many were fooled by Jerome LeBlanc, a Canadian-born actor who not only looks like Cruise but also has taught himself how to mimic the way Cruise talks and laughs. His impersonation is apparently so spot on that the Montreal native has made a living on it.", "LeBlanc posted videos on his Instagram and YouTube pages showing himself in a bright-red sports car, greeting fans who apparently thought he was the Maverick himself.", "LeBlanc confirmed to Mark Saunders, a journalist for local San Diego ABC affiliate 10News, that it was he and Donut Bar founder and chef Santiago Campa who were driving around in the Ferrari, delighting many who likely labored under the impression they had just met the real Tom Cruise.", "Update: Jerome LeBlanc got us all real good ? Bravo, Mav #SDCC #ComicCon pic.twitter.com/gXI0CVed5y", "— Mark Saunders (@MarkCSaun) July 22, 2019", "LeBlanc also posted footage he took that day on his YouTube channel, which can be viewed here:", "In an email to Snopes, LeBlanc confirmed he was the one in the car and socializing with fans, not Cruise, adding \"I’m having a good time doing what I’m doing!\"", "Entertainment Tonight Online. \"Fake Tom Cruise Nearly Causes a Riot at Comic-Con 2019.\"", "MacDonald, Brady. \"Comic-Con 2019: This Maverick Tom Cruise Lookalike Went From the Danger Zone to the ‘Top Gun’ Bar in San Diego.\"\r\n  The Orange County Register. 19 July 2019.", "Radin, Danielle. \"Think You've Seen Tom Cruise Around San Diego? Think Again!\"\r\n  KNSD. 5 July 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]