["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One of the more quirky aspects of Oregon Tax Law is a little provision that lets folks donate $50 to a political causes -- $100 per couple -- and get a tax credit back on their next return. An actual credit, too, none of that deduction stuff.", "The law has been around since 1969, according to a report by the Oregon Secretary of State’s office. The provision, however, was up for expiration at the end of this year and some were calling for the Legislature to let it die as lawmakers looked for savings.", "The Oregonian’s own editorial board urged lawmakers to kill the credit: \"There's nothing wrong with contributing money -- as much as you want -- to political committees and candidates who share your views. Even during the best of times, however, there's no compelling reason for the state to subsidize people's political activities through the use of an income tax credit.\"", "As it turned out, though, the provision -- with one change that we’ll get to later -- managed to survive by piggybacking on a larger tax bill.", "Kari Chisholm, the man behind the left-leaning political blog Blue Oregon, was explaining the tax break’s good luck in an interview on \"Carl in the Morning,\" a progressive internet talk radio show.", "\"Tucked deep into that bill was an extension of the Oregon political tax credit, something I think is an extraordinary expression of our Democracy in Oregon that every state should have and no other state does.", "\"If you give $50 to a political campaign or a political organization of your choice then you get 50 bucks off your taxes the following year.\"", "Naturally, the superlative caught our attention. Was Oregon really the only state with such a provision?", "We called the National Council for State Legislatures first to see if they had any experts on hand. Mandy Rafool, who works with their financial affairs program, got back to us immediately via email. \"I think it is unusual for states to offer credits for these contributions, although there are a few that offer them (Ohio and Oregon come to mind).\"", "Rafool then pointed us toward a January 2013 study by the Wisconsin Legislative Fiscal Bureau that looked at every state’s tax code and teased out the various rates, credits and exemptions in each. We did a quick look through the study and found that three other states, aside from Oregon, offered a political contribution credit: Ohio, Virginia and Arkansas.", "Now each state’s law varies some, and none of them is quite as expansive as Oregon’s.", "Arkansas’ law is the closest, but it doesn’t allow the credit for federal offices, where as Oregon’s does so long as the candidate appears on a state ballot. Meanwhile, Ohio limits its credits to donations made toward statewide offices and races for the legislature. Virginia’s is fairly strict as well. That state only gives credits for donations made during an election year and even then it offers half of what the other states do, $25 per person or $50 per couple.", "Oregon’s law, relatively speaking, is pretty loose. It can be applied to donations made, at any time, to political parties, state political action committees and any candidate -- federal, state or local -- that appears on an Oregon ballot.", "For as expansive as the credit is, though, it turns out it doesn’t get much use. The credit gets claimed most often during presidential election years, according to the Secretary of State’s office, but even at it’s peak, only about 7.8 percent of filers took advantage.", "For the 2011-13 biennium, the estimated cost to the Oregon’s bottom line was about $15 million. For the 2013-15 cycle, the state is expected to pay out just less than $7 million.", "Also worth a note: People making more than $77,000 a year account for 58 percent of those using the credit.", "That last fact may change moving forward. Remember that tweak to the credit we mentioned in passing? Well, when lawmakers re-approved the measure, they took the perk away for singles with adjusted gross incomes above $100,000 and joint filers above $200,000.", "All that aside, we asked Chisholm to weigh in on what we’d found. Initially, he was unaware the other three states gave tax credits for political contributions. After some research, he pointed out, as we have, that Oregon’s tax credit is more generous than the other three states.", "\"While it's true that three other states have a political contribution tax credit -- and they are to be hailed for their forward thinking! -- it's also true that Oregon provides donors with the greatest possible choice about where to direct their donations,\" Chisholm wrote in an email. \"And that, truly is ‘an extraordinary expression of our democracy in Oregon that every state should have and no other state does.’\"", "He may be right, but his initial comments were not so specific. He said on the radio show that Oregon was the only state to offer a political tax credit. Had he said specifically that Oregon offered the most expansive political tax credit, or some similar qualifier, we’d be inclined to give him a higher rating. But as it stands, he used a superlative that just doesn’t stand up under scrutiny.", "We rate this claim False.", "Kari Chisholm, Carl In the Morning, July 8, 2013", "State of Oregon, 2013-15 Tax Expenditure Report", "Wisconsin Legislative Fiscal Bureau, Individual Income Tax Provisions in the States, January 2013", "Ohio Laws and Rules, Credit for (political) contributions", "Virginia Department of Taxation, Political Contribution Credit", "State of Arkansas, Political Contributions Credit form", "E-mail from Kari Chisholm, July 31, 2013", "E-mail from Mandy Rafool, National Conference of State Legislatures, July 30, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]