["About this rating", "On 3 June 2018, the fake news web site Your News Wire published an article under the headline \"Pope Francis Orders White Women to ‘Breed’ with Muslims,\" which opened as follows:", "Pope Francis has compared Jesus Christ to the leader of an Islamic terrorist death cult and suggested Christian missionaries have a lot in common with members of ISIS, during a wide-ranging and shocking interview in which he also openly promoted socialism and ordered European women to “breed” with Muslim migrants in order to counter “declining birth rates.”", "“Today, I don’t think that there is a fear of Islam as such but of ISIS and its war of conquest, which is partly drawn from Islam,” he told French newspaper La Croix. “It is true that the idea of conquest is inherent in the soul of Islam, however, it is also possible to interpret the objective in Matthew’s Gospel, where Jesus sends his disciples to all nations, in terms of the same idea of conquest.”", "Your News Wire's source for this headline claim was an interview with Pope Francis which had been published by the French-language religious newspaper La Croix (\"The Cross\") over two years earlier, from which Your News Wire quoted only two, out-of-context sentences:", "It was at this point in the interview that Pope Francis called on European women to “integrate” Muslim migrants into their populations by breeding with them and countering the “declining birth rate” that he blames on the selfishness of white people.", "“This integration is all the more necessary today since, as a result of a selfish search for well-being, Europe is experiencing the grave problem of a declining birth rate,” he stated. “A demographic emptiness is developing.”", "That short passage was a ridiculous characterization of what Pope Francis actually said, which was not in any way to state that \"white women must 'breed' with Muslims.\"  What the pope asserted (in reference to migrants in general, not Muslims specifically) is that European countries need to integrate migrants into their societies rather than ‘ghettoizing’ and isolating them, and that this issue is all the more critical because the native birth rates in those countries has been declining:", "Coming back to the migrant issue, the worst form of welcome is to ‘ghettoize’ them. On the contrary, it’s necessary to integrate them. In Brussels, the terrorists were Belgians, children of migrants, but they grew up in a ghetto. In London, the new mayor (Editor: Sadiq Khan, the son of Muslim Pakistanis) took his oath of office in a cathedral and will undoubtedly meet the queen. This illustrates the need for Europe to rediscover its capacity to integrate.", "I am thinking here of Pope Gregory the Great, who negotiated with the people known as barbarians, who were subsequently integrated. This integration is all the more necessary today since, as a result of a selfish search for well-being, Europe is experiencing the grave problem of a declining birth rate. A demographic emptiness is developing. In France, at least, this trend is less marked because of family-oriented policies.", "What Pope Francis expressed in this regard was hardly novel or questionable, as other sources (exemplified by the following 2005 Atlantic article) have been stating similar concerns about the development of growing, marginalized population groups in Europe for many years now:", "Birth rates have fallen well below replacement levels in a number of European countries, and there is little expectation that this trend will reverse itself. The latest UN projections see Europe's overall population dropping from about 728 million in 2000 to roughly 630 million in 2050.", "[I]ntegrating even existing Muslim minorities already poses a serious cultural and political challenge for European society. The relatively small size of the Islamic population is counterbalanced by its concentration in a few Western European nations — particularly France, Germany, and the Low Countries — and by the tendency of Muslim immigrants to cluster around large cities (two fifths of Britain's Muslims live in greater London, and a third of France's Muslims in the Paris area), often in neighborhoods and vast housing projects that are culturally and economically isolated from the wider society.", "The inhabitants of these Muslim ghettos are vulnerable to the woes that usually afflict marginalized populations: high crime rates, poor education, rampant unemployment.", "Dmitry, Baxter.   \"Pope Francis Orders White Women to ‘Breed’ qith Muslims.\"\r\n    Your News Wire.   3 June 2018.", "Goubert, Guillaume and Sébastien Maillard.   \"INTERVIEW: Pope Francis.\"\r\n    La Croix.   17 May 2016.", "Pew Research Center.   \"Muslims in America: Immigrants and Those Born in U.S. See Life Differently in Many Ways.\"\r\n    17 April 2018.", "Douthat, Ross.   \"A Muslim Europe?\"\r\n    The Atlantic.   January/February 2005.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]