["About this rating", "On 22 February 2018, the Your News Wire web site published an article reporting that former U.S. president Barack Obama had announced plans to become Secretary-General of the United Nations:", "Barack Obama has announced plans to become secretary general of the United Nations, allowing him to advance his globalist agenda on the world’s stage.", "According to Al-Jarida, Obama has no intention to step away from the spotlight, much to the dismay of other world leaders such as Israeli Prime Minister Benjamin Netanyahu.", "U.N. Secretary General Ban Ki-moon’s term expires in early 2017, making Obama’s bid for the position a possibility.", "This story was false.  President Obama has announced no plans to seek the position of Secretary-General of the United Nations.", "The only source cited by Your News Wire for their article was a years-old, October 2016 report from a Kuwaiti newspaper that was described as \"far-fetched\" and unconfirmed at the time it was published:", "Kuwaiti newspaper A Jarida reported that US President Barack Obama seeks to be appointed UN secretary general after his second term as US president ends. The newspaper claimed that Obama has been discussing the idea with senior Democrats and Republicans, some of whom are Jewish.", "The report, which admittedly appears somewhat far-fetched, has not been confirmed by any other news outlets and does not name any of its sources.", "Moreover, the position of U.N. Secretary-General is not exactly one that can be gained through campaigning for it, nor is President Obama a likely choice for it.  First off, the Secretary General has to be nominated by the U.N. Security Council, and any one of that council's permanent members (China, France, Russian Federation, the United Kingdom, and the United States) could veto that selection — meaning that the Trump administration (and/or the Russian government) could unilaterally block any attempt by President Obama to become U.N. Secretary-General.", "Additionally, the Secretary-General has to be appointed by the General Assembly (which comprises all 193 member states), many of whom would likely reject the thought of an American's leading that global organization. Finally, President Obama would be an unlikely choice for the role of U.N. chief administrative officer because, as Wikipedia notes, \"most Secretaries-General are compromise candidates from middle powers and have little prior fame\" (but Barack Obama hails from a major power and has achieved international fame).  The U.N. has never selected a Secretary-General from North America, and only once in United Nations history has a candidate from anywhere in the Americas been appointed to that position (Peruvian diplomat Javier Pérez de Cuéllar, who served from 1982 to 1991).", "Most crucially, Your News Wire's statement that \"U.N. Secretary General Ban Ki-moon’s term expires in early 2017, making Obama’s bid for the position a possibility\" is woefully outdated. (This is not surprising, given that Your News Wire essentially ripped off a January 2016 Townhall article for their own report.)  Former Portuguese prime minister António Guterres took over as U.N. Secretary-General on 1 January 2017, and given that appointees traditionally hold that position for two five-year terms, President Obama would likely be facing a nine-year wait even if he were interested in making a bid for the U.N. spot.", "The falsity of this report is part and parcel for YourNewsWire, which is a clickbait-driven fake news site.", "Barkoukis, Leah.   \"Report: Obama Wants to Become UN Secretary General, Netanyahu Doing Everything He Can to Stop Him.\"\r\n    Townhall.   10 January 2016.", "Wood, L. Todd.    \"Netanyahu Leading Effort to Thwart Obama Bid for U.N. Chief.\"\r\n    The Washington Times.   8 January 2016.", "Adl-Tabatabai, Sean.   \"Obama Announces Bid to Become UN Secretary General.\"\r\n      Your News Wire.   22 February 2018.", "Ronen, Gil.   \"Netanyahu 'Fighting Obama's Plan to Be UN Sec-Gen.'\"\r\n    Arutz Sheva.   1 October 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]