["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After wealthy financier and accused child sex trafficker Jeffrey Epstein was arrested in July and then found dead in a Manhattan jail cell in August, rumors have swirled on the internet about his high-profile relationships with President Donald Trump and former President Bill Clinton and the details surrounding his death.", "Now, another rumor posted on Facebook claims that CNN President Jeff Zucker ordered his employees to downplay Clinton’s relationship with Epstein and make Trump’s connection to him appear more sinister.", "The full post reads:", "\"CNN President Jeff Zucker ordered employees to downplay Bill Clinton’s relationship with Jeffrey Epstein. ‘We have to make it look like Epstein was Trump’s partner in all of this. Don’t mention the Clintons. This could kill us in 2020!’ \"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This quote appears entirely contrived. We could not find any evidence that Zucker directed employees at CNN to downplay or highlight any of Epstein’s high-profile relationships.", "Nowhere in the public record does Zucker’s alleged statement appear. There are no news reports about it. The claim only appears in a handful of unsourced, vague social media posts.", "A CNN spokesperson also told PolitiFact there is \"absolutely no truth to this rumor.\"", "We rate the claim Pants on Fire!", "Facebook post, Aug. 14, 2019", "Vox, Jeffrey Epstein, the convicted sex offender who was friends with Donald Trump and Bill Clinton, explained, Aug. 10, 2019", "CNBC, Jeffrey Epstein had broken neck bones — raising questions about the accused sex trafficker’s cause of death, Aug. 15, 2019", "PolitiFact, Explaining the Jeffrey Epstein conspiracy theories linked to Trump, Clinton, Aug. 13, 2019", "Email interview, Barbara Levin, CNN spokesperson, Aug. 15, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]