["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a nationally televised interview, the governor of Texas said the border with Mexico remains unsecured — and offered up a figure as evidence.", "On CBS’s \"Face the Nation,\" Abbott predicted a Texas-led court challenge to President Barack Obama’s actions shielding millions of unauthorized immigrants from deportation would end up at the Supreme Court. Reporter Bob Schieffer then asked if Abbott thought Congress should proceed to fully funding the Department of Homeland Security rather than keep pushing a Republican-steered proposal to tie continued funding to repealing Obama’s immigration actions.", "Abbott replied, in part, that:", "\"...the first thing that we want to get out of Washington, D.C., is full funding to secure the border. The reason why we're in this problem to begin with is because the federal government has not stepped up to fulfill its duty to secure the border… Already this calendar year, since Jan. 1, we have had more than 20,000 people come across the border, apprehended, unauthorized. And so we have an ongoing problem on the border that Congress must step up and solve.\"", "We were curious about the 20,000-plus count.", "Abbott’s office didn’t engage when we inquired, but Tom Vinger, a spokesman for the Texas Department of Public Safety, separately emailed us a Feb. 18, 2015, agency document, \"Texas Border Security Dashboard,\" including a chart stating that 21,808 \"illegal aliens\" had been arrested by the U.S. Border Patrol since Jan. 1, 2015, in the agency’s Texas sectors, including 14,281 in its busy Rio Grande Valley sector. Vinger said the counts were current as of approximately Feb. 18.", "Federal confirmation unavailable", "Our attempts to match those figures with information provided by the Border Patrol fell short. Spokesman Carlos Lazo said by email he didn’t have February 2015 apprehension totals.", "Separately, El Paso-based Border Patrol spokesman Doug Mosier emailed a chart indicating that in January 2015, 21,518 individuals were apprehended in the agency’s Southwest sector, covering Texas to San Diego, Calif. From that chart, we calculated that 13,289 people were apprehended in the Texas sectors that month, 8,427 of them in the Rio Grande Valley.", "Such arrests down from 2014? Uncertain", "Given that Abbott offered his figure as an indicator of border insecurity, we wondered how the government’s Texas apprehensions in January 2015 compared with such arrests in previous Januarys. To make that comparison, we turned to a Border Patrol presentation showing month-by-month counts from 2000 through most of 2014.", "Upshot: The 13,289 January 2015 Border Patrol apprehensions on the Texas side of the Rio Grande ran 5,409 behind some 18,698 apprehensions the same month a year earlier. The 2015 count was about 1,000 less than the 14,2013 apprehensions in January 2013. The January 2015 apprehensions exceeded the 10,846 and 7,779 apprehensions in Texas in January 2012 and January 2011, respectively.", "U.S. Border Patrol Apprehensions of Unauthorized Immigrants in Texas", "Region", "JAN. 2015", "JAN. 2014", "JAN. 2013", "JAN. 2012", "JAN. 2011", "Big Bend", "234", "278", "340", "323", "332", "Del Rio", "986", "1,514", "1,617", "1,204", "899", "El Paso", "875", "813", "1,776", "625", "779", "Laredo", "2,767", "3,838", "3,280", "3,180", "2,285", "Rio Grande Valley", "8,427", "12,255", "7,190", "5,514", "3,485", "TOTAL", "13,289", "18,698", "14,203", "10,846", "7780", "Source: Chart, \"Total Illegal Alien Apprehensions By Month,\" Fiscal 2000 through Fiscal 2014, U.S. Border Patrol (downloaded Feb. 26, 2015)", "We asked DPS if it had information on the significance of there being fewer apprehensions in early 2015 than the year before.", "Vinger emailed: \"We can’t comment specifically on the Border Patrol numbers you provided.\" Still, he noted, fewer apprehensions occurred in the Rio Grande Valley, where the state has devoted resources to securing the border.", "The \"dashboard\" document says: \"On June 18, 2014, the state Legislature and Texas leadership directed the Department of Public Safety to conduct a multi-agency surge operation in the Rio Grande Valley, which began on June 23, 2014. The goal of Operation Strong Safety is to prevent Mexican cartels, their operatives, transnational gangs, criminal aliens, potential terrorists and drugs from entering Texas between the Ports of Entry (POEs) through sustained, around-the-clock, ground, air and marine saturation patrols on the Texas/Mexico border, and in doing so, reduce transnational crime throughout Texas.\"", "Our ruling", "Discussing the security of the Texas-Mexico border, Abbott said since Jan. 1, 2015, \"we have had more than 20,000 people come across the border, apprehended, unauthorized.\"", "State-provided figures indicate nearly 22,000 apprehensions by the Border Patrol from January through mid-February 2015. We didn't gather sufficient data to tell if that tally is down from the comparable part of 2014.", "We rate the statement True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Transcript, \"Face the Nation,\" CBS News, Feb. 22, 2015", "Document, \"Texas Border Security Dashboard,\" Texas Department of Public Safety, Feb. 18, 2015 (received by email from Tom Vinger, press secretary, DPS, Feb. 25, 2015)", "Chart, U.S. Border Patrol Apprehensions, October 2014 through January 2015, Texas sectors (based on a more comprehensive chart received by email, Doug Mosier, public affairs officer, U.S. Customs and Border Enforcement, Feb. 24, 2015)", "Email, Tom Vinger, DPS, Feb. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]