["The photo was shared with various claims about the Amazon fires in English, Spanish and French. One of the English posts says: “Such a poignant picture which tells a thousand stories...A Jaguar, exhausted by trying to escape the raging fires in the Amazon is rescued by a human - the very species which is wrecking it’s environment and the world at large...at an alarming rate.”", "However, this photo does not show the rescue of an animal from the 2019 fires in the Amazon.", "The jaguar is named Jiquitaia and it was adopted by the Amazon Military Command in early 2015 when it was still a young animal. A year later, on March 8, 2016, photographer None Mangueira published photos of the animal playing with some officers on her Facebook account. The photographer confirmed to AFP that she was the one who captured the moment in the water.", "This is not the first time that Mangueira's work has been shared out of context: in 2016, a jaguar used in a ceremony as the Olympic torch passed through Brazil's Amazon was killed when it escaped its handlers and threatened a vet. Images of Jiquitaia were used as if they showed the dead animal and Mangueira was forced to deny it on her Facebook account.", "AFP has fact-checked other images that do not depict the current fires in the Amazon rainforest.", "#PrayforAmazonas: Thousands of people are sharing old pictures in posts about the Amazon rainforest fires", "These images do not show wet weather in the Amazon rainforest after fires erupted in 2019", "Most of these photos show animals burned by forest fires outside Brazil before the 2019 Amazon wildfires", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]