["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is a screenshot from a video showing a Seattle police officer trying to gain entry to a building.", "A video shows an officer trying to break into a Target store that had been boarded up but was partially breached.", "Officers arrested three men who were inside on burglary charges.", "A Facebook user who posted a video after protests over the death of George Floyd accused police in Seattle of framing protesters.", "\"Seattle Police Department vandalizing private property in uniform to frame protesters after the latter have all gone home for the evening,\" the May 31 post says.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The 30-second video is not marked to show where or when it was recorded. It was recorded outdoors after dark on a street corner, with no narration.", "Here’s what we learned.", "Hours before the video was posted on Facebook, it was posted on Twitter, with this message: \"Why is Seattle police destroying property? Please email to SPD.\" The Twitter user who posted the video also identified the location as being \"taken at Target in downtown Seattle.\"", "When we contacted Seattle Police on June 1, a spokesman told us the officers in the video were trying to gain entry into a store and, once they did, they arrested three men inside on burglary charges.", "The video shows Seattle officers in front of the downtown Target about 1:30 a.m. on May 31, the spokesman said. The officers had seen a large hole in a front window of the store; the clip shows one of them trying to break more glass in order to gain entry. The officers eventually got inside the store and arrested three men from Washington state on burglary charges, the spokesman said.", "Also on June 1, Seattle police published a number of tweets about the incident.", "\"We've received a number of questions about this video,\" read one. It shows officers responding to a *burglary* at the 2nd/Pike Target @ ~1:30 AM on 5/31. Officers had to chip away at the already broken glass windows to safely make entry and arrest the three burglars inside.\"", "In another, the agency responded to a question from a Twitter user on whether 911 had been called. It pointed readers to a link showing the 911 automated feed and noted that the call was closed at 4:22 a.m. In response to another question on the social media platform, the agency tweeted: \"As referenced above, it appears the suspects entered through a large hole in the glass windows. Officers used the same access point to enter after clearing some of the jagged glass.\"", "Additionally, an online Seattle police blotter lists the incident 2020-177666, labeled as a burglary/breaking and entering, at 1:14 a.m. on May 31 in the 1400 block of Second Ave. The Target store’s address is 1401 Second Ave. PolitiFact requested a copy of the police report about the incident, but did not immediately receive a response.", "The Seattle Times reported that on May 31, the date of the post, hundreds of businesspeople and volunteers cleaned up the damage downtown from two nights of rioting.", "Matthew Stamm, head of the Multimedia and Information Security Lab at Drexel University in Philadelphia, and Denis Teyssou, editorial manager of the AFP Medialab in France, confirmed that the video appears to show a Target store at the intersection of Second Avenue and Pike Street in downtown Seattle. Stamm said he compared frames from the video with images taken from Google Street View; Teyssou said he used a tool called context aggregation and analysis from the WeVerify European project.", "This video was posted with a claim that it shows police vandalizing a building to \"frame protesters.\"", "A police spokesperson says it shows officers trying to gain entry to a Target in response to a burglary. Police say they arrested three suspected burglars inside.", "We rate this claim False.", "Facebook, post (archived here), May 31, 2020", "Interview, Matthew Stamm, associate professor of electrical and computer engineering and leader of Drexel’s Multimedia and Information Security Lab, June 1, 2020", "Email, Denis Teyssou, editorial manager, AFP Medialab, June 1, 2020", "Email, Danielle Deibler, CEO of Marvelous AI, June 1, 2020", "Interview, Seattle police public affairs, June 1, 2020", "Twitter, post, May 31, 2020", "Twitter, Seattle police tweet, June 1, 2020", "Seattle Police Calls for Service blotter, incident 2020-177666, May 31, 2020", "Email, Sean Quinn, KIRO-TV assignment editor, June 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]