["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican candidate for U.S. Senate Sen. Kelly Loeffler speaks at a campaign rally on Friday, Nov. 13, 2020, in Cumming, Ga. Loeffler and Democratic candidate Raphael Warnock are in a runoff election for the Senate seat in Georgia. (AP)", "A Parler message about Black voters that was attributed to Loeffler and depicted in a Facebook post is from a fake account, not the senator’s.", "A fake post on social media makes it look like Sen. Kelly Loeffler, a white Georgia Republican, called for putting the brakes on efforts to register more Black and Democratic voters.", "\"Wondering what’s up with Parler? Here’s Sen. Kelly Loeffler saying black people shouldn’t be allowed to vote,\" said a Nov. 13 Facebook post.", "The accompanying screenshot purports to show a post by Loeffler on Parler, a social media platform popular with conservatives. It stated: \"Here are the #FACTS: Under the watch of Secretary Raffensperger, Stacey Abrams registered hundreds of thousands of black and Democrat voters. We can't let that happen again.\"", "Loeffler didn’t write that.", "Brad Raffensperger is Georgia’s Republican secretary of state. Abrams is a voting-rights activist and former state lawmaker who narrowly lost a bid for governor in 2018.", "Loeffler faces the Rev. Raphael Warnock, a Democrat, in one of two Jan. 5 runoffs for Georgia’s U.S. Senate seats. In the other race, first-term GOP Sen. David Perdue faces Democrat Jon Ossoff, a documentary filmmaker.", "The screenshot appeared on Facebook, where it was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Multiple people shared screenshots of the Parler post on Twitter as well.", "The screenshot depicts a post written under the account @SenatorKellyLoeffler. But that’s a fake account, said Loeffler spokesperson Stephen Lawson. On Parler, the account is listed as private and was formed eight days ago, shortly after the Nov. 3 election. We couldn’t determine whether such a message was actually posted under this account.", "Parler’s community guidelines ban \"any use of another’s name or likeness in a confusing or deceptive manner.\" We asked Parler whether it plans to remove the fake Loeffler account and did not get an immediate response.", "Loeffler’s actual Parler account, @KLoeffler, showed no posts in which she commented about registering Black voters or any work by Abrams.", "Abrams created the New Georgia Project about six years ago to register people to vote. That organization and other groups as well as the Motor Voter law are credited with helping register hundreds of thousands of new voters, including voters of color.", "Black voters were pivotal to Joe Biden’s narrow victory in Georgia in the Nov. 3 presidential election, and Democratic activists are counting on them to play a significant role in the Jan. 5 runoffs.", "The voter registration deadline for the runoff is Dec. 7.", "A Facebook post said Loeffler said on Parler that \"Black people shouldn’t be allowed to vote.\"", "The screenshot depicts a Parler post that is from a fake account. Loeffler’s actual Parler account included no such statement about Abrams registering Black or Democratic voters.", "We rate this claim Pants on Fire.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 13, 2020", "Sen. Kelly Loeffler, Facebook post about joining Parler, June 29, 2020", "Sen. Kelly Loeffler, Tweet, June 29, 2020", "Lead Stories, Fact Check: Sen. Loeffler Did NOT Post On Parler That Stacey Abrams Can't Be Allowed To Register Hundreds Of Thousands Of Black Georgia Voters Again, Nov. 13, 2020", "Georgia Public Radio’s Stephen Fowler, Tweet, Nov. 14, 2020", "Atlanta Journal-Constitution, Election Day arrives: 5 factors that will decide Georgia’s 2020 race, Nov. 3, 2020", "Atlanta Journal-Constitution, Black organizations across Georgia put in the work to turn state blue, Nov. 10, 2020", "Atlanta Journal-Constitution, U.S. SENATE RUNOFFS; ; Abrams puts all her focus on Georgia's U.S. Senate runoffs, Nov. 14, 2020", "NPR, Former Georgia Gubernatorial Candidate On A Push For Voter Turnout, Nov. 2, 2020", "Washington Post, Stacey Abrams garners praise from Democrats on the verge of achieving a long-held dream: Flipping Georgia, Nov. 6, 2020", "Washington Post, Exit poll results and analysis for the 2020 presidential election, Nov. 10, 2020", "Pew Research Center, Key facts about Black eligible voters in 2020 battleground states, Oct. 21, 2020", "Parler, Community Guidelines, Nov. 7, 2020", "Twitter messages, Stephen Lawson, spokesperson for Sen. Kelly Loeffler, Nov. 16, 2020", "Email interview, Seth Bringman, spokesperson for Fair Fight, Nov. 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]