["“Bravo Sanghis,” tweeted Bollywood actor Koena Mitra while applauding purported relief work of RSS workers during the recent Kerala floods. Her tweet has been liked by over 800 people and retweeted 225 times.", "Bravo Sanghis 👏👏👏👏👏 https://t.co/cfmxfT1PW1", "— Koena Mitra (@koenamitra) August 13, 2018", "The images shared by Mitra was posted by the Twitter handle @DrGPradhan, who is followed by Prime Minister Modi, Railway Minister Piyush Goyal’s office and newly appointed RBI Director S Gurumurthy. His on the nose tweet been retweeted 1,899 times.", "Finally, Jesus has arrived in Kerala to save people from the flood in KAHKI Chaddi pic.twitter.com/cTpHDjVYeW", "— #GauravPradhan 🇮🇳 (@DrGPradhan) August 13, 2018", "The identical set of images was also shared by Facebook page The Youth, with the caption that “media will never show this”. The post has been shared by over 1,500 people, including a Twitter handle followed by Goyal’s office. The user describes himself as a “swayamsevak”.", "Let’s heartily thank RSS workers for their selfless dedication..", "Posted by The Youth – Politics on Sunday, 12 August 2018", "The new Facebook page of rumour mongering website Postcard News, Post Card Fans, also circulated the image with the similar “media will never show this” narrative.", "Posted by Post Card Fans on Sunday, 12 August 2018", "Ironically, Postcard News had shared the same photographs in September 2016 as RSS workers helping Bihar flood victims, along with their repetitious narrative against media.", "Alt News also found multiple users on social media who shared these identical images between August 27 and August 28, 2016, as West Bengal floods that same year (1,2,3, 4).", "Both West Bengal and Bihar faced severe flooding in August 2016. However, we could not independently confirm whether these viral images of RSS worker providing aid was taken during floods in either of the two states. However, it is clear that the photographs do not pertain to the recent flooding in Kerala.", "Old images of RSS aid work are oftentimes circulated as a part of recent events. In an earlier article, Alt News reported how images of 2017 Gujarat floods were viral on social media as RSS aid work during recent Kerala floods.", "The official Facebook page of RSS also circulated an old image as recent Kerala floods and rectified the same after Alt New’s article.", "The death toll in devastating Kerala floods has crossed the 300-mark. In situations of such distress and panic, circulating old/unrelated images for propaganda is an insensitive tactic to gain commendation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]