["On January 7, Ashish Chauhan, national secretary of RSS-affiliated Akhil Bharatiya Vidyarthi Parishad (ABVP), tweeted photographs of Soori Krishnan, an activist with CPI’s student wing Students’ Federation of India (SFI). Chauhan suggested that Krishnan faked sustaining injuries during violence in JNU on January 5-6. In two of the photographs, Krishnan can be seen with bandages on his head and both arms which are absent in the third image.", "Comedy show of the left comrades", "SFI leader Soori from JNU after being ”brutally injured” in Delhi", "Seen completely in high spirits while welcomed with garlands in Trivandrum within 24 hours.#TukdeTukdeGang #JNUHiddenTruth #JNUViolence pic.twitter.com/8LqoiycnPY", "— Ashish Chauhan (@AshishSainram) January 7, 2020", "Chauhan’s tweet which has over 4,000 retweets reads, “Comedy show of the left comrades SFI leader Soori from JNU after being ”brutally injured” in Delhi Seen completely in high spirits while welcomed with garlands in Trivandrum within 24 hours.”", "Several others also claimed that Soori Krishnan faked his wounds including BJP MP Pratap Simha. He wrote in Kannada, “ABVPಯವರು ಹೊಡೆದರು ಎಂದು ಮೈತುಂಬ ಬ್ಯಾಂಡೇಜ್ ಕಟ್ಟಿಕೊಂಡವನ ಗಾಯಗಳು ಒಂದೇ ದಿನದಲ್ಲಿ ಮಾಯ.”", "State in-charge of BJP Odisha IT and social media Prabin Padhy tweeted that Krishnan’s “stitches were removed & wounds were healed in 24 hrs.”", "Meet #JNU #SFI leader #Soori admitted to hospital 4 ‘serious injuries’. From ICU, flew to Kerala, landed in Trivandrum in 24hrs. His stitches were removed & wounds were healed in 24 hrs🤔", "Total Bollywood👏🤪 (*Got from social media)@amitmalviya @ABVPVoice @abvpjnu @ABVPDelhi pic.twitter.com/sEC6cnTjiV", "— Prabin Padhy (@prabinkp) January 7, 2020", "Filmmaker Ashoke Pandit made similar allegations.", "Yesterday JNU SFI leader Soori was admitted to hospital with ‘serious injuries’. From ICU, he flew to Kerala, landed in Trivandrum in 24hrs. His stitches were removed…His wounds were healed in 24 hrs… magic of Marx !! #ShutdownJNUUniversity pic.twitter.com/gqC50OUQkt", "— Ashoke Pandit (@ashokepandit) January 7, 2020", "Pandit was earlier found retweeting a video which was shared with the false claim that Left parties in JNU attacked ABVP members when in fact the video showed an ABVP student assaulting a member of CPI (ML)-affiliated All India Students Association (AISA).", "In a video statement shared with Alt News, Soori Krishnan shows his wounds thus debunking the false claim that his injuries were not genuine. He claimed, “I was attacked by eight ABVP goons in front of Periyar hostel in JNU. They beat me with iron rods and I am going to show you the injuries I have right now.” Krishnan showed four injuries on his head, two of which were given sutures. He also asserted that he hurt his arms. “I can move my left arm but my right arm has swelling and I have a severe contusion on my shoulder due to which I cannot lift my arm.” Krishnan further explained the absence of bandages on his head. “Because of the suture tins, they [doctors] said I don’t need to cover my head. I had the covering on my head initially because there was profuse bleeding. Once the bleeding stopped they asked me to not cover my head.”", "The photo-montage below shows a close-up of Krishnan’s head injuries.", "The SFI activist also shared a copy of his outpatient report from AIIMS where he was admitted on January 5. While the report mentions that the patient suffered no fractures, it lists several external injuries – swelling and tenderness on both forearms and laceration or deep cuts on occipital, frontal and left parietal regions of the head.", "The photograph of Soori Krishnan circulating online to show that his wounds ‘healed’ within 24 hours was shot at Trivandrum airport. “There was a reception by left political parties DYFI and SFI,” he informed, adding that he visited Padmavati Medical Foundation in Kollam for further consultation. Dr Harikrishnan, orthopaedic surgeon treating Krishnan, told Alt News, “I have examined Soori Krishnan. He has severe contusions on his left forearm and right shoulder region. There is no fracture but we have restricted movement and he needs 2-3 weeks of medication. He also has mild scalp injuries which will heal in two weeks. But his forearms have severe swelling.”", "SFI activist Soori Krishnan’s photographs are therefore circulating with the false claim that he pretended to be injured during JNU violence. Among those who propagated the misinformation was ABVP national organising secretary Ashish Chauhan who tweeted on January 7. However, quite ironically, ABVP leader Janhawi Ojha had posted a list of students injured during the JNU violence a day before. This included Krishnan’s name. Ojha wrote that 15 out of the 23 wounded were ABVP activists. Ojha was the ABVP presidential candidate for JNUSU 2016 elections.", "Her January 6 Facebook post reads, “Out of the 23 students who were admitted to AIIMS after JNU violence, 15 were ABVP workers.” But Ojha’s list has only 20 names and none of the individuals was identified with their political affiliations, including Soori Krishnan. The list also features JNUSU president Aishee Ghosh.", "In his video statement, Krishnan has categorically denied any association with ABVP.", "SFI activist Soori Krishnan’s photographs were widely circulated on social media to give credence to the false claim that he faked his wounds. A majority of those who shared the untruth are visible supporters of the Bharatiya Janata Party. A tweet by @excomradekerala drew close to 4,000 retweets.", "“I am the Lord, your healer.” Exodus 15:26. Yesterday JNU SFI leader Soori was admitted to hospital with ‘serious injuries’. From ICU, he flew to Kerala, landed in Trivandrum in 24hrs. His stitches were removed…His wounds were healed in 24 hrs… pic.twitter.com/V4DXWssy2l", "— Ex-Comrade ☭ (@excomradekerala) January 6, 2020", "National vice president of BJYM Atul Kumar tweeted similar words.", "Comedy show of the left comrades", "SFI leader Soori from JNU after being ”brutally injured” in Delhi", "Seen completely in high spirits while welcomed with garlands in Trivandrum within 24 hours.#TukdeTukdeGang@deveshkumarbjp pic.twitter.com/eQ5BkGEWOo", "— Atul kumar (@AtulKumarBJP) January 7, 2020", "A handle infamous for sharing misinformation, Political Kida, made a video out of Krishnan’s welcome at Trivandrum airport.", "Hey @TheAcademy, why no Oscar for SFI’s Comrade Soori? pic.twitter.com/DALtl2Tgra", "— Political Kida (@PoliticalKida) January 7, 2020", "The other usual suspects were Vinita Hindustani, @pokershash and The Skin Doctor.", "[Update: BJP MP Pratap Simha’s Facebook post has been added to this report.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]