["A video has been viewed thousands of times in multiple posts on Facebook, TikTok and WhatsApp which claim it shows a storm in Sri Lanka in 2020. It was shared just hours before tropical cyclone Burevi hit Sri Lanka in December 2020. The claim is false; the video has been circulating online since at least 2016 in reports about a storm in Sri Lanka.", "The 22-second clip was published in this Facebook post on December 2, 2020.", "The post’s caption reads: “Make another person aware”", "The Sinhala-language text superimposed on the video reads:", "“What occurred in Kurunegala just now”.", "The video began circulating just hours before the landfall of tropical cyclone Burevi on Sri Lanka’s east coast. Here is an AFP report about the cyclone.", "The same video was shared here, here, here, here and here alongside a similar claim. It was also shared on WhatsApp and on TikTok here with a similar claim.", "The claim is false: the video is actually footage of a tornado-like formation in Sri Lanka that has been circulating online since at least 2016.", "A closer examination of the video found it was filmed in Sri Lanka.", "The hoardings of Damro - a popular Sri Lankan furniture brand - can be seen in the clip. The hoardings have been circled in red in the screenshot below:", "A reverse image search of video keyframes obtained using digital verification tool InVID We Verify found this YouTube clip published on February 4, 2016. It is titled “Tornado Sri Lanka”.", "A closer look at the YouTube clip found the footage from the 11-second mark to the 33-second mark is identical to the footage shared in the misleading posts, as seen in the screenshot comparisons below:", "Sri Lanka’s Meteorological Department in a statement said the centre of cyclone Burevi crossed the north-eastern shore of Sri Lanka between about 10.30pm to 11.30pm on December 2, 2020.", "This footage has previously been shared in misleading posts. Indian fact checker Boom debunked the false claim that the video shows cyclone Ockhi that impacted both India and Sri Lanka in 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]