["When it comes to raising the minimum wage, the candidates in Virginia’s closely-watched 7th District congressional race have polar opposite views.", "Democratic incumbent Abigail Spanberger has voted for a bill that would gradually increase the federal minimum wage to $15 an hour in 2025. She says the current wage of $7.25 an hour, set in 2009, has lost much of its purchase power and can’t support a family.", "Republican challenger Nick Freitas opposes efforts to raise the wage, saying it would strap businesses already maimed by the coronavirus crisis, and force layoffs.", "While debating the issue on Oct. 20, the candidates gave sharply different descriptions of typical minimum wage earners.", "Freitas said they are young, entry-level workers. \"If you’re looking for a way to systematically insure greater income inequality, then doubling the cost of hiring someone who’s young or has low-skill labor; that needs that first job to be able to rise up in the marketplace, that’s the way to do it,\" he said.", "Spanberger dismissed his description. \"The majority of minimum wage workers are not young people entering the workforce,\" she said. \"They are mothers, predominantly single mothers and oftentimes women of color.\"", "We wondered which description was more accurate, and decided we could get an answer by fact checking Spanberger’s definitive statement. Freitas’ statement has ambiguity, which makes it a bad candidate for the Truth-O-Meter. He suggests young people are a large portion of minimum wage earners, which requires interpretation. Spanberger says flat out that the majority are mothers - a measurable claim.", "We couldn’t find evidence that supports Spanberger’s statement, even after reviewing information her campaign sent us.", "Dearth of data", "There’s not much statistical information available on the nation’s minimum wage earners, largely because the wage varies from state to state.", "In 21 states - including Virginia - it’s set at the federal minimum of $7.25. (Virginia Gov. Ralph Northam signed a bill in April that will gradually increase the wage to $15 an hour in 2026. The first step will occur on May 1, 2021. Freitas voted against the bill.)", "Twenty-nine states have set their rates higher than the federal minimum - all the way up to $13.50 in Washington. And some cities have set their minimum wage above their state’s floor. The large differences make efforts to statistically characterize minimum wage earners across the nation \"thorny,\" according to David Cooper, a senior economic analyst at left-leaning Economic Policy Institute.", "There is, however, some data available on the minimum wage earners from the 21 states that allow the $7.25 federal floor, kept by the Bureau of Labor Statistics. It estimates only 392,000 U.S. non-tip employees worked at the bottom wage in 2019 - a half percent of the nation’s hourly workers.", "Freitas’ suggestion that they’re mainly young people trying to break into the workforce is pretty accurate. BLS estimates 59 percent of the federal minimum wage earners were aged 16 to 24. We don't know how many of these earners are working their first job; BLS doesn’t track that.", "Conversely, the statistics undercut Spanberger’s assertion that \"the majority of minimum wage workers are not young people entering the workforce.\"", "Minimum wage moms", "We asked Spanberger’s campaign where she got her information that most minimum wage earners are mothers, but did not get a specific answer.", "Among other things, the campaign sent the 2019 BLS statistics on federal minimum wage workers that we’ve already discussed. The data doesn’t address the number who are mothers. Its closest information is that 68% of all federal minimum wage earners are women, and two-thirds of those women are between 16 and 24.", "The campaign also sent us research from the Economic Policy Institute that undermines Spanberger’s claim. EPI estimates 33.5 million people from all states would get raises if the federal minimum wage was lifted $15 in 2024. That includes 7.8 million moms - or 23% of the beneficiaries.", "EPI estimates that 4.1 million of the working moms would be single parents - or 12% of all beneficiaries.", "Our ruling", "Spanberger, in debate, said, \"The majority of minimum wage workers\" are mothers.", "There’s not much data on bottom wage earners across the nation because the minimum wage varies in most states. The Bureau of Labor Statistics keeps limited statistics about minimum wage workers in the 21 states that allow the federal floor or $7.25 an hour, but it does not track the number or percentage who are moms.", "We were unable to find data on the number of minimum wage moms, and Spanberger didn’t come up with any. Some of the backup information her campaign actually cast doubt on her claim.", "Spanberger fails in her burden to prove her claim, so we rate it False.", "Abigail Spanberger, Debate comments, Oct. 20, 2020 (12:21 mark).", "Nick Freitas, Debate comments, Oct. 20, 2020 (10:52 mark).", "Congress.gov, HR 582, 2019-2020 session.", "Legislative Information System, HR395, 2020 session.", "Paycor,  \"Minimum Wage By State And 2020 Increases,\" Sept. 24, 2020.", "Bureau of Labor Statistics, \"Characteristics of minimum wage workers, 2019,\" April 2020.", "Email from Connor Joseph, Spanberger campaign spokesman, Oct. 22, 2020.", "Interview with David Cooper, senior economic analyst at the Economic Policy Institute, Oct.26, 2020.", "Economic Policy Institute, \"Raising the federal minimum wage to $15 by 2025 would lift wages for over 33 million workers,\" July 17, 2019.", "EPI, \"Congress could help nearly 8 million working moms this Mother’s Day if it raised the federal minimum wage,\" May 10, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]