["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A chain email says of Tim Kaine: \"In exchange for campaign contributions, he appointed a radical jihadi to the Virginia Immigration Commission.\"", "A reader sent us a copy of the Sept. 21 email and asked if it’s true.", "No group or individual takes credit for the email, but its content is a verbatim copy of a 20-paragraph blog that was posted July 25 by American Thinker, a conservative website. The blog was headlined \"Clinton’s VP pick Kaine: Promoting jihadis in America in exchange for cash.\"", "The blog names Esam S. Omeish, a Fairfax County surgeon and Muslim activist, as the jihadi with whom Kaine had a \"quid pro quo\" relationship.", "Omeish, born in Libya, has lived in Virginia since 1982 and is a U.S. citizen. He’s been chief of the division of general surgery at Inova Alexandria Hospital since 2006.", "In August 2007, Kaine, then governor, appointed Omeish and nine others to the Virginia Commission on Immigration, a new panel that was set up to advise Kaine on state immigration policies.", "A month later, Kaine was on a radio show when a caller complained about Omeish’s appointment, saying the surgeon had made controversial statements about jihad and Israel. Kaine said he was unaware of the statements and would look into them. Later that day, Kaine announced that Omeish had resigned from the commission at his urging.", "Newspapers reported then that the controversy sprang from internet-posted speeches Omeish had given as president of the Muslim American Society, a nonprofit set up to promote charitable, religious and educational causes.", "In December 2000, Omeish spoke at a rally across the street from the White House protesting Israel’s occupation of Jerusalem. He told the crowd, \"... you have learned the way and you have known that jihad is the way to liberate your land.\"", "At an August 2006 rally in Washington, when Israel was fighting a border war with Lebanon, Omeish criticized the \"Israeli war machine.\" He called the Israeli action \"criminal\" and accused the nation of \"massacre and genocide against the Palestinian people.\" Omeish called on people \"not to allow an Israeli agenda that controls our Congress and holds us hostage.\"", "The day after Kaine ousted him from the commission in 2007, Omeish held a news conference. He said his call for jihad came before the Sept. 11, 2001, attack on the World Trade Center and, in using the term, was referring the concept of Islamic struggle rather than a holy war. Omeish said the word \"jihad\" can be misunderstood in a post 9/11 environment.", "The Merriam-Webster dictionary says the full definition of \"jihad\" is \"a holy war based on behalf of Islam as a religious duty; also: a personal struggle in devotion to Islam especially involving spiritual discipline.\"", "As for Israel, Omeish said he favored a two-state government in the city with Israel and Palestine.", "\"It is not a call for violence. We never condone terrorists,\" Omeish said of his speeches.", "Kaine, in a prepared statement announcing Omeish’s resignation, praised him as a \"respected physician and community leader.\"", "A spokesman for Kaine said then that the governor was concerned Omeish’s controversial comments would \"distract\" the commission’s work. The spokesmen also said the governor’s office would improve its vetting of potential political appointees.", "We tried to reach Omeish, but he did not reply to messages we left with personnel at his office.", "The money", "The email, based on American Thinker’s blog, says Kaine appointed Omeish \"in exchange for campaign contributions.\"", "American Thinker, in making that claim, points to a July 23 blog posted by the Clarion Project, a nonprofit that says it’s \"dedicated to exposing the dangers of Islamist extremism while providing a platform for the voices of moderation and promoting grassroots activism.\"", "Clarion’s effort to establish a quid-pro-quo link starts with the New Dominion PAC - an organization founded by Arab-Virginians that contributes almost exclusively to state and local Democrats. The blog notes that the PAC from 2003 to 2005 contributed $43,050 to Kaine’s gubernatorial campaign, a figure we confirmed through records kept by the Virginia Public Access Project.", "The blog offers no evidence that the money came in exchange for Omeish’s appointment which, again, didn’t occur until 2007. And records show that Omeish never has contributed money to the PAC.", "Clarion also seeks to link a payback through the International Institute of Islamic Thought, a Fairfax County-based think tank whose stated goal is \"to bridge the intellectual divide between Islamic tradition and western civilization.\" The Washington Post reported in 2006 that a federal grand jury was investigating whether the institute and other Islamic organizations in Northern Virginia were financing terrorist organizations.", "The blog notes that in May 2011, the institute donated $10,000 to the New Dominion PAC - the organization which years earlier given money to Kaine’s gubernatorial campaign.", "Kaine’s term as governor ended in January 2010 - more than a year before the institute’s contribution to the PAC. The New Dominion PAC did not contribute money to Kaine’s successful 2012 campaign for the U.S. Senate; it was ineligible to give money to a federal candidate, because it never registered with the Federal Election Commission.", "Records show Omeish never personally contributed money to Kaine’s gubernatorial campaign or his Senate campaign.", "We should note that a small money link can be traced between Omeish and the International Institute for Islamic Thought. In 2009, Omeish ran unsuccessfully in a Democratic primary for a Fairfax seat in the House of Delegates. The institute contributed $3,500 to the campaign - a small fraction of the $143,734 Omeish raised.", "We found no record, in contrast, of Omeish contributing money to the institute.", "Our ruling", "A chain email, based on postings by two conservative blogs, says that  Kaine \"in exchange for campaign contributions … appointed a radical jihadi to the Virginia Immigration Commission.\" This refers to a 2007 appointment.", "The appointee, Esam Omeish, a surgeon and Muslim activist, said in a 2000 speech that the \"jihad way is the way to liberate your land.\"", "Kaine, when told of the comment seven years later, immediately obtained Omeish’s resignation from the panel. In the aftermath, Omeish said the word jihad has several meanings, and that he was referring to it as an Islamic concept of personal struggle - not a call for holy war.", "As for the supposed payoff, the email refers to $43,050 in contributions that the New Dominion PAC, representing Arab-Virginians, made to Kaine’s gubernatorial campaign years before Kaine created the advisory commission and appointed Omeish to it.", "It also refers to $10,000 the PAC - not Kaine -- received from an Islamic nonprofit group four years after the appointment. Kaine was out of office at the time, and there’s no evidence he benefitted from the donation. Federal laws, in fact, barred that money from being advanced to Kaine’s U.S. Senate campaign in 2012.", "So the claim that Kaine appointed Omeish \"in exchange\" for political money is based on flimsy happenstance, not fact.  We rate it False.", "Chain Email: \"A few facts re Tim Kaine’s background,\" Sept. 21, 2016.", "American Thinker, \"Clinton’s VP pick Kaine: Promoting jihadis in America in exchange for cash,\" July 25, 2016.", "Esam Omeish for delegate, \"Meet the candidate,\" 2009.", "Richmond Times-Dispatch, \"Video trips up panel member - Comments denouncing Israel force him to leave state immigration board,\" Sept. 28, 2007.", "The Virginian-Pilot, \"Doctor resigns from state panel after comments caught on video,\" Sept. 28, 2007.", "Esam Omeish, Comments at Jerusalem Day rally, Dec. 22, 2000.", "Clarion Project, \"About the Clarion Project,\" accessed Sept. 24, 2016.", "Clarion Project, \"Clinton VP pick Tim Kaine’s Islamist ties,\" July 23, 2016.", "International Institute of Islamic Thought, \"Scholarly agreements with other institutions,\" accessed Sept. 24, 2016.", "Virginia Public Access Project, International Institute of Islamic Thought donation, May 10, 2011.", "New Dominion PAC, \"About NDPAC,\" accessed Sept. 24, 2016.", "Virginia Public Access Project, \"New Dominion PAC,\" accessed Sept. 24,  2016.", "Virginia Public Access Project, New Dominion PAC contributions to Tim Kaine, accessed Sept. 24, 2016.", "Virginia Public Access Project, Financial summary for Omeish for Delegate, 2009.", "Virginia Public Access Project, Contributions to Omeish for Delegate, 2009", "Merriam-Webster, full definition of \"jihad,\" accessed Sept. 28, 2016.", "Esam Omeish, \"Who is Dr. Omeish,\" accessed Sept. 28, 2016.", "Federal Election Commission, Contributions by Esam Omeish, accessed Sept. 27, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]