["Sen. Ted Cruz, R-Texas, speaks with reporters on Capitol Hill on Feb. 13, 2021. (AP)", "• Cruz’s resolution on anti-Semitism did pass unanimously in the Senate. But he offered a misleading description of Ocasio-Cortez’s actions surrounding a similar House resolution.", "• Ocasio-Cortez opposed the initial draft of a House resolution, saying it ignored bigotry other than anti-Semitism, such as that exhibited by white supremacists. She voted for a revised resolution that added condemnations of other types of bigotry, and the measure passed by a wide margin.", "•  Much of the House resolution was similar to the language in Cruz’s resolution.", "Two high-profile members of Congress — Sen. Ted Cruz, R-Texas, and Rep. Alexandria Ocasio-Cortez, D-N.Y. — were engaged in a Twitter spat in January over blame for the Capitol riots when the topic of their exchange veered to their records on condemning anti-Semitism.", "At one point in the dialogue, Ocasio-Cortez said of the Capitol rioters, \"They wore Auschwitz shirts, erected gallows, and tried to hang the Vice President. Your continued excusal and denial of Wednesday’s Neo-Nazi presence is abhorrent and dangerous. The most healing and unifying thing *you* can do is take responsibility for your actions and resign.\"", "Cruz responded, \"Epic hypocrisy. Facts: 1) Nazis are evil bigots. 2) You & your anti-Israel pals blocked a resolution condemning anti-Semitism — which I passed unanimously in the Senate. 3) Unless they are genocidal, calling your political opponents Nazis is atrocious.\"", "Epic hypocrisy. Facts:1) Nazis are evil bigots.2) You & your anti-Israel pals blocked a resolution condemning antisemitism—which I passed unanimously in the Senate. https://t.co/kYQGO4zVVU3) Unless they are genocidal, calling your political opponents Nazis is atrocious. https://t.co/ZV5dhUDRzD", "The two continued to trade attacks over the handling of the resolutions, with Ocasio-Cortez accusing Cruz of lying and Cruz doubling down on his claim.", "So what did happen with the Senate and House resolutions condemning anti-Semitism? There’s a lot to consider here, but for this fact-check, we focused on the question of whether Ocasio-Cortez and her allies \"blocked a resolution condemning anti-Semitism\" that Cruz \"passed unanimously in the Senate.\"", "And we found Cruz’s version of events leaves out a lot of important context.", "Their continuing Twitter thread shed light on the crux of their dispute.", "Ocasio-Cortez tweeted, \"@tedcruz again, you are lying. Pull the Clerk record. I proudly voted for the resolution against antisemitism you cite. Your statements are growing increasingly erratic and unfounded in fact.\"", "Cruz fired back, \"Not true. The ‘record’ you cite is the show vote on the watered-down House resolution AFTER you BLOCKED the resolution condemning antisemitism.\"", "Anti-Semitism flared as an issue in Congress in March 2019, when Rep. Ilhan Omar, D-Minn. — a member of the \"Squad\" of left-leaning Democrats that includes Ocasio-Cortez — suggested that some lawmakers \"push for allegiance to a foreign country,\" specifically Israel. Some said this played into longstanding anti-Semitic tropes that suggest that Jews have dual loyalties and can’t be trusted to be fully American.", "Omar’s remark came during a panel discussion with a third Squad member, Rep. Rashida Tlaib of Michigan. Omar and Tlaib are both Muslim.", "In response, House Democrats circulated a draft resolution titled \"Rejecting anti-Semitism as hateful expressions of intolerance that are contradictory to the values that define the people of the United States.\"", "The draft’s singular focus on anti-Semitism worried some Democratic lawmakers, including Ocasio-Cortez, who argued that the House ought to condemn other forms of bigotry as well.", "\"It’s not my position to tell people how to feel, or that their hurt is invalid,\" Ocasio-Cortez tweeted on March 5, 2019. \"But incidents like these do beg the question: where are the resolutions against homophobic statements? For anti-blackness? For xenophobia? For a member saying he’ll \"send Obama home to Kenya?\"", "As a result of the pushback by Ocasio-Cortez and her allies, the resolution ultimately voted on by the House on March 7, 2019, H. Res. 183, was broadened to include more than just anti-Semitism.", "The resolution said the House condemned anti-Semitism as well as anti-Muslim discrimination and bigotry against minorities \"as hateful expressions of intolerance that are contradictory to the values and aspirations that define the people of the United States.\"", "The resolution included roughly 30 uses of the words \"Jews,\" \"Jewish,\" or \"anti-Semitism,\" so it remained heavily critical of anti-Jewish sentiments and acts. It also criticized \"white supremacists\" for exploiting \"bigotry and weaponiz(ing) hate for political gain, targeting traditionally persecuted peoples, including African Americans, Latinos, Native Americans, Asian Americans and Pacific Islanders and other people of color, Jews, Muslims, Hindus, Sikhs, the LGBTQ community, immigrants, and others with verbal attacks, incitement, and violence.\"", "The resolution passed in the House, 407-23, with Ocasio-Cortez, Omar and Tlaib all voting in favor. The only votes against it were by Republicans.", "Three months after the House action, Cruz and Sen. Tim Kaine, D-Va., led a bipartisan effort to pass a resolution condemning anti-Semitism. Cruz was the primary sponsor.", "The \"sense of the Senate\" resolution, S. Res. 189, said in part that the Senate \"condemns and commits to combatting all forms of anti-Semitism.\" In a speech on the Senate floor, Cruz said the resolution \"speaks to prejudices Jews experience which we must acknowledge.\" Afterward, he asked that the resolution be passed by unanimous consent. Since no senator objected, the resolution was deemed to be passed unanimously.", "Unlike the House resolution, the Senate resolution exclusively addressed anti-Semitism. However, on the subject of anti-Semitism, the text of the two resolutions was similar.", "For instance, the Senate resolution said that \"in the United States, Jews have faced, and continue to face, false accusations of divided loyalty between the United States and Israel,\" while the House resolution said it \"rejects the perpetuation of anti-Semitic stereotypes in the United States and around the world, including the pernicious myth of dual loyalty and foreign allegiance, especially in the context of support for the United States-Israel alliance.\"", "The two resolutions also denounced hate crimes targeting Jews.", "Cruz said that Ocasio-Cortez and her allies \"blocked a resolution condemning anti-Semitism — which I passed unanimously in the Senate.\"", "Cruz sponsored a Senate resolution  against anti-Semitism that passed by unanimous consent. But his claim that Ocasio-Cortez’ blocked a similar House resolution leaves out important context.", "Ocasio-Cortez opposed the initial resolution draft as being too narrow. Once condemnations of other types of bigotry were added to the text, the resolution went forward and passed easily, including a vote in favor by Ocasio-Cortez. Both resolutions had similar language on anti-Semitism.", "We rate Cruz’s statement Mostly False.", "EDITOR'S NOTE, March 24, 2021: After we published our report, Cruz's staff responded to our inquiry, citing evidence we had already reviewed. The rating remains unchanged.", "Alexandria Ocasio-Cortez and Ted Cruz, Twitter thread, Jan. 9, 2021", "Ted Cruz, \"Cruz-Kaine Anti-Semitism Resolution Unanimously Passes in the Senate,\" June 14, 2019", "U.S. House of Representatives, Roll Call 108, H. Res. 183, March 9, 2019", "U.S. House of Representatives, draft resolution, March 4, 2019", "U.S. House of Representatives, \"S.Res.189 - A resolution condemning all forms of antisemitism,\" accessed Feb. 17, 2021", "Congress.gov, \"Congressional Record Vol. 165, No. 99 (Senate - June 13, 2019),\" accessed Feb. 17, 2021", "Politico, \"House Dems postpone vote rebuking Omar amid pressure from left,\" March 5, 2019", "Vox.com, \"The Ilhan Omar anti-Semitism controversy, explained,\" March 6, 2019", "USA Today, \"Ocasio-Cortez defends Ilhan Omar ahead of vote on resolution to condemn anti-Semitism,\" March 5, 2019", "Washington Post, \"Many are worried about the return of the ‘Big Lie.’ They’re worried about the wrong thing,\" May 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]