["A set of photographs has been shared on social media platforms with the claim that a massive arms haul was recovered from a madrasa in Rajkot, Gujarat.", "I had tweeted recently that in Muslim majority areas in Kerala, as far back as the 1990s the Peaceful community had started stockpiling weapons in every home. Actually they are preparing for civil war. This arms haul is from a madrassa in Rajkot. pic.twitter.com/fnDUzZ01rh", "— Rakesh Krishnan Simha (@ByRakeshSimha) July 31, 2019", "The above tweet is of July 31 and has been retweeted over 750 times so far. The tweet has four photographs in it. One of the photos, of a stock of arms, has been posted on Facebook with the identical claim i.e. these weapons were recovered from a madrasa in Rajkot.", "মিষ্টিমুখ করুন: গুজরাতের রাজকোটে র এক মসজিদ থেকে এই অস্ত্রের পাহাড় ধরা পড়েছে । আপনি কি কিছু বুঝতে পারছেন ???", "Mu Mithai ho jay ??? Sweets recovered from a Madrassa Masjid in Gujrat !!!", "Posted by Indranil Mookerjee on Sunday, July 28, 2019", "The above post by an individual user has been shared over 1100 times so far. It was posted on July 29. This claim has also been posted in a group I AM WITH PM MODI AND YOU?", "The claim that a large stock of weapons has been seized from a Rajkot madrasa is false. Alt News could not find a single news report to this effect. Moreover, the photographs used to bolster this false claim are old and unrelated to the claim. Let us scrutinise these pictures one-by-one.", "Alt News reverse-searched the above image on Google and came across an article by India Today which stated that this photograph is actually from a ‘kirpan’ factory in Patiala, Punjab. According to the article, the photo is from the ‘Khalsa Kirpan’ factory in the city. Alt News contacted ‘Khalsa Kirpan’ factory and confirmed that the picture is indeed from the factory at Patiala.", "The above photo is indeed from Rajkot, but these swords were recovered not from a madrasa but from a hotel on the Ahmedabad-Rajkot highway. This picture had been shared earlier as well with the same narrative. Alt News’ fact-check on this may be read here.", "Alt News reverse-searched the above photograph and found it on Tumblr. The photo was posted in March 2019. It was earlier shared with the claim that weapons were recovered from a madrasa in Sherkot, UP.", "The above photograph is recent. It pertains to a raid on a madrasa in Bijnor, Uttar Pradesh in which weapons were recovered. According to Bijnor police, the weapons seized were part of an illegal arms racket. Six people have been arrested in this case which is of July 2019.", "थाना शेरकोट @bijnorpolice द्वारा मदरसे में अवैध शस्त्रों की तस्करी करते 06 अभियुक्तगण 01 पिस्टल, 04 तमंचे व भारी मात्रा में कारतूसों सहित गिरफ्तार। #uppolice @Uppolice @adgzonebareilly @digmoradabad @News18India pic.twitter.com/WDj3kkBfIu", "— Bijnor Police (@bijnorpolice) July 11, 2019", "In conclusion, it may be stated that the claim about a large stash of weapons recovered from a madrasa in Rajkot, Gujarat is false. Additionally, the pictures shared along with this claim are either old or unrelated.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]