["By D'Angelo Gore and Eugene Kiely", "Posted on February 23, 2018", "In a speech to conservatives, National Rifle Association CEO Wayne LaPierre distorted the facts when talking about the federal system for conducting background checks on prospective gun buyers.", "LaPierre got a lot wrong when describing a rescinded Obama-era rule requiring the Social Security Administration to report certain mentally disabled beneficiaries to the federal database used to conduct gun background checks.", "He said the rule applied to “an elderly couple” simply “because they sought help to do their taxes.” But it didn’t single out anyone for that reason. It covered 18- to 65-year-olds receiving disability benefits — not retirement payments — due to a diagnosed mental condition.", "He also said the rule — with “no questions asked” — “banned from purchasing a firearm” Social Security recipients “who granted financial authority to a family member, friend or financial professional.” In fact, the SSA rule said that in order to be reported, individuals had to meet five criteria, including having a severe mental health issue and being unable to manage their benefits. It also allowed affected individuals to petition for the ability to obtain a gun, provided they could demonstrate that they posed no threat to the public.", "During his speech, LaPierre also boasted that the NRA “originated” the National Instant Criminal Background Check System, or NICS, for gun sales. That’s misleading.", "As we have written, the NRA proposed instant background checks in 1991 after it appeared certain that Congress would pass the Brady Handgun Violence Prevention Act. The NRA backed instant background checks — even though the technology for it did not exist — as an alternative to a mandatory seven-day waiting period before a purchaser could take possession of a gun. Supporters of the bill saw the NRA’s move as an attempt to kill or weaken the bill — one of several lobbying efforts to reduce or eliminate the waiting period, which LaPierre at the time called “unfair.”", "After the Brady bill became law, the NRA sued to prevent the federal government from temporarily retaining any information on the approved gun sale and gun buyer. It also has consistently opposed expanding background checks to include private gun sales and transfers, including those at gun shows and on the internet.", "LaPierre made his claims in a speech at the annual Conservative Political Action Conference, where he addressed calls for more gun control following a deadly mass shooting at a Florida high school. He said “socialists love to makes lists … that can be used to deny citizens their basic freedoms.” (His remarks about the Social Security rule start around 17:53 in the video.)", "LaPierre, Feb. 22: Imagine this — and this happened and it’s true. Imagine telling an elderly couple that because they sought help to do their taxes that they could no longer exercise their fundamental Second Amendment right.", "That’s exactly what Obama did. His administration proposed if some Social Security recipient — recipient who granted financial authority to a family member, friend or financial professional was banned from purchasing a firearm. No questions asked; just like that.", "Good, law-abiding people were automatically and unjustly declared mentally incompetent and put on a new government list.", "We wrote about similarly false claims made by another NRA executive in October.", "As we said then, the rule, which had been finalized by the SSA under President Barack Obama in December 2016, was revoked by a joint resolution that President Donald Trump signed into law February 2017. The rule had required the SSA to report certain people disqualified from buying or possessing a gun to the National Instant Criminal Background Check System, or NICS.", "But the rule didn’t apply to all Social Security beneficiaries, as LaPierre suggested. And it would not have applied to “an elderly couple” simply “because they sought help to do their taxes” or “granted financial authority to a family member, friend or financial professional.”", "The rule would have covered 18- to 65-year-olds with a qualifying mental condition who were receiving benefits through the Social Security Disability Insurance program. Plus, the SSA said it would only report to the NICS individuals who met five specific criteria, including having a severe mental impairment and being assigned a representative to handle their benefit payments.", "Also, affected individuals could appeal a listing in the NICS by showing that they were not dangerous. That’s the opposite of being “banned from purchasing a firearm” with “no questions asked,” as LaPierre put it.", "The SSA’s final rule was created to comply with the reporting requirements mandated by the NICS Improvement Amendments Act of 2007, which was signed into law in January 2008 by President George W. Bush. The law required federal agencies to report individuals prohibited from acquiring guns to the NICS.", "After the 2012 mass shooting at Sandy Hook Elementary School, Obama issued a presidential memorandum advising the Justice Department to make sure that federal agencies were complying with the 2008 law by reporting relevant records to the national background check system.", "The final rule went into effect on Jan. 18, 2017, but Congress and Trump repealed it that February, months before SSA actually had to comply with its requirements in December 2017.", "“SSA did not refer any records to the NICS under the now-rescinded final rule,” Mark Hinkle, a spokesman for the Social Security Administration, told us in an email.", "So, no “good, law-abiding people were automatically and unjustly declared mentally incompetent and put on a new government list,” as LaPierre said.", "In a bit of revisionist history, LaPierre also took credit for creating the federal background check system for gun sales.", "LaPierre, Feb. 22: Look, and this is really important, and you never hear of this on the national media. So I want to say it to all of you now and I need your help in telling all of America this because it is the truth. The National Rifle Association originated the National Instant Check System. It was our bill.", "That’s misleading. The fact is that in 1991 the NRA supported an “instant background check” system as an alternative to a proposed seven-day waiting period when Congress was considering the Brady Handgun Violence Prevention Act. At the time, the bill’s advocates saw the NRA’s proposal as an attempt to weaken or kill the Brady bill, because the technology for instant checks didn’t exist yet.", "In a paper on the history of the Brady law, Richard Aborn, a former Manhattan assistant district attorney and past president of Handgun Control Inc., wrote that the NRA was “concerned that it no longer had the votes to defeat” the Brady bill, so “the NRA tried a last-ditch effort” to block it by working with then-Sen. Ted Stevens of Alaska on an amendment to create an instant background check system.", "Aborn, 1995: The fatal flaw in the instant check bill was that there was no technology available to conduct the background check instantaneously. The instant check bill would have completely gutted the Brady bill by eliminating the waiting period, thereby depriving law enforcement officials of the time necessary to conduct a background check of the purchaser.", "The Brady bill did not become law in 1991 or 1992. But it was reintroduced in 1993 with compromise language on background checks. The bill required potential gun buyers to wait up to five business days to allow local law enforcement time to conduct a background check, and the five-day waiting period would be in effect until the creation of a national instant background check system.", "The NRA opposed the waiting period and worked with Republican Rep. George Gekas of Pennsylvania to successfully make changes to the bill as it neared final passage in November 1993.", "“We recognize a bill is going to become law on this,” LaPierre was quoted as saying in an Associated Press story at the time. “We want to make it the best version possible.”", "Gekas won approval for an NRA-backed amendment that would end the five-day waiting period after five years, even if the instant check system wasn’t operational. In a Nov. 10, 1993, States News Service story, Bill McIntyre, an NRA spokesman, was quoted as saying that the NRA “worked closely with [Gekas] on the language and to round up support for it.”", "When the Senate passed the Brady bill on Nov. 24, 1993, the New York Times quoted LaPierre as describing the five-day waiting period as “unfair.”", "“The waiting period is unfair to honest, law-abiding people,” LaPierre said in the Times story. “The criminals won’t wait.”", "Then-President Bill Clinton signed the Brady bill on Nov. 30, 1993, and, as required by law, the instant background checks took effect five years later on Nov. 30, 1998.", "“As the NRA began to understand that we were building substantial momentum and would likely succeed, they hedged their bet by cynically introducing the instant check system knowing it wouldn’t work because the technology wasn’t available,” Aborn told us. “Notwithstanding having introduced the idea, they still continued to oppose Brady with all the resources they could muster, but they ultimately failed to stop us.”", "Even after the law was passed, the NRA continued its opposition to aspects of the new background check system.", "On the day that NICS went operational on Nov. 30, 1998, the NRA filed a lawsuit claiming that the rules allowing the FBI to maintain an “audit log” of gun purchases for up to six months (later reduced by the Department of Justice to 90 days) amounted to a firearm registry. The NRA suit was dismissed, but federal law every year since fiscal year 2004 requires the FBI to destroy firearm transfer records within 24 hours of approval.", "As we have written before, a weapons sale can be approved in less than an hour using NICS if a background search turns up no evidence that the applicant is prohibited from owning a gun. If the name of the applicant matches any of those in a variety of databases, including criminal and civil court records, then the gun purchase can be delayed for further review, but only up to 72 hours.", "The NRA has successfully lobbied over the years to limit the background checks to licensed firearm dealers — excluding private sales, such as some purchases made at gun shows or over the internet, for example.", "A month after the Brady bill was signed into law in 1993, the Associated Press wrote about an effort to close the so-called gun show loophole, which the news organization described as “a loophole large enough to sneak a crate of 9-millimeter pistols through.” NRA lobbyist Joseph Phillips told the Associated Press at the time that such legislation would be unnecessary.", "The NRA says it still opposes expanding background checks to include gun shows, “because expanding the background check requirement would be a step toward transforming the background check system into a national gun registry.”", "“To this day, they continue to oppose the idea of universal background checks,” Aborn told us, “so to argue that they created a national instant check system is quite misleading given all of their efforts to limit background checks for gun purchases.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]