["A post on Instagram by Betches Sup — the politics and news hub of the feminist website — states six claims to back up its sentiment that we are \"living under minority rule.\"", "We went through them to see if they hold up.", "Betches Sup did not respond to a request from USA TODAY for comment.", "Fact check:Senate Republicans moving to confirm Trump's Supreme Court nominee but blocked Obama's", "That's true.", "In 2016, Hillary Clinton bested Donald Trump by exactly 2,865,075 votes, according to CNN.", "In his nearly four years in the Oval Office, Trump has nominated three justices to the nine-member Supreme Court — Neil Gorsuch in 2017, Brett Kavanaugh in 2018, and Amy Coney Barrett in 2020, per Politico.", "Fact check:It's true, Ginsburg said bipartisanship needed 'true patriots' on both sides", "That's essentially true.", "Republicans in the Senate represent 14.3 million fewer Americans than Senate Democrats.", "Each state is entitled to two senators, according to Article I, Section 3 of the U.S. Constitution.", "In its post, Betches Sup referenced an analysis from Vox in February that came after the Senate voted 52-48 to acquit the president on the first article of impeachment, abuse of power, brought by the House of Representatives.", "The analysis tallied the population each voting senator represented. It assigned a state's full population — based on Census Bureau data from 2016 — to \"convict\" or \"acquit\" if both its senators voted to convict or acquit, and split the population if its senators split their vote.", "\"All told, the senators voting to acquit represent about 152 million individuals, while senators voting to convict represent about 170 million individuals,\" it explained. That's a difference of 18 million.", "Fact check:True claim about Harris failing bar exam on first try and Barrett's law school rank", "The vote breakdown for the confirmation is not exactly the same; the only Republican to vote against the first article of impeachment was Sen. Mitt Romney.", "But both Sen. Lisa Murkowski, R-Alaska, and Sen. Susan Collins, R-Maine, have signaled they will not back Barrett, indicating a likely 51-49 vote, per The Guardian.", "USA TODAY tallied the population — based on Census Bureau estimates from 2019 — of the likely votes for and against confirmation, and found that senators likely to vote for Barrett represent 156.6 million Americans, while senators likely to vote against her nomination represent 170.9 million Americans, about 14.3 million more.", "Fact check:Photo of maskless Democratic senators is from 2018 Kavanaugh confirmation hearing", "That's true.", "Barrett could solidify a 6-3 conservative majority on the Supreme Court, which would create a voting bloc with sufficient votes to overturn Roe v. Wade, the 1973 decision that legalized abortion nationwide.", "There are polls to suggest that that's not what most Americans want.", "In its post, Betches Sup cites a poll by NPR/PBS NewsHour/Marist in June 2019 in which 77% of respondents said the Supreme Court should uphold the decision, per The Hill.", "Other polls have turned up similar, though slightly lower, support for Roe v. Wade.", "In August 2019, a poll by Pew Research Center found that just 28% of respondents want to see the high court completely overturn the abortion rights precedent, while 70% do not.", "And this month, a poll by the Washington Post and ABC News showed 62 of respondents said the Supreme Court should uphold the decision, while 24 percent say it should be overturned and 14 percent have no opinion.", "As for the timing of her confirmation vote, it will likely occur mere \"days before\" the election on Nov. 3.", "The Senate Judiciary Committee will vote on the nomination — expected to pass 12-10 on party lines — on Oct. 22, after which the full Senate will take up the nomination. A final vote will likely occur the week of Oct. 26, per USA TODAY.", "It's impossible to know whether or not the Republican Party will lose power in November. But it's true that models predict losses for the party. Democrats are currently favored to win the Senate and Biden is favored to win the presidency, according to analysis from FiveThirtyEight.", "Some Republicans — including Sen. Lindsey Graham, R-S.C., — have also acknowledged that they may soon lose the White House.", "\"Y'all have a good chance of winning the White House,\" Graham, chairman of the Senate Judiciary Committee, told Sen. Amy Klobuchar,D-Minn., at last week's confirmation hearings, USA TODAY reported.", "Fact check:Fake Trump tweet says Supreme Court should decide every election", "Based on our research, all the claims from Betches Sup are TRUE. President Donald Trump did lose the popular vote by nearly 3 million votes in 2016. If Judge Amy Coney Barrett is confirmed, Trump will have nominated one-third of the Supreme Court. It's also true that the 51 Republican senators who will likely back Barrett represent 14.3 million fewer Americans than the senators who will vote against her. And if she is confirmed, the court will have a 6-3 conservative majority. They could overturn Roe v. Wade, which polls show most Americans support. And she is likely to be confirmed just before an election that Democrats are currently projected to win.", "Our fact-check sources:", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]