["By Lori Robertson", "Posted on January 2, 2018", "President Donald Trump suggested his “very strict” aviation policies were linked to zero commercial passenger jet deaths in 2017 worldwide. In fact, in the United States, there have been no deaths from U.S. commercial airline accidents since 2009 and none from foreign air carriers in the U.S. since 2013.", "Trump tweeted on Jan. 2: “Since taking office I have been very strict on Commercial Aviation,” and then noted the “Good news” on “Zero deaths in 2017.”", "Since taking office I have been very strict on Commercial Aviation. Good news – it was just reported that there were Zero deaths in 2017, the best and safest year on record!", "— Donald J. Trump (@realDonaldTrump) January 2, 2018", "Two aviation organizations reported that there were no deaths from commercial passenger jet accidents in 2017 worldwide — though both the Aviation Safety Network, which maintains an airliner accident database, and the Dutch aviation consulting firm To70 said there had been some deaths from turbo-prop plane or cargo plane accidents.", "The Aviation Safety Network reported 2017 was “the safest year ever for commercial aviation.” The group recorded 10 fatal accidents, half concerning cargo flights, that killed 79 people, both occupants and those on the ground. For comparison, in 2016, there were 303 deaths in 16 accidents, according to ASN.", "The group reported that the low 2017 figures were “no surprise.”", "“Since 1997 the average number of airliner accidents has shown a steady and persistent decline, for a great deal thanks to the continuing safety-driven efforts by international aviation organisations such as ICAO, IATA, Flight Safety Foundation and the aviation industry,” ASN President Harro Ranter said in a press release.", "The last fatal commercial passenger jet accident was in November 2016 in Colombia, ASN said.", "And in the United States, the last U.S. passenger airline fatal crash was on Feb. 12, 2009, when a Continental Connection flight crashed into a house in Clarence Center, New York, killing 49 people on board and one person on the ground, according to the National Transportation Safety Board’s accident database. The NTSB report on that crash cited pilot error and inadequate airline procedures during icy conditions as probable causes of the fatal crash.", "As for foreign airlines operating in the U.S., an Asiana Airlines jet crashed into the seawall when landing in 2013 at the San Francisco International Airport. Three teenage passengers from China died. The NTSB report cited pilot error and inadequate training among the probable causes.", "What has Trump done to be “very strict” on commercial aviation? In a statement, the White House pointed to two measures: “Last year, the President announced his initiative to modernize Air Traffic Control and under his leadership, the Department of Homeland Security released enhanced security measures to ensure safer commercial air travel,” said Raj Shah, principal deputy White House press secretary.", "In June, Trump proposed privatizing the Federal Aviation Administration’s Air Traffic Control system, but Congress hasn’t held any votes on such legislation. From March until July, the Department of Homeland Security had banned laptops and other large portable electronic devices from carry-on luggage on flights entering the United States from 10 Muslim-majority countries. In late June, DHS announced enhanced security procedures for all commercial flights to the U.S., including enhanced screening of passengers and electronic devices.", "The White House didn’t provide any evidence that the DHS security changes had any effect on the level of airline accidents.", "“The President is pleased there were no commercial airline deaths in 2017, and hopes this remains consistent in 2018 and beyond,” Shah said in his statement.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]