["The video was published in this Facebook post on September 8, 2019 to a page with more than 40,000 followers.", "It has been viewed more than 29,000 times and shared more than 400 times.", "The 33-second clip shows a woman wearing a light blue T-shirt and a black backpack picking up a red object from the floor and throwing it towards several police officers.", "The traditional Chinese language caption translates to English as: “That’s a female rioter!!!", "“Live video shows a female rioter hurled a fire extinguisher at police officers!”", "Below is a screenshot of the misleading post:", "Traditional Chinese language text on the bottom left-hand corner of the screen states the filming location was Sha Tin, a district in eastern New Territories, Hong Kong.", "Hong Kong newspaper South China Morning Post reported on the September 7 clashes at the Sha Tin MTR station in this article published on September 7.", "The report states in part: “The scene at Sha Tin MTR station shows a broken umbrella, empty water and juice bottles and other rubbish strewn over the floor following a clash between protesters and police.”", "The footage corresponds with Google user photos tagged at Sha Tin station on Google Maps, including this one and this one.", "The video was also published here on YouTube alongside a similar claim.", "The claim is false; a closer analysis of the footage shows the woman threw a box, not a fire extinguisher.", "The video was taken from this Facebook live video broadcast by local newspaper Apple Daily.", "The woman seen in the video in the misleading posts can be seen from the two hour 46 minute mark to the two hour 47 minute mark in the Apple Daily video.", "Below is a screenshot comparison of the video in the misleading posts (L) and the Apple Daily video (R):", "Hong Kong online news portal Stand News broadcast the same scene at Sha Tin station in higher quality on Facebook live on September 7, 2019.", "The same woman can be seen picking up a square, red box from the station floor at the 33 minute 52 second mark of the video.", "Below is a screenshot comparison of the video in the misleading posts (L) and the Stand News video (R) with the box circled in red by AFP:", "Below are four screenshots taken from the Stand News video which show the sequence:", "The dark red box in the video corresponds with packaging for mooncakes shown here, produced by local bakery Kee Wah.", "Below is a screenshot comparison of the box in the Stand News video (L) and the box distributed by Kee Wah (R):", "There are two branches of Kee Wah bakery near Sha Tin station; here and here.", "Hong Kong public broadcaster RTHK reported on September 16 that a woman, 45, had been charged with assaulting police after throwing a mooncake box at police officers during clashes in Sha Tin on September 7.", "She had been accusesd of assaulting a police officer, who said he \"felt dizzy and nauseous\" following the attack.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]