["This story is developing", "About this rating", "\"Operation Talon,\" a program planned in the final weeks of the Trump administration aimed at deporting sex offenders, was suspended by U.S. Immigration and Customs Enforcement.", "The Biden administration had \"nothing to do with this decision,\" according to an ICE official. Homeland Security Investigations, a division of ICE, still investigates sex crimes committed by noncitizens.", "It's unclear whether or not Operation Talon was ever in operation. It is also unclear whether the suspension is temporary or permanent, though officials have referred to ICE's new guidelines as \"interim.\"", "In February 2021, a number of attention-grabbing posts started circulating on social media claiming that U.S. President Joe Biden had canceled a Trump-era program called \"Operation Talon\" that was tasked with deporting sex offenders. The website Human Events, for example, wrote:", "Biden cancels Trump’s ‘Operation Talon’ Program that Targeted Sex Offenders Living in U.S. Illegally", "Biden has made it clear that his number one mission as president is to undo everything the Trump administration accomplished over the last four years. His newest cancellation simply does not make sense.", "Biden’s administration recently cancelled Operation Talon, a Trump administration program aimed at removing convicted sex offenders living in the United States illegally.", "Some social media posts claimed that this \"Operation Talon\" program was responsible for \"thousands of arrests\" and that Biden canceled the program based on the baseless, conspiratorial claim that the top echelons of the Democratic Party are somehow involved in child trafficking.", "So what exactly is Operation Talon and did Biden really cancel it? Here's what we've been able to find out.", "The claim that Biden canceled Operation Talon started in the days following a report published by The Washington Post on Feb. 7, 2021, that examined some of the changes that may take place at ICE during the Biden administration. At one point, the Post reported that it had examined emails from senior ICE officials and had learned that Operation Talon was in limbo as the agency waited for guidance from the new administration.", "Emails among senior immigration officials show them eschewing most enforcement activity while waiting for more permanent guidance to be issued in the coming days.", "ICE officials also canceled Operation Talon, a nationwide operation targeting sex offenders subject to deportation that had been planned in the final weeks of the Trump administration, emails show.", "A senior ICE official said the Biden administration had nothing to do with that decision. Speaking on the condition of anonymity to discuss internal matters, the official said they had not heard about the operation, but that it was possible that career staffers had planned it and set it aside while awaiting new instructions from the Biden team.", "The official noted that Homeland Security Investigations, a separate wing of ICE that conducts criminal investigations, has continued investigating sex offenses involving U.S. citizens and noncitizens.", "A senior ICE official told the Post that the \"Biden administration had nothing to do with (the) decision [to cancel Operation Talon].\" This official also noted that “Operation Talon” was likely “set ... aside” as it awaited instructions from the Biden team. This estimation matches up with a news release published by ICE on Feb. 18, 2021, which stated that ICE had made an international organizational decision to place some temporary restrictions on their activities as they awaited guidance from the Biden administration.", "Tim Perry, the Chief of Staff at ICE, said on a press call about the new guidelines:", "These are interim guidelines which will be in place until they're superseded which we anticipate will be in approximately 90 days. They'll be superseded by guidance that is department-wide. The interim guidance that we're putting out today apply to all ICE enforcement action such as arrests, detainers and custody decisions and the guidelines apply to removals as well.", "The purpose of the guidance is to empower ICE to allocate its resources in a way that best addresses the most pressing national security, border security and public safety threats. And in so doing it should better enable ICE to perform its mission. Something important that these guidelines do not do, they do not exempt any individual who is unlawfully in the United States from being subject to an enforcement action and they do not exempt anyone from removal from the United States if they are unlawfully in the United States.", "It should also be noted that “Operation Talon” was not ICE’s sole vehicle to investigate and prosecute sex crimes. The ICE website, for instance, still lists programs such as Operation SOAR (Sex Offender Alien Removal). Homeland Security Investigations, a division of ICE, is also still capable of investigating and prosecuting sex crimes.", "Despite this, 18 state attorneys general penned a letter to the White House asking for this program to be reinstated. This letter cites a single source to support the claim that this program was “canceled” (the aforementioned article published in the Washington Post that quotes an official stating that program was likely “set aside”). Furthermore, this letter acknowledged that this decision was made by ICE and not the White House.", "The letter reads: “The undersigned Attorneys General of 18 States write to express our grave concern about the recent report that Immigration and Customs Enforcement (\"ICE\") has cancelled Operation Talon, a nationwide operation targeting illegally present convicted sex offenders for removal from the United States.”", "We still have some unanswered questions about Operation Talon. For instance, we were unable to find any news releases from the White House or ICE from the Trump era that touted this new program. While the Post reports that this program was planned in the final weeks of the Trump administration, it's unclear if this program was ever actually implemented. It's also unclear if this program was \"canceled\" or if it is just temporarily on hold for review.", "What is clear is that this was an internal operational decision made by ICE, not the  Biden administration, and that the suspension of this program does not stop ICE from investigating sex crimes. Our investigation into this topic is ongoing.", "Update [Feb. 25, 2021]: Added quotes from ICE chief of staff and revised rating from \"Research in Progress\" to \"Mixture.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]