["By Lori Robertson", "Posted on September 12, 2018", "Former President Barack Obama claimed that Republicans’ “sabotage of the Affordable Care Act has already cost more than 3 million Americans their health insurance.” That’s according to one estimate, but another found no significant change in the rate or the number of uninsured from 2016 to 2017.", "As politicians are wont to do, Obama cherry-picked the higher figure that more strongly supported his point.", "And since he made his remarks, another estimate, from the Census Bureau, was released, showing the percentage of Americans who were uninsured for all of 2017 wasn’t statistically different from 2016.", "These are estimates, based on surveys, and there are several differences in the methods and measurements that may explain some of the discrepancy. We can’t say whether one number is closer to the actual drop in the uninsured than the other. It is worth noting, however, that the number of people who signed up in late 2017 to purchase their own insurance on the Affordable Care Act’s exchanges decreased by 400,000 from the open enrollment period that began in late 2016. And the nonpartisan Congressional Budget Office estimates it’s the elimination of the individual mandate penalty — the penalty for not having insurance — next year that will cause a significant decrease in the number of people without health insurance. CBO estimated 4 million people will lose or drop coverage in 2019.", "Obama made his comment on Sept. 7 at the University of Illinois at Urbana-Champaign in a speech in which he urged the crowd “to vote because our democracy depends on it.” Among his criticisms of the current administration was the claim about an increase in the uninsured.", "The Gallup-Sharecare Well-Being Index backs up Obama. The phone survey found that the percentage of U.S. adults who are uninsured rose, from 10.9 percent in the fourth quarter of 2016 to 12.2 percent in the fourth quarter of 2017. That’s “the largest single-year increase Gallup and Sharecare have measured since beginning to track the rate in 2008,” Gallup said in a story on the results, and it represents an estimated 3.2 million people.", "The survey included 25,072 adults in all 50 states and Washington, D.C., for the fourth quarter of 2017, and 42,546 adults for the fourth quarter of 2016. The margin of error was plus or minus 0.4 percentage points.", "Another measure from the Centers for Disease Control and Prevention — the National Health Interview Survey — estimates that 29.3 million people (or 9.1 percent of the population) were uninsured during 2017, an increase of 700,000 people from 2016. However, the NHIS report called the 2017 figures “not significantly different from 2016.”", "The NHIS report, released in May, is based on data for 78,074 people, who were interviewed throughout the year.", "We’ve reported both estimates in our “Trump’s Numbers” reports on changes in various statistical measurements.", "Why is there such a difference between the two figures? At least some of the gap is due to differences in how the surveys are conducted and what exactly they are measuring.", "Dan Witters, research director of the Gallup-Sharecare Well-Being Index, told us there were several reasons why the two measures may be different. For one, the Gallup-Sharecare figures were for the fourth quarters of 2016 and 2017, while the NHIS figures come from surveys conducted throughout the year. Both surveys measure whether the respondents are uninsured at the time of the interview.", "He provided Gallup-Sharecare figures representing the full year, which brings the two estimates a little closer together. The Gallup-Sharecare estimates found a 1.0 percentage point increase in the uninsured for 2017, compared with 2016. That’s an increase of roughly 2.5 million American adults without health insurance, compared with the fourth quarter comparison figure of 3.2 million.", "And there are other differences: The Gallup-Sharecare is a random-dial phone survey — using both cell and landlines — of all adults, while the NHIS is an address-based, in-person survey, and the uninsured measure includes children. Both organizations then weight the responses to more accurately reflect the demographics of the full population.", "The method of interview matters. How people respond to a phone versus a mail survey can be different, Witters said. In fact, the well-being survey has since changed from a phone-based survey to mail-based, and won’t release new estimates until sometime in 2019, Witters said, once it has a new trend line using the same method of data collection.", "In other words, Gallup-Sharecare doesn’t want to compare data collected using different survey methods. Witters equates that to a “cautionary tale” in trying to compare estimates from two credible organizations.", "Sharon Long, a senior fellow at the Urban Institute, told us the NHIS survey would have a “much higher response rate” than a phone-based interview, which also could lead to different estimates. And the NHIS survey includes a few additional questions to verify that respondents are uninsured or not covered by Medicaid. “As a result, we would expect the estimated uninsurance rate to be lower in the NHIS than in Gallup, all else equal,” she said.", "The Urban Institute also measures uninsurance through its Health Reform Monitoring Survey, which releases figures for the first and third quarters and hasn’t published data beyond the first quarter of 2017 yet. HRMS uses an online survey, with respondents drawn from an internet panel. “We’re all measuring things differently,” she said, but there should be “more consistency when you look at trends over time,” instead of looking at individual levels.", "The individual numbers from the three measurements may be different, but the trend lines are similar, as the Urban Institute found in 2015 and in more recent comparisons Long provided to us. For instance, for the third quarter of 2017, the three groups had the following percentage estimates for the uninsured among the 18-to-64-year-old population: 14.8 percent (Gallup), 12.9 percent (NHIS) and 11 percent (HRMS, unpublished data). All three measurements are up, to varying degrees, from the first quarter of 2017 or the third quarter of 2016 — so they follow the same trend line — though the changes also may not be statistically significant.", "As for the gap between the 2017 NHIS and Gallup figures, Long says, “It’s a big difference and the problem is it’s hard to know what’s driving it.” There is a random element in any survey sample, she says. “We’ve been more cautious in not viewing a single quarter as clear evidence of a big change.”", "The closest we could come to creating an apples-to-apples comparison between the Gallup-Sharecare and NHIS survey still showed a sizable difference in the two organizations’ 2017 fourth quarter numbers. Both organizations publish figures for adults age 18 to 64, with Gallup-Sharecare showing 13.1 percent were uninsured in the fourth quarter of 2016 and NHIS showing 12.7 percent were uninsured. For the fourth quarter of 2017, Gallup-Sharecare found 14.8 percent of those nonelderly adults were uninsured, while NHIS’ figure was 13.2 percent.", "As for Obama’s claim of 3 million more uninsured Americans under the Trump administration, Witters said the Gallup-Sharecare survey “clearly supports that statement.”", "Long said she doesn’t think there’s a problem with using the figure. “It’s useful information but it should be presented with some caveats.”", "Obama could have said this was according to “one estimate,” instead of stating the number as a fact, particularly considering the NHIS figure is considerably lower.", "After Obama made his remarks, the U.S. Census Bureau on Sept. 12 released its estimates for the uninsured in 2017. It measures the percentage of Americans of all ages who were without health insurance for the entire year, finding both the rate (8.8 percent) and number (28.5 million people) of the uninsured were not statistically different from 2016.", "The Census also measures the uninsured at the time of interview and gives annual averages and state-by-state figures for that measure. Similar to NHIS, the Census found an increase in the number who didn’t have insurance at the time of interview of 715,000 (with a margin of error of plus or minus 248,000), and it found the uninsured rate had increased in 14 states and decreased in three states by statistically significant amounts (see Table 6 and Table A-5).", "The Trump administration has taken some actions that experts perceived as a hindrance to those getting coverage through the Affordable Care Act exchanges, such as reducing the open enrollment period in 2017 by half and cutting the advertising budget for the exchanges by $90 million.", "Despite those actions, the number of people signing up in the 2017 open enrollment period (for policies starting in 2018) through the ACA exchanges for coverage dropped only slightly, by 400,000 people. The number with exchange plans was 11.8 million, a 3 percent drop from the 12.2 million who signed up during the 2016 open enrollment period for 2017 plans. Open enrollment then didn’t end until Jan. 31, 2017, though the Trump administration cut off promotional spending for the final days of that period.", "The year before, the figure was 12.7 million, according to the government’s final enrollment report released April 3.", "The decrease in exchange-plan coverage was smaller than experts had expected. When preliminary numbers were announced in late 2017, Larry Levitt, senior vice president for health reform at the Kaiser Family Foundation, tweeted that he was “very surprised that ACA marketplace enrollment is down only slightly.”", "The open enrollment period this year for the 39 states under HealthCare.gov runs from Nov. 1 to Dec. 15.", "As we said, estimates from the nonpartisan Congressional Budget Office project larger movement in uninsurance for 2019, due to the Republican tax law’s elimination of the penalty associated with the ACA’s individual mandate. CBO estimates that will cause 4 million people to lose or drop coverage in 2019, rising to 12 million two years later and 13 million in 2025.", "Some will choose not to get insurance, while others will be priced out of the individual market. “[H]ealthier people would be less likely to obtain insurance and … the resulting increases in premiums would cause more people to not purchase insurance,” CBO said.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]