["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump says this White House is leaving behind a lot of red ink.", "\"Barack Obama has doubled, during his fairly short period of years, he’s doubled our national debt. Doubled it. It’s going to be close to $20 trillion when he leaves,\" Trump told supporters at a Sept. 6 rally in Virginia Beach.", "Did Obama double the national debt? We checked.", "The Trump campaign’s press office justified his statement by sending us a link to U.S. Treasury Department figures on the size of the national debt.", "On Jan. 20, 2009, the day Obama took office, the total national debt stood at $10.6 trillion. On Sept. 6, the day Trump made his statement, it was $19.5 trillion.", "Over the past year the debt has grown by more than $1 trillion, so Trump’s estimate that the debt will be \"close to $20 trillion\" by the time Obama’s term ends in January is reasonable and is close to doubling the amount from when the president entered office.", "These indebtedness figures take into account all obligations, including about $5.4 trillion in intergovernmental debt that the U.S. government owes itself, such as the Social Security and Medicare trust funds that are invested in Treasury securities.", "When looking at the size of the U.S. debt, some experts prefer tallying just the amount of debt held by the public in Treasury bills, savings bonds and obligations to foreign governments, because that’s the debt the government owes to outside entities.", "But even by that measure, the debt has risen sharply. Public debt this month stands at $14.1 trillion, a figure that’s more than double the $6.3 trillion total when Obama took office.", "But Trump’s statement implies that Obama is solely to blame for the rise in the debt, and that misses a key part of the story.", "While Obama proposes spending and signs it into law, all of the spending bill first must pass Congress. In other words, the rise in the debt is not a solo act by Obama.", "Other factors beyond elected officials’ actions contributed to the debt increase.", "Robert Bixby, executive director of the centrist Concord Coalition, told our colleagues at PolitiFact Wisconsin in July that given the fact that Obama took office as the Great Recession sapped government revenues, the debt \"would have exploded certainly during (Obama’s) first term, no matter who was president.\"", "Our ruling", "Trump said Obama \"doubled the national debt. Doubled it. It’s going to be close to $20 trillion when he leaves.\"", "The figures are correct, and we don’t doubt the president shares some of the blame for the increased indebtedness. But Trump’s statement leaves out some key points.", "First of all, the added debt wasn’t solely the responsibility of Obama; Congress had to approve it as well. And the recession that began before Obama took office in 2009 cut government revenues and led to some of the higher debt incurred during the president’s term.", "We rate Trump’s claim Half True.", "Donald Trump’s comments at his Virginia Beach event, (His statement is at just over 11:00 into the video).", "Email from Donald Trump’s press office, Sept. 8. 2016.", "U.S. Treasury Department, \"The daily history of the debt results,\" accessed Sept. 8, 2016.", "Office of Management and Budget historical tables, \"Federal debt at the end of the year, 1940-2021,\" accessed Sept. 8, 2016.", "PolitiFact Wisconsin, \"GOP Rep. Sean Duffy exaggerates role of Barack Obama, Hillary Clinton on federal debt,\" July 19, 2016.", "PolitiFact Arizona, \"Mike Pence claims national debt has nearly doubled under President Obama,\" Aug. 9, 2016.", "PolitiFact, \"Rand Paul: Debt doubled under Bush, tripled under Obama,\" April 9, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]