["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A website called Viral WDC said the deployment of the National Guard to the U.S.-Mexico border allowed immigration officials to arrest \"1,600 extra people\" trying to cross into the United States illegally.", "\"A major game-changing incident took place after the National Guard stormed the border to protect the immigration laws and defend citizens from having nearly 2,000 people break into America illegally. … Thanks to the National Guard arriving at the border to help lend a hand to the roving tribe of potential illegal immigrants, The U.S. Customs and Border Protection officers were able to arrest 1,600 extra people who were trying to allegedly cross the border illegally,\" said the May 14 post on Viral WDC, headlined \"National Guard storms Mexico border, makes game-changing impact in just 30 days.\"", "Facebook users flagged this story as part of efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.)", "Looking past the bluster of the headline, the story largely checks out.", "Government officials have credited National Guard troops at the border for contributing to the apprehension of 1,600 people, the capture of about 1,000 pounds of marijuana and 451 \"turn backs\" of individuals seeking to come into the United States illegally, CNN reported May 9, based on a conference call with CBP and National Guard officials.", "The Viral WDC story cites a Washington Examiner story that said, \"U.S. Customs and Border Protection officers have apprehended an additional 1,600 people attempting to illegally enter the country from Mexico since April 15 as a result of the deployment of National Guard troops to the southwest border.\"", "Neither Viral WDC nor the Washington Examiner say what the 1,600 number is in addition to. The way the Viral WDC story is written suggests that 1,600 would not have been apprehended if the National Guard wasn’t assisting. But there’s no evidence to support that.", "CNN said a CBP official \"did not have comparison numbers available, so it was not possible to determine if those figures were substantially more than if National Guard troops had not been dispatched to the border.\"", "Total apprehensions were up in April compared to March, but border apprehensions have been increasing since February. There were about 37,400 southwest border apprehensions in March, compared to approximately 38,300 in April, according to CBP.", "President Donald Trump on April 4 issued a memorandum so that the National Guard could help immigration officials stop the illegal entry of immigrants and illicit drugs.", "It’s important to note that the National Guard is not actually apprehending individuals. Instead, they are carrying out non-enforcement roles, serving as pilots, aerial observers, intelligence analysts, communications specialists, camera operators and vehicle mechanics.", "Defense Secretary James N. Mattis authorized the use of Defense Department funds to send up to 4,000 National Guard troops to the southern border to support U.S. Customs and Border Protection. He authorized the deployment through Sept. 30, the end of fiscal year 2018.", "The troops are deployed under Title 32 duty status, meaning they are under the command and control of their state governors but paid by the federal government and can undertake \"Homeland Defense activities.\"", "There are now more than 1,800 National Guard troops who deployed starting in early April, U.S. Customs and Border protection spokesman Daniel Hetlage told PolitiFact on June 6.", "A Viral WDC story said, \"National Guard storms Mexico border, makes game-changing impact in just 30 days.\"", "Officials have said that the deployment of the National Guard to the border has contributed to the apprehension of 1,600 people. The Viral WDC story said the deployment was a \"major game-changing incident\" and that it allowed the arrest of \"1,600 extra people.\"", "While the National Guard’s support has enabled more agents to be on the ground to apprehend immigrants, it’s unclear if these are \"extra\" apprehensions or simply following the previous months’ trend.", "We rate the statement Mostly True.", "Viral WDC, National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days, May 14, 2018", "Email interview, U.S. Customs and Border Protection spokesman Daniel Hetlage, June 6, 2018", "CNN, National Guard troops involved in 1,600 apprehensions at Mexican border, May 9, 2018", "Washington Examiner, Border deployment leads to arrest of 1,600 more illegal immigrants, May 9, 2018", "U.S. Customs and Border Protection, Southwest Border Migration FY2018, last published June 6, 2018", "White House, Presidential Memorandum for the Secretary of Defense, the Attorney General, and the Secretary of Homeland Security, April 4, 2018", "U.S. Customs and Border Protection, National Guard Continues to Provide Invaluable Support to the Laredo Sector Border Patrol Mission, June 1, 2018", "Defense Department, National Guard Troops Deploy to Southern U.S. Border, April 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]