["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Trying to keep the outsider label that propelled him to victory in the Republican primary for governor, millionaire businessman Rick Scott said on Sept. 2, 2010, that he's picked a fellow outsider for lieutenant governor in Jennifer Carroll.\n\n\"We have similar backgrounds,\" Scott said in a press conference in Brandon to announce Carroll's selection. \"She's smart, she wants to work hard. She's got experience in the Legislature. She's an outsider like I am.\"\n\nCarroll, who was considered as a potential running mate for Charlie Crist in 2006, has an interesting story. Let's see if it adds up to being an outsider.\n\nCarroll, 51, was born in Port of Spain, in Trinidad, but was brought to the United States by her family at a young age.\n\nShe joined the U.S. Navy and rose from jet mechanic to become the top aide to an admiral. In 1999, she retired from the Navy as a lieutenant commander and started a public relations firm, 3N. & J.C. Corp. She moved to northeast Florida in 1986.\n\nWe've already ruled that Carroll would be the second woman and first African-American woman elected lieutenant governor. That certainly puts her outside the norms of politics, as does her being born in Trinidad.\n\nBut Carroll's life after the Navy seems pretty political insider to us.\n\nConsider:", "Carroll's official state House biography also includes the following highlights -- Republican Club of Clay County, \"Top 10\" Republican Award 1999, 2002; appointed by President George W. Bush to the White House Presidential Scholars Commission, 2001-2004; appointed by President George W. Bush to the Veterans' Disability Benefits Commission, 2004-2007; Black Political Action Committee's 2005 Vikki Buckley Political Leadership Award.\n\nCarroll's life story certainly has some of the hallmarks of being a political outsider. She was born outside the United States and spent 20 years working in the Navy. But after retiring from the Navy in 1999, Carroll has very much made politics a key part of her life. She twice ran for Congress, said she was in talks for a job with Vice President Cheney, ran the state's Department of Veterans Affairs, was elected to the Florida House and was considered for Crist's lieutenant governor choice in 2006. So Carroll has some outsider, and some insider. We rate Scott's statement Half True.", "(Correction: This story has been updated to note that Jennifer Carroll retired from the Navy as a lieutenant commander).", "St. Petersburg Times, \"Video: Rick Scott and Jennifer Carroll meet the press,\" Sept. 2, 2010\n\nJennifer Carroll, state House biography, accessed Sept. 3, 2010\n\nRick Scott campaign, meet Jennifer Carroll, accessed Sept. 3, 2010\n\nWall Street Journal, \"Meet Jennifer Carroll,\" Sept. 3, 2010\n\nPalm Beach Post, \"Gov. candidate Scott picks Florida Legislature's only black Republican as running mate,\" Sept. 2, 2010\n\nFlorida Times-Union, \"Carroll to head state veterans division,\" May 15, 2001, accessed via Nexis\n\nFlorida Times-Union, \"Defeated GOP candidate mentioned for Cheney staff,\" Jan. 24, 2001, accessed via Nexis\n\nFlorida Times-Union, \"Brown overcomes Carroll to retain 3rd District seat,\" Nov. 8, 2000, accessed via Nexis\n\nFlorida Times-Union, \"Carroll ready to announce,\" July 18, 2002, access via Nexis\n\nFlorida Times-Union, \"Third try works for Carroll,\" April 19, 2003, accessed via Nexis", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]