["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A researcher processes a coronavirus antibody test. (WRAL screenshot)", "A North Carolina congressman says 10% of his state’s population has been exposed to the novel coronavirus.", "U.S. Rep. Greg Murphy, a doctor and a Republican, made the claim in a June 23 Facebook post criticizing Democratic Gov. Roy Cooper.", "\"We also found out over the weekend that antibody testing conducted by Dr. John Sanders at Wake Forest University showed that over 1 million people in North Carolina have now been exposed to the virus. How could another institution in our state get this done so quickly when the governor’s administration could not?\" Murphy wrote.", "Is Murphy right that 1 million North Carolinians have been exposed to the novel coronavirus? This particular claim stands out for several reasons:", "1 million people equates to roughly 10% of North Carolina’s population, which is a little more than 10 million.", "North Carolina’s total number of lab-reported cases hasn't hit 100,000.", "At the time of Murphy’s tweet, the World Health Organization reported that there were fewer than 9 million cases reported worldwide.", "There were fewer than 3 million cases in the United States as of July 6, according to the CDC.", "Some people contract the virus and never know it because they don’t experience symptoms. So they would not be counted in tallies of confirmed positive cases that are often reported. The New York Times reported in June that the number of infections in certain parts of the country could be 10 times higher than the number of reported cases, based on Centers for Disease Control and Prevention data.", "In his Facebook post, Murphy makes an estimate based on preliminary data in an antibody study at Wake Forest University. But the post goes too far. Murphy frames the data as conclusive, something Wake Forest researchers and state officials aren’t willing to do.", "The first thing to know is an antibody test isn’t the same thing as a standard coronavirus test, often referred to as a \"diagnostic\" test.", "Diagnostic tests tell you whether you are presently sick with the virus. These types of tests are being administered and tracked by governments around the world.", "Antibody tests, as the CDC points out, detect proteins in your body that help fight off infections and can provide protection against a disease that you’ve been exposed to. So an antibody test may detect if you had a past infection with the virus that causes COVID-19.", "However, the CDC says the tests aren’t always definitive. Positive results can be triggered by other coronavirus strains, not just COVID-19. They also don’t show you whether you are currently infected with the virus. And scientists aren’t sure yet whether the presence of antibodies means someone is immune from the virus.", "So what did the Wake Forest University study say? The study, which state lawmakers sponsored in April, initially mailed tests to 1,000 North Carolinians.", "By mid-June, nearly 10% of the 5,000 people tested showed signs of antibodies, according to a story by WRAL.", "By June 30, the number of positive antibody tests had climbed to 12% from the study’s sample size of 18,000. Wake researchers hope to enroll more than 500,000 participants. And they post their updates online.", "Does that mean that 10% of North Carolinians have been exposed to the virus? No.", "The CDC has made estimates about coronavirus exposure in six select cases. But North Carolina is not one of them.", "Dr. John Sanders, section head of infectious diseases at Wake Forest Baptist Health and the lead researcher for the study, told PolitiFact that the study doesn’t have enough data yet to make an estimate about infections in North Carolina.", "\"Wake Forest Baptist Health has not extrapolated its data to cover the entire state,\" Sanders said through a spokesperson.", "Wake tracks the residence of participants. As of June 30, researchers had an abundance of evidence from the Winston-Salem area and far less from Wake and Mecklenburg counties — the two most populous areas of the state.", "\"The study's data is robust for our region but may not fully represent the state at this time,\" Sanders said.", "\"Our partners at Atrium Health are currently collecting data and expanding the sampling reach,\" he added. \"As we add WakeMed Health, Vidant Health and New Hanover to the study, more broad research and data will be available.\"", "We asked North Carolina’s health department if they believe the study results represent coronavirus exposure in the state.", "\"No, the proportion with positive antibodies depends on who is tested and we don’t have data yet to tell us what that proportion is statewide,\" said Kelly Haight Connor, the department’s communications manager.", "NC’s health department is also involved in other antibody prevalence studies, Connor said. So far, those studies found fewer positive returns.", "\"The first of those studies found SARS-CoV-2 antibodies in samples from 6.4% of random samples from 1,780 patients collected from mid-April to mid-May at UNC hospitals (Chapel Hill, Rex, Chatham and Johnston),\" she said.", "\"This study is on-going; researchers are doing additional analyses and will continue testing to monitor for changes over time.\"", "Researchers believe more people have been exposed than the case reports show. But they’re not predicting a figure as high as 10%.", "Paul Delamater, assistant professor in the Department of Geography at UNC-Chapel Hill, and Julie Swann, head of the Department of Industrial and Systems Engineering at North Carolina State University, told WRAL on July 6 that they believe roughly 500,000 people could have been exposed to the virus.", "Murphy said a study \"showed that over 1 million people in North Carolina have now been exposed to the virus.\"", "A Wake Forest study found that 10% of participants might have antibodies for the virus. But the leader of the study and NC health department officials say there’s not enough data yet to make an estimate about how many people have been exposed to coronavirus.", "Murphy extrapolated the data before it was ready. We rate this claim False.", "A Facebook post by U.S. Rep. Greg Murphy, a Republican from North Carolina, on June 23, 2020.", "Email correspondence with Michael Mead, spokesman for U.S. Rep. Greg Murphy.", "Story by the New York Times, \"Actual coronavirus infections vastly undercounted, C.D.C. data shows,\" posted June 27, 2020.", "Story by PolitiFact, \"Coronavirus testing: what we know, all in one place,\" posted May 5, 2020.", "Information from the U.S. Centers for Disease Control and Prevention on COVID-19 antibody tests, commercial laboratory seroprevalence survey data, and case totals.", "Stories by WRAL, \"NC Legislature will fund COVID-19 antibody tests,\" posted April 13, 2020; \"Antibody study shows more people infected with coronavirus in NC than numbers show,\" posted June 18, 2020; and \"Researchers: NC could have 4 times number of reported coronavirus infections,\" posted July 6, 2020.", "Reports from the COVID-19 Community Research Partnership, updated on June 30, 2020.", "Statement from Dr. John Sanders, provided by email through Wake Forest Baptist Health spokesperson Eryn Johnson.", "Email correspondence with Kelly Haight Connor, communications manager for the North Carolina Department of Health and Human Services.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]