["About this rating", "In early 2020, we received multiple inquiries from readers about the accuracy of a 10-month-old article which purported to highlight the left-wing ideology of Joseph Buttigieg, a prominent academic and the late father of Democratic presidential primary contender Pete Buttigieg.", "The article, published in April 2019 by the right-leaning Washington Examiner, was later shared on social media at a time when the mayor of South Bend, Indiana, appeared to perform well in the disputed Iowa caucuses, and joined U.S. Sen. Bernie Sanders in leading the polls ahead of the New Hampshire primary on Feb. 11.", "The Washington Examiner piece bore the headline, \"Pete Buttigieg's Father Was a Marxist Professor Who Lauded the Communist Manifesto.\" The article read:", "The father of Democratic presidential hopeful Pete Buttigieg was a Marxist professor who spoke fondly of the Communist Manifesto and dedicated a significant portion of his academic career to the work of Italian Communist Party founder Antonio Gramsci, an associate of Vladimir Lenin.", "Joseph Buttigieg, who died in January at the age of 71, immigrated to the U.S. in the 1970s from Malta and in 1980 joined the University of Notre Dame faculty, where he taught modern European literature and literary theory. He supported an updated version of Marxism that jettisoned some of Marx and Engel's more doctrinaire theories, though he was undoubtedly Marxist.", "He was an adviser to Rethinking Marxism, an academic journal that published articles “that seek to discuss, elaborate, and/or extend Marxian theory,” and a member of the editorial collective of Boundary 2, a journal of postmodern theory, literature, and culture. He spoke at many Rethinking Marxism conferences and other gatherings of prominent Marxists.", "In a 2000 paper for Rethinking Marxism critical of the approach of Human Rights Watch, Buttigieg, along with two other authors, refers to \"the Marxist project to which we subscribe.\"", "In 1998, he wrote in an article for the Chronicle of Higher Education about an event in New York City celebrating the 150th anniversary of the Manifesto. He also participated in the event. \"If The Communist Manifesto was meant to liberate the proletariat, the Manifesto itself in recent years needed liberating from Marxism's narrow post-Cold War orthodoxies and exclusive cadres. It has been freed,\" he wrote...", "In analyzing the political beliefs of academic writers, one must often be careful not to conflate a researcher's focus and dedication to a particular area of study, or to the writings and work of a particular subject, with unambiguous endorsement and support for those writings. (For example, think of historians who dedicate their careers to studying and writing about the actions of brutal dictators, or criminologists who pore over the lives and appalling offenses of serial killers.)", "Likewise, it is common for academics ⁠— especially in the fields of philosophy, literary criticism, and political theory ⁠— to advance or speak highly of a certain argument or piece of writing based on the thoroughness or logical coherence of its arguments, or the novelty of its insights, rather than based purely on whether they \"agree\" with it in a straightforward sense.", "It's also worth noting that Pete Buttigieg himself has clearly and consistently affirmed his support for capitalism (although he has emphasized that \"it has to be democratic capitalism\"), so it's not clear what relevance his late father's political ideology has to any discussion around the mayor's presidential campaign.", "With all that in mind, we carefully examined several of Joseph Buttigieg's published writings, including those cited by the Washington Examiner. Based on those writings and pronouncements, it's clear that he did indeed consistently articulate a broadly Marxist worldview, used terminology associated with Marxism and with the writings of the Marxist Italian theorist Antonio Gramsci, and also professed a fondness for — but also a critical view of — \"The Communist Manifesto,\" the massively influential text published by Karl Marx and Friedrich Engels in 1848.", "Joseph Buttigieg moved to the United States from his native Malta in the 1970s, ultimately settling in South Bend, Indiana, where he was the William R. Kenan Jr. Professor of English at the University of Notre Dame from 1980 until his retirement in 2017. He died in January 2019 at the age of 71. He researched the works of the Irish novelist James Joyce and most prominently, the life and work of Antonio Gramsci, the early 20th century Marxist theorist and co-founder of the Italian Communist Party.", "The elder Buttigieg made a significant contribution to the study of Gramsci's works with his three-volume English translation of Gramsci's \"Prison Notebooks\" (\"Quaderni del carcere\"), and he served for a time as secretary of the International Gramsci Society.", "Gramsci's principal contribution to Marxist thought was in his development of the concept of \"cultural hegemony,\" according to which a ruling class exerts and perpetuates the existing power dynamic in a capitalist society by molding social norms, values, and mores in such a way that the oppressed class (referred to in Marxism as the \"proletariat\" and in Gramsci's work as the \"subaltern\" class) adopts those values as if they were fixed and inevitable. In this way, according to the theory, capitalist power structures can perpetuate themselves in a non-violent, orderly manner by manufacturing and manipulating the unspoken and unwitting consent of those who are oppressed by those structures.", "In writing about Gramsci, Marxism, and concepts related to cultural hegemony, Joseph Buttigieg often engaged in comparative analysis and close reading of various texts, describing and contrasting the arguments of various contributors, assessing their weaknesses and strengths, and so on. This is typical of academic writing in the field of critical theory and philosophy. However, at times his own personal viewpoint became clear.", "For example, in a 1999 paper on the subject of globalization, colonialism, and the English language, Buttigieg described the work of Frantz Fanon, a post-colonialist political philosopher from the Caribbean island of Martinique. In his essay, Buttigieg first outlined Fanon's arguments, quoting heavily from his writings, but then wrote that Fanon's arguments \"revealed\" how \"the colonized individual participates in his or her own subordination from the moment in which he or she aspires to acquire the language of the colonizer [...].\"", "The use of the word \"reveal\" is crucial, because it signals that Joseph Buttigieg, in the ensuing passage, is switching modes from merely describing what Fanon had written, to offering his own personal viewpoint, which is that Fanon's arguments illustrate a certain reality, rather than merely constituting a particular viewpoint. In doing so, the elder Buttigieg clearly demonstrates that he himself thinks the teaching of the English language in British colonies is an instance of Gramscian cultural hegemony, and articulates his own broader Marxist worldview. The passage reads as follows:", "\"Fanon's exposition, constructed around a series of vignettes, reveals how the colonized individual participates in his or her own subordination from the moment in which he or she aspires to acquire the language of the colonizer and thus gain access to and appropriate the culture — the worldview — of the colonizer. The efforts of the colonized to gain fluency in the language of the colonial master only reinforce the stranglehold of the colonizer.\"", "Buttigieg also articulated his own personal viewpoint in a 1995 paper, also published in Boundary 2, a journal of postmodern theory. There, he wrote that Gramsci \"could...perceive\" how \"a dominant class becomes securely entrenched [...].\" Buttigieg did not write that Gramsci \"thought\" or \"claimed\" or \"argued\" that the dominant class in a society perpetuated its power in a particular way. He wrote that Gramsci was able to perceive the way in which that happened — meaning that, according to Buttigieg's own viewpoint, Gramsci had recognized a particular reality, rather than simply making a claim.", "Even more clearly than the first example, the ensuing passage demonstrates that Joseph Buttigieg did not merely study or write about Gramsci's strand of Marxism — he himself subscribed to it:", "Even before he developed his concepts of civil society, hegemony, and so on, Gramsci could already perceive how a dominant class becomes securely entrenched not by forcefully repressing the antagonistic classes but rather by creating and disseminating what he calls a forma mentis [a mindset], and by establishing a system of government that embodies this forma mentis and translates it into an order, or, better still, makes it appear to be orderliness itself.", "For this to happen, of course, the dominant class or classes must accept that the government apparatus cannot always assert their corporate interests narrowly and directly; the necessary fiction that the government of the state transcends class distinctions can remain credible only if concessions are made to address the most pressing needs and to accommodate some of the aspirations of the disadvantaged strata of the population.", "The groups that are out of power in this kind of state are allowed to aspire for power, but the prevailing forma mentis will induce them to pursue their goals in a manner that does not threaten the basic order or orderliness as such; in other words, they will not aim to overthrow the state and establish a new kind of state but instead will compete for a greater share of influence and power according to the established rules of the game. (This is what trade unions, for example, have often done; in the United States today, the same function is performed by so-called lobby groups.)", "The two citations provided by the Washington Examiner were also authentic. In 2000, Joseph Buttigieg joined with two other authors in publishing a paper which evaluated some of Human Rights Watch's proposals from a Marxist perspective, centered around \"The Communist Manifesto.\" One of the premises of that analysis was that human rights advocacy was often reductively legalistic, and failed to properly take into account the local, regional, and global socioeconomic forces that facilitated and perpetuated the kinds of human rights abuses highlighted by groups such as Human Rights Watch — a classic Marxist stance.", "In one section of the paper, the authors critically assessed some of the specific recommendations made by Human Rights Watch, drawing a distinction between \"utopian\" proposals and \"fantastic\" solutions to social ills and rights violations, as follows:", "\"Although we agree with Marx and Engels that one should reject fantastic solutions, we believe that it is important to distinguish between a Utopian imaginary that is conducive to social change and mere fantasies that are counterproductive. The very creation and promotion of an imaginary that transcends existing practices is essential to movements striving to generate social change. Even the discursive production of a Utopian future can affect public conceptions and expand the horizon of imagined possibilities. In fact, the Marxist project to which we subscribe is based on this kind of utopianism. While most of Human Rights Watch's proposals are also Utopian in this constructive sense, at times it offers fantastic recommendations.\" [Emphasis is added].", "As an example of a counterproductive \"fantastic\" solution, the authors point to Human Rights Watch's proposal that child workers in India be encouraged to form unions. According to the authors, including Joseph Buttigieg, that proposal fell into the category of a destructive fantasy, rather than a constructive, utopian goal, because it \"lacks contextual sensitivity\" and \"does not take into account the powerlessness and utter vulnerability of these children,\" as well as the violence and retribution to which even adult workers were subjected in response to efforts at organized protest.", "The passage highlights two main points of interest. Firstly, it provides yet another demonstration that the elder Buttigieg not only wrote about and studied a particular version of the \"Marxist project,\" but that he subscribed to it, quite explicitly, as highlighted in the line quoted by the Washington Examiner.", "Secondly, it alludes to the fact that while Joseph Buttigieg clearly articulated a reverence for \"The Communist Manifesto\" (explicitly using it as the cornerstone of the paper's examination of Human Rights Watch's proposals), he also took a critical approach to it. This was shown at the outset of the paper, where the authors wrote:", "\"While we have chosen to use the Manifesto as the point of reference — and as a way of commemorating its recent 150th anniversary — we would like to indicate at the outset that we do not subscribe to a form of Marxism that privileges the economic base over the superstructure, nor do we concur with the Manifesto's reductionist elements.\"", "Buttigieg and the other authors were alluding there to a strand in Marxist thought which somewhat de-emphasizes the importance of what Marx presented as the \"base\" — purely economic forces and power dynamics in society, such as the means of industrial production, relations between employer and employee, and so on — and somewhat emphasizes the importance of what Marx presented as the \"superstructure\" — politics, civil society, institutions, and culture.", "This is in keeping with Gramsci's shift beyond \"economic determinism\" and his emphasis on the role of culture in perpetuating power dynamics (cultural hegemony), and also illustrates his anti-dogmatic vision of Marxism, referred to as \"open Marxism\" — two key tenets that Buttigieg shared. On the subject of Gramsci's \"open Marxism,\" Buttigieg wrote in 1992:", "\"The antidogmatism of Antonio Gramsci — so salient a feature of his behavior as a political leader, of his theories, and of his overall approach to intellectual inquiry — is one of the principal reasons why his work continues to attract sympathetic consideration from readers of all political stripes even at a time when Marxist thought has been given up for dead.\"", "So while it's true, as the Washington Examiner pointed out, that Joseph Buttigieg took part in a 1998 event commemorating the 150th anniversary of \"The Communist Manifesto,\" and clearly regarded that text with a degree of reverence, he also viewed it critically and, like Gramsci, explicitly rejected what he presented as its overly-narrow emphasis on the role of purely economic forces in class struggle.", "In the same report on that 1998 event, the elder Buttigieg described how live readings from \"The Communist Manifesto\" were juxtaposed with Tony Kushner's live reading of his play \"Slavs!\" which includes a satire of Gorbachev-era dogmatic Marxists. Buttigieg wrote:", "\"After a musical interlude, seven people read different portions of the Manifesto. Listening to it read, one could not help but be struck by the poignancy of its prose. Yet, Kushner et al. had implicitly warned even us faithful to guard against conferring upon it the status of Scripture, a repository of doctrinal verities.\" [Emphasis is added].", "Larsen, Emily and Joseph Simonson.  \"Pete Buttigieg's Father Was a Marxist Professor Who Lauded the Communist Manifesto.\"\r\n    The Washington Examiner.  2 April 2019.", "Gramsci, Antonio (transl. by Joseph A. Buttigieg and Antonio Callari).  \"Prison Notebooks.\"\r\n    Columbia University Press.  1992.", "Rosengarten, Frank.  \"Conferring on Gramsci.\"\r\n    Rethinking Marxism.  Vol. 11.1, Spring 1999.", "Rosamond, Ben.  \"Hegemony.\"\r\n   Encyclopaedia Britannica.  17 May 2016", "Buttigieg, Joseph A.  \"Teaching English and Developing a Critical Knowledge of the Global.\"\r\n   Boundary 2.   Vol. 26.2, Summer 1999.", "Buttigieg, Joseph A.  \"Gramsci on Civil Society.\"\r\n   Boundary 2.   Vol. 22.3, Autumn 1995.", "Gordon, Neve; Swanson, Jacinda; Buttigieg, Joseph A.  \"Is the Struggle for Human Rights a Struggle for Emancipation?\"\r\n   Rethinking Marxism.  Vol. 12.3, Fall 2000.", "Buttigieg, Joseph A.  \"The Open Marxism of Antonio Gramsci (Review of 'Antonio Gramsci: Architect of a New Politics').\"\r\n   The Review of Politics.  Vol. 54.1, Winter 1992.", "Buttigieg, Joseph A.  \"Marking the Anniversary of 'the Communist Manifesto.'\"\r\n   The Chronicle of Higher Education.  11 December 1998.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]