["About this rating", "A police department posted a humorous message on Facebook warning meth users about potential Ebola contamination.", "Methamphetamine supplies have been contaminated with Ebola.", "In March 2016, several warnings circulated on Facebook stating that methamphetamine supplies, and the ingredients used to create meth for recreational drug use, could be contaminated with the virus for the deadly disease Ebola. While the most popular version of this Facebook message claimed that the Ebola contamination affected meth users in Hot Springs, Arkansas, other iterationsmentioned various locations that included cities in the states of California, Oklahoma, Texas, Washington and Kentucky:", "Regardless of the locations mentioned in these warnings, they all featured nearly verbatim language and a generic \"Breaking News Alert\" graphic  — the hallmark of fake news hoaxes.  While police departments may appreciate drug users' voluntarily turning their meth in due to fears of Ebola contamination, these messages are an obvious jape.", "The exact origins of the joke warnings are unclear, but we did find at least one police department Facebook page that reproduced one of them. On 23 March 2016, the Grayson Police Department posted on Facebook that their warning had been \"tongue in cheek\" and that the ruse resulted in no arrests:", "Well, apparently everyone is confident in the quality of their methamphetamine, as we had no one bring theirs in to be checked. While our post yesterday was \"tongue in cheek\", the dangers of meth use are no laughing matter. As always, we encourage anyone with suspicions of illegal drug activity to give us a call!", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]