["The image was published here on Twitter on November 10, 2020.", "It also shows the logo of Sharma’s team, the Mumbai Indians, being displayed over a blue background on the Burj Khalifa, which is the world’s tallest building.", "The post circulated the same day that the Mumbai Indians won the Indian Premier League title for the fifth time, as AFP reported.", "The image was also shared on Facebook here and here and on Instagram here and here.", "The image, however, has been doctored.", "Reverse and keyword searches on Google found that the original photo shows the Burj Khalifa lit up in blue with no image of Sharma or the Mumbai Indian’s logo.", "It was published here on Emirates 24x7, a local UAE news website, on April 4, 2016.", "Part of the report reads: “On the occasion of the 8th annual World Autism Awareness Day, Emaar Foundation joined thousands of landmarks, skyscrapers and residences across the world to mark the ‘Light It Up Blue’ campaign, with a magnificent blue illumination of the world’s largest LED-illuminated façade on Burj Khalifa.”", "Below is a screenshot comparison of the photo in the misleading post (L) and news website photo (R):", "Emirates 24x7 published the same photo on Twitter here on April 5, 2016.", "Another photo of the building lit up in blue for World Autism Awareness Day was also published on the Burj Khalifa’s official Twitter account here April 3, 2016.", "Have you seen #BurjKhalifa lit up in blue for #WorldwideAutismAwarenessDay last night? pic.twitter.com/UO2UOu6HTD", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]