["Voters at a town hall meeting in Iowa raised red sheets of paper when they disagreed with Rep. Rod Blum (R-Iowa). (Getty Images)", "Rep. Rod Blum, R-Iowa, faced a feisty crowd at a high school gymnasium in Dubuque when voters in his district pressed him on his vote for the House Republican health care bill, the American Health Care Act.", "Blum aimed to put the bill’s changes into perspective.", "\"This bill, Trumpcare — whatever you want to call it — is about the individual market only,\" he said May 8. \"That’s 12,000 people in my district. So if you’re in the group health insurance program through your employers, if you’re getting your insurance through the group health insurance, nothing changes.\"", "In this fact-check, we look at whether the House GOP measure changes nothing in employer-based plans.", "In reality, the bill does change the rules in a couple of ways that could affect employer plans. But the impact is far from certain.", "Core benefits", "One of the changes has to do with a key amendment authored by Rep. Tom MacArthur, R-N.J.", "It gives states the option to pick their own list of \"essential health benefits,\" the services that every plan must provide.", "Under the Affordable Care Act, that list includes 10 services, from hospitalization to prescription drugs to pediatric care and more.", "Under the American Health Care Act, states could apply for waivers to drop some items from that list. Some common examples are maternity care or mental health, services that weren’t always part of insurance plans before the Affordable Care Act took effect.", "Blum’s spokesman Paul Smith told us it is wrong to focus on the MacArthur waivers. Blum \"was speaking about the large-group market, not the small-group market where the MacArthur waivers could potentially apply,\" Smith said.", "Smith is correct that the amendment only addresses the individual and small-group markets.", "But that doesn’t settle the question.", "First, Blum spoke about employer-based insurance generally. The distinction between  small- and large-group plans might have been lost on his audience.", "Yet even if he was thinking about large employer plans, which cover about 110 million people nationwide, health law analysts say the Republican bill could touch those plans and those people, too.", "The link between the list of benefits and financial protection", "The Affordable Care Act, also known as Obamacare, has two financial cushions for people. It bans annual and lifetime limits on coverage and requires insurance companies to put a cap on how much a person needs to pay out-of-pocket. In theory, no matter how big the medical bills get, they won’t drive someone into bankruptcy.", "The important thing is, both protections apply only to services on the essential benefits list.", "There’s another wrinkle.", "Companies that offer insurance through a large-group or a self-insurance plan are not required to provide every service on the essential benefits list, but for any item on that list that they do offer, those financial protections kick in.", "With that, we get to the significance of the MacArthur amendment. No one knows how many states will want to trim the essential benefits list, but the possibility could create some new options for the larger plans.", "\"Employers could choose to base the plans they offer on a definition of essential health benefits that is considerably weaker than the current one,\" Matt Fiedler, a health studies fellow at the Brookings Institution, said.", "Fiedler said any service not on a state’s list is not subject to the financial protections of no yearly or lifetime limits.", "Health law professor Allison Hoffman at UCLA gave the hypothetical case of maternity and newborn care.", "\"If the American Health Care Act becomes law, a state might define essential health benefits not to include maternity and newborn care,\" Hoffman said. \"Then, an employer could once again cap them.\"", "Neither Fiedler nor Hoffman said that this would definitely happen; only that it could happen.", "Thomas Miller, a health law fellow at the market-oriented American Enterprise Institute, doesn’t argue the point. But Miller does downplay the significance.", "\"It's not unusual for the first round of voting on bills with recently revised amendments  to fail to connect and integrate fully with pre-existing law,\" Miller said.", "He described this intersection between the MacArthur amendment and current regulations, an \"indirect bankshot\" that has nothing to do with the amendment’s purpose or intent.", "Miller and Fiedler said the problem could be avoided through new regulations.", "End of the employer mandate", "Under the American Health Care Act, no one must buy insurance, nor do employers have to offer it. Fiedler called this change \"clear and unambiguous.\"", "\"The Congressional Budget Office projected that there would be a change in behavior,\" Fiedler said.", "The CBO didn’t look at the individual and employer mandates separately, but in its initial assessment of the House Republican bill, it said eliminating both would \"substantially reduce the number of people with health insurance coverage.\"", "Miller noted that since large employers regularly offer insurance in order to compete for workers, keeping or ending the mandate would make little difference.", "Our ruling", "Blum said for people who get their insurance through their employer, the American Health Care Act changes nothing. The experts we reached said that there actually is a way that the GOP bill could affect employer plans. States could decide to trim the list of essential health services. Employers could still offer a fuller range of services, but the extra ones wouldn’t be subject to the rules that protect households against massive medical bills.", "No expert said this was certain to happen. Right now, it is a legal possibility.", "The end of the employer mandate also changes the rules for large employers, ending penalties for those that don’t offer insurance. But for different reasons, the impact is uncertain.", "Blum's statement is partially accurate but leaves out important information. We rate it Half True.", "Correction: A previous version of this story misspelled Dubuque.", "Washington Post, Iowa congressman walks out of a TV interview and into an angry town hall meeting, May 8, 2017", "U.S. House of Representatives, Amendment to HR 1628, April 26, 2017", "Brookings Institution, Allowing states to define \"essential health benefits\" could weaken ACA protections against catastrophic costs for people with employer coverage nationwide, May 2, 2017", "New York Times, G.O.P. Bill Could Affect Employer Health Coverage, Too, May 9, 2017", "PolitiFact, PolitiFact’s guide to the GOP amendment to health care bill, April 28, 2017", "Kaiser Family Foundation, Compare Proposals to Replace The Affordable Care Act, accessed April 27, 2017", "Health Affairs Blog, \"The MacArthur Amendment Language, Race In The Federal Exchange, And Risk Adjustment Coefficients,\" April 25, 2017", "Congressional Budget Office, Cost estimate: American Health Care Act, March 13, 2017", "Wall Street Journal, GOP Health Bill Jeopardizes Out-of-Pocket Caps in Employer Plans, May 4, 2017", "Centers for Medicare and Medicaid Services, Affordable Care Act Implementation FAQs - Set 18, accessed May 9, 2017", "Centers for Medicare and Medicaid Services, Frequently Asked Questions on Essential Health Benefits Bulletin, Dec. 16, 2011", "Government Printing Office, Patient Protection and Affordable Care Act, Jan. 5, 2010", "Interview, Matt Fiedler, fellow, Center for Health Policy, Brookings Institution, May 9, 2016", "Email interview, Thomas Miller, American Enterprise Institute fellow, May 9, 2017", "Email interview, Allison Hoffman, professor of law, UCLA School of Law, May 9, 2017", "Email interview, Paul Smith, spokesman, Office of Rep. Rod Blum, May 9, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]