["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Del. Barbara Comstock says five U-turning Democrats ran over her bicycle safety bill in the state Senate last month.", "Comstock, who represents Fairfax County and is running for the 10th District congressional seat being vacated by Republican Frank Wolf, complained on her campaign’s Facebook page.", "\"Democrat senators were for my bipartisan ‘following too closely’ bicycle bill (HB 82) before they were against it!\" she wrote on Feb. 21. \"It was the same bill that Democrat senators voted for last year but this year, after I got it through the House (unlike the previous House patron) the senate killed it! Welcome to the new Democrat-controlled Virginia Senate.\"", "Comstock was referring to the Senate Transportation Committee’s 9-5 vote on Feb. 19 to kill her bill that would have made it illegal for a motorist to tailgate a bicycle.", "Two of Comstock’s political supporters posted Facebook replies accusing the Democrats of switching to undermine Comstock in her congressional race. A third supporter urged to her reveal the flip floppers.", "So Comstock posted the names of five Democrats: Sens. Creigh Deeds of Bath County, Henry Marsh of Richmond, Ken Alexander of Norfolk, Phil Puckett of Russell County and John Miller of Newport News.", "Records show that each of the five did vote to kill the bill. So we looked into Comstock’s claim each changed his previous position.", "Comstock’s one-paragraph bill would have barred motorists from following bicycles \"more closely than is reasonable and prudent.\" In recent years, bills with the same language have passed the House and Senate, but they’ve never been able to muster a majority vote from both chambers during the same year and make it to the governor’s desk.", "Last year, the Senate passed an anti-tailgating bill containing an additional provision that would have extended the 2-foot width motorists must allow when passing bicyclists to 3 feet. Deeds, Alexander, Puckett and Miller supported the legislation. Marsh voted against the measure.", "Marsh, however, did support legislation in 2012 that solely contained the tailgating provision. So did Deeds, Puckett and Miller. Alexander was not in the Senate that year and did not cast a ballot on the bill.", "We asked the Democrats why they changed their votes this year.", "Marsh and Deeds emailed that they were swayed by questions about the bill’s enforceability that were raised at a hearing last month by Sen. Charles Carrico Sr., R-Grayson. Carrico, a former state trooper, said issuing a tailgating ticket is a judgement call by police that’s tough to make stick in court unless there’s been an accident.", "\"I do not recall hearing this discussion in past years when I voted for similar legislation,\" Marsh wrote.", "Deeds emailed, \"I always reserve the right to be smarter today than I was yesterday.\"", "Alexander told us that before his vote in favor of the measure last year, he hadn’t had the benefit of sitting through a committee hearing on the law because he was new to the Senate and had not received his assignments. After hearing the committee debate this year, Alexander said he had concerns about how police would apply the \"necessary and prudent\" standard for following bicyclists.", "After voting to kill the measure on Feb. 19, Alexander asked the Transportation Committee to reconsider the bill to see if his colleagues would be willing to replace the \"necessary and prudent\" following distance with an exact measurement. The panel took the bill up and killed it a second time on Feb. 26, this time with Alexander voting in the minority.", "We reached out to Miller and Puckett about their changed votes, but didn’t hear back.", "It should be noted that backpedaling on bicycle tailgating bill is a bipartisan sport. Comstock’s list of Senate defectors included two Republicans who opposed tailgating legislation this year and supported it last year: Steve Newman of Lynchburg and Ralph Smith of Botetourt County.", "We should also note that the vote tallies were evenly split between Democrats and Republicans. Of the nine senators that voted to kill the measure five were Democrats and four were Republicans.", "Our ruling", "Comstock said a group of Senate Democrats once backed the language of her bike tailgating bill but now oppose it. She correctly identified five Democrats who changed their position, leading to the defeat on her bill this year.", "Although Comstock directed her ire at the Democrats, she did note that two Republican senators also switched positions this year.", "We rate her statement True.", "Del. Barbara Comstock’s congressional Facebook page, Feb. 21, 2014.", "Interview with Del. Barbara Comstock, Feb. 26, 2014.", "E-mails from Barbara Comstock, Feb. 26, 2014.", "E-mail from Jessica Goodman, legislative aide for Barbara Comstock, Feb. 25, 2014.", "Interviews with Sen. Kenneth Alexander, Feb. 25 and March 7, 2014.", "E-mail from Sen. Creigh Deeds’ office, Feb. 28, 2014.", "E-mail from Sen. Henry L Marsh’s office, March 4, 2014.", "E-mail from Tom Bowden, chairman of Bike Virginia, March 6, 2014.", "Interview with Tom Bowden, March 6, 2014.", "Legislative Information System, HB 82, Jan. 27, 2014.", "Legislative Information System, SB 1060, Jan. 9, 2013.", "Legislative Information System, SB 928, Jan. 12, 2011.", "Legislative Information System, SB 264, Jan. 12, 2012.", "Legislative Information System, HB 1048, Jan. 13, 2010.", "Legislative Information System, SB 97, Jan. 8, 2014.", "The Washington Post, \"More bike legislation scuttled by Virginia lawmakers,\" March 5, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]