["About this rating", "A photograph circulating on social media in mid-October 2019 was falsely characterized by some as portraying U.S. President Donald Trump's children — Donald Jr., Ivanka, and Eric — alongside Lev Parnas and Igor Fruman. The latter were arrested on charges that they schemed to illegally funnel foreign cash into Trump's election campaign.\n\nThe two men standing between Ivanka and Eric Trump are not Parnas and Fruman. The picture shows the Trumps, who ran a real estate empire before Donald Trump became president, standing with people associated with their business enterprise in Florida. The man standing immediately to Ivanka's left is real estate developer Michael Dezer. The man on Dezer's left (and Eric's right) is Michael Babel, according to historian Yuri Felshtinsky, while the woman in the photograph standing on Ivanka's right was Florida realtor Elena Baronoff, who died in 2015 from cancer. Neither Parnas nor Fruman are in the shot. (Donald Trump Jr., is pictured to the far right in the photograph).", "Parnas and Fruman were arrested on Oct. 9, 2019, at Dulles International Airport, where they had planned to board planes with one-way tickets out of the United States. The above meme appears to be a low-effort attempt to create the visual impression of close ties between the men and the Trumps, although actual photographs and reports do exist of interactions between Parnas, Fruman, and members of the Trump family, including Donald Trump himself.", "Fruman, Parnas, Trump and Giuliani. Via the @MiamiHerald https://t.co/Fg2FWnKhPB pic.twitter.com/nUjxrtdan9", "— Tim O'Brien (@TimOBrien) October 10, 2019", "The two men, described as \"associates\" of Trump's personal lawyer Rudy Giuliani, have since 2018 \"been assisting Giuliani’s push to get Ukrainian officials to investigate [Democratic presidential candidate Joe] Biden and his son, as well as Giuliani’s claim that Democrats conspired with Ukrainians in the 2016 campaign.\" As The Washington Post reported:", "Previous social media posts and interviews indicate the duo interacted with both Trump and his son Donald Trump Jr., and had attended events at Trump’s Mar-a-Lago Club in Florida and at the White House. Fruman attended a fundraiser held at Mar-a-Lago in March 2018.", "President Trump is facing an impeachment inquiry led by House Democrats over whistleblower allegations that he used his office to coerce Ukraine into providing damaging information on a political opponent by withholding crucial military aid.", "Felshtinsky, Yuri.  \"If at First You Don't Succeed, Try, Try Again: A Difficult Journey of Trump in Quest for Russian Money.\"\r\n  Gordonua.com. 21 February 2018.", "Hettena, Seth. \"A Brief History of Michael Cohen’s Criminal Ties.\"\r\n  Rolling Stone. 10 April 2018.", "Layne, Nathan, et al. \"Russian Elite Invested Nearly $100 Million in Trump Buildings.\"\r\n  Reuters. 17 March 2017.", "Barrett, Devlin, et al. \"Two Business Associates of Trump’s Personal Attorney Giuliani Have Been Arrested on Campaign Finance Charges.\"\r\n  The Washington Post. 10 October 2019.", "Helderman, Rosalind S., et al. \"How Two Soviet-Born Emigres Made It Into Elite Trump Circles — and the Center of the Impeachment Storm.\"\r\n  The Washington Post. 12 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]