["By Angelo Fichera", "Posted on January 4, 2019", "Social media posts wrongly claim Democrats voted against the Social Security cost-of-living increase for 2019. Adjustments to Social Security benefits are not decided by lawmakers.", "A 2.8 percent increase in Social Security benefits goes into effect this month.", "The increase is the result of a cost-of-living adjustment that, according to the Social Security Administration, is based on economic calculations — not on the whim of lawmakers.", "Even so, claims have recirculated on social media this week — after cropping up in the fall — that “ALL the Democrats voted AGAINST the 2.8% Social Security cost of living increase.”", "That’s not true. Lawmakers didn’t vote on the increase.", "The cost-of-living adjustment (or COLA) was announced in October. The annual adjustment is determined by the percentage increase in the Consumer Price Index for Urban Wage Earners and Clerical Workers, which is calculated by the Bureau of Labor Statistics. When there is no increase in the CPI-W for the specified time period, there is no COLA.", "The purpose of the automatic adjustment, according to the SSA, is to ensure that the purchasing power of Social Security benefits isn’t minimized by inflation.", "It’s been that way since 1975. Prior to that, benefit increases were the result of special legislation enacted by Congress.", "Misinformation about Social Security benefits has been going around for years.", "In 2017, we wrote about websites and blogs erroneously crediting President Donald Trump for the COLA announced in 2016 — before he took office. Years earlier, in 2010, we debunked a congressional candidate’s TV ad that blamed Congress for the fact that there was no cost-of-living adjustment that year. That followed our 2009 piece about a chain email that made an equally false claim about Democrats blocking an increase in benefits for 2009.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Cost-of-Living Adjustment (COLA) Information for 2019.” Social Security Administration. Accessed 4 Jan 2019.", "Gross, Zachary. “Trump Didn’t Increase Social Security.” FactCheck.org. 10 Apr 2017.", "Jackson, Brooks. “Social Security COLA.” FactCheck.org. 23 Sep 2009.", "Kiely, Eugene. “Congress Did Not Raise Its Pay, Deny Seniors Increase.” FactCheck.org. 6 May 2010.", "Social Security Administration. “Cost-Of-Living Adjustments.” Accessed 4 Jan 2019.", "“Social Security Announces 2.8 Percent Benefit Increase for 2019.” Press release, Social Security Administration. 11 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]