["About this rating", "In June 2020, social media users shared a meme containing text that claimed Melinda Gates said Black Americans \"must be\" first in line to receive a potential vaccine for coronavirus just after medical workers:", "In the U.S., that would be black people next, quite honestly, and many other people of color. They are having disproportionate effects from COVID-19. From there, people with underlying health conditions, and then people who are older. Those are the ones who all need it first. We also need to think about essential workers who are keeping our grocery stores open for us so we can buy food, or who are making sure that food moves through the warehouses.", "Her statement references data that show Black people have a higher risk of dying from the COVID-19 than white people. However, some people on social media gave the comment a conspiratorial meaning. Here is one such example, with the user's name cropped out for privacy:", "We rate this claim \"True\" because Melinda Gates did say that she believed Black people, who are at high risk for falling ill and dying from COVID-19, should be among the first vaccinated. But we note that some are interpreting her statement misleadingly. She did not say, for instance, they \"must be\" vaccinated against their will.", "Ducharme, Jamie. \"Melinda Gates Lays Out Her Biggest Concern for the Next Phase of the COVID-19 Pandemic.\"\r\n  Time. 4 June 2020.", "Centers for Disease Control and Prevention. \"The Tuskegee Timeline.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]