["“Former President Barack Obama arrested for ESPIONAGE,” reads the headline of an article published on November 28 and shared 6,000 times.", "According to the article, Obama conspired with a business partner to “communicate classified information” to Chinese intelligence officials.", "The article was used as a source to spread the claim on Facebook, Instagram, and in several YouTube videos.", "However, the claim is false.", "The body of the Conservative Beaver article near entirely plagiarizes an August 17, 2020 news release from the Department of Justice relating the arrest and charge of a former CIA officer in Hawaii.", "The article’s unnamed author only replaced the name of the charged spy, Alexander Yuk Ching Ma, 67, for that of Obama, and altered the description of Ma’s accomplice from “a relative” to “a business partner.”", "The article was also edited to include more recent tweets as evidence, but at least one of them from Guardian journalist Natalia Antonova was published as a joke mocking the implausible theory, Antonova confirmed to AFP via Twitter.", "Another tweet mentioned in the article is from a Twitter user who wrote on November 30 that Obama had been arrested, and denied his source was the Conservative Beaver, without providing further evidence.", "No other news outlet reported on the arrest of the former president, and none of his social media accounts mention any such incident.", "The Conservative Beaver’s domain was registered on September 19, 2020 and is “run by a small team of volunteers across Canada,” according to its “About” page.", "As of December 1, the outlet had not responded to an AFP enquiry about the Obama article.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]