["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Barack Obama recently released an attack ad on John McCain after Obama's abortion votes in the Illinois state legislature came under attack. The ad says that McCain accused Obama of \"letting infants die.\"", "But we do not find that to be the case.", "Our story begins with an ad from an independent advocacy group, BornAliveTruth.org, that exists to criticize Obama's votes on abortion when he was a state senator in Illinois.", "The group's ad shows a young woman, Gianna Jessen, looking directly at the camera and saying the following: \"Can you imagine not giving babies their basic human rights, no matter how they entered our world? My name's Gianna Jessen, born 31 years ago after a failed abortion. But if Barack Obama had his way, I wouldn't be here. Four times Barack Obama voted to oppose a law to protect babies left to die after failed abortions. Senator Obama, please support born alive infant protections. I'm living proof these babies have a right to live.\"\n\nView the ad here\n\n.", "The ad refers to Illinois legislation put forward in 2001, 2002 and 2003 by opponents of abortion. The intent was to require doctors to provide immediate life-saving care to any infant that survived an intended abortion. The legislation, which included multiple bills, specified that an infant surviving a planned abortion is \"born alive\" and \"shall be fully recognized as a human person and accorded immediate protection under the law.\"", "The bills' supporters said it gave added emphasis to laws already on the books, deterring the death of abortion survivors from neglect. One of the bills' strongest supporters was a nurse, Jill Stanek, who said she had witnessed infants left to die in dirty utility rooms. Abortion-rights proponents, on the other hand, said the legislation was a back-door attempt to stop legal abortions.", "Obama voted against the legislation several times. For more on the complicated history of this legislation\n\nread our story here.", "The Obama campaign has been trying to make inroads with voters who oppose abortion. Though Obama supports the right to abortion, he said he believes the number of abortions performed can and should be reduced. So the campaign released a vigorous response ad to the BornAliveTruth.org ad. But instead of targeting BornAliveTruth.org or Gianna Jessen,\n\nthe ad attacks McCain\n\n.", "\"John McCain's attacks, the sleaziest ads ever. Truly vile. Now, votes taken out of context accusing Obama of letting infants die. It's a despicable lie. Even the bill's Republican sponsor said that it's untrue. Obama's always supported medical care to protect infants. McCain. He's running on a platform to ban abortion, even in cases of rape and incest. Sleazy ads. Anti-choice. That's John McCain.\"", "There are a few problems here. Obama's ad shows footage of the BornAliveTruth.org ad, which the McCain campaign did not produce. So the Obama ad is blaming McCain for an attack he didn't make. The first ad clearly states that BornAliveTruth.org created it, as is required by law.", "Also, though the Republican Party platform does call for a ban on abortion, McCain himself favors exceptions for rape and incest. (His running mate Sarah Palin has said she opposes those exceptions, but the ad doesn't mention her.)", "We looked for examples, but could find no cases of McCain accusing Obama of \"letting infants die.\" Certainly some antiabortion activists who support McCain have made the charge, but that's quite different from the McCain campaign saying it. McCain's abortion-related attacks usually center on Obama's refusal to confirm conservative judges. We find the claim that McCain made the accusation to be False.", "Illinois General Assembly,\n\nRegular Session Senate Transcript\n\n, March 30, 2001", "Illinois General Assembly,\n\nRegular Session Senate Transcript\n\n, April 4, 2002", "Illinois General Assembly,\n\nBorn Alive Senate Bills\n\n, 2001", "Illinois General Assembly,\n\nBorn Alive Senate Bills\n\n, 2002", "Illinois General Assembly,\n\nBorn Alive Senate Bills\n\n, 2003", "U.S. Government Printing Office (federal law),\n\nBorn Alive Infants Protection Act of 2002", "Thomas,\n\nBorn Alive Infants Protection Act of 2002", "BornAliveTruth.org", "Current\n\nIllinois state law regarding abortion", "Illinois General Assembly,\n\nBorn Alive Act\n\n, passed 2005", "Barack Obama campaign Web site,\n\nfederal versus state \"Born Alive\" factcheck\n\n, June 30, 2008", "Barack Obama campaign Web site,\n\nBorn Alive legislation factsheet\n\n, Aug. 19, 2008", "Barack Obama campaign Web site,\n\nReckless accusations of infanticide", "Chicago Tribune,\n\nObama's record on abortion hit\n\n, Aug. 20, 2002", "Chicago Tribune, A big split over abortion, stem cells, Oct. 4, 2004, accessed via Nexis", "National Right to Life Committee,\n\nWhite Paper on Barack Obama and born alive legislation\n\n, Aug. 28, 2008", "CBNNews.com,\n\nObama gets heated on born alive protection act,\n\nAug. 16, 2008", "The Associated Press,\n\nObama comments on late term abortions\n\n, July 4, 2008", "Factcheck.org,\n\nBorn Alive Baloney\n\n, Sept. 24, 2008", "Factcheck.org,\n\nObama and \"Infanticide,\"\n\nAug. 25, 2008", "The 2008 Republican Party Platform,\n\n\"Maintaining the sanctity and dignity of human life.\"", "This Week with George Stephanopoulos, Interview with John McCain, Nov. 19, 2006, accessed via Nexis", "ABC News, Interview with Sarah Palin, Sept. 12, 2008, accessed via Nexis", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]