["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama with his wife Michelle Obama and his two daughters, Sasha and Malia, at an election night rally in Chicago on Nov. 4, 2008. (AP/Hong)", "Fox Business Network host Charles Payne wrongly claimed the market crashed as an \"instant reaction\" to former President Barack Obama’s election in 2008.", "During a June 17 segment on \"Your World with Neil Cavuto,\" Payne was asked about President Donald Trump’s tweet that his failure to win re-election would cause a major market crash.", "\"I think President Trump was talking about the knee-jerk reaction on Wall Street,\" Payne said. \"All you’ve got to do is look at history.\"", "Payne said the market went up 9% between the day Trump was elected and the day of his inauguration ceremony.", "\"Conversely, when President Obama was elected, the market crashed,\" he said. \"Trump was up 9%, President Obama was down 14.8% and President Bush was down almost 4%. There is an instant reaction on Wall Street.\"", "We decided to check if Obama’s 2008 victory sent the stock market spiraling and, more generally, if elections do trigger immediate reactions on Wall Street. So we reviewed the numbers and talked to economists.", "Put simply, Payne is right about the market numbers but wrong about what caused them and how fast they happened.", "Since Payne mentioned the period between Election Day and Inauguration Day, we first focused on that time frame, which for Obama was the window between Nov. 4, 2008, and Jan. 20, 2009.", "We found that the market did decline following Obama’s election, but it’s important to note that that window of decline was part of a larger trend set off by the 2008 financial crisis.", "The Dow Jones Industrial Average opened at 9,323.89 on Nov. 4, 2008, and dropped to a low of 7,939.93 by Jan. 20, 2009. That’s a 14.8% decrease, as Payne said. It continued sinking after Obama’s inauguration, hitting its lowest mark on March 6, 2009, at 6,469.95.", "Looking at just Nov. 4 and 5 of 2008, the Dow fell less than 2%, from 9,323.89 to 9,139.27. So there was a slight drop in that time frame, too.", "But those declines shouldn’t be considered a \"crash,\" experts told us. In reality, the Dow had been slipping since Oct. 9, 2007, when it reached its pre-recession peak at 14,166.97.", "On Sept. 29, 2008, before Obama’s election, the Dow fell 774.17 points in a single day. Two weeks before that, a declaration of bankruptcy from the financial services firm Lehman Brothers also caused the Dow to drop 498.86 points in a day’s time.", "\"The election of Obama did not cause the global financial crisis,\" said Tara Sinclair, professor of economics at George Washington University. \"The stock market can react strongly to news of all sorts, but the academic research is clear that the seeds of the global financial crisis and the Great Recession were sown well before Obama was elected.\"", "Sinclair said the 2008 financial crisis and market crash are generally attributed to \"issues in housing markets and financial interconnectedness that wasn’t foreseen by policymakers.\" (For more on the causes, read our analysis from 2008).", "In a statement to PolitiFact, Payne defended his use of the word \"crash.\"", "\"When the market declines almost 15% in less than three months, I consider that a crash,\" the Fox Business Network host said. \"I wasn't assigning blame, but the election at the time obviously didn't engender confidence in investors or mitigate concerns about issues at the time.\"", "But Kathleen Day, professor at the Johns Hopkins Carey Business School, said Payne is cherry-picking, since Obama’s presidency eventually saw net stock market gains.", "\"That’s like taking a snapshot on a rainy day,\" she said. \"Let’s look at how many sunny economic days we’ve had over the course of their tenure.\"", "For the record, the Dow opened at 13,112.90 on Nov. 6, 2012 — the day Obama was re-elected for a second term in office — and closed at 13,712.21 on Jan. 22, 2013, the first day the market was open after his second inauguration ceremony. That’s an increase of about 4.6%.", "The Dow rose 8.6% in the same time frame after Trump’s election in 2016 and fell 3.6% after former President George W. Bush won in 2000 — so Payne was right on those numbers, also.", "Experts we spoke to were mixed on whether the stock market reacts to presidential election results.", "\"Stock market fluctuations may reflect investors’ hope for the new administration that will take office on Jan. 20,\" said Gary Burtless, an economist at the nonprofit Brookings Institution, a think tank in Washington, D.C.", "But the same market fluctuations could also be the result of other economic factors, such as joblessness, company profitability or economic growth or decline, Burtless said. \"Much of this information may have nothing whatsoever to do with the new administration.\"", "Generally speaking, experts said it’s hard to explain market movements over a short period of time, such as the window between a president’s election and inauguration.", "\"The stock market is a little bit like a hysterical person on a boat running from one side of the boat to the other and making it tilt that way,\" Day said.", "\"The market is sensitive to elections, yes,\" she said. \"But no one really knows why it goes up or down everyday unless there’s some really catastrophic event.\"", "Sinclair, the George Washington University professor, also warned against drawing conclusions from comparisons of the stock market’s performance under different presidents, since each person comes into office facing different conditions. (PolitiFact compared Obama and Trump on the stock market in 2018.)", "Comparisons that begin with Election Day are especially unhelpful, Burtless added, because a new president won’t take the reins until after inauguration.", "\"In that period, the newly elected president has no say over any of the policy levers controlled by a president who actually holds office,\" Burtless said.", "For what it’s worth, it’s also not clear how valuable the stock market is as an indicator of the country’s economic health, let alone a president’s economic decision-making. Not every American invests in the stock market, so it’s probably not the most relevant metric.", "Payne said, \"When President Obama was elected, the market crashed … Trump was up 9%, President Obama was down 14.8% and President Bush was down almost 4%. There is an instant reaction on Wall Street.\"", "The Dow fell 14.8% between Obama’s 2008 election and inauguration, so Payne was right about the extent of the drop. The other numbers check out as well.", "More importantly, experts said the decline was not a crash in and of itself, but instead part of a longer trend resulting from the 2008 financial crisis and issues that had been bubbling for months. The reaction was hardly dramatic or \"instant.\"", "We rate this statement Mostly False.", "Fox News, \"Your World With Neil Cavuto,\" June 17, 2019", "President Donald Trump on Twitter, June 15, 2019", "Yahoo Finance, Historical Dow Jones Stock Closings, accessed June 19, 2019", "PolitiFact, \"How Donald Trump, Barack Obama compare on the stock market,\" Jan. 8, 2018", "PolitiFact, \"What caused crisis? No one thing,\" Nov. 30, 2008", "Phone interview with Kathleen Day, professor at the Johns Hopkins Carey Business School and an expert in financial crises, June 19, 2019", "Email interview with Dean Baker, senior economist and co-founder of the left-leaning Center for Economic and Policy Research, June 19, 2019", "Email interview with Tara Sinclair, professor of economics and international affairs at George Washington University, June 20, 2019", "Email interview with Gary Burtless, senior fellow in economic studies at the Brookings Institution, June 20, 2019", "Statement from Charles Payne, host of \"Making Money with Charles Payne\" on Fox Business Network, June 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]