["A new party in the White House means it’s time for an American tradition: the blame game. Anything wrong in the world is now the fault of the 2-month-old administration. Or the fault of the prior administration, depending on your political persuasion.", "With gas prices on the move, this exercise is in full effect on social media. That includes a widely shared March 10 Facebook post.", "“When Sleepy Joe Came In Diesel Was $1.69,” it reads. “Today Diesel Is $3.19. Thanks To All That Voted For This Clown.”", "This poster gets it wrong on both the specifics and the blame. Here’s why.", "More:Fact check: Photo of high gas prices in Beverly Hills lacks context", "Diesel prices are indeed up. The March 15 national average of $3.07 was the highest since June 2019.", "But the numbers in the post are way off the mark.", "The national average price for diesel was $2.64 a gallon on Jan. 20 when President Joe Biden, a Democrat, took the oath of office, according to GasBuddy.com price trackers. That’s almost a dollar higher than the post claims. Meanwhile, the March 10 national average was $3.04, less than the post claimed.", "So there was an increase, but a far smaller one.", "Weekly price data from the U.S. Energy Information Administration shows similar movement, from $2.70 to $3.14, based on the weeks closest to those points in time.", "The poster did not respond to a message from USA TODAY seeking evidence of his claim. He lives in Iowa, according to his profile, but using local numbers doesn’t help his case much. GasBuddy shows prices in Des Moines rose over that span from $2.45 to $3 per gallon, a slightly larger jump, but still far from the post’s claim.", "The post – like many others pointing a finger at Biden over prices at the pump – is also wrong on the fundamental blame element. The price movement we’re seeing now on both diesel and gas isn’t related to Biden’s policy changes, experts say.", "For starters, the trend predates Biden. Diesel prices have steadily risen since the start of November, when Republican President Donald Trump was in office.", "And Biden’s policies aren’t having any immediate impact. Biden shut down the planned Keystone XL pipeline expansion, which was to run from Canada to Nebraska. Experts consulted by PolitiFact said that decision could make oil transportation less efficient long-term, but even then they doubted it would directly affect costs in the U.S. Reuters reports existing pipelines and ongoing expansions are expected to be sufficient for the flow between the U.S. and Canada, which provides about half of America’s imported oil.", "The president also imposed a 60-day ban on new fracking permits, but that doesn’t affect existing operations. Oil producers weren’t likely to be pursuing new locations now anyhow, since they’re scrambling to bring back online production that was scaled back in 2020, experts say.", "More:Fact check: Some states with GOP governors did have mask mandates", "In reality, diesel and gas prices – like many things in 2021 – are all about the pandemic.", "The reduction of economic activity, and people traveling and moving around less, reduced demand for diesel and gas both in 2020, causing a related drop in oil production amid steep financial losses in the oil industry. The Energy Information Administration, an independent government agency that provides analysis for policymakers and the public, said demand for diesel fell 8% in 2020, while demand for gas dropped by 13%.", "Demand is now rising quickly as the COVID-19 picture improves and the economy rebounds, but it takes time to get the supply back to normal. The Energy Information Administration says crude oil production in the U.S. was down in 2020 and will drop again in 2021 “as a result of a decline in drilling activity related to low oil prices.” It projects an increase in 2022.", "More:Fact check: Viral image of rare blue turtle actually shows an artist-made glass pendant", "“We’re headed for higher (price) territory until the market sees more crude oil, whether that’s supplied from the U.S. or Canadian interests or OPEC,” said Patrick De Haan, head of petroleum analysis for GasBuddy.com. “We are in a pretty significant imbalance. Demand has screamed higher, and production has been moving at a turtle’s pace, and part of that is because the depths of the crisis were so severe for oil companies.”", "Energy and security analyst Patricia Schouker described the same dynamic to AFP, a France-based global news agency, saying recovering demand and limited production has “pushed crude prices to their highest levels since near the start of the coronavirus pandemic.”", "Outside of market-altering events like the pandemic, prices of both fuels are driven primarily by the cost of crude oil, which is in turn driven by an array of world economic conditions that influence supply and demand.", "As Schouker noted, presidents have “‘very little direct influence” over gas and diesel prices.", "De Haan said the irony of blaming Biden is that the increasing demand is related to the growing economy. So the people prone to wrongly blame Biden for gas prices would also be slow to credit him for the economy, even though those are two sides of the same coin.", "We rate this claim FALSE because it is not supported by our research. The numbers aren’t close to right – the actual increase was more like 40 cents, not $1.50. And the blame element is equally off base. Diesel (and gas) prices are rising due to swelling demand as movement and economic activity increase amid the coronavirus recovery. Expert say it could take until 2022 for oil production to return to pre-pandemic levels, causing a shortage in the meantime that will drive prices up.", "Contact Eric Litke at (414) 225-5061 or elitke@jrn.com. Follow him on Twitter at @ericlitke."]