["In the 2006 video clip, Biden boasted about voting for a 700-mile fence, a vote he said he made mainly to fight drug trafficking, not illegal immigration.", "But the 2006 Secure Fence Act was squarely aimed at stemming illegal immigration along the southern border.", "Biden in 2006 supported a variety of measures to fight illegal immigration much as he does today, including addressing root causes that lead people to flee their homes to the United States.", "Not 30 minutes after President Joe Biden took office, a Facebook post surfaced showing video of him speaking in 2006 about his vote in support of fencing at the southern U.S. border.", "\"Flashback: Joe Biden Boasts About Voting For '700 Miles Of Fence.’ This grainy footage from 2006 shows then-Sen. Joe Biden talking about immigration in some entirely different ways than he does today,\" reads the title and caption to the video, which has been shared more than a thousand times.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post appeared on American Voices Facebook page, which has nearly 3 million followers. The account says that it is affiliated with the Daily Caller, a conservative-leaning news website. Daily Caller’s watermark shows in the upper-right corner of the video.", "For this fact-check, PolitiFact reviewed the video as well as Biden’s past positions and statements on border security and his modern-day policy stances on immigration and border control. We found that he did support 2006 legislation funding a 700-mile fence at the southern U.S. border, but his statements at the time do not signify a significant departure from his current support for border security and other measures to control immigration into the U.S.", "Let’s look.", "The three-minute video posted on Facebook starts with about a one-minute clip of fuzzy footage in which then-Sen. Biden is seen speaking to a group of people seated at tables.", "This clip comes from a Nov. 27, 2006, talk Biden gave to the Columbia (S.C.) Rotary Club. It was recorded by Brad Warthen, who was then editorial page editor for The State newspaper in Columbia.", "In it, Biden says:", "\"I voted for 700 miles of fence. But let me tell you, we can build a fence 40 stories high. Unless we change the dynamic in Mexico and — and you will not like this — and punish employers who knowingly violate the law when they hire illegals, unless you do those two things, all the rest is window dressing...", "\"And the reason why I,parenthetically, why I believe the fence is needed does not have anything to do with immigration, as much as drugs. I’m the guy that wrote the national crime bill. I’m the guy that wrote the national drug trafficking. I’m the guy that wrote the law that set up a drug czar. And let me tell you something folks, people are driving across that border with tons, tons — hear me — tons of everything from byproducts for methamphetamine to cocaine to heroin.\"", "The video then splices together more recent footage from Biden’s statements on immigration and border protection during the 2020 campaign, including a pledge to create a pathway to citizenship for people living in the United States without a legal status.", "The vote Biden references was for the Secure Fence Act of 2006, which was squarely aimed at reducing illegal immigration along the southern border. It was passed by a Republican-led Congress and signed by Republican President George W. Bush. The bill passed the Senate, 80-19, with Biden and then-Sens. Barack Obama and Hillary Clinton among 26 Democrats voting for it. The law authorized about 700 miles of fencing along certain stretches of land between the border of the United States and Mexico.", "The act also authorized the use of more vehicle barriers, checkpoints and lighting to curb illegal immigration, and the use of advanced technology such as satellites and unmanned aerial vehicles. Bush described it as part of his efforts toward comprehensive immigration reform.", "The Boston Globe in 2017 noted that Democrats who were normally in favor of looser immigration laws viewed the Secure Fence Act of 2006 as the lesser of two evils. Around that same time, the House passed legislation that would make any immigrant illegally in the country a felon.", "Biden said in the clip that his vote was mainly targeted at drug trafficking. But he also indicated that he doesn’t believe border security depends on the wall. He said he supported a variety of measures much as he does today, such as addressing root causes for why people seek to leave their homes for the United States.", "Biden campaigned for the presidency saying he would not take down border barriers or add more. He wants to use technology to maintain border security and to invest $4 billion to tackle the factors motivating Central Americans to migrate to the United States.", "A Facebook post says that a video shows Biden boasted in 2006 \"about voting for ‘700 miles of fence’\" and \"talking about immigration in some entirely different ways than he does today.\"", "In the 2006 video clip, Biden did talk about voting for a 700-mile fence. He said he made the vote mainly to fight drug trafficking, not illegal immigration, but the 2006 Secure Fence Act was squarely aimed at stemming illegal immigration along the southern border.", "Biden in 2006 supported a variety of measures to fight illegal immigration much as he does today, including addressing root causes that lead people to flee their homes south of the U.S.-Mexico border for the United States. In that respect, Biden’s position is not so different.", "The post is partially accurate but leaves out important details — our definition of Half True.", "Facebook post, Jan. 20, 2021", "Daily Caller, \"FLASHBACK: Joe Biden Suggested Building A 40-Story Fence To Stop Flow Of Drugs From ‘Corrupt Mexico,’\" May 12, 2019", "CNN, \"Joe Biden once said a fence was needed to stop ‘tons’ of drugs from Mexico,\" May 10, 2019", "PolitiFact, \"Fact-check: Did top Democrats vote for a border wall in 2006?\", April 23, 2017", "PolitiFact, \"Donald Trump weaves Joe Biden into his false claims about the border wall,\" Aug. 28, 2020", "PolitiFact, \"Joe Biden tackles immigration, hoping to undo Trump-era policies,\" Jan. 21, 2021", "PolitiFact, \"Fact-check: Did top Democrats vote for a border wall in 2006?\", April 23, 2017", "Associated Press, \"Biden: Blame immigration woes on Mexico,\" Nov. 28, 2006", "YouTube, clip of Joe Biden remarks, Nov. 27, 2006", "BradWarthen.com, \"Joe Biden at Rotary,\" Nov. 27, 2006", "Columbia Star, \"Presidential hopeful speaks to Columbia Rotary Club,\" Dec. 01, 2006", "Congress.gov, \"H.R.6061 -- Secure Fence Act of 2006,\" accessed Jan. 21, 2021", "The White House, \"Fact Sheet: The Secure Fence Act of 2006,\" Oct. 26, 2006", "Joe Biden campaign, \"The Biden plan for securing our values as a nation of immigrants,\" accessed Jan. 22, 2021", "Vanity Fair, \"Here’s a video of Joe Biden sounding a lot like Trump,\" May 10, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]