["On November 6, former Conservative Party Candidate Cyara Bird wrote on Twitter that her 17-year-old cousin had been expelled from school that day.", "“Want to know why? Her choir teacher was demanding that the choir wear rainbow poppies during their performance in the Remembrance Day ceremony. She and another student rejected that idea, and both were suspended for ‘hate speech.’”", "In less than 24 hours, the tweet was shared 5,400 times and liked 8,500 times, for a total nearing the equivalent of a third of all electors in Bird’s riding, Churchill-Keewatinook Aski, which covers half of Manitoba. The tweet inspired dozens of Facebook posts and articles in Canada and abroad in its wake, notably one from the Post Millennial, shared more than 10,000 times.", "Although AFP was not able to confirm kinship between Bird and the person mentioned in her tweet, a 17-year-old teenager was suspended from her high school for an incident related to rainbow poppies.", "The girl’s alleged father, who did not respond to AFP’s interview requests by the time of publication, explained in a Facebook post that his daughter and her friend had been suspended from their school in Stonewall, a small town north of Winnipeg, for posting flyers around school criticizing rainbow poppies. Using her father’s Facebook account, the teenager gave her version of the facts in a comment on the publication.", "The teenager’s post expressed, in adversarial terms, the opinion that a rainbow poppy worn to commemorate LGBT soldiers who died during World War I, is disrespectful to veterans, and explained the circumstances of her suspension.", "The rainbow poppy was introduced in the UK in 2016, following the introduction of a black poppy for black, African and Carribean soldiers’ contributions, and white poppies commemorating civilians and soldiers killed in wars, including those killed or imprisoned for refusing to fight. Critics of the rainbow poppy say that the red poppy is meant to represent all fallen soldiers, and that no particular subgroup requires specific commemoration.", "Unlike the tweets and articles which subsequently caught the public’s attention, neither the father nor the daughter’s versions claim that the suspension was due to refusal to comply with some sort of enforced rainbow poppy rule.", "On November 7, the Interlake School Division released a statement according to which, “at no point did any staff member of Stonewall Collegiate or Interlake School Division direct, nor mandate, any student to wear a ‘rainbow poppy.” The statement did not mention the suspended teenagers.", "Global News reporter in Winnipeg Elisha Dacey also tweeted about the story, pointing out that the suspension was due to the flyers, which Bird then recognized in another tweet, while maintaining the validity of her original claim.", "Alan Campbell, chair of the Interlake School Division, was present at the Remembrance Day ceremony featuring the choir that Bird mentioned in her tweet. Though he would not comment on the suspension either, he told AFP that from what he could tell, “Every single student in the gym had a red poppy on, the one that was issued by the Royal Canadian Legion.”", "Lana Meier, publisher of the Stonewall Teulon Tribune, a local newspaper, also attended the ceremony, and did not notice any rainbow poppies either. “There was not one in the building. If there were they were in their pockets,” she told AFP.", "Meier confirmed to AFP that the two teenagers were suspended for posting the flyers around their school.", "Meier also provided AFP with a photo of the choir that the two suspended teenagers were a part of, which shows no students wearing rainbow poppies.", "Bird’s tweet was incorrect in linking her alleged cousin’s suspension to her refusal to wear the rainbow poppy, though hate speech was the given reason for the suspension, after the two students posted flyers protesting the rainbow poppies.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]