["Donald Trump's presidency is coming to an end, but some on social media say he still has honors to receive.", "A Dec. 13 post on Facebook shares what appears to be a Time magazine cover depicting a solemn Trump, sitting turned in a brown leather chair. The magazine's cover declares Trump as Time's \"Person of the Year.\"", "\"Who agrees?\" reads the caption of the Facebook post, which has been shared over 1,700 times.", "Commenters were quick to chime in with agreement. One wrote that the president was \"100% chosen by God himself,\" and another wrote that he \"can truly be person of the decade, at least.\"", "The original poster did not respond to USA TODAY's request for comment.", "More:President-elect Biden and Vice President-elect Harris named Time's 2020 Person of the Year", "Both President-elect Joe Biden and Vice President-elect Kamala Harris were chosen as Time's 2020 Person of the Year", "“The selection of Person of the Year is rarely easy, and this year was far more difficult than most… In Joe Biden and Kamala Harris, we have two individuals whose election mirrored and moved the major stories of this year and whose fates will shape the nation’s role in the world and the future of the American experiment,\" Edward Felsenthal, Time magazine editor-in-chief and CEO, said in a statement.", "The duo's win follows suit with Time's tradition of naming incoming presidents as its Person of the Year during an election year. However, Harris is the first vice president-elect to be given the title.", "\"It is one of my responsibilities,\" Harris told the magazine of her place in history. \"My mother had many sayings. She would say, 'Kamala, you may be the first to do many things; make sure you’re not the last.' Which is why (in my victory speech), I said, 'I will be the first, but I will not be the last.' And that’s about legacy. That’s about leaving the door more open than it was when you walked in.\"", "Fact check:Joe Biden, Kamala Harris – not China's Xi Jinping – are Time's 2020 Person of the Year", "But the image in the Facebook post of Trump isn't doctored; it's his 2016 cover for Person of the Year.", "Trump called the win a \"great honor\" in 2016. In bestowing that honor, Time magazine said Trump's victory shook up the U.S. political scene, for better or worse.", "\"For those who believe this is all for the better, Trump’s victory represents a long-overdue rebuke to an entrenched and arrogant governing class; for those who see it as for the worse, the destruction extends to cherished norms of civility and discourse, a politics poisoned by vile streams of racism, sexism, nativism,\" the magazine said.", "Time added: \"To his believers, he delivers change — broad, deep, historic change, not modest measures doled out in Dixie cups; to his detractors, he inspires fear both for what he may do and what may be done in his name.\"", "Time has named a Person of the Year since 1927, and more often than not, elected and reelected presidents are given the title during an election year.", "Barack Obama won the title in both 2008 and 2012, and George W. Bush won in 2004 and 2000. Bill Clinton was awarded the title in 1992 and in 1998, though he shared the latter title with Ken Starr, who headed the investigation into Clinton's real estate investments. The first president to win the award was Franklin D. Roosevelt in 1932.", "Fact check:Altered image makes false claim about Time magazine's Person of the Year", "A social media post that presents an image of President Donald Trump as Time magazine's \"Person of the Year\" is MISSING CONTEXT because it may be misleading without additional information. The image in the post is a real magazine cover, from 2016, and is not doctored. But Joe Biden and Kamala Harris are Time's 2020 Person of the Year.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]