["The image was published in this Facebook post on July 2, and it has been shared more than 1,000 times after being posted by a page with more than 356,000 followers.", "Below is a screenshot of the misleading post:", "The post’s caption states: “Cassini's last image before entering Saturn's atmosphere. Credit: NASA/ESA”.", "Cassini was a NASA spacecraft deployed in a joint mission with the European Space Agency (ESA) and the Italian Space Agency.", "NASA announced the conclusion of Cassini’s mission in this press release published on September 15, 2017, which states, in part: “A thrilling epoch in the exploration of our solar system came to a close today, as NASA's Cassini spacecraft made a fateful plunge into the atmosphere of Saturn, ending its 13-year tour of the ringed planet.”", "The same image has also been shared hundreds of times here and here on Twitter alongside a similar claim.", "It was also published here on Polish social networking site Wykop and here on a Japanese blog alongside a similar claim.", "The image has also been shared on various websites, including here and here alongside a similar claim.", "The claim is misleading; the image is actually an artist’s illustration of the view from the Cassini spacecraft.", "Reverse image searches on Google found the same image published here on NASA’s website on April 6, 2017, more than five months before the spacecraft entered the atmosphere of Saturn.", "The image caption states: “This artist’s concept shows an over-the-shoulder view of Cassini making one of its Grand Finale dives over Saturn.”", "Below is a screenshot of the image on NASA’s website:", "NASA published more information about Cassini’s last mission, dubbed the Grand Finale, on its website here on September 26, 2018.", "NASA also published Cassini’s final images here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]