["A Border Patrol agent at the fence along the border between the United States and Mexico on the outskirts of Nogales, Ariz., on Sept. 22, 2016. (Tomas Munita/New York Times)", "A conservative news outlet criticized a federal program created to bring United States children fleeing violence in Central America into the United States, saying it largely benefits adults.", "\"Recent government data shows that more than two-thirds of the aliens the Obama administration has brought to the United States under the president's Central American Minors program weren’t actually minors at all,\" said the Dec. 1 post published by MRCTV.", "Only 30 percent of individuals who have come to the United States under the program are under 18 years old, the article said.", "\"Conversely, a full 70 percent of those aliens who’ve been allowed into the United States under the president’s program for ‘minors’ are adults,\" said MRCTV.", "A PolitiFact reader asked us to look into it. We found that while MRCTV’s data for arrivals under 18 is largely accurate, its interpretation of who should count as a minor differs from the government definition.", "The public relations firm representing MRCTV, which says its goal is to \"break down the boundaries between traditional conservative media and mainstream culture,\" did not respond to requests for information.", "Violence and poverty", "Gang violence and poverty in Central American nations has propelled thousands of children to leave their homes unaccompanied and cross illegally into the United States.", "The number of Central American children coming alone started to increase in fiscal year 2012, largely due to an influx from Guatemala, El Salvador and Honduras. It rose significantly in fiscal year 2014, according to data from U.S. Customs and Border Protection.", "The number of unaccompanied children (0 to 17 years old) from El Salvador, Guatemala and Honduras apprehended at the southwest border reached a high in fiscal year 2014 at 51,705, up from 10,146 in fiscal year 2012, per border patrol data.", "Apprehensions of unaccompanied children from those three Central American countries dropped in fiscal year 2015 but picked up again in fiscal year 2016.", "The White House in June 2014 announced a series of new programs and partnerships with Central American countries to address economic and criminal problems that motivated youth to migrate to the United States.", "Central American Minors program", "President Barack Obama’s administration in November 2014 also announced a refugee/parole program \"to provide a safe, legal, and orderly alternative to the dangerous journey that some children are currently undertaking to the United States.\"", "The Central American Minors program allows certain parents with lawful presence in the United States to petition for their children in Guatemala, El Salvador and Honduras to come in as refugees. Children ineligible for admission as refugees but at risk of harm may be admitted under parole.", "A \"qualifying child\" must be unmarried, under 21 and living in Guatemala, El Salvador or Honduras, according to U.S. Citizenship and Immigration Services.", "The immigration agency says that in certain cases, a parent who lives with a qualifying child may also apply for the program if he or she is the legal spouse of the person in the United States requesting the child’s resettlement.", "The program was expanded in 2016 to allow additional family members to apply. A State Department spokesperson said given the time it takes to vet applicants, no one who would be eligible under the expansion has been admitted yet.", "More than 10,500 people have applied for the Central American Minors program and 1,644 have been admitted as of Dec. 1, according to the State Department.", "Here’s a breakdown of the 1,644 arrivals:", "\"Minors\" admissions comprise 83 percent:", "- 484 (29 percent) under 18 years old", "- 1,106 (67 percent) under 21 years old", "- 1,370 (83 percent) under 22 years old", "\"The reason that some arrivals are 21 (not under 21, as the program specifies) is that a qualifying child must be ‘under 21’ at the time the application is received, but can arrive as a 21-year-old, since the adjudication process takes approximately one year on average,\" a State Department spokesperson said.", "The remaining 17 percent of arrivals are the legal/biological parents of the qualifying child, according to the State Department.", "MRCTV’s post that more than two-thirds of arrivals under the programs aren’t minors is technically accurate when accounting for minors as applicants under 18.", "Generally in the United States, 18 is considered the \"age of majority\" and the age when individuals are no longer considered minors. (Eighteen is the minimum age to vote, but Americans must be 21 to legally buy alcohol.)", "But immigration law has a different rule: \"A ‘child’ is defined as an individual who is unmarried and under the age of 21,\" according to USCIS.", "The reason? People who may have been targeted for persecution when they were under 18 could still be at risk when they cross that threshold, said Peter Margulies, who teaches immigration law and national security law at Roger Williams University School of Law.", "\"Gangs still want more members,\" Margulies said. \"If gangs don't care if their target is 17 or 20, the United States should extend protection in both cases. Otherwise, the individual remains in danger of persecution.\"", "\"Gangs do not stop their abuse on a victim’s 18th birthday,\" added Michael Kagan, a law professor and director of the immigration clinic at University of Nevada, Las Vegas.", "Our ruling", "An article by MRCTV said, \"More than two-thirds of the aliens the Obama administration has brought to the United States under the president's Central American Minors program weren’t actually minors at all.\"", "Per State Department data, 83 percent (1,370) of 1,644 individuals who have come to the United States through the program have been under 22 years old and qualifying minors, including 484 people (29 percent) under 18 years old.", "Though 18 is generally considered the age of adulthood, for immigration purposes, an unmarried person under 21 is considered a \"child,\" meeting the qualifying age for the minors program. Some individuals who were 21 were admitted because they were under the age at the time of their application.", "MRCTV’s statement is accurate but needs additional clarification. We rate it Mostly True.", "MRCTV, 2/3 Of Aliens Admitted Under Obama's 'Minor' Program Are Adults, Dec. 1, 2016", "Unicef, Risking it all to escape gang violence and poverty, Aug. 23, 2016", "Pew Research Center, DHS: Violence, poverty, is driving children to flee Central America to U.S., July 1, 2014", "U.S. Customs and Border Protection, Southwest Border Unaccompanied Alien Children FY 2014, last published Nov. 24, 2015", "U.S. Customs and Border Protection,United States Border Patrol Southwest Family Unit Subject and Unaccompanied Alien Children Apprehensions Fiscal Year 2016, last published Oct. 18, 2016", "U.S. Citizenship and Immigration Services, Child Status Protection Act (CSPA), last updated Aug. 3, 2016", "U.S. Citizenship and Immigration Services, In-Country Refugee/Parole Processing for Minors in Honduras, El Salvador and Guatemala (Central American Minors – CAM)", "State Department, Central American Minors (CAM) Program", "Expansion of the Central American Minors (CAM) Program, Nov. 15, 2016", "State Department, U.S. Expands Initiatives to Address Migration Challenges, July 26, 2016", "State Department, In-Country Refugee/Parole Program for Minors in El Salvador, Guatemala, and Honduras With Parents Lawfully Present in the United States, Nov. 14, 2014", "The New York Times, Q. and A. Children at the Border, updated Oct. 21, 2014", "The White House, FACT SHEET: Unaccompanied Children from Central America, June 20, 2014", "Lutheran Immigration and Refugee Service, Frequently Asked Questions Central American Minors (CAM) Program: In-Country Refugee/Parole Processing for Minors in El Salvador, Guatemala and Honduras", "Los Angeles Times, Frustrated by new U.S. program to take in migrants, Central American parents turn to smugglers, April 21, 2016", "The New York Times, Wave of Minors on Their Own Rush to Cross Southwest Border, June 4, 2014", "National Conference of State Legislatures, Age of Majority, last updated March 2015", "Email interview, State Department spokesperson, Dec. 6, 2016", "Email interview, USCIS spokesperson, Dec. 6, 2016", "Email interview, Peter Margulies, who teaches immigration law and national security law at Roger Williams University School of Law, Dec. 6, 2016", "Email interview, Michael Kagan, a law professor and director of the immigration clinic at University of Nevada, Las Vegas, Dec. 6, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]