["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "White words on a black background make facts disappear", "A viral image is making new rounds on the Internet, asking, \"Ever wonder why Republicans want Voter ID?\"", "Similar claims popped up after the 2012 election between President Barack Obama and the former governor of Massachusetts, Republican Mitt Romney.", "Our national and Florida fact-checkers have debunked several examples within this viral image already (check here and here).", "We wondered if claims about Ohio counties were any more accurate.", "In northwest Ohio, Wood County is home to Bowling Green, the city and university of the same name.", "The first statement reads, \"In 21 districts in Wood County, Ohio, Obama received 100 percent of the votes where GOP inspectors were illegally removed from their polling locations — and not one single vote was recorded for Romney. (A statistical impossibility.)\"", "The second statement says that \"106,258 people in Wood County are registered to vote out of an eligible 98,213.\"", "The third says, \"In one Ohio county, Obama won by 108 percent of the total number of eligible voters.\"", "Is something rotten in Wood? These claims unravel quickly with a check of 2012 poll results.", "100 percent of the vote?", "We’ll start with the claim about Obama getting 100 percent of the votes in 21 Wood County \"districts.\" First off, in Ohio they’re called precincts, not districts.", "A precinct-by-precinct check shows that neither presidential candidate received 100 percent of the votes in any of the county’s 97 precincts. (Therefore, Romney also earned votes, contrary to the claim.)", "Other fact-checkers also cast doubt on these allegations. As fellow fact-checkers at Snopes rightly noted, \"The highest percentage (Obama) achieved in any one precinct was 75.5 percent.\"", "FactCheck.org asked Terry Burton, director of the elections board in Wood County, about GOP inspectors being removed. \"No precinct officials were removed during Election Day and no issues were identified during a recount,\" he answered.", "Ghost registrations", "Now for the post’s second statement about over-registrations. The 98,213 number comes from the 2010 census total of people 18 and over in Wood County.", "According to the election board’s data from 2012, there were 108,014 registered voters in the county at that time — an even bigger gap between people and voters than what the meme claimed.", "But that doesn’t mean there is foul play.", "PolitiFact Ohio found that the discrepancy is owed to the large population of college kids at Bowling Green. Students register to vote there and later graduate and move away, abandoning their voter registrations along with their raggedy couches.", "Elections officials are allowed to purge the rolls of inactive voters after they miss three successive federal elections — a practice that Ohio’s Secretary of State Jon Husted has defended as Election Day 2016 approaches.", "108 percent", "Now let’s consider the post’s vague reference to \"one Ohio county\" where Obama allegedly got 108 percent of the vote. The numbers for Wood County, where the meme suggests that fraud is so rampant, lead us to believe that this is still about Wood. The number of registered voters, 106,258, is about 108 percent of 98,213, the size of the vote-eligible population in 2012.", "But election results show that in real life, Obama received 51 percent of the vote in Wood County.", "We asked Carol DeJong, deputy director of the Wood County Board of Elections, why conspiracy theorists are obsessed with her county. \"As a reporter, you would be better at solving that mystery,\" she replied via email.", "Our ruling", "A viral post makes several claims about 2012 voter fraud in Ohio, ginning up fears ahead of the 2016 presidential election.", "But the election tallies discredit the claims about voter fraud in Ohio.", "Election board officials cannot corroborate the claim of GOP monitors being \"illegally removed\" from polling places. The numbers 106,258 (registered voters) and 98,213 (residents old enough to vote) include the ghost registrations of inactive voters that lingered on the rolls. Finally, Obama got 51 percent of the vote in Wood County, not 108 percent.", "This viral image is 108 percent wrong.", "We rate it Pants on Fire!", "https://www.sharethefacts.co/share/86f594ee-8169-4425-9303-725a584210df", "Email interview, Carol DeJong, Wood County Board of Elections, Aug. 9, 2016", "Reuters, \"Use it or lose it: Occasional Ohio voters may be shut out in November,\" Jun. 2, 2016", "Ballotpedia, \"Voter identification laws state-by-state,\" August 2016", "US News & World Report, \"No, Obama didn’t win 108 percent of the vote in an Ohio county,\" Nov. 20, 2012", "PolitiFact, \"Online petition claims Obama got more votes in one Ohio county than registered voters,\" Nov. 19, 2012", "Snopes, \"2012 voter fraud,\" Aug. 2, 2016 (updated)", "FactCheck, \"Voting conspiracies,\" Jan. 17, 2013", "Right Wing News, \"The truth behind voter ID revealed in one brilliant meme,\" August 2016", "Wood County Board of Elections website, accessed Aug. 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]