["On social media, footage of a murder recorded in CCTV is being shared with the claim that members of the Rashtriya Swayamsevak Sangh attacked a Muslim man. One Sheraz, who in his bio claims to be from Pakistan, tweeted the video with the message, “It is the RSS terrorist of the Hindu terrorist organization in India who openly treats Muslims as animals. #BJPMilitantWingRSS”", "It is the RSS terrorist of the Hindu terrorist organization in India who openly treats Muslims as animals.#BJPMilitantWingRSS", "pic.twitter.com/KShvT1WdC6", "— ShErAz🇵🇰 (@SherazAS1) October 1, 2019", "Back in August 2018, a tweet by one Arbeela Khan with the same video and a similar narrative had amassed over 800 retweets.", "With a keyword search on Google, Alt News found an article published by The Hindu on July 22, 2017. Rafiquddin Shaikh was hacked to death allegedly by members of a rival gang at a tea stall on July 18, 2017. Dhule police had arrested one Sagar Sahebrao Pawar alias Kalti from Kamshet in Pune.", "“Rafiuddin Shaikh, alias Guddya (33), a history-sheeter with 30-odd offences including murders, attempt to murders, extortion and rape registered against him, was sipping tea at a local stall after a morning walk, when ten members of a rival gang attacked him”, stated a report published by Daily Pioneer on July 21, 2017.", "The investigators had identified seven out of the ten gangsters involved in the crime. Namely, Vilas Goyar, his sons (Vicky Goyar, Shyam Goyar, Vijay Goyar) and other accomplices Rajendra Devare, Bhima Devare and Dadu Devare. “The Goyar family, which is suspected to be behind the gory murder of Shaikh, has criminal antecedents,” said the report.", "In August 2017, Dainik Bhaskar reported the arrest of one of the main accused, Vicky Goyar. According to the report, police had arrested 15 people in the matter. A video report by Marathi channel Zee 24 TAAS shows the same visuals as the viral clip.", "In conclusion, a video of a murder recorded on CCTV camera in Maharastra was shared with the false claim that members of RSS killed a Muslim man in public. The man was killed by a rival gang member after he was released from jail in 2017. The incident was given a communal narrative on Pakistani social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]