["President Donald Trump opened his campaign rally in Phoenix noting a matter of importance to him: crowd sizes.", "\"What a crowd,\" Trump said Aug. 22 about his supporters inside the Phoenix Convention Center, the site of one of his first major campaign rallies two years earlier.", "He immediately drew attention to another group of people: \"And just so you know from the Secret Service, there aren't too many people outside protesting, OK. That I can tell you.\"", "Trump downplayed the number of protesters at other points in his 75-minute speech.", "But the president’s narrative was at odds with what TV news viewers had seen for hours leading up to Trump taking the stage. The coverage on national networks showed sizeable crowds out on the streets carrying signs criticizing the president and his response to the Charlottesville, Va., riots ignited by supporters of white supremacist and anti-Semitic groups.", "The Phoenix Police Chief also said there were \"tens of thousands\" of people out on the streets.", "Here are the facts.", "As Trump delivered his speech, he sought to spotlight the people inside the convention center, asking cameras to put them on TV \"because it is rather incredible.\" (CNN obliged.)", "Trump was also interrupted by a protester inside the convention center as he defended his series of responses to the violence in Charlottesville.", "\"Don't bother, it's only a single voice. And not a very powerful voice,\" Trump said. \"How did he get in here? He's supposed to be with the few people outside.\"", "(People protest outside the Phoenix Convention Center on Aug. 22, 2017, in Phoenix. Protests were held against President Donald Trump as he hosted a rally inside the convention center. / AP)", "Trump suggested Phoenix’ hot weather kept protesters away.", "\"How about all week they're talking about the massive crowds that are going to be outside. Where are they? Well, it's hot out. It is hot. I think it's too warm,\" Trump said. \"You know, they show up in the helmets and the black masks, and they've got clubs and they've got everything.\"", "\"Antifa!\" he shouted, the shorthand term for anti-fascists, which broadly describes far-left-leaning militant groups challenging neo-Nazis and white supremacists.", "The next day, Trump continued boasting about the amount of people who showed up to support him.", "\"Phoenix crowd last night was amazing - a packed house. I love the Great State of Arizona. Not a fan of Jeff Flake, weak on crime & border!\" another tweet said.", "Phoenix crowd last night was amazing - a packed house. I love the Great State of Arizona. Not a fan of Jeff Flake, weak on crime & border!", "We did not get a response from the White House when we requested more information on Trump’s claim of few protesters. We asked the U.S. Secret Service — which Trump cited as his source of information — about their estimates of crowd sizes outside the convention center, but did not get a figure.", "\"For operational security purposes we do not publicly discuss the methods and means on how we conduct our protective operations,\" said Mason F. Brayman, Assistant Special Agent in Charge for the Secret Service.", "Leading up to the rally, Phoenix police chief Jeri Williams said the department would have \"maximum staffing\" and emphasized its experience handling other major events, such as Super Bowls.", "In a press briefing after the events, Williams said there had been \"tens of thousands\" of people downtown. (Trump said he brought 15,000 people into the convention center. The Phoenix Fire Marshal approved capacity up to 19,000 people.)", "\"We had tens of thousands of people downtown peacefully exercising their First Amendment rights,\" Williams said. \"What’s unfortunate is that a very small number of individuals chose criminal conduct.\"", "(Protesters outside the Phoenix Convention Center hold up anti-President Donald Trump signs and shout back at Trump supporters waiting to enter a rally by Trump on Aug. 22, 2017, in Phoenix, Ariz. / Getty)", "Azcentral.com reported that demonstrators outside the convention center \"largely refrained from violence\" throughout the day. That changed after Trump’s speech ended and a few people threw rocks and bottles at police. Police used pepper spray and pepper balls to disperse protesters.", "Local media also said there were thousands of anti-Trump protesters out on the streets. Some photos show protesters held back by barricades outside the convention center where Trump was speaking.", "Several videos and photo galleries from local media depict the crowds of protesters, which included people advocating for immigrant rights and against hate groups.", "Fox News — which Trump singled out as a channel that treats him fairly — also reported that \"thousands of protesters gathered outside\" the convention center ahead of Trump’s speech. CNN also said thousands of protesters were in attendance.", "Views from the roof of the parking lot across from Phoenix convention center. People packed on every floor. #trumprally protest pic.twitter.com/pHMc1rbAik", "Trump at a rally in Phoenix said, \"There aren't too many people outside protesting.\"", "Thousands of people were out on the streets of Phoenix protesting Trump’s speech, according to multiple media accounts and the Phoenix police chief, who said the city’s downtown had \"tens of thousands\" of people exercising their right to free speech.", "Trump significantly underestimated crowds in Phoenix. We rate his statement False.", "CQ, Transcript: President DOnald Trump campaign event in Phoenix, Aug. 22, 2017", "Email exchange, Phoenix Police Department media relations, Aug. 22, 2017", "Email exchange, Department of Homeland Security, U.S. Secret Service, Aug. 23, 2017", "CNN, Police spray tear gas at protesters following Trump's Phoenix rally, updated Aug. 23, 2017", "Fox News, Thousands of protesters flock to Trump speech in Phoenix, Aug. 22, 2017", "PolitiFact, Donald Trump had biggest inaugural crowd ever? Metrics don't show it, Jan. 21, 2017", "PolitiFact, Fact-checking President Donald Trump’s campaign rally in Phoenix, Aug. 22, 2017", "PolitiFact, In Context: President Donald Trump’s statement on ‘many sides’ in Charlottesville, Va., Aug. 14, 2017", "PunditFact, Rachel Maddow says Donald Trump exaggerated his crowd in Phoenix, July 15, 2015", "Twitter, @realdonaldtrump, tweet, tweet, Aug. 23, 2017", "Twitter, @saba_h tweet, Aug. 22, 2017", "Facebook post, Phoenix Police Department, Aug. 23, 2017", "City of Phoenix, President's Visit Updates, last updated Aug. 18, 2017", "Azcentral.com, coverage of President Donald Trump’s visit to Phoenix, Aug. 22, 23, 2017", "12news.com, Trump rally protest ends with police firing pepper balls, arresting 4, Aug. 23, 2017", "Abc15.com, Trump protests in Phoenix: Experience the conflict between attendees and protesters, Aug. 22, 2017", "Azfamily.com, Protesters hit the streets outside Phoenix Convention Center, Aug. 22, 2017", "Azfamily.com, SLIDESHOW: Police, Trump protesters clash in downtown Phoenix, Aug. 23, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]