["A purported opinion poll for Rajasthan elections attributed to British Broadcasting Corporation (BBC) is currently viral on social media. Many have shared (1, 2, 3) the home page of BBC along with the prediction of the election results. The alleged poll, which forecasted 160+ seats for the Congress and 30 seats for the BJP in June, predicts a win for the BJP with 135 seats forecasted on November 28, 2018.", "The similar post (with numbers changed after October 2018) has also been shared by Twitter user Rishi Bagree, drawing over 6,000 likes and more than 2,000 retweets. However, Bagree did not attribute the pre-election survey to BBC.", "Rajasthan opinion poll", "June — Congress 160+, BJP 30 July — Congress 150 , BJP 40 Aug –. Congress 135 , BJP 50 Oct — Congress 125 , BJP 65 Nov — Congress 110, BJP 85 Today–Congress 105, BJP 90", "If this will continue On 11 Dec we might see Congress 85, BJP 110", "— Rishi Bagree 🇮🇳 (@rishibagree) November 29, 2018", "Twitter and Facebook alike, individual users have widely circulated the purported poll that forecasts a win for the BJP against the Congress in the December Rajasthan elections.", "The identical text across multiple Facebook accounts hints that the alleged survey is viral on WhatsApp as well.", "@free_thinker is this true? pic.twitter.com/0iuGWVUlIa", "— atal goel (@atalgoel) November 30, 2018", "Alt News spoke to a BBC spokesperson who informed that no such opinion poll has been published by the news organisation. Moreover, BBC does not commission pre-election surveys in India.", "“This fake survey on the Rajasthan polls has been circulating on WhatsApp and social media, with some messages claiming it to be from BBC News. We’d like to make absolutely clear that it is fake and does not come from the BBC. The BBC does not commission pre-election surveys in India,” said the spokesperson.", "In so far as the exit polls are concerned, three opinion surveys have been conducted with regard to the Rajasthan Assembly Elections – ABP News-CVoter, C fore and Times Now in association with CNX – and all of them predict a win for the Congress.", "Fake news often piggybacks on credible media outlets to give misinformation an appearance of genuineness. In May 2018, before the commencement of Karnataka Assembly elections, another purported opinion poll ‘Janta Ki Baat’ was viral as a BBC survey. However, Alt News had found that the poll was fake and attempted to imitate ‘Jan Ki Baat’ survey. An imposter BBC website was also viral in September this year, propagating a ‘list’ of the world’s most corrupt political parties, placing the Congress second. The same website also propagated a ‘list’ of most corrupt leaders, placing Narendra Modi at seventh. The Indian Prime Minister was also declared the second most corrupt leader in the world by an imposter Fox News website.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]