["The misleading claim can be seen here in a May 28, 2019, report by British newspaper The Independent which is headlined: “Philippines passes law requiring students to plant 10 trees if they want to graduate.”", "The story, which has been shared more than 75,000 times according to CrowdTangle data, has a first paragraph saying: “A new Filipino law requires all graduating high school and college students to plant at least 10 trees each before they can graduate.”", "The Independent also published the report here on their verified Facebook page, which has more than nine million followers, with a caption saying: “It could result in 175 million new trees each year.”", "Multiple other media organisations have published articles making similar claims about a new law mandating tree planting for students in the Philippines, for example here in the London Evening Standard, here in Newshub, here in the Business Insider and here on vice.com.", "Hollywood actor Ashton Kutcher shared one of the misleading articles here on his official Facebook page, which has more than 17 million followers, with a caption saying: “Tree-planting is an awesome way to fight climate change.”", "Multiple Facebook users in the Philippines also shared the misleading articles, for example here and here.", "Some posts, such as this one, expressed joy at the purported passage of the law.", "The status, when translated to English, says: “Woke up to the best news I’ve seen all month. I could cry tears of joy. Hopefully the schools and the universities will be strict so this can be implemented well.”", "The articles are misleading -- while the Philippines’ lower house has passed a student tree-planting bill, it has not been approved by the upper house or signed by the president, both of which are required for legislation to actually become law.", "Many of the articles sourced their claims to this May 15, 2019, article on CNN Philippines headlined: “House passes bill requiring graduating students to plant 10 trees on final reading.”", "According to the Philippines constitution, the relevant section of which can be seen here, the country has two chambers of Congress, the House of Representatives and the Senate.", "According to the Philippines’ legislative process, which can be seen here on the Senate website, in order for a bill to become law, both the House of Representatives and the Senate must approve a final version of the bill and submit the legislation to the president, who can either sign it into law or veto it.", "The CNN Philippines article says the bill was principally authored by Representative Gary Alejano, a member of the Philippines House of Representatives. Here is Alejano’s listing on the House’s official website.", "A check of the online repository of bills and resolutions on the official website of the House of Representatives showed that Alejano was indeed one of the principal authors of House Bill 8728, called: “AN ACT REQUIRING ALL GRADUATING ELEMENTARY, HIGH SCHOOL AND COLLEGE STUDENTS TO PLANT AT LEAST TEN (10) TREES EACH AS A PREREQUISITE FOR GRADUATION”.", "Here is a copy of the bill on the official Congress website.", "The bill’s status on the official website of the House of Representatives shows that it was passed by the lower house on January 14, 2019 and sent to the Senate on January 15, 2019, where it remains pending.", "Below is a screenshot of the status of the bill:", "A search of the online repository of bills and resolutions on the official Senate website showed that Sen. Antonio Trillanes also filed a bill also requiring graduating students from elementary, high school and college to plant at least 10 trees on July 19, 2016.", "Here is a full copy of the 2016 Senate tree planting bill.", "Below is a screenshot of the history of the bill on the Senate website, which shows that it remains pending:", "Alejano told AFP that he does not think the tree planting bill will be passed into law before Congress adjourns on June 8, 2019.", "“‘Graduation Legacy for the Environment Act’ or House Bill 8728 was approved on 3rd and final reading on 14 Jan 2019 and was transmitted to the Senate the next day, 15 Jan 2019. Similar bill was filed by Sen Trillanes in the Senate and was referred to the Education committee headed by Sen Escudero. It has not been acted upon until now. Very unfortunate. Considering the remaining days in the 17th Congress, I am afraid the proposed measure will not be passed into law,” Alejano told AFP by text message on May 30, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]