["About this rating", "After White House senior aide Rob Porter resigned amid allegations of domestic violence in February 2018, a fake news article claimed that Vice President Mike Pence had publicly expressed support for Porter, with the help of some Bible verses.", "That article, as well as an excerpt from it that worked into a meme form, originated with posts made to pages masquerading as legitimate Fox News accounts:", "\"Fox News the FB Page\" uses the cable news channel's style and logos in its content, but the page has no affiliation with Fox News, and everything it publishes is parody. Incongruously, \"Fox News the FB Page\" is also a web site that utilizes the domain www.tdalliance.com. They published the fake news article that this meme is based upon.", "In reality, Vice President Pence said publicly that he was \"appalled\" when he learned of the domestic abuse allegations. (He also maintained he did not know about them until Porter's resignation.)", "The article used this morsel of truth  as a jumping off point for the false claim that Pence later \"softened\" his stance on the issue, leaning on Biblical teachings for guidance:", "Pence has softened his comments about Porter saying his actions if true were “in accordance with Biblical principles” and that women should “submit to their husbands as their husbands are their heads just as Jesus is head of the church.”", "This passage appears to be a reference to Ephesians 5:22, which reads: \"Wives, submit yourselves to your own husbands as you do to the Lord. For the husband is the head of the wife as Christ is the head of the church, his body, of which he is the Savior.\"", "However, Pence said no such thing in regard to the Porter allegations, nor has he \"softened\" his stance on that subject.", "Before putting out the item about Pence and Porter, Fox News the FB Page had spread similar claims that a statue of Jefferson Davis was to be replaced with one of Barack Obama, that President Obama ordered Mother's Day be used to \"celebrate abortions,\" and that Senator Bernie Sanders planned to <a \"https://www.snopes.com/bernie-sanders-plans-to-tax-churches/\" target=\"_blank\" rel=\"noopener\">tax churches.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]