["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The White House claim is part of a pattern of attacks by President Trump and his administration on Democrats over immigration enforcement and the violent gang MS-13. Graphic by Capital Public Radio", "The White House made an inflammatory attack on California Democratic Sen. Kamala Harris this week, claiming on its official Twitter account that she is \"supporting the animals of MS-13.\"", "Here’s the tweet from July 2, 2018:", "It’s part of a pattern of attacks by President Trump and his administration on Democrats over immigration enforcement and the violent gang MS-13, or La Mara Salvatrucha. The gang grew out of poor Los Angeles neighborhoods where many refugees from civil wars in El Salvador, Guatemala and Nicaragua lived in the 1980s.", "For this fact check, we examined the tweet about Harris. We also reviewed similar attacks.", "Harris repudiates claim", "The White House did not respond to our request for evidence supporting the claim. Harris strongly rejected it, replying to the White House on Twitter:", "\"As a career prosecutor, I actually went after gangs and transnational criminal organizations. That’s being a leader on public safety. What is not, is ripping babies from their mothers.\"", "Harris was California’s attorney general and San Francisco’s district attorney before she was elected to the Senate in 2016. She is often mentioned as a potential 2020 presidential candidate.", "She added in another tweet:", "\"My record speaks for itself:\n→ Arrested members of drug trafficking organizations that smuggled in narcotics to the United States\n→ Announced the arrests in a murder-for-hire plot by a Tijuana-based drug cartel\n→ Confiscated 500lbs of meth from a Mexican cartel\"", "We found no evidence Harris has ever supported or expressed any sympathy for MS-13.", "Pattern of baseless claims", "This is not the first rhetorical firebomb on MS-13 lobbed at Democrats by Trump or the White House. In a speech in May, Trump claimed California Rep. Nancy Pelosi \"came out in favor of MS-13.\" PolitiFact found Pelosi hasn’t defended the gang and rated it False. Trump has repeated it in subsequent speeches.", "On the same day the White House tweeted about Harris, it also attacked Massachusetts Democratic Sen. Elizabeth Warren, saying: \"@SenWarren, why are you supporting criminals moving weapons, drugs, and victims across our nation’s borders? You must not know what ICE really does.\"", "Democrats, including Harris, Pelosi and Warren, have criticized Trump’s policy of separating children from migrants and asylum seekers entering the country. They’ve also called for reforming, or in some cases abolishing, the U.S. Immigration and Customs Enforcement Agency, or ICE, and replacing it with a new agency.", "They have not, however, explicitly called for ending immigration enforcement. Nor have they made statements in favor of MS-13.", "Here’s what Harris said on MSNBC in June about ICE:", "\"I think there’s no question that we’ve got to critically re-examine ICE and its role and the way it is being administered and the work it is doing,\" Harris said. \"And we need to probably think about starting from scratch because there's a lot that is wrong with the way that it's conducting itself. And we need to deal with that.\"", "Our ruling", "The White House attacked Sen. Kamala Harris for \"supporting the animals of MS-13,\" in a tweet from its official account.", "Harris and other Democrats have sharply criticized the Trump administration for its immigration policies. They have expressed concern about how those entering the country, legally and illegally, are treated and called for reforming or replacing ICE.", "That’s not the same thing as or even close to \"supporting\" a violent criminal gang.", "We found no information showing Harris has supported or sympathized with MS-13. When asked, the White House provided no evidence to back up its reckless attack, which fits with a pattern of other baseless claims on the subject.", "We rated the White House claim Pants On Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "White House, tweet, June 2, 2018", "Sen. Kamala Harris, tweets, June 2, 2018", "Tyrone Gayle, spokesman for Sen. Harris, phone interview, June 3, 2018", "PolitiFact, Donald Trump's false claim that Nancy Pelosi 'came out in favor of MS-13', May 24, 2018", "PolitiFact, Fact-checking Donald Trump's rally in North Dakota, June 28, 2018", "The Washington Post,  ‘Why are you supporting criminals?’: White House targets Warren, Harris in immigration debate, July 2, 2018", "YouTube, Sen. Kamala Harris: We Must \"Reexamine ICE And Its Role\" | Kasie DC | MSNBC, accessed July 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]