["By Jessica McDonald", "Posted on November 8, 2019", "For the second year in a row, President Donald Trump inaccurately attributed California’s rash of wildfires to poor forest management. He also falsely said other states don’t have “close to the level of burn” as California.", "Most of the Golden State’s latest blazes aren’t in forests, experts explained, and therefore aren’t the types of fires that would benefit from better forest management. Wildfires also aren’t limited to California, even if the state gets more attention for them. So far this year, for example, wildfires in Alaska have burned nearly 10 times as much land as those in California.", "Trump’s comments began on the morning of Nov. 3, as firefighters in California were battling numerous fires across the state, including the Kincade Fire west of Sacramento and the Getty Fire in Los Angeles.", "In a series of three tweets, the president attacked California Governor Gavin Newsom, saying he had done a “terrible job of forest management” and that he “must ‘clean’ his forest floors,” adding, “You don’t see close to the level of burn in other states.”", "The Governor of California, @GavinNewsom, has done a terrible job of forest management. I told him from the first day we met that he must “clean” his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers…..", "— Donald J. Trump (@realDonaldTrump) November 3, 2019", "….putting these massive, and many, fires out. Great firefighters! Also, open up the ridiculously closed water lanes coming down from the North. Don’t pour it out into the Pacific Ocean. Should be done immediately. California desperately needs water, and you can have it now!", "— Donald J. Trump (@realDonaldTrump) November 3, 2019", "Within hours, Newsom replied via tweet: “You don’t believe in climate change. You are excused from this conversation.”", "Later in the day, the president again blamed the fires on “bad” management and criticized the governor, telling reporters on the South Lawn that “it’s always California. Never — it’s rarely somebody else or someplace else.”", "Trump, Nov. 3: [Y]ou’ve got fires eating away at California every year because management is so bad. The governor doesn’t know — he’s like a child. He doesn’t know what he’s doing. And I’ve been telling this for two years: They’ve got to take care of it. Every year, it’s always California. Never — it’s rarely somebody else or someplace else.", "Wildfires, of course, do happen elsewhere. According to the National Interagency Fire Center, an average of 61,375 human-caused wildfires occur every year across the U.S., of which approximately 7,500, or 12%, are in California.", "And contrary to Trump’s claim that other states don’t have “close to the level of burn” as California, other states often outrank California in terms of acres burned. As of Nov. 5, more than 2.5 million acres had gone up in flames in Alaska this year, compared with fewer than 300,000 in California.", "Figures reported to the fire center show that in 2017, both Nevada and Montana had more burned land than California, and in 2016 Oklahoma did. In 2015, Alaska had the most scorched land — more than 5 million acres — followed by Washington.", "Even in 2018, when California’s 1.8 million burned acres totaled more than any other state, other states racked up substantial acreage as well, including Nevada, with more than 1 million acres, and Oregon, with nearly 900,000 acres.", "Of the 198 largest U.S. wildfires between 1997 and 2018, agency statistics show that 49 occurred in Alaska, 26 were in Idaho, and 23 were in California.", "California, then, is by no means the only state with wildfires. Still, it is true that California is highly susceptible to wildfires and is home to some of the most costly and destructive fires.", "California’s high risk, experts said, is explained by natural climate features and its massive population.", "“There are lots of areas that have as many or more fires than California,” said University of Utah fire scientist Philip Dennison. “The difference with California is [that] it has a very large population.” With 40 million people, he added, just about any fire that starts will impact someone, which is far less true in other, less populated Western states.", "University of California, Los Angeles climate scientist Daniel Swain also pointed to the Golden State’s climate and geography, which he said “sets it completely apart from any other region in the United States” and leaves it more susceptible to extreme wildfire than virtually anywhere else in the nation.", "The state, he said, goes for a long time without rain — a period that coincides with high temperatures in the summer — and then seasonal winds come in during autumn when vegetation is very dry. “When the vegetation is as explosively flammable as it is in California toward the end of the dry season,” he said, “it’s surprisingly easy to spark a wildfire.”", "“California also has far more people living in high risk wildfire zones than any other state in the country,” Swain added. “Given these facts, it’s quite clear why the overall human exposure to wildfire risk is greater in California than in other states.”", "As we explained last year, forest management techniques, including tree thinning and prescribed fires, can be helpful to reduce the severity of some wildfires. But these strategies aren’t effective for all ecosystems — and as with 2018, the latest fires in California aren’t in traditional forests.", "“It is true that a historical policy of ‘total fire suppression’ in federal forests during much of the 20th century led to a lack of beneficial, low-intensity fire,” said Swain, referring to a longstanding practice of quickly snuffing out wildfires across much of the West. “In those regions, present-day wildfires tend to burn more intensely than they would have in a more natural setting.”", "But, he added, that’s not the situation for the latest fires. Southern California’s fires are burning “almost exclusively” in dry brush and grasses, he said, while the landscape around the Kincade Fire is a patchwork of forest, brush and grass. The forest that is there, he noted, is largely not coniferous, which is the main type of forest “where the historical legacy of fire suppression is most relevant.”", "Dennison told us that weather conditions, too, limit the impact that management would have, and that “cleaning” the forest floor, as Trump suggested, “wouldn’t help with the recent fires.”", "“There are places where fuel management is appropriate to reduce the risk of ignition or to make fire easier to control,” he said. “But in the high wind situations that we saw over the last couple of weeks, there’s not much you can do.”", "Indeed, California’s current spate of wildfires coincides, as it did in 2018, with dry, hot weather and extreme winds, known as the Santa Ana winds in the south and the Diablo winds in the north. The conditions make it easy for fires to start, and once ignited, to quickly spread.", "Tinderbox conditions, of course, still need a spark, and in California, the culprit is usually a person or something related to humans, such as a downed power line.", "Climate change, too, may be a factor in making fires more severe, because more hot weather can further dry out already dry vegetation, Swain said, and precipitation declines may delay the start of the rainy season.", "“Recent years (2017, 2018, and 2019) have each featured an unusually late onset of the rainy season in California and unusually late seasonal occurrence of extreme fire weather conditions,” he said, “consistent with expectations of autumn drying and warming due to climate change.”", "At the same time, it’s worth noting that the link between climate change and fire risk is variable, and depends on location. Alexandra Syphard, a senior research scientist at the nonprofit Conservation Biology Institute, said that for interior forests, there is a significant relationship between temperature and precipitation and an increased risk of fires — and in those forests, there’s “a very good chance” climate change could be exacerbating blazes. But in Southern or coastal California, that link is less clear.", "In a 2016 study she co-authored, Syphard found little or no statistical relationship between climate and fire severity at low-elevations or in Southern California. One reason for that, she said, could be that if conditions are already ripe for a fire, climate change can’t make it much worse.", "In a subsequent study, Syphard, who is also chief scientist for a wildfire-focused insurance company, found that in places where there isn’t a strong relationship between climate and fire activity, there usually is a strong human presence. “What that suggests is that human influence at minimum can scramble the relationship between fire and climate,” she said, and possibly override it.", "This doesn’t necessarily mean that climate isn’t important, Syphard said, but it does suggest that there are proactive measures people can take to reduce wildfire risk, such as plugging gaps in roofs or putting screens on vents to prevent embers from igniting homes, as well as not continuing to build in the most fire-prone areas along the wildland-urban interface.", "“By talking only about climate you’re missing part of the equation,” she said. “Climate is something that requires action, but by attributing everything to climate it is playing down things that we could do otherwise.”", "Finally, fire experts were mystified by Trump’s suggestion to “open up the ridiculously closed water lanes coming down from the North.”", "“Using water in rivers or irrigation canals isn’t practical for keeping large areas from burning,” explained Dennison.", "Syphard agreed that firefighting efforts were not being hampered by a lack of water in the state. “Adding more water,” she said, “is not going to improve the situation.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]