["Using Earth Day as a backdrop on April 22, 2016, world leaders from 175 countries signed an historic agreement for climate change. Named for the city of Paris, the agreement was signed at the United Nations headquarters in New York.", "Senior adviser to President Barack Obama Brian Deese attempted put the agreement into perspective in a post on Medium: \"Today, on Earth Day, nearly 170 countries will sign the Paris Agreement, reinforcing their commitment to the historic climate pact that was forged in December of last year. That’s the largest number of countries that have ever signed an international agreement in one day.\"", "United Nations Secretary-General Ban Ki-moon made a similar claim on the same day.", "\"Today is an historic day,\" Ban told reporters at a press conference following the opening ceremony of the signing event in New York. \"This is by far the largest number of countries ever to sign an international agreement on a single day.\"", "We wondered if Ban, and Deese were correct.", "The Paris Agreement was signed by leaders from 175 of the 193 countries in the United Nations.", "That is indeed a record, the United Nations confirmed.", "The previous benchmark was in 1982.", "\"In 1982, 119 countries signed the Law of the Sea Treaty. That was the record until Friday,\" said Stéphane Dujarric, a United Nations spokesman. The Law of the Sea Treaty called for technology transfers and wealth transfers from developed to undeveloped nations. It also required parties to the treaty to adopt regulations and laws to control pollution of the marine environment.", "There are a few caveats worth mentioning.", "First, signing the agreement is not the end. The leaders must now go back to their home countries' governments to ratify and approve the agreement, which could take months or years.", "Fifteen countries ratified the agreement immediately -- Barbados, Belize, Fiji, Grenada, Maldives, Marshall Islands, Nauru, Palau, Samoa, Somalia, St. Kitts and Nevis, St. Lucia, State of Palestine and Tuvalu.", "Second, the record should be put into perspective. There are both more countries and more members of the United Nations today than ever.", "Until now, the 1987 Montreal Protocol was regarded as one of the most successful international treaties of all time. It was the first treaty in history to achieve universal ratification. It is has been ratified by every member of the United Nations and was ratified by 197 governments.", "This protocol deals with the protection of the Earth’s fragile ozone layer. This layer protects life on Earth from some of the sun’s harmful ultraviolet rays -- and, thanks to the treaty, is set to recover completely by around 2050. But the Montreal Protocol initially was signed by just 46 governments.", "The Paris Agreement goes into effect once 55 countries representing at least 55 percent of global emissions formally ratify the agreement.", "Among other things, the agreement proposes:", "a  long-term goal of keeping the increase in global average temperature to well below 2°C above pre-industrial levels;", "to aim to limit the increase to 1.5°C;", "reduce the amount of global emissions, recognizing that the process will take longer in developing countries.", "Our ruling", "Ban said, the Paris Agreement \"is by far the largest number of countries ever to sign an international agreement on a single day.\"", "That is correct, beating the previous record when 119 countries simultaneously signed the Law of the Sea Treaty in 1982.", "But there are two caveats. First, Signing does not equal ratification. Countries must still do that before the agreement takes effect. Second, it’s worth noting there are more independent nations today to sign an agreement than in year’s past.", "The statement is accurate but needs additional information. We rate it Mostly True.", "Medium, Senior adviser to President Barack Obama Brian Deese post, accessed April 25, 2016,", "United Nations, Press release with Secretary-General Ban Ki-moon's declaration,", "Email interview with Frank Benenati, The White House press secretaries assistant, April 25, 2016,", "Email inteview with Stéphane Dujarric, the spokesman for the United Nations Secretary-General Ban Ki-moon,  April 25, 2016,", "United Nations, The Paris Agreement, accessed April 25, 2016", "United Nations, List of the Paris Agreement counties, accessed April 25, 2016", "United Nations,  Treaty collection, accessed April 25, 2016", "United Nations Blog, Most ratified international treaties, accessed April 25, 2016", "United Nations, Law of the Sea Treaty, accessed April 25, 2016", "Ozone Secretariat, The Montreal Protocol, accessed April 25, 2016", "World Recources Institute, CAIT Climate Data Explorer, accessed April 25, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]