["A video of a person scaring bikers on the road was tweeted by Jio News on March 29 suggesting that this was an “innovative way to make people stay indoors” during the lockdown imposed due to the coronavirus pandemic. The handle claimed that the incident occurred in Goa.", "Take a look at this man’s innovative way to make people stay indoors in #Goa.#usergeneratedcontent #stayhomestaysafe #coronavirus #lockdown pic.twitter.com/N03Ox9d3dQ", "— JioNews (@JioNews) March 29, 2020", "Goa News Hub, which calls itself as the “News portal of Goans, for Goans, by Goans”, was one of the earliest to tweet the video on March 28. The handle said, “And this stunt on Amona bridge is going viral. More effective than lathis.”", "Alt News broke the video into multiple frames using the digital verification tool InVid. We then performed a Google reverse image search of one of the keyframes and found that the video is almost one-year-old. We located an Indonesian Facebook post where the same video was posted on May 14, 2019.", "Prank Pocong… Sampek manjat jembatan hahaa", "Prank Pocong… Sampek manjat jembatan hahaa", "Posted by Berita Viral & Komedi Terkini on Monday, 13 May 2019", "Indonesian news website Viva had also published an article on the video on May 13, 2019. As per the report, a man shrouded as a corpse pretending to be the Indonesian ghost “pocong” sitting on a road shoulder while a person records the video. The article cited an Instagram post by parodiviral, which now ceases to exist.", "Alt News was then able to trace the video back to May 11, 2019, on YouTube. It was posted by a YouTube vlogger named Sutan Sikumbang. The ‘about us’ section of the channel says that he makes “video chat prank”. We found a remark by Sutan posted in the comments section which confirmed that the video is from Indonesia.", "He wrote, “Try listening to it, he is using our special Minang language, his location in Padang Pariaman district is a village name Sunar.”", "Alt News couldn’t independently verify the location and context of this video. Nonetheless, it is certain that the video is old and was viral in Indonesia at least ten months ago.", "India Today’s official Twitter handle had tweeted the video on March 29 with the same claim that a man was scaring people off in Goa to keep them indoors. However, the channel clarified 12 hours later that the clip represents a 2019 prank in Indonesia. While the video garnered 288 retweets, it is noteworthy that the correction tweet has only 10 retweets. The video was also tweeted by Aaj Tak and India Today anchor Rahul Kanwal.", "Editor of news agency ANI Smita Prakash posted the video at least three hours before India Today. She too clarified later that the clip was neither shot in Goa nor during COVID-19 lockdown. However, while her original tweet has 2,600 retweets, the clarification tweet has garnered only six retweets so far.", "A 10-month-old and unrelated video most likely from Indonesia was shared as an “innovative” method used in Goa to keep people inside their homes during the 21-day lockdown across the country.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]