["By Eugene Kiely", "Posted on February 11, 2020", "Sen. Bernie Sanders claimed there was a “huge voter turnout” among young caucusgoers in Iowa this year, saying the turnout was “even higher than Obama’s extraordinary victory in 2008.” In fact, about 10,300 fewer young voters turned out this year than in 2008.", "Sanders, who finished in a virtual dead heat for first place with Pete Buttigieg in the contested Feb. 3 Iowa caucus, has made the argument that his grassroots campaign can defeat President Donald Trump.", "“To win, we need energy, we need excitement, we need the largest voter turnout in American history,” Sanders told the Des Moines Register before the Iowa caucus. “I think we are the campaign to do that.”", "Even though turnout was only slightly better among Democrats in Iowa this year than it was four years ago, Sanders has repeatedly pointed to young voter turnout as a sign his campaign can bring out the youth vote in November. But he’s spinning the figures.", "On CNN’s “State of the Union” on Feb. 9, Sanders said: “In Iowa, where the turnout was not as high as I wanted it to be, among young people, people under 29 years of age, we increased the voter turnout by some 33%. It’s a huge voter turnout.”", "On NBC’s “Meet the Press,” the Vermont senator said: “The young vote, of people under 29 years of age, increased by 33% over where it was four years ago, and was even higher than Obama’s extraordinary victory in 2008.” He called it a “great omen for the 2020 campaign.”", "Sanders is referring to an increase in the proportion, not the numbers, of young voters.", "It’s true that an estimated 24% of this year’s Democratic caucusgoers in Iowa were 29 years old or younger — a higher percentage than in 2008 (22%) and 2016 (18%), according to Edison Research, which conducts entrance polls at the Iowa caucus sites for major news organizations. But far more people participated overall in 2008, including more young people.", "“In 2016, participation in the Iowa caucuses was around 170,000 voters,” Edison Research said in a blog post prior to the Iowa caucus. “But in 2008, turnout for the Democratic caucuses in Iowa reached record levels; 239,000 voters came out to participate in the caucuses that year.”", "That means about 52,580 people ages 17 to 29 participated in the Iowa caucus in 2008 — which is far more than came out this year.", "As the Washington Post reported, 176,000 people participated in the Democratic caucuses in Iowa, which means about 42,240 of the Democratic caucusgoers were 29 years old or younger. That’s about 11,640 more than participated in 2016 — when Sanders was also a presidential candidate — but it’s about 10,300 fewer younger voters than in 2008.", "So, Sanders’ claim that young voter turnout among Iowa Democrats “was even higher than Obama’s extraordinary victory in 2008” is pure spin.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]