["About this rating", "A provision in the National Defense Authorization Act for Fiscal Year 2017 restructures the bipartisan board of the Broadcasting Board of Governors and will give President-elect Trump the ability to appoint a new board and chief executive officer.", "Congress did not approve a privately owned \"Trump TV\" and agree to fund it with taxpayer monies.", "On 12 December 2016, the web site Groopspeak.com published an article about a provision in the National Defense Authorization Act, but under a misleading title:", "BREAKING: Republican Congress Approves Trump TV – Financed By Taxpayers For $800 Million/Year", "The possibility of Trump pushing forward his own media outlet has been circling the rounds in the press for years, but now it looks like Congress has given him the green light to move forward with it.  Not only that, but it’s going to cost taxpayers $800 million per year for him to run it.", "The Groopspeak article was aggregated from genuine news reports about a provision in the National Defense Authorization Act which would replace the bipartisan board of the Broadcasting Board of Governors with a presidentially appointed advisory board. Some critics say they fear that the bill would give Trump (who frequently criticized the media during the 2016 presidential campaign) an \"unfettered propaganda arm\" to peddle his own version of news:", "Buried on page 1,404 of the National Defense Authorization Act that passed last week is a provision that would disband the bipartisan board of the Broadcasting Board of Governors, the independent U.S. agency that includes Voice of America, Radio Free Europe, Radio Free Asia and the Middle East Broadcast Networks.", "The move — pushed by House Foreign Affairs Chairman Ed Royce as a way to streamline the agency — concentrates control into a powerful CEO who is appointed by the president.", "That change, combined with a 2013 legislative revision that allows the network to legally reach a U.S. audience, which was once banned, could pave the way for Trump-approved content created by the U.S. diplomacy arm, if he chooses to exploit the opportunity.", "Essentially, Trump is finally getting his Trump TV — financed by taxpayers to the tune of $800 million per year. And some of the few people in the know aren’t happy about it.", "“Congress unwittingly just gave President-elect Trump unchecked control of all U.S. media outlets,” said Michael Kempner, a Democratic member of the board who was appointed by President Barack Obama and was a Hillary Clinton donor. “No president, either Democrat or Republican, should have that kind of control. It’s a public jewel. Its independence is what makes it so credible.”", "While the Groopspeak.com article highlighted the viewpoints of those opposed to these changes, they left out some key facts. For instance, Radio Liberty noted that the presidentially appointed advisory board would not have decision-making powers, and that if Trump did decide to empower a new chief executive officer, his choice would still be subjected to Senate confirmation.", "President Obama said in a statement on 23 December 2016 that he strongly supports the structural reform of the Broadcasting Board Of Governors, and was confident that the \"longstanding statutory firewall\" would maintain the integrity of the agency's journalists:", "My Administration strongly supports the bill's structural reform of the Broadcasting Board of Governors (BBG), which streamlines BBG operations and reduces inefficiencies, while retaining the longstanding statutory firewall, protecting against interference with and maintaining the professional independence of the agency's journalists and broadcasters and thus their credibility as sources of independent news and information.", "BBG's current CEO, John Lansing, made a similar comment in a note to staffers, writing:", "Maintaining our journalistic independence, and our credibility worldwide, remains of the utmost importance.", "While the National Defense Authorization Act will restructure the Broadcasting Board of Governors, a spokesperson for the group said that the change would not alter the editorial firewall that protects journalists from government meddling:", "\"The CEO now is legally required to abide by and oversee the firewall,\" the spokeswoman said. \"It is the job of the news directors, editors and broadcasters, under the strict journalistic standards spelled out in the U.S. International Broadcasting Act of 1994, to determine the stories that get covered.\"", "While some critics fear that Donald Trump could use changes to the Broadcasting Board of Governors to install a team of propagandists, it is inaccurate to say that Congress approved \"Trump TV.\"", "Folkenflik, David.   \"An Obama-Backed Change At Voice Of America Has Trump Critics Worried.\"\r\n    NPR.   14 December 2016.", "\"Obama Signs New Law Restructuring U.S. International Media.\"\r\n    Radio Liberty.   24 December 2016.", "Palmeri, Tara.   \"Trump to inherit state-run TV network with expanded reach.\"\r\n    Politico.   12 December 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]