["“I have invoked the insurrection act of 1807, to address the treasonous rebellion conducted by Democrat & Republican lawmakers, CCP agents, the FBI, DOJ, CIA & others to undermine, corrode and dismantle the United States of America and its Constitution,” reads a text on the @TeamTrumpNews Parler account and shared as a January 10 screenshot on Facebook.", "Dozens of YouTube videos, tweets, Facebook posts, and online articles have also claimed that the president invoked the Act allowing deployment of the army to restore order in case of insurrection and granting it arrest powers, among other things.", "Several posts further claim retired US army general Michael Flynn, pardoned by Trump for lying to the FBI over Russian contacts, would be named vice president in coming days. Others referred to the Insurrection Act as martial law.", "However, the claims are false. The only piece of evidence for them is the purported Team Trump statement on alternative social media platform Parler.", "Parler was forced offline around 2:59 am, Washington, DC time, January 11, after Amazon cut off access to the servers which hosted the platform.", "An archived version of the post shows the claim came from the Parler account @TeamTrumpNews, which does not feature an authenticity medallion. Team Trump’s Parler profile handle is simply @TeamTrump, which suggests the Insurrection Act announcement came from an impostor account.", "Amazon said it suspended Parler for allowing “threats of violence.” Its popularity had recently soared due to Twitter’s ban of Trump following the January 6 attack on the US Capitol.", "Hundreds of of Trump supporters entered the Senate and House complex by force while Congress members were gathered to certify Joe Biden as president-elect. To support police, National Guard soldiers from six states and the District of Columbia were sent as reinforcements after the attack.", "All 6,200 troops will stay beyond the January 20 inauguration of President-elect Joe Biden for a 30-day minimum decreed by a Title 32 order, Army Secretary Ryan McCarthy said during a press conference on January 7.", "A Title 32 order allows the deployment of the National Guard, while keeping it under the control of the state.", "The Insurrection Act of 1807, in contrast, allows the president “to call forth the military during an insurrection or civil disturbance.”", "National Guardsmen were deployed at the offer of State governors to assist DC authorities, not at the request of the president.", "However, as a report for Congress shows, for the president to use armed forces under the Insurrection Act, he must first issue a proclamation ordering the insurgents to disperse within a limited time, which did not occur.", "The idea that president Trump invoked the Insurrection Act is not backed by any source. The White House’s media page shows no press releases suggesting this, and neither does the Department of Defense.", "No major news outlet reported the signing of the Insurrection Act or any other forms of martial law. Trump threatened to use the Act to restore order in June 2020 during a US-wide wave of protests against police brutality and racism, some of which ended in riots.", "The last time the Insurrection Act was used was during the 1992 Los Angeles riots.", "The Department of Defense, DC’s National Guard, and the White House did not respond to AFP requests for comment by the time of publication.", "AFP Fact Check has debunked a series of other false or misleading claims related to the 2020 election and storming of the Capitol here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]