["Sometimes social media posts blatantly share misinformation about the coronavirus. Other times, it’s implied.", "An image currently circulating on Facebook falls in the latter category. It’s a screenshot from the website of the federal Centers for Disease Control and Prevention, a stateside clearinghouse for information about the virus.", "\"A positive test result shows you may have antibodies from an infection with the virus that causes COVID-19. However, there is a chance a positive result means that you have antibodies from an infection with a virus from the same family of viruses (called coronaviruses), such as the one that causes the common cold.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post’s comments make clear that some people are seeing this image and believing that a common cold can cause a false positive on a COVID-19 test.", "But if you visit the CDC’s website, specifically the page where this screenshot was taken, you can see that the agency is discussing an antibody test, not a viral test.", "There are two kinds of tests available for COVID-19: viral tests and antibody tests.", "A viral test tells you if you have a current infection by testing a sample from your respiratory system. A sample could be taken using a swab to swipe inside your nose.", "An antibody test is meant to tell you if you had a past infection by testing a sample of your blood for antibodies. The CDC notes that antibody tests \"should not be used to diagnose a current COVID-19 infection.\"", "If you test positive, you could have antibodies from the new coronavirus that causes COVID-19, or you could have antibodies from another coronavirus, like a cold. As Johns Hopkins Medicine notes, coronaviruses are a family of viruses and there are many different kinds of coronaviruses. Some cause disease and some don’t.", "A spokesperson for the CDC told AFP that the traces of other coronaviruses — like the common cold — won’t produce a positive result from COVID-19 viral test.", "This post, which is a screenshot of part of a CDC webpage about COVID-19 antibody tests, is cropped in a way that may suggest the warning pertains to the viral test. It doesn’t.", "We rate the claim that a common cold can cause a positive COVID-19 test False.", "Facebook post, July 12, 2020", "Centers for DIsease Control and Prevention, Tests for past infections, updated June 30, 2020", "Centers for DIsease Control and Prevention, Testing for COVID-19, updated June 24, 2020", "Centers for DIsease Control and Prevention, Tests for current infection, updated July 23, 2020", "Johns Hopkins Medicine, What is coronavirus? Visited July 30, 2020", "AFP, Ongoing COVID-19 infections are detected with a viral test, not a blood check for antibodies, July 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]