["The photo was shared in this tweet published on August 5, 2019. It has been retweeted more than 380 times.", "The caption states: \"Celebrity cat Brother Cream got tear gassed!!\"", "Below is a screenshot of the misleading tweet:", "The misleading tweet also shared a screenshot of this Wikipedia page for famous Hong Kong cat Brother Cream.", "The photo was posted on August 5, the same day Hong Kong was hit by citywide strikes and clashes between pro-democracy protesters and police. Here is an AFP report published on August 5 about the developments.", "Brother Cream is a British Shorthair which has drawn masses of fans after he was spotted at a store in Hong Kong’s Tsim Sha Tsui district.", "The cat, which has nearly 44,000 followers on Instagram, can be seen at the 45 second mark of this December 2016 AFP video.", "The image in the misleading Twitter post was also published with a similar claim here and here on Facebook and here on Twitter.", "The claim is false; the photo shows a different cat.", "The photo was originally published in this Facebook post by another cat owner on August 5, 2019. It has been shared more than 1,200 times.", "Below is a screenshot of the Facebook post:", "The traditional Chinese language caption translates to English as: “Smoke from tear gas rose, prompting Cream to tear up. Update: Thanks for the attention, the smoke has dispersed and the kitty is feeling much better now. Hope everything’s fine on the street.”", "AFP compared the photo in the misleading posts and images of Brother Cream from his Facebook and Instagram accounts.", "The cat in the photo in the misleading posts has a white stripe that runs from its forehead through its nose; Brother Cream, on the other hand, has several brown stripes on his forehead without any white.", "Below is a screenshot comparison of the photo in the misleading posts (L) this image of Brother Cream on his Facebook page (R) with key differences circled in red:", "Ko Chee-shing, Brother Cream's owner, told AFP by phone on August 8, 2019, that his cat was safe.", "“He stays at the shop all the time these days and I’m always with him,\" he said. “Our shop is located on the second floor, and I have never seen tear gas being fired nearby.”", "On August 5, 2019, an administrator for Brother Cream's Facebook page also stated in this comment on the page that the cat was unharmed after one Facebook user suggested the animal had been tear gassed.", "Below is a screenshot of the conversation on Brother Cream’s Facebook page:", "The administrator's comment in traditional Chinese translates to English as: “Brother Cream is as safe as can be, don’t believe rumours”.", "UPDATED: This fact check was updated on 09/08/2019 to add information on the misleading claims and clarify that Facebook user Matthew Ho did not himself say that famous Hong Kong cat Brother Cream was teargassed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]