["The image was published here on Facebook to a public group with more than 22,000 followers.", "The post has been shared 30 times.", "It was published on October 25, 2019, as Hong Kong approached its fifth consecutive month of pro-democracy protests. Here is an AFP report about the protests.", "Below is a screenshot of the misleading Facebook post:", "Several schoolgirls appear to be running uphill in the image. The student on the left can be seen holding a flag with words in both traditional Chinese and English, which translate as: “HIV test / Free Free Free / First come, first served\".", "The post’s traditional Chinese caption translates to English as: “The angels are walking so fast, there must be something weird?”", "The term “angel” refers to Executive Councillor Fanny Law's comments about female activists, or \"angels\", offering free sex to male frontline protesters. Here is a report on her remarks published by Hong Kong public broadcaster RTHK on September 9, 2019.", "The same photo was also published on a separate Facebook group here with an identical caption.", "The image has been doctored; the original photo shows a pro-democracy slogan on the flag.", "A keyword search found the same photo in this post published on a Hong Kong-based Facebook page. The watermark of Hong Kong online news outlet Stand News can be seen on the bottom left-hand corner of the photograph.", "AFP subsequently found the original photo published here on the verified Facebook page for Stand News on October 25, 2019, with credit to photographer Nasha Chan.", "The flag, which shows a different message that is also written in traditional Chinese and English, states: “Liberate Hong Kong / FREE HONG KONG, REVOLUTION NOW / Revolution of our times”.", "“Liberate Hong Kong, revolution of our times” is a slogan coined by jailed pro-democracy activist Edward Leung as part of his campaign for Legislative Council by-elections in 2016. It was then adopted by pro-democracy protesters in Hong Kong, according to this report published by local newspaper South China Morning Post on August 6, 2019.", "Below is a comparison of the doctored image in the misleading posts (L) and the Stand News photo (R):", "The Stand News post’s traditional Chinese caption translates to English in part as: “[Students form human chain to express demands at secondary school swimming gala]", "“Today during the inter-school swimming gala, students from 20 secondary schools formed a human chain at the venue, Kowloon Park Swimming Pool, in a bid to protest the Hong Kong Schools Sports Federation's decision to ban student photographers and journalists from taking photos and conducting interviews in the pool area, as well as obstructing students' expression of political demands.", "“Some students wore masks during the event and displayed flags wth the slogan 'Liberate Hong Kong, revolution of our times’ in an attempt to express their demands.\"", "The photo was taken here next to Kowloon Park Swimming Pool in the Tsim Sha Tsui district.", "The location on Google Street View is embedded below:", "The same protest was reported by Hong Kong local news site hk01 here and local broadcaster Now News here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]