["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A drone picture shows the scene on Aug. 5, 2020, of an explosion that hit the port of Beirut, Lebanon, on Aug. 4, 2020. (AP/Malla)", "An explosion at the port of Beirut was said to have occurred at a warehouse. Lebanese authorities have attributed it to the detonation of ammonium nitrate. There is no evidence as of this writing that the blast was premeditated.", "The Central Bank of Lebanon is located a few miles away from the site of the explosion. It has financial autonomy and gets its capital from the state, according to its website.", "The Rothschilds, the influential European banking family, have been a target of anti-Semitic conspiracies for centuries, including recently by QAnon groups. There is no evidence that they had anything to do with the Beirut explosion.", "Facebook posts from accounts connected to the QAnon conspiracy theory are wrongly blaming the Rothschilds, the influential European banking family, for the explosion at the port of Beirut.", "The Facebook posts falsely claim that the Rothschilds own the Central Bank of Lebanon, which has been struggling to contain the country’s spiraling financial crisis. And because the central bank’s headquarters is located just a few miles away from the site of the explosion, the posts conclude that the Aug. 4 boom was the family’s doing.", "\"The Beirut bombing today was directly next to the Lebanon Central Bank, which is also owned by the most evil deep state family, the Rothschilds,\" one post says. \"There are no coincidences.\"", "\"Rothschild bank explosion in Lebanon,\" says another. \"Covering up evidence … bodies everywhere, this was premeditated, multiple explosions.\"", "\"Don’t believe the first narrative,\" the second post adds.", "The two Facebook posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s start by debunking the posts’ most outlandish claim: There’s no evidence to suggest that the Rothschilds — the wealthy Jewish family that established a financial empire in Europe beginning in the 1700s — are responsible for what happened in Beirut.", "Details are still emerging about the explosion, which as of this writing has left at least 135 people dead and many more wounded, displaced or unaccounted for. Lebanese Prime Minister Hassan Diab and President Michael Aoun have pledged to investigate.", "But U.S. Defense Secretary Mark Esper said Aug. 5 that \"most believe\" it \"was an accident, as reported,\" despite President Donald Trump’s suggestions that it was an \"attack.\"", "RELATED: No evidence Israel hit Beirut with a nuclear missile", "Lebanese authorities said the blast took place at a warehouse along the Beirut waterfront. They have attributed it to the detonation of more than 2,750 tons of ammonium nitrate, a chemical commonly used in fertilizer. Diab said the stockpile had been at the warehouse for six years.", "It remains unclear what set off the ammonium nitrate. A fire appears to have spread with the help of fireworks also kept at the port, according to early reports. The resulting explosion registered as the equivalent of a 3.3 magnitude earthquake. Reverberations are said to have been felt as far as Cyprus, more than 100 miles away from Beirut.", "But what about the Central Bank of Lebanon? The Facebook posts claim that the Rothschilds own the bank, putting them in charge of a building not too far from the site of the explosion.", "The Facebook posts are wrong about that connection, too.", "The headquarters of the Central Bank of Lebanon, or Banque du Liban, is located a few miles away from the port of Beirut, according to Google Maps. It is not \"directly next to\" the explosion site, as one Facebook post claims. Reuters reported that the building was not seriously damaged by the blast. And there’s no evidence that it’s controlled by the Rothschild family.", "The Rothschilds have been a target of anti-Semitic conspiracy theories for centuries, according to the Washington Post, including accusations that they control the global economy and various central banks. Supporters of QAnon have newly embraced those tropes.", "But the Central Bank of Lebanon is an independent government agency. It was established on Aug. 1, 1963, according to its website, and it started to operate a year later. The central bank is currently headed by Riad Salamé, its governor since 1993.", "\"BDL is a legal public entity enjoying financial and administrative autonomy,\" the bank’s website says. \"Its capital is totally appropriated by the State.\"", "As Reuters first reported, the 2019 annual report from Rothschild & Co, the family’s strongest present-day tie to banking, does not mention ownership of central banks.", "Only a handful of countries, including the U.S., have central banks with shareholders outside their respective governments.", "We rate these posts False.", "Facebook post, Aug. 4, 2020", "Facebook post, Aug. 4, 2020", "Various searches on Google Maps, Aug. 6, 2020", "Banque du Liban, accessed Aug. 6, 2020", "Rothschild & Co, \"2019 Annual Report,\" accessed Aug. 6, 2020", "South African Reserve Bank, \"Ownership,\" accessed Aug. 6, 2020", "Reuters, \"\"Fact check: The Central Bank of Lebanon was not destroyed by the Beirut port explosion,\" Aug. 6, 2020", "General Michael Aoun on Twitter, Aug. 5, 2020", "BBC News, \"Beirut explosion: What we know so far,\" Aug. 5, 2020", "The New York Times, \"What We Know and Don’t Know About the Beirut Explosions,\" Aug. 5, 2020", "The Associated Press, \"Fireworks, ammonium nitrate likely fueled Beirut explosion,\" Aug. 5, 2020", "Politico, \"Fireworks, ammonium nitrate likely fueled Beirut explosion,\" Aug. 5, 2020", "CNN, \"Esper says 'most believe' Beirut explosion 'was an accident' after Trump claimed it was an attack,\" Aug. 5, 2020", "Global News on YouTube, \"Beirut explosion: Lebanon’s president Michel Aoun visits devastated port area,\" Aug. 5, 2020", "United States Geological Survey, \"M 3.3 Explosion - 1 km ENE of Beirut, Lebanon,\" Aug. 4, 2020", "The Washington Post, \"Fact-checking QAnon conspiracy theories: Did J.P. Morgan sink the Titanic?\" Aug. 4, 2018", "The Washington Post, \"The Rothschilds, a pamphlet by ‘Satan’ and anti-Semitic conspiracy theories tied to a battle 200 years ago,\" April 20, 2018", "The Federal Reserve Board, \"Who owns the Federal Reserve?\" March 1, 2017", "PolitiFact, \"No evidence Israel hit Beirut with a nuclear missile,\" Aug. 5, 2020", "PolitiFact, \"Meme way off in claim that the Rothschild family holds '80 percent of the world's wealth,'\" Jan. 9, 2019", "PolitiFact, \"QAnon and Donald Trump rallies: What's that about?\" Aug. 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]