["About this rating", "An image purportedly showing German Chancellor Angela Merkel, UK Prime Minister Theresa May, and Lithuanian President Dalia Grybauskaitė together at a party in their teens appeared on social media in March 2018, along with an insinuation that it shows proof of some sort of sinister global conspiracy:", "Tutti gli amici della loro adolescenza..... ora leader dei paesi? Non esiste una coincidenza.", "All the friends of their adolescence ..... now leaders of the countries? There is no coincidence.", "This image truly does show a young Angela Merkel. However, the other two women in the vintage photograph are not either Theresa May or Dalia Grybauskaitė. An uncropped version of the old photograph was published in a Time article about Merkel's life after she was awarded the magazine's \"Person of the Year\" award in 2015. The magazine identified the woman on the left as 18-year-old Angela Merkel (née Kasner), and the other two women were simply identified as friends:", "Angela Kasner, 18, with friends at a New Year's Eve party in Berlin in 1972.", "Glaescher/laif/Redux", "CNN provided a similar caption when they included the image in a gallery of the German leader:", "Merkel, left, attends a New Year's Eve party with friends in Berlin in 1972.", "We haven't been able to identify the two \"friends\" in this photograph, but they are not past or present leaders of either the UK or Lithuania. That claim was simply made up out of whole cloth.", "Merkel, May, and Grybauskaitė are all approximately the same age (they were born in 1954, 1956, and 1956, respectively). However, it's unlikely that these world leaders knew each other in their youth. After all, they were all raised in different countries — Germany, the United Kingdom, and Lithuania respectively — and attended different high schools and colleges; anyone who has attended a party as a teenager knows how difficult it can be to find a ride across town, much less to a different country.", "We were unable to find a photograph of Grybauskaitė from the comparable time period, but we did locate an image of May from 1971 (a year before this viral photograph was taken). Comparing these two images makes it clear that May was not photographed at this party with Merkel, as the only resemblance between the two is that both possibly (but not definitely) have dark hair:", "While we have been unable to positively identify the other two friends in the image or find a photograph of Grybauskaitė from that time period, the existence of the image of young Theresa May discredits the entire claim by rendering one of its central aspects completely moot.", "Time.   \"See Vintage Photos of a Young Angela Merkel.\"\r\n    9 December 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]