["On July 30, 2019, a day after India failed to obtain a red corner notice from Interpol for controversial Islamic preacher Zakir Naik, CNN News18 tweeted a breaking news, “Malaysia refuses asylum to Zakir Naik, asks him to leave the country, after Narendra Modi government provided evidence against him.”", "This was big news because just a month earlier, Foreign Minister Datuk Saifuddin Abdullah had said Malaysia would not extradite Zakir Naik to his home country despite receiving an extradition application from India to face money-laundering charges.", "#BREAKING – Malaysia refuses asylum to Zakir Naik, asks him to leave the country after @narendramodi government provided evidence against him. UAE and Saudi Arabia have also refused asylum to Zakir. | Input: @manojkumargupta. pic.twitter.com/AvOvkg7Qmu", "— News18 (@CNNnews18) July 30, 2019", "Doubts began to emerge about this exclusive CNN News18 story about Malaysia asking Zakir Naik to leave the country as no other Indian or Malaysian news outlet had reported this supposed development. Moreover, CNN News18’s report contradicted what the Malaysian Prime Minister Mahathir Mohamad had said just a day earlier in a one-on-one exclusive interview with the Turkish channel TRT. Here is how he had responded when asked about Zakir Naik.", "Question: “I wonder if you’re familiar with Zakir Naik who’s seen as an Islamic scholar he’s in your country right now right the Indians find him an extremist the Western countries don’t want him because they believed that he promulgates hate speech. Do you agree with that?”", "Response: “Yeah we have a multiracial multi-religious population in Malaysia we don’t want anybody who comes up and expressed extreme views about race religion and about other religions so to that extent we cannot have him but on the other hand it’s difficult to send him anywhere else because many countries do not want to have him.”", "The full interview can be watched here.", "Local Malaysian press too has reported that it is not true that the Government has refused asylum to Zakir Naik. Quoting government sources, FMT News reported that the news was not true. “A government source has denied a news report from India that Putrajaya is refusing to offer Dr Zakir Naik asylum and has told the controversial preacher to leave Malaysia”.", "Moreover, a news report by Aaj Tak has quoted Malaysian Home Ministry to refute the claims about Malaysia extraditing him.", "With all these denials, the claim made by CNN News18 about Zakir Naik’s extradition appears to be unsubstantiated. There has been no update from the channel after it began to emerge that their breaking news may be untrue.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]