["By Jessica McDonald", "Posted on September 11, 2020", "In a Labor Day press conference and at a rally in North Carolina the following day, President Donald Trump made several unsupported or inaccurate statements about a COVID-19 vaccine and distorted comments made by the Democratic ticket.", "The president distorted what Biden and Harris have said about a COVID-19 vaccine, calling for them to apologize for their “anti-vaccine rhetoric.” The candidates have said that they are supportive of a safe and effective vaccine, but not one based on Trump’s word alone.", "“[Biden and Harris] should immediately apologize for the reckless anti-vaccine rhetoric that they are talking right now, talking about endangering lives. And it undermines science,” Trump said in his Labor Day press conference.", "“And what’s happening is, all of a sudden, you’ll have this incredible vaccine, and because of that fake rhetoric — it’s a politic rhetoric; that’s all it is. Just for politics,” he continued. “Because now they see we’ve done an incredible job, and in speed like nobody has ever seen before.”", "Later, Trump focused on Harris, saying, “[S]he’s talking about disparaging a vaccine so that people don’t think the achievement was a great achievement.”", "The next day during a rally in North Carolina, Trump repeated the same sentiments, but went further to say that the pair was spreading “anti-vaccine conspiracy theories.”", "The White House did not explain which comments Trump was referencing, but he was likely responding to statements Harris made on CNN’s “State of the Union,” when she said she would “trust the word of public health experts and scientists” about a vaccine, “but not Donald Trump.”", "In a clip of the interview, which was released on Sept. 6, Harris said she did not think scientists would get the “last word” on the efficacy of a vaccine.", "“If past is prologue that they will not, they’ll be muzzled, they’ll be suppressed, they will be sidelined, because he’s looking at an election coming up in less than 60 days and he’s grasping for whatever he can get to pretend that he has been a leader on this issue when he is not,” Harris said.", "Scientists in the administration have communicated with the public throughout the pandemic, although some media appearances have been limited and Politico reported a Trump adviser unsuccessfully attempted to alter messaging about the coronavirus.", "Harris was then asked if she’d receive a vaccine that was approved and distributed before Nov. 3, Election Day.", "“Well, I think that’s going to be an issue for all of us,” she replied. “I will say that I would not trust Donald Trump. And it would have to be a credible source of information that talks about the efficacy and the reliability of whatever he’s talking about. I will not take his word for it.”", "Later in the interview, Harris said that she would trust National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci to give an accurate assessment of a COVID-19 vaccine and agreed that at some point in the future there would hopefully be a safe and effective vaccine available. She also emphasized the need for a vaccine distribution plan.", "Biden was asked on Labor Day whether he’d take a COVID-19 vaccine before the election. “I would want to see what the scientists said,” he replied. “I want full transparency on a vaccine. One of the problems is the way [Trump] is playing with politics. He’s said so many things that aren’t true, I’m worried if we do have a really good vaccine, people are going to be reluctant to take it. And so he’s undermining public confidence.”", "“But pray God we have it,” Biden continued. “If I could get a vaccine tomorrow, I’d do it. If it cost me the election I’d do it. We need a vaccine and we need it now,” he said, adding, “But we have to listen to the scientists.”", "The same day at a labor union virtual event, Biden also said he’d take a COVID-19 vaccine “[o]nly if it was completely transparent, that other experts in the country could look at it.”", "Around the time Trump made his remarks at the rally, the Biden campaign released a statement that  outlined multiple ways the government should act to reassure Americans that any vaccine that receives authorization is safe and effective, including making the data publicly available along with statements from Fauci, the career Food and Drug Administration staff and relevant vaccine advisory committee.", "The president can have his opinions on why his challengers made statements skeptical of a Trump-endorsed coronavirus shot, but it’s incorrect to suggest they do not support a coronavirus vaccine that has been fully vetted and properly approved.", "Some scientists have expressed concerns similar to those of Biden and Harris about the FDA authorizing a vaccine before sufficient phase 3 data are available.", "In June, University of Pennsylvania professors Dr. Paul Offit and Dr. Ezekiel Emanuel, who is a coronavirus adviser to Biden campaign, wrote an op-ed in the New York Times warning that Trump might attempt an “October surprise” and release a vaccine prematurely to sway the election.", "Other experts have published similar articles in which they call on the FDA — the agency that would be responsible for authorization of a vaccine — not to act too soon or cave to political pressure.", "Offit told the New York Times in August that other scientists working within government shared his concerns, and he told us that he remained worried about politics influencing a COVID-19 vaccine approval.", "He pointed to mounting international pressure and the FDA’s previous decisions during the coronavirus pandemic, including the agency’s emergency use authorization for hydroxychloroquine — which was subsequently revoked — and for convalescent plasma, which has yet to be shown to be safe and effective for COVID-19.", "Of course, not all scientists are anxious that the government will authorize a vaccine without the necessary evidence. Dr. Peter Hotez, dean for the National School of Tropical Medicine at Baylor College of Medicine, told us in June that he had faith in the FDA not to release an insufficiently tested vaccine — a sentiment he still holds — but he was nevertheless concerned about the White House’s emphasis on speed.", "“The messaging coming out of the White House is extremely poor and detrimental,” he said, “so it’s actually fomenting distrust and creating a problem.”", "Importantly, there are no signs that the administration will deviate from its plan to authorize a vaccine only after the necessary phase 3 trial data are in.", "In Senate testimony on Sept. 9, National Institutes of Health Director Dr. Francis Collins said, “I can’t say strongly enough that the decisions about how this vaccine is going to be evaluated and assessed is going to be based on science.”", "“Science and science alone will be the way in which this decision is made,” he added. “Otherwise, I’ll have no part of it.”", "Fauci has made similar reassurances. He explained in a Sept. 3 CNN interview that the trials have independent data and safety monitoring boards that intermittently look at the data, and noted that the information would ultimately become public. “So I think that we can have some confidence and have faith in what the FDA is saying,” he said. “They’re saying very explicitly that they’re going to be making the decision based on the scientific data and we hope that that’s going to be the case.”", "In an interview with Science, Moncef Slaoui, the chief adviser of Operation Warp Speed, said there had been “absolutely no interference” in the process so far and vowed to resign if that changed.", "And on Sept. 8, the CEOs of all of the companies involved in the vaccines receiving U.S. governmental support pledged to make safety a “top priority” and only submit “for approval or emergency use authorization after demonstrating safety and efficacy through a Phase 3 clinical study that is designed and conducted to meet requirements of expert regulatory authorities.”", "Trump boasted of his unique ability to provide for a rapid coronavirus vaccine, saying in his Sept. 7 remarks that “if this were the Obama administration, you wouldn’t have that vaccine for three years, and you probably wouldn’t have it all.”", "At the North Carolina rally the following day, he repeated the idea. “This would have taken two or three years by the last administration, and in all fairness, by most other administrations,” he said. “We have upped it to a level that nobody even believes is possible, and totally safe.”", "He has previously made similar claims, including at another North Carolina rally and in remarks throughout August.", "It’s his opinion that he alone could pull off a vaccine in record time, but it’s premature to declare victory. And the idea that no other leader could do the same lacks support.", "As we’ve explained before, the key idea behind Operation Warp Speed, which is to manufacture a vaccine before it’s known to work so that it can more quickly be distributed if it ends up being approved, is not new. It was done in 2009 for the H1N1 influenza vaccine.", "Although the effort this time is much larger, given the greater concern of the coronavirus pandemic, there’s no reason to think a different president would not have come up with a similar strategy, as other countries and organizations are using the same approach now.", "Dr. Nicole Lurie, a former assistant secretary for preparedness and response under Obama, noted that similar vaccine efforts were underway in other places around the world and that good progress was being made by companies that didn’t get involved with the U.S. government until recently.", "“What the success is really due to is the success of science,” she said.", "Lurie, who now advises the Coalition for Epidemic Preparedness Innovations, an organization dedicated to developing vaccines to stop epidemics, including COVID-19, said that previous investments in science and experiences from past administrations are what have allowed a fast response in these extraordinary circumstances.", "“None of this response would have been possible without prior investments in science and technology,” she said.", "One key realization after the 2009 H1N1 pandemic, she said, was that existing vaccine technologies were simply too slow for pandemic situations. In 2010, the president’s Council of Advisors on Science and Technology released a report recommending more investment and focusing on more rapid vaccine methods.", "After that report, Lurie said, there started to be investments, largely by NIH, to develop new vaccine platforms, which are bearing fruit today.", "A New York Times article also explains that work underpinning Johnson & Johnson’s viral vector COVID-19 vaccine goes back more than a decade, including efforts to create a Zika vaccine before Trump came into office.", "Collins, the NIH director, also noted during his Sept. 9 testimony on vaccines that the preparation effort has been decades in the making. “There were things that Congress had done over the past couple of decades, the creation of BARDA, other things that you’ve mentioned, that made it possible to move more swiftly now,” he said.", "The Biomedical Advanced Research and Development Authority, or BARDA, which is spearheading the development and manufacture of COVID-19 vaccines, was created by legislation President George W. Bush signed into law in 2006.", "While Trump should get some credit for Operation Warp Speed, there’s no support for his claims that other administrations wouldn’t be able to achieve similar results.", "Trump also exaggerated the progress of vaccine trials in his Labor Day press conference.", "“If you talk to your sources in the FDA, you’ll see it’s going very, very well,” Trump told a reporter when being asked to elaborate on his comments on Biden and Harris. “The numbers are looking unbelievably strong, unbelievably good.”", "Later, he continued: “You know, we have 30,000 people, in just one vaccine right now, under test in very, very highly infected areas. So we’re going to be able to get a good result, one way or the other, very soon.”", "No vaccine company has yet reached its enrollment goal of 30,000 participants for its phase 3 trial, although one is close.", "As of Sept. 7 — the day Trump made his remarks — Pfizer/BioNTech had enrolled 25,189 volunteers in 39 states, and Brazil and Argentina.", "As of Sept. 4, Moderna had enrolled 21,411 participants, all within the U.S. That day, the CEO said the company wanted to increase minority participation in the trial, even if that meant slower recruitment.", "The third company currently performing a phase 3 trial in the U.S., AstraZeneca, began a trial in America on Aug. 31, but has not yet started recruitment. On Sept. 8, the company put its trial on hold to investigate a potential adverse reaction in a U.K. woman.", "Although the idea is to test multiple candidates to make it more likely that at least one vaccine will prove successful, there is no guarantee that any of the vaccines being tested will work, despite Trump’s claim that there will be “a good result, one way or the other, very soon.”", "It’s unclear whether Trump means enrollment figures or trial data when he said the “numbers are looking unbelievably strong.” We asked the White House for clarification, but did not hear back.", "Since the studies are double-blind, neither the president nor anyone within the companies or the FDA knows how well the vaccine is performing in the phase 3 trials so far. The only people privy to that information are those on the data and safety monitoring boards.", "During the Labor Day presser, Trump argued with a reporter about his past statements on when to expect a vaccine, saying that he said “by the end of the year,” not that there “will” be a vaccine earlier.", "“I didn’t say what you said,” Trump insisted. “What I said is ‘by the end of the year.’ But I think it could even be sooner than that. It could be during the month of October, actually. Could be before November.”", "We looked through Trump’s past comments on a vaccine, and did not find any cases in which he declared a vaccine would definitely be available by October or November. But he has suggested that the earlier time frame is even more likely. Experts and governmental officials disagree with that assessment.", "Since May, Trump has been saying a vaccine will be ready “very soon,” usually without specifying what that means. But at a press briefing on Sept. 4, Trump suggested that a vaccine was probable by October.", "“We remain on track to deliver a vaccine before the end of the year and maybe even before November 1st,” he said. “We think we can probably have it sometime during the month of October.”", "That evening at a rally in North Carolina, Trump was even more explicit. “It’ll be delivered, the vaccine, before the end of the year and frankly, maybe even during the month of October. I think October is even more likely.”", "In August, the president also said that he thought it was likely a vaccine would be ready around Nov. 3. “I’m optimistic that it’ll be probably around that date,” he said. “I believe we’ll have the vaccine before the end of the year certainly, but around that date, yes. I think so.”", "Even in his comments on Labor Day, Trump focused on the earlier dates, mentioning them more frequently than the end of 2020. “[I]t’s going to be done in a very short of period of time,” he said. “Could even have it during the month of October.”", "“So we’re going to have a vaccine very soon, maybe even before a very special date,” he said at another point, referring to the election. “You know what date I’m talking about.”", "Experts disagree with Trump’s rosiest predictions. In an interview with PBS on Sept. 8, Fauci said it was “unlikely” a vaccine would be available by Election Day, and that an answer about how well a vaccine works is “more likely by the end of the year.”", "“I do have cautious optimism that by the end of 2020, at least one of these vaccines will have emerged and turned out to be safe and effective,” NIH head Collins said in his Sept. 9 congressional testimony. “But even that is a guess. And certainly to try to predict whether it happens on a particular week, before or after a particular date in early November, is well beyond anything that any scientists right now could tell you and be confident that they know what they’re saying.”", "The CEO of Pfizer also clarified his earlier statement that he expected to know whether his vaccine works by the end of October, explaining on NBC’s “Today” on Sept. 8 that the time frame was not the same as having shots ready to go into people’s arms.", "“Right now, our model, our base case, predicts that we will have an answer by the end of October. Of course, this is only a prediction,” he said. “And that is only an answer.”", "Slaoui, the Operation Warp Speed adviser, told NPR on Sept. 3 that there was a “very, very low” chance that the trials would provide results by the end of October. Instead, he suggested, it was more realistic to think there would be a limited number of vaccine doses for high-risk groups available by the end of the year, ramping up to cover the rest of the population by the middle of 2021.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]