["About this rating", "On Jan. 18, 2020, Empire News published an article with a headline positing that former first lady Michelle Obama had filed for divorce from former U.S. President Barack Obama after the latter admitted that he was gay:", "Michelle Obama Files For Divorce After Shocking Revelation; Barack Obama Admits: ‘I’m Gay!’", "Former President Barack Obama announced late last night that he had filed for divorce from his wife of 27 years, Michelle Obama, after he revealed a secret double life as a homosexual.", "“It is with a bit of sadness and a whole lot of relief that I announce that Michelle and I have decided to separate, as I have admitted to her, as I’m doing now to the rest of the world, that I am a homosexual,” said Barack Obama. “This may come as a shock to many, and anger others, but this is my personal business, and I would hope that everyone could respect my privacy at this time”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Empire News is intended for entertainment purposes only. Our website and social media content uses only fictional names, except in cases of public figure and celebrity parody or satirization. Any other use of real names is accidental and coincidental.", "While this article originated on a website that carried a disclaimer labeling its content as fiction, this article was later shared on websites, such as the Snowflakes Forum, which carried no such disclaimer. This article may have also received a boost in popularity after it was published by WitTheShit, a group whose stated purpose is to sow \"discord on the Internet by starting arguments or upsetting people, by posting inflammatory, extraneous, or off-topic messages in an online community (such as a newsgroup, forum, chat room, or blog) with the deliberate intent of provoking readers into an emotional response or of otherwise disrupting normal on-topic discussion. 7.2 million strong We are Declaring a satire WAR on EVERYONE!\"", "For background, here is why we sometimes write about satire/humor.", "Empire News.   \"Michelle Obama Files For Divorce After Shocking Revelation; Barack Obama Admits: ‘I’m Gay!’\"\r\n    18 January 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]