["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "UPDATE 6:15 p.m., Sept. 26, 2014: We revised the story below to note that at a Sept. 23, 2014, forum Wiley said almost 1,000 workers have six-figure salaries. This additional information, pointed out by a reader, didn't change our rating of the claim we checked.", "Rich rich rich! City of Austin employees strike it rich!", "Sorry. We got carried away by a claim at a forum for Austin City Council candidates thrown by the League of Women Voters and the City of Austin.", "According to an Austin American-Statesman news story posted online Sept. 16, 2014, a council candidate, lawyer Jay Wiley, said the day before there’s room in the city budget to staff offices in each of the 10 newly created single-member districts.", "Wiley, running in District 6 in Northwest Austin, also said at the forum: \"We’ve got, actually, over 1,000 city employees that make six-figure salaries.\"", "Does that add up?", "We failed to reach Wiley to learn the origin of his figure.", "Meantime, city spokeswoman Melissa Alvarado emailed a chart indicating that as of Sept. 1, 2014, 879 workers earned from $100,089 to $304,657. To follow-up queries, Alvarado sent a chart listing 24 vacancies at that time for positions paying $100,000 or more.", "So, you could say the city had 903 positions paying six figures at the time Wiley spoke. Alvarado said the city then had 11,852 workers, which means its $100,000-plus earners accounted for 7 percent of its workers.", "Plus, more workers were heading into the six-figure class shortly. To our inquiry, Alvarado said 3.5 percent raises taking effect Sept. 21, 2014, (before the start of the new fiscal year in October) would result in 1,162 employees earning $100,000 or more. At that time, she said, the city expected there to be another 36 open positions paying more than $100,000 each.", "So at that time, the city projects, 1,198 positions will pay six figures. Alvarado said the city had 12,780 positions budgeted for fiscal 2015.", "We also looked at which city workers make the most. Peruse that sampling below.", "Top-Paid Employees", "City of Austin", "Sept. 1, 2014", "NAME", "TITLE/DEPARTMENT", "SALARY", "Larry Weis", "General Manager/Austin Energy", "$304,657", "Marc Ott", "City Manager", "$269,755", "Paul Hinchey", "Medical Director/EMS System", "$246,688", "Michael McDonald", "Deputy City Manager", "$220,126", "Cheryl Mele", "Chief Operating Officer/Austin Energy", "$211,494", "Kerry Overton", "Deputy General Manager, Shared Services/Austin Energy", "$211,494", "Sue Edwards", "Assistant City Manager", "$203,860", "Robert Goode", "Assistant City Manager", "$203,860", "Humberto Lumbreras", "Assistant City Manager", "$203,860", "Anthony Snipes", "Assistant City Manager", "$203,860", "Reynaldo Arellano", "Assistant City Manager", "$200,116", "Art Acevedo", "Police Chief", "$199,118", "Claire Hart", "Chief Financial Officer", "$206,003", "Elizabeth Little", "Senior Vice President/Austin Energy", "$202,716", "Jose Cabanas Rivera", "Deputy Medical Director, Office of the Medical Director", "$200,969", "Source: Information provided by City of Austin, September 2014. The full chart is here.", "After we initially posted this fact check, a reader pointed out thar Wiley said at a Sept. 23, 2014, forum the city has \"almost 1,000\" workers earning six-figure salaries.", "Our ruling", "Wiley said more than 1,000 city workers make six-figure salaries.", "When he spoke, 879 workers earned more than $100,000, meaning he overshot. Then again, raises were about to take effect lifting workers in this pay category to 1,162.", "We rate the statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Chart showing City of Austin workers earning over $100,000, Sept. 1, 2014 (edited by PolitiFact Texas to eliminate duplicate entries); Chart showing City of Austin employees projected to earn over $100,000, effective Sept. 21, 2014, including vacant positions (received by email, Melissa Alvarado, interim media relations manager, City of Austin Communications and Public Information Office, Sept. 17 and 19, 2014)", "Emails, Melissa Alvarado, interim media relations manager, City of Austin Communications and Public Information Office, Sept. 19-22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]