["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo that shows Kurt Russell and Goldie Hawn wearing Trump t-shirts is doctored.", "The photo first appeared in an article about the couple’s relationship in September 2015.", "An old image showing Kurt Russell and Goldie Hawn wearing t-shirts with President Donald Trump’s name and face on them, with a post claiming that the two Hollywood stars are big Trump supporters, has resurfaced yet again.", "The July 27, 2016, Facebook post shows a photo of the two walking arm in arm, with Russell wearing a shirt that says \"I’ve jihad it.\" Under the slogan on the shirt is an image of Trump shooting a gun and the word \"ISIS\" inside a circle-backslash symbol, referring to the Islamic State militant group. Hawn’s shirt says \"Trump 2016.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A reverse search of the image shows it to be doctored, and PolitiFact previously reported on this same photo in November 2018, rating it Pants on Fire.", "The original photo was taken in September 2015, while the two actors were walking in Los Angeles, according to an article from PopSugar. The photo with that article, credited to Getty/Bauer-Griffin, shows Hawn wearing a blank shirt and Russell’s shirt with just a small business logo.", "The altered version previously surfaced on social media during Trump’s 2016 presidential campaign. Around the same time, another Facebook post falsely attributed a tweet praising Trump to Russell, and our reporters rated it Pants on Fire.", "A photo posted to Facebook shows Kurt Russell and Goldie Hawn walking arm in arm wearing Trump t-shirts. A reverse image search found the photo to be doctored. We rate this Pants on Fire.", "Facebook post, photo showing Kurt Russell and Goldie Hawn, July 27, 2020", "PolitiFact, Photo of Kurt Russell in Trump T-shirt is doctored, Nov. 6, 2018", "PopSugar, Kurt Russell and Goldie Hawn Show Us All What True Love Looks Like, Sept. 12, 2015", "PolitiFact, No, Kurt Russell did not Tweet that Trump is ‘relentless,’ ‘dedicated,’ ‘determined’ and ‘brave,’ Nov. 6, 2018", "Snopes, Is This a Photograph of Goldie Hawn and Kurt Russell in Donald Trump Campaign Shirts?, May 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]