["About this rating", "Immigration and Customs Enforcement had detained Lukasz Niec and begun removal proceedings against him.", "Niec has not yet been deported, and it's uncertain whether that will actually happen.", "In late January 2018, several reliable news outlets reported that U.S. Immigration and Customs Enforcement (ICE) had detained a doctor in Kalamazoo, Michigan, 40 years after he emigrated from Poland to the United States.", "One web site, Washington Press, went a step further, claiming in their headline \"Trump's ICE just deported a doctor living in the U.S. for 40 years.\" However, the text of the article contradicted the headline, making it clear that the doctor had not been deported, but was in immigration detention.", "The doctor, Lukasz Niec, is a green card holder who has a was reportedly convicted of two misdemeanors in 1992: malicious destruction of property under $100; and receiving and concealing stolen property over $100. His second conviction was later expunged from his record.", "Niec’s sister, Iwona Niec Villaire, told the Washington Post, “It’s shocking . . . No one can really understand what happened here.” She told CNN that Niec does not even speak Polish.", "While news of the doctor’s detention surprised many, Sarah Pierce, an associate policy analyst at the Migration Policy Institute, called it “something that happens all the time.” She told us:", "An expunged conviction doesn’t really matter in the world of immigration. It’s still an issue on your record. In fact a lot of people have to go back and get previously-expunged crimes un-expunged when they apply for naturalization because the immigration agency needs to see what that crime was and whether or not it renders you ineligible to apply for naturalization.", "The Immigration and Nationality Act, which gives parameters for the detention and removal of immigrants, even those who are in the U.S. legally, allows the deportation of immigrants who have committed crimes “involving moral turpitude.”", "ICE officials said in a statement that Niec was “amenable to removal proceedings as a result of two 1992 state convictions for malicious destruction of property and receiving stolen property, both of which are crimes involving moral turpitude.”", "An ICE spokesperson told us that two convictions of this nature can make a lawful permanent resident subject to deportation regardless of the amount of time they have lived in the U.S.", "Pierce said that Niec could be eligible to apply for a “cancellation of removal.\" Lawful permanent residents can avoid deportation if they can prove that his deportation would cause what the Justice Department calls “exceptional and extremely unusual hardship” to dependents who are U.S. citizens or lawful permanent residents.", "The Justice Department also stipulates that cancellation of removal is possible for residents whose records do not include aggravated felonies.", "Niec's employer, Bronson Healthcare, issued a statement supporting a speedy resolution to the situation:", "While Bronson Healthcare, like others, respects the laws and regulations concerning United States immigration, we are following the situation surrounding the detention of Dr. Lukasz Niec closely and are doing everything we can to advocate for Dr. Niec. We have been in contact with our elected representatives and we have our immigration counsel coordinating with Dr. Niec’s attorney to explore all options to secure his prompt release from detention.\n\n[...]\n\nSince 2007, Dr. Niec has been a skilled and caring physician, a valued employee and respected member of the Bronson medical staff. His detention in a county jail while awaiting deportation proceedings simply does not make sense. Given all that he has contributed in the form of exemplary patient care, and Bronson’s ongoing need for Dr. Niec’s continued service as a hospitalist, we are requesting the community’s best interest be considered and he be allowed to return to work and his family as soon as possible.", "At press time, Niec was still in ICE detention and had not been deported. It is unclear how long Niec will stay in detention. A 2001 court ruling allows ICE to hold immigrants in detention for up to six months before deporting or releasing them, though on occasion immigrants find themselves held for much longer.", "Deiters, Barton.   \"Kzoo Doctor Detained By ICE After 40 Years In US.\"\r\n    WOTV.   20 January 2018.", "Grinberg, Emanuella.   \"ICE Detained a Michigan Doctor Who Left Poland in 1979, And His Family Wants to Know Why.\"\r\n    CNN.   23 January 2018.", "Longobardo, Vinnie.   \"Trump’s ICE Just Deported a Doctor Living in the U.S. for 40 Years.\"\r\n    Washington Press.   21 January 2018.", "Schmidt, Samantha.   \"ICE Detains Polish Doctor and Green-Card Holder in Michigan Who Has Lived in the U.S. for Nearly 40 Years.\"\r\n    Chicago Tribune.   22 January 2018.", "Associated Press.   \"Immigrants Face Long Detention, Few Rights.\"\r\n    NBC News.   15 March 2009.", "Kim LaCapria is a former writer for Snopes.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]