["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama’s health care reform law is supposed to give millions more Americans access to affordable health insurance, right?\n\nEric Hovde, a 2012 Republican candidate for the U.S. Senate, claims it will have the opposite effect.\n\nIn a blog post published March 27, 2012, the Wisconsin businessman and political newcomer wrote about the law and a legal challenge to it that the U.S. Supreme Court is scheduled decide in June 2012:\n\n\"You see, Obamacare doesn’t just further bankrupt our nation, raise taxes and deny millions of Americans access to affordable insurance — it flies directly in the face of our Constitution.\"\n\nLet’s check what seems like a counterintuitive claim: That the Affordable Care Act denies \"millions of Americans access to affordable insurance.\"\n\nTwo preliminary points.", "-- If the 2010 law is upheld by the court, most of its changes won’t take effect until 2014. That includes a requirement that nearly all people buy health insurance and the creation of insurance \"exchanges\" where people can buy health insurance, in some cases with a federal subsidy.", "-- As PolitiFact National noted in a similar claim made by Republican National Committee chairman Reince Priebus, the law is expected to increase the number of people with health insurance. The Congressional Budget Office, the nonpartisan number-crunching arm of Congress, projects the number of uninsured Americans will be 29 million to 31 million lower than it would otherwise be without the law.", "Asked to back the claim, Hovde campaign press secretary Sean Lansing cited Congressional Budget Office projections, as well as a news article about two national surveys of employers.\n\nCongressional Budget Office\n\nLansing said the CBO projected in a March 2012 report that as many as 20 million Americans will lose their employer-provided coverage after the health reform law takes full effect.\n\nBut that’s the worst-case of a series of scenarios presented by the budget office; in another scenario, the number of people who get employer-provided health insurance actually increases by 3 million.\n\nWhat’s important is the budget office’s baseline estimate, or best guess, which is that 3 million to 5 million fewer people in each year from 2019 through 2022 will get health insurance through an employer.\n\nBut, to be clear, that does not mean they won’t have access to insurance.\n\nEmployer surveys\n\nLansing provided an August 2011 Associated Press article that reported on two national surveys of employers. Both were conducted by benefits consultants.\n\nA Towers Watson survey found that nearly 1 in 10 midsize or large employers expect to stop offering health coverage to workers once federal insurance exchanges start in 2014. And a Mercer survey of large and smaller employers found that 8 percent were either \"likely\" or \"very likely\" to end health benefits.\n\nSo, potentially millions of workers could lose their employer-provided health insurance as a result of the reform law. Lansing argues that means those workers would be denied access to affordable health insurance.\n\nBut that’s not the whole story.\n\nUnder the law, workers whose employers stop offering health insurance would have other options.\n\nAs our colleagues noted in the Priebus item, which was rated Half True:\n\n\"The people who lose insurance this way won’t, for the most part, be left without insurance options. They should have access to coverage on the exchanges, perhaps with subsidies. And depending on their income level, they may have access to Medicaid or the State Children’s Health Insurance Plan, which were expanded as part of the law.\n\n\"Indeed, health care experts say that a big reason why companies may drop coverage is specifically because their employees will be able to go onto the exchanges and get guaranteed, and in many cases, subsidized coverage.\"\n\nBut there's an even more important point.\n\nHovde’s claim is that the law itself denies the access to affordable care. In the scenarios he cites, it is the employer who would be deciding to drop the employer-sponsored plan.  \n   \nOur rating\n\nHovde said Obama’s health care reform law denies \"millions of Americans access to affordable\" health insurance.\n\nOnce the law takes full effect, some employers are expected to stop providing health insurance to their employees. But that's not the same as the law denying people access to affordable health insurance, particularly since other options for obtaining such insurance will be available.\n\nWe rate Hovde’s claim False.", "Patch.com, Eric Hovde blog post, March 27, 2012\n\nInterview and email interview, Hovde campaign press secretary Sean Lansing, March 29 and April 3, 2012\n\nPolitiFact.com, \"Senate Republican web video attacks Barack Obama, saying he increased health care premiums,\" March 26, 2012\n\nPolitiFact.com, \"Reince Priebus says health care law could mean ‘as many as 20 million Americans could lose their employer-based insurance,’\" March 23, 2012\n\nMilwaukee Journal Sentinel, \"Hovde joins Republican race for U.S. Senate,\" March 8, 2012\n\nMilwaukee Journal Sentinel, \"Employers weigh next step in health care,\" Feb. 19, 2011\n\nWhiteHouse.gov, Affordable Care Act’s \"Better access to care\"\n\nU.S. Department of Health and Human Services, Affordable Care Act timeline\n\nCongressional Budget Office, \"CBO and JCT’s estimates of the effects of the Affordable Care Act,\" March 2012\n\nAssociated Press, \"Survey: Almost 10% of employers may end health insurance,\" Aug. 24, 2011\n\nEmail interview, Barack Obama Wisconsin campaign press secretary Gillian Morris, April 4 and 5, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]