["About this rating", "In the U.S. Supreme Court case of Caniglia v Strom, the Acting Solicitor General's Office argued that the court should declare it constitutional for police to enter a home and seize property, without a warrant, \"when a serious threat to lives or health justifies immediate intervention,\" in certain circumstances.", "The government did not argue for a blanket, indiscriminate authorization for police to enter homes and seize property in any set of circumstances, as some news headlines suggested.", "In March 2021, Snopes readers asked us to examine the accuracy of articles that claimed the administration of President Joe Biden, in particular his Justice Department, had urged, or would be urging, the U.S. Supreme Court to allow police officers to enter a home and seize firearms from it, without a warrant.", "On March 23, Forbes published an article with the headline \"Biden Administration Urges Supreme Court To Let Cops Enter Homes And Seize Guns Without A Warrant.\" The piece stated that:", "The U.S. Supreme Court on Wednesday will hear oral argument in Caniglia v. Strom, a case that could have sweeping consequences for policing, due process, and mental health, with the Biden Administration and attorneys general from nine states urging the High Court to uphold warrantless gun confiscation.", "On March 25, the Washington Examiner published an article with the headline \"Biden administration will tell Supreme Court that police can confiscate guns from homes without a warrant.\" That piece stated that:", "The Biden administration is set to argue to the Supreme Court that police should be allowed to confiscate guns from a person’s home without a warrant.", "Newsbreak later re-published that Washington Examiner article. While the articles themselves contained substantial nuance and detail, their headlines risked misleading readers because they represented the specific constitutional question at stake in the Caniglia case, and the Biden administration's particular arguments, in an overly broad manner. As such, we are issuing a rating of \"Mixture.\"", "The following details and sequence of events are largely taken from the U.S. Court of Appeals First Circuit opinion, dated March 13, 2020. The case began on the evening of Aug. 20, 2015. Edward and Kim Caniglia, a married couple, had an argument at their home in Cranston, Rhode Island. At one point, Edward (to whom we will refer as \"Caniglia\" from now on) went to the bedroom and retrieved a handgun, placed it on the dining room table, and said words to the effect of \"Shoot me now and get it over with.\"", "Caniglia later characterized this as no more than a \"dramatic gesture,\" but his wife took it seriously at the time. Caniglia went for a drive to calm down, and she put the gun back in the bedroom, hiding the magazine that went with it. When Caniglia returned, the argument resumed, so she left and stayed at a hotel that night. The next morning, she could not reach her husband by phone, became concerned that he might have killed himself, and called Cranston police to ask for an officer to accompany her to her home, because she was concerned for her husband's well-being and \"afraid of what [she] would find when [she] got home.\"", "Cranston police first contacted Caniglia by phone, then spoke with him on the back porch of the house. Although he denied feeling suicidal, Cranston police ultimately determined that, based on all the factors mentioned above, he did pose a risk to himself, and after some back and forth, managed to persuade him to go to a local hospital for a psychiatric evaluation. Caniglia later said he only agreed to this because the officers promised they would not confiscate his guns while he was out of the house, but that claim is not corroborated by any evidence.", "Cranston police then seized two handguns and ammunition that belonged to him. There is a dispute over whether his wife had asked the officers to take those guns, and whether she directed them to the location of the weapons only after they falsely told her her husband had given them his consent.", "Caniglia was released from the hospital and returned home, and Cranston police did not begin any criminal investigation on the basis of the incident. However, they persistently failed to return his guns and ammunition, despite several requests. In October, his attorney formally requested their return, and Cranston police eventually handed them back in December 2015.", "Caniglia sued the city of Cranston, which was represented by its finance director Robert Strom (the \"Strom\" in the subsequent Supreme Court case). Caniglia argued, among other claims, that police had violated his Fourth Amendment privacy rights and his Second Amendment right to bear arms. (The Fourth Amendment claim forms the basis of the ongoing Supreme Court case, so that will be our focus here.) A U.S. District Court dismissed all but one of Caniglia's claims, and he appealed before the U.S. Court of Appeals First Circuit.", "The respondents (the city of Cranston, the police officers involved, and others) argued that their seizure of his weapons was justified under a doctrine known as \"community caretaking\" (more on that below). The First Circuit agreed in March 2020, and the District Court ruling was allowed to stand. In September 2020, Caniglia petitioned the U.S. Supreme Court to hear the case, and in November 2020 the court agreed. Oral arguments were heard on March 24, 2021.", "In principle, searches and seizures require either a warrant or the consent of the individual affected. Without those elements, they are by default unconstitutional violations of the Fourth Amendment, which states that:", "The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no warrants shall issue, but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.", "However, over the decades, federal court precedents have mapped out some important exceptions to the warrant and consent requirements. One is the \"exigent circumstances\" doctrine, which holds that situations often exist in which it is impractical for a law enforcement officer to wait to obtain a warrant before intervening, for example where a serious or violent crime is likely taking place in that moment, a suspect is fleeing, there is a risk of physical harm to an officer or others, and so on.", "Another exception mapped out through court precedents is the \"emergency aid\" doctrine. Closely related to the exigent circumstances principle, this allows for officers to enter a home and/or execute a search if they have an \"objectively reasonable\" basis for thinking that a person is suffering ongoing harm inside a home, or that harm is imminent.", "A third exception is the \"community caretaking\" doctrine, which was first established in the 1973 Supreme Court case of Cady v. Dombrowski. In that case, Chester Dombrowski, an off-duty police officer, crashed his car in Wisconsin and went into a coma. Local police arranged for his vehicle to be towed and searched it in an effort to locate his service revolver and prevent it from falling into unauthorized hands. During that search, bloodied materials were found that formed part of a subsequent murder investigation. Dombrowski was tried and convicted of murder.", "His lawyers appealed, claiming the seizure and search of his vehicle was warrantless and unconstitutional, but the Supreme Court upheld his conviction and established the \"community caretaking\" doctrine, arguing that the seizure of his vehicle was \"reasonable\" under the Fourth Amendment, because it was clearly posing a danger to other motorists, and the search of his vehicle was also reasonable because it had been executed in order to secure Dombrowski's service weapon, and thereby preserve public order and public safety.", "In the majority opinion, Justice William Rehnquist wrote that:", "Local police officers, unlike federal officers, frequently investigate vehicle accidents in which there is no claim of criminal liability and engage in what, for want of a better term, may be described as community caretaking functions, totally divorced from the detection, investigation, or acquisition of evidence relating to the violation of a criminal statute.", "In their defense, the respondents in the Caniglia case cited the community caretaking doctrine, and not the exigent circumstances or emergency aid principles.", "Historically, the Supreme Court has viewed searches of a home differently to searches of a vehicle, in part because the mobile nature of vehicles means they are more likely to pose a hazard to the public, they are apt to be used to flee or to allow a suspect to continue committing an offense, the evidence they contain could be transported away from a police officer's custody, and so on.", "Previous Supreme Court cases involving the community caretaking principle have involved only vehicles, and not homes. The Caniglia case involves the use of the community caretaking doctrine in a situation involving a search of a home, and the seizure of property from it. So the question presented in Caniglia is \"Whether the 'community caretaking' exception to the Fourth Amendment's warrant requirement extends to the home.\"", "If the Supreme Court rules that the community caretaking principle does extend to the home, it could set a precedent meaning that warrantless, non-consensual searches of a home, and seizures therein, are constitutional in situations where a law enforcement officer has a reasonable belief that the action is required in order to prevent a specific harm from occurring, even if evidence is lacking that that harm is imminent — that is, the facts don't meet the \"exigent circumstances\" or \"emergency aid\" standards.", "If the court rules in Caniglia's favor, it could set a precedent that formalizes a distinction between vehicles and homes, when it comes to the constitutionality of the community caretaking principle. However, the court could also issue a narrowly tailored opinion, for example allowing for community-caretaking home searches only in cases where a risk of suicide exists. The details and parameters of the court's ruling, and its likely implications, remain to be seen.", "The Biden administration, in the form of the Justice Department and specifically Acting Solicitor General Elizabeth Prelogar, filed an \"amicus curiae\" brief in the Caniglia case on Feb. 18, 2021, arguing in support of the respondents. Iowa, Louisiana, Minnesota, Montana, Oklahoma, South Carolina, South Dakota, Texas, and Utah did likewise, on the same date.", "The solicitor general's brief, available here, frames the question before the court in a conspicuously narrow way, as follows:", "Whether the Fourth Amendment precludes government officials, who reasonably believe that a potentially mentally unstable person presents an impending threat of harming himself or others with a firearm, from a warrantless seizure of his person to facilitate a medical evaluation and of firearms from his residence to forestall potential harm to him or others.", "So the first thing to note is that in arguing for the respondents, the solicitor general was not asking the court to give blanket, indiscriminate authorization to police to arbitrarily enter homes and seize weapons without a warrant, in all manner of circumstances. The headlines in the news reports highlighted above — \"Biden Administration Urges Supreme Court To Let Cops Enter Homes And Seize Guns Without A Warrant\" and \"Biden administration will tell Supreme Court that police can confiscate guns from homes without a warrant\" — described the case in so broad and unspecific a way as to potentially mislead readers, for a few reasons.", "Firstly, it is already constitutionally permissible for a police officer to enter and search a home without a warrant, in the circumstances explained above, and the headlines risked giving readers the false impression that the Biden administration was asking the Supreme Court to break entirely new ground in this respect.", "Secondly, the Caniglia case relates to the specific question of whether a particular Fourth Amendment doctrine, the community caretaking principle that is already established as constitutionally permissible in relation to vehicle searches, extends beyond that to searches in the home. It would not create a situation in which all sorts of home searches, in all sorts of scenarios, regardless of the risks involved, suddenly become constitutionally permissible.", "Thirdly, the Biden administration, in its brief, framed its arguments even more narrowly than that, describing a scenario in which \"a potentially mentally unstable person presents an impending threat of harming himself or others with a firearm.\"", "In the brief, the solicitor general argued:", "Government officials may thus constitutionally enter a home when a serious threat to lives or health justifies immediate intervention, so long as those officials act in a reasonable manner tailored to addressing the particular threat that justified their entry. Petitioner’s contrary rule, which restricts warrantless home entries solely to emergencies that will necessarily reach their climax within moments, would preclude official action in a wide variety of serious situations in which society expects swift government intervention.", "The relative narrowness of the government's argument was reinforced in oral arguments on March 24, 2021, by Morgan Ratner, assistant to the solicitor general. Ratner reiterated that the government's focus was on scenarios where there was a risk of death or injury, and rejected hypotheticals raised by Chief Justice John Roberts, saying it would likely not be constitutionally permissible for a law enforcement or government official to enter private property in order to, for example, save a Van Gogh painting from a water leak inside a house, or to retrieve a cat from a tree located in an absent homeowner's yard.", "Rather than advancing the community caretaking exception, as such, Ratner outlined a kind of modified version of the exigent circumstances and emergency aid doctrines, expanding them to allow for scenarios in which life and limb are at risk, but that risk might not be imminent. In fact, at one point Ratner suggested the government would not necessarily insist on expanding the community caretaking doctrine to the home, if the court was willing to declare that the exigent circumstances and emergency aid standards need not be restricted only to cases of imminent risk:", "If you think that exigent circumstances and emergency aid are broad enough to cover circumstances in which it is reasonable to act now, even if we don't know that someone is going to be injured in mere moments, then we are perfectly fine with that test, and we think that test would cover circumstances like welfare checks and the current suicide threat. The problem is when you have lower courts, and Petitioner here, saying that those are really cabined to circumstances in which the emergency is going to come to a head in moments, and that's just too restrictive ...", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]