["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post inaccurately attributes a quote to special counsel Robert Mueller. We rate this Pants on Fire!", "Supporters of President Donald Trump have cast aspersions on special counsel Robert Mueller and his investigation into Russian interference in the 2016 presidential election. Amid the allegations, we found a suspicious Mueller quote that plays to some conspiracy theories around the probe.", "\"We must move as quickly as possible to a one-world government; a one-world religion; under a one world leader,\" a post published on Facebook on Feb. 11 reads.", "The text appears above a picture of Mueller speaking. It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Websites like Twitter and me.me have similar posts attributing the quote to Mueller. But after searching online, we couldn’t find any legitimate sources that Mueller actually said it.", "We did find several sources attributing the quote to someone with a similar name: Robert Muller, a former assistant secretary-general for the United Nations. The sources include a 2013 Facebook post and books like \"On the Way to the Future: Daniel’s Visions and the Believer’s Hope,\" published in 2014 from author Ray Stedman, a pastor from California writing about biblical prophecies.", "PolitiFact couldn’t confirm that Muller actually said this either. The United Nations did not immediately respond to questions about the quote’s authenticity, and we did not find a credible citation.", "What does seem clear is that a quote attributed to Robert Muller (one \"e\") has been co-opted by detractors of Robert Mueller (two \"e\"s). But as far as we can tell, the special counsel never said it.", "We rate this claim Pants on Fire!", "Facebook post, Feb. 11, 2019", "United Nations, Secretary-General’s remarks at Memorial Service for Robert Muller [delivered by Mr. Kiyo Akasaka, under secretary-general for communications and public information], March 11, 2011", "\"On the Way to the Future: Daniel’s Visions and the Believer’s Hope\" by Ray Stedman", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]