["By Lori Robertson", "Posted on September 1, 2020", "Democratic presidential nominee Joe Biden claimed President Donald Trump’s effort in court to nullify the Affordable Care Act would “take 100 million people with preexisting conditions and move them in a direction where they can’t get coverage.” But they wouldn’t all lose coverage, as the claim misleadingly suggests, barring highly unlikely circumstances.", "The figure is an estimate for the number of Americans, outside of Medicare and Medicaid, with preexisting conditions. Without the ACA, they’d lose the preexisting condition protections in that law, but to be at risk of being denied insurance, they would have to seek coverage on the individual market, where those without employer or public insurance buy plans.", "Only 6% of the population gets coverage on the individual market, while 49% have employer-based plans.", "Biden made that claim in an Aug. 27 interview on CNN. Four days later, in a speech in Pittsburgh, the former vice president repeated the figure but presented it differently, saying, “What about Trump’s plan to destroy the Affordable Care Act, and with it the protections for preexisting conditions? It impacts more than 100 million Americans.”", "The Trump administration has backed a lawsuit seeking to invalidate the ACA. The Supreme Court should hear arguments for that case — California v. Texas — in the fall, with a decision not expected until next year.", "The ACA increased protections for those with preexisting medical conditions, so doing away with it — in the absence of any new legislation — would have repercussions. The ACA prohibited insurers, in any market, from denying coverage, charging more or excluding coverage of certain conditions based on health status.", "Before the ACA, those buying plans on the individual market could face denials or higher premiums based on their health. Employer-based plans couldn’t deny insurance, before the ACA, but they could decline coverage for some preexisting conditions for a limited period, if a new employee had a lapse in coverage.", "While the ACA greatly increased protections for those with preexisting conditions, Democrats have used estimates for the number of Americans with such conditions in misleading ways, as Biden did in his CNN interview.", "Biden, Aug. 27: He’s still in court trying to get rid of the Affordable Care Act. Going to take 100 million people with preexisting conditions and move them in a direction where they can’t get coverage.", "The Biden campaign pointed us to a 2018 report by the consulting firm Avalere. It found that “102 million individuals, not enrolled in major public programs like Medicaid or Medicare, have a pre-existing medical condition and could therefore face higher premiums or significant out-of-pocket costs if the ACA’s pre-existing condition protections were repealed.”", "That’s half of all Americans — beyond those with Medicaid or Medicare coverage — who have preexisting conditions, including cardiovascular diseases, mental health disorders, obesity, diabetes and others.", "Chris Sloan, associate principal at Avalere and a co-author of the 2018 report, told us it’s not as if “suddenly” 100 million people wouldn’t be able to get coverage, or would see their premiums go up, if the ACA were eliminated.", "But he points out that “particularly right now due to COVID,” there are a lot of people losing their jobs, losing income or switching to other types of insurance coverage.", "The Urban Institute estimated that from April to December 10.1 million people would lose employer-sponsored coverage due to the COVID-19 economic downturn. Many would switch to insurance through another source, and others would become newly insured, primarily through Medicaid, leaving a net 2.9 million uninsured.", "The report estimated that about 700,000 people would join the individual market, offset by about 500,000 who would leave that market and mostly move to Medicaid coverage.", "The ACA expanded Medicaid eligibility, in the 38 states, plus Washington, D.C., that chose to implement the expansion. The law “is serving as a pretty big backstop” to the people who are losing their jobs, Sloan said, more so “than at any other point in the ACA history.”", "To be sure, more Americans could be seeking individual market coverage or finding themselves with a gap between employer-sponsored coverage this year or the next than would normally be expected.", "The ACA’s impact on employer plans, as it pertains to preexisting conditions, “matters a lot,” Sloan said, in the current economic environment caused by the coronavirus pandemic.", "As we’ve explained before, under HIPAA, the 1996 Health Insurance Portability and Accountability Act, employer-sponsored plans were prohibited from denying coverage or charging higher premiums based on health status (see Section 702).", "But HIPAA didn’t offer as much protection as the ACA. Employer plans could exclude coverage of certain preexisting conditions — not including pregnancy, however — for new employees for up to a year, if the workers had a gap in insurance coverage of more than 63 days.", "If a new employee had continuous coverage for at least a year before, there couldn’t be any coverage exclusions. But if the previous coverage had been for less than a year, say six months, the new plan could refuse to cover preexisting conditions for six months.", "There were also complicated HIPAA protections for people moving from employer plans to the individual market. If an individual had 18 months of continuous coverage and had exhausted eligibility for COBRA — which allows individuals to stay on their previous employers’ plan if they pay the full premium — an individual market insurer couldn’t deny coverage or exclude preexisting conditions. But the insurer could charge a higher premium.", "“People were certainly subjected to preexisting condition clauses and could be for up to a year,” Timothy Jost, the Robert L. Willett Family Professor of Law emeritus at Washington and Lee University School of Law, told us when we wrote about this issue in 2018.", "The ACA did away with those complex rules, instituting blanket protections against coverage exclusions or charging more based on health status.", "All told, the ACA reduced the number of uninsured by about 20 million, according to a few estimates. The Congressional Budget Office estimated in 2017 that if the ACA were repealed and not replaced with new legislation, the uninsured would increase by 32 million over 10 years. (However, “some people would choose not to have insurance,” CBO said, because they had coverage in order to avoid a penalty. That penalty was eliminated effective in 2019.)", "Trump has said he would require insurers to cover preexisting conditions, but it’s unclear what a Republican replacement plan for the ACA might be. The president backed a 2017 GOP health care bill that would lead to 24 million more uninsured in 2026, according to an analysis by the CBO and Joint Committee on Taxation.", "Those estimates aren’t about preexisting conditions, but they do give a sense of the impact of the ACA on the number with insurance. None of the figures is close to 100 million.", "In an October 2019 report, the Kaiser Family Foundation estimated that 27% of nonelderly adults, or 53.8 million people in 2018, had a medical condition “that would likely to have caused them to be denied coverage if they applied for non-group health insurance prior to the effective date of the ACA.” So, if the ACA protections were eliminated and if all of those people sought coverage on the individual, or nongroup, market, they could be denied coverage, according to KFF’s estimate.", "The Biden campaign pointed out to us that the 100 million would be at risk of not being able to get coverage — but, again, those Americans would have to be seeking coverage on the individual market to be denied an insurance plan outright.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]