["About this rating", "As of this writing, Five Guys has not explicitly corroborated the police version of events.", "In July 2020, amid a new wave of nationwide protests over racial injustice and police brutality, readers asked us to examine the accuracy of news reports and social media posts that claimed a Five Guys burger restaurant in Daphne, Alabama, had refused to serve police officers.", "On July 8, local television news channels WALA, WPMI, and WKRG broadcast reports that all relayed the claims of Daphne Police Department (PD) officers, who said they had entered the Five Guys restaurant at the Jubilee Square shopping center in Daphne on the previous evening, but employees there had refused to serve them. One officer reportedly heard a Five Guys employee remark to their colleagues, \"I'm not serving them.\"", "The three local outlets also published articles on their websites about the incident. At the time, Five Guys provided the following statement:", "Five Guys and the Franchisee of the Daphne, AL location were made aware of reports that local Police Officers had been denied service by employees at that location. Five Guys and the franchisee are actively investigating the situation and are committed to getting to the bottom of it. However, no matter what the details are, we do not want these police officers, or any customer, to feel disrespected or slighted in anyway. We apologize to those officers and also want to make it clear that Five Guys and its franchisees are committed to fair, respectful, and equal treatment for all customers. We will continue to investigate the matter. Additionally, if there are questions about masks, the three officers who entered the restaurant were wearing masks.", "In a statement, Daphne PD also clarified that the officers involved were wearing face masks at the time they were allegedly refused service.", "Some social media users misrepresented the alleged incident in Daphne, Alabama, calling for a boycott of all Five Guys restaurants on the false premise that the company had a policy of refusing service to police officers.", "On July 10, Five Guys announced that some of the employees in question had been fired, and some had been suspended:", "Five Guys and the Daphne, AL franchise want to thank the Daphne Police Department for their support in working together toward a resolution. The actions the Daphne, AL franchise have taken include termination and suspension of the employees involved. The store has temporarily closed for further education and customer service training with a representative from the Daphne Police Department and will reopen at 4PM today, July 10th. As we uphold our commitment to fair, respectful, and equal treatment for all customers, please know that the actions and sentiments of a few employees in Daphne, AL do not represent Five Guys or the local franchisee.", "According to WALA, an unnamed police source had confirmed that several officers had indeed been refused service by Five Guys employees and that the officers claimed those employees had turned their backs towards them. Neither Daphne PD's nor Five Guys' formal statements provided any details on what had actually taken place in the restaurant on July 7, with the police account saying only that, \"The events that occurred while the officers were in the restaurant were unfortunate.\"", "However, Snopes has obtained a written statement from a Daphne PD spokesperson. We asked whether the officers had been refused service because of their status as police officers or for some other incidental reason. In response, the spokesperson told us that:", "\"Regular customers were served immediately before and immediately after the officers left the restaurant. When the officers came in the establishment, they were refused service by two employees that were directly responsible for taking orders. Two of the officers involved overheard one of the employees make the statement 'I'm not serving them.' After hearing this statement, the officers left the restaurant without incident.\"", "The spokesperson indicated they could not confirm that some employees had \"turned their backs\" on the officers because of the presence of line cooks at the restaurant, who may not have been aware of the officers' arrival and therefore may have remained with their backs turned at all times, anyway.", "The spokesperson also praised the response of Five Guys management and added: \"The resulting backlash the restaurant endured as a result of this event was very unfortunate and I want to make it clear that we do not hold the restaurant responsible for the actions of a select few employees.\"", "The fact that Five Guys has disciplined and fired several employees certainly indicates that an incident of note occurred on July 7, but so far the company has not actually corroborated the version of events presented by Daphne PD.", "We asked the company whether they could confirm that some of its employees at the Jubilee Square restaurant did in fact refuse to serve police officers, whether they had turned their backs on the officers, whether any refusal had been on the basis of the would-be customers' status as police officers, the number of employees fired and suspended, and details on the investigative steps the company took before firing and suspending the employees. Despite making several attempts to contact Five Guys, we did not receive a response of any kind.", "Without the company's corroboration of the version of events presented by Daphne PD, we cannot conclude that Five Guys employees in Daphne did, in fact, refuse to serve local police officers, and that they refused to serve them because they are police officers. As such, we are issuing a rating of Unproven. If we receive corroborating evidence or a corroborating statement from Five Guys, or the employees involved, we will update this fact check accordingly.", "WALA.  \"Daphne Police Release Statement on Incident at Five Guys.\"\r\n    8 July 2020.", "Williams, Debbie.  \"Investigations Underway in Five Guys Slight to Daphne Officers.\"\r\n    WKRG.  8 July 2020.", "Gordon, James.  \"Daphne Police, Five Guys Issue Statements on Alleged Incident Involving Employees.\"\r\n    WPMI.  8 July 2020.", "Daphne Police Department (Alabama)/Facebook.  \"Statement -- The Daphne Police Department Appreciates...\"\r\n    8 July 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]