["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fairfax County voters next month will replace Republican Del. Barbara Comstock, who won the 10th District congressional seat this fall.", "Democrat Kathleen Murphy recently launched a bid for the seat Comstock will leave in the state legislature. In a three-page platform, Murphy calls for \"reasonable\" gun regulations and explains her position in personal terms. \"I lost my brother to gun violence,\" she wrote. \"Two gunmen robbed and murdered him. He was the father of five young children...\"", "Murphy said she wants to close the \"gun show loophole\" through which people can buy guns from private gun sellers without a background check. She suggested that even the National Rifle Association could back that proposal.", "\"The NRA supported background checks after the tragedy of 9-11,\" she wrote on her website.", "We wondered if Murphy’s statement was correct. After we asked, Morgan Finkelstein, spokeswoman for the Democratic Party of Virginia, told us Murphy made a mistake. The candidate had meant to say the NRA supported background checks after the 1999 shootings at Columbine High School in Littleton, Co. that killed 13. That was two years before the World Trade Center attack.", "Murphy promptly took down the statement from her website. A few days later, she replaced it with the statement, \"The NRA supported background checks after the tragedy at Columbine High School.\"", "Rather than haggle over when the NRA might have supported background checks, we decided to examine the key issue raised by Murphy: Did the NRA ever support background checks?", "Our colleagues at PolitiFact national looked at similar claims that were made last year by President Barack Obama and New York Mayor Michael Bloomberg. The statements were based on congressional testimony by NRA executive vice president Wayne LaPierre on May 27, 1999 -- five weeks after the Columbine shootings.", "\"We think it’s reasonable to provide mandatory instant criminal background checks for every sale at every gun show. No loopholes anywhere for anyone,\" LaPierre told the House Judiciary Committee Subcommittee on Crime. \"That means closing the Hinckley loophole so the records of those adjudicated mentally ill are in the system. This isn’t new, or a change of position, or a concession. I’ve been on the record on this point consistently, from our national meeting in Denver, to paid national ads and positions papers, to news interviews and press appearances.\"", "At the time, Congress was considering legislation to expand background checks. LaPierre outlined a series of proposals that the NRA found \"reasonable,\" including \"instant background checks.\"", "But the crux of his testimony was that he found provisions of the legislation unreasonable, such as the way the bill defined a gun show, how it allowed a three-business day period for background checks of potential gun buyers, and that the instant background check system didn’t destroy records of guns sales immediately.", "The NRA eventually backed a substitute proposal that would have expanded background checks. The bill extended the requirement, which affected only licensed firearm dealers, to individuals selling their personally-owned weapons at gun shows.", "But in return for closing the loophole, the NRA-backed bill shortened the time for completing background checks to 24 hours. That led to the death of the bill, with opponents saying the 24-hour deadline would drastically weaken the checks.", "The Washington Post Fact Checker wrote last year that the NRA’s background check proposal was so limited that many control advocates concluded it was a \"sham.\"", "LaPierre’s testimony came up again last year amid the gun control debate that unfolded after shootings at Sandy Hook Elementary School in Newton, Conn. that killed 26.", "In a January 2013 interview, CNN Anchor Anderson Cooper read LaPierre’s testimony and asked Sandy Froman, an NRA board member, whether the group had changed its mind on background checks.", "\"Yes, the NRA has changed its position, and the reason it changed its position is because the system doesn’t work. The (National Instant Criminal Background Check) system is not working now. We have to get that working before we can add any more checks to that system. It’s already overburdened,\" Froman said. \"Let’s get it working. Let’s make sure that the 23 states that aren’t reporting the names of people who are mentally ill and have violent tendencies, let’s get those reported and into the system and then we can take a look.\"", "Our ruling", "Murphy said the NRA once supported background checks.", "It’s correct that LaPierre, the group’s executive director, did testify after the 1999 Columbine tragedy that the NRA supported \"mandatory instant criminal background checks for every sale.\"", "But Murphy’s version of that event is rosy. There were caveats to LaPierre’s statement and many gun control advocates later that year would accuse the NRA of scuttling legislation to expand background tests.", "So Murphy’s statement is accurate, but needs more information. We rate it Mostly True.", "Kathleen Murphy for Delegate website accessed Nov. 18, 2014.", "Interview with Morgan Finkelstein, spokeswoman for the Democratic Party of Virginia, Nov. 19, 2014.", "Email from Morgan Finkelstein, Nov. 19, 2014.", "PolitiFact, \"Michael Bloomberg: NRA used to support more background checks,\" March 26, 2014.", "PolitiFact, \"Barack Obama says ‘the NRA used to support expanded background checks,’\" April 18, 2013.", "PolitiFact, \"Sen Joe Manchin says 1999’s NRA supported expanded background checks,\" July 1, 2013.", "FactCheck.org, \"Biden revises NRA history on background checks,\" April 12, 2013.", "The Washington Post Fact Checker, \"History lesson: The NRA’s ‘support’ for expanded background checks,\" April 19, 2013.", "CNN, \"NRA: Background checks don’t work,\" Feb. 1, 2013.", "The Huffington Post, \"NRA supported universal background checks after Columbine massacre,\" Jan 31, 2014.", "The Washington Post, \"House votes to weaken Senate gun show checks,\" June 18, 1999.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]