["Photographs of dead bodies wrapped in cardboard boxes are being circulated on social media with the claim that these are the remains of the policemen who were killed in the recent Maoist attack in Maharashtra.", "Several individual users on Twitter have shared the images.", "The photographs are being used to target PM Modi for the alleged disrespect of the slain policemen.", "A simple reverse-search on Google revealed that the images doing rounds on social media pertain to an incident that occurred in 2017 when seven military personnel were killed in a helicopter crash in Tawang.", "Former Northern Army commander Lt Gen (Retd) HS Panag was among those who tweeted the photographs.", "Seven young men stepped out into the sunshine yesterday, to serve their motherland. India. This is how they came home. pic.twitter.com/OEKKcyWj0p", "— Lt Gen H S Panag(R) (@rwac48) October 8, 2017", "Punjab CM Capt Amarinder Singh had also tweeted about the incident.", "Shocked to see bodies of 7 @IAF_MCC & @adgpi Tawang crash victims brought in cartons. Is this how we treat our brave men? pic.twitter.com/dP5HGsRvTH", "— Capt.Amarinder Singh (@capt_amarinder) October 8, 2017", "The death of 15 policemen in Maharashtra’s Naxal attack was widely reported in the media. Images of the last rites show the slain security personnel receiving state honours. Their bodies were not wrapped in cardboard boxes, as claimed on social media.", "Maharashtra: Wreath laying ceremony of the security personnel who lost their lives in the IED blast attack by Naxals in Gadchiroli, yesterday. pic.twitter.com/BYDYAbX4DJ", "— ANI (@ANI) May 2, 2019", "Images or videos depicting unrelated events are often circulated on social media with a changed narrative. A similar pattern was observed after the recent Sri Lanka Easter bombings and Indian army’s Balakot airstrike in February.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]