["About this rating", "In May 2020, shortly after news outlets reported that an unveiling ceremony for former U.S. President Barack Obama's official White House portrait was unlikely to take place this year due to political disagreements with current President Donald Trump, some social media users started to circulate what they claimed was Obama's official portrait. They were trying to bring visibility to what \"Trump doesn't want people to see,\" according to one user. That portrait is pictured below:", "One social media user wrote: \"The unveiling of the official portrait of former President Barack Obama at the White House has not taken place because President Trump refused to take part in the ceremony. Please share the portrait that Trump doesn't want people to see.\"", "But the above-displayed image does not show Obama's official White House portrait. It is actually a painting by Dutch artist Edwin van den Dikkenberg and has no official connections to the White House or Obama.", "Dikkenberg's painting first went viral in 2017. That was when it was again shared as if it were an official portrait of Obama. At the time, Dikkenberg told BuzzFeed News that he was excited his painting received so much attention, but confirmed that this was not Obama's official portrait:", "\"I'm very pleased to hear that my portrait of Barack Obama appeared on Twitter! I wish I had the opportunity to paint the official portrait but that's not the case. ... As an artist I am always hoping for something like this to happen! And as a professional portrait painter it would be a great honor to paint the president.\"", "Dikkenberg was also asked about why he chose to paint Obama in a tan suit, given that this suit color once caused considerable outrage among the president's critics. Dikkenberg said that he had to paint Obama from a photograph since he didn't have access to the president (again, this is not an official White House painting), and that he found the color of Obama's suit in his source image, blue, to be a bit boring. So he switched colors:", "\"I really had no idea about the fuss,\" Van den Dikkenberg said about the commotion surrounding the beige suit. \"I prefer to paint people live, but it was not possible in this case. So I based my painting on a photo. On it he wore a blue suit, but I found it a boring color. The choice for beige was purely from an artistic point of view.\"", "Another portrait of Obama was also shared on social media as if it were the portrait scheduled to be unveiled at the White House in 2020.", "This painting of Obama was done by Kehinde Wiley and was unveiled at the Smithsonian’s National Portrait Gallery in February 2018. While this an official portrait of Obama, it is not the official White House portrait that would have been unveiled at the White House ceremony in 2020.", "The official White House portraits are commissioned by the White House Historical Association, and are distinct from the portraits hanging in the National Portrait Gallery. Official White House portraits are traditionally unveiled by the president's successor near the end of their first term, and end up displayed (or stored) at the White House.", "NBC News wrote:", "It's been a White House tradition for decades: A first-term president hosts a ceremony in the East Room for the unveiling of the official portrait of his immediate predecessor that will hang in the halls of the White House for posterity.", "[...]", "Official White House portraits are separate from the presidential portraits that hang in the National Portrait Gallery in Washington, where the Obamas' were unveiled in February 2018.", "The process for the White House portraits begins near the end of a president's term or soon after, and it takes a few years to complete.", "For context, here's a video from May 2012 of Obama unveiling the portraits of former President George Bush and first lady Laura Bush.", "https://www.youtube.com/watch?v=GD3IodWyGME&t=187s", "Farzan, Antonia.   \"Five Years Ago, Obama Was Blasted for Wearing a Tan Suit. Now, It’s Used to Contrast Him with Trump.\"\r\n    The Washington Post.   28 August 2019.", "Smidt, Remy.   \"Nuh-Uh, This Is Not Obama's Official Presidential Portrait.\" \r\n    BuzzFeed.   12 June 2017.", "Cotter, Holland.  \"Obama Portraits Blend Paint and Politics, and Fact and Fiction.\"\r\n    The New York Times.   12 February 2018.", "Pieters, Janene.  \"Dutch Artist's Obama Painting Mistaken for Official Presidential Portrait; Goes Viral.\"\r\n    NLTimes.nl.   13 June 2017.", "Lee, Carol.  \"White House Portrait Ceremony May Be the Latest Casualty of the Political Divide.\"\r\n    NBC News.   19 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]