["“It's gradually taking shape! This is Gbagada Expressway, Lagos,” reads a Facebook post published on October 16, 2020.", "Okpanku Observer is a page run by supporters of Biafra, a region in southern Nigeria clamouring for independence. The account has a history of promoting content aimed at discrediting the government.", "The post emerged shortly after the SARS was disbanded this month and replaced with a new unit called Special Weapons and Tactics (SWAT).", "More than 600 people have shared the image, which claims to show protesters blocking a major highway around Gbagada as part of widespread protests against police brutality.", "The SARS-Gbagada group/branch are criminals!\n\t\tPicked up my friend from at ikotun area (where he went to supply goods to his customer) & drove straight to their office at Gbagada, and tagged him a cultist, it took Gods Grace &over 50k to get him out of their evil hands! #EndSARS ?", "Many comments in the post indicate social media users believed the picture was taken recently in connection with public rallies calling for law enforcement reforms in the country.", "While Nigeria’s top police chief Mohammed Adamu ordered the replacement of the unit with promises of reform by the government, demonstrations have continued in several cities, including in Lagos and Abuja.", "The same image was also published on Instagram by popular Nollywood actor Kunle Afod alongside the “End SARS” slogan, which was initially launched on social media to denounce the activities of the police tactical unit but has become a rallying cry against injustice and for better governance.", "However, the photo was taken in a different part of Lagos in 2012 and is unrelated to the current demonstrations in Nigeria.", "AFP Fact Check traced the location of the photograph to Ojota, Lagos, aided by physical features in the image, including a billboard reading “Gani Fawehinmi Park”.", "Using Google Maps Street View, we found another picture of the exact location in Ojota next to the popular Gani Fawehinmi Park in Lagos, named after the late human rights lawyer Gani Fawehinmi.", "Large green road signs with directions to  “Maryland” and “Oworonshoki” are visible in both the viral image and on Google Maps Street View.", "AFP Fact Check ran a Google reverse image search and found the image accompanied several articles from 2012 with credits to AFP.", "The scene, as well as other related images, was documented by AFP photojournalist Pius Utomi Ekpei on January 12, 2012.", "The photo shows people gathering during a protest against the scrapping of oil subsidies at Gani Fawehinmi Park, Ojota in Lagos.", "Meanwhile, AFP photographers have also extensively covered the ongoing anti-SARS protests.", "Social media posts using old images to make false claims are common in Nigeria. AFP Fact Check recently debunked a similar post claiming CNN anchor Don Lemon had denounced the controversial SARS police unit and Covid-19 as “two deadly viruses” killing people in the west African nation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]