["A Facebook post published March 21 contains an image of three pyramids in Giza, Egypt, aligned with three celestial objects, claiming in the caption that this phenomenon occurs every 2,373 years.", "The post has already received more than 200 shares and more than 600 reactions. USA TODAY has reached out to the poster.", "But the alignment of the planets Mercury, Venus and Saturn is a hoax, with several twists. This post is one of the variants; others claim the phenomenon happens once every 2,737 years.", "A reverse image search revealed various instances where the image in the Facebook post has been previously used, some dating as far back as 2012. A blog post from Dec. 3, 2012, claims this purported event was calculated using Stellarium, a planetarium software.", "The image has been shared in several languages, as well, in the past couple of years. The purported phenomenon was said to have happened also on Dec. 3, 2012, which was nine days before the ominous date of 12/12/12, or the end of the Mayan calendar.", "Almost a decade later, the image resurfaced across various social media platforms once again.", "\"It's clearly ridiculous,\" said Caroline Simpson, an astronomy professor at Florida International University. She added that Mercury, Venus and Saturn can be seen in the sky roughly once a year, not every 2,373 years.", "The image shows the same brightness for each of the three planets,  but  the three planets each have varying brightness levels, she said.", "Most posts related to this alleged phenomenon claim the event would have taken place on Dec. 3, 2012. But Simpson said the planets would have been up during the day and not at night, as shown in the image, and would have therefore not been visible.", "\"Nothing about it is correct,\" said Simpson.", "In an article by AFP Fact Check, an astronomy simulation tool, Solar System Scope, was used to recreate the night of Dec. 3, 2012.", "With the geolocation set to Cairo, which is 18 kilometers from Giza, AFP compared different times at which the planets could have aligned. It found that in none of the cases do the planets appear the way they do in the image presented in the Facebook post.", "At 6:30 a.m., the planets aligned vertically from the horizon; at 9 a.m. or noon, an alignment such as the one pictured could have happened, but at that point the planets were not visible; at 1:54 p.m. only Mercury and Venus were in the sky; and at 4:54 p.m. the planets could no longer be seen.", "The claim is FALSE, based on our research. Mercury, Venus and Saturn could not have been visible at night from any location, as shown in the picture from the Facebook post. The three planets all have different brightness levels, yet Mercury and Venus appear to have similar brightness in the image. These three planets can actually be seen in the sky roughly once a year and not once in the claimed timeframe of 2,373 years.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]