["The photo was published here on Weibo on February 16, 2020.", "The simplified Chinese-language caption translates to English as: “Wuhan, Hubei, welcomed snow on February 15. Large characters for 'China' and a fist were spotted on a snow-covered area in a residential complex in Wuhan. Keep going Wuhan, keep going China!”", "Below is a screenshot of the misleading post:", "The photo, along with a similar claim, was shared here, here and here on Weibo; here on Facebook; and here and here on WeChat.", "It was also published here by US newspaper World Journal and here by Macau newspaper Jornal Va Kio, alongside a similar claim.", "The claim is false; the artwork was made in the city of Shouguang in Shandong province, more than 600 miles northeast of Wuhan.", "A keyword search on Weibo found the same photo published here on February 15. Its caption states: “At the ground level of my residential area today, some awesome person used the white snow to create a beautiful painting about the virus ‘war’.”", "The post was hashtagged to the north gate of Meilin Garden, a housing estate in Shouguang. The location can be confirmed by Baidu Maps imagery and a photo of the housing complex on a Shouguang-based property agent website.", "The Weibo user who uploaded the earlier version of the photo was listed in their profile as a Shandong resident. They shared a separate image and a video a day later on February 16 to clarify that the artwork was made in Shouguang, not Wuhan.", "Below is a screenshot comparison of the photo in the misleading post (1), Baidu Maps imagery (2), property agent photo (3) and image from the Shandong-based Weibo user (4) with corresponding features circled in red by AFP:", "Another keyword search on Baidu found this February 16 article published by Shouguang calligraphy and painting, a website run by local newspaper Shouguang Daily.", "The article credited the snow art to Wang Shouzhong, an artist based in Shouguang. Wang told the newspaper he thought he would take advantage of the snow to create something entertaining for his neighbours. He said he only spent about 10 minutes to create the artwork by walking through the snow, and was surprised the quick piece caught so much attention.", "The Chinese government has ordered people to stay indoors in an attempt to curb the spread of the deadly novel coronavirus, which has killed more than 2,200 people and infected more than 75,000 others in China as of February 21, AFP reported here.", "State news agency China News Service, which shared the misleading claim on Weibo and later deleted it, issued an apology on the site on February 16.", "Translated to English, the post states in part: “[Apology] The collage titled 'Snow welcomed in Wuhan, Hubei' that was published on our website on February 15 included a photograph of snow art in Shouguang, Shandong. It was wrongly described as showing snow in Wuhan. We hereby apologise to our fellow netizens for any misunderstanding and confusion caused.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]