["A viral tweet attributed to televangelist Pat Robertson seemed too outlandish to be true.", "It was.", "Posted April 5, the tweet claimed that Pat Robertson believed he found the source of COVID-19 during an episode of The 700 Club. Robertson founded The 700 Club in 1966. He has hosted it since.", "The tweet is a screenshot of a quote. It says, \"Some of these young uns are doing all kinds of unnatural things with their sex organs. When people do that, they transfer all kinds of chemicals from ladies’ private parts and that’s where I think the virus came from. We never had this kind of thing when I was coming up. But no one was committing oral sex back then.\"", "The tweet led to a Twitter trend for \"Pat Robertson\" and caused a spike in Google searches for Robertson.", "The quote has since been shared on Facebook and Reddit by angry users.", "Except Robertson didn’t say it at all.", "The tweet was taken from a satire piece on The Business Standard News website.", "\"The Business Standard News is a satirical site designed to parody the 24-hour news cycle. The stories are outlandish, but reality is so strange nowadays they could be true,\" the site’s \"about\" page said.", "We reached out to Christain Broadcasting Network just to be sure. CBN, founded by Robertson, confirmed he said \"no such thing.\"", "Robertson ran for president in 1988. He founded the Christian Coalition and the American Center for Law and Justice, which was labeled as the Christian response to the ACLU. He founded Regent University. He has owned several other businesses.", "Some people who responded to the tweet compared it to past controversial claims. In the ’90s, he described feminists as people who \"practice witchcraft, destroy capitalism, and become lesbians.\" More recently, he told 700 Club viewers that he wishes there was a Facebook vomit button for every time he saw a gay couple kissing.", "Robertson has talked COVID-19 before, but he has not mentioned oral sex as being the cause. As for causes, Robertson did say that \"‘if your gut is healthy, you don’t have to worry about corona.'\"", "In 2012, Robertson did weigh in on oral sex — he said it was okay, as long as it was between a husband and wife.", "A viral tweet attributed a quote to Robertson saying he believed oral sex and \"lady parts\" caused COVID-19.", "This originated from a satire website. We rate this tweet Pants on Fire.", "The Business Standard News, \"About.\" Accessed April 6, 2020.", "The Business Standard News, \"Robertson Blames Coronavirus On Oral Sex, ‘Lady Chemicals,’\" March 24, 2020.", "The New York Times, \"Robertson Letter Attacks Feminists,\" Aug. 26, 1992.", "Business Insider, \"Try Not To Cringe: Pat Robertson Tells The 700 Club That Oral Sex Is Just Fine,\" March 15, 2012.", "YouTube, \"We Do Not Have to Fear': CBN Founder Pat Robertson Prays for God to Remove Coronavirus Fears,\" March 16, 2020.", "Twitter post, April 5, 2020.", "Email with Chris Roslan of CBN, April 6, 2020.", "YouTube, \"CBN News Health Reporter Lorie Johnson: How to Help Your Body Fight Coronavirus,\" March 2, 2020.", "Google Trends. Accessed April 7, 2020.", "CNN. \"The Top 10: Facebook 'vomit' button for gays and other Pat Robertson quotes,\" July 9, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]