["About this rating", "In September 2019, as the spotlight shined bright on teenage environmental activist Greta Thunberg, detractors attempted to discredit her with a variety of false rumors. For instance, some started sharing a doctored photograph of Thunberg with alt-right boogeyman George Soros (the original photograph featured former Vice President Al Gore). Others shared a miscaptioned image purportedly showing Thunberg with a member of ISIS (Thunberg was not in this photograph.)", "Another image purported to show Thunberg on the cover of People with Money magazine after she was named the \"highest paid activist.\"", "This is not a genuine magazine cover.", "This image was created by the website MediaMass from a template the site has frequently employed in the past. Since at least 2013, MediaMass has created dozens of fake magazine covers of \"highest paid\" people. These doctored images have featured celebrities such as John Legend, Chuck Norris, Bob Dylan, Susan Boyle, and Reba McEntire:", "These covers are all identical with the exception of the main image. It appears that MediaMass simply places a basic template over a photograph of a celebrity.", "Here's a look at the blank template:", "MediaMass published its fake magazine cover featuring Thunberg in an article titled \"Greta Thunberg Highest-Paid Activist in the World.\" While the article initially reads like a genuine magazine piece, an update after the first paragraph explained that the rumor was false. Those who clicked on the explanation were directed to a disclaimer about MediaMass' content:", "The website mediamass.net is the medium of our satire to expose with humour, exaggeration and ridicule the contemporary mass production and mass consumption that we observe.", "Also it will not only mock the producers (mainstream media, journalists) as it is common when questioning and criticizing mass media, but also the consumers as one cannot exist without the other. Sensationalism, lack of verification of information, ethics and standards issues are only symptoms of the actual social and economic order. This is particularly obvious when observing the role of social networking sites in spreading rumours.", "In short, Thunberg was not named the \"highest paid activist\" on the cover of People with Money magazine. This is a fake magazine cover created by a satire website.", "Zraick, Karen.   \"Greta Thunberg, After Pointed U.N. Speech, Faces Attacks From the Right.\"\r\n    New York Times.   24 September 2019.", "Kearney, Carol.   \"Greta Thunberg Highest-Paid Activist in the World.\"\r\n    MediaMass.   25 September 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]