["About this rating", "On 6 March 2016, the video of a protesting crowd embedded below was circulated along with the following comment about what it supposedly depicted", "Muslim's in Chicago chanting: \"Free Palestine, death to Israel, death to America\".", "Where was the mainstream media on this?", "Muslim's in Chicago chanting: \"Free Palestine\"Pro Palestine protest in September 2014. https://youtu.be/QOQQVxXmvsYWhere was the mainstream media on this?(Thank you to a viewer that confirmed this information)", "Posted by The Rocci Stucci Show on Sunday, March 6, 2016", "On 7 March 2016, the unreliable web site ClashDaily also reported (in a piece bearing the title \"WATCH: Muslims in THIS U.S. City Chant ‘DEATH To America”) that there had been a concerted effort by the news media to cover up an anti-American, anti-Israel march in Chicago:", "Where was the mainstream media on this? You better not hold your breath while waiting for them to cover this, because it isn’t gonna happen. Watch as these Muslims in Chicago chant “Free Palestine, death to Israel, death to America”", "Mentions of the clip on social media invariably claimed that the event was recent and deliberately suppressed by the mainstream media. However, the clip was from July 2014, not March 2016:", "In addition to the video's being nearly two years old, it did not capture Muslim marchers chanting  \"death to America.\" A description of the clip stated that it depicted a \"Protest in downtown Chicago. Palestinian supporters were protesting the bombings in Gaza.\"", "Claims that the footage received no mainstream media attention were also easily disproved, as videos were readily available through the Chicago Tribune, Chicago's ABC affiliate WLS-TV, the Chicago Monitor, and CNN's iReport.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]