["A hashtag #ApologiseBarkha is trending on micro-blogging platform Twitter. Several users have shared a video of the journalist claiming that she justified the exodus of Kashmiri Pandits.", "Barkha Dutt justifying the horrific Kashmiri Pandit genocide! #ApologiseBarkha", "Her other crimes against India:", "1) Radia tapes conspiracy – portfolio fixing 2) Kargil – army positions leaked 3) 26/11 – critical information leaked 3) Gujrat riot fake news & inflammatory coverage pic.twitter.com/NE4LfEwTYt", "— Saurabh (@Saurabh74246564) July 22, 2020", "The hashtag picked up after an Instagram page ‘Kashmiri Youth Movement’ shared a video of a man claiming to show the same video to his grandmother, a Kashmiri Hindu, who demanded an apology from Dutt.", "Barkha Dutt has justified the ethnic cleansing, mocked and hurt our community. We demand an apology. She must apologise. #ApologiseBarkha", "A post shared by  Kashmiri Youth Movement (@kashmiriyouthmovement) on Jul 19, 2020 at 5:48am PDT", "That the journalist suggested “Kashmiri Pandits were rightly massacred in 1990s” is a recurring claim. On November 9, 2018, Chayan Chatterjee tweeted the clip with the same narrative. This 23-second clip has been projected as a justification for the massacre of Kashmiri Pandits.", "Barkha Dutt suggesting that Kashmiri Pandits were rightly massacred in 1990s pic.twitter.com/CHOVD3n54q", "— Chayan Chatterjee (@Satyanewshi) November 10, 2018", "In the 23-second clip, Dutt can be heard saying, “Today hapless victims, they were once privileged elites of the valley. They may have been a minority but at that time, they had monopolised government jobs, plum postings and other such social benefits. In fact, the sharp economic disparity between the Pandits and the poor Muslim majority was one of the earliest reasons for popular discontent in the state.” On basis of the clipped video, social media users claimed that Barkha Dutt defended the massacre of Kashmiri Pandits.", "The oldest instance of the same clip that Alt News could find was from 2015. A known fake news purveyor Facebook page Shankh Naad had shared the video on November 6, 2015. It had received more than 2.37 lakh views and 5,400 shares. The message shared along with the video stated, “Barkha Dutt justifying Kashmiri Pandit’s genocide”.", "Alt News found the full-length video published on NDTV’s website on May 7, 2013. The title of the video – “Kashmiri pandits: The forgotten minority (Aired: October 2004)” – itself is in absolute contradiction to the claims made on social media. Here, Dutt talked about the plight of Kashmiri Pandits, a minority in the Valley.", "Moreover, the summarized caption published along with the video further confirms that Dutt’s reportage was not a justification of the massacre but focused on the impoverished conditions of Kashmiri Pandits since they were forced out of the Valley in 1990. “Despite all the attention on the state of Jammu and Kashmir, one issue often forgotten is that of the Kashmiri pandits. Ever since the pandits were forced out of the Valley, they have stayed on the margins of public and political attention. In this episode of Reality Bites, Barkha Dutt investigates the events that led to this mass exodus and also how the danger of a declining population is only made worse by a life in exile, as assimilating to new cultures and new cities means discarding an old ethos and embracing new rituals,” read the caption. This clearly suggests that the claims on social media are false.", "Barkha Dutt introduces the report by explaining the misery of forgotten and marginalised Kashmiri Pandits. She starts off by saying, “The Prime Minister will fly to Srinagar in early April, announcing this after meeting with him in Delhi, Jammu Kashmir Chief Minister Mufti Mohammad Sayeed said a new political dialogue at the highest level should get off the ground soon. But in all the attention on the state, often forgotten is the community of Kashmir Pandits. It was exactly 13 years ago, this very month that the Pandits where forced out of the valley and have since stayed on the margins of public and political attention.”", "At 5:15, a representative of an organization of displaced Kashmiri Pandits ‘Panun Kashmir’ can be heard saying, “A Kashmiri Pandit monetarily may not be so well-off that’s not important. It is the identity, the ethnic identity of the Kashmiri Pandit… Kashmir Pandit was a well-known identity in India. A Kashmiri Pandit has different rituals, it has a different language, it has a different culture. We think we have lost that.”", "The aforementioned quote of Dr Shakti Bhan provides context to the part (5:36) where Dutt says, “In fact, history has turned full circle for the Kashmiri Pandits…”. This statement was intentionally clipped before Dutt begins to say – “Today hapless victims, they were once privileged elites of the valley. They may have been a minority but at that time, they had monopolised government jobs, plum postings and other such social benefits…” Just reading these lines gives the impression that Dutt’s commentary portrays Kashmiri Pandits in poor light, however, the journalist was attempting to give her viewers a contrast between their lives before and after their exodus.", "In a conversation with Alt News, journalist Barkha Dutt categorically rubbished the claims viral on social media. She said, “This is an isolated comment from a larger episode. In fact, the enforced exodus of Kashmiri Pandits is something I have repeatedly spoken up against and done many shows to highlight. So I find it absolutely outrageous and downright dangerous to try and distort these comments as some sort of justification of either the horrific exodus or to suggest that I am speaking up for ethnic cleansing, which is exactly the kind of tweets that I have been getting. You could argue that my historical analysis as a young reporter is incorrect or that today I have layers of information and experience to add to it. But that’s about all that you could argue when the entire episode from which is being clipped is in fact about how terrible this exodus is and what has happened to Pandits who live in this sort of displaced reality. Falsehood is one thing but communal falsehood and putting words in my mouth is another.”", "It is commonplace on social media for videos to be clipped and placed out-of-context. In the past as well, we have observed that misleading videos of public figures are circulated with false narratives. In the above case, a reportage sympathetic to the plight of displaced Kashmiri Pandits was viciously truncated into a 23-second clip to suggest that journalist Barkha Dutt was justifying ethnic cleansing.", "[This video was updated on July 22, 2020.]", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]