["About this rating", "Deutsche Bank has acknowledged that they provided loans to companies that built Auschwitz; Deutsche Bank has lent over two billion dollars to the Trump Organization; Deutsche Bank courted Jeffrey Epstein as a client, and he operated several ventures with the bank as his primary financial institution following his 2008 conviction for underage prostitution.", "American branches of Deutsche Bank participated in nearly $4 billion worth of financial transactions deemed \"suspicious\" by investigators because they involved Iraqi banks that may have been associated with ISIS during that time. Such \"suspicious activity reports\" do not necessarily indicate a crime, and the nature of these transactions and the specific banks used in that region are unknown.", "On Nov. 11, 2020, Bloomberg reported that strategists at Deutsche Bank, one of the largest financial institutions in the world, recommended levying a tax against people who plan to continue working from home, arguing that \"remote workers should pay a tax for the privilege.” At least on Twitter, this was a poorly received take. One particularly viral response alleged that the bank \"funded Auschwitz, Donald Trump, Jeffrey Epstein and ISIS.\"", "As we show below, the tweet is a largely accurate recounting of history, though the assertion that the bank funded ISIS overstates what is publicly known at this time.", "In 1999, during negotiations to merge with the New York-based Bankers Trust, the Germany-based Deutsche Bank disclosed that it had helped finance the construction of the Nazi death camp Auschwitz. As reported by Reuters at the time, Deutsche Bank's historian, Manfred Pohl, described the bank's loans to companies involved in multiple aspects of Auschwitz, including loans for construction of the camp and its incineration units, as well as to a company involved in the production of the deadly Zyklon-B gas, which the Nazis used to murder millions:", "Manfred Pohl, head of Deutsche Bank’s historical institute, said newly uncovered documents showed the bank had links with firms that built the camp in Poland. It also had credit links to one company that made incineration units and funded another whose subsidiary made the Zyklon-B gas used in the camp.", "“On examination of credit records, we determined that branches . . . had credit links to local companies which were active at the construction site . . . in Auschwitz,” Pohl said at a media briefing in Frankfurt.", "Pohl told reporters that the existence of these loans would have been known to high-ranking managers of the bank. \"It is clear that this was known as high up at the main office in Katowice. It is not certain whether it was known in Berlin,\" Pohl said, though he added these loans would have had to be approved in Berlin to go ahead.", "Deutsche Bank has had a relationship with U.S. President Donald Trump since 1998. As reported in The New York Times, \"Over the course of two decades, the bank lent him more than $2 billion — so much that by the time he was elected, ­Deutsche Bank was by far his biggest creditor.\" Speaking to Reuters in November 2020, one bank official said that the Trump Organization currently has around $340 million in outstanding debt from the bank:", "Deutsche Bank has about $340 million in loans outstanding to the Trump Organization, the president’s umbrella group that is currently overseen by his two sons, according to filings made by Trump to the U.S. Office of Government Ethics in July and a senior source within the bank. The three loans, which are against Trump properties and start coming due in two years, are current on payments and personally guaranteed by the president, according to two bank officials.", "According to that Reuters report, the bank is looking to distance itself from the president moving forward. Their relationship with Trump \"cemented ­Deutsche Bank’s reputation as a reckless institution willing to do business with clients nobody else would touch,\" they wrote. \"It has made the company a magnet for prosecutors, regulators and lawmakers hoping to penetrate the president’s opaque financial affairs.\" Regardless, Trump's history with Deutsche Bank is factual and well known.", "According to a 2019 report by the New York State Department of Financial Services, \"the relationship between Deutsche Bank and Mr. Epstein officially began on August 19, 2013\" and eventually involved his opening and funding \"more than 40 accounts at the Bank.\"", "Controversially, they entered into business with Epstein after his 2008 arrest for the solicitation of a minor and after other media revelations about Epstein's alleged trafficking of underage women for sex. Some of these Deutsche Bank accounts were involved in suspicious transactions including, according to The New York Times, \"suspiciously large cash withdrawals and 120 wire transfers totaling $2.65 million to women with Eastern European surnames and people who had been publicly identified as Mr. Epstein’s co-conspirators.\"", "In July 2020, Deutsche Bank agreed to pay $150 million to the New York State Department of Financial Services \"to settle allegations that it maintained weak internal controls, including processing hundreds of transactions for Jeffrey Epstein despite the billionaire’s troubled history.\" The bank has since apologized for its association with Epstein.", "In the banking world, Suspicious Activity Reports (SARs) are notifications made by financial institutions to the United States government about potentially suspicious or illegal activity. A transaction labeled suspicious in these reports does not necessarily indicate illegal activity, however. SARs issued about transactions involving Deutsche Bank have been used to link them to ISIS in multiple investigations.", "In December 2017, BuzzFeed News reported on SARs showing that Deutsche Bank had been engaged in business with a corrupt Cyprus bank named FBME that \"served as a major conduit to terrorism, organized crime, and chemical weapons.\" The SARs revealed that \"Deutsche processed hundreds of millions of dollars of suspicious transactions for FBME clients – including a Kremlin-linked network of Russian slush funds funneling money to financiers of the Syrian regime and a businessman trading oil with ISIS.\" The reports do not indicate, however, that Deutsche Bank knowingly participated in illegal activity.", "In September 2020, the existence of an even larger trove of SARs obtained by BuzzFeed News and shared with the International Consortium of Investigative Journalists (ICIJ) was announced. The collaboration — a project named the FinCEN files — led to hundreds of stories in newsrooms across the world. One story, published by Arab Reporters for Investigative Journalism (ARIJ), identified further transactions that could point to a potential involvement of Deutsche Bank in the movement of funds to, from, and within ISIS held territory.", "The files, ARIJ said, \"reveal suspicious money transfers of at least $4 billion flagged by Deutsche Bank’s US branches and Bank of America to a number of Iraqi banks between June 15, 2014 and June 30, 2015.\" Though the files do not indicate which bank branches were used, they reported, \"the transactions were sent and received during the height of the Islamic State’s reign and its control over several Iraqi bank branches.\" The report notes that \"many of the banks in northern Iraq were in areas of IS [Islamic State] influence, and such transfers could be the proceeds of the illicit oil and gas trade that the organisation largely relied on in its areas of control.\"", "While suggestive of an at least unwitting role for Deutsche Bank in ISIS related finances, these reports are not strong enough evidence to support the statement that Deutsche Bank \"funds\" ISIS. Because there is some truth to the ISIS claim, and because the other assertions are true, we rank the overall claim made in the viral tweet as \"Mostly true.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]