["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Elizabeth Warren’s plan to tax the wealthiest Americans has drawn immediate fire. Former Starbucks CEO Howard Schultz, himself a potential presidential candidate, called it a ridiculous plan that would never be passed.", "Warren, D-Mass., fired back.", "\"What's ‘ridiculous’ is billionaires who think they can buy the presidency to keep the system rigged for themselves while opportunity slips away for everyone else,\" Warren tweeted Jan. 29. \"The top 0.1 percent, who'd pay my #UltraMillionaireTax, own about the same wealth as 90 percent of America.\"", "What's “ridiculous” is billionaires who think they can buy the presidency to keep the system rigged for themselves while opportunity slips away for everyone else. The top 0.1%, who'd pay my #UltraMillionaireTax, own about the same wealth as 90% of America. It's time for change. https://t.co/D04G5fNvpa", "The top 0.1 percent is fewer than 200,000 families. The bottom 90 percent? About 110 million households. Warren would put a 2 percent tax on every dollar of net worth above $50 million and a 3 percent tax on every dollar of net worth above $1 billion.", "Do people like Amazon’s Jeff Bezos ($160 billion) and Bill Gates ($97 billion) and the rest of the uber-wealthy own as big a piece of the pie as Warren said?", "For sure, they own a hugely disproportionate share, but estimates vary as to how much.", "Wealth is often confused with income, and while the two often go hand in hand, they are different. Income is how much money a person makes from a job or investments. Wealth is the value of everything a person owns after factoring in debt. The equity in a home, retirement savings and bank accounts, for example, are part of a person’s wealth.", "There are several ways to measure wealth in America, and none of them are perfect.", "Warren’s figure comes from an analysis by economists Emmanuel Saez at Stanford University and Gabriel Zucman at the University of California-Berkeley. Saez and Zucman sent Warren a letter with their estimate of how much revenue her tax plan would raise.", "They wrote that the top 0.1 percent own about 20 percent of all the nation’s wealth. The bottom 90 percent own about 25 percent. Mortgages, credit card and student debt, they said, take a bite out of the net worth of most American families.", "That backs up Warren’s statement that the people at the very top own \"about the same\" as the bottom 90 percent. But another credible study found a somewhat smaller share of wealth held by the ultra rich.", "A group of economists from the Federal Reserve and the University of Pennsylvania found that in 2013, the top 0.1 percent held about 15 percent of the wealth.", "That’s about five percentage points less than what Warren referenced.", "When we compared the data from both studies (we had full spreadsheets from each), the Saez-Zucman estimates tend to show the wealthy owning a little more and the rest of the population owning a little less than the Federal Reserve group found.", "The Federal Reserve group’s results for 2013 involved adjusting the standard survey data the central bank typically reports. (There is more recent data for 2016, but it is unadjusted and does not speak to the wealth of the top 0.1 percent.)", "One reason for the differences in the two studies is they used different methods. The Federal Reserve group started with the Federal Reserve’s Survey of Consumer Finance and then added in data the survey misses. Saez and Zucman worked with tax return data. Both approaches have strengths and weaknesses.", "But while estimates vary, there’s no disagreement over the broader trend.", "\"In all of the estimates discussed here, top wealth shares in the United States are very high and increasing over time,\" the Federal Reserve-University of Pennsylvania group wrote in their 2016 article.", "All results should be read with care because seemingly small changes will change the percentages a bit. For example, when Saez and Zucman look at individuals, rather than families or tax units, their numbers become closer to the Federal Reserve group’s results.", "Warren said that the top 0.1 percent of the people own about the same as the bottom 90 percent. She relied on a letter from two economists who spoke broadly of the top 0.1 percent holding 20 percent of the wealth, while the bottom 90 percent own about 25 percent.", "On that basis, the two numbers are about the same.", "But another study found that the top 0.1 percent owned about 15 percent of all household wealth, while the bottom 90 percent owned 29 percent. That still represents a a lot of wealth in the hands of a tiny fraction of families, but it’s harder to say the amounts held by the two groups are about the same.", "We rate this statement Mostly True.", "Elizabeth Warren, tweet, Jan. 29, 2019", "Emmanuel Saez and Gabriel Zucman, Letter to Elizabeth Warren, Jan. 18, 2019", "Saez-Zucman data", "Brookings Papers on Economic Activity, Measuring income and wealth at the top using administrative and survey data, March 10, 2016", "Bricker, et. al data", "Board of Governors of the Federal Reserve System, Changes in U.S. Family Finances from 2013 to 2016: Evidence from the Survey of Consumer Finances, September 2017", "Journal of Economic Perspectives, What Do We Know about the Evolution of Top Wealth Shares in the United States? Winter 2015", "National Bureau of Economic Research, Global wealth inequality, January 2019", "National Bureau of Economic Research, Wealth inequality in the United States since 1913: Evidence from capitalized income tax data, October 2014", "Forbes, Forbes 400, accessed Jan. 31, 2019", "PolitiFact, Pretty much on the money: Sanders says world's 80 richest own more than the bottom half do, Feb. 17, 2016", "Credit Suisse, Global wealth databook 2018, October 2018", "National Bureau of Economic Research Working Papers, Household Wealth Trends in the United States, 1962 to 2016: Has Middle Class Wealth Recovered?, November 2017", "Email interview, Chris Hayden, spokesman, Warren for President, Jan. 29, 2019", "Email interview, Phil Magness, senior research fellow, American Institute for Economic Research, Jan. 29, 2019", "Email interview, Emmanuel Saez, professor of economics, Stanford University, Jan. 30, 2019", "Email interview, Jesse Bricker, principal economist, U.S. Federal Reserve System, Jan. 30, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]