["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• Activists in Fresno, Calif., have said the posts are fake and have nothing to do with the Black Lives Matter movement.", "• Fresno police are not implementing a curfew for the city, but are increasing patrols and tactical units in the area.", "As protests against police brutality intensify across the country, activists and officials trying to keep the peace are having to contend with social media misinformation.", "A recent post implies that a Black Lives Matter group in Fresno, Calif., is planning a riot Tuesday afternoon. The post features a screenshot of an iPhone note with instructions for what appears to be a pre-planned riot.", "\"BLM FRESNO RIOTS,\" the post reads. \"Riots will begin @ 4 pm in River Park on 06/02/20.\"", "The post goes on to outline the purported objectives of the riots:", "\"Tear up Caucasian infrastructure,\"", "\"Send a message to the PD,\" and", "\"Fight back the oppressors.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post is not tied to Black Lives Matter in any way. Black activists in Fresno have categorically denied that they have made plans to riot in Fresno on the afternoon of June 2.", "Chris Milton, a businessman who spoke at a peaceful protest of George Floyd’s death on Sunday in Fresno, said during a Facebook Live video that the post was not affiliated with Black Lives Matter.", "\"There’s some stuff going around right now where there’s supposed to be this planned riot,\" Milton said. \"It’s fake. That has absolutely nothing to do with Black Lives Matter. That is not a Black Lives Matter movement.\"", "He added that the peaceful protest that occurred in downtown Fresno on Sunday was \"the movement from the black population here in Fresno.\" He emphasized that black activists in Fresno are prioritizing keeping the peace.", "\"It’s not about tearing up businesses, it’s not about disabling infrastructure,\" Milton said. \"Don’t fall for the hype.\"", "He attributed the post to white nationalist groups that have been angered by seeing black and white Americans unite for a common cause.", "The Fresno State University NAACP chapter also took to social media to discourage people from participating in the riots described in the Facebook post.", "\"The Fresno State NAACP does NOT condone this event,\" the tweet reads. \"We are encouraging people DO NOT ATTEND this event for the safety of all.\"", "D’Aungillique Jackson, president of the Fresno State NAACP chapter, also addressed the post in an Instagram video, encouraging people not to participate in the riots.", "\"That flyer is bogus. Do not go out there and tear up this city,\" Jackson said. She said the post was made by people who were \"impostering the Black Lives Matter movement.\"", "Jackson’s Instagram post also notes that Fresno doesn’t have a Black Lives Matter chapter. The only California-based official chapters of the Black Lives Matter organization can be found in Los Angeles and Long Beach.", "By Monday afternoon the Fresno Police Department said it was aware of the post about the planned riot. The department posted a statement on Facebook.", "\"We have dedicated several resources to tracking the validity of this threat and we are working towards a peaceful solution to any group that may want to be heard in our community,\" read the Facebook post.", "A few hours later, Fresno Police Chief Andrew Hall posted a news release on Facebook addressing the post about the riots.", "\"I will be adjusting the mission of several units and there will be increased patrols and tactical units addressing the City’s commercial businesses,\" Hall said in the news release.", "Air support, undercover units and tactical units would be prepared and acting as \"a watchful eye on those who would victimize\" the city, Hall said. He declined to recommend a curfew, saying his community \"just successfully had one of the largest peaceful demonstrations in this country.\"", "A post suggests that a Black Lives Matter Group in Fresno has planned a riot for Tuesday afternoon with the goal of destroying infrastructure and sending a message to police.", "Black activists in Fresno have denounced the riot post, discouraged people from attending and said it was not organized by a Black Lives Matter group. Fresno police are investigating the threat, but do not see fit to issue a curfew for the city at this time.", "We rate this post False.", "GV Wire, \"Black Leaders Say Social Media Post Calling for Riots at River Park Is Fake,\" June 1, 2020", "The Fresno Bee, \"Police, Fresno State NAACP denounce rumor of attack on businesses; no curfew, chief says,\" June 1, 2020", "The Sun, \"Police investigate, gear up over viral rumor of Fresno riots,\" June 1, 2020", "Fresno Police Department Facebook post, June 1, 2020", "Fresno Police Department Facebook post, June 1, 2020", "Chris Milton Facebook Live, June 1, 2020", "Fresno State NAACP Tweet, June 1, 2020", "Fresno State NAACP Instagram video, June 1, 2020", "Black Lives Matter, \"Chapters,\" accessed June 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]