["“Montreal Freedom Rally,” says the text of a Facebook post that includes the photo and has been shared hundreds of times since March 21, 2021.", "More examples of the post can be found on Facebook here and here.", "Montreal is under some of Canada’s most restrictive policies to curb the spread of Covid-19, including a curfew between 9:30 pm and 5:00 am. More than 10,500 people have died from the disease caused by the coronavirus in Quebec.", "On March 20, 2021, the city was among many around the world that saw protests against measures that have shut restaurants and other venues for many months. Local media said about 1,000 people attended the rally.", "AFP Fact Check used a Google reverse image to determine that the photo actually shows a rally against gun violence in Washington, DC in March 2018.", "The photo was published by The Washington Post here with the caption, “Attendees at the March for Our Lives rally on March 24 in Washington.”", "It was credited to Post photojournalist Salwan Georges.", "Google maps also shows that the photo depicts Pennsylvania Avenue. The Canadian Embassy is on the right of the image and the tall building in the center of the image is the Old Post Office Tower.", "Here is a side-by-side comparison of the images with the buildings that appear in both circled:", "This is not the first time this image has been used out of context. AFP Fact Check found it  was shared in January 2021 posts that falsely claimed it showed a rally in support of then-president Donald Trump.", "At the time, Georges tweeted: “I want to clarify that I took this photo on March 24, 2018 while covering the March for Our Lives event in the capital.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]