["About this rating", "As the Kansas City Chiefs geared up to take on the Tampa Bay Buccaneers on the Feb. 7, 2021, Super Bowl LV, many advertisers of America’s largest sporting event announced that they would be shifting priorities away from targeted consumerism to instead focus on addressing one of the most pressing issues of our time.", "Among those companies was Budweiser manufacturer Anheuser-Busch. With a net worth of $134 billion at the time of this writing, the beer giant announced that it would forgo its national ad spot for the first time in 37 years to instead support COVID-19 vaccine awareness.", "On Jan. 25, Anheuser-Busch unveiled its “holistic” advertising plan for the upcoming Super Bowl, which included reallocating its usual funding for in-game Super Bowl airtime to the Ad Council for “public awareness and education throughout the year for the COVID-19 vaccination effort.”", "“A key learning from 2020 is that we must prioritize humanity and purpose,” said Marcel Marcondes, Anheuser-Busch chief marketing officer, in a news release. The “bold commitment” is meant to provoke viewers to “think about what matters most in life” in what the company calls its “commitment to people-first innovation.”", "“This commitment is an investment in a future where we can all get back together safely over a beer,” wrote the 165-year-old company.", "But this doesn’t mean football fans will miss Anheuser-Busch products during the game. The company said it would produce a four-minute-long corporate commercial featuring a number of its other products, including Bud Light and Michelob ULTRA, in what will “reintroduce Anheuser-Busch as a company whose heritage as a brewer is the foundation for serving up a better way to make a meaningful impact far beyond the products it sells.”", "And Anheuser-Busch isn’t the only company to have made a public announcement pertaining to the 2021 Super Bowl. In a statement sent to Snopes, Coca-Cola said that it also made the decision to sit out the “big game.”", "“This difficult choice was made to ensure we are investing in the right resources during these unprecedented times,” wrote the Coca-Cola Company in an email. “We’ll be toasting to our fellow brands with an ice-cold Coke from the sidelines.”", "On Jan. 22, the NFL announced that there would be a total of 22,000 fans in attendance at Raymond James Stadium in Tampa, Florida, including 7,500 vaccinated health care workers who were gifted free tickets to the game. Those in attendance will be required to wear a mask and practice social distancing, as well as other measures, to prevent the spread of the novel coronavirus SARS-CoV-2.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]