["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is one of many conservative blogs that posted a story that said President Barack Obama had announced a “nationwide Muslim outreach program.\"", "Several readers recently asked us to check a claim that’s been spreading widely through chain emails and on social media -- that the Obama administration is pursuing a \"nationwide Muslim outreach program for children\" in grades K through 12.", "Here’s some of the text that usually accompanies the claim:", "\"At a press conference today, President Obama announced plans for the first ever federally funded Muslim outreach program. The program will be available nationwide for all elementary school students grade K-12 beginning February 1st, 2014. The program is designed to educate children about the fundamentals of the Muslim religion and Islamic belief.", "\"President Obama spoke with reporters to explain why it is so important that these outreach programs exist. ‘The Muslim community deserves our full understanding and respect,’ Obama said. ‘We have killed millions of Muslims overseas since the September 11th attacks. These folks are not all bad. In fact, most of them are hard-working citizens just like you and me. I encourage every student in America to participate in your school’s Muslim outreach program. Learn about the Muslim community, the beauty of the Sunnah and the magic of the Qur’an.’\"", "The item cited \"35-year-old Paul Horner, a teacher at Starks Elementary School in Louisiana,\" who purportedly told MSNBC that he is \"excited about the new program,\" because \"if Becky has a D+ in math she can take a three week after-school class on the Qur’an and would then have an A in Math. That’s a win-win for everyone!\"", "It closed by urging any parents of students who \"would like to volunteer and teach the Muslim religion\" to \"call the Nationwide Muslim Youth Outreach hotline at (202) 863-8500.\"", "This all sounded fishy to us, so we checked with the White House, which confirmed that no such press conference had ever happened. Nor was there any such program.", "We also rooted around the Internet and discovered that a portion of the text originated with an \"article\" in the National Report, a satire website. In fact, when we fact-checked the previous iteration of the claim from National Report in October 2013 -- that \"Obama Declares November National Muslim Appreciation Month\" -- we rated that Pants on Fire.", "This is only the latest example of satire passed off as truth on the Internet. We took a detailed look at the phenomenon here.", "The recently circulating item about the Muslim outreach program included some of the same language as the National Report item, but it was substantially rewritten. Not only was the topic somewhat different, but the quote from \"Horner\" was added, among other things. (The website of Starks High School in Starks, La., -- which includes students from K-12 -- does not include any staff member by that name.)", "In addition, the phone number listed as being for the \"Nationwide Muslim Youth Outreach hotline\" was actually the phone number of the Republican National Committee. RNC spokeswoman Kirsten Kukowski confirmed that the RNC had nothing to do with the piece. \"We’ve gotten calls from people giving us a heads up about this. We didn’t have anything to do with this and are telling people as much when they call,\" she said.", "The furthest back we could trace the language was to a Dec. 7, 2013, post on the website Conservative Frontline. While the National Report acknowledges that its stories \"are not reflective of the fine journalistic and editorial integrity of National Report\" and at one time included a disclaimer that that \"all news articles contained within National Report are fiction, and presumably fake news,\" we could not find any indication that Conservative Frontline is designed to be a satire site. It includes an array of articles from a conservative perspective and sometimes conspiracy theories, but does not appear to be full of satire articles. From there it spread through conservative blogs, passed off, apparently, as truth.", "Conservative Frontline did not offer any contact information on its website, so we were unable to reach its staff.", "Our ruling", "Social media posts have reprinted or linked to a story titled, \"Obama Administration Announces Nationwide Muslim Outreach Program For Children Grades K-12,\" that claims, among other things, that school children can earn higher grades for studying Islam.  It’s not true. No such program exists. In fact, part of the story has been recycled from a previous satire article that we and others debunked. We rate this claim Pants on Fire.", "Conservative Frontline, \"Obama Administration Announces Nationwide Muslim Outreach Program For Children Grades K-12,\" Dec. 7, 2013", "National Report, \"Obama Declares November National Muslim Appreciation Month,\" October 2013", "Snopes.com, \"November Surprise,\" last updated Sept. 28, 2013", "PolitiFact, \"‘Obama Declares November National Muslim Appreciation Month,’ bloggers claim,\" Oct. 3, 2013", "Email interview with Kirsten Kukowski, spokeswoman for the Republican National Committee, Dec. 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]