["About this rating", "In January 2021, readers asked Snopes to examine the accuracy and authenticity of a widely-shared online post claiming that Italian police had arrested Pope Francis in the Vatican and charged him with child pornography, human trafficking, incest, fraud, and drug-related offenses.", "On Jan. 10, Conservative Beaver, a website with a track record of publishing baseless conspiracy theories, posted an article with the headline: \"VATICAN BLACKOUT: Pope Arrested on 80 Count Indictment for Child Trafficking, Fraud.\"", "The article reported that:", "Pope Francis aka Jorge Mario Bergoglio was arrested Saturday in connection with an 80- count indictment of charges including possession of child pornography, human trafficking, incest, possession of drug paraphernalia and felony fraud.", "The Italian National Prosecutor’s Office confirmed it ordered the arrests, and filed the charges. Military officers, Italian police, and their Sex Crimes Unit went to the pope’s home in the Vatican, they arrested him and several other high ranking officials, and placed them all under arrest without incident. People near the scene have reported hearing gunshots, but the Police would not confirm if they were the ones firing the weapons.", "Pope Francis is currently being held in an unknown prison, being interrogated by Federal Agents working for the state of Italy and Interpol. The FBI is reportedly making arrangements to fly in and interrogate him once Interpol is done with him.", "The story was shared widely, especially among social media users in the United States, many of whom linked the alleged arrests to an existing, equally baseless conspiracy theory which held that shadowy figures within the Italian government — aided and abetted by former U.S. President Barack Obama and the CIA — somehow altered vote counts from the Nov. 3 U.S. presidential elections and fraudulently rendered Biden the winner.", "Claims of Pope Francis' arrest were no more than nonsensical fabrications. The article, which was published on the morning of Jan. 10, claimed that Francis was, at that time, being \"held in an unknown prison.\" In reality, the pontiff made a public appearance at his official residence, the Palazzo Apostolico (Apostolic Palace) at noon Central European Standard Time, on Jan. 10 — after Conservative Beaver posted its article. Video footage of that appearance is available here.", "Furthermore, the Vatican published a full schedule of completed events and meetings for Pope Francis for Jan. 11, 2021, the day after he was supposedly arrested, imprisoned, and supposedly \"interrogated by federal agents working for the state of Italy and Interpol.\"", "Conservative Beaver's report contained a quotation attributed to Giuseppe Governale, whom they described as \"Italy's chief anti-mafia prosecutor.\" From 2017 to 2020, Governale was head of Italy's Direzione Investigativa Antimafia (Anti-Mafia Investigative Directorate, or DIA). However, he no longer holds that position. The current head of the DIA (and therefore the actual current \"chief anti-Mafia prosecutor\") is Maurizio Vallone, who took office on Oct. 1, 2020.", "The quotation itself was also bogus, and was in fact lifted in large part from a statement provided by Kevin Turner, sheriff of Madison County, Alabama, after the arrest of Grady Paul Gaston, on Jan. 7, 2021. Below, the bogus quotation from Governale can be viewed on top, and the authentic statement of Turner can be viewed below it:", "The supposed list of charges against Pope Francis — \"an 80-count indictment of charges including possession of child pornography, human trafficking, incest, possession of drug paraphernalia and felony fraud\" — bore an uncanny similarity to the actual charges facing Gaston, as described by WHNT at the time as \"A 75-count indictment of charges including possession of child pornography, human trafficking, incest, and possession of drug paraphernalia.\"", "So it seems that the bombshell report of Pope Francis's arrest, which prompted a wave of feverish expectation among pro-Trump conspiracy theorists, was not only entirely false, but was the result of a rather lazy replication of an easily-checked, completely unrelated crime story from Alabama, days earlier.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]