["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The conservative advocacy group Crossroads GPS has a new ad that says President Barack Obama has broken his campaign promises.\n\nThe ad says, \"President Obama’s agenda promised so much,\" then recounts several areas where it says Obama broke his promises.\n\nOne those points is about taxes. The ad shows video of Obama saying, \"If you are a family making less than $250,000 a year, you will not see your taxes go up.\"\n\nThe ad’s narrator says, \"Broken: Obamacare raises 18 different taxes. … We need solutions, not just promises.\" The text on the screen says, \"$503 billion between 2010 and 2019.\"\n\nWe’ll be fact-checking the ad’s other claims in separate reports. Here, we’ll look at what the ad says about taxes.\n\nWe should note that here at PolitiFact, we consider ourselves experts on the president’s campaign promises. Our Obameter tracks more than 500 campaign promises Obama made during the 2008 campaign, including many promises about taxes.\n\nThe health care law and taxes\n\nThe ad makes a sweeping claim about taxes that suggests broad increases. It says that the health care law raised 18 different taxes, citing an analysis from the Heritage Foundation.\n\nWe know from our previous research on the law that it does in fact raise taxes. But when we looked at the issue in January 2011, we found only 13 measures that could reasonably be considered tax increases. (The other items were mostly new regulations.)\n\nMany of those taxes are aimed at health insurance companies, drug manufacturers, medical device makers or high earners, not people who make less than $250,000, as the ad says. (See our detailed list of taxes in the health care law.)\n\nWhen we looked at the list with the Crossroads statement in mind, we found only five taxes that might apply to individuals making less than $250,000.\n\nThose taxes include the following:\n\n• Higher federal excise taxes on tobacco.\n• A 10 percent excise tax on indoor tanning services.\n• Limiting the amount taxpayers can deposit in flexible spending accounts to $2,500 a year. For people who use the accounts, this could increase their taxable income. This takes effect Jan. 1, 2013.\n• Raising the 7.5 percent adjusted gross income floor for the medical expenses deduction to 10 percent. People who would have qualified for the deduction this year would pay more. This takes effect Jan. 1, 2013.   \n• A 40 percent excise tax on employer-provided \"Cadillac\" health insurance plans costing more than $10,200 for individuals and $27,500 for families. This takes effect Jan. 1, 2018.\n\nThere’s one other thing that may or may not be a tax, and it’s a biggie: the individual mandate. The mandate means that everyone has to have health insurance or pay a penalty; the Supreme Court is currently considering whether it's constitutional -- and whether it's a tax. We won’t take a side on this question here.\n\nThe tax increases on tobacco and tanning services prompted us to give Obama a Promise Broken on our Obameter for his pledge that \"no family making less than $250,000 a year will see any form of tax increase.\"\n\nBut the statement from Crossroads is different. It makes the sweeping claim that the health care law raises 18 taxes on people who make less than $250,000 when in fact many of the taxes are on corporations and health care companies. Only a few of them are on individuals in that income range.\n\nObama’s tax cuts for workers\n\nOn the other side of the equation, though, Obama has cut taxes for many people of modest means.\n\nObama pushed for small tax credits in the economic stimulus of 2009. The \"Making Work Pay\" tax credit amounted to about $400 per worker per year for two years.\n\nThen, in 2010, Obama hammered out a deal with Republicans for lower payroll taxes. That lowered them by 2 percent; with a maximum tax break of about $2,202 per year.\n\nThose tax cuts apply to all workers, while the health care tax hikes apply to more limited groups, such as smokers and indoor tanners.\n\nOur ruling\n\nThe Crossroads ad says Obama \"promised\" families making less than $250,000 a year would not see taxes go up, but \"Obamacare raises 18 different taxes.\"\n\nObama has increased a few taxes -- on tobacco and tanning -- that hit people making less than $250,000. But he also gets credit for tax breaks for workers, most notably a payroll tax holiday that is still in effect.\n\nThe Crossroads ad wrongly implies that people of modest means are getting hit with 18 tax increases because of the health care law. In fact, most of the taxes in the health care law are on high-income individuals or the health care industry. We rate their statement Mostly False.", "PolitiFact Florida is partnering with 10 News for the 2012 election. View the video version of this fact-check.", "Crossroads GPS, Obama’s promises, May 16, 2012\n\nThe Heritage Foundation, Obamacare and New Taxes: Destroying Jobs and the Economy, Jan. 20, 2011\n\nPolitiFact, Mitt Romney says Barack Obama has raised taxes 19 times, Jan. 11, 2012\n\nThe Obameter, No family making less than $250,000 will see \"any form of tax increase,\" last updated April 8, 2010\n\nThe Obameter, Create a tax credit of $500 for workers, last updated Jan. 4, 2011\n\nKaiser Family Foundation, \"Summary of New Health Reform Law,\" accessed Jan. 9, 2012\n.\nKaiser Health News, \"House Rules Committee's Analysis Of The Health Bill,\" March 18, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]