["By Jessica McDonald, Eugene Kiely and Lori Robertson", "Posted on October 6, 2020", "Even after contracting the coronavirus and being hospitalized, President Donald Trump has continued to downplay the risks of COVID-19 and exaggerate the progress the U.S. has made in fighting the pandemic.", "After he returned to the White House from Walter Reed hospital on Oct. 5, Trump released a video in which he gave a pep talk of sorts: “I learned so much about coronavirus and one thing that’s for certain: Don’t let it dominate you. Don’t be afraid of it. You’re going to beat it,” he said.", "Of course, not everyone is going to “beat it.” More than 210,000 people have died from COVID-19 in the United States, and more than 1 million worldwide.", "It’s true that the overwhelming majority of people who have contracted COVID-19 have survived it. The case fatality rate in the United States is now 2.8% — that’s the percentage of those with confirmed cases who have died. And since not everyone who has been infected has been tested, experts estimate the fatality rate for the coronavirus is likely between 0.5% and 1%.", "The chances of “you” beating it are quite good. But there are risk factors that make some individuals more likely to fare well than others.", "The older the patient, the greater the risk of hospitalization and death. Figures from the CDC, based on data available through Aug. 18, show that people ages 65 to 74 are five times as likely as 18- to 29-year-olds to be hospitalized and 90 times more likely to die. Those ages 75 to 84 are eight times as likely to be hospitalized and 220 times more likely to die than the young-adult cohort.", "Underlying medical conditions, including diabetes, obesity, high blood pressure, asthma and chronic kidney disease, increase the risk of hospitalization, the CDC says.", "CDC data for the year show that 12.7% of those ages 70-79 who were confirmed to be infected with COVID-19 died, and 26.6% of those age 80 and older who were infected died. The dataset has some missing and unknown data on deaths, but from the available information, those fatality rates contrast with just 1.6% for those ages 50-59 and 0.07% for 20- to 29-year-olds who were known to be infected.", "Even younger Americans die from the disease, but the rate of death increases with age. For the month of August, there were 5 deaths among those 9 years of age and younger, 16 deaths among 10- to 19-year-olds and 75 deaths among 20- to 29-year-olds. But among those with COVID-19 in the 60-69 age group, 1,890 died in August and 5,638 who were 80 and older died.", "The impact of COVID-19 also has been disproportionate based on race and ethnicity. Mortality rates, meaning the deaths per total population not deaths per those infected, are significantly higher among Black Americans (97.9 deaths per 100,000), indigenous Americans (81.9 deaths per 100,000), Pacific Islanders (71.5) and Latinos (64.7) than whites (46.6) and Asians (40.4), according to data compiled by the APM Research Lab through Sept. 15.", "Also, among the coronavirus patients who recover, some experience long-term effects and symptoms.", "As we’ve written before, these so-called “long-haulers” have shared their stories in online support groups and with journalists. Some patients report months of extreme fatigue or on-and-off again symptoms such as headaches, brain fog or shortness of breath that make daily life difficult. They are still trying to “beat” COVID-19.", "On Oct. 6, the morning after returning to the White House from a three-day stay at Walter Reed National Military Medical Center, Trump tweeted about the flu, reviving an old, false claim that the coronavirus is less deadly than seasonal influenza.", "“Flu season is coming up! Many people every year, sometimes over 100,000, and despite the Vaccine, die from the Flu,” Trump wrote. “Are we going to close down our Country? No, we have learned to live with it, just like we are learning to live with Covid, in most populations far less lethal!!!”", "Trump exaggerates the death toll from influenza and misleadingly says COVID-19 is “in most populations far less lethal.” That’s likely true for children and some younger people, but not other groups, for whom the risk of death from infection is either similar to flu or significantly higher.", "Twitter put a warning on Trump’s tweet for violating its rules on “spreading misleading and potentially harmful information related to COVID-19.”", "Data from the Centers for Disease Control and Prevention show that for the past decade, seasonal influenza has claimed between 12,000 and 61,000 lives each year — and on average, fewer than 40,000 lives.", "The worst season in the past 10 years was the 2017-2018 season, which the CDC estimates killed 61,000 people, with a range of 46,000 to 95,000 deaths. Even factoring in the range, however, that season is not thought to have taken more than 100,000 lives.", "The CDC’s estimates for earlier seasons also are below Trump’s 100,000 figure. According to a 2010 Morbidity and Mortality Weekly Report, seasonal influenza-associated deaths between 1976 and 2007 ranged from a low of 3,349 in 1986-1987 to 48,614 in 2003-2004.", "These figures, importantly, are not reports of individual deaths, which is what we have for COVID-19, but rather are estimates based on mathematical modeling. For this reason, they cannot be directly compared with the COVID-19 death toll, which at exceeds 210,000 in the U.S. as of Oct. 6 and is almost certainly an undercount.", "In any case, even using that figure, COVID-19 has killed more people in the U.S. than the past five flu seasons combined. A preliminary estimate for the 2019-2020 season, which overlapped to a small degree with COVID-19 this spring, estimates flu deaths at 22,000 — about 10 times lower than the number of COVID-19 deaths so far this year.", "Another sign that COVID-19 has caused unprecedented mortality is the large number of excess deaths since the virus arrived in America. The CDC’s latest estimate is that between Feb. 1 and Sept. 19, there have been between 214,865 and 285,404 more deaths in the U.S. than usual, with a middle estimate of just over 250,000 excess deaths. While not all of these deaths are due to COVID-19, some fraction of them are.", "Trump’s claim that COVID-19 is “in most populations far less lethal” than the flu is misleading.", "Experts say that overall, COVID-19 is more deadly than seasonal flu, for which the mortality rate is “usually well below 0.1%,” according to the World Health Organization.", "As we’ve discussed before, the true infection fatality rate, or percentage of deaths out of all infections, for COVID-19 isn’t entirely clear, but the WHO estimates it to be between 0.5% and 1%.", "It is true that flu is likely more risky for most children than COVID-19.", "The CDC’s website says the “risk of complications for healthy children is higher for flu compared to COVID-19,” although it notes that infants and kids with underlying medical conditions are at increased risk for both viral infections — and that school-aged children infected with COVID-19 are at higher risk of Multisystem Inflammatory Syndrome in Children, “a rare but severe complication of COVID-19.”", "The CDC also provides its own estimate of the infection fatality rate by age, but it is based on a single paper covering six European regions — and is not meant to be an estimate of the impact of COVID-19.", "According to the agency, the infection fatality rate is very low for kids 19 years old and younger — at 0.003% — and quite low for adults ages 20 to 49, at 0.02%. But for people ages 50 to 69, the infection fatality rate is significantly higher, at 0.5%, and a whopping 5.4% above the age of 70.", "Around 117 million people in the U.S. are 50 or older, accounting for more than a third of the country. Many people of all ages also have one or more risk factors for COVID-19, which would alter their individual risk.", "Regardless, experts say the infection fatality rate is not the only measure that matters when it comes to knowing how dangerous a virus can be to a population.", "Unlike seasonal influenza, for which there are approved drugs and a vaccine, there are only a limited number of therapies for COVID-19. And much of the population has some immunity to flu viruses each year, since they circulate seasonally, coming back in modified, but not entirely new forms. That’s not the case for SARS-CoV-2, which is a new pandemic virus, so many more people are susceptible.", "The coronavirus is also thought to spread more easily than seasonal flu and poses particular challenges as more cases are linked to superspreading events.", "“While COVID-19 and flu viruses are thought to spread in similar ways, COVID-19 is more contagious among certain populations and age groups than flu,” the CDC explains on its website. “Also, COVID-19 has been observed to have more superspreading events than flu. This means the virus that causes COVID-19 can quickly and easily spread to a lot of people and result in continuous spreading among people as time progresses.”", "Thus, even if younger people are less at risk from the coronavirus than flu, if they spread it to older people, as the CDC has suggested has happened, the damage can be significant.", "As Dr. Lee Riley, professor and chair of the Division of Infectious Disease and Vaccinology at the University of California, Berkeley School of Public Health, told us previously, “I’m more concerned about the actual numbers of people who are dying rather than the percent.”", "The data to date show there’s no contest between COVID-19 and seasonal influenza — the coronavirus has killed far more people and the pandemic is still ongoing.", "In tweets and video appearances during his convalescence, Trump repeatedly boasted about available COVID-19 therapeutics, taking undue credit for the developments and exaggerating the degree to which they are known to be effective.", "In an Oct. 3 video filmed at Walter Reed — a day into Trump’s hospital stay — the president likened the therapeutics to miracles.", "“If you look at the therapeutics, which I’m taking right now, some of them, and others are coming out soon that are looking like, frankly, they’re miracles, if you want to know the truth, they’re miracles,” he said. “People criticize me when I say that, but we have things happening that look like they’re miracles, coming down from God.”", "Two days later, Trump echoed the claim, but also took credit for the drug developments.", "“We have developed, under the Trump Administration, some really great drugs & knowledge,” Trump said in an Oct. 5 tweet announcing his departure later that day from the hospital.", "And in an Oct. 5 video released after Trump’s return to the White House, he once again returned to the subject. “We have the best medical equipment. We have the best medicines, all developed recently, and you’re going to beat it,” he said, after advising the public not to be afraid of the coronavirus.", "In reality, as we’ve explained, there remain few treatment options for COVID-19, with the mainstay primarily being supportive care. And of the few drugs that do exist, some are either not yet widely available to the public, have yet to demonstrate a mortality benefit or were not investigated in the U.S.", "The FDA has not approved any drugs for COVID-19, but has issued a few emergency use authorizations, or EUAs.", "According to his physicians, Trump received at least three drugs: an investigational antibody cocktail normally unavailable outside of a clinical trial, the antiviral remdesivir and the steroid dexamethasone.", "Dexamethasone is the only drug that has been shown to help hospitalized COVID-19 patients survive in a clinical trial, but its use is relatively limited. It is recommended only for patients on a ventilator or receiving supplemental oxygen, as it may harm other patients. It is also hardly a cure, as it reduced death by 18% in patients receiving oxygen and 36% in those who were ventilated.", "The drug was developed in the U.S., but more than a half century ago. The randomized controlled trial establishing its utility in COVID-19 patients was conducted in the U.K.", "Remdesivir has been shown to shorten the time to recovery for hospitalized COVID-19 patients, but whether it provides a mortality benefit is still unknown. The FDA is permitting its use under an EUA that is restricted to hospitalized COVID-19 patients.", "While the trials demonstrating an effect in COVID-19 patients were done during the Trump administration, getting the drug to that point goes back more than a decade. Remdesivir was famously tested against the Ebola virus in 2014 and then was tested against other coronaviruses, including the SARS and MERS viruses, setting it up nicely as a candidate that might work against the novel coronavirus, SARS-CoV-2.", "Trump’s third drug, an antibody cocktail targeting the coronavirus made by the biotech company Regeneron, is widely viewed as a promising potential therapy. But there is no proof yet that the therapy is effective, and it’s not yet available to the vast majority of the country.", "On Sept. 29, the company announced preliminary results from its first 275 patients, saying in a press release that its antibody cocktail reduced viral levels and reduced symptoms among non-hospitalized COVID-19 patients.", "Other companies are working on developing similar antibodies, and Eli Lily issued similar interim results via press release.", "Trump received Regeneron’s product, which is still in testing and has not received an EUA from the FDA, through a compassionate use request. Normally, the only way to receive such a medicine would be to participate in a clinical trial.", "The company explained in a statement that its focus was on maintaining enough supply of its cocktail for trials, and said there “is limited product available for compassionate use requests that have been approved under rare, exceptional circumstances on a case-by-case basis.”", "Even if the antibodies do pan out in trials and are approved, there is concern that their supplies will be limited because making the proteins is a complex and expensive process.", "In urging the public not to let COVID-19 “dominate your life,” the president boasted on Twitter and in a video that he is feeling “better than 20 years ago.”", "But the president may not be — in the words of his doctor — “out of the woods” yet.", "In confirming that Trump would be released from the hospital, Dr. Sean P. Conley, the president’s physician, said: “Though he may not entirely be out of the woods yet, the team and I agree that all our evaluations — and most importantly his clinical status — support the president’s safe return home, where he’ll be surrounded by world-class medical care 24/7.”", "There is no question that the president’s condition has improved. Trump initially had a fever, a mild cough, fatigue and at least two brief drops in his oxygen saturation level, according to his doctors. But, as of Oct. 5, the president had been fever-free in the last 72 hours, hasn’t required any additional oxygen and hasn’t complained of shortness of breath, his doctors said.", "As for his vital organs, the president’s “cardiac, liver and kidney function demonstrates continued normal findings or improving findings,” Dr. Sean Dooley, a pulmonologist at Walter Reed, said on Oct. 4.", "However, the president’s doctors have repeatedly declined to answer questions about Trump’s lung function.", "On Oct. 4, Conley was vague when asked about signs of pneumonia or lung damage, saying there had been “some expected findings, but nothing of any major clinical concern.” On Oct. 5, he declined again to reveal the results of X-rays or CT scans, citing a federal law that prevents a doctor from discussing a patient’s health without the patient’s consent.", "Trump remains at risk for developing a more severe case of COVID-19.", "Dr. Ilan Schwartz, assistant professor of infectious disease at the University of Alberta, told the New York Times in April that some patients experience “a very nasty second wave” of the illness between five to 10 days after experiencing symptoms. “After the initial symptoms, things plateau and maybe even improve a little bit, and then there is a secondary worsening,” Schwartz said.", "That is especially for older people with underlying health conditions. At 74 years old, Trump is at higher risk than younger people for contracting a serious case of COVID-19, and males have consistently had worse outcomes, on average, than females. He is also slightly obese, with a body mass index of 30.5 (30 is considered obese) — another risk factor.", "When confirming Trump’s release from the hospital, Conley said Trump is still within that 10-day window and won’t take “that final deep sigh of relief” until next week.", "Reporter, Oct. 5: You had said that seven to 10 days was a window that you’d be concerned about. I don’t think we’re there yet. So, do you have concerns about potential worsening or reversal? And what are your plans for addressing that if it were to happen?", "Conley: You’re absolutely right. And that’s why we all remain cautiously optimistic and on guard because we’re in a bit of unchartered territory when it comes to a patient that received the therapies he has so early in the course. So, we’re looking to this weekend. If we can get through to Monday with him remaining the same or improving, better yet, then we will all take that final deep sigh of relief.", "In his video after being released from the hospital, Trump said that “the vaccines are coming momentarily.” It is not clear yet when vaccines will be available, but even in a best-case scenario it won’t be “momentarily” for the general population.", "As we have written before, there are four companies running phase 3 trials of a coronavirus vaccine in the U.S. A successful phase 3 trial is the final step needed for approval. Assuming the trials go well and the shots are found to be safe and effective, one or more vaccines may be available by the end of the year or by early 2021 to select groups, such as health care workers and adults with underlying conditions.", "Members of the general population who are not prioritized for vaccination, however, are not expected to be able to receive a vaccine until later in 2021.", "According to guidance the FDA released on Oct. 6, the agency is looking for phase 3 trial data that include “a median follow-up duration of at least two months after completion of the full vaccination regimen.”\nThat timeline makes it very unlikely that any vaccine would receive authorization prior to Nov. 3, Election Day.", "(We deal more extensively with the status of the vaccine candidates in “Updated: Q&A on Trump’s COVID-19 Diagnosis.”)", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]