["About this rating", "In March 2016, a number of news sites published items about a (nearly too funny to be true) accident involving a Fiat and a wall painted to look like a Looney Tunes' Road Runner-style fake tunnel:", "Mandatory, Jalopnik, the Atlanta Journal-Constitution, and Atlanta television station WSB were among the news outlets that covered the purported crash, with most reports consisting solely of two to three sentences explaining that the accident was documented by a Reddit user with no independent verification of the claim. Among those outlets, only Jalopnik pointed out that the story was unauthenticated and not very plausible:", "There hasn’t been much more information about exactly what happened, with most stories about the event simply referencing the Imgur post. I haven’t found much more information either, to get details or prove this is what actually happened, or anything, really. But I’m not sure how much I care. As long as no one was hurt, I sort of want this to be true. The picture told in these stories is one of a glorious, messy intersection between the rules of the cartoon world and the rules of reality.", "As the writer observed, the short tale consisting mostly of pictures hit all the right notes for social media virality, and no one (including news outlets) seemed to care much whether it really happened. The photograph-based narrative included nostalgic references (Looney Tunes), little need for explanation, and the chance to feel superior to the unfortunate individual stupid enough to drive into a painted wall. The element of childhood memories was expressed in memes that circulated around the same time:", "Most people of driving age would get the joke, and of course be aware that the included image of Road Runner suggested an apparent tunnel was not to be trusted. A few posts cited a 17 December 2015 item by the British tabloid Mirror, which was a good example of most coverage of the claim:", "A driver got the fright of his life when he tried to drive through a tunnel — only to find out it was PAINTED onto a wall. The bizarre incident was something straight out of a Road Runner cartoon. The wall even featured an image of the cheeky fast-moving bird made famous by Looney Tunes peering at the tunnel. It was no laughing matter for the driver though, as it left his car in quite a state. The image, shared on Reddit by user Miss Reb entitled \" So this happened ...\", shows the before and after scene, and the driver of the red Fiat managed to take a smash to the front of his car.", "As that post noted, the image was submitted on Reddit's r/funny on 16 December 2015, and at the same time, a different user posted it with the same title to Imgur. The Atlanta-Journal Constitution described the Reddit post in this way in March 2016:", "Reddit user \"Miss Reb\" posted pictures she took of a Fiat that drove into a wall painted like a tunnel complete with the animated road runner standing beside it.", "However, the Reddit user didn't claim to have taken the images, nor did he or she add any information about the purported crash. In fact, that Reddit account had been used solely to post images (mostly of a pornographic nature) and seemingly shared the picture just to accrue points on the site. Despite the virality of the photographs, the user never returned to offer details of alleged incident or claim ownership of the images. The Imgur user similarly did claim to have been the source of the pictures and frequently shared images that appeared to come from other sources. At least one web site took a closer look at the images and pointed out that the chain of events suggested was easily proved false, as the various pictures weren't even photographs of the same car — the first car depicted was a Fiat Uno, and the second a Fiat Strada:", "Although both cars were red Fiats, the Strada featured a distinctive grill not present on the Uno, and the Uno's boxy rear was unlike the Strada's (which featured a bed). Also, the three photographs were not clearly connected to one another: In addition to the depiction of different cars, the pictures included no indication that the scene involving the crashed Strada occurred anywhere near the painting of the tunnel.", "A December 2015 article (published in Portuguese and translated below) pinned the original painting to Brazil, and contained two of the three images spliced together for the viral story. However, that article explained that painting had been removed in December 2015 to avoid crashes and that no such crash had occurred by the time it was painted over:", "The reason the work, which was inspired by Road Runner cartoons,  was deleted was to prevent the picture from confusing drivers and causing accidents. The mural was painted on Monday, 14 December 2015. Netizens also circulated the image of a crumpled car that they said was involved in an accident after the driver did not notice that the tunnel was not real. However, the Company's President Director of Traffic Safety and Juazeiro Transport, Fábio Assis, denied that there had been a collision. \"This rumor circulated on the internet along with this picture of a car. There were no accidents at the site. As soon as we learned of the existence of the painting, we immediately tried to erase it. During the day, it looked like a child's painting and was almost imperceptible, but at night it was really deceptive. So we tried to act quickly, taking into account worries about the safety of drivers,\" he said.", "As the excerpt explained, officials in the area of the mural became aware of the Internet fabrication and painted over the mural. In the short time the Road Runner tunnel painting was visible, no crashes occurred. The claim became newly viral in March 2016, several months after it appeared on Reddit, but the story was proved to be false in December 2015. Much like a similar claim about a hairdressing mishap, news outlets primarily sourced the photographs from the Internet without examining whether the backstory offered was in any way plausible.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]