["About this rating", "On 1 July 2017, dubious web site AllNews4US.com posted a story based around a claim that a \"Muslim figure\" threatened to leave the United States. The story did not name the figure or elaborate on any details that indicated that it might have any truth to it whatsoever, but despite that detail (and being nearly incoherent), the story was picked up and subsequently further spread by several other dubious, clickbaity sites with names such as \"Freedom Writers\", \"USA Life Buzz\", and \"World Source Media\".", "There is no mention of a \"Muslim figure\" in the story itself, but it does include a picture taken from a November 2016 interview with a Muslim woman: Fusion correspondent Alaa Basatneh. Other variations of the story use a picture taken from a June 2015 CNN interview with another Muslim woman, Tahera Ahmad, the director of interfaith engagement at Northwestern University, while others use a stock image of a Muslim woman, but never is the \"Muslim figure\" named.", "The article, such as it is, actually is a misrepresentation of an actual news story out of France, but it does not make mention of any specific actions in the United States:", "Muslim migrants have turned into a worldwide issue, and the circumstance deteriorates each day. Our nation has had a considerable measure of Muslim-related issues of late, yet this time settlers went too far. President Donald Trump had the ideal answer for the issue forced by outsiders, however Democrats didn’t bolster him. You won’t think about what occurred next…", "The story does contain a reference to President Donald Trump's ban against travel into the U.S. from several countries with large Muslim populations, calling it an \"ideal answer\".  Then it shifts gears and highlights Michel Rotger — conservative mayor of the French city of Chevigny-Saint Sauveur — and his purported decision to ban any school menu that excludes pork.  That story was first reported by the French magazine L'Express, but still makes no mention of anything related to the United States.", "The story also mentions a man identified as Paul Garrigue, who opposes the mayor's move. Garrigue is described as the \"president of a group of about ten associations, including the League of Human Rights and Amnesty International.\" But he is not identified as a Muslim or a spokesperson for any Muslim-affiliated group. Garrigue is listed as a member of the League of Human Rights' central committee.", "Stories about pork bans (or \"bowing to Sharia law\") are a popular trope in certain corners of the fake news ecosystem.  This particular story bears a more-than-passing resemblance to articles and rumors from 2014 about a mayor in Ath, Belgium who refused to allow halal cafeterias. That story, like this one, turned out to be a complete hoax.", "L'Express.\r\n   \"Pork in the canteen: a mayor of Côte-d'Or ends the alternative menus.\"    27 June 2017.", "CNN.\r\n   \"Muslim Woman Claims Discrimination on United Flight.\"   2 June 2015.", "Richmond, Kait.    \"Muslim Woman: I Don't Feel Safe in US Wearing a Headscarf.\"\r\n  CNN.   16 November 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]