["By Angelo Fichera", "Posted on July 11, 2019", "A viral meme falsely accuses five House Republicans of voting with Democrats to create a “firearms registry.” The bill in question specifically prohibits “the establishment, directly or indirectly, of a national firearms registry.”", "A gun control bill that passed the House 240-190 earlier this year was largely shepherded by Democrats, who assumed control of the chamber in January.", "And while the GOP-controlled Senate is unlikely to consider the bill, the Bipartisan Background Checks Act of 2019, or H.R. 8, did receive “yea” votes from eight House Republicans, five of whom were co-sponsors of the legislation.", "A viral meme that was posted to Facebook in May, and that is making the rounds again, accuses those five co-sponsors of joining Democrats “to institute a firearms registry.”", "That’s false.", "First of all, federal law, including the Firearms Owners’ Protection Act of 1986, currently forbids the U.S. from creating a national registry. And the House bill states that “[n]othing in this Act, or any amendment made by this Act, shall be construed to … authorize the establishment, directly or indirectly, of a national firearms registry.”", "The bill would expand the scenarios in which a background check is required for the sale or transfer of a firearm. While current federal law requires licensed gun dealers to conduct background checks on prospective buyers, the bill would also require background checks before a private sale or transfer between unlicensed individuals, such as some sales at a gun show or online. A number of states already have similar policies in place.", "The bill does include exceptions for certain exchanges, such as: a loan or gift made between spouses, parents and children, and other close relatives; a temporary transfer “necessary to prevent imminent death or great bodily harm;” and a temporary transfer at a shooting range or for hunting or fishing (assuming that the borrower is not barred from possessing a gun under state or federal law, and that the owner has no reason to believe the gun will be used for a crime).", "So why the confusion?", "“Part of this confusion may be, frankly, intentional,” Daniel Webster, director of the Johns Hopkins Center for Gun Policy and Research, told us. “I think it’s mostly a political tactic because people don’t want to talk about the substance of the bill.”", "Webster added: “What H.R. 8 sets up, simply, is a pretty straightforward thing — which is, we already have a background check system for transactions that occur when the entity doing the transfer or selling is a federally licensed firearms dealer. We’re going to apply that same exact system to a private transfer.”", "Some Second Amendment advocates still correlate the bill with “the Beginning of a Firearm Registry,” as the National Rifle Association’s lobbying arm said on its website. And some have taken that further, tying the legislation to potential gun confiscation.", "“Is this a national registry in the narrowest sense of the term?” said David Kopel, research director of the Independence Institute, a Colorado-based, “free-market, pro-freedom” think tank. “The answer would be no. But it is also clearly intended to move us closer to that direction.”", "That’s a similar argument to one that was made in 2013 by opponents of a similar proposal to expand background checks that followed the Sandy Hook Elementary School shooting in 2012.", "Under the House bill, in order to complete a private sale or transfer, the gun owner would need to go through a licensed dealer or manufacturer to facilitate the background check — conducted using a Firearms Transaction Record, or Form 4473.", "Those forms stay with the gun dealer after the background check, but the purchaser’s information that is relayed to the FBI’s National Instant Criminal Background Check System must be destroyed within 24 hours after the approval.", "However, the Forms 4473 retained by licensed dealers must be provided to the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives, or ATF, if and when the business closes.", "But even when the ATF does collect records from federally licensed dealers that go out of business, they are stored in a system of “digital images not searchable through character recognition,” according to a 2016 report by the Government Accountability Office, which noted, “firearms purchaser information … is not accessible to ATF through a text search.”", "Kopel also cited cases of ATF copying records during inspections — a concern the ATF has publicly addressed before, including in a 2012 letter to Congress.", "An ATF spokeswoman, Regina Milledge-Brown, told us in an email that, “in accordance with Federal statute and case law, Industry Operations Investigators (IOIs) will make photocopies of the records of an FFL during a lawful compliance inspection for the purpose of examination or as evidence of a crime.”", "“ATF’s authority is limited to situations that include Form 4473 transaction records with background check results such as when the copies are needed to ensure compliance with recordkeeping requirements of the Gun Control Act or when the records constitute material evidence of a violation of law,” she said. “Records unrelated to the Gun Control Act are not photocopied. Any Form 4473 transaction records photocopied during lawful compliance inspection are copied to document regulatory or criminal violations.”", "Milledge-Brown also said the system that stores images of records from out-of-business licensees “does not store copies of records from lawful compliance inspections.”", "Regardless, Webster said, the current background check system and records policies would remain unchanged by H.R. 8. The only difference, he said, is an increase in the number of records being created — since licensed dealers and manufacturers also would conduct background checks during certain private exchanges between unlicensed individuals.", "A spokesman for Michigan Rep. Fred Upton, one of the Republicans the meme targets for co-sponsoring H.R. 8, also emphasized the language in the bill.", "“The bill explicitly says and is very clear,” Josh Paciorek said in an email, “nothing in the bill would establish a national firearms registry.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“About NICS.” FBI.gov. Accessed 10 Jul 2019.", "Kopel, David. Research director, Independence Institute. Phone interview with FactCheck.org. 9 Jul 2019.", "Firearms Owners’ Protection Act of 1986. Pub. L. 99-308. 100 Stat. 449-461. 19 May 1986.", "Milledge-Brown, Regina. Spokeswoman, U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives. Email to FactCheck.org. 11 Jul 2019.", "Paciorek, Josh. Spokesman, U.S. Rep. Fred Upton. Email to FactCheck.org. 9 Jul 2019.", "U.S. Government Accountability Office. “FIREARMS DATA: ATF Did Not Always Comply with the Appropriations Act Restriction and Should Better Adhere to Its Policies.” June 2016.", "U.S. House. “H.R. 8, Bipartisan Background Checks Act of 2019.” (as passed by the House 27 Feb 2019.)", "Webster, Daniel. Director, Johns Hopkins Center for Gun Policy and Research. Phone interview with FactCheck.org. 10 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]