["Maria Hamilton (far left) and other mothers who lost children to gun violence or after contact with police appeared at the 2016 Democratic National Convention. Hamilton's son, Dontre Hamilton, was killed by Milwaukee police in 2014. (Getty Images)", "The day after a sniper killed five Dallas police officers, Milwaukee Police Chief Edward Flynn held a news conference to share his reaction and to comment on policing in his city.", "He made an important claim that would become even more significant in the weeks to come.", "The chief stated:", "\"We stand ready to be judged by the standards of our own training, our own selection criteria, our own highly limited use of deadly force -- among the lowest rates in the country -- as well as the remarkable examples, time after time, when police officers in this city are justified in the use of deadly force, but do not use it.\"", "Flynn made the statement on July 8, 2016. Five weeks later, on Aug. 13, one of his officers fatally shot an armed man during a foot chase in an incident that touched off two days of violence that made national news. (It was the third such fatality in Milwaukee in 2016.)", "So, do Milwaukee police use deadly force at a rate that is among the lowest in the country?", "It’s a broad statement that is supported by national data for 2015. But there simply isn’t national data to compare cities for prior years.", "Data is limited", "To back the chief’s statement, a Milwaukee police spokesman directed us to a fatal police shootings database for 2015 created by the Washington Post.", "Criminologists regard it as the best current source of information on fatal shootings committed by police.", "But since 2015 is the only full year of data available, it is a \"snapshot of one year,\" University of Missouri-St. Louis criminologist David Klinger told us.", "Nationwide, according to the Post, there were 990 people shot and killed by police around the country in 2015 (as well as nearly 600 so far in 2016).", "A quick breakdown of the 2015 figures:", "Eleven of the 2015 fatal shootings occurred in Wisconsin, but just one in Milwaukee. Tyrone Ryerson Lawrence, a 45-year-old black man, was shot inside a home. He refused to drop a knife and an officer shot him, fearing that Lawrence would stab his wife, according to police.", "There’s no question that one is a low number -- particularly for a city with a population of 600,000.", "The bigger picture", "But Flynn made a general claim about Milwaukee having a low rate in the use of deadly force, not a claim about a single year.", "And numbers can vary relatively significantly in a given year. In 2013, for example, Milwaukee police fatally shot four people.", "We found that based on population, some cities had a much lower rate than Milwaukee that year: San Francisco police killed one person, while the number was three in Austin, Texas (which serves 842,000 people), San Jose, Calif. (982,000), and Las Vegas (nearly 1.5 million).", "To be sure, the raw numbers haven’t ranged widely in Milwaukee -- 2012 -- 1; 2013 -- 4; 2014 -- 2; 2015 -- 1.", "But without national figures for anything but 2015, we don’t know how Milwaukee’s rate compares.", "Our rating", "Flynn said Milwaukee police use deadly force at a rate that is \"among the lowest\" in the country.", "Flynn bases his claim on the best data currently available, which show Milwaukee police killed one person in 2015. But 2015 is the only full year for which data are available on a national level; we simply don’t know how Milwaukee’s rate would compare in prior years.", "Our definition of Half True is a statement that is partially accurate but leaves out important information. That fits here.", "YouTube, WISN-TV video of Milwaukee Police Chief Edward Flynn news conference, July 8, 2016", "Email, Milwaukee police spokesman Sgt. Timothy Gauerke, July 19, 2016", "Email, Milwaukee police spokesman Jeff Gallagher, July 30, 2016", "Washington Post, \"990 people shot dead by police in 2015\"", "Washington Post, 2016 police shooting database, accessed Aug. 2, 2016", "Interview, University of South Carolina criminology and criminal justice professor Geoffrey Alpert, Aug. 1, 2016", "Interview, University of Louisville criminology and criminal justice professor Justin Nix, Aug. 1, 2016", "Interview, University of Missouri-St. Louis criminology and criminal justice professor David Klinger, Aug. 1, 2016", "Email, University of Nebraska at Omaha emeritus professor of criminal justice Samuel Walker, July 29, 2016", "PolitiFact Wisconsin, \"Fatal police shootings occur in tiny percentage of arrests in U.S., Milwaukee's police chief says,\" Aug. 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]