["CFO Alex Sink, a Democrat running for governor, is appealing to Florida’s elderly by putting the spotlight on a two-year crackdown on an investment scam and refund to a Delray Beach woman.", "Sink wrote about the episode in a fundraising e-mail to supporters.", "\"As Florida’s CFO, I shut down [Larry] Krakow's scam and refunded more than $1.2 million to Josephine [Passinissi] and other victims of this con man,'' she said in an e-mail addressed to \"Dear Friend.\" It said: \"Please contribute $25, or whatever you can, right now to help me keep fighting for Floridians like Josephine.\"", "Sink’s e-mail contains several claims, but we're focusing on two: Whether the CFO's office shut down the investment \"scam\" and whether it returned $1.2 million to Passinissi and the others.Sink has been claiming credit for the crackdown and using it to promote her Safeguard Our Seniors Task Force since her office put out a release on Sept. 28, 2009, under the headline \"CFO Sink Returns $1.2 Million to Delray Beach Seniors Scammed out of Life Savings.\"The Miami Herald wrote a brief item about the episode at the time that called it insurance fraud and likewise characterized it as Sink returning $1.2 million to four Delray Beach seniors \"after they were allegedly misled into buying equity indexed deferred annuities.\" It said Larry Yale Krakow, who sold the investment products to them, was suspended from selling insurance and was ordered to pay a $25,000 fine.A deferred annuity is an investment product packaged with an insurance policy, in which an insurance company guarantees an income stream to the investor starting at a specified future date in return for a lump sum or series of payments. But the products are usually considered inappropriate for seniors because they tie up needed income.The Herald noted that annuities scams involving seniors have been a growing problem in Florida. And that the Department of Financial Services launched 267 senior annuity investigations in the fiscal year ending June 30.Kevin Cate, Sink's press secretary at the Florida Department of Financial Services, provided us with links to the Florida statutes that illustrate the CFO's authority on the topic. The law also notes the rights of victims not to be identified. He faxed us the 2008 and 2009 settlement agreements that resolved four citizens' complaints against the Allianz insurance company, which Krakow purportedly represented, brought by the Florida Department of Insurance Division of Legal Services. Each had the seniors' identities redacted, but a summary page showed the range in reimbursements. The smallest was $19,319.27, while the largest was for one investor with nine annuities valued at $932,837.09.His summary page also noted that, with subsequent settlements, the figure was more than $1.5 million, which was slightly higher than Sink had said.", "Sink’s office handled the case through its Division of Insurance Fraud, which is part of the Department of Financial Services.Reached by telephone, Passinissi confirmed the refund. She said her share of it was $270,000. A former owner of a private employment agency, Passinissi, 74, said she tried to get her money out of the annuity in 2008 by contacting the insurance firm itself -- to no avail. She mentioned her plight to a banker she knew, who sent her to Sink. Passinissi said she called and then wrote Sink directly -- and enclosed documents to illustrate the problem.Passinissi is happy to see Sink take credit.\"She wrote to me way, way back and I remember I was very impressed. She said, 'Don’t worry we’ll get to the bottom of it.' After that she sent a person to get a deposition from me, to get the facts,\" Passinissi said.As CFO, Sink oversees the Department of Financial Services, which investigated the complaints and arranged for people such as Passinissi to recoup their money. Sink's claim actually understates the amount that was recouped (she said $1.2 million when it ultimately totaled $1.5 million), but we find she can rightly claim credit for the department's work.So we rate Sink’s claim to be True.", "Office of the Florida Chief Financial Officer. CFO Sink Returns $1.2 million to Delray Beach seniors scammed out of their life savings. Sept. 28, 2009..Office of Florida Chief Financial Officer. CFO Sink Takes Fight for Tougher Senior Investor Fraud Laws to Palm Beach. Feb. 23, 2010.Palm Beach Post Money article. Bill targets annuity scammers. Feb. 12, 2010.Financial Industry Regulatory Authority. Equity-Indexed Annuities - A Complex Choice. Undated.Financial Industry Regulatory Authority. Equity Indexed Annuity Alert. Undated. Miami Herald. Florida Business Brief, “Insurance Fraud.\" Sept. 29, 2009.Telephone interview with Josephine Passinissi, of Delray Beach. March 15, 2010Telephone interview with Alex Sink campaign press secretary Kyra Jennings. March 15, 2010Telephone interview, e-mail and fax exchange with Kevin Cate, press secretary, CFO Alex Sink, Florida Department of Financial Services, March 16, 2010.Ninety-one pages of settlement documents, including a summary, provided by CFO spokesman Kevin Cates in fax to The Miami Herald on March 16, 2010.Florida Legislature. 2009 Florida state statute, Insurance Code: Administration and General Provisions. Undated.", "Florida Legislature. 2009 Florida state statute, Chapter 626, Insurance Field Representatives and Operations. Undated.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]