["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hours before President Donald Trump revealed the recipients of his \"fake news awards,\" one Republican lawmaker took to the Senate floor to deliver a stern warning about the perils of undermining journalism.", "Sen. Jeff Flake, R-Ariz., cautioned that Trump’s anti-press rhetoric, such as calling the New York Times, CNN and ABC News an \"enemy of the American people,\" serves to embolden repressive governments around the world.", "\"Not only has the past year seen an American president borrow despotic language to refer to the free press,\"  Flake said, \"but it seems he has in turn inspired dictators and authoritarians with his own language. This is reprehensible.\"", "Flake then ticked off several examples where foreign leaders deployed the phrase \"fake news\" to foster distrust of the media. Based on our review of the evidence, it’s reasonable to conclude that Trump’s disparagement of the media has been replicated abroad.", "An aide to Flake said the senator had referred to a Politico article that identified more than 15 instances where foreign leaders invoked the phrase \"fake news.\" Here’s a sample:", "Syrian President Bashar al-Assad in February invoked \"fake news\" to dismiss an Amnesty International report that up to 13,000 prisoners had been executed in one of his military prisons, saying the allegations were a reminder that \"we are living in a fake news era.\"", "A security official in Buddhist-majority Myanmar in December used the term \"fake news\" to deny the very existence of the Rohingya people, a persecuted Muslim minority who are being ethnically cleansed, according to the United Nations. \"There is no such thing as Rohingya,\" the Myanmar official said. \"It is fake news.\"", "Venezuela's President Nicolas Maduro in July said it was \"fake news\" that a constitutional crisis was playing out in Venezuela against a backdrop of widespread protests, human rights abuses and long-standing economic privation. \"The media spreads lots of false versions, lots of lies. This is what we call 'fake news' today, isn't it?\" he told Russian broadcaster RT, which the U.S. government considers a Kremlin propaganda outlet.", "An op-ed with the headline \"Trump is right, fake news is the enemy, something China has known for years\" ran in May in the People’s Daily, the official newspaper of the Communist Party in China, which is perennially a leading jailer of journalists.", "Philippine President Rodrigo Duterte in October said he had been \"demonized\" through \"fake news\" coverage of his brutal drug war, which has seen an unprecedented scale of extrajudicial killings, according to Human Rights Watch. At a joint press appearance in Manila in November, with Trump laughing at his side, Duterte called journalists \"spies.\"", "There’s reason to think Trump inspired these responses. He has helped to popularize the phrase \"fake news,\" while shifting its meaning.", "According to CNN, Trump has used the word \"fake\" more than 400 times since his inauguration, including \"fake news\" and its variants. Overall, use of the phrase \"fake news\" across all forms of media increased 365 percent from November 2016 to November 2017, according to the Collins Dictionary, which named \"fake news\" its 2017 word of the year.", "At PolitiFact, we have used the term \"fake news\" to refer to fabricated content masquerading as a portrayal of actual events, naming it our 2016 Lie of the Year after made-up stories dominated social media during the presidential election.", "Trump, however, uses \"fake news\" to dismiss coverage that is unsympathetic to him and his administration, or as a criticism against entire news organizations. He’s also taken credit for rebranding the term \"fake news\" to apply to fact-based journalism, calling it \"one of the greatest of all terms I've come up with.\"", "Experts said it’s easy to see why Trump’s use of the term \"fake news\" appeals to authoritarian leaders. Authoritarian governments are typified by highly centralized power and the predominance of the state over individual rights.", "\"Every authoritarian needs to spread his own version of reality, and will invest time and resources to discredit anyone else's,\" said Ruth Ben-Ghiat, a history professor at New York University. \"Many of them are corrupt, and if an investigation threatens to compromise their authority, or charges of wrongdoing come down, they need the public to believe only what they say.\"", "Ben-Ghiat said Trump’s consistent efforts to attack the press as purveyors of bias and lies against him, and incite hostility toward individual news outlets and journalists, can be seen as part of a larger campaign against sectors of society that value evidence and investigation.", "\"When Trump says ‘I am the only one who matters’ it is not just self-glorification, but a message about whose version of the facts should count in America,\" she said. \"How can foreign rulers not feel empowered by this?\"", "A First Amendment advocate we spoke to drew parallels between Trump’s use of the term \"fake news\" and George Orwell’s dystopian novel 1984, in which an authoritarian state inverts language to mean the opposite of its literal definition.", "\"It is a characteristic of authoritarian leaders, whether Communist or Nazi, to appropriate ordinary words and declare them to mean the opposite,\" Bruce Johnson, a Seattle-based media lawyer, told PolitiFact. \"Repressive regimes hold power by depriving their population of independent thinking and making the masses believe lies.\"", "It’s worth noting we found no mentions of \"fake news\" from foreign leaders before 2016.", "The rise of the \"fake news\" epithet coincided with one of the most dangerous years for journalists.", "Last year, the Committee to Protect Journalists found 262 journalists were jailed for their work, a historic high for the second year in a row. In 21 cases, journalists were jailed under \"false news\" statutes, more than double the number in 2016, and in more countries, said Courtney Radsch, advocacy director at Committee to Protect Journalists.", "\"It’s created an environment where it’s more permissive for governments to jail journalists on false news charges,\" she said. \"They certainly don't think they're going to face many repercussions or condemnation from the United States when you have the president making those comments on a regular basis.\"", "Human rights activists say the growing disregard for facts has been making their job harder, too.", "\"Political leaders around the world have begun to deploy the label ‘fake news’ as a smear on fact-finding by journalists, human rights organizations, perhaps even prosecutors,\" wrote Iain Levine of Human Rights Watch. \"In doing so, they seek to break the link between evidence and culpability, making it more difficult to ensure those accountable pay for their misdeeds.\"", "Flake said that Trump's use of the term \"fake news\" to undermine journalism seems to have \"inspired dictators and authoritarians.\"", "Trump popularized the phrase \"fake news\" over the past two years as a way to dismiss news coverage that is unsympathetic to him and his administration, even when the reporting is accurate.", "There are more than a dozen recent instances where foreign leaders, including dictators and authoritarians, have similarly invoked \"fake news\" to dismiss allegations against them, including widespread extrajudicial killings and other human rights abuses. We found no mentions of \"fake news\" from foreign leaders before 2016.", "Expanded use of the epithet has also emboldened authoritarian governments to jail more journalists under \"false news\" statutes, experts said.", "Flake has solid examples from around the world to back up his statement, and there’s strong correlation here given the timeline. We rate this claim True.", "Transcript of speech by Sen. Jeff Flake, R-Ariz., Jan. 17, 2018", "Tweet by President Donald Trump, Feb. 17, 2017", "Politico, \"Trump’s 'fake news' mantra a hit with despots,\" Dec. 8, 2017", "Yahoo News, \"Exclusive: Yahoo News interview with President Bashar Assad of Syria,\" Feb. 10, 2017", "Amnesty International, \"End the Horror in Syria’s Torture Prisons\"", "New York Times, \"Rohingya Crisis in Myanmar Is ‘Ethnic Cleansing,’ U.N. Rights Chief Says,\" Sept. 11, 2017", "New York Times, \"‘No Such Thing as Rohingya’: Myanmar Erases a History,\" Dec. 2, 2017", "Human Rights Watch, \"World Report 2017: Venezuela\"", "Sputnik News, \"Maduro Accuses World Media of Spreading Fake News on Venezuela,\" July 27, 2017", "Reuters, \"Philippines' Duterte says he's been 'demonized' over drugs war,\" Oct. 25, 2017", "Sun Star Manila, \"Duterte: 'I've been demonized through fake news,' \" Oct. 25, 2017", "Human Rights Watch, \"World Report 2017: Philippines\"", "Washington Post, \"Trump chuckled as Duterte called journalists ‘spies.’ That’s no joke in the Philippines,\" Nov. 14, 2017", "The People’s Daily, \"Op-Ed: Trump is right, fake news is the enemy, something China has known for years,\" May 31, 2017", "PolitiFact, \"The media's definition of fake news vs. Donald Trump's,\" Oct. 18, 2017", "Collins Dictionary, word of the year, 2017", "TBN, \"Gov. Mike Huckabee's Full Interview with President Trump,\" Oct. 7, 2017", "Committee to Protect Journalists, \"Record number of jailed journalists for second year, CPJ census finds,\" Dec. 13, 2017", "Human Rights Watch blog, \"Why ‘Fake News’ as Word of the Year is Bad for Human Rights,\" Nov. 6, 2017", "Email interview with Jason Samuels, Office of Sen. Jeff Flake, R-Ariz., Jan. 18, 2018", "Email interview with Ruth Ben-Ghiat, a history professor at New York University, Jan. 18, 2018", "Email interview with Robyn Shepherd, director of media relations at Amnesty International USA, Jan. 18, 2018", "Interview with Courtney Radsch, advocacy director at Committee to Protect Journalists, Jan. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]