["The video was published here on Facebook on November 3, 2019, where it has been viewed more than 12,000 times and shared more than 190 times.", "The post’s simplified Chinese language caption translates to English as: “Wife of Chinese high official behaving arrogantly during the trip to the US, and was shot dead by the American police officers……She supposed it was in her own country where she could do whatever she wanted!", "“In the US, it’s ok to shoot those who attack police, and fatal shooting is based on the independence and justice of the US judiciary, and with the life of police threatened. It aims at those who break the law (the criminal population stipulated in the U.S. Constitution)!”", "Below is a screenshot of the misleading post:", "The one-minute video, filmed from inside a car, shows a person tussling with a police officer in a car park. At about the 46-second mark, the person wrestles free from the officer, before seven gunshots can be heard ringing out. The person can then be seen falling to the ground.", "In the opening five seconds of the video, the yellow simplified Chinese-language caption superimposed on the video translates to English as: “What will happen, if attacking police in the US?”", "A man speaking Mandarin can be heard providing a voiceover throughout the video.", "The man’s comments translate to English as: “The woman walking out in the video is from Shandong Province, China, a tourist coming to the US for a visit. During the National Day, this woman was eating at a restaurant in New Jersey. She yelled at and pushed the restaurant staff for the food did not meet her taste. After the manager called the police, the police officer came to investigate. The woman was not scared at all, and started confronting the police officer and grabbing the police gun. The American police officer fired five shots and killed her immediately. After investigation, the dead is surnamed Chen, and is the wife of county magistrate in China's Shandong Province. This time she came to the US for a trip after signing a contrast with a travel agency. She might think US is just like China, like her hometown, Chinese Embassy in the United States has made representations to the United States government, and at the same time suggest the Chinese citizens strictly follow the rules of the counties where they go abroad for a trip, and earnestly safeguard the legitimate rights and interests of themselves and others.”", "The video was also shared here on November 3 in a traditional Chinese-language Facebook group which regularly discusses political issues in Hong Kong.", "It was posted one day after a 22nd consecutive weekend of pro-democracy protests in Hong Kong, many of which have resulted in violent clashes with police, as reported here by AFP.", "The video was also published on Facebook here, here, here and here; and on Twitter here, here, and here with a similar claim.", "The claim is false; the video actually shows a police officer shooting dead a man in California in September 2017.", "A Google reverse image search of keyframes extracted from the misleading video found this September 24, 2017 report published by UK based newspaper MailOnline.", "The report’s headline states: “'Let go of my gun!' New footage shows cop in desperate struggle with 'depressed' Navy veteran who 'tried to steal his pistol' before being shot dead in shocking viral video”.", "Below are three screenshot comparisons of the misleading video (L) and one of the videos published in the MailOnline article (R):", "A keyword search found this statement about the incident published by Huntington Beach Police Department on September 23, 2019.", "It states: “On 09/22/17 at about 9:30am, an officer from the Huntington Beach Police Department contacted a male outside the 7/11 store in the 6000 block of Edinger Avenue. As the officer began to talk to the subject, a verbal confrontation began, and the subject refused to listen to any commands given by the officer. As the incident escalated and became physically violent, the officer attempted several force options including his taser, which were all ineffective. The suspect violently attacked and assaulted the officer, and a struggle over the officer’s gun belt ensued. The officer tried to retain his weapon while the suspect continued to grab at the officer’s belt. The suspect removed an undetermined piece of equipment from the gun belt, and the officer fired his weapon at the suspect. The suspect was struck by gunfire and was transported to a local hospital where he later died from his injuries. The suspect’s identity will be released at a later time by the Orange County Sheriff’s Department.", "“We are aware there are videos circulating throughout social media. The videos we have seen posted are small portions of a violent confrontation, and should not be taken out of context. Orange County Sheriff’s Detectives will be reviewing videos and interviewing witnesses from the incident, but those details will not be made available for some time.", "“It is our policy that the Orange County Sheriff’s Department investigates all of our officer involved shootings, and we will not make further comments until after their investigation has been completed.”", "The location where the video was filmed can be seen here on Google Maps:", "Below is a screenshot comparison of the video (L) and the location on Google Street View (R):", "This Associated Press article published by Chicago Tribune on September 25, 2017, shows a video of the same incident filmed from a different angle.", "The headline states: “California man killed by police was vet with history of mental illness”.", "The report states in part: “A man who was fatally shot by police in a videotaped encounter outside of a California convenience store was a Navy veteran with a history of drug use and mental illness who had been paroled from state prison a week before the shooting and was considered an absconder, according to his family and records released Monday.", "“Dillan Tabares, 27, was fatally shot Friday after a physical confrontation with a Huntington Beach police officer outside of a 7-Eleven.”", "Below is a screenshot of the report:", "The Orange County Register reported here on July 31, 2019 that a federal court subsequently dismissed a lawsuit filed against the city of Huntington Beach by Tabares’ mother.", "The report states in part: “U.S. District Judge Josephine L. Staton, in a written ruling released Tuesday, agreed with the city of Huntington Beach’s contention that their officer did not improperly detain or use excessive force against 27-year-old Dillan Tabares during a deadly encounter on Sept. 22, 2017.”", "The same incident was also debunked by Taiwan-based media EBC News here and Chinese state media outlet Shanghai Observer here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]