["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Russian President Vladimir Putin offered a novel idea to advance the Russia investigation during a joint news conference with President Donald Trump in Helsinki.", "Special Counsel Robert Mueller’s team could come to his country, Putin said, if Russian investigators were allowed to go the United States to dig into alleged tax evasion by American-born financier Bill Browder and his associates.", "\"Business associates of Mr. Browder have earned over 1.5 billion dollars in Russia,\" Putin said through a translator. \"They never paid any taxes.\"", "Putin continued.", "\"They sent a huge amount of money, over 400 million, as a contribution to the campaign of Hillary Clinton,\" he said. \"Well, that’s their personal case. It might have been legal, the contribution itself, but the way the money was earned was illegal.\"", "Did Browder's associates send $400 million to Hillary Clinton's campaign?", "No. We found $17,700 donated to Clinton and another $297,000 to the Democratic National Committee.", "The Russians say that Browder and his partners at Ziff Brothers Investments, a New York venture capital firm, illegally syphoned billions of rubles out of the country. To add salt to the wound, Browder had led the charge to pass the 2012 Magnitsky Act, a law that penalizes Russian officials suspected of sanctioning the death of Browder’s lawyer Sergei Magnitsky in a Russian prison.", "The Ziff brothers came up during the June 2016 meeting at Trump Tower between Donald Trump Jr. and others, and Natalia V. Veselnitskaya, a Russian lawyer who promised dirt on the Hillary Clinton campaign. According to transcripts from Senate Judiciary Committee interviews, Veselnitskaya’s materials described the Ziffs as Democratic donors, although Trump’s son said they gave both to Democrats and Republicans.", "We reached out to the Russian Embassy and the Russian consulate in Washington to get details on the $400 million donation and had not heard back in time for our deadline.", "Given that Veselnitskaya tied Browder and the Ziff brothers together, we researched their political donations.", "Browder became a British citizen and can’t legally contribute to U.S. candidates. Ziff Brothers Investments through its executives can give freely, and they have.", "Before we get into their political contributions, we also wondered if Putin could have been talking about money that went to the Clinton Foundation. In past years, Browder and Ziff Brothers Investments had given to the Clinton Global Initiative, a project of the Clinton Foundation, but the total was not more than $110,000, records show.", "In the 2016 election cycle, Ziff Brothers Investments gave $1.7 million. According to the Center for Responsive Politics, nearly two-thirds, or about $1.1 million, went to Democratic committees, and the rest to Republicans.", "The center listed the firm’s top recipients:", "Recipient", "Amount", "DNC Services Corp", "$296,966", "Senate Majority PAC", "$250,000", "Defending Main Street", "$200,000", "Democratic Senatorial Campaign Cmte", "$40,000", "Democratic State Central Cmte/Louisiana", "$35,412", "National Republican Congressional Cmte", "$32,400", "Democratic Party of Montana", "$28,622", "Democratic Executive Cmte of Florida", "$27,287", "Democratic Party of New Hampshire", "$27,287", "Democratic Party of Virginia", "$27,287", "Democratic Party of Wisconsin", "$27,287", "Georgia Federal Elections Cmte", "$27,287", "Federal law puts tighter limits on contributions to individual candidates. Here, the Ziffs mainly put their money into incumbents, and Republicans did better by a margin of about $145,000 to $46,000. Clinton’s campaign received $17,700.", "Unless Putin had other Browder associates in mind, his figure of $400 million going to the Clinton campaign is a massive exaggeration. Between the Clinton campaign and the Democratic National Committee, the Ziffs gave about $315,000.", "The Clinton campaign raised $563 million overall, so Putin's sum would account for nearly three-fourths of all donations. (PACs affiliated with Clinton's campaign raised an additional $231 million, according to the Center for Responsive Politics.)", "Putin said associates of Bill Browder gave $400 million to the Clinton campaign. The associates appear to be the Ziff brothers. According to public data, Ziff Brothers Investments gave about $315,000 to Clinton and the Democratic National Committee.", "Overall, the firm gave about $1.1 million to Democratic committees around the country.", "The exaggeration is so great, we rate this claim Pants on Fire.", "White House, Helsinki summit news conference, July 16, 2018", "Senate Judiciary Committee, testimony by Ike Kaveladze, Nov. 3, 2017", "Center for Responsive Politics, Ziff Brothers Investments, accessed July 16, 2018", "Bloomberg, Russian Lawyer Who Met Trump Jr. Saw a Clinton Scandal in Tax Inquiry, July 12, 2017", "Tass, Russia's top prosecutor asks US attorney general to explore rationale for Magnitsky Act, Oct. 24, 2017", "New York Times, Lawyer Who Was Said to Have Dirt on Clinton Had Closer Ties to Kremlin Than She Let On, April 27, 2018", "PolitiFact, Was initial Trump statement on Trump Tower meeting accurate, as lawyers' memo said?, June 7, 2018", "LeakSource, Ziff Brothers, Oct. 9, 2017", "Zerohedge.com, How Hermitage Capital, Ziff Brothers And The Clinton Global Initiative Prompted The Trump Jr. Meeting, July 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]