["About this rating", "Existing California law permitted individuals convicted of having non-forcible vaginal intercourse with a minor (within certain age parameters) to seek discretionary relief in court from automatically having to register as sex offenders. The passage of SB-145 extends that exception to people convicted of having non-forcible oral or anal sex with a minor.", "However, the revised statute does not shield anyone from the requirement to register as a sex offender. Rather, it leaves that decision, in eligible cases, to the discretion of the presiding judge.", "In January 2019, California state senator Scott Wiener (D-San Francisco) introduced a bill (SB-145) to modify the state penal code to allow certain individuals convicted of sex offenses involving minors to apply for discretionary relief from having to register as sex offenders. The bill was passed by the legislature on Aug. 31, 2020, and signed into law by Gov. Gavin Newsom on Sept. 11.", "The aim of the revised statute, according to a 2019 press release from Wiener's office, is to redress the disparity between how heterosexual and LGBT sex offenders were treated under existing law:", "Currently, for consensual yet illegal sexual relations between a teenager age 15 and over and a partner within 10 years of age, “sexual intercourse” (i.e., vaginal intercourse) does not require the offender to go onto the sex offender registry; rather, the judge decides based on the facts of the case whether sex offender registration is warranted or unwarranted. By contrast, for other forms of intercourse — specifically, oral and anal intercourse — sex offender registration is mandated under all situations, with no judicial discretion.", "This distinction in the law — which is irrational, at best — disproportionately targets LGBT young people for mandatory sex offender registration, since LGBT people usually cannot engage in vaginal intercourse. For example, if an 18 year old straight man has vaginal intercourse with his 17 year old girlfriend, he is guilty of a crime, but he is not automatically required to register as a sex offender; instead, the judge will decide based on the facts of the case whether registration is warranted. By contrast, if an 18 year old gay man has sex with his 17 year old boyfriend, the judge *must* place him on the sex offender registry, no matter what the circumstances.", "A Feb. 21, 2019 article on The Washington Pundit website put a decidedly different spin on the proposal and foreshadowed the tone of the debate to follow. That article, entitled \"CA Democrats Introduce LGBTQ Bill that would Protect Pedophiles who Rape Children,\" claimed:", "SB-145 would allow a sex offender who lures a minor with the intent to commit a felony (i.e. a sex act) the ability to escape registering as a sex offender as long as the offender is within 10 years of age of the minor.", "SB-145 would add a section to the state’s penal code (Section 290.55) stipulating that as long as the offender is “not more than 10 years older than the minor,” they are not automatically mandated to register as a sex offender. There is no age limit or range specified, except for existing law which already excludes lewd acts with children under 14.", "SB-145 appears to allow adults to victimize minors by luring them with the intent to have sex, and then shields the predator from being automatically registered as a sex offender, as in the case of a 25 year old luring a 15 year old for sex, or a 22 year old luring a 12 year old.", "SB-145, as currently written, appears to allow certain sexual predators to live among the population without anyone being aware.", "These claims were at best misleading and at worst false, beginning with the headline. The new law does not, under any reasonable interpretation, \"protect pedophiles who rape children.\" Although the crimes addressed in SB-145 fall under the heading of statutory rape (given that the victims are under 18, the statutory age of consent), they do not include forcible sex crimes of any kind, as a spokesperson for Sen. Wiener, Victor Ruiz-Cornejo, explained in an email:", "Currently, there are several non-forcible, “consensual” sexual offenses involving minors which require lifetime sex offender registration. These cases involve minors who are having a sexual relationship with someone over the age of 18. Although minors cannot legally consent to sexual activity, the cases are viewed as “consensual” because the sexual activity is not forced and the minor is a willing participant. SB 145 does not apply for anyone 14 years or younger.", "Moreover, it is not the case that the new law would, per the article's claim, \"allow a sex offender who lures a minor with the intent to commit a felony (i.e., a sex act) the ability to escape registering as a sex offender as long as the offender is within 10 years of age of the minor.\"", "The law doesn't allow anyone to \"escape\" registering. Rather, it allows people found guilty of unforced oral or anal intercourse with a minor 14 or older, if there is no more than 10 years' age difference between them, to apply to the court for the same discretionary relief from mandated sex-offender registration that is already afforded to those found guilty of vaginal intercourse with a minor. That is to say, a court will decide whether the offender must register, based on the facts of the case.", "Also, according to Ruiz-Cornejo, \"luring a minor\" for purposes of sex is not one of the crimes covered in the bill. \"Senate Bill 145 does not protect anyone from luring children (under 14 years old) or teenagers (above 15 years old) with the intent to commit sexual assault,\" he told us. \"Luring a minor is treated differently and does not fall under the consensual relationships this bill is addressing.\" We asked Ruiz-Cornejo for further clarification on this, given that the text of the bill did state that it applies to Section 288.3 of the Penal Code, which addresses contacting a minor with intent to commit a felony (including certain sex offenses), but he didn't elaborate.", "We followed up with Los Angeles County Deputy District Attorney Dan Felizzatto, who confirmed what Ruiz-Cornejo told us and explained that when a defendant is prosecuted for luring a minor (including children under 14) \"they would be charged with [Penal Code] Section 272 because that is the luring section.\" Conviction under Section 272 requires mandatory sex offender registration if it involves lewd or lascivious conduct (with no provision for discretionary relief). Additional charges are often filed in such cases, which could include, for example, a violation of Section 288.3 (contacting a minor with intent to commit a felony) or any substantive sex offense that would be appropriate, but any discretionary relief from mandatory registry provided for under Section 288.3 would not apply to the luring charge under Section 272.", "Nothing in SB-145 precludes a district attorney from filing a case in such a way as to prevent an individual who commits a sex offense against a minor under 14 from taking advantage of the discretionary relief provision, Felizzatto said. \"Those types of sex offenders are predatory and would not benefit from the changes in SB-145.\"", "Given that the second quoted paragraph of the Washington Pundit piece references \"existing law which already excludes lewd acts with children under 14,\" the paragraph that follows contains a blatant falsehood, citing the example of \"a 22-year-old luring a 12-year-old\" to show how the proposed legislation supposedly \"shields\" child predators.", "\"The bill does not apply to anyone under 14 years old,\" Ruiz-Cornejo said when we showed him the passage. \"Nor does the bill shield anyone, it simply grants the judge discretion.\" (The Washington Pundit deleted the example and noted the correction after we contacted them to point out its inaccuracy.)", "Finally, the sentence \"SB-145, as currently written, appears to allow certain sexual predators to live among the population without anyone being aware\" simply repeats the erroneous claim that discretionary relief will be granted to sexual predators.", "We sought comment on the discrepancies in the article from The Washington Pundit's publisher, who defended the website's overall characterization of the bill. \"By eliminating the different treatments for vaginal vs oral and anal assaults, it doesn’t change the nature of the bill,\" he said in an email. \"It actually expands on it and applies more protection to the pedophile. (Our definition of pedophile is an adult who sexually preys on children).\"", "He also stood by the claim that the bill would \"protect pedophiles who rape children,\" citing California's age-of-consent law as a reason to ignore the distinction between forcible rape and \"consensual\" sex acts such as those that fall under the heading of statutory rape:", "When an adult takes advantage of the innocence of a child, they are raping them. That’s why we don’t believe in having consensual sex with a drunk, adult woman. She may have consented but she wasn’t in the right state of mind to give actual consent. When a guy knowingly has sex with a drunk woman, he knows she isn’t in her normal state of mind. We believe any pursuit to engage in sexual acts that isn't respectful and misleading the woman’s or child’s state of mind is immoral and equal to rape. Now, your definition of rape may be different. According to our definition, and the definition of our audience, it fits the description of rape. The title is not misleading. The title may be interpreted differently depending on who is reading it.", "In March 2019, Wiener's office issued an amended version of SB-145 to clarify its intent and allay public confusion about which types of offenses were and were not included in the bill. After the bill finally became law in September 2020, its provisions were once again widely misrepresented and assailed as \"pro-pedophilia.\" Wiener called these claims \"grossly disingenuous.\"", "Clark, Kendra.   \"Specters of California's Homophobic Past: A Look at California's Sex Offender Registration Requirements for Perpetrators of Statutory Rape.\"\r\n    UC Davis Law Review.   February 2019.", "Ogles, Jacob.   \"Why Is Gay Underaged Sex Criminalized When Straight Sex Is Not?\"\r\n    The Advocate.   23 January 2019.", "O'Reilly, Andrew.   \"California Bill to End Alleged LGBT Discrimination on Sex Offender List Stirs Controversy.\"\r\n    Fox News.   27 February 2019.", "Willon, Phil.   \"Newsom Signs Bill Intended to End Discrimination Against LGBTQ People in Sex Crime Convictions.\"\r\n   Los Angeles Times.   11 September 2020.", "California Legislature.   \"SB-145 Sex Offenders: Relief From Registration.\"\r\n    18 January 2019.", "California Senate: Senator Scott Wiener.   \"Senator Wiener Introduces Legislation to End Discrimination Against LGBT People Regarding Sex Offender Registration.\"\r\n    22 January 2019.", "The Washington Pundit.   \"CA Democrats Introduce LGBTQ Bill That Would Protect Pedophiles Who Rape Children.\"\r\n    21 February 2019.", "Updated [March 7, 2019]: Updated to expand the section pertaining to the predatory luring of minors for sex with information provided by the LA County District Attorney's Office, and to note the release of the 4 March 2019 amendment to the text of the legislation.", "Updated [Sept. 14, 2020]: Updated to note that the bill was passed by the legislature and signed into law by Gov. Gavin Newsom.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]