["African Daily Voice is a legitimate pan-African news agency headquartered in Equatorial Guinea. African Daily Voice is a fake news site.", "What’s the difference?", "The news agency’s website is at africandailyvoice.com. The fake website pretends it’s the real deal by using the agency’s name and logo, but repeatedly publishes false news at afrikan-daily.com.", "Now, in another story, the fake site claims that 11 people have been sentenced to life imprisonment for cannibalism in Kenya.The story is that Nino Mbatha, a traditional healer, walked into a police station in 2018 carrying human limbs and told officers that he was “tired of eating human flesh”. He then allegedly took them to a house in Nairobi’s Kawangware area where more body parts were found.", "There are several clues to the story’s lack of credibility. One is that it is sloppily written and littered with grammatical errors.", "For example it says the crime happened in Kenya, but adds that “there is no direct law against cannibalism in South Africa”.", "But also, there is no reporting in other Kenyan media of what would be a shocking story.", "A Google search does show that a “Nino Mbatha”  was indeed convicted of murder, but in South Africa.", "In December 2018, Mbatha and his co-accused Lungisani Magubane were found guilty of killing Zanele Hlatshwayo for her body parts. The two were sentenced to life in prison.", "Seven people were initially arrested, but only the two were jailed, not 11 as claimed by the imposter site.", "The story was widely reported both in South Africa and elsewhere.", "The fake site changed the story so people in Kenya would believe it. It said the crime took place in Nairobi. The victim was actually murdered in Estcourt, a town in South Africa’s KwaZulu-Natal province.", "It also changed the victim’s name from Zanele Hlatshwayo to Zanele Otieno, a common surname in Kenya.", "The fake story said “regional prosecuting authority spokesperson Mr Otieno” was quoted by CNN. The real CNN story includes comments by Natasha Ramkissoon-Kara, a spokesperson for South Africa’s National Prosecuting Authority.", "The rest of the story is just copied from real news reports, with no attempt to hide falsehoods.", "Africa Check has flagged a number of hoaxes published by afrikan-daily.com. African Daily Voice intends to take legal action against the imposter site, according to Toussaint Alain, the news agency’s director. - Vincent Ng’ethe (07/01/2018)", "Africa Check teams up with Facebook", "Africa Check has partnered with Facebook to combat fake news and false information on the social platform. This spotcheck is part of the initiative.", "As part of its third-party fact-checking programme, Facebook allows its partners to see public articles, pictures or videos that have been flagged as potentially inaccurate.", "Content rated as “false” by fact-checkers will be downgraded in news feeds. This means fewer people will see it.", "You can help us identify fake news and false information on Facebook. This guide explains how.", "Further reading:", "https://africacheck.org/factsheets/guide-stop-falling-fake-news/", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]