["About this rating", "Nearly everyone familiar with world-famous magician and escape artist Harry Houdini, no matter how little they know about his life, knows one thing about his death: That a boastful Houdini died from trying to impress some college students with his toughness. As legend has it, Houdini was fond of explaining to his fans that by tightening his abdominal muscles he could withstand the hardest punches to the midsection a man could deliver, and one day a college student who was present when Houdini repeated his boast decided to test the claim by raining blows to the magician's midriff. The stomach punches caught Houdini by surprise before he had time to prepare himself, however, resulting in a trauma that ruptured his appendix and ultimately caused his death a few weeks later.", "Although some of the basic facts of this narrative are correct, its assumption of the cause and effect that led to Houdini's untimely demise likely is not.", "The chain of events leading up to Houdini's final passing began in mid-October 1926, while he was undertaking a series of shows in the northeastern part of North America. Despite having broken his ankle while performing his famous Water-Torture Cell escape in Albany several days earlier, Houdini, ever the trouper, kept his engagement at the Princess Theater in Montreal and opened there on 18 October 1926. The following day Houdini delivered a lecture at McGill University about exposing fraudulent spiritualists and mediums, and afterwards he stayed around to chat with various faculty members and students. A student named Samuel J. Smilovitch approached Houdini with a sketch he'd made of the escape artist; Houdini was impressed with the drawing and invited the young man to come backstage after one of his shows and do a full portrait.", "Smilovitch took Houdini up on his offer, bringing along his friend Jack Price to meet the magician in the lobby of the Princess Theater the morning of Friday, 22 October. They followed Houdini to his dressing room, and a few minutes later another McGill student named Joselyn Gordon Whitehead knocked on the door. What then occurred was later described by Jack Price and included in a book by Sir Arthur Conan Doyle:", "Houdini was facing us and lying down on a couch at the time reading some mail, his right side nearest us. This first-year student [Whitehead] engaged Houdini more or less continually whilst my friend Mr. Smilovitch continued to sketch Houdini. This student was the first to raise the question of Houdini's strength. My friend and I were not so much interested in his strength as we were in his mental acuteness, his skill, his beliefs, and his personal experiences. Houdini stated that he had extraordinary muscles in his forearms, in his shoulders and in his back, and he asked all of us present to feel them, which we did.", "The first-year McGill student asked Houdini whether it was true that punches in the stomach did not hurt him. Houdini remarked rather unenthusiastically that his stomach could resist much, though he did not speak of it in superlative terms. Thereupon he gave Houdini some very hammer-like blows below the belt, first securing Houdini's permission to strike him. Houdini was reclining at the time with his right side nearest Whitehead, and the said student was more or less bending over him. These blows fell on that part of the stomach to the right of the navel, and were struck on the side nearest to us, which was in fact Houdini's right side; I do not remember exactly how many blows were struck. I am certain, however, of at least four very hard and severe body blows, because at the end of the second or third blow I verbally protested against this sudden onslaught on the part of this first-year student, using the words, \"Hey there. You must be crazy, what are you doing?\" or words to that effect, but Whitehead continued striking Houdini with all his strength.", "Houdini stopped him suddenly in the midst of a punch, with a gesture that he had had enough. At the time Whitehead was striking Houdini, the latter looked as though he was in extreme pain and winced as each blow was struck.", "Houdini immediately after stated that he had had no opportunity to prepare himself against the blows, as he did not think that Whitehead would strike him as suddenly as he did and with such force, but that he would have been in a better position to prepare for the blows if he had risen from his couch for this purpose, but the injury to his foot prevented him from getting about rapidly.", "Despite Price's first-hand account, much dispute remains over exactly what took place in Houdini's dressing room that day. Houdini's wife Bess, a nurse named Sophie Rosenblatt, and Bess's niece Julia Sawyer were also present, and the details of their stories differ. Did Joselyn Whitehead really show up after Smilovitch and Price arrived, or had Smilovitch brought him along? Was Whitehead really a McGill student, or was he an amateur boxer (or both)? Was he already known to Houdini (as he presumably was if, as some rumors report, he had shown up to return some books he had borrowed from the magician). Did Whitehead really \"secure Houdini's permission\" before delivering blows to the magician's stomach, or did he mistake Houdini's casual response to his query as permission to proceed and strike before Houdini was prepared? Did Houdini even really boast that he could withstand such punches?", "Whatever happened, Houdini was definitely suffering from severe stomach pains by mid-afternoon, although he carried on with that evening's show and two more performances the next day. On the train to Detroit (where Houdini was scheduled to begin a two-week run of performances the following day) he was suffering mightily from the pain in his stomach, so a worried Bess telegraphed ahead and arranged for a doctor to be standing by at their hotel when they arrived. Unfortunately, their train was late, and the Houdinis thus had no time to check into their hotel and headed straight for the theatre instead.", "The doctor finally caught up with Houdini at the theatre, examined him in the dressing room, found him to be running a fever of 104°F, diagnosed acute appendicitis, and proclaimed that Houdini should be taken straight to a hospital by ambulance. Bess allegedly did not hear the doctor's diagnosis, and Houdini supposedly told the worried theater owner, prophetically, \"I'll do this show if it's my last.\"", "Houdini rushed through his show and clearly was not performing well; before the third act began he finally decided that he could not carry on by himself and had his assistants finish some of his tricks for him. (Houdini did not collapse on stage, as is often reported, nor did he have to be rescued from the Water-Torture cell by an axe-wielding assistant, as portrayed in various film biographies.) Even then, Houdini would still not seek medical treatment, returning to his hotel before finally Bess \"threw a tantrum\" and summoned the hotel physician.", "The physician called a surgeon, who examined Houdini and told him that he must be hospitalized at once. Still, Houdini demurred, calling his personal physician, Dr. William Stone, back in New York sometime after 3:00 A.M. Only after Houdini and the other doctors had talked to Dr. Stone did Houdini finally relent and agree to be taken to Grace Hospital, where he underwent surgery to remove his appendix that afternoon (Sunday, 24 October). The surgeon who performed the operation found that Houdini's appendix had ruptured and the magician was suffering from peritonitis.", "The odds of surviving such an infection in the days before antibiotics were small, but Houdini gamely hung on for another four days before undergoing a second operation on Thursday, 28 October. He seemed to be recovering by the next day, but on Saturday his condition worsened, and the renowned magician escape artist passed away the next day at 52.", "Fittingly, the date was 31 October 1926: Halloween. The official cause of death was listed as diffuse peritonitis (i.e., an infection of the tissue lining the inner wall of the abdomen, typically resulting from an abdominal rupture), with ruptured appendicitis listed as a contributory factor.", "When the details of Houdini's final weeks became known in the aftermath of his passing, the common assumption took hold that the blows to the right-hand side of his abdomen (the side on which the appendix is located) Houdini had received a few weeks before his death and his ruptured appendix were directly connected: It seemed a logical conclusion at the time, even to some of his doctors, and so the Houdini death legend began. But although we will likely never know precisely what caused the magician's fatal bout of appendicitis, with the advantage of several decades of hindsight we have good reason to be skeptical about that legend.", "First of all, given the contradictory accounts provided by the persons who were present when Houdini was punched in his dressing room by Gordon Whitehead, it's unclear what injury the magician sustained, and how badly he was hurt (if indeed he was injured at all), by those blows.", "Second, reported cases in medical literature of appendicitis following blunt abdominal trauma are quite rare, and a 2010 review of such cases noted that there \"has been much debate as to whether acute appendicitis following trauma is coincidental or causal.\" It's possible that the onset of Houdini's appendicitis was the result of his being punched in the stomach, but a direct connection between those two events is far less common or obvious than is widely believed.", "It's also possible (and perhaps much more likely) that there was a connection between the stomach blows Houdini experienced in his Montreal dressing room and his death from peritonitis a few weeks later, but in a different and more indirect fashion than is commonly assumed. Houdini may have already been suffering from the onset of appendicitis at the time Whitehead punched him and then attributed his subsequent abdominal discomfort to residual pain from those blows, causing him to delay seeking medical treatment for what otherwise would have been a routine case of appendicitis until after the organ had ruptured (producing a fatal case of peritonitis). Had the dressing room incident not occurred, Houdini might have realized the pain he was experiencing was actually a symptom of a serious medical condition and not delayed so long in consulting doctors and undergoing surgery to deal with it.", "In the (largely fictionalized) 1953 film biopic starring Tony Curtis, Houdini injures himself when he accidentally rams his abdomen into the hilt of a prop sword backstage during a performance, then dies after his injury prevents him from escaping from the Chinese Water Torture Cell in time.", "Sightings:   The 1987 film Planes, Trains and Automobiles includes the following quote: \"Hey you could have killed me by punching me in the stomach like that when I wasn't ready ... that's how Houdini died, ya know.\"", "Bell, Don.   The Man Who Killed Houdini.\r\n    Georgetown, Ontario: Véhicule Press, 2004.   ISBN 1-55065-187-0.", "Brandon, Ruth.   The Life and Many Deaths of Houdini.\r\n    New York: Random House, 1993.    ISBN 0-679-42437-7   (pp. 287-295).", "Donaldson, Norman and Betty.   How Did They Die?\r\n    New York: St. Martin's Press, 1989.    ISBN 0-312-91740-6   (pp. 111-113).", "Conan Doyle, Arthur.   On the Edge of the Unknown.\r\n    London, 1930   (pp. 18-19).", "Toumi, Zaher.   \"Systematic Review of Blunt Abdominal Trauma as a Cause of Acute Appendicitis.\r\n    Annals of The Royal College of Surgeons of England.   September 2010; 92(6): 477–482.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]