["By Robert Farley", "Posted on October 27, 2017", "When it comes to litigation brought to the World Trade Organization for dispute resolution, the U.S. wins the vast majority of cases it brings, and it loses most of the cases brought against it. That’s generally how other countries fare before the WTO as well.", "Those facts run contrary to the narrative President Donald Trump put forth in a Fox Business Network interview on Oct. 25.", "In his interview with Fox Business’ Lou Dobbs, Trump wrongly claimed that “we lose the lawsuits, almost all of the lawsuits … within the WTO.” And that’s because, Trump said, “we have fewer judges than other countries.”", "Trump, Oct. 25: The WTO, World Trade Organization, was set up for the benefit for everybody but us. They have taken advantage of this country like you wouldn’t believe.", "And I say to my people, you tell them, like as an example, we lose the lawsuits, almost all of the lawsuits in the WTO — within the WTO. Because we have fewer judges than other countries. It’s set up as you can’t win. In other words, the panels are set up so that we don’t have majorities. It was set up for the benefit of taking advantage of the United States.", "The World Trade Organization is an arrangement between 164 countries worldwide and “serves as a forum for negotiations on trading rules as well as a mechanism for dispute settlements in trade issues,” according to the National Bureau of Economic Research.", "Since the WTO began regulating international trade in 1995, the country bringing a complaint to the WTO has won about 90 percent of the time. That’s among the adjudicated cases — most cases are settled between the countries before that.", "Simon Lester, a trade policy analyst for the libertarian Cato Institute, explained that the reason for the high success rate by complaining countries is that “governments don’t bring WTO complaints unless they are pretty sure they will win.”", "That has proven true for cases brought by and against the U.S.", "In March, Dan Ikenson, director of Cato’s Herbert A. Stiefel Center for Trade Policy Studies, reviewed WTO trade disputes involving the U.S. from 1995 to March of this year. He found that the U.S. prevailed in 91 percent of cases that it brought against other countries.", "“When the United States has been a complainant (as it has in 114 of 522 WTO disputes over 22 years — more than any other WTO member) it has prevailed on 91 percent of adjudicated issues,” he wrote. “When the United States is a respondent (as it has been in 129 cases — more than any other WTO member), it has lost on 89 percent of adjudicated issues.”", "That’s in line with the won-lost percentage for other countries as well, experts said.", "“It’s hard to know where to start,” Malawer told us. “President Trump is absolutely wrong. Period. Not only does the U.S. not lose almost all of its lawsuits, it in fact wins most of them as a complaining state.”", "In 2014, Malawer published research that found the U.S. won 38 cases as a complainant and lost four between 1995 and 2012. But as a respondent — in other words in cases filed by another country against the U.S. — the U.S. won 17 cases and lost 50, he found.", "Most disputes filed with the WTO — about two-thirds — were settled between the countries before they got to litigation by a WTO panel, Malawer noted.", "Rufus Yerxa, president of the National Foreign Trade Council and deputy director general of the WTO from 2002 to 2013, told us via email that Trump’s assertion is simply incorrect.", "“U.S. is the most frequent complainant in WTO dispute settlement and has won over 90 percent of the cases it has brought,” Yerxa said. “It has lost many cases as a defendant. So have most other countries, since most countries only bring cases they know they can win. But most of the … losses were a result of the U.S. refusing to change its anti-dumping methodology even after it lost cases, thereby incurring repeated rulings against them for continuing the same practice. If you take those cases out, the US has a better record as a defendant than China or most others!”", "The U.S. was essentially undefeated during the Obama years in cases the U.S. litigated through the WTO.", "“Under the Obama administration, we brought 26 cases to the WTO, 16 of them against China, and we won every single one of the cases that was brought to a conclusion,” Michael Froman, who served as the U.S. trade representative from June 2013 to January 2017, told us in a phone interview.", "Even the president’s “2017 Trade Policy Agenda” released in March notes (on page 170) that the United States “had some enforcement successes in 2016.” Those successes include a case against Indonesia’s “import barriers against U.S. agricultural products” and a dispute with the European Union over civil aircraft.", "WTO experts we interviewed were also scratching their heads over Trump’s claim that the U.S. loses most of its lawsuits — again it doesn’t — “because we have fewer judges than other countries” and that “[i]t’s set up as you can’t win. In other words, the panels are set up so that we don’t have majorities.”", "“I have no idea what he’s talking about,” Malawer said.", "Here’s how the dispute settlement system works: Initially, countries attempt to settle disputes through a voluntary “conciliation and mediation” process (see Article 5 of the WTO’s rules and procedures for settlement of disputes). Most of the time, disputes are settled before litigation. Unresolved disputes are brought to a three-person panel, which is drawn from a WTO-approved list of qualified individuals (see Article 8). None of the panelists can be from a country involved in the dispute.", "The panel’s decisions can be appealed. An appellate board of three members is chosen on a rotating basis from seven standing full-time members of the appellate body (see Article 17). Appellate board members serve four-year terms, and the U.S. has one member on the appellate board.", "It’s true, as Trump says, that the “panels are set up so that we don’t have majorities.” But neither does the opposing country. In fact, none of the panelists come from countries involved in a dispute. That’s not evidence, as Trump says, that the dispute resolution system is “set up for the benefit of taking advantage of the United States.”", "“The WTO’s Dispute Resolution System is the most effective international mechanism in settling disputes in the international system today,” Malawer told us. “And the U.S. was the primary architect of it. It persuaded the global trading system to adopt a judicial/litigation approach to settle trade disputes in 1995.”", "We reached out to the White House press office for support or clarification of the president’s comments, but we did not hear back.", "The Trump administration takes issue with some of the decisions reached by WTO panels against the U.S., and we take no position on that. But, despite Trump’s claim, the U.S. wins most of the cases it brings to the WTO, and it loses most of those brought against it — just like other countries.", "The fact that the U.S. does not enjoy a majority of judges on either WTO panels or appellate boards is not evidence that the deck is stacked against the U.S. Those are the same rules other countries are playing by as well.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]