["Violence erupted at Singhu border after a group of men got past three layers of security barricades, claiming the farmers’ agitation had affected their livelihoods, reported The Indian Express on January 29. In a fact-check report published the same day, Alt News revealed that BJP workers were among those posing as ‘locals’ at Singhu border and protesting against the farmers’ movement.", "In the backdrop of this, two videos have gone viral with the Hindi title, “Delhi policemen rebel, 200 submit resignation together.” (दिल्ली पुलिस में बगावत 200 पुलिसकर्मियों ने दीया सामूहिक इस्तीफा)", "A clip of a police officer interacting with the media has gone viral. In the 30-second clip, a police officer wearing a mask says, “We have served enough. We don’t want this job. We seek forgiveness from the government… I mean I request the government that we don’t want this job. [cries] They imposed lathi-charge on us [cries].” The video carries a logo that says ‘TheFollowUp’.", "Facebook page Kisan Andolan Rajasthan posted the same video. Multiple Facebook users have also shared the video.", "दिल्ली पुलिस में बगावत 200 पुलिसकर्मियों ने दीया सामूहिक इस्तीफा", "Posted by Bhalaram Dhatarwal on Friday, 29 January 2021", "TheFollowUp is a Ranchi-based online news outlet. Alt News rummaged the YouTube channel and found that the viral video is clipped from a September 18, 2020 bulletin.", "In the video, several police officers complaint against lathi-charge by the government. Alt News performed a keyword search on Google and found an ANI report from the same date. As per the report, state police clashed with assistant police personnel who were staging a demonstration demanding regularisation of their jobs in Ranchi. According to the police, the agitators started pelting stones and broke the barricades and as a result, lathi-charge and fired tear gas were used to disperse the protest.", "A video of a police officer addressing a constable in riot gear has also been shared with the identical claim. In the video, the officer can be heard saying, “Put sense into them or else they will run over us. Do you agree?” followed by “Jai Jawan, Jai Kisan” and “Jai Hind” chants.", "दिल्ली पुलिस में बगावत, पुलिसकर्मी ने दिया सामूहिक इस्तीफा #Standwithfarmer #DelhiPolice", "Posted by Gogaram Dara Parbatsar on Friday, 29 January 2021", "Multiple Facebook users have shared the video on Facebook.", "IPS officer Arun Bothra quote-tweeted the viral video and identified the police officer as Surender Singh Yadav IPS. He wrote, “He is @ssyips [IPS YAdav]. Son of a farmer, a brilliant officer and someone who always fights for justice. Also my batchmate. It needs courage to lead a few hundred men and face an unruly crowd of thousands. Proud of him”.", "He is @ssyips. Son of a farmer, a brilliant officer and someone who always fights for justice. Also my batchmate.", "It needs courage to lead a few hundred men and face an unruly crowd of thousands. Proud of him 👍 https://t.co/SqkOGCIGga", "— Arun Bothra (@arunbothra) January 28, 2021", "Nothing in the video suggests that police officers are offering their resignation. Furthermore, the video was also retweeted by DCP South East Delhi Police.", "Two videos were shared with the false claim that 200 Delhi policemen offered resignation in the backdrop of violence at Singhu border.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]