["By Vanessa Schipani", "Posted on May 12, 2017", "Former President Barack Obama falsely claimed that Let’s Move, an initiative of former First Lady Michelle Obama, “helped bring down America’s obesity rates for our youngest kids for the first time in 30 years.” In fact, research shows the obesity rate for 2- to 5-year-olds has been decreasing since 2004 – long before the initiative began.", "It’s true that the obesity rate for young children continued to decline after the first lady launched Let’s Move in February 2010, but there’s no evidence that it contributed to that decline.", "Obama made his claim at Seeds and Chips, a global food innovation summit that took place in Milan, Italy, between May 8 and May 11.", "President Obama, May 9: By working with schools, businesses and local leaders across America, Let’s Move actually helped bring down America’s obesity rates for our youngest kids for the first time in 30 years.", "We reached out to President Obama’s spokesman, Kevin Lewis, for support for Obama’s recent claims. Over the phone, Lewis said Let’s Move “isn’t still active but the mission continues through partnerships and relationships developed during the Obama Administration.”", "He also pointed out that Obama said Let’s Move “helped” reduce obesity rates among 2- to 5-year-olds in the United States, not that the initiative was completely responsible for the drop. When we asked for proof that it “helped,” he said he would provide some by email, but has yet to do so.", "When research reporting a decline in the obesity rate of 2- to 5-year-olds was released in 2014, the White House put out a press release quoting the first lady. Though she was “excited” to see that rates had declined over 10 years, she didn’t attribute the decline directly to Let’s Move.", "Michelle Obama, Feb. 26, 2014: I couldn’t be more excited by the news that obesity rates for 2-5 year olds declined by 43% over the last 10 years. Progress of this magnitude can only be explained by the leadership and hard work we are seeing across this country.", "Experts told us there is no evidence the initiative directly influenced childhood obesity rates.", "The former first lady launched Let’s Move with the goal of “solving the challenge of childhood obesity within a generation.”  The initiative’s programs aimed to “ensure that 60 minutes of physical activity [per] day is the norm in K-12 schools across the country” and to encourage schools to incorporate salad bars into lunches, among other goals.", "As for achievements, according to the initiative’s archived website, Let’s Move “[i]ncreased access to fruits and vegetables” by “providing 3 million students with a salad bar,” for example. “Reaching over 12 million kids,” the initiative also equipped schools with “a customized action plan” to increase physical activity among children, the website says.", "In unison with the initiative’s launch in 2010, President Obama signed a memorandum to establish a Task Force on Childhood Obesity. In a May 2010 report, the task force outlined a plan that aimed to reduce the U.S. childhood obesity rate to 5 percent by 2030.", "But since the launch of Let’s Move, the obesity rate for all children aged 2 to 19 has remained stable. Between 2009 and 2014, the obesity rate for 2 to 19 year olds has hovered around 17 percent, up from 10 percent for children surveyed in the late 1980s and early 1990s.", "Since the 1970s the percentage of U.S. children with obesity “has more than tripled,” reports the Centers for Disease Control and Prevention.", "Michele Polacsek, a childhood obesity expert at the University of New England in Maine, told us by email that a diet including more sugary drinks likely played a notable role in the rise in obesity for both children and adults.", "“Liquid calories are especially harmful because they don’t displace other calories in our diet,” she explained. “A 200 calorie drink doesn’t make a person feel ‘full’ the way a ‘solid food’ 200 calories would.”", "According to the CDC, “[m]any factors contribute to childhood obesity,” such as genetics, the speed of an individual’s metabolism, eating behaviors and quantity of physical activity. Children with obesity are at a “higher risk” for other chronic health conditions, such as asthma and type 2 diabetes, says the CDC. They are also “more likely” to suffer from depression.", "Unlike the trend for children ages 2 to 19,  some research has shown a declining trend since 2004 in the obesity rate for children between 2 and 5 years old. In other words, that trend began before the launch of Let’s Move.", "In a paper published in the Journal of the American Medical Association, Cynthia L. Ogden, an epidemiologist at the CDC, and others reported that the obesity rate was 7.2 percent for 2- to 5-year-olds surveyed between 1988 and 1994. This rate peaked at 13.9 percent for kids surveyed between 2003 and 2004.", "The first decline in the obesity rate for 2- to 5-year-olds in more than a decade occurred between 2005 and 2006, when the rate dropped to 10.7 percent from 13.9 percent in 2003-2004.", "Since the launch of Let’s Move, the rate has fluctuated – dropping to 8.4 percent between 2011 and 2012 and rising to 9.4 percent for the children surveyed between 2013 and 2014. However, Ogden told us by email that the “estimates for 2-5 year olds in 2011-2012 and 2013-2014 are not statistically different from each other.”", "What does “statistically different” mean?", "Ogden and her group estimated the obesity rate for the U.S. population of 2- to 5-year-olds as a whole based on a sample of children in that age range. The obesity rate for the 2011 to 2012 survey sample group, for example, is 8.4 percent.", "For the population as a whole, the researchers can only estimate the rate within a range, which they call a “confidence interval.” The range for the 2011 to 2012 survey period, for example, is 5.8 to 11.7 percent.", "This means Ogden and her group can confidently say that the entire 2 to 5 year old population’s obesity rate falls within that range, based on their analysis of the sample group. And the ranges for the 2011 to 2012 and 2013 to 2014 survey periods aren’t all that different from one another.", "Overall, the researchers concluded the obesity rate for 2- to 5-year-olds rose steadily until it peaked in 2003 to 2004, and then began to decline.", "But Michael Goran, an expert in childhood obesity at the University of Southern California, isn’t completely convinced by these numbers.", "“There has not been a consistent fall in obesity levels and levels tend to fluctuate from year to year,” he told us by email. “We need to see a consistent change to make any more definitive conclusions.”", "Goran added “there is no way to directly link/draw a line between what Let’s Move did and changes in the obesity rate,” as Obama claimed.", "Polacsek, at the University of New England, also told us there’s “no evidence” that Let’s Move “directly affected the obesity rate.”", "Polacsek added that it “would be very difficult to tie” Let’s Move “back directly to national obesity rates especially given that obesity is a multifactorial problem and so many other programs were working to impact obesity rates at the same time.”", "Polacsek held back from making a definitive claim on whether or not there’s a solid declining trend in obesity rates for 2- to 5-year-olds. But she did acknowledge that obesity prevalence percentages for 2- to 5-year-olds “jump around quite a bit.” The number of participants for each survey period “are actually pretty small once they are broken down by age,” she explained, and the “smaller the numbers in analyses—the more likely they are to jump around.” This means that Ogden’s analysis is “most useful when looking at multi-year trends but no conclusions should be drawn from one data point to the next,” added Polacsek.", "However, the CDC and the U.S. Department of Agriculture does have some additional evidence supporting a downward trend.", "Researchers at these agencies looked at obesity trends from 2000 to 2014 for children ages 2 to 4 years old from low-income families who participated in the Special Supplemental Nutrition Program for Women, Infants, and Children. This program provides food, health care referrals, and nutrition education to women and children under 5.", "The researchers found that the obesity rates decreased from 15.9 percent in 2010 to 14.5 percent in 2014. However, that’s still above the 2000 rate, which was 14 percent.", "The report adds that, “Local, state, and national obesity initiatives,” such as Let’s Move, “might be contributing to the modest declines in obesity” by raising awareness of the problem of childhood obesity. But the report provides no definitive support.", "It’s also worth mentioning that it’s unclear whether or not programs started under Let’s Move will continue under the Trump administration.", "In December 2010, Obama signed into law the Healthy Hunger-Free Kids Act, which mandated the Secretary of the U.S. Department of Agriculture to “update the meal patterns and nutrition standards for the school lunch program” with the aim of “reducing childhood obesity.” In January 2012, the USDA finalized a rule that “requires most schools to increase the availability of fruits, vegetables, whole grains, and fat-free and low-fat fluid milk in school meals,” among other things.", "But earlier this month, USDA Secretary Sonny Perdue signed a proclamation that “begins the process of restoring local control of guidelines on whole grains, sodium, and milk” for school lunches. This includes allowing states to exempt schools from having to provide whole-grain products and beginning the regulatory process to allow schools to provide 1 percent flavored milk, which has added sugars.", "Let’s Move may have contributed to a decline in the obesity rate of young children, but there’s no evidence of it, as Obama claimed. Experts say this would be a hard to measure, given that childhood obesity is a multifactorial problem.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]