["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton continues to face criticism for using a private email during her time as Secretary of State.", "Hillary Clinton’s announcement that she would run for president was met with a round of attacks from Republicans on the Sunday shows. Taking up the cause on Fox News Sunday was 2012 Republican presidential nominee Mitt Romney.", "\"You've seen in polls and in discussions across the country a feeling that Hillary Clinton is just not trustworthy,\" Romney said April 12, 2015. \"This whole story about her having erased all of her emails even though they were subject to recall and review by Congress, I think that's made people remember that with the Clintons, it's always something.\"", "We have dissected before the web of laws and regulations that surround Clinton’s use of a private email account as Secretary of State. For this fact-check, we look at Romney’s claim that she erased all of her emails when they should have been kept for use by Congress.", "A review of the facts shows Romney had a point, but he mangled the details.", "A quick recap", "In March, the public learned that instead of using a State Department email account when she was in charge, Clinton ran all of her email through a private server in her New York home. When State Department officials asked for copies of her government-related emails late last year, Clinton’s staff went through her files and sent over about 30,000. According to Clinton, about an equal number of emails were judged to be personal and were erased.", "Specific to Romney’s statement that Clinton erased all of her emails, there is no question that she preserved and delivered thousands to the State Department.", "Clinton has said that all of this was in line with federal regulations. We have found that it isn’t so cut and dried.", "The National Archives and Records Administration (NARA) oversees federal recordkeeping, and its code requires federal agencies to keep records that document agency activity so that they are readily available when needed -- such as for Freedom of Information Act requests or congressional inquiries.", "However, not all records need be retained. Agencies have the discretion to delete material that is deemed to have no value.", "The laws are tighter today than when Clinton was secretary, but even during her tenure, her sole reliance on a private email account skirted the law, experts tell us.", "\"The key thing is that while use of a personal account was not prohibited, exclusive use of it was,\" said Daniel Metcalfe, professor of law at American University and former director of the Department of Justice’s Office of Information Policy.", "With a State Department email account, all of Clinton’s emails would have been stored on a government computer. Any researcher or government body would then have access, pending the normal privacy and security reviews. (That said, the department preserves relatively few emails.)", "Clinton’s private email account changed the process completely. She, not a government worker, had control over the emails, and even though emails she sent to government workers would have been saved under their email accounts, searching those records would be infinitely more complicated.", "Romney’s botched wording", "The legal experts we reached said Romney’s use of the phrase \"recall and review by Congress\" is ambiguous. (We tried to reach Romney for clarification and did not hear back by the time we published. If we learn more, we will update this fact-check.)", "Jason R. Baron is a lawyer at Drinker Biddle and Reath and a former director of litigation at the National Archives and Records Administration. Baron told PunditFact that in the most literal sense, Congress plays no role at all in deciding what materials should be preserved when an official leaves office.", "\"This is an executive branch function,\" Baron said. \"In most agencies when a senior official leaves, there is a protocol to review the documents that the official might have. The Federal Records Act doesn’t expect Congress to review anything.\"", "On the other hand, Congress has the right to subpoena records as part of an investigation and congressional committees have been investigating the deaths at the American compound in Benghazi, Libya. This might be what Romney had in mind. But if he did, that makes his point even harder to prove.", "Douglas Cox is a law professor who specializes in government records law at the City University of New York. Cox said Romney is on thin ice if he meant that Clinton ducked a congressional subpoena.", "\"Clinton has stated that she turned over to the State Department any records responsive to congressional subpoena at the time,\" Cox said. \"An allegation that she destroyed records subject to subpoena is a serious one, and it is speculative absent more specific evidence.\"", "Baron raises one legal wrinkle that might bolster Romney’s claim. He said it’s possible that Clinton had a reasonable expectation that a committee might want to dig further. Baron said in the private sector, if you think that a future lawsuit might call for certain records, you should keep them.", "\"If I were her lawyer, I would have told her that it would be prudent to preserve any evidence that might be subject to a congressional inquiry,\" Baron said.", "Regardless of the legal arguments on that score, Baron said he believes that what Clinton did -- stepping down without a department review of her records and then unilaterally deleting some -- was inconsistent with the spirit if not the letter of the Federal Records Act. Cox shares that view, even as he discounts Romney’s statement.", "\"Clinton's decision to destroy all emails that she and her private attorneys unilaterally decided were not federal records is both shocking and suspicious,\" Cox said. \"But the problem is that not all of her emails were ‘subject to recall and review by Congress.’ There is plenty of justifiable criticism for Clinton's actions, but that does not appear to be one of them.\"", "Our ruling", "Romney said that Clinton \"erased all of her emails even though they were subject to recall and review by Congress.\" Romney got it wrong when he spoke of all of her emails. We know that about 30,000 emails were turned over to the State Department.", "Romney’s words about recall and review by Congress are ambiguous. In terms of preserving records, legal experts agree that Congress has no direct role. That is a function of the executive branch. In terms of a congressional investigation, a legal expert told us Clinton did respond to congressional subpoenas, and there is no proof she destroyed evidence subject to a congressional investigation.", "Romney’s statement contains an element of truth -- Clinton did delete some emails -- but ignores critical facts that would give a different impression. We rate it Mostly False.", "Fox News, Fox News Sunday, April 12, 2015", "Washington Post, \"Complete text of Hillary Clinton’s remarks on e-mails, Iran,\" March 10, 2015", "PolitiFact, Hillary Clinton's email: Did she follow all the rules?, March 12, 2015", "New York Times, \"Hillary Clinton Used Personal Email Account at State Dept., Possibly Breaking Rules,\" March 2, 2015", "National Archives and Records Administration, Reappraisal and Deaccessioning of Archival federal records, Feb. 4, 2013", "National Press Club, Clinton's use of personal email violated public record rules, panel says, April 9, 2015", "National Security Archive, Department of State Electronic Email Preservation Rate Hovers under 0.0061%, March 11, 2015", "Interview, Jason R. Baron,lawyer, Drinker Biddle & Reath, April 12, 2015", "Email interview, Douglas Cox, law professor, City University of New York, April 12, 2015", "Email interview, Daniel Metcalfe, law professor, American University, April 12, 2015", "Email interview, Nate Jones, archivist, National Security Archives, April 12, 201", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]