["By Angelo Fichera", "Posted on September 6, 2018", "Q: Is it true that Michael Jordan “walked away” from Nike?", "A: No. That false story was first published by a website that calls its work satire.", "Did Michael Jordan step down from his position with Nike due to the controversial ad they just released?", "A viral story that claims that the basketball legend Michael Jordan has “walked away” from Nike is false.", "The piece, originally published on a self-described satirical website, was one of several made-up stories that misled many on social media by capitalizing on the Nike controversy.", "The sports apparel company this week unveiled advertisements featuring Colin Kaepernick, the one-time San Francisco 49ers quarterback who in 2016 began kneeling on the sidelines during the national anthem to protest social injustice. Some Nike customers have condemned the company for the partnership.", "“BREAKING: Michael Jordan Resigns From The Board At Nike-Takes ‘Air Jordans’ With Him,” reads the viral Sept. 5 headline on trumpbetrayed.us. The story was republished by other websites, including charlottepost.site, without any indication that it was meant to be satirical.", "The item begins with the claim that Jordan “has walked away from the Board of Directors at Nike, taking his patented ‘Air Jordan’ line with him.” A fictitious statement from an alleged spokesman says Jordan is a “patriot” and “completely against the hiring of a traitor and is taking his shoes elsewhere.”", "But Jordan doesn’t even sit on the company’s board of directors. Other signs of its dubious nature include the name of the non-existent spokesman, Art Tubolls, a name often used by the publication — and the claim that there are “two pairs” of Air Jordans “floating on the feet of astronauts in space at this very moment.”", "The same network of websites, America’s Last Line of Defense, published a story this week claiming Nike had ended its deal with Kaepernick over an “anti-white rant” (we debunked that as well) and another saying that the U.S. government cancelled an “$80 Million Nike Contract” (also fictional).", "The creator of the websites, Christopher Blair, told the Boston Globe earlier this year that his stories are intended to undermine conservatives by “injecting them with stupidity to cure their stupidity.”", "But the Jordan piece shows how, even after commenters point out that the piece is false, others continue to share and engage with the content as if real. One day after its publication, the original story’s link had been shared nearly 112,000 times on Facebook, according to CrowdTangle data.", "In between comments of “fake news,” were repeated words of praise for Jordan’s supposed stand — some called him a “patriot” and “classy.”", "“Thank you Mr Jordan for standing behind our country and flag,” another wrote.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“About.” Trumpbetrayed.us. Accessed 6 Sep 2018.", "Baker, Billy. “One of the country’s biggest publishers of fake news says he did it for our own good.” The Boston Globe. 7 Apr 2018.", "“BREAKING: Michael Jordan Resigns From The Board At Nike-Takes ‘Air Jordans’ With Him.” Trumpbetrayed.us. 5 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]