["About this rating", "A chemical compound found in the blood of horseshoe crabs is widely used in the biomedical community to test for the presence of bacterial exposure or infection. This limulus amebocyte lysate (LAL) test is used to ensure that vaccines, including those for COVID-19, as well as medical equipment, are not contaminated with toxins. A synthetic alternative is available but not yet widely used.", "The blue-hued blood from horseshoe crabs is not an ingredient of the COVID-19 vaccine.", "We have yet to learn how frequently LAL tests are being administered currently in the production of COVID-19 vaccine fluids by each individual producer.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "So-named for their U-like shape, horseshoe crabs are known as “living fossils” (the species predates the dinosaurs) that have thrived relatively unchanged for the last 445 million years. And their copper-rich, blue-hued blood plays a crucial role in modern medicine.", "As the coronavirus pandemic pressed on, a number of publications in 2020 reported on the horseshoe crab’s importance in fighting COVID-19. That role was again brought to public attention in December 2020 when photographer Timothy Fadek shared photographs to social media showing horseshoe crabs being “milked” for their blood.", "The claim resurfaced again when a photograph of horseshoe crabs being milked for their blue-hued blood appeared on Reddit in March 2021. And though it looks like something from a sci-fi film, this photograph depicts a real and widespread practice.", "Despite their name, horseshoe crabs are more closely related to spiders. They are named for the shape of their front shell, called the prosoma. And with 10 highly sensitive eyes, these archaic creatures are made up of four species, only one of which (Limulus polyphemus) is found in North America along the Atlantic and Gulf Coasts from Maine to Mexico.", "Perry Bill/Public Domain", "In the U.S., every drug approved by the U.S. Food and Drug Administration must be tested for bacterial contaminants, including endotoxins. Horseshoe crabs have a highly sensitive immune response to endotoxin contamination, a type of bacteria that can cause severe infection in humans, particularly via intravenous or injectable therapeutics like vaccines. When the crabs are exposed to these toxins, their blood coagulates. So live crabs are “milked” for a substance in their blood called Limulus Amebocyte Lysate (LAL), according to the Ecological Research and Development Group, a nonprofit organization whose primary focus is the conservation of horseshoe crab species. LAL tests are used at all stages in the production of medicine and biological products to ensure that endotoxins are not present.", "“This compound coagulates or clumps up in the presence of small amounts of bacterial toxins and is used to test for sterility of medical equipment and virtually all injectable drugs. That way, when you get a vaccine you know it hasn’t been contaminated by any bacteria, wrote the Florida Fish and Wildlife Conservation Commission.", "“Anyone who has had an injection, vaccination, or surgery has benefited from horseshoe crabs!”", "This LAL test can detect and quantify bacterial endotoxins in injectable pharmaceuticals, like the COVID-19 vaccine, as well as biological products and medical devices, according to the American Pharmaceutical Review. And for the last five decades, LAL extracted from horseshoe crabs has been a vital part of testing biomedical products for sterility. (For a deeper look at how the test is conducted, read the United States Pharmacopeial Convention, nonprofit science organization, characterization of bacterial endotoxins test here.)", "Vaccine producers are required to submit their LAL testing plans to the FDA, however, the agency does not disclose this type of information on testing plans for vaccines as it is commercial and confidential information. Snopes each vaccine producer to determine how and when LAL plans are administered but did not hear back as of this writing. We will update the article accordingly. At the time of this writing, three COVID-19 vaccines are available on the U.S. market — Pfizer, Moderna, Johnson & Johnson — and more than 110 million doses have been administered around the nation, according to data published by the Centers for Disease Control and Prevention (CDC). As manufacturers ramp up production to meet U.S. President Joe Biden’s goals of making all Americans eligible for the vaccine by May 1, global leaders have called for “urgent action” to hasten delivery.", "And with more vaccines come more LAL tests.", "U.S. Secretary of Defense/Public Domain", "Horseshoe crabs are considered vulnerable — one tier above endangered — by the International Union for Conservation of Nature, with populations decreasing around the globe. And in 2018, at the most recent count, around a half-million individual crabs were collected by the biomedical industry to support the production of LAL, reported the Atlantic States Marine Fisheries Commission.", "Research has shown though that the bleeding of crabs is ecologically unsustainable for all four species of horseshoe crabs, both for the crab themselves and the shorebirds that feed on their eggs. Studies have also shown that even though crabs are released back into the wild after they have been bled, up to 30% of crabs harvested may die — and that doesn’t account for further trauma the animal may experience once it’s returned to the ocean.", "To combat this, researchers have biotechnologically engineered a substance known as Recombinant Factor C (rFC) that could be used as an alternative to LAL tests in some products, like testing of water and other materials used in the manufacturing process, potentially reducing the need to bleed horseshoe crabs by 90%. Over the course of a six-year study ending in 2019, rFC was shown to be equally as reliable as LAL tests and suitable for routine bacterial endotoxin. In May 2020, the USP expressed support for the introduction of rFC to the U.S. market as a synthetic alternative, noting that it proved to be a consistent and reliable resource during tumultuous times of economic, environmental, and political instability — particularly as demand for LAL tests increased in the year following the coronavirus pandemic.", "The first drug tested by rFC was approved by the FDA for use in 2018, but at the time of this writing rFC was not widely used on a global scale. However, at the time of this writing, the sterility of COVID-19 vaccines were still determined via LAL testing.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]