["The image was posted on Facebook here. The post has been shared more than 140 times.", "The photo purports to show a comparison between “Neil Armstrong’s astronaut suit” (L) and “his footprints on the Moon” (R). The post goes on to claim that Armstrong’s boots do not match his purported boot prints on the Moon and concludes: “Now you decide whether the moon landing was real or a hoax.”", "Neil Armstrong was the first man to walk on the Moon as part of the Apollo 11 mission in 1969. A summary of the mission was published here on NASA’s website.", "The image comparison was also shared hundreds of times alongside similar claims on Facebook here, here, here, here and here.", "The claim is false.", "The image of Neil Armstrong’s astronaut suit was taken by American astronomer Phil Plait. It was featured in this article for online magazine Slate, which reports on the Smithsonian’s National Air and Space Museum efforts to conserve the suit.", "The boot print image, however, actually shows a footprint left by Armstrong’s fellow Apollo 11 astronaut Buzz Aldrin, according to this listing on the US National Gallery of Art’s website.", "Below is the screenshot comparison used in the misleading Facebook posts (top) and the original images of Armstrong’s spacesuit and Aldrin’s boot print (bottom):", "Dr Cathleen Lewis, a spacesuit expert from the US-based Smithsonian National Air and Space Museum, told AFP the boot prints and the boots featured in the misleading posts do not match because Armstrong and Aldrin wore different boots on the Moon.", "“All twelve Apollo astronauts who walked on the surface of the Moon wore lunar overshoes,” she said. “These oversized galoshes had blue silicone soles that left the iconic footprint in the lunar surface dust.", "“They were designed to provide the Apollo astronauts with added traction in the dust. The lunar overshoes also had extra layers of white beta cloth and thin layers of insulation textiles to add further protection against unfiltered solar radiation.”", "This photo on the NASA website documents the Apollo 11 mission. It shows Aldrin exiting the Lunar Module with the blue silicone lined lunar overshoes mentioned by Lewis. The boot tread matches the footprint pictured in the misleading Facebook posts.", "An image comparison of the photo of Buzz Aldrin exiting the Lunar Module and Aldrin’s boot print can be seen below.", "Lewis also explained that the image of Armstrong’s suit does not include the lunar shoes because he and Aldrin left their overshoes on the Moon “due to weight considerations”.", "“The overshoes, Personal Life Support Systems and other equipment were considered as ballast,” she said. “Every gram that they left on the surface of the Moon meant that they could bring back an additional gram of lunar samples”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]