["About this rating", "In spring and summer months, warnings about tick-borne illnesses are spread in regions of the United States where ticks are prevalent. In 2015, increased concern over the Powassan virus (contracted via ticks) heightened the spread of warnings about ticks and the diseases harbored by them.", "In early April 2015, a tick-related photograph began circulating on Facebook with several explanations appended to it. In some iterations, the user who shared the image reportedly spotted the unusual clump and later searched for the image to find out what it was; in others, the user identified the depicted substance as tick eggs (or a \"tick nest\") and warned fellow Facebook users to \"burn\" the eggs on sight. The photograph was often identified by those who shared it as \"local\" in states as distant from one another as Texas and New York:", "On our walk today, I noticed a weird clump of black \"balls\" on the path. I took a picture of it and when I got home, I was able to zoom in on the picture and noticed a couple of little red ticks. I googled 'tick eggs' and that's what the black clump was! Tick eggs! Yuck. If I had known, I would have smashed them. ugh", "Despite the these claims, it is extremely unlikely that this picture shows tick eggs. One hint is that tick eggs do not look like the objects shown in the picture: they may possess a textural resemblance, but tick eggs are more translucent and also much smaller, as demonstrated by the eggs of the soft-bodied Argasidae family above and black legged ticks (in this case Ixodes scapularis, sometimes known as a deer tick) below. The image of Ixodes scapularis includes our attempt at a rough estimate of the size of the eggs:", "Our size estimate comes from a CDC scaled image of a female Ixodes scapularis tick (showing a roughly ~3mm width) and Photoshop scaling to find what fraction of that width is represented by the longest part of the eggs (~0.3 mm).", "In contrast, the image presented in the viral posts shows non-translucent objects that are much larger, (unless one assumes the blades of grass in that viral image are less than a single millimeter wide):", "For these reasons, we reject the interpretation that this is an image of a clutch of tick eggs. Our best guess (and it is only a guess) is that these are the ovaries of a frog or other amphibian regurgitated by a predator, an interpretation found in Reddit discussions of the photograph bolstered by a similar looking stock image described as “Common Frog spawn spit out by predator.”", "Getty Images.   \"Common Frog Spawn Spit Out by Predator.\"\r\n    Accessed 8 July 2017.", "Schwan, Tom G.   \"Vector Interactions and Molecular Adaptations of Lyme Disease and Relapsing Fever Spirochetes Associated with Transmission by Ticks.\"\r\n    Emerging Infectious Diseases.   February 2002.", "CDC Public Health Image Library.   \"#5967\"\r\n    Accessed 8 July 2017.", "CDC Public Health Image Library.   \"#22182\"\r\n    Accessed 8 July 2017.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]