["About this rating", "A photograph showing Hillary Clinton's portrait surrounded by snowmen is real.", "This portrait was not hung by President Obama in 2016 as part of the holiday decorations; it has been at the White House since 2004.", "On 29 November 2016, the web site The Hill reported that a portrait of Hillary Clinton was featured among the White House's Christmas decorations:", "An official portrait of the former first lady and Democratic presidential nominee is hanging in the Cross Hall of the White House, displayed alongside an array of bells, baubles and other holiday décor.", "This image is real. However, several web sites (such as WebDaily.com and FreedomDaily.com) distorted The Hill's report and published articles reporting that President Obama had hung \"something sick\" at the White House as a \"middle finger\" to Donald Trump:", "If I wasn’t already exhausted from all the Hillary drama, this would be the nail in the coffin. The Obama’s have decorated the White House, and it seems they can’t even do that without being annoying. They have basically just flipped Trump off, once more by hanging a portrait of Hillary Clinton prominently among numerous amounts of Christmas decorations right smack dab centered above the fireplace in the Cross Hall.", "[...]", "Newsflash, Mr. and Mrs. Obama… Hillary Clinton didn’t win, nor did Trump steal the election from her. Americans gave it to him. America has spoken and the longer the Obama’s keep acting like fools over it, the more they are hurting their own party.", "It would have been far more appropriate to hang a portrait of the Trumps as the soon to be presidential family.", "This portrait was not placed on the White House walls by President Obama, nor was it first unveiled in some sort of retaliation attempt against Donald Trump's election. This portrait has been hanging in the White House since 2004, when it was unveiled by President George W. Bush alongside another portrait of another former president, Bill Clinton:", "President Bush praised his predecessor's \"energy and joy\" Monday as the official portraits of former President Clinton and first lady Hillary Rodham Clinton were unveiled in a lighthearted ceremony at the White House.", "The Clintons received a standing ovation from guests in the East Room of the executive mansion before the paintings by artist Simmie Knox were revealed.", "\"President Clinton and Sen. Clinton, welcome home,\" Bush said. Clinton said it was a great honor for him, his wife -- now a U.S. senator from New York -- and their family to return to \"this wonderful place we called home for eight years.\" Bush's introduction, he said, \"made me feel like a pickle stepping into history.\"", "Hillary Clinton was not the only former first lady whose portrait was surrounded by Christmas decorations in 2016. A brief look through Getty Images revealed similar photographs, showing (for example) Claudia Alta \"Lady Bird\" Johnson and Laura Bush:", "To sum up: Twelve years after a portrait of Hillary Clinton was first put on a White House wall, two snowmen were placed near it as part of this year's holiday decorations.", "Kurtz, Judy.   \"Clinton Portrait Featured Among White House Christmas Decorations.\"\r\n    The Hill.   29 November 2016.", "CNN.   \"Bush welcomes Clintons for portrait unveiling.\"\r\n    15 June 2004.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]