["http://cms.politifact.com/admin/art/resource/add/", "A remark by U.S. Rep. Sean Duffy about President Barack Obama, climate change and violent extremism was so startling that an interviewer made a point to repeat it.", "And it made us wonder: Does the Department of Homeland Security really spend a bunch of money on climate change but doesn’t make it a priority to fight \"violent extremism?\"", "The Wisconsin Republican made his claim Dec. 9, 2015 after being asked about the terrorism in San Bernardino and how to fight such domestic threats.", "\"When the president sent over his budget to the House of Representatives, he had a homeland security budget,\" Duffy said on \"Varney & Co.,\" a talk show on Fox Business Network.", "\"He put $16 million to fight climate change in Homeland Security, and didn't have a line item to fight violent extremism. The president doesn’t take this seriously.\"", "The claim surprised host Stuart Varney.", "\"That’s very important, Sean,\" Varney replied. Obama's budget for the Department of Homeland Security had $16 million for climate change \"but nothing extra, that we know about, to fight and find these guys who are already here? That's the situation?\" Varney asked.", "\"That is the situation,\" Duffy said.", "Well, not really.", "There is no line item in the Department of Homeland Security budget for fighting violent extremists -- defined by the department as \"individuals who support or commit ideologically-motivated violence to further political goals.\"", "A line item can signify whether something is a priority, as Duffy argues. But his claim is misleading in that DHS, as well as other federal departments, spend money to fight violent extremism.", "Climate change", "To back the claim, Duffy’s office cited PolitiFact National’s May 2015 fact check of U.S. Rep. Michael McCaul, a Texas Republican who is chairman of the House Homeland Security Committee.", "McCaul had said more money is dedicated within the Department of Homeland Security to climate change than what's spent combating \"Islamist terrorists radicalizing over the Internet in the United States of America.\"", "Our colleagues rated the statement Mostly True.", "But Duffy’s claim is much broader -- about fighting violent extremism generally, rather than spending specifically to fight Islamist terrorists over the Internet.", "Our colleagues found that the Department of Homeland Security’s budget for fiscal 2016 arguably included $16 million for climate change. That figure was part of Duffy’s claim.", "There is $10 million \"for analyses of climate change impacts on infrastructure critical to national and economic security, and national public health and safety.\" And $6 million for the Federal Emergency Management Agency, which is part of homeland security, for \"climate workshops and regional resilience coordination\" done by FEMA.", "And while the Department of Homeland Security has a senior-level official who serves as the coordinator of Countering Violent Extremism, that office has no separate line item in the budget.", "But just because there isn’t a line in a budget doesn’t mean the department is ignoring violent extremism. A few examples from the Department of Homeland Security’s budget:", "Four to eight full-time staff assigned to countering violent extremism.", "$1 million for a database to analyze past violent extremist incidents and see what sort of programs work best to head off attacks.", "Part of the department’s $1 billion National Preparedness Grant Program to state and local governments can be spent on projects to spot early signs of terrorist planning.", "Said Duffy spokeswoman Cassie Smedile: Four to eight staffers isn’t a sign of a high priority to \"when you consider that DHS employs more than 240,000 people.\"", "Fair point. But does the average citizen necessarily care which department’s federal employees are involved in fighting violent extremism?", "The Department of Homeland Security works with federal and local agencies on countering violent extremism. And the Justice Department has a $15 million line item for countering violent extremism, including $4 million for \"domestic radicalization research.\"", "Our rating", "Duffy said Obama’s homeland security budget had \"$16 million to fight climate change\" but \"didn't have a line item to fight violent extremism.\"", "There is no line item in the Department of Homeland Security budget for fighting violent extremism. But that ignores the fact that millions of dollars are allocated, inside and outside the Department of Homeland Security, to counter violent extremists.", "Duffy’s statement contains an element of truth but ignores critical facts that would give a different impression -- our definition of Mostly False.", "YouTube, Fox Business News \"Varney & Co.\" interview of U.S. Rep. Sean Duffy, Dec. 9, 2015", "Email interview, U.S. Rep. Sean Duffy communications director Cassie Smedile, Dec. 16, 2015", "Email exchange, White House regional communications director Kaelan Richards, Dec. 16, 2015", "Email exchange, Committee for a Responsible Federal Budget research director Loren Adler, Dec. 16, 2015", "Email exchange, Committee for a Responsible Federal Budget program associate Chris Towner, Dec. 16, 2015", "Taxpayers for Common Sense vice president Steve Ellis, Dec. 16, 2015", "PolitiFact National, \"Does Homeland Security put more money into climate change than stopping online terrorism recruiting? (Mostly True)\" May 14, 2015", "PolitiFact Wisconsin, \"10,000 IRS agents but only 2 dozen people focused on 'violent extremism'? (Mostly False)\" Nov. 25, 2015", "U.S. Department of Homeland Security, 2016 Budget", "U.S. Department of Homeland Security, \"Countering violent extremism,\" Oct. 14, 2015", "U.S. Justice Department, FY16 budget request", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]