["The Department of Workforce Development was able to assign all claims older than 21 days for adjudication by Dec. 30, 2020", "But that created a backlog of claims awaiting adjudication, with 9,000 claims going to 500 adjudicators", "Another backlog still persists today: thousands of Wisconsinites are still awaiting an appeals hearing for their denied claim", "Over the past year, since the coronavirus pandemic began, Wisconsin’s unemployment system has faced a host of issues.", "Flooded with applications as stores, restaurants and other businesses shut down or closed entirely, the state Department of Workforce Development struggled to keep up with claims.", "The situation was complicated by an outdated computer system, one that had to be reprogrammed to accommodate unique elements of the pandemic response, such as bonus payments from the federal government.", "Employees were transferred from other departments to help with the influx of claims, and new employees were hired to answer the phones and adjudicate cases. Still, by mid-summer more than 100,000 claims were waiting for adjudication, leaving thousands of Wisconsinites struggling to buy food and pay rent. (In many cases, one person had multiple weekly claims awaiting review and approval).", "In September, Gov. Tony Evers asked the head of the department to resign. The new head, Amy Pechacek, launched a partnership with Google and on Dec. 30, 2020 -- in her first news release as secretary-designee of the department -- declared:", "\"Since the start of the pandemic, our top priority at DWD has been ensuring that all eligible unemployment claims in Wisconsin are paid as quickly as possible. Today, I am proud to say we have reached our goal to clear the backlog of claims.\"", "Now, typically we don’t examine claims that are more than two months old. And we won’t blame a backlog for our tardiness. Rather, we’ll note that this is a good point -- one year since the pandemic began -- to examine where the backlog issue stands.", "Of course, we’ll examine things as they stood when the claim was made.", "That said, many things remain the same as they did at the close of 2020 when the backlog was declared eliminated.", "So, was Pechacek right?", "When asked about the clearing of the backlog, department spokesperson Amy Barrilleaux told PolitiFact Wisconsin that it was absolutely cleared by Dec. 30, 2020.", "All claims 21 days or older, she said, had been assigned to an adjudicator at that point, which in the eyes of the U.S. Department of Labor means the claim has been processed.", "But even though all the claims had been assigned to adjudicators, unemployed Wisconsinites still had to wait for their claims to be resolved, which can take days or weeks, depending on the complexity of the claim -- a point Barrilleaux acknowledged.", "At the time the department announced the end of the backlog, there were 9,000 claims assigned for adjudication, going to about 500 adjudicators, according to a Dec. 30, 2020 Milwaukee Journal Sentinel report.", "Asked if any outstanding claims from 2020 are still in adjudication, Barrilleaux would not say, but she noted no claims from 2020 are awaiting assignment to an adjudicator.", "At this stage in 2021, there are roughly 2,100 claims awaiting adjudication, and on average claims are being assigned to an adjudicator after 7.4 days, far less than the 21 days considered standard for non-pandemic years.", "So, while the state touted the backlog was eliminated, it didn’t mean everyone had their case resolved.", "Similarly, a backlog of appeals was not cleared up.", "When an unemployment claim is denied, the applicant can seek an appeal hearing, in which the claimant and former employer go before an administrative law judge.", "According to another Dec. 30, 2020 report from the Milwaukee Journal Sentinel, Pechacek acknowledged the backlog, and said the department was working to hire more administrative law judges to manage the load of appeals. At that time, Pechacek estimated about 15,000 appeals were awaiting assignment to a judge, a number she said was too high.", "But since then, the number of appeals awaiting assignment has continued to grow, not shrink.", "As of Feb. 20, 2021, more than 16,117 appeals were still pending, according to the department website.", "Barrilleaux said that the backlog of appeals is mostly caused by a lack of judges and the historic volume of appeals. About 50,000 people filed an appeal in 2020, and 30,972 of those cases had moved through the appeals process as of January, Barrilleaux said.", "The department is currently hearing appeals from September.", "At the end of December, Pechacek said the state had eliminated its backlog of unemployment claims.", "That was accurate, at least by the measure used by the Department of Labor. But on a practical level, that didn’t mean that the cases had all been resolved. To the contrary, many cases had simply been assigned to an adjudicator at that point, and were awaiting a final decision. And a high volume of appeals meant a delay at that stage as well.", "Our definition of Half True is \"The statement is partially accurate but leaves out important details or takes things out of context.\"", "That fits here.", "Department of Workforce Development, \"DWD clears Wisconsin unemployment claims backlog,\" Dec. 30, 2020", "Email conversation with Amy Barrilleaux, spokesperson for the Department of Workforce Development, March 4, 2021", "Milwaukee Journal Sentinel, \"State faces challenges renewing extended unemployment benefits under new coronavirus relief plan,\" Dec. 30, 2020", "Milwaukee Journal Sentinel, \"After helping to clear backlogged unemployment claims, Amy Pechacek appointed head of DWD,\" Dec. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]