["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Mitch McConnell enlisted the help of his wife, former Secretary of Labor Elaine Chao, to push back against claims from Democratic challenger Alison Lundergan Grimes that the Kentucky Republican is anti-women.", "\"Have you ever noticed how some liberals feel entitled to speak on behalf of all women? As if every woman agrees with Barack Obama,\" Chao says in an ad released Aug. 5, 2014.", "A narrator adds: \"Mitch McConnell co-sponsored the original Violence Against Women Act – he’s always supported its purpose. Mitch voted for even stronger protections than Obama’s agenda will allow.\"", "We took a look at Grimes’ ad in a separate fact-check. We said the claim that McConnell voted \"two times against the Violence against Women Act\" was Half True, given McConnell’s history of voting in favor of the law at times.", "But what about McConnell’s response that he \"voted for even stronger protections\" than the Violence Against Women Act that President Barack Obama signed?", "The Violence Against Women Act first passed Congress in 1994 and, according to the Congressional Research Service, was \"intended to change attitudes toward domestic violence, foster awareness of domestic violence, improve services and provisions for victims, and revise the manner in which the criminal justice system responds to domestic violence.\"", "The bill was reauthorized and expanded several times in the succeeding two decades, most recently in 2013.", "While the Violence Against Women Act sailed to reauthorization in 2000 and 2005, attempts to do so in 2012 and 2013 were marred by partisan fighting in Congress.", "Democrats presented a bill with three new components that many Republicans rejected:", "including victims of discrimination for sexual orientation and gender identity among \"underserved populations\";", "increasing the cap on U-Visas, a visa that grants nonimmigrant status to immigrant victims of domestic violence who assist police in prosecuting their attackers;", "allowing non-American Indian residents on tribal land to be prosecuted by tribal courts for domestic violence.", "The 2012 Senate bill died in the House, but the 2013 version passed Congress and was signed by Obama.", "Both years, Republicans offered their own versions of the Violence Against Women Act. Those measures, McConnell’s campaign said, included provisions that made them \"stronger\" than the bill Obama signed into law.", "What were those provisions?", "For starters, Republicans proposed mandatory minimum sentences — ranging from 5 to 15 years — on certain sexual assault crimes.", "However, advocates of domestic violence awareness were specifically against the inclusion of these provisions.", "The National Task Force to End Sexual and Domestic Violence Against Women, an umbrella group for many stakeholders advocating on this issue, worried that long mandatory minimums would \"keep victims who were assaulted by someone they know from reporting\" and would create other issues in sentencing.", "\"These proposals are solutions in search of problems, and will only serve to exacerbate the already existing problem of prison overcrowding,\" the organization wrote.", "McConnell’s campaign also noted that the Republican amendments required that 30 percent of the grant money given to states and localities to train and assist law enforcement in combating violence against women must be set aside for sexual assault. The Democratic bill put the figure at 20 percent.", "But this was more a shift in priorities than anything. It wasn’t allocating extra money to combat violence against women, just mandating how much of the pot must be spent on a specific type of violence.", "Advocates of the Democratic bill said the Republican bill was weaker because it did not include the additional protections for LGBT, immigrants and American Indian women who are abused on tribal land by non-natives.", "While there were may have been considerable political differences on whether those provisions should be part of the Violence Against Women Act, it’s hard to claim that bills that didn’t include them — the ones McConnell supported — had \"stronger protections.\"", "Our ruling", "McConnell’s ad claimed that he \"voted for even stronger protections than Obama’s agenda will allow.\"", "Perhaps McConnell could argue that the mandatory minimum sentences Republicans required in their alternative made for a \"stronger\" bill, but advocates of domestic abuse awareness opposed this measure as unnecessary.", "And the Republican measure was absent several protections for certain groups that were included in the bill Obama signed. McConnell is within his right to oppose those provisions, but it makes it hard for him to prove that he supported \"stronger\" legislation.", "We rate the claim Mostly False.", "Mitch McConnell campaign ad, \"As If,\" July 30, 2014", "FactCheck.org, \"Playing Politics with Violence Against Women,\" July 31, 2014", "Congressional Research Service, \"The Violence Against Women Act: Overview, Legislation, and Federal Funding,\" March 6, 2014 (obtained through the Federation of American Scientists)", "Congressional Research Service, \"The Violence Against Women Act: Overview, Legislation, and Federal Funding,\" May 10, 2012", "Govtrack.us, S. 2754 (101st): Violence Against Women Act of 1990, accessed Aug. 12, 2014", "Govtrack.us. S. 15 (102nd): Violence Against Women Act of 1991, accessed Aug. 12, 2014", "Govtrack.us, S. 11 (103rd): Violence Against Women Act of 1993,  accessed Aug. 12, 2014", "U.S. Senate, U.S. Senate Roll Call Votes 103rd Congress - 2nd Session Vote No. 295, H.R. 3355 Violent Crime Control and Law Enforcement Act of 1994, Aug. 25, 1994", "The Library of Congress, Bill Summary & Status 103rd Congress (1993 - 1994) S.1607, accessed Aug. 12, 2014", "U.S. Senate, \"Party Division in the Senate, 1789-Present,\" accessed Aug. 12, 2014", "Govtrack.us, H.R. 3244 (106th): Victims of Trafficking and Violence Protection Act of 2000, accessed Aug. 12, 2014", "Library of Congress, Bill Summary & Status 109th Congress (2005 - 2006) S.1197, accessed Aug. 12, 2014", "Congress.gov, S.1925 - Violence Against Women Reauthorization Act of 2012, accessed Aug. 12, 2014", "Congress.gov, S.Amdt.2095 to S.Amdt.2093112th Congress (2011-2012), accessed Aug. 12, 2014", "Congress.gov, S.47 - Violence Against Women Reauthorization Act of 2013, Aug. 12, 2014", "Congress.gov, S.Amdt.14 to S.47, accessed Aug. 12, 2014", "CQ.com, Member profiles: Sen. Mitch McConnell, accessed Aug. 12, 2014", "National Task Force to End Sexual and Domestic Violence Against Women, \"The Grassley-Hutchison Substitute Harms Victims, Increases Costs, Creates Inefficiency,\" 2012", "U.S. Justice Department, Grant Programs, accessed Aug. 12, 2014", "Email interview with Charly Norton, spokeswoman for Alison Lundergan Grimes, Aug. 11-12, 2014", "Email interview with Allison Moore, spokeswoman for McConnell, Aug. 11-12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]