["About this rating", "In February 2017, an image macro featuring President Donald Trump's chief strategist, Steve Bannon, along with a purported quote of his began to circulate online, holding that Bannon had once proclaimed:", "I'm a Leninist. Lenin wanted to destroy the state, and that's my goal, too. I want to bring everything crashing down, and destroy all of today's establishment.", "Unlike other image macros of its ilk, this one did replicate a seemingly documented quote, one recorded in an article published by the Daily Beast. On 22 August 2016, writer Ronald Radosh recounted a conversation he reportedly had with Bannon at a party he attended in 2013:", "[...] we had a long talk about his approach to politics. He never called himself a “populist” or an “American nationalist,” as so many think of him today. “I’m a Leninist,” Bannon proudly proclaimed.", "Shocked, I asked him what he meant.", "“Lenin,” he answered, “wanted to destroy the state, and that’s my goal too. I want to bring everything crashing down, and destroy all of today’s establishment.” Bannon was employing Lenin’s strategy for Tea Party populist goals. He included in that group the Republican and Democratic Parties, as well as the traditional conservative press.", "Radosh followed up with Bannon before he published that information three years later, in 2016. The author said that he sent Bannon an e-mail to see if the latter wanted to clarify or correct his position, but Bannon told him he had no recollection of the conversation:", "I emailed Bannon recalling our conversation, telling him that I planned to write about it and asking him if he wanted to comment on or correct my account of it. He responded:", "“I don’t remember meeting you and don’t remember the conversation. And as u can tell from the past few days I am not doing media.”", "We searched for other instances in which Bannon referred to himself as a Leninist and came up empty-handed. However, we did find multiple instances of Bannon's espousing anti-establishment ideals (although there was no other instance of him saying that he wanted to \"destroy the state\").", "In January 2016, for instance, Bannon was quoted by the Washington Post's referring to him as \"virulently anti-establishment\":", "“We call ourselves ‘the Fight Club.’ You don’t come to us for warm and fuzzy,” said Stephen Bannon, Breitbart’s executive chairman and one of its guiding editorial spirits. He adds, “We think of ourselves as virulently anti-establishment, particularly ‘anti-’ the permanent political class. We say Paul Ryan was grown in a petri dish at the Heritage Foundation.”", "In 2013, Bannon said that he didn't believe that the United States had a functional conservative party:", "“We don’t believe there is a functional conservative party in this country and we certainly don’t think the Republican Party is that,” he told a gathering of conservatives in Washington, D.C.  “It’s going to be an insurgent, center-right populist movement that is virulently anti-establishment, and it’s going to continue to hammer this city, both the progressive left and the institutional Republican Party.”", "While the purported quote bears a resemblance to other comments that Bannon has made, we have marked it as \"Unproven\" since we have been unable to turn up any other documentation of the conversation Bannon specifically said he does not recall.  A request for comment from Bannon had not been responded to by publication time.", "Radosh, Ronald.   \"Steve Bannon, Trump's Top Guy, Told Me He Was 'A Leninist' Who Wants To ‘Destroy the State.’\"\r\n    The Daily Beast.   22 August 2016.", "Friedersdorf, Conor.   \"The Radical Anti-Conservatism of Stephen Bannon.\"\r\n    The Atlantic.   25 August 2016.", "Farhi, Paul.   \"How Breitbart Has Become a Dominant Voice in Conservative Media.\"\r\n    The Washington Post.   27 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]