["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "National Guard members stationed in Washington to secure Joe Biden’s inauguration were forced to relocate from the U.S. Capitol. Some ended up resting in a cramped parking garage.", "There are conflicting statements about who requested the relocation, but there is no evidence or indication that Democratic lawmakers or the Biden administration played a role.", "The National Guard told PolitiFact that members of Congress had no knowledge of the relocations. Many offered their personal offices and conference rooms to the troops after they were alerted to the situation.", "Lawmakers from both parties expressed outrage after the National Guard members summoned to Washington to secure President Joe Biden’s inauguration were ordered to vacate the U.S. Capitol and take rest in nearby parking garages and outdoor areas.", "The National Guard members returned to the Capitol hours after they were ordered out, according to Politico.", "But as photographs showing the troops sprawled on the floor circulated on social media, so, too, did unsubstantiated rumors about who was responsible for pushing them out.", "One Facebook post sought to blame Biden and the Democratic Party.", "\"It’s absolutely DISGUSTING that the Democrats forced our GREAT troops to sleep on the ground of a PARKING garage after dragging them to DC for photo ops!\" the Jan. 21 Facebook post said. \"None of the troops even knew why they were there!\"", "The post and others like it were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There are conflicting statements about who requested the relocation, but the National Guard told PolitiFact that congressional members didn’t know about it.", "Politico reported that one National Guard unit resting in the Dirksen Senate Office building was abruptly told by Capitol Police to vacate on the night of Jan. 21. The unit ended up in a parking garage that lacked internet reception and had just one electrical outlet and one bathroom with two stalls. This was supposed to accommodate 5,000 troops, the article said.", "After offering up his office to the Guard, Sen. Martin Heinrich, D-N.M., tweeted around 10 p.m. that the situation was being resolved. Heinrich said the troops would be able to return to the Capitol complex that night.", "But who ordered the Guard members to vacate the Capitol in the first place? That’s where things get tricky.", "In a statement to Politico, Capitol Police spokesperson Eva Malecki said the department recently asked that troops’ shifts be reduced from 12 hours to eight. This was meant to allow for additional rest hours away from the Capitol complex.", "Politico and other outlets, including the Washington Post, reported Jan. 21 that the National Guard said the instruction to relocate came from the Capitol Police.", "But in another statement released the morning of Jan. 22, Acting Capitol Police Chief Yogananda Pittman said that with the exception of specific times on Inauguration Day, Capitol Police \"did not instruct the National Guard to vacate the Capitol Building facilities.\"", "\"The Department is also working with the Guard to reduce the need for sleeping accommodations by establishing shorter shifts,\" Pittman said, \"and will ensure they have access to the comfortable accommodations they absolutely deserve when the need arises.\"", "PolitiFact reached out to the Capitol Police for more information, but we did not hear back.", "The National Guard, however, said lawmakers had no knowledge of the relocations.", "\"Our understanding is that the unfortunate request for the National Guard to be relocated was made to the Capitol Police by a couple of staffers, without the knowledge of the congressional members,\" National Guard spokesperson Wayne Hall wrote in an email.", "Hall added that many lawmakers, like Heinrich, offered their offices and conference rooms to the troops after they found out about the situation.", "The Capitol Police and National Guard released a joint statement Jan. 22 to address the confusion. It didn't clarify who made the initial request, but said the departments are working together to ensure on-duty troops could rest in Capitol facilities, and off-duty in hotels.", "\"The USCP and the National Guard have coordinated their efforts to ensure that National Guardsmen and women stationed throughout the Capitol Complex are in appropriate spaces within congressional buildings, including the U.S. Capitol, where they may take on-duty breaks. Off-duty troops are being housed in hotel rooms or other comfortable accommodations,\" it stated.", "Some Facebook posts making similar claims specified that it wasn’t just Democrats behind the relocations, but the Senate. But Senate Majority Leader Chuck Schumer, D-N.Y., said he also didn’t know about the relocation until after it happened.", "\"It came to our attention last night that members of the National Guard, after standing on duty to protect the Capitol for Inauguration Day, keeping us safe, were sleeping in parking garages, in cramped quarters, without proper space or ventilation,\" Schumer said Jan. 22 on the Senate floor. \"It was utterly unacceptable. I have told those who run the security of the Capitol that it can never happen again. And I pledge to every National Guard member that it will not happen again.\"", "Schumer added: \"The minute I heard about this outrage last night, we made sure it was fixed immediately. Every member of the guard was found proper accommodations inside and as of this morning, everyone was accounted for and taken care of. This morning, I went over to the CDC, and I spoke to a number of Guardsmen personally to make sure they were okay.\"", "If this is true, it's outrageous.I will get to the bottom of this.https://t.co/CNBp055A91", "Drew Hammill, a spokesperson for House Speaker Nancy Pelosi, D-Calif., said Pelosi was also \"not involved in or aware of this deeply troubling matter until press reports.\"", "The Facebook post also provided no evidence to support its claim that the over 26,000 National Guard members tasked with securing Biden’s inauguration were there \"for photo ops.\" There is no indication that Democrats in Congress \"dragg(ed) them to DC\" for that reason.", "The National Guard deployed its troops to Washington following the violent riot in which Trump’s supporters stormed the Capitol and halted congressional proceedings. PolitiFact reported that Capitol Police were outnumbered and overwhelmed during the Jan. 6 siege.", "The FBI had warned about the potential for more violence at protests and events surrounding the inauguration. The National Guard said in a statement that no security incidents involving its members ever materialized.", "A Facebook post said \"Democrats forced our GREAT troops to sleep on the ground of a PARKING garage after dragging them to DC for photo ops!\"", "Our reporting found no evidence that Democratic lawmakers or members of the Biden administration ordered the relocation of the National Guard members seen sleeping in parking garages. Lawmakers expressed outrage over the situation, and the National Guard told PolitiFact that many offered their personal offices as rest areas for the troops.", "The National Guard members were brought to Washington to secure the city on and around Inauguration Day — it was not for a photo op.", "We rate this Facebook post False.", "Facebook post, Jan. 21, 2021", "Politico, ‘We feel incredibly betrayed’: Thousands of Guardsmen forced to vacate Capitol, Jan. 22, 2021", "Twitter, Martin Heinrich post, Jan. 21, 2021", "Washington Post, ‘This is absurd’: Hundreds of National Guard members banished to Senate parking garage, soldiers say, Jan. 22, 2021", "U.S. Capitol Police, Statement of Acting Chief Pittman regarding National Guard Accommodations, Jan. 22, 2021", "The National Guard, National Guard Support to the District of Columbia, Jan. 21, 2021", "New York Times, National Guard troops who protected the Capitol for Biden’s Inauguration were told to sleep in a parking garage., Jan. 21, 2021", "PolitiFact, Fact-checking post claiming to show picture of armed soldiers protecting inauguration, Jan. 16, 2021", "PolitiFact, Ask PolitiFact: Did Capitol Police let mob of Trump supporters in? Jan. 7, 2021", "Joint Statement from National Guard Bureau and US Capitol Police, January 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]