["By D'Angelo Gore", "Posted on June 10, 2020", "A TV ad from a Republican super PAC uses video of Joe Biden inaccurately explaining his climate plan against him. Biden’s campaign has said he would not completely ban fossil fuels, specifically fracking, as the ad appears to show him saying.", "The ad, from America First Action, which supports the reelection of President Donald Trump, shows a clip from a July 2019 CNN debate in which Biden said, “we would make sure it’s eliminated,” when asked if there would be a place for “fossil fuels, including coal and fracking” if Biden becomes president.", "Biden’s campaign later clarified that he supports ending subsidies for the fossil fuel industry, and transitioning, by 2050, to a clean energy economy with net-zero emissions. That’s what the plan he released in June 2019 also says he would do.", "Later in the ad, a graphic shown on screen says, “Joe Biden could cost Pennsylvania 600,000 jobs.” But that figure comes from a U.S. Chamber of Commerce study of a nationwide ban on fracking for oil and natural gas, which Biden’s campaign said he actually doesn’t support.", "America First Action released the ad on June 4, attacking Biden, the presumptive Democratic presidential nominee, for proposed policies that would have an impact on energy jobs. The pro-Trump group has so far spent more than $230,000, according to Advertising Analytics, to run the 30-second commercial in at least five TV markets across Pennsylvania — a key electoral swing state.", "The ad starts with this abbreviated exchange between Biden and CNN’s Dana Bash during a Democratic presidential candidates’ debate the cable news network hosted last summer:", "Bash, July 31, 2019: … would there be any place for fossil fuels, including coal and fracking, in a Biden administration?", "Biden: No, we would — we would work it out. We would make sure it’s eliminated.", "Biden’s full response was: “No, we would — we would work it out. We would make sure it’s eliminated and no more subsidies for either one of those, either — any fossil fuel.”", "He has made other statements about ending fossil fuels since then.", "“I guarantee you, we’re going to end fossil fuel,” Biden told an environmental activist who confronted him at a campaign event in New Hampshire back in September.", "Five months later, at another New Hampshire rally in February, Biden said to protesters who interrupted his remarks: “We are going to get rid of fossil fuels.”", "But Biden’s plan isn’t that simple, as his campaign explained the day after his initial remarks at the July debate.", "“Joe Biden is committed to achieving a 100% clean energy economy and net-zero emissions by 2050,” his team said in a statement to reporters who asked for clarification on his proposal. “He supports eliminating subsidies for coal and gas and deploying carbon capture sequestration technology to create economic benefits for multiple industries and significantly reduce carbon dioxide emissions.”", "As we have written before, net-zero emissions would mean the amount of greenhouse gases emitted in the U.S. would be matched by the amount sequestered, or removed, from the atmosphere.", "Biden’s climate goals are outlined in “Joe’s Plan for a Clean Energy Revolution and Environmental Justice,” which his campaign released in June 2019.", "The plan says Biden will provide incentives for the development and use of carbon capture technology, and work to hold polluters financially accountable. It also says Biden will help fossil fuel workers, such as coal miners and power plant operators, make the move to clean energy jobs.", "But, during the transition, the U.S. would continue to rely on fossil fuels for at least some of its energy. Notably, Biden’s campaign has said he would continue to largely allow fracking, formally known as hydraulic fracturing, a drilling technique used to extract oil and natural gas, which are fossil fuels, from rock formations underground.", "Some critics concluded that Biden would implement a full ban on fracking after comments he made during a one-on-one debate with Vermont Sen. Bernie Sanders in March.", "“I’m talking about stopping fracking as soon as we possibly can,” said Sanders, stating his support for an all-out ban. “I’m talking about telling the fossil fuel industry that they are going to stop destroying this planet — no ifs, buts and maybes about it.”", "“So am I,” said Biden, before later adding: “No more – no new fracking.”", "Biden’s campaign later clarified that Biden was only referring to new drilling for oil and natural gas on federally owned areas. As his climate plan states, Biden would ban “new oil and gas permitting on public lands and waters.”", "That makes America First Action’s claim that “Joe Biden could cost Pennsylvania 600,000 jobs” misleading. (The claim was also featured in a deceptive six-second video the super PAC posted to Facebook.)", "The source of the figure is a 2019 paper the U.S. Chamber of Commerce’s Global Energy Institute published on what would happen if all fracking were ordered to cease.", "“Simply put, a ban on fracking in the United States would be catastrophic for our economy,” the paper, issued in December, said. “Our analysis shows that if such a ban were imposed in 2021, by 2025 it would eliminate 19 million jobs,” including nearly 609,000 in Pennsylvania, which is the second largest natural gas producing state.", "Most fracking, however, is reportedly done on private or state-owned land, which would not be stopped under the plan Biden has announced.", "Biden clearly would like the U.S. to be much less dependent on energy from fossil fuels, and he has inaccurately described his own clean energy plan on more than one occasion. But the plan he has released — and that his campaign said he still supports — would not eliminate fossils fuels, or fracking, completely, or cost Pennsylvania 600,000 jobs.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]