["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Elizabeth Warren escalated her battle to break up Facebook by posting an ad that intentionally included a false account about Mark Zuckerberg backing President Donald Trump.", "Warren’s goal was to show that the social media giant allows misinformation by Trump.", "\"Breaking news: Mark Zuckerberg and Facebook just endorsed Donald Trump for re-election,\" the Oct. 10 ad began. \"You're probably shocked, and you might be thinking, \"how could this possibly be true?\"", "The ad then pivoted to a disclaimer — no, the Facebook CEO did not endorse Trump — before attacking Facebook: \"What Zuckerberg *has* done is given Donald Trump free rein to lie on his platform –-- and then to pay Facebook gobs of money to push out their lies to American voters. If Trump tries to lie in a TV ad, most networks will refuse to air it. But Facebook just cashes Trump's checks.\"", "Warren’s post followed an unsuccessful push by the Joe Biden campaign to get Facebook to reject a Trump campaign ad about Biden’s role in the firing of a prosecutor in Ukraine. PolitiFact rated a statement in a similar Trump ad False. Facebook denied Biden’s request.", "We decided to fact-check Warren’s claim that unlike Facebook, most TV networks will refuse to air a political campaign ad that contains falsehoods.", "While the Warren campaign cited a half dozen examples in recent years of TV networks or stations rejecting ads, we found that broadcast networks are generally required to run candidate ads under federal law. The same law doesn’t apply to cable networks or to PAC ads.", "Facebook does have a partnership with third-party fact-checkers -- including PolitiFact -- to debunk viral hoaxes and demote that content. But Facebook exempts politicians from the fact-checking program, stating that it won’t \"referee political debates\" or block a politician’s speech from an audience.", "While Facebook drew attention for an announcement in September about exempting political candidates, that had already been Facebook’s policy since 2017.", "Christopher Terry, a University of Minnesota professor of communications and expert on political advertising, said that because Facebook is a private unregulated platform, it can do what it wants.", "\"Because Facebook is its own playground, it gets to make its own rules,\" he said.", "Facebook has set rules about transparency to show who paid for ads. But it doesn’t restrict political content.", "There are rules, however, for television.", "Section 315 of the Federal Communications Act of 1934 states:", "\"If any licensee shall permit any person who is a legally qualified candidate for any public office to use a broadcasting station, he shall afford equal opportunities to all other such candidates for that office in the use of such broadcasting station: Provided, That such licensee shall have no power of censorship over the material broadcast under the provision of this section.\"", "It also specifically says licensees can’t censor \"material broadcast by any such candidate.\"", "Broadcasters are bound by that act and therefore can’t reject a presidential candidate’s ad, even if contains false information. (The candidates do have to abide by disclosure rules to make it clear who paid for the ad.)", "Every election season, some candidates argue that they have been unfairly attacked and that broadcasters should take down ads, wrote David Oxenford, a lawyer who has represented broadcasters for decades and is a partner at Wilkinson Barker Knauer LLP.", "However, \"broadcasters can’t censor a candidate ad, so they can’t reject it (or remove it from the air) no matter what its content is,\" Oxenford wrote.", "There are caveats.The law does not apply to PACs or independent expenditure ads. And, importantly, the rules for political ads have been interpreted not to apply to cable networks such as CNN. The rules do apply to local cable operators.", "Cable networks somewhat subscribe to the idea in the act that they won’t censor content, but they aren’t bound by it, Terry said.", "CNN rejected an ad about Biden and the Ukraine prosecutor. The ad mentioned \"media lapdogs\" for the Democrats as it showed footage of CNN stars.", "The ad disparages CNN and \"makes assertions that have been proven demonstrably false by various news outlets,\" a CNN spokesperson told PolitiFact.", "That ad was one of a handful of ads the Warren campaign cited as examples of political ads TV or radio rejected in recent years. Multiple stations and Facebook ultimately rejected a Trump ad about a migrant caravan in 2018 that critics said was racist.", "We sent Warren’s examples to Terry, the University of Minnesota professor. He said that Warren’s examples included issue ads, which aren’t covered by the rule.", "\"It’s only the campaign ads that are protected from the no-censorship provision,\" he said.", "The Warren campaign also cited an FCC website page that states broadcasters should \"act with reasonable care to ensure that advertisements aired on their stations are not false or misleading.\" However, it’s the FCC law that bans censorship that truly carries weight.", "We also found that in May 2017, multiple networks refused to air a Trump ad about his first 100 days that had a \"fake news\" graphic superimposed over the photos of news anchors. It appeared networks rejected the ad by making a case that Trump didn’t yet meet the legal qualifications of a candidate more than three years before the election.", "Warren said, \"If Trump tries to lie in a TV ad, most networks will refuse to air it. But Facebook just cashes Trump’s checks.\"", "This is a misreading of both federal and actual practice. Federal law requires broadcast networks to run political candidate ads without vetting them for lies or falsehoods. The same law does not apply to cable networks, but those networks also generally aim to run such ads, experts told us.", "Warren does have a point that federal law does not apply to online social networks such as Facebook, so Facebook can take candidate ads regardless of whether they include falsehoods.", "But overall, it’s inaccurate to say that \"most networks\" will refuse to air an ad by Trump with a lie in it. We could find no evidence that most networks reject false candidate ads.", "We rate this statement Mostly False.", "Warren for President, Facebook ad, Oct. 10, 2019", "Elizabeth Warren, How we can break up big tech, March 8, 2019", "Facebook, Policies, Accessed Oct. 14, 2019", "Facebook, Letter to Joe Biden campaign, 2019", "Facebook, Tweet, Oct. 12, 2019, Sept. 24, 2019", "Facebook, Facebook, Elections and Political Speech, Sept. 24, 2019", "Facebook, Updates to Ads About Social Issues, Elections or Politics in the US, Aug. 28, 2019", "Federal Communications Commission, Statutes and Rules on Candidate Appearances & Advertising, Communications Act of 1934", "Broadcast Law Blog, Questions about the Truth of Political Ads, What’s a Broadcaster to Do When a Candidate Complains About an Attack Ad? – The No Censorship Rule for Candidate Ads, Sept. 23, 2014", "Fletcher, Heald and Hildreth’s CommLawBlog, Political Broadcasting Rules Q&A, Feb. 27, 2018", "Fletcher, Heald and Hildreth’s CommLawBlog, Political Broadcasting Rules Q & A: Updated for 2019, Sept. 24, 2019", "Fletcher, Heald and Hildreth’s CommLawBlog, On Censoring Political Ads, Oct. 16, 2014", "NBC, Elizabeth Warren ramps up battle with Facebook, Oct. 13, 2019", "Factcheck.org, False Ads: There Oughta Be A Law! – Or Maybe Not, June 3, 2004", "Washington Post, Elizabeth Warren’s Facebook ad proves the social media giant still has a politics problem, Oct. 12, 2019", "Washington Post, Warren's fake Facebook ad stirs debate, Oct. 14, 2019", "Washington Post, A Facebook policy lets politicians lie in ads, leaving Democrats fearing what Trump will do, Oct. 10, 2019", "New York Times, Facebook’s Hands-Off Approach to Political Speech Gets Impeachment Test, Oct. 8, 2019", "Tampa Bay Times, Ron DeSantis campaign gets attack ads pulled after citing PolitiFact in cease and desist letter, April 23, 2018", "Wall Street Journal, NBCU Cable Networks Refuse to Air Trump Campaign Ad Aimed at Joe Biden, Oct. 10, 2019", "Mother Jones, Aborted Fetuses to Star in 2012 Election Ads, Nov. 17, 2011", "Whitmire Gilcrist for Michigan, TV Stations in Grand Rapids, Flint, Traverse City Pull Down False DeVos Attack Ads Against Whitmer, Nov. 2, 2018", "CNN, Watch the pot ad that got yanked off TV, July 21, 2015", "New York Times, CNN Rejects 2 Trump Campaign Ads, Citing Inaccuracies, Oct. 3, 2019", "Wisconsin Public Radio, TV Stations Pull Anti-Feingold Campaign Ad, May 9, 2016", "Federal Communications Commission, Complaints About Broadcast Advertising, Nov. 17, 2017", "NBC, Statement to PolitiFact, Oct. 14, 2019", "CBS, Statement to PolitiFact, Oct. 14, 2019", "CNN, Statement to PolitiFact, Oct. 15, 2019", "Email and telephone interview, Daniel A. Kirkpatrick, Co-Managing Member at Fletcher, Heald and Hildreth, Oct. 14-15, 2019", "Telephone interview, Christopher Terry, University of Minnesota assistant professor mass communications, Oct. 14-15, 2019", "Interview, Devon Kearns, Facebook spokeswoman, Oct. 14, 2019", "Email interview, Chris Hayden, Elizabeth Warren campaign spokesman, Oct. 15, 2019", "Email interview, Ellen P. Goodman, Rutgers University law school, Oct. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]