["The meme posted on February 4, 2019 shows a cartoon version of Trump, Salman and Sisi standing next to the orb -- below it is the original photograph.", "The caption says the Simpsons episode that included the shot aired in 2002 but this is false -- it was taken from a promo released by Animation on FOX, a YouTube channel operated by the US television network, on May 26, 2017.", "The original photograph of the three world leaders had gone viral a few days earlier, on May 21, 2017. As tweeted by the Saudi embassy in Washington, it shows them attending the inauguration of the Global Center for Combating Extremist Ideology in Riyadh. The mysterious glowing \"orb\" was in fact a decorative globe.", "@KingSalman and @POTUS inaugurate The Global Center for Combatting Extremist Ideology in Riyadh. #RiyadhSummit pic.twitter.com/do6cFL7wBW", "The image itself became a meme, inspiring a wide range of jokes among web users.", "when that dank orb hits pic.twitter.com/B559plLEnm", "What a time to be alive pic.twitter.com/cJvtGaCVgH", "Trump supporters... just sayin ??‍♂️ • • • • • • #TrumpSupporters #Illuminati #Goosebumps #RLStine #TrumpOrb #SaudiOrb #Orb #Insanity #Drumpf #BeCarefulWhatYouWishFor", "A post shared by  Tom Saporito (@tommysap) on May 22, 2017 at 6:32am PDT", "The Simpsons writers are known for sometimes creating eerily predictive episodes that come to fruition -- for example, the 1998 episode which foreshadowed a deal between Walt Disney Co. and 21st Century Fox 19 years later.", "Disney announces it has reached a deal to acquire 21st Century Fox, as predicted by a Simpsons episode that first aired on November 8, 1998. pic.twitter.com/kzloJQHeM8", "The idea that The Simpsons predicted world leaders' gathering at the orb was debunked by fact-checking website Snopes when the meme first emerged in the US in 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]