["About this rating", "On 14 November 2016, web site World News Daily Report published an article reporting that a California resident named Tania Whitmore ran over her husband after learning that he had voted for Donald Trump in the 2016 U.S. presidential election:", "A Californian woman severely injured her husband by hitting him at great speed with her SUV, after he confessed that he had voted for Donald Trump in the last presidential election.", "Tania Whitmore, a devoted militant for the Hillary Clinton campaign, allegedly used her Ford Escape SUV to trample her husband, Darrell Johnson, after he told her that he’d voted for Trump.", "Investigators believe that her vehicle was going at more than 65 miles per hour it hit Mr Johnson, around 7:30 this morning. After the collision, it changed direction and ended up crashing into a large tree.", "Officers of the San Diego Police Department rapidly arrived on the site, and were fortunately able to arrest her before she had time to finish her spouse.", "The claim may have sounded familiar, given that an Arizona woman really had been convicted on two counts of aggravated assault after a similar incident following the election of 2012. But the mugshot attached to the Trump-related claim actually belonged to a story about a 2015 child neglect case.", "World News Daily Report solely traffics in falsehoods and fake news, grabbing various images on the internet to illustrate their clickbait fabrications. The sensational claims inevitably generate traffic on social media, particularly as no other outlets carry the spurious stories it peddles.", "Although a woman was arrested in 2012 for running her husband down after the election, the claim about a \"militant\" Hillary Clinton supporter striking her spouse with an SUV for voting for Donald Trump was entirely false.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]