["Around June 1, a five-minute video of an interview of a woman recorded in the style of an exposé went viral. The woman appears to be an office-bearer and is sitting behind a desk. She says, “These people are terrorists and we are giving them VIP treatment… we are exhausting our resources on them, getting our doctors ill for them…we are using 100 test kits per day on them, if they didn’t exist we wouldn’t need the kits… these people should be hit and kept in solitary confinement… Can’t Yogi ji give an order that state’s resources won’t be used on them.. we are sacrificing Rs 100 crores of the nation for these 20 crores.” The population of Muslims in India is approximately 20 crores.", "A mic with the logo of ‘News इंडिया 1’ can be seen in the video. The interviewers behind the camera are trying to gain an official statement from the woman for their news bulletin. As per social media claims, the woman being interviewed is Aarti Lalchandani, the principal of GVSM Medical College, Kanpur.", "Alt News has received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "The social media claims are true. The person in the video is indeed Aarti Lalchandani, the principal of GVSM Medical College in Kanpur. On June 1, several media outlets published a report about the viral video including The Hindu and The Indian Express.", "According to The Hindu, “Lalchandani first said that the video was “morphed” and that she did not refer to any community or target Muslims. But in the same breath, she also admitted that she made the comments as a vent during the initial days of the COVID-19 crisis in Kanpur.”", "She told both the publications that the local journalist who leaked the video tried to blackmail her and extort administrative favours. However, speaking with Alt News, Lalchandani said that she wasn’t aware of the clip’s existence until it became viral on social media. It is unclear how she could possibly be blackmailed over something that wasn’t in her notice. Moreover, she was unable to provide any evidence of the same.", "Omar Rashid, the journalist who wrote the report for The Hindu, tweeted that Lalchandani told the outlet that she had made the comments in anger.", "The principal of Kanpur Medical College Arati Lalchandani allegedly calls Tablighi Jamaat members terrorists, says they should be sent to dungeons, jungles & solitary confinement rather than being treated in isolation wards. She told @the_hindu that she made the comment in anger pic.twitter.com/vfM2tVnTaV", "— Omar Rashid (@omar7rashid) May 31, 2020", "In her statement that was sent over WhatsApp, Lalchandani wrote, “THESE ARE NOT MY STATEMENTS GIVEN TO MEDIA but a malicious sting and do not reflect my inner feelings.” She added, “Even a mother in her anger says go to hell to her own children. And then hugs them the next moment. My actions have always spoken louder than words and will continue to do so. I shall continue serving you all and you can always send to me anyone in need. I work 24 hours for you.”", "It is pertinent to note that Lalchandani did not apologise for the racist comments.", "Therefore the social media claim associated with the video is true. Aarti Lalchandani, the principal of GVSM Medical College in Kanpur, indeed made derogatory remarks against Tablighi Jamaat members and the Muslim community. She said they the country should put them behind bars instead of spending money and resources for their treatment.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]