["Four images of light-weight helicopters stationed alongside each other have been shared widely on social media.", "“This is Nigeria first set of made in Nigeria helicopters made by Nigeria agency for science and engineering infrastructure (NASENI) (sic),” reads the most viral post, published from a Facebook account called “Amazing African Facts” and shared nearly a thousand times since January 28, 2021.", "Similar claims were also shared on Facebook (here, here and here) and on Instagram here. Nigerian Television Authority, a state-owned media company, shared the claim on Twitter.", "NASENI is the Nigerian National Agency for Science and Engineering Infrastructure and represented the Nigerian government in a deal concluded with Belgian aircraft manufacturing firm, Dynali Helicopter Company.", "The post on “Amazing African Facts” was published shortly after Nigerian President Muhammadu Buhari reaffirmed his support for NASENIs collaboration with Dynali, according to a statement shared on Facebook last month by the president’s spokesperson, Femi Adesina.", "This was followed by a press release from NASENI repeating Buhari’s call for local production of helicopters in Nigeria with fresh directives to the agency and the national aviation authority to secure relevant certifications that would ensure this happens before he leaves office in 2023. Component parts are already being manufactured locally.", "However, the helicopters seen in the social media posts have nothing to do with the deal between Nigeria and Dynali. In fact, no helicopters have been made in Nigeria since the agreement was announced in 2018.", "By running several reverse image searches, AFP Fact Check was able to find one of the photos, used widely with the false claims, on Dynali’s website.", "The image, of four helicopters lined up in a row, appears in a company press release from May 19, 2017, announcing the delivery of Dynali’s 50th H3 Sport light helicopter to a client in France.", "By accessing the photo’s metadata using the InVID WeVerify tool, AFP Fact Check found that the photo was taken on April 13, 2017. Dynali also posted the same photo on their Facebook account the following day.", "Another image from one of the false posts shows seven helicopters inside a hangar. It was published, also on Dynali’s website, on March 9, 2020.", "Similarly, a third photo of a helicopter standing at the entrance of a hangar can be found on the company’s website. Like the other helicopters pictured in the false claims, it was not built in Nigeria.", "The last image of a close-up photo of a helicopter cockpit was first published by Dynali on June 5, 2015, years before the company’s agreement with Nigeria was announced and just days after Buhari was sworn in as president.", "Dynali Helicopter Company confirmed with AFP Fact Check that the four photos were taken in Belgium, not Nigeria. “The photos that you cite in your email were actually taken in Belgium,” said Noël Howard-Jones, the company’s marketing director, in an email on February 2, 2021.", "Howard-Jones confirmed there is an agreement between the company and NASENI “which will ultimately lead to a full technology transfer for the manufacturing of our H3 microlight helicopter in Nigeria”.", "However, several factors have delayed the project, according to Howard-Jones, including the Covid-19 pandemic, which has led to travel restrictions across the globe and reduced airline operations.", "“We are getting teed up to train technicians from NASENI in the assembly of our helicopters from sets of parts as an initial step and this phase will be implemented as soon as the Covid evolution allows for the required travel,” Howard-Jones said.", "“Once Nigerian assembly is running smoothly, we will work on the technology transfer for the fabrication of all the mechanical parts.”", "Meanwhile, NASENI has already secured delivery of its first H3 helicopter. The second is “now being prepared for shipment later this week in a 20-foot container,” according to Howard-Jones.", "The physical appearance of the second helicopter bound for Nigeria does not match those in the images circulating on social media.", "Dynali sent AFP Fact Check a picture of the helicopter, which has been branded in white, red and green, along with a large NASENI emblem.", "NASENI has not yet responded to AFP Fact Check’s request for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]