["By Eugene Kiely", "Posted on January 10, 2018", "Vice President Mike Pence touted the latest jobs report as proof that “manufacturing is roaring back.” The previous administration made a similar claim, but experts then and now said it’s premature to declare a manufacturing renaissance.", "The economy added 196,000 manufacturing jobs last year — the most in any year since 2014, when the economy added 208,000 manufacturing jobs, according to the Bureau of Labor Statistics. But the manufacturing sector has yet to fully recover from the Great Recession.", "As of December 2017, there were 12.5 million manufacturing jobs – 1.2 million fewer than there were in December 2007, when the recession started, BLS data show. At last year’s growth rate, it would take until nearly 2023 just to recover the jobs lost during the recession.", "Pence made his remarks in an interview with the conservative radio show host Dana Loesch. “Look at the jobs numbers that were just released last week — manufacturing is roaring back,” he said.", "The employment figures released on Jan. 5 showed an increase of 25,000 manufacturing jobs in December. That resulted, as we said, in a net gain for the year of 196,000 jobs. That was much better than in 2016, when the economy lost 16,000 manufacturing jobs. But it was not as good as 2011 or 2014, when the economy added a little more than 200,000 manufacturing jobs in each of those years.", "Pence’s declaration of a manufacturing comeback reminded us of when his Democratic predecessor, Joe Biden, boasted in 2012 that “manufacturing is back” after a few years of job growth.", "But, as we wrote at the time, the Information Technology & Innovation Foundation dismissed such talk as premature. Rob Atkinson, founder and president of the Information Technology and Innovation Foundation, tells us it is still premature.", "Atkinson, co-author of a 2015 report called “The Myth of America’s Manufacturing Renaissance: The Real State of U.S. Manufacturing,” said that being 1.2 million short of the pre-recession jobs level is just one indication that manufacturing is not back.", "“Even more telling,” Atkinson told us, “the U.S. is producing less manufacturing output in the second quarter of 2017 than it did in the last quarter of 2007,” when the recession started.", "“Almost 10 years and NO growth in real output. This is not roaring back, or even back,” Atkinson, citing Bureau of Economic Analysis data, told us in an email.", "He also pointed us to the latest data on labor productivity, which is measured by the amount of manufacturing goods produced (output) per hour of labor.", "“Manufacturing sector labor productivity fell 4.4 percent in the third quarter of 2017, as output decreased 1.1 percent and hours worked increased 3.5 percent,” the Bureau of Labor Statistics said in a Dec. 6 press release. “This was the largest quarterly decline in manufacturing sector productivity since the fourth quarter of 2008 (-5.4 percent).”", "Manufacturing labor productivity is an important indicator of “increased potential national income,” BLS says. But it has declined in 18 of the 39 quarters since the recession started, according to BLS.", "“When you look at manufacturing labor productivity stats over the last 3 years, they are abysmal,” Atkinson told us. “Shocking low if not negative in some quarters. Job creation with negative productivity cannot be the goal.”", "Economics professor Gordon Hanson, director of the Center on Global Transformation at the University of California San Diego, noted that the U.S. economy lost almost 6 million manufacturing jobs from January 2001 to February 2010, the low point for manufacturing jobs during the recession. There were 17.1 million manufacturing jobs in January 2001, but only 11.5 million by February 2010, according to the BLS.", "“Since 2010, job loss has abated and there has been modest recovery,” Hanson told us. “VP Pence is correct to say that manufacturing job growth is strong relative to what it has been this century. But ‘roaring back’ is a bit of an exaggeration as the sector, job wise, has fallen so far.”", "As support for the vice president’s claim about manufacturing “roaring back,” the White House cited “the overall increase” in the Purchasing Managers’ Index, or PMI, which is based on surveys of manufacturing firms by the Institute for Supply Management.", "The ISM’s PMI was 59.7 percent for the manufacturing sector in December. ISM says anything above 50 percent indicates a growing sector, and the figure has been above that level for 16 consecutive months.", "But the index — which has risen and fallen with regularity over the decades — just shows that the manufacturing sector is currently growing, and not contracting. It still has a long way to go before the number of jobs is back to pre-recession levels.", "“No one is arguing that manufacturing is not expanding. But when looked at since 2007 it is not expanded,” Atkinson said. “Bottom line is we will know if the recovery in U.S. manufacturing is real, not from what a sample of purchasing managers say they intend to do but from measures of real value added output.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]