["About this rating", "In July 2014, Eric Garner was stopped by Daniel Pantaleo and several other NYPD officers on suspicion of selling loose, untaxed cigarettes. After Garner protested that he was tired of being harassed and denied that he was selling cigarettes, several officers attempted to arrest him;  Pantaleo took part in the efforts to restrain Garner, wrapping his arm around Garner's neck for about 15 to 19 seconds as the 43-year-old suspect yelled, \"I can't breathe!\" eleven times while lying face down on the sidewalk.", "Garner remained lying on the sidewalk for seven minutes while the officers waited for an ambulance to arrive and was pronounced dead at the hospital approximately one hour later.  The entire incident was captured on video and prompted widespread outrage after a medical examiner concluded that Garner had been killed by \"compression of neck (choke hold), compression of chest and prone positioning during physical restraint by police\":", "In December 2014, a Staten Island grand jury declined to indict Daniel Pantaleo of criminal wrongdoing in the death of Eric Garner, with jurors determining there was not probable cause that a crime was committed by the NYPD officer and delivering a vote of \"no true bill.\"  The non-indictment of  Pantaleo prompted another wave of protests, at one of which New York Daily News photographer Stephanie Keith snapped the award-winning picture of \"a young white woman at the demonstration near the Barclays Center screaming in an officer’s face, her open mouth inches from the cop’s chin\":", "It isn't apparent from the photograph alone whether the young woman who is seemingly \"standing fearlessly, pressed breasts-to-chest with a New York City police officer, passionately shouting in unchecked defiance as another officer looks on passively from a few paces away\" is in fact screaming at the officer seen directly in front of her.  The positioning and facial expressions of the persons in the image suggest that the woman might have been looking beyond the cop to shout at someone or something behind him (outside the right-hand frame of the camera), with the officer in the foreground positioned so as to prevent her from approaching any closer to the object of her ire.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]