["Twitter user Piyush Singh, who is followed by the office of railway minister Piyush Goyal, tweeted two photographs – one where a woman is seen holding a placard against the Citizenship Amendment Act (CAA) and another where a woman has adorned a hijab. The placard read, “I am Swati.” Singh wrote, “On Odd Day. Swati a Hindu. Even Day. Sabiha Khan Muslim” and claimed that both the women are the same person.", "Another user @Being_Vinita who was recently featured on an Alt News fact-check for passing off old images as violence during anti-CAA protests also claimed the same  She posted another image of Swati with a placard during a protest against Tabrez Ansari’s lynching. The placard reads, “I am a Hindu and I love Muslims…You killed our Tabrez, we are all Tabrez.”", "Several users have made similar assertions.", "Alt News fact-checked this claim when Swati’s images were viral after a protest against Tabrez Ansari’s lynching. She is a Delhi-based student who had shared her driving licence with Alt News to confirm her identity. Alt News is withholding her full name at her request.", "The woman wearing a hijab is Sabiha Khan, former leader of the Hyderabad-based political party, All India Majlis-e-Ittehadul Muslimeen (AIMIM). Khan has a dedicated Facebook page with a significant following of over 2 lakh.", "It is noteworthy that Khan’s name is also written on the viral image.", "The facial features of Swati and Sabiha Khan are markedly different.", "It is noteworthy that Khan had posted Swati’s image with the placard condemning Ansari’s lynching which might have led to the earlier confusion of them being the same woman.", "Please share", "Posted by Sabiha Khan on Wednesday, 26 June 2019", "Alt News contacted Khan who said that she is a resident of Mumbai and as far as her knowledge, Swati is a Delhi-based student. “I don’t know why they are misusing my picture. This is completely fake,” she said.", "Thus, a Muslim woman’s image was passed off on social media as a protester who masqueraded as a Hindu woman during anti-CAA protest.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]