["About this rating", "President Trump's decision to recognize Jerusalem as the capital of Israel on 6 December 2017 drew sharp criticism around the world. As the United Nations General Assembly sought to pass a resolution condemning the United State's position, Nikki Haley, the United States Ambassador to the United Nations, announced that she would be \"taking names\" of the country's that sided against the United States. She later threatened to withhold aid to Palestinians.", "So how did the people of Palestine react? According to a viral (but inaccurate) tweet, the Palestinian representative at the UN put a song on his phone and started to dance:", "The Palestinian representative played a song on his mobile phone & danced at the UN as a response to Nikki Haley announcing that the U.S. will be cutting aid to Palestinians unless they recognise Jerusalem as Israel's capital.pic.twitter.com/MGs0H3D5TU", "— Sacha Saeen (@S_Saeen) January 31, 2018", "This tweet (which was, as usual, immediately and uncritically picked up and disseminated by self-styled pundits) got just about everything wrong. The video was not taken in January 2018, the music is not coming from a mobile phone, and it has little to do with Nikki Haley or the U.S. decision to recognize Jerusalem as the capital of Israel.", "This video, which is from 2013, shows Arab Idol winner Mohammed Assaf performing at the United Nations in New York to mark the International Day of Solidarity with the Palestinian People:", "Assaf also addressed the U.N. before his performance:", "“In Gaza, children like me grow in an environment laden with challenges and in an unbelievable way. Many of our parents suffer to find job opportunities or strive hard to put some food on the table,” Assaf said in his U.N. address.", "“There are also the struggle, the isolation and the blockade. Sometimes it seems as if there is no escape,” he added.", "Al Arabiya News.   \"Mohammed Assaf Celebrates ‘Palestine Day’ at U.N. Headquarters.\"\r\n    26 November 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]