["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Social Security today is not the program President Franklin D. Roosevelt had in mind when he signed it into law in 1935, according to former House Speaker Newt Gingrich.", "\"We adopted the modern Social Security system at a time when the average person died before they were old enough to get Social Security,\" he said during a Dec. 2 interview on \"The John Fredericks Show,\" broadcast in Virginia.", "\"We now have some people who are living 50 years on Social Security,\" Gingrich said. \"Nobody ever tried to design a system like this, and we’re going to have to rethink our whole approach.\"", "We wondered if Gingrich was right about life expectancy falling short of Social Security age in 1935.", "The bill signed by Roosevelt offered benefits to retirees when they turned 65.", "U.S. life expectancy for a person born in 1935 was just under 62 years, according to records from the federal Centers for Disease Control and Prevention. On average, girls were expected to live to 64 and boys to 60.", "We were curious whether the retirement age was set purposely at 65 to deprive most people of receiving Social Security. Did Roosevelt make this calculation?", "\"Certainly the Roosevelt administration did not,\" said Edward Berkowitz, a professor of public policy at George Washington University and author of several books on Social Security.", "\"My understanding, that I received from longtime Social Security actuary Robert Myers, was that the age 65 had no particular significance and was chosen because a choice needed to be made and (it) seemed reasonable.\"", "Myers, who died in 2010, helped to write the Social Security law and in a 1992 memoir offered a simple explanation for how the Roosevelt administration chose the qualifying age for benefits.", "\"Age 65 was picked because 60 was too young and 70 was too old,\" he wrote. \"So we split the difference.\"", "Berkowitz told us that life expectancy at birth - then and now - \"is not a good measure of how many people who are working and paying into Social Security will die before age 65.\" That’s because the life expectancy average is skewed by infant deaths. After infancy is survived, life expectancy goes up.", "That said, we’ll give you one final set of numbers. Average U.S. life expectancy from birth in 2015 was 78.8 years, according to figures just released by the National Center for Health Statistics. It declined from 78.9 in 2014 - the first drop since 1993.", "Average life expectancy for men last year was 76.3 years; for women, 81.2.", "Our ruling", "Gingrich said, \"We adopted the modern Social Security system at a time when the average person died before they were old enough to get Social Security.\"", "We rate his statement True.", "Newt Gingrich, comments on The John Fredericks Show, Dec. 2, 2016 (Social Security claim at the 12:13 mark).", "Social Security Act, 1935.", "Social Security Administration, \"Historical Background and Development of Social Security,\" accessed Dec. 8, 2016.", "Email from Edward Berkowitz, professor of public policy at George Washington University, Dec. 8, 2016.", "The New York Times, \"Robert J. Myers, actuary who shaped Social Security Program, dies at 97,\" Feb. 25, 2010.", "National Center for Health Statistics, \"Mortality in the United States, 2015,\" accessed Dec. 8, 2018.", "InfoPlease, \"Life expectancy at birth by race and sex, 1930-2010,\" accessed Dec. 7, 2016.", "PolitiFact, \"Glenn Beck gets numbers on Social Security life expectancy correct,\" March 8, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]