["About this rating", "In a Jan. 30, 2021, TikTok video, user niklongo blew the minds of his collective audience with a purported scientific development by Dutch scientists:", "You wanna have your mind blown?", "Dutch scientists have located and isolated the gene that makes fireflies able to glow, recombined the DNA, and put that DNA in plants, literally creating glow-in-the-dark trees. Eco-friendly outdoor nightlights!", "Follow for more!", "Broadly speaking, these claims stem primarily from confused and overhyped reporting that, at the time of the TikTok video, was over six years old. While scientists have inserted genes into plants that create a faint glow, glowing trees remain theoretical. The imagery used in the video stems from artwork inspired by — but not created with — this largely theoretical technology. Below, we break down all the problems with the assertions in the video:", "Two words in, and already we are in trouble. The video asserts that \"Dutch scientists\" are responsible for locating and isolating the gene that \"makes fireflies able to glow.\" This is incorrect. The video's Dutch connection is an artist and designer named Daan Roosegaarde who did not actually locate or isolate any genes, or put said genes in a tree. Some of the images used in the TikTok video were created by Roosegaarde, but these were created by literally shining lights on trees as part of an art installation called \"Glowing Nature.\"", "In 2014, Roosegaarde received a splash of U.S. media coverage while promoting his work at that year's SXSW festival in Austin, TX. During an interview in which he discussed using biologically inspired technology to solve environmental problems, he explained that the idea of using glowing trees as street lamps was inspired in part by the work of former SUNY Stony Brook professor Alexander Krichevsky, who in 2011 left his academic post to start a company named Bioglow. The company \"developed the world's first autoluminescent (light producing) plants,\" according to an archived version of the company's website.", "https://streamable.com/o1ocd4", "Bioglow apparently no longer exists, but it did produce and sell a limited run of faintly glowing plants. Unlike the imagery shown in the TikTok, the glowing effect in these plants was significantly more modest. \"Some people ... over 40 may not be able to see the glow,\" explained a Bioglow promotional video from August 2015:", "https://streamable.com/t8380u", "In the 2014 SXSW video, Roosegaarde held one of these early Bioglow plants as an example of biomimicry that inspires his art. Several reporters apparently falsely concluded that the Bioglow plant was an invention that Roosegaarde conceived of and helped to develop. This does not appear to be accurate. While some reports suggested there were or are theoretical plans for the artist and the scientist to collaborate on \"a really large [autoluminescent plant] like a tree which glows at night instead of standard street lighting,\" there is no indication anything came of this collaboration, if it materialized at all.", "Contact information for Krichevsky was not readily apparent. We reached out to Roosegaarde's studio for more information on their work together and will update our piece if we receive new information.", "Contrary to the claim in the TikTok video, the creation of genetically modified glowing plants does not, at any point, introduce genes sourced from fireflies. Part of the confusion is that several academic or commercial enterprises are attempting, or have attempted, to create glowing plants. All of these efforts involve, in some way, the chemical luciferase, which reacts with a group of chemicals termed luciferins in a way that generates light. This chemical mechanism, generally speaking, is responsible for bioluminescence in several organisms, including fireflies.", "Several glowing plant projects attempt to create luminescence by directly injecting or applying luciferins and luciferase into or on them. One of the most notable efforts using this sort of methodology comes from the laboratory of Michael Strano, a professor of chemical engineering at MIT developing a nanoparticle delivery mechanism. These efforts have also received significant (and more recent) media coverage, but this work is not actually genetic engineering.", "As far as we are aware, the only person to attempt to use genetic engineering to create glowing plants is Krichevsky. The central difference in his approach compared to those that apply luciferin-related chemicals is that Krichevsky's plants are autoluminescent. In other words, he modified the genes of a plant in a way that allows it to create its own luciferins and luciferase.", "However, the genetic material inserted into the plant's genome does not come from fireflies. Krichevsky published his methodology for engineering his plants in a 2010 paper. The genes it uses are sourced from the bioluminescent marine bacteria Photobacterium leiognathi. In neither method would it be accurate to say genes are isolated \"from fireflies.\"", "A commonly invoked vision for people involved in glowing plant research is a future where energy consumption is reduced thanks to glowing trees that could serve as self-powered streetlamps.", "Speaking to the outlet Dezeen in 2014, Krichevsky explained, \"In the long term we see use of glowing plants in contemporary lighting design, namely in landscaping and architecture as well as in transportation, marking driveways and highways with natural light that does not require electricity.\"", "In an article introducing his SXSW interview a few months later, Dezeen introduced Roosegaarde as someone \"exploring ways of using bioluminescent bacteria found in jellyfish and mushrooms to create glow-in-the-dark trees that could replace street lights.\"", "“Our target is to perform one treatment when the plant is a seedling or a mature plant, and have it last for the lifetime of the plant,” Strano said in the 2017 MIT Press release. “Our work very seriously opens up the doorway to streetlamps that are nothing but treated trees, and to indirect lighting around homes.”", "In none of these cases, however, did these individuals literally create a glowing tree. The technology simply is not there yet. Krichevsky's plants were not trees, but instead modified tobacco plants, which are commonly used in genetic research. The imagery used in the TikTok video comes from either art installations made by Roosegaarde which only mimicked the technology, or from computer-generated concept art, not literal glowing trees. Sadly.", "Because glowing trees do not (yet) exist, because firefly genes are not used in this area of research, and because the work is falsely attributed to \"Dutch scientists,\" the claims presented in niklongo's TikTok are \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]