["The two-minute 31-second video was shared on Facebook here on May 8, 2020. It has been viewed more than 26,000 times.", "Between the 20-mark and 30-second mark, a male voice can be heard speaking in Urdu: “You’ve charged us the price of three seats for one, and we’ve paid 3,000 dollars. But it seems like you are fooling us. There is no social distancing here.”", "The caption of the Facebook post states: “Air India charged 3 times the fare, in the name of ‘social distancing’. But the passengers didn't get even a single seat empty between them. Looting the public continues unabated.”", "Air India is the flag carrier airline of India and is owned by Air India Limited, a government-owned enterprise.", "The video was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside a similar claim in English and Hindi.", "The claim is false.", "The video in fact shows a Karachi to Toronto flight run by Pakistan International Airlines (PIA), the flag carrier of Pakistan.", "A visual analysis of the footage using Watch Frame by Frame, a video verification tool, found the word “Pakistan” visible on one of the in-flight screens between the one-minute 15-second and one-minute 30-second mark of the video in the misleading post.", "Below are two screenshots of the video in the misleading post with the relevant in-flight screen circled in red:", "The word “Pakistan” in the same font style and colour is also seen in photographs taken aboard PIA flights by various travel websites here and here.", "A PIA spokesperson, Abdullah Hafeez, told AFP the video was taken aboard one of its Karachi-Toronto flights in April 2020 and shows an altercation that occurred after a passenger refused to “share seats with anyone as it does not allow social distancing”.", "\"It was explained to him that it is not an international aviation rule to ensure middle seats remain vacant,\" Hafeez told AFP via WhatsApp on May 12. \"He was assured that all amenities and touch points in the aircraft have been thoroughly sanitised and all the passengers are required to wear masks throughout the duration of the flight. The passenger was convinced and flew with us on the same flight.\"", "The video in the misleading post was also included in this April 26 news segment from Pakistani broadcaster GNN alongside the title “No Social Distancing Rules in PIA's flights to bring back stranded Pakistanis Home”.", "India’s Press Information Bureau issued a clarification here on Twitter on May 8, branding the misleading social media posts “fake”.", "#PIBFactCheck\n\t\tClaim: Video on social media showing passengers on purported @airindiain overseas flight arguing over being charged thrice the normal fare & then packed in, without #SocialDistancing\n\n\t\tFact: #Fake video. @MoCA_GoI says it is from a neighbouring country's airlines pic.twitter.com/Uww1zrHH5m", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]