["The photo was posted on Facebook here on December 16, 2019, and has since been shared more than 600 times.", "The photo shows a uniformed officer stomping on the head of a man lying on the ground, as other officers look on.", "Below is a screenshot of the misleading post:", "The caption reads: \"Delhi Police, because these students are not nationalists agitating to remove a Muslim professor. These are Jamia students.Via Sarah Joseph Islam\".", "The “remove a Muslim professor” reference in the caption refers to the November 2019 protests at Banaras Hindu University in Varanasi, India, against the appointment of a Muslim professor to teach Sanskrit, an ancient language and the primary liturgical language of Hinduism. The professor later resigned.", "The photo was shared a day after police clashed with students during an anti-Citizenship Amendment Bill protest at New Delhi’s Jamia Millia Islamia university on December 15, 2019, the Associated Press reported here on December 16.", "The bill, passed by India's parliament earlier in December, will grant citizenship to people from neighbouring countries, namely Afghanistan, Bangladesh and Pakistan, as long as they are not Muslim.", "The controversial new citizenship law has since sparked rallies across the country as critics consider it a measure to marginalise Muslims in India, AFP reported here on December 19.", "The same photo has also been shared here and here on Facebook and here and here on Twitter, with a similar claim.", "The claim is false; the photo was taken during a separate protest in Lucknow, the capital of the northern Indian state of Uttar Pradesh, in March 2011.", "A reverse image search on Google found the photo published in this December 2015 report by Indian news site Catch News.", "The report says the photo was taken at a 2011 protest in Lucknow, during which student leader Anand Bhadauria was confronted by police officers.", "It states in part: “Anand Bhadauria being assaulted by then-Lucknow DIG, DK Thakur in 2011.", "\"The then-Lucknow DIG, DK Thakur, pushed Anand to the ground and tried to crush his face under his shoe.\"", "Below is a screenshot comparison of the photo in the misleading post (L) and the one published by Catch News (R):", "Indian newspaper the Indian Express also published this report on March 17, 2011, which states in part:", "\"The incident in question took place on March 9, 2011 following which a local newspaper published a story accompanied with photographs stating that Anand Singh Bhadauriya, president of Lohia Vahini -- a frontal organisation organisation of the Samajwadi Party -- was dragged by his hair by the police during a protest march and later the then Lucknow DIG D K Thakur pinned him down on the road with his boots.\"", "AFP analysed the metadata of the image using online tool Metapicz and found the photograph taken on March 9, 2011.", "Below is a screenshot of the metadata of the photo, with its creation date highlighted in red by AFP:", "Further examination of the photo also revealed a street sign in the top left-hand corner of the image, which is circled in red in the screenshot below:", "The Hindi-language street sign translates to English as: “Mayfair and Hazratganj Crossing”.", "Both the Mayfair building and Hazratganj Crossing are located in Lucknow.", "The design of the building in the photo in the misleading post resembles that of a book store in Hazratganj, Lucknow.", "Below is a screenshot comparison of the photo in the misleading post (L) and that of the Lucknow book store (R) with corresponding features highlighted in red:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]