["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Dec. 12 2020, an event protesting Joe Biden's victory in the 2020 U.S. presidential election drew hundreds of so-called \"Proud Boys\" — members of a pro-Trump organization classified by the Southern Poverty Law Center as a hate group — to Washington, D.C. During their visit, they burned Black Lives Matter banners stolen from historically Black churches and engaged in brawls that left several people stabbed. Photos of the weekend revealed myriad symbols, slogans, and logos used by the group's members, who dress in black and yellow garb.", "One photo that drew a great deal of online attention highlighted a man wearing a black and yellow T-shirt with an illustration of an eagle and the initialism \"6MWE.\" As has been alleged on Twitter, this purportedly stands for \"6 million wasn't enough\" — a suggestion that not enough Jews were murdered during the Holocaust.", "This interpretation, and its association with the Proud Boys, is accurate. Myriad online stores have sold, and continue to sell, these shirts. These pages explicitly describe the shirts as \"6 million wasn't enough\" and often include the word \"proud\" in their title description as well. The eagle symbol below this acronym also supports a fascist and anti-Semitic interpretation — it comes from the coat of arms used by the short-lived \"Italian Social Republic.\" A largely unrecognized political entity, this \"state\" was led by fascist leader Benito Mussolini and existed as a Nazi puppet state in the northern half of Italy from 1943-1945.", "As such, the claim that 6MWE stands for \"6 million wasn't enough\" is \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]