["New Jersey Democrat Cory Booker was one of the U.S. senators who spent nearly 15 hours in an overnight filibuster designed to pressure Congress to vote on two gun amendments proposed in response to the mass shooting at the Pulse nightclub in Orlando, Fla.", "One would block anyone on the government's terrorist watch list from buying a firearm. The other would expand background checks to all gun show purchases and internet sales. Both were rejected in a largely party-line vote June 20, 2016.", "Ahead of the vote, MSNBC's Chris Matthews asked Booker in a June 16 interview how the filibuster would \"lead to an actual bill, something the president can sign?\"", "\"Well, what I have been finding recently is how many Americans did not realize that you can be under investigation by the FBI, that you could have been put on the no-fly list because you were considered to be too dangerous to enter plane, but you could still go out and buy a trunk load full of weapons,\" he said.", "\"And so here we have this real war that we’re on — a war against terrorism. We’re basically telling our enemy, exploit this loophole. In fact, our enemy, al-Qaida operatives, have said, 'Hey, we want you to use this loophole to attack and kill Americans.' \"", "We've covered the fact that people on terrorist watch lists have been able to buy firearms. For this fact-check, we decided to look into whether al-Qaida propaganda has actually been urging people to exploit that situation.", "When we contacted Booker's office, a spokesman responded immediately with several links, all pointing to a 2011 video made by Adam Gadahn, an American serving as a spokesman for al-Qaida.", "\"Muslims in the west have to remember they are perfectly placed to play an important and decisive part in the jihad against the Zionists and crusaders, and to do major damage to the enemies of Islam, waging war on their religion, sacred places, and things and brethren. This is a golden opportunity\" to rush to do battle with everything at your disposal, he says.", "\"And in the West, you've got a lot at your disposal. Let’s take America as an example,\" Gadahn said. \"America is absolutely awash with easily obtainable firearms. You can go down to a gun show at the local convention center and come away with a fully automatic assault rifle, without a background check, and most likely without having to show an identification card. So what are you waiting for?\"", "(Gadahn's information was not entirely correct. As CNN noted, only specially licensed dealers can sell fully automatic weapons and they require a background check.)", "Gadahn, the first American charged with treason since World War II and an occupant of the FBI's list of most-wanted terrorists, was killed by the United States in January 2015 counterterrorism operation.", "Max Abrahms, an assistant professor of political science at Northeastern University, said he couldn't recall \"any other videos as explicit about the ease of using guns in the United States on Islamists' behalf. That said, I would be surprised if there isn't other propaganda seeking to exploit the permissiveness of gun access in the U.S.\"", "Our ruling", "Booker said, \"Al-Qaida operatives, have said, 'Hey, we want you to use this loophole (for purchasing guns despite being on a watch list) to attack and kill Americans.\"", "We've seen a 2011 video from one operative, an Al-Qaida spokesman born and raised in America, who did indeed urge Muslims to use the gun show loophole to purchase weapons and attack Americans. While an expert said its reasonable that other pieces of propaganda exist, we don't know of any.", "With that caveat, we rate the claim as Mostly True.", "https://www.sharethefacts.co/share/475e31b4-c182-4fd0-9834-ea5d0efad56f", "MSNBC, \"Hardball with Chris Matthews, Transcript, 6/16/2016,\" accessed June 20, 2016", "PolitiFact, \"Schumer: 244 people on terror watch list tried to buy guns in 2015, 91% got them,\" June 15, 2016", "Email, Jeff Giertz, spokesman, Sen. Cory Booker, D-N.J., June 20, 2016", "YouTube, \"Jihad Joe: Adam Gadahn encourages American jihadists to buy guns,\" June 3, 2011", "CNN, \"Al Qaeda video resurfaces claiming how easy it is to buy guns in the U.S.,\" April 12, 2013, \"Adam Gadahn Fast Facts,\" updated Aug. 16, 2015, and \"Senate rejects series of gun measures,\" June 20, 2016", "Email, Max Abrams, assistant professor of political science, Northeastern University, June 22, 2016", "Los Angeles Times, \"Adam Gadahn: Al Qaeda terrorist, California native and grandson of a Jew,\" April 23, 2015", "BuzzFeed, \"Even Al Qaeda Thought America's Gun Background Check System Was Weak,\" April 10, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]