["Gretchen Whitmer isn’t related to George Soros.", "In another dimension, George Soros is quite the matchmaker. His nephew is married to Chelsea Clinton! His son wed the sister of U.S. Rep. Adam Schiff! But in this dimension, those are just false, unfounded claims that we’ve fact-checked. These couples don’t exist. And a recent Facebook post alleging a new political connection by marriage is also wrong.", "\"How many of you are aware that the female governor of Michigan is the niece of George Soros?\" the June 1 post says.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to Michigan Gov. Gretchen Whitmer’s office and a spokesperson told us Whitmer isn’t related to Soros.", "\"This is completely false,\" said Chelsea Lewis, the governor’s deputy press secretary.", "Soros’ brother, Paul Soros, died in 2013. According to his obituary in the New York Times, he was survived by two sons: Peter and Jeffrey. He had two other children but they both died at 18 months old. A third son, Steven, was in a playground accident and a daughter, Linda, was hit by a vehicle backing out of the family’s garage.", "So George Soros has no surviving nieces. And his nephews didn’t marry Whitmer (whose husband is Marc Mallory, a dentist in Lansing, Mich.).", "Peter Soros married Flora Fraser in 1997. Jeffrey Soros was married to Catharine Cosover in 1995.", "If this disinformation connecting Whitmer to Soros seems arbitrary, keep in mind two things: A lot of anger was directed at Whitmer as she locked down Michigan to curb COVID-19, and baseless claims tying George Soros to the coronavirus have proliferated online. Combined, we have this Facebook post. And we’re rating it Pants on Fire.", "Facebook post, June 1, 2020", "The New York Times, Paul Soros, shipping innovator, dies at 87, June 15, 2013", "The New York Times, Peter Soros and Flora Fraser, Feb. 2, 1997", "The New York Times, Weddings; Jeffrey P. Soros, Catharine A. Crossover, Nov. 5, 1995", "National Governors Association, Marc Mallory, visited June 10, 2020", "Email interview with Chelsea Lewis, deputy press secretary, Gov. Gretchen Whitmer, June 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]