["“Wow! @SrBachchan Amithabh has openly lent his voice to promote Modi. He has promoted Gujarat ever since Modi was its CM, but this is the first time, I think, he’s promoted Modi himself,” is a claim accompanying a video viral on social media that features photographs of PM Modi appearing successively to the tune of a poem recited by Bollywood actor Amitabh Bachchan.", "BJP MP and the party’s treasurer for Jharkhand, Mahesh Poddar, was among those who shared the video (archive).", "Wow! @SrBachchan Amithabh has openly lent his voice to promote Modi. He has promoted Gujarat ever since Modi was its CM, but this is the first time, I think, he’s promoted Modi himself.👌🏻👏🏻 @BJP4India @BJP4Jharkhand @AnupamPKher @KirronKherBJP @dreamgirlhema @akshaykumar pic.twitter.com/C7EnHuIZst", "— Chowkidar Mahesh Poddar (@maheshpoddarjhr) March 14, 2019", "Several other social media users and pages have shared the video claiming that Bachchan lent his voice in support of PM Modi. The Hindi poem recited by Bachchan starts with the words – “मुट्ठी में कुछ सपने लेकर , भरकर जेबों में आशएं ..दिल में है अरमान यही, कुछ कर जाएँ, कुछ कर जाएँ…”", "Wow! Amithabh has openly lent his voice to promote Modi. He has promoted Gujarat ever since Modi was its CM, but this is the first time, I think, he’s promoted Modi himself. 👌🏻👏🏻 🙏🕉🇮🇳", "Posted by Rajni Patel on Thursday, 21 March 2019", "We found that the video was also shared with Kannada and Nepali captions. It seems to have been circulating on WhatsApp as well.", "Alt News looked by a few words of the poem on Google and found that it was recited by the Bollywood actor in 2018 during the opening episode of Kaun Banega Crorepati season 10. Bachchan can be heard reciting the same poem in the video below, which was uploaded by SonyLIV on September 3, 2018.", "The actor had also shared a photograph of himself recording the poem two years ago.", ".. the best place to be at midnight .. after finishing shoot for the day at KBC – a recording studio in front of a mike .. “मुट्ठी में कुछ सपने लेकर , भरकर जेबों में आशएं .. दिल में है अरमान यही , कुछ कर जाएँ , कुछ कर जाएँ …”", "A post shared by  Amitabh Bachchan (@amitabhbachchan) on Aug 22, 2018 at 12:02pm PDT", "Furthermore, we were unable to locate any reports in the media claiming that Bachchan recited the said poetry in support of the Prime Minister. The assertions on social media are, thus, baseless.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]