["About this rating", "During a June 2, 2020 protest against police brutality and racial injustice in Asheville, North Carolina, police in riot gear destroyed a medic tent operated by an “all-volunteer team of doctors, certified nurses, EMTs, military combat medics, and citizens with CPR and first-aid certifications.” According to the Asheville Citizen-Times, the team “had a verbal agreement with APD to be present, even after curfew.”", "Nevertheless, a scene captured by witnesses minutes after the curfew began showed police forcibly removing volunteers, crushing and emptying water bottles, and destroying the tent:", "One volunteer said, “We were not protesting. We were not agitating. We had claimed that space. We had set up a triage area in case of any injuries. We had eyewash, sutures, EMT, doctors, EMS workers. They came in full riot gear, hit us with shields, threw several people to the ground. We were grabbed, thrown, shouted at, screamed at, treated as criminals. No one resisted.” Videos of the tent’s destruction went viral, and public outrage followed.", "The Asheville Police Department's initial statement from Chief David Zack on June 3, 2020, confirmed that the incident took place, but defended the department’s actions, largely placing blame for the incident on the medical volunteers:", "As the Chief of Police I understand the concern has been raised over the destruction of water, food, and medical supplies. The Asheville Police Department (APD) would always prefer confiscation over destruction. We apologize for not being able to confiscate these supplies last night.", "Over the past three days APD has tried to eliminate objects that can be thrown at protesters and law enforcement. Because water bottles, in particular, have been continuously used over the last three nights, officers destroyed them. Officers also searched for potentially dangerous objects, such as explosives.", "The supply station was not permitted by the City of Asheville and was located on private property, without the permission of the property owner. The actions involving the supply station occurred following multiple warnings, and after the 8 p.m. city-wide curfew.", "But this statement from the chief only exacerbated tensions in Asheville.", "Sean Miller, one of the organizers of the medic tent, told a local CBS affiliate that the statement was \"shocking.\"", "Miller continued, saying, “We had no explosives. There was nothing that could have been perceived as an explosive.”", "Faced with continued backlash, Zack, who has been on the job just four months, released a second statement on June 4, 2020, this time apologizing for his department's role in the incident:", "I am David Zack, chief of the Asheville police department, speaking to you today to address a matter that has deeply affected our community, embarrassed our city and our department. Of course, I am referring to the destruction of a medic tent during protests on Tuesday, June 2nd. For these actions, I am truly sorry.", "Some may find this message to be too little too late, and that's fair. Yesterday's statement was inadequate in addressing your concerns. And I apologize for that as well. …  I know you've been promised change in the past, but you've yet to hear that promise from me. Police reform needs to be more than a conversation. There needs to be action. And I assure you, action is forthcoming.", "Because the incident was captured in multiple videos and has been confirmed by the Asheville Police Department itself, the claim that officers forcibly destroyed a medic tent during a protest against police brutality is \"True.\"", "Lunsford, Mackensy, and Casey Blake.   \"Asheville Police Chief Zack Apologizes for Medic Tent Destruction, 'Trauma' to Volunteers.”\r\n    Citizen Times.   4 June 2020.", "Jason Miller (YouTube).   “George Floyd Protest Police Brutality - 163 - Asheville.\"\r\n    3 June 2020.", "Captain ivy (YouTube).   “Police Destroyed a Medical Tent & Attacked the Medics inside in Asheville, NC.\"\r\n    4 June 2020.", "City of Asheville.   “Asheville Police Chief David Zack Issues Statement Regarding Destruction of Water Bottles.\"\r\n    3 June 2020.", "Martin, Jennifer.   \"Asheville PD Chief Zack Issues Statement After Water, Food, Medical Supplies Destroyed by Officers During Protest.”\r\n    WSPA.com.   4 June 2020.", "City of Asheville YouTube).   “Chief Zack Responds to Destruction of Medic Tent.\"\r\n    4 June 2020.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]