["The article, shared on Facebook here and here by users who seem to believe its claim, features an image that appears to show a massive fish with “a mouth as wide as a dumpster.”", "The article claims the catfish was hauled in with the help of the US Coast Guard and a crane, and had apparently eaten the town of Alton’s tallest recorded person.", "But RiverBender.com, the local news site that published the piece, said it was a joke dating to 2016 that resurfaces every year, an example of the long lifespan of an internet hoax.", "Although allegedly a Mekong giant catfish, which can grow to be about 700 pounds, the fish in the photo is actually a flathead catfish, which only reaches about 120 pounds, said Dr Jay Stauffer, an ichthyologist at Pennsylvania State University.", "Mekong giant catfish are endangered and are native to southeast Asia.", "The story makes the rounds every year, said Mike Hall, who has worked at RiverBender.com for 13 years. “Every April Fools’ Day, we do a satire story. That particular one kind of blew up.”", "Although some readers recognized that the article’s claim was fake, comments on Facebook indicated that other users believed it was real.", "Illinois records indicate the largest reported catfish in the state was a 124-pound Blue Catfish caught in the Mississippi River in 2005.​", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]