["The video has been circulated on social media in numerous countries and languages. In Nigeria, it was shared in this Facebook post and viewed more than 8,000 times since its publication on June 17, 2020.", "It has also spread to other countries including the United States and appeared on YouTube, Instagram and Twitter with a similar claim.", "The video, which lasts two minutes and 17 seconds, shows at least four men in black shirts forcibly gaining entrance onto the site of what appears to be a hospital under construction.", "The post claims they are angry over supposed lies about the hospital’s occupancy.", "“BREAKING NEWS: BRAZIL Members of Parliament broke into a hospital that claimed to have 5,000 infected & 200 deaths from COVID19 & caught the staff red handed and not one person is sick of the disease (sic),” the post reads.", "Conspiracy theories about the existence of the novel coronavirus have spread across the world since the emergence of the virus in the Chinese city of Wuhan late last year. In Africa, and particularly its most populous nation Nigeria, these combine with public distrust of government to hamper the continent’s curtailment efforts to curtail the pandemic.", "A yet-to-open hospital", "The viral video actually shows is a field hospital still under construction that has yet to admit its first patient.", "AFP Fact Check ran a reverse image search on the footage using the InVID-WeVerify tool and found a much longer version (54 minutes) published on May 28, 2020, on the  YouTube page of Filippe Poubel, an MP representing the district of Rio de Janeiro. The video’s Portuguese caption partly translates to English as: “MP Poubel in field hospital inspection”.", "Poubel also shared the footage of his inspection of the hospital on his official Facebook page.", "At 20’51” into the video, the name “Hospital De Campanha São Gonçalo” is seen written on the entrance of the construction site. Online searches led AFP Fact Check to several articles on Portuguese online media R7 about a delay in opening the hospital and Poubel’s site inspection.", "The São Gonçalo Campaign Hospital is among seven field hospitals that the government of Rio de Janeiro set out to build to cope with spiralling coronavirus cases in the region.", "According to an article published on June 18, 2020, by Brazillian news agency Agência Brasil, the 200-bed facility is meant to receive COVID-19 patients transferred after a referral from the public health network.", "The politician began his video by saying (in Portuguese): \"I'm arriving now at the São Gonçalo hospital that was supposed to be open today, and wasn't. We'll carry out an inspection.\"", "At 0’53”, he says: \"That's why they didn't want me to come inside -- this was supposed to open today. Look at this, there is nothing ready”.", "More than nine million COVID-19 patients have been recorded globally with nearly 500,000 deaths, according to an AFP tally. With more than a million reported cases as of June 24, 2020, Brazil is the second most affected country in the world after the United States.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]