["About this rating", "In June 2020, a rumor started to circulate on social media that the animated children show \"Paw Patrol\" had been canceled due to its portrayal of puppy police officers:", "\"Paw Patrol\" has not been canceled.", "This rumor started as social media users debated the impact of how police officers were portrayed on television and in movies in light of widespread protests against police brutality and racial injustice across the country. That led to long-running shows such as \"Cops\" and \"Live PD\" getting canceled, and spurred a number of people who worked on TV shows about law enforcement to donate to causes related to the Black Lives Matter movement.", "As protests nationwide gained momentum, some social media users posted tongue-in-cheek messages calling for the cancellation of the animated children's show. This led to a think piece published in The New York Times that stated \"it was only a matter of time before the protests came for \"Paw Patrol.\"", "The excerpt from the Times story:", "“Paw Patrol” is a children’s cartoon about a squad of canine helpers. It is basically a pretense for placing household pets in a variety of cool trucks. The team includes Marshall, a firefighting Dalmatian; Rubble, a bulldog construction worker; and Chase, a German shepherd who is also a cop. In the world of “Paw Patrol,” Chase is drawn to be a very good boy who barks stuff like “Chase is on the case!” and “All in a police pup’s day!” as he rescues kittens in his tricked-out S.U.V.", "But last week, when the show’s official Twitter account put out a bland call for “Black voices to be heard,” commenters came after Chase. “Euthanize the police dog,” they said. “Defund the paw patrol.” “All dogs go to heaven, except the class traitors in the Paw Patrol.”", "It’s a joke, but it’s also not. As the protests against racist police violence enter their third week, the charges are mounting against fictional cops, too. Even big-hearted cartoon police dogs — or maybe especially big-hearted cartoon police dogs — are on notice. The effort to publicize police brutality also means banishing the good-cop archetype, which reigns on both television and in viral videos of the protests themselves. “Paw Patrol” seems harmless enough, and that’s the point: The movement rests on understanding that cops do plenty of harm.", "Shortly after the Times story was published, conservative figures such as U.S. President Donald Trump's son Eric and Dana Loesch, sometime spokeswoman for the National Rifle Association, said that the \"rage mob\" was making an effort to cancel the show.", "As far as we can tell, earnest calls to have \"Paw Patrol\" canceled due to its portrayal of police officers have been few and far between. While the vast majority of the posts calling for the cancellation of \"Paw Patrol\" were made in jest, they were prompted by a genuine conversation concerning the impact of how police officers are portrayed in television and movies.", "An old article from the satirical news publication The Onion may have contributed to some confusion over whether or not \"Paw Patrol\" got canceled. In 2018, The Onion published an article claiming that a \"Paw Patrol\" writer was defending an episode in which a German shepherd shot a black Lab 18 times in the back.", "Meanwhile, Nickelodeon, the network that airs \"Paw Patrol,\" has also released messages in support of the protests. It should also be noted that on June 7, 2020, the show went silent on social media in solidarity, muting its content:", "Sperling, Nicole.   \"‘Cops,’ Long-Running Reality Show That Glorified Police, Is Canceled.\"\r\n   The New York Times.   9 June 2020.", "Hess, Amanda. \"The Protests Come for ‘Paw Patrol.'\"\r\n    The Onion.   10 June 2020.", "The Onion.   \"‘Paw Patrol’ Writers Defend Episode Where German Shepherd Cop Shoots Unarmed Black Lab 17 Times in Back.\"\r\n    18 August 2018.", "Frosti, Brian.   \"PAW Patrol Debated Amidst Black Lives Matter Protests.\"\r\n    Screen Rant.   11 June 2020.", "Andrew, Scottie.  \"A&E Cancels Live PD Police Series as Protests Against Police Brutality Continue.\"\r\n   CNN.  11 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]