["In a report on alleged corruption during South Africa’s Covid-19 lockdown, the New York Times said the country had the fifth-highest Covid-19 infection rate in the world.", "An infection rate measures the number of Covid-19 cases relative to the population. South Africa had the world’s 17th- or 20th-highest infection rate, depending on which data was used, when the report was published.", "The country does have the fifth-highest total number of confirmed Covid-19 cases, which does not take population into account.", "South Africa’s government has found itself under a harsh spotlight from local and international critics following allegations of corruption during its Covid-19 lockdown.", "In an article on the scandal, the New York Times quantified the scale of the pandemic in the country.", "“Despite its moves to control the pandemic, South Africa is now overwhelmed by more than 592,144 coronavirus cases, the fifth-highest infection rate in the world and the highest official caseload on the African continent,” the paper claimed on 19 August 2020.", "Did the Times get its numbers right? Africa Check took a look at the data.", "The scale of a disease – like Covid-19 – can be measured in a number of ways.", "The first is the total number of cases recorded in a country. On this measure, the New York Times was correct that South Africa had “more than 592,144 coronavirus cases”. This is reflected in the country’s official statistics. It had the fifth highest number of cases in the world at the time the article was published.", "It also had the highest number of reported cases in Africa, with more than half of Africa’s million or so cases.", "According to a team of global health scientists and infection preventionists at the Meedan Digital Health Lab, the numbers of cases in a country can provide an “important snapshot to understand the impact of the virus, but it is not a very good measure of a population’s risk of contracting the virus”. The public health information hub works to explain complex health and medical science.", "But the New York Times was wrong to claim that South Africa had the “fifth-highest infection rate in the world”.", "Dr Evanson Sambala, a research fellow at the Wits University School of Public Health, told Africa Check that an infection rate is the “number of new cases per population at risk in a given time period”. He said the measure allows comparisons between countries by taking population into account.", "For example, when two countries have the same number of infections, the country with the smaller population will have a higher infection rate.", "The Meedan Digital Health Lab says this measure helps us understand “how likely a person in a population is to get infected”.", "The New York Times linked its claim about South Africa’s infection rate to its global Covid-19 dashboard. This allows users to view a list of countries ordered by both the total number of cases and the number of cases per 100,000 people. This second number is the country’s infection rate.", "South Africa’s infection rate was 17th in the world on the day that the article was published. It had 1,032 cases of Covid-19 for each 100,000 people. Panama, a country in Central America, was ranked fifth with 2,005 cases per 100,000 people.", "The World Health Organization’s dashboard includes a number of territories that the New York Times does not. It ranked South Africa’s infection rate per million people at 20th in the world on 19 August.", "Sambala said South Africa’s infection rate was likely higher than reported because only cases confirmed by a test are recorded. This was also true of other countries, he said.", "The team from the Meedan Digital Health Lab told Africa Check that a country’s true level of infection would likely remain unclear until there was routine testing that included people without symptoms.", "The New York Times claimed that South Africa had the fifth-highest Covid-19 infection rate in the world. This is incorrect.", "South Africa was ranked fifth for its total number of cases. But it was ranked far lower for its infection rate.", "At the time the article was published, South Africa was ranked 17th according to the New York Times’ Covid-19 dashboard. The World Health Organization, which includes more territories, ranked it 20th.", "Africa Check contacted the New York Times about the error. It has since been corrected.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]