["About this rating", "In June 2015, a video purporting to show \"Muslim men\" auctioning off women on the streets of London was posted on Facebook by the far-right, anti-immigration, anti-multiculturalism group BritainFirst:", "This Facebook group was not the first entity to incorrectly label this footage. The video displayed above was first posted to YouTube in January 2015, along with an inaccurate description of what the footage depicted:", "What you are about to view is what can only be described as an Islamic auction in London, during this video it can be clearly heard that the proceeds of this auction will be going to Islamic State.", "Additional footage of the same event was posted to LiveLeak in November 2015. Again, the footage was accompanied by the false claim that it showed Muslim men auctioning off women on the streets of London:", "These videos do show an incident that occurred in London, but the claims' acquaintance with the truth stops there.  These clips show not an actual \"human auction\", but a demonstration against ISIS that took place in October 2014:", "Since its inception The Islamic State has been capturing all the consider infidels and selling them in make shift sex markets all across Syria and Iraq. Their brutality is so overwhelmingly shocking that most testimonies only result in broken down tears.", "I and political activists have set one very such makeshift camp, the horrors of ISIS and their crimes against humanity was put on public display all across London. Members of the public were shocked most were speechless as we live in a civilized society. Yet the barbarity of these camps remain, please share and like to all so that our cause can be spread across the world.", "The United Kingdom has strict and well-established laws in place to ensure that women and men are treated equally in public spaces and by public bodies.  While women's rights there may require work and vigilance, blatantly selling bound women in the street anywhere in the UK would not only not be tolerated but met with swift reprisal, no matter what religion or nationality the sellers might be.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]