["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Kirsten Gillibrand has been under fire for reversing her position on a bill to penalize those who boycott Israel. (John Hickey/Buffalo News)", "Sen. Kirsten Gillibrand no longer supports a bill she originally co-sponsored that would punish people for boycotting Israel.", "\"I am going to urge the authors of the bill to change the bill, and I will not support it in its current form,\" Gillibrand said at a town hall meeting in Queens.", "The bill targets individuals and companies who participate in the Boycott, Divest, and Sanctions movement, a Palestinian-led effort to remove international support for Israel by asking global leaders and businesses to cut ties with the country. Offenders could face heavy fines and even jail time under the bill.", "The American Israel Public Affairs Committee sent an email to its supporters about Gillibrand’s flip a few days after the event.", "\"New York’s junior Senator, Kirsten Gillibrand, has withdrawn her co-sponsorship of the Israel Anti-Boycott Act (S.720), sending a powerful message to her constituents that she no longer supports the fight to combat the international delegitimization of Israel,\" the email said.", "AIPAC is one of the most influential lobbying groups for pro-Israel interests in the U.S. Each major party candidate for president spoke at its conference last year.", "Gillibrand has taken a lot of flack since the email blast, including from Jewish leaders and online publications. A letter to the editor published in the New York Daily News claims Gillibrand now supports the BDS movement. Pro-Palestinian groups have even thanked Gillibrand for opposing the bill.", "Does her new stance on the bill mean she supports the Boycott, Divest, and Sanctions movement?", "Gillibrand in context", "Gillibrand said she changed her position after meeting with the American Civil Liberties Union, which opposes the bill.", "\"We went through their reading of the bill and why they believe it says — it chills free speech, which means the bill is ambiguous,\" Gillibrand said at the town hall.", "The bill would fine individuals or companies anywhere from $250,000 to $1 million for engaging in any activity that supports the BDS movement, according to the ACLU. Violators could also face up to 20 years in prison.", "Gillibrand changed her position because, in her view, individuals should not face that kind of punishment for expressing their opinion.", "\"I’m against BDS but I think anybody who’s in favor should feel very comfortable speaking on any stage, anywhere in America, saying exactly why,\" Gillibrand said. \"That is what free speech is about, and I fully support it.\"", "Gillibrand said she does support penalizing companies that participate in BDS.", "Gillibrand responded to her critics more than a week later in an opinion piece on Forward, a Jewish news website.", "\"Some have suggested that I suddenly began supporting the BDS movement when I took my name off the bill. This accusation has popped up on the Internet in recent days – both from Israel’s supporters and from Israel’s detractors. This is just plain false,\" Gillibrand wrote. \"I cannot state this more clearly: I vehemently oppose the BDS movement.\"", "Our ruling", "AIPAC told its supporters Gillibrand \"no longer supports the fight to combat the international delegitimization of Israel.\"", "AIPAC did not respond to a request to clarify its statement.", "Gillibrand has made it clear, both during the town hall and after, that she still opposes the BDS movement. She does not support the Israel Anti-Boycott Act in its current form because she believes it violates individual liberties.", "The claim misleads readers who may now believe Gillibrand supports the BDS movement. We rate it False.", "Transcript of AIPAC’s email to supporters, Aug. 3, 2017", "Senator Kirsten Gillibrand: Where I Stand On Israel, BDS And The First Amendment, Aug. 10, 2017, Forward", "Email conversation with Glen Caplin, spokesperson for Gillibrand", "Text of S.720 - Israel Anti-Boycott Act", "ACLU Letter to the Senate Opposing the Israel Anti-Boycott Act, July 17, 2017", "\"Gillibrand, at rare town hall, vows to reconsider Israel-boycott bill\" July 31, 2017, Crain’s", "U.S. Campaign for Palestinian Rights statement supporting Gillibrand, Aug. 2, 2017", "\"Prominent US Jewish Leader Slams New York Senator Gillibrand’s Backtrack on Israel Boycott Bill\", Aug. 2, 2017, The Algemeiner", "\"Booker, Gillibrand Back Left, Betray Jews\", Aug. 4, 2017, FrontPage Mag", "\"Readers sound off on downtown voting, BDS and Confederate statues\", Aug. 18, 2017, The New York Daily News", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]