["About this rating", "In September 2017, a video appeared in the wake of Hurricane Irma's passage through Florida, purportedly showing three sharks swimming through a flooded area of the city:", "Although internet commenters pointed out several fishy aspects of this video (for example, the fins don't ever seem to change directions), the biggest giveaway came from the video's description:", "Although this video was originally posted by YouTube user \"ViralVideoLab\" along with heavy hints that it was less than authentic, many viewers encountered this footage in articles from outlets like the Daily Star and The Sun, where it was presented with the bare minimum of skepticism. Entertainer Bam Margera also posted this video on social media as if it were real, and a blog post promoted by musician Akon went as far as warning tourists to stay away from Miami because of its new shark problem:", "In the wake of Irma, many parts of Miami were so badly flooded that some of the ocean’s residents are now swimming up and down the city’s streets. Among them is none other than the infamous shark. If you thought you only had to worry about sharks while chillin’ at the beach, you might want to think again.", "Most of us would be running in the opposite direction if we saw a bunch of sharks swimming around town. However, this brave soul decided to head outside and record the moment. Seriously though, it looks like something straight out of a scary movie — and we all know that scary movies usually don’t end well.", "If you’re in Miami, be careful. If you’re not — now certainly isn’t the best time to plan a trip.", "Fake videos and images purportedly showing sharks in odd places tend to gain traction in the aftermath of a hurricane. However, it's unlikely that you'll spot one of these large marine creatures swimming down the highway (a prank photograph that has reappeared for every hurricane season since 2011) through your neighborhood, or leaping out from a large puddle after a major storm:", "As Hurricane Irma hurtles toward Florida and the east coast, you might be afraid of potential shark attacks during the storm — but experts say not to be worried.", "[...]", "Most sharks are not going to be focused on attacking you during a hurricane, because they want to get themselves to safety, according to Chris Lowe, director of the Shark Lab at California State University, Long Beach.", "Sharks — and other fish — are sensitive to barometric pressure, which drops when a storm comes in, Lowe says. Research has shown sharks can feel the change in pressure and swim toward deeper water where they’ll be safer. “Most animals will get nature’s alerts and leave,” Lowe says.", "Even animals that aren’t as sensitive to the changes in barometric pressure will likely leave for deeper water when they see other animals do so. This is similar to how humans behave before a hurricane — if people see their neighbors evacuating before the storm hits, they may follow suit.", "\"ViralVideoLab\" wasn't the first prankster to use a fake shark fin to fool internet users. A very similar video was created in October 2015, after Hurricane Joaquin brought heavy rains to Ocean City, Maryland.", "Abrams, Abigail.   \"No, Sharks Will Not Attack You During a Hurricane.\"\r\n    Time.   7 September 2017.", "Abrams, Abigail.   \"No, Sharks Will Not Attack You During a Hurricane.\"\r\n    Time.   7 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]