["About this rating", "Televangelist Pat Robertson has pooh-poohed climate change on many occasions (dismissing it as \"idiocy\" in one memorable instance), so when it was reported that he said God is protecting America from global warming because of President Trump, some people were ready to believe it.", "Social media users shared a 26 December 2018 article published on the website Business Standard News that gave the following account of remarks Robertson made on his television show, The 700 Club:", "Televangelist Pat Robertson has released some predictions for the New Year. And he claims that the United States will be protected from the ravages of climate change because of President Donald Trump.", "\"A few years ago, God came to me in a dream and said that if America elected Trump, he would protect us from the effects of global warming,\" said Robertson on 'The 700 Club.' \"America had been sliding away from God, what with the ‘60s and Obama, but now we are back in God’s good graces, nothing bad is going to befall us.\"", "Now, it is a fact that in addition to being a climate change denier Robertson is an enthusiastic Trump supporter (so enthusiastic that he said those who oppose the president are \"revolting against God's plan for America\"), but the statement attributed to him above was pure fiction. Its source, Business Standard News, is not a real news outlet but rather a \"satirical\" website that publishes junk news articles spoofing current events.", "A disclaimer on the site states that \"The Business Standard News is a satirical site designed to parody the 24-hour news cycle. The stories are outlandish, but reality is so strange nowadays they could be true.\"", "Previous Business Standard News articles we've had occasion to debunk claimed that female conservative pundit Ann Coulter was arrested for using a women's bathroom, and that televangelist Paula White was hawking prayer flags blessed by President Trump himself.", "Abrams, Lindsay.   \"Pat Robertson: Believing in Climate Change Is 'Idiocy' Because It's Cold Outside.\"\r\n    Salon.   19 February 2015.", "Pettus, Rondell.   \"Robertson: Global Warming Won’t Affect America Because God Is Protecting Trump.\"\r\n    The Business Standard News.   26 December 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]