["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Gov. Jerry Brown answers a question at the state Capitol in Sacramento in January 2016. AP Photo/Rich Pedroncelli", "As Republicans in Washington D.C. move ahead with plans to dismantle Obamacare, California Gov. Jerry Brown is pushing back with claims the federal health care law has boosted health coverage in the state.", "Brown said California’s uninsured rate is at \"a historic low.\"", "\"The uninsured rate in California has gone down from 17.2 percent in 2013 to a historic low of 7.4 percent in 2016.\"", "Brown made this and other statements about the law’s effect on California in a letter to GOP House Majority Leader Kevin McCarthy of Bakersfield on Jan. 13, 2017. McCarthy had asked Brown for recommendations on changing the law, formally known as the Affordable Care Act.", "We wanted to know whether Brown’s claim about \"a historic low\" was accurate. We set out on a fact check.", "Our research", "Gov. Brown’s office cited data from the U.S. Census Bureau and the Centers for Disease Control and Prevention that confirm the uninsured rates cited for 2013 and 2016.", "The 7.4 percent uninsured rate was reported in a survey covering January through June of 2016 by the CDC’s National Center for Health Statistics. It represents the rate for all ages in California. The same survey cites an 8.4 percent uninsured rate for Californians under 65 years of age.", "The ‘all ages’ uninsured rate is slightly lower because it includes the 65 and older population, the vast majority of which has health insurance through Medicare.", "The governor’s office also cited several sources as evidence that California’s uninsured rate has reached \"a historic low.\"", "Those include a health care almanac maintained by the California Health Care Foundation. It shows the state’s uninsured rate from 1987 to 2015 for Californians under 65, though not the rate for all ages. In 1987, it was 17.6 percent.", "California's uninsured rate hovered near 20 percent during the 1990s and 2000s before declining sharply in recent years as the Affordable Care Act took effect.", "The foundation described the state’s 2015 uninsured rate of 8.5 percent for Californians under 65 as \"a historic low.\"", "Deborah Kelch, executive director of the Sacramento-based Insure the Uninsured Project, noted there are many different ways to measure California’s uninsured rate.", "But no matter which source is examined, she said, \"I think it’s fair to say we have reached a historic low of the uninsured.\"", "In an interview, Shana Charles, faculty associate at the UCLA Center for Health Policy Research, also described current uninsured rates as \"historic lows.\"", "Charles said there wasn’t much tracking of the state’s uninsured rate before the 1990s, adding coverage \"certainly wasn’t better\" in past decades.", "She said there’s been \"a slow expansion\" of health coverage over time in California and across the country since Medicare and Medicaid were enacted in the 1960s.", "Our ruling", "Gov. Jerry Brown claimed California’s uninsured rate in 2016 was \"a historic low\" at 7.4 percent.", "As evidence, his office pointed to the 7.4 percent uninsured rate reported in a survey covering the first half of 2016 by the CDC’s National Center for Health Statistics. That rate is for all ages in California.", "When discussing this topic, many researchers cite the uninsured rate for Californians under 65, which was slightly higher at 8.4 percent. Even at that rate, it would be an historic low.", "Data for that rate is more widely available. A health care almanac shows the state’s uninsured rate for Californians under 65 hovered near 20 percent during the 1990s and 2000s before dropping sharply in recent years. Its records go back to 1987 when that rate was 17.6 percent.", "Researchers who study California’s uninsured rate say this measurement was not closely tracked before the 1980s, but said the rate was certainly not lower in past decades. No matter how you measure it, they added, the uninsured rate in California has reached an historic low.", "We rate Brown's claim True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/2a1bc486-46f5-4b80-9a23-78257f4bb0ad", "Gov. Jerry Brown, letter to U.S. Rep. Kevin McCarthy, Jan. 13, 2017.", "Interview, Evan Westrup, spokesman for Gov. Brown, Jan. 16, 2017.", "Interview, Shana Charles, Faculty Associate, UCLA Center for Health Policy Research, Jan. 17, 2017.", "Interview, Deborah Kelch, executive director, Insure the Uninsured Project, Jan. 18, 2017.", "California Health Care Foundation, California Health Care Almanac, Insurance Coverage Source and Unemployment Trends California, 1987 to 2015, December 2016.", "Centers for Disease Control and Prevention, National Center for Health Statistics, \"Health Insurance Coverage: Early Release of Estimates From the National Health Interview Survey, January–June 2016,\", November 2016.", "State Health Access Data Assistance Center, Uninsured in California 2008 to 2015, accessed January 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]