["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Bill Gates was interviewed April 9, 2020, on CNBC about his foundation's efforts to fight COVID-19.", "The Gates Foundation is trying to develop a coronavirus vaccine.", "Gates spoke theoretically about how many people might suffer side effects from a vaccine, not about how many might die from it.", "The conspiracy section of a conservative website carried an article with this headline:", "\"Watch: Bill Gates Admits His COVID-19 Vaccine Might Kill Nearly 1,000,000 People.\"", "The article from CloverChronicle.com, shared widely on Facebook, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In the interview, Gates spoke theoretically about how many people might experience side effects from a yet-to-be-developed coronavirus vaccine.", "He did not say anything about people dying from such a vaccine.", "The Bill & Melinda Gates Foundation has pledged millions of dollars to companies developing potential novel coronavirus vaccines. There is no evidence that the foundation stands to profit from these efforts.", "Readers of the article were instructed to go to minute 2:35 of a video that’s embedded in the article. The video is a 4-minute clip of an interview Gates did April 9 on CNBC about the work his foundation is doing to fight COVID-19. CNBC posted the clip on YouTube. It has been viewed more than 74,000 times.", "Gates mentions needing about 7 billion doses worldwide and says:", "\"The efficacy in vaccines in older people is always a huge challenge. It turns out the flu vaccine isn’t that effective in elderly people; most of the benefit comes from younger people not spreading it because they’re vaccinated, and that benefits, on a community basis, the elderly.", "\"Here, we clearly need a vaccine that works in the upper age range because they’re most at risk of that. And doing that so that you amp it up so it works in older people, and yet you don’t have side effects. If we have one in 10,000 side effects, that’s way more — 700,000 people who will suffer from that.", "\"So, really understanding the safety at gigantic scale across all age ranges — pregnant, male, female, undernourished, existing comorbidities — it’s very, very hard. And that actual decision of, OK, let’s go and give this vaccine to the entire world — governments will have to be involved because there will be some risk and indemnification needed before that can be decided on.\"", "Gates makes no mention of anyone dying from the vaccine.", "He’s referring to side effects and suggests, theoretically, that if 7 billion vaccines are administered and one in 10,000 people experience side effects, that would mean 700,000 people experiencing side effects.", "(The full 26-minute interview is here.)", "This claim is false and ridiculous — Pants on Fire.", "CloverChronicle.com, \"Watch: Bill Gates Admits His COVID-19 Vaccine Might Kill Nearly 1,000,000 People,\" April 30, 2020", "YouTube, CNBC interview of Bill Gates, April 9, 2020", "AFP Fact Check, \"Bill Gates did not say COVID-19 vaccine could kill nearly a million people,\" May 18, 2020", "PolitiFact, \"No evidence the Gates Foundation will profit from a coronavirus vaccine,\" May 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]