["About this rating", "In 2007, rumors swirled about an impending split in the marriage of actor Duane Martin and actress Tisha Campbell Martin and about their alleged pursuit of\n\"alternative lifestyles.\"", "Posted Jul 17th 2007 2:01PM by TMZ Staff", "Duane Martin Comes Out: Ends Eleven-Year Marriage With Tisha Campbell", "Duane Martin and Tisha Campbell thought their love was a match made in heaven. By Hollywood's standards, it was. Married August 17, 1996, the couple transcended the norm for celebrity marriages, most lasting on average about three years. But not theirs. Their nuptials are coming to an end.", "The 37-year-old Martin announced to his wife a love affair with another male actor. This news devastated Tisha, 38. \"It was the biggest shock of my life,\" Campbell says. \"I've heard women say they didn't know their man was gay or bi and I wondered how they didn't know. But I really didn't have a clue.\" Tisha expressed outrage but she was no saint either. She also had previously acknowledged engaging in an alternative lifestyle during their marriage. The couple has a six year old son, Zen.", "We don't pretend to know anything about the details of the couple's private lives other than to note that such rumors have generally been met with denials, such as the following offered in the couple's interview with Essence magazine:", "Q: For the past month, the blogosphere has been filled with rumors about the future of your marriage. How are you holding up?", "Duane: Mark Twain said it best: \"A lie can travel halfway round the world while the truth is putting on its shoes.\" So I'm not going to defend myself against a gay rumor when I’m trying to defend my son against autism. We would look really stupid trying to take our focus off autism, which affects all of us, to fight a gay rumor. The reason we are talking today is because what we will defend is our 17-year relationship. Nobody is touching that. So whoever wants to rumble, let's rumble.", "Q: So for the record, are you getting a divorce?", "Tisha: Hell no!", "Duane: Listen, let me tell you something. I will chew her ass up and swallow it before I let somebody else have her.", "However, we can say that the item quoted at the head of this page, attributed to the entertainment news/gossip site TMZ.com, is some rumormonger's concoction. Gillian Sheldon, TMZ's supervising producer, told us the item was a \"fabrication\" and that TMZ \"never posted this article.\"", "The couple did eventually divorce in 2018, over a decade later, after more than 22 years of marriage.", "Aiello, McKenna.   \"Tisha Campbell-Martin Files for Divorce From Husband Duane Martin.\"\r\n    E Online.   22 February 2018.", "Byrd, Kenya N.   \"Tisha Campbell & Duane Martin: Through the Fire.\"\r\n    Essence.   6 September 2007.", "Updated", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]