["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Centers for Disease Control and Prevention offices in Atlanta, Georgia. (James Gathany, CDC)", "• The World Health Organization declared COVID-19 a pandemic in March.", "• There is no evidence the U.S. Centers for Disease Control and Prevention removed the term “pandemic” and replaced it with “outbreak” on its website homepage; “outbreak” has been used on the homepage for months.", "• On many pages, the CDC website refers to “the COVID-19 pandemic.”", "On March 11, the World Health Organization declared COVID-19 a pandemic. At the time, more than 118,000 cases of COVID-19 had been identified in over 110 countries worldwide, and the disease has continued to spread since.", "Now, more than 27 million cases of COVID-19 have been reported globally, according to Johns Hopkins University’s Coronavirus Resource Center. But some social media users are still questioning the terms used to describe the disease.", "\"The CDC has removed the ‘Covid-19 Pandemic’ and replaced it with ‘Covid-19 Outbreak’ on their website,\" one Facebook post says. \"It was never a pandemic.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post mischaracterizes the coronavirus updates on the U.S. Centers for Disease Control and Prevention’s website homepage.", "As early as Jan. 18, the CDC’s top homepage story was about the coronavirus. \"CDC is closely monitoring an outbreak caused by a novel (new) coronavirus in Wuhan City, China,\" the story said, according to an archived version of the page.", "The CDC was also using the term \"outbreak\" in February and March, archived pages show.", "The CDC homepage still refers to the virus as an outbreak on its homepage.", "However, the use of the term \"outbreak\" doesn’t mean COVID-19 is not a pandemic, as the CDC’s website explains.", "The site defines outbreak as \"a higher-­than-expected number of occurrences of disease in a specific location and time.\"", "\"An outbreak is called an epidemic when there is a sudden increase in cases. As COVID-19 began spreading in Wuhan, China, it became an epidemic,\" the website explains. \"Because the disease then spread across several countries and affected a large number of people, it was classified as a pandemic.\"", "The CDC site uses the term \"outbreak\" to describe COVID-19 on its homepage, while \"pandemic\" is used elsewhere on the site.", "The post also incorrectly asserts that COVID-19 was never a pandemic.", "The World Health Organization declared COVID-19 a pandemic on March 11 and has not changed that designation.", "The CDC refers to COVID-19 as a pandemic on various website pages dedicated to providing coronavirus information, including the \"Global COVID-19\" page, the \"Travel during the COVID-19 Pandemic\" page and others.", "The CDC’s page about influenza pandemics, which was last updated on May 12, plainly declares: \"The United States is NOT currently experiencing an influenza pandemic. There is an ongoing pandemic with a new coronavirus.\"", "A Facebook post claims, \"The CDC has removed the ‘Covid-19 Pandemic’ and replaced it with ‘Covid-19 Outbreak’ on their website. It was never a pandemic.\"", "The CDC website’s homepage currently refers to the \"novel coronavirus outbreak,\" and has been using that term since January. But there is no evidence the CDC removed the word \"pandemic\" to replace it with \"outbreak.\"", "The World Health Organization declared COVID-19 a pandemic in March, and the CDC website still refers to \"the COVID-19 pandemic\" on several of its pages.", "We rate this claim Pants on Fire!", "U.S. Centers for Disease Control and Prevention, \"Travel during the COVID-19 Pandemic,\" accessed Sept. 8, 2020", "U.S. Centers for Disease Control and Prevention, \"Case Investigation and Contact Tracing : Part of a Multipronged Approach to Fight the COVID-19 Pandemic,\" April 29, 2020", "TIME, \"World Health Organization Declares COVID-19 a 'Pandemic.' Here's What That Means,\" March 11, 2020", "World Health Organization, \"What is a pandemic?\" Feb. 24, 2010", "CNN, \"What is a pandemic?\" Feb. 25, 2020", "U.S. Centers for Disease Control and Prevention, \"Lesson 1: Introduction to Epidemiology,\" accessed Sept. 10, 2020", "Johns Hopkins University & Medicine, \"Coronavirus Resource Center,\" accessed Sept. 10, 2020", "World Health Organization, \"Archived: WHO Timeline - COVID-19,\" accessed Sept. 10, 2020", "Twitter, \"World Health Organization Media Briefing on COVID-19,\" March 11, 2020", "U.S. Centers for Disease Control and Prevention, \"Global COVID-19,\" accessed Sept. 10, 2020", "U.S. Centers for Disease Control and Prevention, \"Pandemic Influenza,\" accessed Sept. 10, 2020", "U.S. Centers for Disease Control and Prevention, \"Identifying the source of the outbreak,\" accessed Sept. 10, 2020", "Wayback Machine, Capture of https://www.cdc.gov/ from Jan. 18, 2020", "Wayback Machine, Capture of https://www.cdc.gov/ from Feb. 1, 2020", "Wayback Machine, Capture of https://www.cdc.gov/ from March 2, 2020", "Wayback Machine, Capture of https://www.cdc.gov/ from Sept. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]