["About this rating", "As the number of confirmed cases of the COVID-19 coronavirus disease surpassed 2 million in early June 2020, the campaign to reelect U.S. President Donald Trump ended its monthslong pause on large, in-person events and announced it would host a rally in Tulsa, Oklahoma, in the coming weeks.", "Despite public health officials' recommendations at the time to avoid group gatherings and crowds to limit the spread of COVID-19, the Trump campaign announced on June 10 that it would host a rally at the Bank of Oklahoma Center, which seats almost 19,200 people, on June 19. Trump told reporters at the White House:", "We’re going to start our rallies back up now. We’ve had a tremendous run at rallies. ...The first one, we believe, will be probably — we’re just starting to call up — will be in Oklahoma — in Tulsa, Oklahoma. A beautiful, new venue — brand-new. And we’re looking forward to it. They’ve done a great job with COVID, as you know, in the state of Oklahoma.", "Beyond the event's potential threat to attendees' health, critics including high-profile Democrats and historians saw the announcement as a call to white supremacists during a national reckoning over racism following the death of George Floyd for two reasons: Tulsa is home to one of the worst acts of racial violence in American history — the 1921 Tulsa race massacre — and the event's originally scheduled date of June 19, or Juneteenth, is a day in many communities that traditionally celebrates the end of U.S. slavery in 1865. So two days after the initial announcement from the Trump campaign, the president yielded to that backlash and said he would delay the event and instead hold it on June 20. He tweeted:", "But as critics pointed out, the massive gathering still held the potential to expose large numbers of people to COVID-19. As if to confirm the danger, reports appeared saying the Trump campaign was asking attendees to agree in advance not to hold the campaign liable for coronavirus exposure:", "To investigate the claim that attendees were asked to agree to a liability waiver, we went through the steps of reserving a spot at the Tulsa rally in the days before the event. To receive a digital ticket for the event, attendees had to complete the following form:", "At the bottom of the registration page, the following text appeared:", "By clicking register below, you are acknowledging that an inherent risk of exposure to COVID-19 exists in any public place where people are present. By attending the Rally, you and any guests voluntarily assume all risks related to exposure to COVID-19 and agree not to hold Donald J. Trump for President, Inc.; BOK Center; ASM Global; or any of their affiliates, directors, officers, employees, agents, contractors, or volunteers liable for any illness or injury.", "In other words, to reserve an entry ticket for the Tulsa rally, people had to agree that they would \"assume all risks related to exposure to COVID-19\" and agree not to sue Trump or any organizers of the event if they got sick. That agreement essentially clears the campaign of any responsibility should attendees catch the virus.", "At first, campaign leaders declined to elaborate on their plans to protect attendees' health once they were at the event. Then, on June 14, White House economic adviser Larry Kudlow told reporters that attendees should wear masks. And campaign manager Brad Parscale said the following day that event organizers will hand out hand sanitizer and face masks (though they're not necessarily required) and check attendees' temperatures for fevers. He tweeted:", "Still unclear is if, or to what extent, the event will promote social distancing. It's possible people will stand or sit less than six feet apart from each other, despite recommendations from the Centers for Disease Control and Prevention (CDC) to avoid that close of contact with people to prevent the virus' spread. Additionally, as of June 16, the CDC urged everyone to wear cloth face coverings when they leave their homes, stating on its website:", "Considering the ongoing health risks due to COVID-19 and an upward trend in cases statewide, Tulsa Health Department Director Bruce Dart said he would rather the president hold the event at a later date. He told Tulsa World:", "I think it’s an honor for Tulsa to have a sitting president want to come and visit our community, but not during a pandemic. ...I’m concerned about our ability to protect anyone who attends a large, indoor event, and I’m also concerned about our ability to ensure the president stays safe as well.", "As of June 15, Oklahoma had tallied 359 deaths and 3,417 non-fatal cases due to the virus.", "The Trump campaign had last held a big rally on March 2 in Charlotte, North Carolina, before much of the country shut down to curb the pandemic.", "In sum, given the substantiating evidence that, in order to receive a ticket for the Tulsa event, people must click a box agreeing they would not hold the Trump campaign or event organizers liable should they catch COVID-19 at the June 20, 2020, rally, we rate this claim \"True\".", "Fox, Joe, et. al.   \"At Least 112,000 People Have Died from Coronavirus in the U.S.\"\r\n    The Washington Post.   Accessed 12 June 2020.", "Centers for Disease Control and Prevention.   \"How to Protect Yourself & Others.\"\r\n   Accessed 12 June 2020.", "Sprunt, Barbara.   \"Upcoming Trump Rally In Tulsa Faces Backlash Over Race, Coronavirus.\"\r\n    National Public Radio.   11 June 2020.", "Bierman, Noah.  \"Trump Says He Will Resume Campaign Rallies June 19 in Tulsa.\"\r\n    Los Angeles Times.   10 June 2020.", "White House.   Remarks by President Trump in Roundtable Discussion.\r\n    10 June 2020.", "Oklahoma State Department of Health.   \"Current Situation.\"\r\n    Accessed 12 June 2020.", "Chiacu, Doina.   \"Trump Economic Adviser Urges Wearing of Masks at Tulsa Rally.\"\r\n    Reuters.   14 June 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]