["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Milwaukee reduced the number of polling places from 180 to five in the presidential primary on April 7.", "On separate occasions Secretary of State Jay Ashcroft reported different sets of numbers for the total polling places in Milwaukee compared to what they have for a typical election.", "Wisconsin’s presidential primary election on April 7 is serving as an example of what state politicians want to avoid for an election taking place during a pandemic.", "Across the state there were fewer polling locations than normal. In Milwaukee, there were only five polling locations for a population of almost 600,000.", "This was concerning because fewer polling locations means more people had to come together to vote. The state was under a stay-at-home order to reduce the spread of COVID-19, and the governor has extended the order until at least May 26.", "Missouri Secretary of State Jay Ashcroft has called Wisconsin officials' handling of the situation \"ludicrous.\" But it appears he has been inconsistent with the numbers he reports.", "One week after the Wisconsin election, he went on St. Louis radio station 97.1 FM to talk about Missouri’s June 2 election. He said his state could handle things better and still keep in-person elections.", "He used Milwaukee as his prime example of how in-person voting went wrong in Wisconsin.", "\"When you look at Wisconsin, in their largest city they normally have roughly 500 polling places, and when they just had their election a week or two ago they had five,\" Ashcroft said. \"That is ludicrous.\"", "It’s not the only time Ashcroft has changed the numbers.", "What are the real numbers? Executive director of Milwaukee’s election commission, Neil Albrecht, confirmed that for a typical election the city has 180 polling places.", "In Wisconsin’s most recent election it was reduced to five polling places. The reduction in polling places was the result of fewer people volunteering to be poll workers.", "Fifty-two people across Wisconsin who had been at the polls on election day have tested positive for COVID-19. It can’t be confirmed, however, that they were exposed at the polls.", "A little over a week after Ashcroft stated that Milwaukee typically has 500 polling places, he went on St. Louis Public Radio and gave the correct number, 180. In the same breath, however, he then reported that Milwaukee had reduced the number of polling places for the April 7 election to four, off from the five that were really available.", "While a difference of one may not seem like a lot, the error going from five to four is 20%.", "The director of communications for the Secretary of State’s Office acknowledged that Ashcroft misspoke in both instances.", "Ashcroft said that for the April 7 presidential primary, Milwaukee would \"normally have roughly 500 polling places. They just had their election a week ago, and they had five.\"", "He exaggerated the number of usual polling places by a lot, but he is correct about the number of reduced in-person locations.", "His claim is partially accurate, so we rate it Half True.", "97.1 FM Talk, \"Missouri Secretary of State Jay Ashcroft on bringing  back his workforce,\"  April 14, 2020", "St. Louis Public Radio, \"Missouri Secretary of State Promises Personal Protective Equipment For Poll Workers,\" April 23, 2020", "ABC News, \"52 who worked or voted in Wisconsin election have COVID-19,\" April 29, 2020", "Shepherd Express, \"Scenes from One of Milwaukee’s Five Polling Places,\" April 7, 2020", "St. Louis Post-Dispatch, \"Missouri Gov. Parson pushes April elections to June as coronavirus precaution,\" March 18, 2020", "Twin Cities Pioneer Press, \"Conservative justices bash Wisconsin stay-at-home orde,\" May 5, 2020", "FiveThirtyEight, \"Here’s What Voters Told Us About Voting In Wisconsin Primary,\" April8, 2020", "The Washington Post, \"Wisconsin Supreme Court hears GOP lawmakers’ challenge to stay-at-home order,\" May 5, 2020", "Milwaukee Journal Sentinel, \"Milwaukee normally has 180 voting sites; because of coronavirus, fewer than 12 polling places will be open April 11,\" April 1, 2020", "Wisconsin Election Commission, \"More Wisconsin Election Results,\" April 2020 Spring Election and Presidential Preference Primary Results and 2016 Spring Primary Results, Accessed May 5", "Email exchange with Neil Albrecht on May 5", "Email  exchange with Maura  Browning on April 28, 29", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]