["By Angelo Fichera", "Posted on March 16, 2020", "A misleading chart being spread on Facebook, erroneously dubbing the new coronavirus the “least deadly virus,” contains outdated information about the coronavirus and erroneous information about the death rate of the 2009 pandemic of H1N1.", "Health officials around the world don’t yet know with certainty the death rate of COVID-19, the disease caused by the novel coronavirus, but some U.S. officials are currently estimating the disease is 10 times more fatal than the seasonal flu.", "Posts circulating on Facebook, however, are erroneously dubbing the coronavirus the “least deadly virus” by spreading a chart homing in on fatality rates of other viruses. The chart was actually published in January, so it cites old data about coronavirus cases and deaths, and it contains an error that makes COVID-19 look less fatal than the 2009 H1N1 “swine flu” outbreak.", "First, some context: While the World Health Organization has previously estimated the fatality rate of COVID-19 to be around 3.4%, that figure relies on known, confirmed cases of the disease — as we’ve previously written. The number very well may fall under 1%, as President Donald Trump has suggested, as more data about the total number of cases becomes available.", "Still, an estimated 1% fatality rate is 10 times that of the seasonal flu, whose mortality rate is about 0.1% — a point Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, stressed to Congress on March 11.", "The misleading chart, however, would suggest the virus is not so harmful. One user sharing the post in a conspiracy theory group said the virus was the “least deadly” and “most-hyped by the media.” His post alone was then shared by more than 10,000 others.", "The chart was first published in a Jan. 30 story on Business Insider attempting to convey how the novel coronavirus compared to previous outbreaks; it did not include the “least deadly virus” label.", "The numbers of novel coronavirus cases and deaths in that original chart, now spreading on Facebook, are listed as 9,812 and 213 respectively; the fatality rate is listed as 3.2% (below the fatality rate of several other viruses included in the chart). Those figures for the coronavirus are now outdated. As of March 16, there have been more than 174,000 confirmed cases and more than 6,700 deaths.", "Further, the chart contains wrong information about the 2009 outbreak of H1N1 and lists the death rate of that outbreak as 17.4%. Business Insider later corrected the chart to show that that outbreak had a 0.02% fatality rate — consistent with an estimate from a 2013 study analyzing the pandemic — and issued an editor’s note Feb. 4 alerting readers to that fact.", "Shayanne Gal, the digital publication’s graphic designer who created the chart, confirmed as much to us, saying in an email that “the post on Facebook features an incorrect, outdated version of our chart.”", "“We did not claim that the coronavirus is the ‘least deadly virus’, and of course we made sure to state that those were the numbers we had as of the time reported,” Gal said.", "Business Insider’s corrected chart (using data as of Feb. 4) showed that COVID-19 has a higher death rate than H1N1, disproving the “least deadly virus” label being used on social media. And while the amended version relied on confirmed cases and deaths as of early February, putting the new coronavirus fatality rate at 2.1%, even the 1% estimate cited by Fauci is much higher than the H1N1 rate.", "We’ve previously explained the differences between the two outbreaks and the fact the new coronavirus is significantly more transmissible, and more lethal, than H1N1.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“2009 H1N1 Pandemic (H1N1pdm09 virus).” U.S. Centers for Disease Control and Prevention. Accessed 13 Mar 2020.", "“Coronavirus COVID-19 Global Cases.” Center for Systems Science and Engineering, Johns Hopkins University. Accessed 13 Mar 2020.", "Gal, Shayanne. Graphic designer, Business Insider. Email to FactCheck.org. 13 Mar 2020.", "McDonald, Jessica and Lori Robertson. “Trump’s H1N1 Swine Flu Pandemic Spin.” FactCheck.org. 13 Mar 2020.", "Rieder, Rem. “Trump and the Coronavirus Death Rate.” FactCheck.org. 5 Mar 2020.", "Roos, Robert. “Study puts global 2009 pandemic H1N1 infection rate at 24%.” University of Minnesota Center for Infectious Disease Research and Policy. 24 Jan 2013.", "“WATH LIVE: CDC, NIH director testify before House on coronavirus response (Day one).” Washington Post. YouTube. 11 Mar 2020.", "“WHO Director-General’s opening remarks at the media briefing on COVID-19 – 3 March 2020.” World Health Organization. 3 Mar 2020.", "Woodward, Aylin and Shayanne Gal. “One chart shows how the Wuhan coronavirus compares to other major outbreaks and pandemics in the last 50 years.” Business Insider. 30 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]