["By Saranac Hale Spencer", "Posted on May 17, 2018", "Q: Did House Speaker Paul Ryan break campaign finance laws in a meeting with donor Sheldon Adelson?", "A: He met with Adelson (which is legal), but there’s no evidence he solicited a $30 million donation for a Republican super PAC (which would be illegal).", "House Speaker Paul Ryan was at a recent meeting where casino mogul and Republican mega-donor Sheldon Adelson agreed to give $30 million to the Congressional Leadership Fund, a conservative super PAC.", "Ryan didn’t ask for the donation — he actually left the room while someone else made the request — a spokeswoman for the CLF confirmed. If that’s what happened, it’s not a violation of campaign finance laws.", "But a left-leaning website called Opposition Report posted an item that is circulating on Facebook with the headline: “BREAKING: Paul Ryan BUSTED In Corruption Scheme With Top Donor.” It was copied and posted by at least two other sites the next day.", "The story, which Facebook users flagged as potentially false, says: “Speaker of the House, Paul Ryan, broke campaign finance laws.” But it offers no evidence to support that claim.", "The Congressional Leadership Fund is a so-called “nonconnected PAC,” which means it is not a party committee. It may receive unlimited contributions, while national party committees are limited to accepting $33,900 per year from individual contributors. The official House Republican committee is called the National Republican Congressional Committee.", "It’s not unusual for high-ranking federal officeholders, such as Ryan, to meet with big donors to friendly super PACs. That’s legal as long as they don’t actually solicit contributions over the thresholds set in the federal election law for individual contributions to traditional PACs — which currently is $5,000 from individuals, as explained on the Federal Election Commission website.", "“The classic example is a fundraiser,” said Lawrence Noble, former general counsel to the FEC and senior director of The Campaign Legal Center, a nonpartisan organization that deals with election law and campaign finance issues.", "Noble said federal lawmakers can attend super PAC events that raise donations far beyond those caps, as long as they aren’t the ones who actually ask for the money. That’s when those who aren’t in office step in and request the donations.", "Other experts agreed.", "They all pointed to a 2011 FEC advisory opinion that said officeholders cannot solicit unlimited funds, but they can “attend, speak at, or be featured guests at fundraisers for the Committees, at which unlimited individual, corporate, and labor organization contributions will be solicited.”", "The Opposition Report describes that kind of situation with Ryan being present for the meeting and then leaving when the donation is requested. But it concludes, “This is disgusting, and — once again — not legal.” But it is legal.", "We asked Ryan’s office for comment, and it referred us to his fundraising committee, Team Ryan, which provided us with his recent answer to a reporter about the incident. Here’s the exchange:", "Bill Glauber, Milwaukee Journal Sentinel: Congressman Sensenbrenner discussed how good a fundraiser you are. You took that trip to Nevada to meet with Adelson when there was a $30 million ask, not made by you, what do you tell people about the ethics of the fundraising and how it works, because it has gotten some criticism.", "Ryan: Look, we follow the rules extremely carefully, and in that case we did. And I think a lot of Americans realize that our majority is at stake. The midterm elections are not good for majority parties, historically speaking. On average, the president’s party in the first midterm loses about 32 seats, we have a 24-seat majority. So I think people understand that the historic trend does not (inaudible) the majority party, and what we’re trying to do is make the case to people around the country that this is a majority worth supporting. With respect to the campaign finance issues, we do it by the book, always have, always will.", "Ryan and the Republicans are counting on the Congressional Leadership Fund to help the party retain its majority in the House. In 2016, the super PAC raised almost $51.1 million and made more than $40 million in independent expenditures – such as TV ads that advocate for the defeat or election of particular candidates. Its largest individual donors in 2016 were Adelson and his wife, Miriam, who contributed $20 million to the group.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Clarification, June 6: We changed the headline and clarified the short answer and one line in this story to make it clear that there’s no evidence that Ryan violated campaign finance laws.", "Sherman, Jake and Alex Isenstadt. “Sheldon Adelson kicks in $30M to stop Democratic House takeover.” Politico. 10 May 2018.", "Alexander, Courtney. Spokeswoman, Congressional Leadership Fund. Interview with FactCheck.org. 15 May 2018.", "Simpson, Andrew. “BREAKING: Paul Ryan BUSTED In Corruption Scheme With Top Donor.” ORnews.org. 11 May 2018.", "Soft money of political parties. 52 U.S.C. 30125.", "Limitations on contributions and expenditures. 52 U.S.C. 30116.", "Federal Election Commission. Advisory Opinion 2011-12. 30 Jun 2011.", "Noble, Lawrence. Senior Director, The Campaign Legal Center. Interview with FactCheck.org. 15 May 2018.", "Adler, Jeremy. Spokesman, Team Ryan. E-mail sent to FactCheck.org. 15 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]