["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Team owner Richard Petty, right, stands next to driver Bubba Wallace during the national anthem prior to the start of the NASCAR Cup Series at the Talladega Superspeedway in Talladega, Ala., Monday, June 22, 2020. (AP Photo/John Bazemore)", "NASCAR eliminated the presence of the Confederate flag at races and no longer requires drivers to stand for the playing of the national anthem.", "There is no evidence it eliminated the anthem or other traditions like a military flyover or a pre-race prayer.", "NASCAR made big news when it banned the display of Confederate flags from its events in response to a call from Bubba Wallace, the lone African American driver in the sport’s elite Cup Series.", "Now, a Facebook post shared thousands of times falsely claims that NASCAR also \"eliminated the traditional pre-race prayer, military flyover and the national anthem for being too controversial.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "PolitiFact reached out to NASCAR for an official statement, but have yet to receive a response.", "However, we find no evidence that the racing giant has instituted these measures.", "In a statement posted to NASCAR’s website on June 10, the organization announced it would ban the Confederate flag from its events and all NASCAR premises explaining that its presence \"runs contrary to our commitment to providing a welcoming and inclusive environment for all fans, competitors and industry.\" The move came after Wallace shared his plan to run a car with a Black Lives Matter paint scheme and called on NASCAR to eliminate displays of the Confederate flags.", "\"No one should feel uncomfortable when they come to a NASCAR race,\" Wallace said June 8 on CNN. \"So it starts with Confederate flags. Get them out of here. They have no place for them.\"", "Also on June 10, Bob Pockrass, FOX Sports’ NASCAR reporter, tweeted that NASCAR removed the rule that previously required drivers to stand for the national anthem. There were no changes prohibiting playing \"The Star Spangled Banner,\" however.", "In fact, on June 14, the Dixie Vodka 400 from Homestead-Miami Speedway included a pre-race prayer, the playing of the national anthem and a military flyover. The prayer was delivered by former NFL player Tony Boselli, the national anthem was performed by Grammy-award winning artist Jon Secada and, following the song, four F-16 fighter wings conducted the military flyover from the Homestead Air Force base in Homestead, Fla.", "Facebook posts have claimed that NASCAR has removed the pre-race prayer, military flyover and the singing of the national anthem from races for being too controversial. NASCAR has only removed the presence of the confederate flag at races, but has not removed any of the listed pre-race traditions. Also, drivers are not required to stand for the national anthem, allowing them peaceful protests to occur per the drivers’ discretion.", "We rate this statement False.", "Facebook post, June 15, 2020", "Facebook, How is Facebook addressing false news through third-party fact checkers?, accessed June 24, 2020", "The Washington Post, Bubba Wallace wants NASCAR to ban Confederate flags, will drive ‘Black Lives Matter’ car, June 9, 2020", "CNN, NASCAR’s Bubba Wallace will have Black Lives Matter paint scheme on car at Martinsville Speedway race, June 9, 2020", "NASCAR, NASCAR statement on confederate flag, June 10, 2020", "Twitter, posted by Bob Pockrass, June 10, 2020", "YouTube, Dixie Vodka 400 from Homestead-Miami Speedway, June 16, 2020", "NBCSports NASCAR, NASCAR to allow peaceful protests during national anthem, June 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]