["About this rating", "In June 2019, after Iran downed a U.S. surveillance drone, tensions between the two countries reached the point that U.S. President Donald Trump reportedly approved limited military strikes on Iran in retaliation before opting against the plan.", "Soon afterwards, Snopes readers began querying us about a purported quote from former Alaska governor and 2008 Republican vice-presidential nominee Sarah Palin, who supposedly proclaimed that the U.S. had \"already attacked Iran back when it called itself Iraq.\"", "Palin made no such statement, which was just a humorous spoof playing on both Palin's reputation for being less than well-versed in foreign affairs and the similarity in names (and geographical proximity) of two Middle Eastern countries that have been adversaries of the United States.", "The putative quote appears to have originated with a Facebook post made by humorist Andy Borowitz:", "Borowitz pens satirical pieces for the \"Borowitz Report\" (published by The New Yorker) that typically carry \"NOT THE NEWS\" disclaimers when posted to social media. However, this rumor stemmed from a standalone Facebook post by Borowitz that did not link to an underlying satirical article, thereby confusing some viewers unfamiliar with his work who encountered it online.", "The first comment under the Facebook post in question was also from Borowitz, offering a follow-up line also attributed to Palin: \"'It’s like when Puff Daddy changed his name to P Diddy,' Palin said. 'You’re not fooling anyone, Iraq.'\"", "Associated Press.   \"A Half-Hour Away: How Trump Opted Against Iran Strike.\"\r\n    Snopes.com.   22 June 2019.", "Associated Press.   \"US Prepped for Strikes on Iran Before Approval Was Withdrawn.\"\r\n    Snopes.com.   20 June 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]