["By D'Angelo Gore", "Posted on February 15, 2018", "General Motors will close one of its four assembly plants in South Korea in May. It did not say it was moving production to Detroit instead, as President Trump claimed.", "“That was not part of the announcement,” GM spokesman Patrick Morrissey said in a phone interview with FactCheck.org.", "A GM Korea press release announcing the closure said that the Gunsan plant has been underused for years, “making continued operations unsustainable.” But the press release also said the company presented stakeholders with “a concrete plan to stay in the country and turn the business around” to save jobs.", "However, during a meeting on trade held at the White House with the president’s cabinet and some members of Congress, Trump said that the company was relocating.", "Trump, Feb. 13: One thing I just — I do want to tell you, we just got this notice. General Motors in Korea announces the first step in necessary restructuring. They’re going to — GM Korea company announced today that it will cease production and close its Gunsan plant in May of 2018, and they’re going to move back to Detroit.", "You don’t hear these things, except for the fact that Trump became President. Believe me, you wouldn’t be hearing that. So they’re moving back from Korea to Detroit. They’re moving.", "The president got the closure part right, but there was nothing in the company’s official statement about “moving back” to the Motor City.", "“There could be broader global implications,” as a result of closing the plant, Morrissey, a GM spokesman, told us by phone. But as for a planned move to Detroit? “That was not part of the announcement,” he said.", "Kristin Dziczek, head of the Industry, Labor & Economics Group at the Center for Automotive Research in Ann Arbor, Michigan, was more direct.", "“There is no new plant or new production in Detroit” as a result of this, Dziczek told us in an interview. She tweeted similar statements contradicting the president, who also wrongly said that Fiat Chrysler was moving a manufacturing plant from Mexico to Michigan.", "@GM is closing Gunsan/South Korea plant. Gunsan output was not imported to the U.S. There is no new U.S. plant or productive capacity announced as a result. @FiatChrysler_NA is investing to produce RAM trucks in Michigan. The company will continue making vehicles in Saltillo.", "— Kristin Dziczek (@kdziczek) February 13, 2018", "In its Feb. 12 press release, GM Korea said “it will cease production and close its Gunsan plant by the end of May 2018” because the “facility has been increasingly underutilized, running at about 20 percent of capacity over the past three years, making continued operations unsustainable.”", "“This announcement occurs after a careful review of the company’s operations, which have sustained significant losses for the past several years,” the company said.", "Dziczek noted that fewer people are buying the Chevy Cruze, which is one of two cars made at the Gunsan plant. So there’s really no need for more capacity in the U.S., where Cruzes are already made in Lordstown, Ohio, she explained.", "Contrary to Trump’s claim of a move to Detroit, the company will still have three other assembly plants in South Korea. And the company promised to present stakeholders with a “concrete plan to stay in the country and turn the business around.”", "“The proposal includes significant product-related investments in South Korea and would preserve thousands of jobs,” its press release said.", "The company said that it will make a decision on its next steps by the end of February.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]