["A video of former AIMIM MLA Waris Pathan was shared by BJP MP Arjun Singh with the claim that Pathan is threatening Mumbai police during the lockdown. In the video, Pathan can be heard telling a cop to not disrupt people from offering namaz. “These people have been praying here for the last 40 years. Do not try shutting down the mosque, do not try to shut down the loudspeakers,” he says.", "Look at the open threat being given by #warispathan to police. And @rautsanjay61 ji of ruling party in Maharashtra was trying to teach @myogiadityanath ji on how to handle law and order. Pehle Mumbai to sambhal lijye!#byculla pic.twitter.com/bughOE3Xq3", "— Arjun Singh (@ArjunsinghWB) April 29, 2020", "Actor and BJP supporter Payal Rohatgi shared the clip on May 1.", "Facebook user Ankur Gupta shared the video with the following caption – “#Warispathan…. See their dadagiri with our Coronavirus warriors who is doing their duty towards us to save our lives & these type of mullahs are threatening the police officer who is doing his duty very honestly.”", "#Warispathan..🐷.. See their dadagiri with our Coronavirus warriors who is doing their duty towards us to save our lives & these type of mullahs are threatening the police officer who is doing his duty very honestly", "Posted by Ankur Gupta on Tuesday, 28 April 2020", "The video is viral on Twitter and Facebook. Alt News has also received multiple fact-check requests on its official mobile application.", "The viral video carries the words ‘Mumbai Live’ on the top right corner.", "A keyword search on Youtube – ‘Waris Pathan police Mumbai Live’ – took us to the same video uploaded by the channel on November 18, 2016. The description of the video is as follows – “Video of MIM MLA Waris Pathan abusing police has gone viral. This happened when police asked Pathan to lower down the loud speaker’s voice which did not go well with Pathan and he started abusing the police.”", "In the complete video, one can hear Pathan asking the cop to let the hospital and mosque function per usual since they have permission till 10 PM. Further in the clip, he addresses the crowd – “You all don’t break law and order. They [police] are not troubling us. They are supporting us. It is our duty to stay within the bounds of law and order.”", "Mumbai Live had also carried an article on the incident. A YouTube channel AIMIM India had shared the video on November 14, 2016, with the following caption – “Yesterday’s Night Situation was tensed at Byculla due to issue of Loudspeakers at Mosque..Police were harassing locals..AIMIM Byculla MLA Advocate Waris Pathan intervens and solved the issue..Thousands gathered on streets..Thanks to our Brave Daring MLA Waris Pathan.”", "Pathan took to Twitter to call-out the misinformation.", "[Thread]", "Sir @CPMumbaiPolice I would like to bring it to your notice that some people are trying to spread false news in this pandemic by posting 5yrs old video where the issue of loudspeaker was resolved after my timely intervention in the presence of Cops. @asadowaisi", "(1/2)", "— Waris Pathan (@warispathan) April 28, 2020", "Therefore, BJP MP Arjun Singh targetted AIMIM leader Waris Pathan using an old video. He falsely claimed that Pathan threatened policemen to keep mosques open during the lockdown imposed due to coronavirus outbreak.", "[Update: Payal Rohatgi’s tweet was added to the report on May 1.]", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]