["About this rating", "Searching for the word \"trap\" on Google results in a definition that includes an example sentence about police and demonstrators.", "The sentence was not written by Google.", "In August 2016, a screenshot purportedly showing Google search results offering a definition of the word \"trap\" started circulating on social media.  The results were decried as evidence of the search engine giant's having a \"liberal, anti-police agenda,\" because an example sentence demonstrating the meaning of the word \"trap\" referenced police herding \"demonstrators into a trap\" and then attacking and arresting them:", "The definition displayed above does appear when you enter the word \"trap\" into Google, but this screenshot is frequently shared with misinformation about how Google works.", "The main misconception is that the definition for the word \"trap\" was written by Google. However, the search engine giant does not maintain their own dictionary, nor do they provide their own answers to specific queries. Instead, Google points users to what their algorithms determine to be the most relevant information available on the Internet. In this case, the example sentence was most likely taken from OxfordDictionaries.com (although the same example appears in other online dictionaries as well).", "Even though the example sentence offered by Google may have come from Oxford Dictionaries, that organization's lexicographers did not write it either. Oxford Dictionaries explained in a January 2016  blog post that they glean example sentences from real-world sampling:", "We often receive queries about the example sentences on OxfordDictionaries.com. Some people assume that they are written by the lexicographers who produce the definitions, but in fact they are chosen from real-life examples collected on Oxford’s corpora—vast databases of text drawn from many publications, websites, and other sources. Oxford takes an evidence-based approach to lexicography, meaning that all entries must be based on actual examples of the word in use.", "In this case, the example sentence was apparently taken from an article written by Dave Lindorff in June 2003 and titled \"Civil Liberties Take a Dive Post-9/11\":", "Repressive and threatening measures by federal, state and local officials have included illegal spying, infiltration, violent actions, and intimidation, and have often been supported by local authorities. During a September 2002 demonstration near the White House, capital police deliberately herded 400 peaceful demonstrators into a trap and then attacked and arrested them, in a case that is still being challenged by the ACLU. In Oakland, California, using rubber and wooden bullets, police fired on people peacefully protesting the use of the city’s port facilities for shipping military equipment.", "The use of \"trap\" in this particular sentence, then, is not a subtle attempt by Google to further a liberal agenda, but an example taken from an article about an actual event, demonstrating a very particular meaning of the word.", "Martin, Katherine.   \"How Are Dictionary Examples Chosen?\"\r\n    OxfordDictionaries.com.   26 January 2016.", "Lindorff, David.   \"Civil Liberties Take a Dive Post-9/11.\"\r\n    In These Times.   2 June 2003.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]