["A video of a little girl who went astray and got lost is widely circulating on social media with the claim that she was found in Mangalore with a group of Tamil beggars. The message adds that she was found by the beggars on a train coming from Mumbai. “She knows her name & says she is Sonal Bipin Patel,” per the claim. Incidentally, this does not match with the name the girl says in the video. When asked, she says her name is “Gungun”.", "Among those who shared the video with the same claim was singer Rekha Bhardwaj who later took it down. Another Twitter user @vidurneeti1 had also shared the clip.", "This little girl was seen in Mangalore with a group of Tamil beggars.Please forward until it reaches her parents and identified. She knows her name & says she is Sonal Bipin Patel. The beggars say she was found in a train coming from Mumbai. Retweet🙏@muglikar_ @rahulroushan pic.twitter.com/y25wgSzaR2", "— vidurneeti (@vidurneeti1) December 14, 2019", "The video was also posted by one Mruthyumjayudu Pilli on Facebook. It has close to 1 lakh views and has been shared over 6,000 times.", "From the account of an individual user Kadambini Vikas Bijlani, the video garnered 7,500 shares and has more than 1.3 lakh views. Furthermore, it drew 2,000 shares from the account of another user Inderjeet Oberoi.", "It is viral on Facebook.", "The video has been shared with a different narrative as well. Posted by one Mudit Aryan Shukla, the clip has amassed whopping 1.8 million views. The corresponding message reads, “पापा का नाम अशोक कुमार व माता का नाम गुड्डी बता रहे है इस फोटो को सेंड करना नही भुलना सायद. किसी के घर. वाले मिल जाए Friends पिलिज आपके पास जितने भी group है पिलिज उसमें सेंनड करो (She is saying her father’s name is Ashok Kumar and her mother’s name is Guddi. Don’t forget to send this photo. Maybe the family finds her. Please send it on all groups.)”", "The video was traced back to January 30, 2018, when it was shared by a Twitter user Arjun Chaudhary. Tagging Uttar Pradesh police and Ghaziabad police he had written, “ये बिटीया किसकी हे ये मोहन नगर मे मिली है अगर किसी को जानकारी हे तो बताऐ मे रोकी भदोरिया फोन लगांये 7000818182. (Whose daughter is she? She was found in Mohan Nagar. If anyone has any information then call on this number 7000818182. I’m Rocky Bhadauria.)”", "ये बिटीया किसकी हे ये मोहन नगर मे मिली है अगर किसी को जानकारी हे तो बताऐ मे रोकी भदोरिया फोन लगांये 7000818182@SspGhaziabad @ghaziabadpolice @Uppolice @adgzonemeerut @singhshakti1982 @chandanmedia @vipintomarabp pic.twitter.com/JMswP0ycjD", "— Arjun Chaudhary (@Arjunpchaudhary) January 30, 2018", "That same day, Ghaziabad police tweeted that the girl was found – “सोशल मीडिया, #uppolice #ghaziabadpolice के प्रयासों से उक्त बच्ची अपने परिजनों से मिल गयी है ~ रोकी भदौरिया जी से संपर्क कर जानकारी ली गयी है। धन्यवाद ! (Due to the efforts on social media, UP police and Ghaziabad police, the girl has been reunited with her family ~ We got her information after contacting Rocky Bhadauria. Thank you!)“", "सोशल मीडिया, #uppolice #ghaziabadpolice के प्रयासों से उक्त बच्ची अपने परिजनों से मिल गयी है ~ रोकी भदौरिया जी से संपर्क कर जानकारी ली गयी है। धन्यवाद ! https://t.co/6frCeGKq7M", "— GHAZIABAD POLICE (@ghaziabadpolice) January 30, 2018", "When Alt News called the number, it was switched off. Website Newschecker however had earlier fact-checked the video and was able to contact Rocky Bhadauria, a resident of Madhya Pradesh. He informed that the child had wandered into a neighbour’s house while playing outside. After posting her clip on Twitter, the girl’s family members were able to find her and took her home.", "The same message “child seen in Mangalore with Tamil beggars” was earlier viral to circulate another piece of misinformation where images of a girl from Bangladeshi were shared.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]