["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former New York City Mayor Michael Bloomberg speaks at a campaign event Wednesday, Feb. 5, 2020, in Providence, R.I. (AP)", "Mike Bloomberg said he opposed raising the minimum wage in 2015.", "Bloomberg called for expanding the Earned Income Tax Credit, rather than raising the minimum wage.", "During his 2020 campaign, Bloomberg called for raising the minimum wage to $15 an hour.", "U.S. Sen. Bernie Sanders welcomed Democratic rival Mike Bloomberg into the thick of the presidential primary with a slew of attacks on the former New York City mayor’s moderate record.", "Speaking at a gathering of Democrats in Nevada, Sanders contrasted his own consistent support for raising the minimum wage with Bloomberg’s on-the-record opposition.", "\"We will not defeat Donald Trump with a candidate who in 2015 stated, and I quote: ‘I, for example, am not in favor, have never been in favor of raising the minimum wage,’\" Sanders said.", "We wondered if that was true, and it is. It’s worth clarifying that this is no longer Bloomberg’s position in 2020.", "Bloomberg supports raising the federal minimum wage to $15 an hour, up from $7.25, putting him in line with the rest of his primary opponents.", "RELATED: Who led the way for a $15 minimum wage in New York?", "RELATED: Fact-checking Bernie Sanders on a $15 minimum wage", "In 2015, Bloomberg spoke against raising the minimum wage:", "\"I, for example, am not in favor, have never been in favor of raising the minimum wage,\" Bloomberg said on the Bloomberg TV channel. (Sanders quoted him accurately.)", "Bloomberg went on to describe what he would support: raising the Earned Income Tax Credit. Doing so, he said, would reduce the burden on employers and protect jobs.", "\"I think you should raise the income tax credit, which does the same thing for the same people, but it spreads the burden across all the taxpayers rather than just a small number of businesspeople whose inclination would be to cut back employment. Earned Income Tax Credit doesn’t get anybody to cut back, it gets them to hire more people.\"", "The federal Earned Income Tax Credit reduces taxes for low- and moderate-income working people. About 29 states have passed their own earned-income tax credit. While mayor in 2004, Bloomberg signed legislation starting a local tax credit.", "In 2018, Bloomberg again called for using the tax credit rather than hiking the minimum wage. During an interview with Christine Lagarde of the International Monetary Fund, he repeated his concern that a hike in the minimum wage would lead to job losses. (The Congressional Budget Office has found far more people would receive wage hikes than likely lose their jobs under a national increase to $15 an hour.)", "Bloomberg’s support for the tax credit rather than a rise in the minimum wage is shared by some experts. However, others say the two policies can work in tandem, and both could help poor workers.", "While Bloomberg spoke broadly against a minimum wage increase, in 2012 he did support raising the minimum wage in New York to $8.25 an hour. Also, Bloomberg had a mixed record on living-wage proposals to lift wages of certain workers who were employed by entities that had city contracts. When Bloomberg opposed such measures, he raised concerns about the cost for the city or the impact on economic development.", "During his 2020 campaign for president, Bloomberg has called for raising the minimum wage to $15 an hour. He also calls for enhancing the tax credit.", "Bloomberg’s labor plan says he will sign the Raise the Wage Act, which would raise the minimum wage gradually over six years to $15 an hour. The bill passed the House in July 2019 and has not had a vote in the Senate.", "The Bloomberg campaign did not explain the change of position. Bloomberg has not publicly addressed it, as far as we can tell.", "Sanders quoted Bloomberg as saying in 2015 that he had never supported raising the minimum wage.", "Bloomberg did make that statement. He called for raising the Earned Income Tax Credit instead.", "Bloomberg changed his position in 2020. He now supports raising the federal minimum wage to $15 an hour over six years.", "With that clarification, we rate this statement Mostly True.", "Washington Post, Sanders steps up attacks on Bloomberg at candidates event in Nevada, Feb. 16, 2020", "Sen. Bernie Sanders, Tweet, Feb. 15, 2020", "Mike Bloomberg campaign website, All-in economy and labor plan, 2020 campaign", "Congress.gov, H.R.582 - Raise the Wage Act, 2019", "Bloomberg TV, Michael Bloomberg: I've Never Supported Raising Minimum Wage, July 29, 2015", "IMF, One-on-One with Christine Lagarde, Featuring Michael Bloomberg, April 19, 2018", "NY Intelligencer, Michael Bloomberg Defended Fingerprinting Food-Stamp Recipients in 2018 Interview, Feb. 13, 2020", "NY1, Bloomberg Now Backs a $15 Minimum Wage — a Change in Stance, Dec. 11, 2019", "New York Times, Michael Bloomberg’s Jobs Plan Is Focused on Place Over Class, Jan. 8, 2020", "CNN, Sanders: Bloomberg with 'all his money' will not create the excitement needed to beat Trump, Feb. 16, 2020", "University of New Hampshire, The Interaction Between the Minimum Wage and the Federal EITC, Nov. 13, 2018", "New York City, Mayor Michael R. Bloomberg Signs Legislation Authorizing Eitc For City Residents, July 29, 2004", "Empire Center, Making Work Pay in New York, April 18, 2012", "New York Times, Bloomberg Backs Effort to Raise Minimum Wage, Jan. 12, 2012", "New York Times, Bloomberg Sues Council to Overturn 2 Wage Laws, July 27, 2012", "New York Times, Council Offers Compromise On 'Living Wage' Measure, Oct. 30, 2012", "Times Union, Bloomberg signs living wage bill, Nov. 28, 2002", "Brennan Center, Mayor Bloomberg Signs New York City Living Wage Law, Nov. 27, 2002", "New York Post, Fed-up Mike vetoes council's wage bill, April 26, 2012", "Center on Budget and Policy Priorities, Policy Basics: The Earned Income Tax Credit, Dec. 10, 2019", "Economic Policy Institute, The EITC and minimum wage work together to reduce poverty and raise incomes, Jan. 22, 2020", "Cornell University professor Richard Burkhauser, The minimum wage versus the earned income tax credit for reducing poverty, May 2015", "Politico, Minimum wage, Jan. 8, 2020", "Washington Post, Minimum wage question, 2020 campaign cycle", "Congressional Budget Office, The Effects on Employment and Family Income of Increasing the Federal Minimum Wage, 2019", "Email interview, Josh Orton, Sen. Bernie Sanders campaign spokesman, Feb. 17, 2020", "Email interview, Stu Loeser, Mike Bloomberg campaign spokesman, Feb. 17, 2020", "Email interview, Jess Carson, Research Assistant Professor of Public Policy at the University of New Hampshire, Feb. 17, 2020", "Email interview, Elaine Maag, principal research associate in the Urban-Brookings Tax Policy Center, Feb. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]