["About this rating", "Awareness of the problem and patterns of human trafficking has increased significantly in recent years, leading to efforts to train those who work in fields that often intersect with that form of crime -- such as the lodging and transportation industries -- to be aware of the common signs of human trafficking activity. Groups such as Airline Ambassadors International (AAI) and the International Air Transport Association (IATA), for example, help educate flight attendants to keep an eye out for passengers (particularly youngsters) who exhibit the following potential signs of being victims of traffickers:", "Is the person disoriented or confused, or showing signs of mental or physical abuse?", "Is the person fearful, timid, or submissive, and do they avoid eye contact?", "Does the person show signs of having been denied food, water, sleep, or medical care?", "Does the passenger defer to another person to speak for him or her, or to someone who seems to be in control of the situation (e.g., controls where they go or whom they talk to)?", "Is the passenger (especially in the case of children) accompanied by someone claiming to be a parent or guardian who is in fact not related to him/her?", "Is the passenger in control of his/her own travel documents?", "Does the person have freedom of movement?", "Is the passenger wearing appropriate clothing for the travel route or destination weather?", "Is the person speaking of a modelling, dancing, singing, hospitality job, etc., without knowing who will be meeting him/her upon arrival, and with few details about the job?", "That awareness reportedly paid off in the case of Alaska Airlines flight attendant Shelia Fedrick, whose reported quick thinking in helping to assist a trafficking victim on a flight in 2011 has since been immortalized in a social media meme:", "A flight attendant named Shelia Fredrick noticed a terrified girl on a flight accompanied by an older man. Fredrick discreetly told the girl to go to the bathroom, where she had left a note asking if she was OK. The girl wrote on the note, \"I need help.\" The police were waiting when the planed landed and girl was saved from a human trafficker.", "Public knowledge of Fedrick's supposed thwarting of a human trafficking event and rescuing of a young female victim came almost exclusively from a glowing February 2017 NBC News account:", "Shelia Fedrick said she instinctively felt something was wrong the moment she saw the girl with greasy blonde hair sitting in the window seat of aisle 10 on a flight from Seattle to San Francisco.", "The girl “looked like she had been through pure hell,” said Fedrick, 49, a flight attendant working for Alaska Airlines. Fedrick guessed that the girl was about 14 or 15 years old, travelling with a notably well-dressed older man. The stark contrast between the two set off alarm bells in her head.", "Fedrick tried to engage them in conversation, but the man became defensive, she said.", "\"I left a note in one of the bathrooms,\" Fedrick said. \"She wrote back on the note and said 'I need help.'\"", "Fedrick says she called the pilot and told him about the passengers, and when the plane landed, police were waiting in the terminal.", "Such news reports seemed to be straightforward and heartwarming accounts of one very tangible success stemming from human trafficking awareness training among flight crews, one that most readers accepted at face value. Other more skeptical commenters, however, expressed curiosity that all the reporting on the occurrence seemed to stem from a single source (NBC News), the incident didn't hit the news until six years after it took place, accounts of the tale lacked resolution, and the story's details proved impossible to independently verify.", "For example, when aviation and travel journalist Christine Negroni reported on an incident in which a couple traveling by air with their adoptive daughter were wrongly suspected of being human traffickers by a flight attendant, she noted of the Shelia Fedrick case that:", "... AAI promoted the story of an Alaska Airlines flight attendant who claimed to have spotted a suspicious pair of travelers on a flight from Seattle and alerted authorities. According to the account, police boarded the plane at San Francisco International Airport and took the male suspect into custody.", "\"Its happening every day on airlines,\" AAI's president and founder Nancy Rivard told NBC News.", "The big problem with the story, though is that it may not be true. Alaska Airlines won't confirm it or answer any questions about it. It declined to contact the flight attendant, Shelia Fedrick, on my behalf. San Francisco Airport has no record of the event. As recently as last week, however, AAI was still promoting the story as proof that flight attendants can and do stop human trafficking.", "Writing in Reason, Elizabeth Nolan Brown observed that 2017 news coverage of the then six-year-old incident seemed to come out of the blue, and the timing appeared more than coincidental:", "Fedrick's 2011 experience didn't just happen into the 2017 media by accident. Her story is part of a campaign from Airline Ambassadors International, whose staff was in Houston to train flight attendants ahead of the [2017] Super Bowl. Like many groups focused on the issue, AAI used the myth of a sports-related sex trafficking boom to permeate the Super Bowl news-cycle.", "When the Super Bowl was held in San Francisco, in 2016, the airport teamed up with Airport Ambassadors International and others for employee training on human trafficking awareness. None of the materials promoting this event mention any previous trafficking busts at the airport based on flight-attendant tips. Similarly, the DHS [Department of Homeland Security] made a big production of standing up to human trafficking in San Francisco during last year's Super Bowl, including efforts to train airline and airport staff on stopping it, but these materials also failed to mention a previous airline-assisted trafficker bust in the area.", "DHS did, however, note the new slogan for its Super Bowl-related campaign: \"If you see something, say something.\" It's the same message Fedrick emphasizes at the end of her NBC segment.", "Brown, like Negroni before her, also noted that news reports of the girl's supposed in-flight rescue from human traffickers were scant on detail and follow-up, and that none of the entities involved with the story -- such as the San Francisco police, the San Francisco airport, Alaska airlines, or the flight attendant herself -- would or could provide any corroborating information:", "The story of this \"hero flight attendant\" and the group she represented quickly spread from tabloid outlets like the Daily Mail to the pages of The New York Times and BBC News. But each new iteration failed to produce additional facts. There was no follow-up on where the alleged trafficker had come from, what happened to him after the flight -- arrest? prosecution? prison? -- or data on how often law enforcement responds to in-flight staff tips. (There were also many misreports that Fedrick's tale coincided with [the 2016] Super Bowl in San Francisco, though it happened years earlier.)", "The hero of all this hoopla, 49-year-old Shelia Fedrick, has been an Alaska Airlines flight attendant for 10 years. She also lists model and actress on online resumes and talent-portfolios. Beyond this, Fedrick has little online trail, and my attempts to reach her were unsuccessful.", "NBC notes that the girl in Fedrick's story is now in college, but it does not say what happened to her alleged trafficker. Whatever happened to him, the dramatic incident received little public attention in 2011. While the news that year is full of stories about a man arrested at the San Francisco International Airport for wearing baggy pants, plus stories about local efforts to stop sex trafficking, none mention a human trafficker apprehended at a Bay Area airport that year. The San Francisco Police Department's (SFPD) web archives turn up similarly scant results. And nothing fitting the description is mentioned in a statewide 2012 report about successful anti-trafficking efforts in the previous year.", "[N]o one will provide any specifics, nor even confirm or deny that the incident occurred. The SFPD told me to contact the airport about it; the airport never got back to me. Alaska Airlines took two days to tell me that out of respect for customer privacy, it couldn't provide any comment.", "Not only was news reporting on this incident lacking any information about the perpetrator and his fate, but about the putative victim as well. How old was she? Where was she from? How did she come to fall into the hands of a human trafficker? (Was she abducted, a runaway, or an adventurous youngster lured by the promise of an enticing job?) Why was the young woman — said to now be a college-age adult who remains in touch with Ms. Fedrick — not seen or referenced (even anonymously) in the story at all?", "Like those before us, we have also been stymied in our attempts to obtain any verifying information about the 2011 human trafficking episode. Alaska Airlines told us that they \"cannot comment on that incident\" and that they can't put us in touch with Shelia because she \"no longer works for Alaska.\" Kalhan Rosenblatt (who did the original reporting on Shelia Fedrick for NBC News) hasn't responded to our request for comment. We also contacted Christine Negroni and Elizabeth Nolan Brown to find out if either had learned anything more about the story since the publication of their original skeptical reports, and they both told us that corroboration remained elusive.", "Perhaps, as Brown suggested, this tale has some elements of truth to it, but the lack of detail indicates the outcome of the case might not have matched the positive one readers were left to assume:", "The lack of a public trail related to Fedrick's suspect certainly doesn't mean her story didn't happen. But it does suggest it wasn't quite the big-time catch it's being portrayed as. Perhaps it was even a big misunderstanding -- a teen traveling with her dad, a young but adult woman traveling with an older boyfriend, someone else writing back on that bathroom note. Or perhaps Fredrick really did save a teen in danger, but authorities botched the case somehow.", "Either way, as she concluded, \"We can't know, because no one will provide any specifics, nor even confirm or deny that the incident occurred.\"", "Negroni, Christine.   \"Dad Questioned After Southwest Flight Attendant Suspects Human Trafficking.\"\r\n    Forbes.com.   22 December 2017.", "Fortin, Jacey.   \"Flight Attendants Fight Human Trafficking with Eyes in the Sky.\"\r\n    The New York Times.   7 February 2017.", "Brown, Elizabeth Nolan.   \"How a Heartwarming 'Hero Flight Attendant' Meme Helps Donald Trump Deport People.\"\r\n    Reason.   9 February 2017.", "Rosenblatt, Kalhan.   \"Flight Attendants Train to Spot Human Trafficking.\"\r\n    NBC News.   4 February 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]