["A Louisiana woman who used Gorilla Glue on her hair drew scorn from some corners of the internet, but not from the adhesive company. A recent image spreading on social media would have you think otherwise.", "\"We never thought we’d have to say this, but do not use our products on your f------ hair,\" reads what looks like a screenshot of a Feb. 7 tweet from a verified Gorilla Glue account that’s being shared on Facebook.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because this isn’t the real Gorilla Glue account.", "The Twitter handle in the screenshot being shared online is @Gorilla Glue, with a space between \"Gorilla\" and \"Glue\" that’s not actually possible in handles on the social media platform.", "The actual Gorilla Glue handle is @GorillaGlue with no space. And while the company account acknowledged the plight of Tessica Brown, the Louisiana woman who used the glue as hairspray, it didn’t make the statement that appears in the Facebook post.", "\"We are aware of the situation and we are very sorry to hear about the unfortunate incident that Miss Brown experienced using our Spray Adhesive on her hair,\" the account tweeted on Feb. 8. \"This is a unique situation because this product is not indicated for use in or on hair as it is considered permanent. Our spray adhesive states in the warning label, ‘do not swallow. Do not get in eyes, on skin or on clothing…’\"", "The statement ended by wishing Brown well and saying Gorilla Glue was glad to see she had received medical treatment for her injuries.", "We rate this Facebook post False.", "Facebook post, Feb. 10, 2021", "WDSU, Louisiana woman offered free plastic surgery after using Gorilla Glue as hair spray, Feb. 10, 2021", "Gorilla Glue Twitter account, visited Feb. 10, 2021", "Gorilla Glue tweet, Feb. 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]