["The claim was shared here on Facebook on January 8, 2021.", "The Korean language text overlay on the image translates to English as: “The Seoul Metropolitan Government used soil on the 7th since it has no money to purchase calcium chloride.", "“Its budget for 2020 is 39 trillion South Korean won.”", "39 trillion South Korean won is some $35 billion USD.", "The post’s Korean-lanuage caption translates to English as: “Such a great job. Used soil because they have no money to buy calcium chloride? Who is going to breathe all the dust then.”", "Calcium chloride is widely used by city authorities globally to clear snow and ice.", "Similar claims have been shared on Facebook here, here, here, here and here.", "However, the claim is false.", "A reverse image search on Google found the original photo was published here by South Korea’s Yonhap News Agency on March 16, 2008.", "The photo is captioned: \"A police helicopter delivers food to people trapped on a motorway.\"", "The Korean-language report is about thousands of people who were trapped on a motorway due to record snowfall.", "“The Supreme Court ruled that the Korea Expressway Corporation should compensate passengers who were trapped on the highway due to record snowfall in March 2004,” the article says.", "Seoul has calcium chloride", "Heo Yang-mi, an official from the Seoul Metropolitan Government’s Safety Management Office, said the city would not use soil to clear snow since they had adequate stocks of calcium chloride.", "“We only used 25 percent of our calcium chloride stock on January 6 and 7, 2021 when Seoul was hit by heavy snow,” Heo told AFP by phone.", "She added that Seoul’s budget for snow removal work in 2020, which covers early 2021 as well, was 4.8 billion South Korean won (4.36 million USD).", "The city’s total budget for 2020 is 39.52 trillion South Korean won, or 36 billion USD, according to figures released here.", "A cold snap brought heavy snow and strong winds to South Korea on January 6, 2021, causing public transport delays, traffic congestion and a spike in road accidents.", "City authorities were criticised for poor snow-clearing, which led the city’s acting mayor to publicly apologise.", "“Dear citizens of Seoul, snow removal work was not done properly on the evening of January 6 due to a sudden snowstorm of up to 13.7 centimetres and the first cold wave in three years,” said Seo Jung-hyup during an online press briefing on January 8, 2021.", "“We apologise for causing great inconvenience and concerns,” he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]