["About this rating", "Christ Church in Alexandria, Virginia is moving two plaques from 1870, one dedicated to George Washington, and the other to Robert E. Lee.", "The church is not removing the plaques, but relocating them, and they made that decision because of reaction to Lee (not Washington) and decided to move both plaques together because they were installed together.", "In late October 2017, several blog posts and news articles reported that Christ Church in Alexandria, Virginia was purportedly \"ripping out\" plaques dedicated to George Washington because it \"offends\" people.", "The Washington Times covered the claim on 27 October 2017, and the following day, Daily Caller reported:", "Christ Church in Alexandria, Va., where Washington became a founding member in 1773, will remove his memorial and a similar one to Robert E. Lee, the Washington Times reported. Church leaders say the memorials, which sit to the left and right of the altar, have become too divisive and might be discouraging parishioners from attending services.", "“The plaques in our sanctuary make some in our presence feel unsafe or unwelcome,” the church leaders said, according to the Washington Times. “Some visitors and guests who worship with us choose not to return because they receive an unintended message from the prominent presence of the plaques.”", "Stories mentioned the removal of a plaque dedicated to Robert E. Lee as something of a side note, with the Washington plaque's removal taking center stage. But a 29 October 2017 Alexandria Times piece reported that the decision appeared to originally have been predicated on the Lee plaque:", "The email said that, since both plaques were erected in 1870, they considered them together.", "“The Vestry believes that the memorial plaques to George Washington and Robert E. Lee should be considered together,” the email read. “The plaques were erected at the same time. They visually balance each other, maintaining the symmetry of our sanctuary. The men they memorialize are giants in our nation and were members of this parish. Robert E. Lee has taken an outsized symbolism in the national conversation about race and inclusion.”", "The Alexandria Times also included a link to an e-mail announcing the decision [PDF, archive], and portions omitted from reports noted that the decision appeared to hinge entirely on the Lee plaque:", "Today, the legacy of slavery and of the Confederacy is understood differently than it was in 1870. For some, Lee symbolizes the attempt to overthrow the Union and to preserve slavery. Today our country is trying once again to come to grips with the history of slavery and the subsequent disenfranchisement of people of color.", "[...]", "The plaques in our sanctuary make some in our presence feel unsafe or unwelcome. Some visitors and guests who worship with us choose not to return because they receive an unintended message from the prominent presence of the plaques.", "Although some news outlets reported that Christ Church in Alexandria planned to remove the Washington plaque because it might \"offend\" people, information obtained directly from its lengthy statement makes it clear that the Washington plaque's removal was because of its placement. The church stated that both plaques would be removed to a prominent location, \"fully visible to parishioners and tourists alike.\"", "Framing the decision on the concept that a plaque dedicated to George Washington offended parishioners misconstrues the church's lengthy announcement explaining it was due to Lee's place in history, and evolving views of the Confederacy.", "We contacted a representative for Alexandria's Christ Church, but have not yet received a response.", "Dinan, Stephen.   \"George Washington’s Church To Tear Down Memorial Honoring First President.\"\r\n    Washington Times.   27 October 2017.", "Epitropoulos, Alexa.   \"Christ Church Announces Plans To Relocate Washington, Lee Plaques.\"\r\n    Alexandria Times.   29 October 2017.", "Racke, Will.   \"George Washington’s Church Is Going To Rip Out His Memorial.\"\r\n    Daily Caller.   28 October 2017.", "Fox News Insider.   \"George Washington's Church Says Plaque Honoring First President Must Come Down.\"\r\n    28 October 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]