["Coronavirus (CoV) is the latest pandemic that has emerged from Wuhan, China and has spread to over 24 countries including India. New research has estimated that over 371 people have died, exceeding the count of the previous SARS outbreak, while more than 75,000 people have been infected just in Wuhan. Recently, three cases of CoV infection were confirmed in Kerala and three suspected cases were reported in Delhi. Countries such as Russia have closed borders from China to prevent the spread of this infection.", "The infection from CoV resembles other respiratory tract infections, hence can be hard to isolate from the common flu. It spreads from respiratory fluids such as coughs and sneezes, similar to influenza and other respiratory tracts’ infections. The extent of the infection has ranged from a mild cough to severely sick and dying due to the infection. Common symptoms include cough, fever, shortness of breath (dyspnea), and occasional diarrhoea. Currently, there are no vaccines for this infection and preventative measures are best to contain the spread of the infection.", "The Government of India released an advisory via PIB on January 29, 2020.", "Advisory to recess the symptoms of respiratory tract in possible Corona virus infected cases", "Read the detailed advisory:https://t.co/hApX41NPx7", "— PIB India (@PIB_India) January 29, 2020", "“As per the Unani Practices the following Preventive Management Steps are suggested. Prepare decoction by boiling Behidana (Cydonia Oblonga) 3gm, Unnab Zizyphus (Jujube Linn) 5nos, Sapistan (Cordia Myxa Linn) 7nos in 1 litre water until it reduces to half. Store it in a bottle and take sips as and when required. For prophylactic measures immune system need to be strengthened for this purpose Khamira Marwareed 3-5 gm once a day may be taken,” advises the Ministry of AYUSH.", "False", "Alt News sci-checked each of the components in the claim within the Unani papers to evaluate if the claims of prophylactic, preventative measures for CoV, or any other respiratory infections, hold true.", "While no research data was found in human studies that could determine the efficacy of ‘Behidana’ either preventatively, or as a symptomatic treatment for CoV/flu-like infections. There were several general pre-clinical and review papers of Behidana (Cydonia Oblonga).", "The most prominent one was a review article from Pakistan by Ashraf and colleagues in 2016, that suggested the uses of ‘Behidana’ (Cydonia Oblonga) or Quince. We specifically searched for any research conducted on respiratory problems within this review paper. It claimed that Quince can treat respiratory tract disorders including cold sores, rhinitis and cough as per Nadkarni, 1976 and Duke et al., 2002, amongst many other diseases.", "Nadkarni, 1976 is the ‘Indian Materia Medica book for Ayurvedic, Unani, allopathic, homeopathic, naturopathic and home remedies’ that listed Quince, once, as a ‘popular remedy’ on page 1038, section 2079, under ‘Pyrus Cydonia’. Similarly, Duke et al 2002, is another ‘handbook of medicinal herbs’ by the American botanist James Duke, again devoid of any research data.", "Thus, there is no research for Behidana as an asymptomatic or preventative treatment for flu-like symptoms, only reviews with opinions that suggest it is a ‘popular remedy’.", "We found one Unani review article in the ‘World Journal of Pharmaceutical Research’ that detailed the benefits of ‘Unnab’ (red date) in a concoction. The article was published by Talib and colleagues by Jamia Hamdard, School of Unani Medicine in 2017, and listed the benefits (or “Mawaq-e-Istemal”) related to respiratory problems as below:", "“Constipation, Dry cough, Sore throat, Busoor (skin eruptions).[39, 40]”", "When we checked the references, 39 and 40 quoted in the review papers, they did not turn out to be published research articles or book chapters based on Unani research. Thus, again, no research evidence was found that studied Unnab (red dates) for flu-like symptoms.", "We found a prominent review article that discussed the role of ‘Sapistan’ in symptomatic treatments for respiratory diseases by Al-Snafi (2016) from Thi Qar University, Iraq. Studying the section on respiratory benefits, they claimed that Cordia Myxa relaxed the smooth muscles of the trachea in sheep and cited the Al-Bayaty (2008) paper. Neither the review (2016) nor the 2008 paper referred to any human studies with symptoms of the respiratory tract, thus giving no researched evidence to support Sapistan as an effective symptomatic treatment for respiratory diseases.", "No studies were found assessing the role of ‘Khamira Marwareed’ for immune or respiratory function as claimed by the AYUSH advisory. However, some reviews suggested it could be cardio-protective, the evidence for which was not studied due to lack of relevance. Again, no evidence was found to suggest the efficacy of Khamira Marwareed in changing immune or respiratory functions.", "Thus, no scientific evidence as research data was found corresponding to the Unani herbs advised by the AYUSH Ministry that would help to back their claim on Unani formulations for preventative or symptomatic treatments for Coronavirus. We also checked the corresponding scientific names of these herbs in fruitless efforts for obtaining data in the evidence-based literature.", "Unlike the information provided in the advisory by the Government of India, Unani can provide neither symptomatic nor preventative treatment for CoV infections or any other respiratory tract diseases.", "Ashraf, M. U., Muhammad, G., Hussain, M. A., & Bukhari, S. N. (2016). Cydonia oblonga M., a medicinal plant rich in phytonutrients for pharmaceuticals. Frontiers in pharmacology, 7, 163.", "Nadkarni, K. M. (Ed.). (1996). [Indian materia medica]; Dr. KM Nadkarni’s Indian materia medica: with Ayurvedic, Unani-Tibbi, Siddha, allopathic, homeopathic, naturopathic & home remedies, appendices & indexes. 1 (Vol. 1). Popular Prakashan.", "Duke, J. A., Bogenschutz-Godwin, M. J., Ducelliar, J., and Duke, P. A. K. (2002). Handbook of Medicinal Herbs, 2nd Edn. Boca Raton, FL: CRC Press.", "Talib, M., Aslam, M., Ahmad, A., Asif, M., Qamar, W., & Chaudhary, S. (2017). An overview of a honeyed Unani blood purifier: Sharbat Unnab.", "Al-Snafi, A. E. (2016). The Pharmacological and therapeutic importance of Cordia myxa-A review. IOSR Journal of Pharmacy, 6(6), 47-57.", "AlBayaty, M. A., & AlTahan, F. J. A. F. J. (2008). Mechanism of the tracheal smooth muscle relaxant activity of the Cordia myxa plant extract in sheep. The Iraqi Journal of Veterinary Medicine, 32(2), 214-226.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]