["About this rating", "When the results began coming in from the 30 March 2005 Powerball drawing, lottery officials suspected fraud was underway. Although only one winner qualified for the $13.8 million jackpot, a record 110 players were claiming second prizes of either $100,000 or $500,000 (depending on whether they'd paid an extra dollar for the Power Play option that multiplies a win) for having matched the first five of the six numbers drawn. Normally the lottery, which is held across 29 states, pays out only about four or five second-place prizes.", "Having 110 claimants of second-place money appeared highly suspect. Yet it turned out no chicanery had been afoot: the unexpected result had been just the way the cookie crumbled.", "The roughly one-in-three-million combination of 22, 28, 32, 33, and 39 had been selected by so many hopeful lotto players because it had been the set of \"lucky numbers\" given to them in their fortune cookies. (The cookies missed on having all six winning numbers by a mere matter of recommending 40 rather than 42 as the red Powerball number.)", "The sagacious confections had been manufactured at Wonton Food Inc. of Long Island City in Queens, New York. That factory produces four million fortune cookies a day vended under a variety of brands, which is how the cookies came to influence lottery players in so many states.", "Stunned lottery officials heard time and again from the second-place winners that they'd gotten their numbers from cookies. Additional confirmation of the claim came from the lottery tickets themselves: nearly all of them listed \"40\" as the Powerball number, and 40 had been the final of the six numbers given on the fortune cookie slips.", "While not everyone plays numbers that are suggested to them by external sources, a great many do. A March 2005 episode of television's Lost included a sequence of lottery numbers, and hundreds of viewers subsequently played that combination. It didn't win, though.", "While fortune hunting via fortune cookie might now seem a prime idea, it needs be kept in mind that the lone winning combination that grabbed the $13.8 million Powerball jackpot on 31 March 2005 came not from an after-dinner amusement at a Chinese restaurant, but rather from a computer: it had been a computer-generated quick pick.", "Lee, Jennifer.   \"Who Needs Giacomo? Bet on the Fortune Cookie.\"\r\n    The New York Times.   11 May 2005   (p. A1).", "Lorentzen, Amy.   \"Record Number of Powerball Winners, Thanks to Fortune Cookie.\"\r\n    Associated Press.   31 March 2005.", "[New York] Daily News.   12 May 2005   (p. 4).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]