["By Robert Farley", "Posted on June 9, 2020", "In remarks about SARS-CoV-2, President Donald Trump wrongly said China “stopped it cold” from spreading from Wuhan to other parts of China “but they didn’t stop it cold from coming to the United States, Europe and the rest of the world.” Trump called that “a little strange deal,” promising to seek answers.", "But China did not stop the coronavirus from spreading from Wuhan, where it originated, to other parts of China. The number of reported cases and deaths in China’s major cities outside Wuhan have been far lower than the numbers in many European and American cities, but China also took extreme measures to slow the spread of the disease that the U.S. did not.", "In the past, Trump has wrongly speculated that China stopped flights from Wuhan to the rest of China while continuing to allow flights from Wuhan all over the world, including to the U.S. But as we wrote, that’s not accurate, either.", "More recently, Trump has not mentioned the stoppage of flights, but has simply said China suspiciously has not been hit as hard by the coronavirus as Europe and the U.S.", "In a Fox News Radio interview on June 3, Trump asked why the coronavirus that came out of Wuhan “didn’t go to China but it went to the rest of the world,” including the U.S. Trump then attributed it to a purposeful act by China.", "Trump, June 3: And I ask this, “Why is it Wuhan, it came out of Wuhan. Why is it that it didn’t go to China but it went to the rest of the world? It went to Europe. It went to the world. It went to the United States. But it didn’t go to Beijing. It didn’t go to other parts of China. What’s that all about? So how come they let it go out to the world, but they didn’t let it go into China. That’s a little strange deal going on there.”", "In a press conference on June 8, Trump made similar comments.", "Trump, June 8: And you do say, “How come at Wuhan, where it started …” And they were very badly — they were in bad trouble. But it didn’t go to any other parts. It didn’t go to Beijing. It didn’t go to other parts of China. Then you say, “How come it came out to Europe, to the world, to the United States?” So it didn’t go to China; they stopped it cold. They knew it was a problem. But they didn’t stop it cold from coming to the United States, Europe and the rest of the world. Somebody has to ask these questions, and we’ll get down to the answer.", "Many questions have been raised about China’s response to the coronavirus, and whether its leaders downplayed the threat or withheld information from world health officials. An in-depth report from the Associated Press on June 3 concluded that China delayed the release of coronavirus information to the World Health Organization, including the genome sequence of the virus. And, the article said, this lack of transparency came at a critical time, when it might have been possible to change the trajectory of the coronavirus death toll.", "But Trump’s claim that China was able to stop the coronavirus “cold” from spreading outside Wuhan to other parts of China is inaccurate.", "According to World Health Organization data, there were 81,048 confirmed cases in China of COVID-19, the disease caused by the SARS-CoV-2 virus, as of March 15. While the vast majority of those cases were in Hubei province, which includes Wuhan, there were 13,254 cases outside Hubei (including 119 people who died). As for Beijing specifically, which the president mentioned, there were 442 confirmed cases and eight deaths by March 15.", "As of that date, China led the world by far in the number of confirmed cases, while the U.S. had 5,702 confirmed cases, according to Johns Hopkins University’s Coronavirus Resource Center. In other words, at that time, there were more than double the number of confirmed coronavirus cases in China, outside Hubei, than there were in the U.S.", "In the following weeks, however, the picture changed dramatically, with cases in Europe and the U.S. spiraling upwards, and overtaking the number of confirmed cases in China (where the figures remained fairly constant).", "We should note that Trump has questioned the data on cases coming from China. As the U.S. tally overtook China’s later in March, Trump said the U.S. numbers were “a tribute to our testing,” and he questioned the veracity of figures coming from China.", "Trump, March 26: You know, number one, you don’t know what the numbers are in China. China tells you numbers, and — I’m speaking to President Xi tonight, I believe, and we’ll have a good conversation, I’m sure. But you just don’t know, you know, what are the numbers.", "Trump isn’t alone in doubting China’s reported figures. A study from academics at the Hong Kong University School of Public Health, published in the Lancet, found that changing case definitions for COVID-19 by Chinese authorities led to a major undercount early in the outbreak. According to their research, although China reported about 55,500 confirmed cases on Feb. 20, the likely number of infections at that date was four times as high.", "Even still, the confirmed cases in the U.S. have far surpassed the reported number of cases in China.", "On June 9, as the number of confirmed cases in the U.S. approached 2 million, the number of reported cases in China — just over 84,000, including 594 cases and nine deaths in Beijing — hadn’t risen much from the reported figure in mid-March, according to data from Johns Hopkins.", "Experts say the reason for that is less nefarious than Trump’s comments suggest.", "According to research published in the Lancet on April 8, China implemented “massive public health interventions” in late January that helped to stem the spread of the virus. Those measures worked, researchers concluded. “The findings from our modelling impact assessment suggest that the comprehensive package of non-pharmaceutical interventions China undertook, including social distancing and population behavioural change, has substantially reduced transmissibility of COVID-19 across the country,” the authors wrote.", "On Jan. 23, China imposed severe travel restrictions on Wuhan, halting train and air travel from the bustling city of 11 million people.", "In late April and early May, Trump floated the flawed theory that China continued to allow flights out of Wuhan to Western cities while blocking flights into other cities in China. Specifically, the president claimed China stopped travel from Wuhan to other parts of China even as it allowed flights from Wuhan to Europe and the U.S. But as we wrote, that’s not accurate.", "There is no evidence any commercial flights left Wuhan for Western destinations after Jan. 23, other than some repatriation flights chartered by foreign governments, such as U.S. evacuation flights for American citizens, including diplomats and their families.", "Niall Ferguson, a Harvard professor who first raised questions about China’s flights out of Wuhan to international destinations, later updated his column to acknowledge that flight data did not confirm that China continued to allow commercial flights to various international destinations, including the U.S., after Jan. 23. And further research by Ferguson concluded that while a half dozen flights left Wuhan for destinations in Asia outside China, “only crew members appear to have been aboard these flights … confirm[ing] that the authorities did prevent Chinese citizens from flying from Wuhan to foreign destinations after January 23.”", "In addition to locking down Wuhan, China at the same time enacted “stringent social distancing measures and mobility restrictions” in most of China’s largest cities, according to the research published in the Lancet. Schools were closed, and “only residents were allowed to enter residential communities, face mask-wearing was made compulsory, and non-essential community services were shut down.”", "By contrast, Trump issued “Coronavirus Guidelines for America” for the following 15 days on March 16 (nearly two months after China’s announced measures), in which he urged “all Americans, including the young and healthy, [to] work to engage in schooling from home when possible. Avoid gathering in groups of more than 10 people. Avoid discretionary travel. And avoid eating and drinking at bars, restaurants, and public food courts.” Those guidelines — which were later extended to April 30 — were not orders. Numerous states, however, did issue mandatory orders, including school and non-essential business closures. Constitutional experts told us states, not the president, have the authority for such stay-at-home orders.", "In an April 3 coronavirus task force briefing, Trump noted that the Centers for Disease Control and Prevention was recommending that Americans wear a cloth or fabric mask to limit the spread of the virus. Trump stressed that the CDC recommendation was “a voluntary thing.”", "“You can do it. You don’t have to do it,” Trump said. “I’m choosing not to do it, but some people may want to do it, and that’s okay.”", "The CDC said the recommendation came as new studies showed “a significant portion of individuals with coronavirus lack symptoms (‘asymptomatic’) and that even those who eventually develop symptoms (‘pre-symptomatic’) can transmit the virus to others before showing symptoms.”", "“A cloth face covering is not intended to protect the wearer, but may prevent the spread of virus from the wearer to others,” the updated CDC website now reads. “This would be especially important in the event that someone is infected but does not have symptoms.”", "As we said earlier, China instituted mandatory mask-wearing in public in late January. It also enacted stringent stay-at-home orders.", "Research from Columbia University epidemiologists posted in late May concluded that the U.S.’s delay in implementing social distancing cost lives. According to their estimates, if social distancing measures had been implemented just a week prior than they were in mid-March about 36,000 fewer people would have died; and if such measures had been implemented two weeks prior, about 54,000 fewer people would have died.", "Jeffrey Shaman, an epidemiologist at Columbia University’s Mailman School of Public Health who led the study, told us Trump’s comments about China stopping the virus cold in its own country while allowing it to “go out to the world” are “absurd and highlight our own inability to control the virus.”", "“If we believe the case and death numbers coming from China, then the differences are due to the effectiveness of the control that China imposed,” Shaman said in an email. “China is an authoritarian regime, they shut down travel on January 23rd to and from Wuhan and ultimately put 750M citizens around the country under enforced shelter-in-place. This disrupted transmission and drove the reproductive number and incidence down.", "“The government built apps that Chinese citizens must use to gain access (by QR scan) to common locations (buses, shops, etc.)—individuals have to scan everywhere they go now, and the scan then reads out a color indicating whether the individual can enter,” he added. “They perform screening and temperature checks at a very high rate, quarantine incoming travelers, isolate infections, and use the app to identify individuals who may have been exposed to infection and if so quarantine them. They use technology and their authoritarian powers to control the virus. We are doing neither.”", "A recent study – which has been accepted for publication in Nature – on the effectiveness of pandemic control policies enacted by various countries concluded that non-pharmaceutical interventions greatly reduced the number of infections. For China, the research group estimated there would be about 465 times the number of confirmed cases if “large-scale anti-contagion polices had not been deployed.” For the U.S., the estimate was that confirmed cases would have been 14 times greater if not for its policy interventions.", "“Consistent with process-based simulations of COVID-19 infections, our analysis of existing policies indicates that seemingly small delays in policy deployment likely produced dramatically different health outcomes,” the authors wrote.", "Again, much has yet to be learned about China’s response to the coronavirus and what it communicated to world health officials. But, contrary to Trump’s claim, the virus did spread outside Wuhan to other parts of China, according to figures provided by Chinese authorities (and which some experts believe to be undercounts).", "That the virus did not spread as widely in China as it did in other countries, including the U.S., is largely the result of extreme measures taken by the Chinese government to control its spread, experts said. Europe and the U.S., experts said, did not implement measures as stringent as China did, and the ones they did implement were not enacted as early.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]