["Democratic presidential candidate Joe Biden speaks at a drive-in campaign stop at Bucks County Community College in Bristol, Pa., Oct. 24, 2020. (AP)", "Recent Facebook posts claimed Democratic presidential nominee Joe Biden was caught insulting President Donald Trump’s supporters, but they took his comments out of context.", "\"Joe Biden calls Pennsylvania voters who don’t support him ‘chumps,’\" the posts said.", "They were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On Oct. 24, Biden held a rally at a parking lot in Bucks County, Pa., north of Philadelphia, when Trump supporters could be heard \"making a ruckus from a short distance away,\" according to the Associated Press.", "CNN reported that the Trump supporters were playing music, honking and shouting \"four more years\" as the former vice president spoke. In this video, tweeted by a CNN correspondent, Biden can be heard amid the din. He could also hear the noise, and addressed it.", "Around the 22:15 mark of this video, honking can be heard in the background as Biden says: \"I am running as a proud Democrat, but I will govern as an American president for everybody. I’ll work as hard for those who don’t support me as those who do, including those chumps at the microphone out there.\"", "So Biden did call some of Trump’s supporters \"chumps\" during a rally in Pennsylvania.  But the claim in the Facebook post that Biden calls Pennsylvania voters who don’t support him \"chumps\" gives the impression that Biden was denouncing all such voters who don’t cast a ballot for him. That’s not the case.", "He was referring to a very specific group of people — those disrupting his speech — and not all of the president’s supporters in the state. And his comments came as he was saying that he would be a president for all Americans, not just those who support him.", "We rate this Facebook post Mostly False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Oct. 26, 2020", "Facebook post, Oct. 25, 2020", "The Associated Press, The latest: Pence’s top aide tests positive for coronavirus, Oct. 29, 2020", "CNN tweet, Oct. 24, 2020", "CNN, Impromptu Trump rally seen outside Biden event in Pennsylvania, Oct. 24, 2020", "MJ Lee tweet, Oct. 24, 2020", "YouTube, Joe Biden Bucks County speech, Oct. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]