["The world has started paying attention to the #KashmirIssue and that itself is a diplomatic win for Pakistan. Our only aim is to make the Kashmiri voices heard despite Modi’s attempts to silence them through media blackout in Kashmir. Today in @nytimes! #ImranKhanVoiceOfKashmir", "The above message has been tweeted by the official handle of Pakistan Tehreek-e-Insaf (PTI), the political party headed by Pakistan PM Imran Khan. Along with the message, an image of what appears to be the front page of The New York Times has been posted. The tweet is now deleted.", "The text on the newspaper targets the Indian government over the issue of Kashmir. It reads, ‘Kashmir 8 Million under siege by a million soldiers since August 5th’ and ‘The seizing of Kashmir is blatant racism’. The image has been shared and retweeted by several Twitter users with the implication that The New York Times has given extensive coverage to the Kashmir issue and has highlighted the alleged human rights violations committed in the region since August 5.", "From the pages of today’s.@nytimes : #Kashmir 8 million under siege by a million soldiers since August 5th. #EndtheSiege pic.twitter.com/zykhmbwZml", "— Parthiban Shanmugam (@hollywoodcurry) September 27, 2019", "A close look at the image of the newspaper reveals that what has been portrayed as reportage by The New York Times, is actually a sponsored write-up. In the bottom left corner of the image, the words ‘Sponsored by International Humanitarian Foundation’ can be clearly seen.", "As can be seen above, a website- www.IHF-US.org, is also mentioned. Alt News looked up the website, and found that it was centered around the protest which took place over Prime Minister Narendra Modi’s recent event in Houston, Texas, although it described itself thus: “Our mission is to provide global relief and charitable services to vulnerable populations during normal times and also during complex emergencies like floods, drought, hurricanes, diseases, bioterrorism and war; to work with international, national, state, and local governments and other Nonprofit Organizations to collectively fight against complex global emergencies to provide livable global society for mankind.”", "There is very little information on the website about the ‘International Humanitarian Foundation’, although there is a registration and donation link. Meanwhile, the front page of The New York Times on September 28, has no coverage on Kashmir. It looks like this.", "However, the Kashmir issue did get front-page coverage on The New York Times on Aug 10, 2019.", "It may be noted that the image of The New York Times Newspaper for September 28, shared by several social media users, represents not the coverage on Kashmir by the newspaper, but a sponsored post.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]