["About this rating", "On Nov. 8, 2019, the Halfway Post published an article positing that a Russian copper company had purchased 70,000 copies of Donald Trump, Jr.'s new book \"Triggered\":", "A Russian Copper Company Bought 70,000 copies of Donald Trump Jr.’s New Book", "Pre-sales for Donald Trump Jr.s new memoir, “Triggered: A Boy of Destiny’s Crusade Against The Cuck Liberal Hollywood Elite & Rosie O’Donnell” skyrocketed to the top of the New York Times Best Seller List when a mysterious corporate buyer in a suburb of Moscow, Russia purchased 70,000 copies.", "The company, Russian Copper, is led by one of the top oligarchs in Moscow, Niko Deripaskov, a close friend and confidant to “President” Vladimir Putin, and the vast majority of the book’s total sales were billed to Russian Copper.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "A Gazette Of Halfway Real Satirical News", "We are a St. Louis rust belt press with a penchant for halfway true headlines.", "If a headline seems too outlandish to be true it’s probably because we made it up.", "The Halfway Post's satirical article was commenting on recent news reports of bulk purchases of the book. The book reached the top of the New York Times best-seller list in November 2019, but readers noted that the listing for \"Triggered\" was accompanied by a small \"dagger\" symbol.", "The New York Times explains the purpose of the \"dagger\" symbol on a FAQ page about the best-sellers list:", "Sales are defined as completed transactions by vendors and individual end users during the period on or after the official publication date of a title. Institutional, special interest, group or bulk purchases, if and when they are included, are at the discretion of The New York Times Best-Seller List Desk editors based on standards for inclusion that encompass proprietary vetting and audit protocols, corroborative reporting and other statistical determinations. When included, such bulk purchases appear with a dagger (†).", "While some individual or group made bulk purchases of the book, the claim that these purchases were made by a Russian company originated with a satire article.", "For background, here is why we sometimes write about satire/humor.", "The Halfway Post.   \"A Russian Copper Company Bought 70,000 copies of Donald Trump Jr.’s New Book.\"\r\n    15 November 2019.", "Flood, Amber.   \"Triggered, Donald Trump Jr's #1 Bestseller, Under Fire for Inflating Sales.\"\r\n    The Guardian.   15 November 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]