["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Officials held a groundbreaking ceremony in April for the new St. Petersburg Police Department headquarters at 1301 First Ave. N, across from the department's old, cramped offices. (Courtesy of St. Petersburg Police Department)", "Rick Baker has accused Mayor Rick Kriseman of spending wildly on a new police station, saying it's $35 million over budget.", "Kriseman, in contrast, says the project is actually under budget. \"We’ve got a police station that’s under construction right now, they are actually ahead of schedule and under budget,\" Kriseman told Beauty & The ‘Burg, a podcast on LifeImprovementRadio.com, on Aug. 9.", "That makes two competing narratives about the police station from the two leading candidates in the Aug. 29 mayoral primary. We wondered who was right — is the new police headquarters under budget, over budget, or none of the above?", "The upshot: It’s simply too soon to say anything about the budget and timeline for the construction of the new police department building.", "For over a decade, there have been plans to replace the city’s police building on 1300 First Ave. N.", "The old headquarters was built in multiple parts. The east side of the police station was opened in 1951 and it included a jail and additional space for police operations. The building on the west side was opened in 1978. Eventually, the jail located inside the east side building was shut down and inmates were sent to the Pinellas County jail.", "It was not until 2015 that Kriseman announced there was enough money to construct a new police headquarters. St. Petersburg plans to spend about $86 million on new police facilities. That includes $79 million for the headquarters and $6.5 million for a new shooting range.", "The building will be 167,500 square-feet and able to withstand a Category 4 hurricane.", "The groundbreaking ceremony for the new headquarters was in late April 2017. City officials estimated the project will be done in December 2018, and fully operational in spring 2019.", "Not really. The basis for Kriseman’s comment was the possibility of the city not tapping into a $1.4 million contingency fund for unexpected costs.", "\"The mayor's remarks were based on conversations with staff, who informed him that things are progressing well, no surprises, and that there is a chance we may not need all the contingency money and could finish under budget,\" said spokesman Ben Kirby. \"But there is a long way to go.\"", "City architect Raul Quintana said the amount of contingency dollars fluctuates during various points of the project.", "\"Generally, the earlier we are in a project and the greater the unknowns, then the higher the project contingency,\" Quintana said.", "Despite the possibility of not needing this money, Quintana said the nature of the project is very complicated, so the city plans to keep the contingency money in play.", "So, only four months in, it’s too soon to say the project is under budget with certainty. The construction contract with the Construction Manager is a little more than $61 million and the city has spent about $4 million.", "As for the timeline, Quintana said the project was ahead of schedule by at least three weeks and said he \"feels good\" about how the project has progressed.", "But with so much time to go, there are some factors that could affect the timeline, such as the weather.", "For the record, Baker's point that the project is massively over budget is also misleading. We're fact-checking what he said about the new police station in a separate fact-check to come.", "Baker’s campaign argued that Kriseman’s remarks were directly contradicted by reporting on the police station. They sent three news articles that allude to how the costs and plans have evolved over the years. But the stories don't refer to the project as either over budget.", "Here's what happened: In 2006, with Baker as mayor, the original estimate to replace the police station came in at $50 million. As the economic downturn set in, the city looked at other options, including building a scaled-down version while making updates to the old facility.", "However, after the economy picked back up, Kriseman announced the city would have enough money to build a new station again for $70 million.", "Jeff Forrest, the president of Winter Park Construction in Maitland, Fla., and someone used to handling big construction projects said it’s too premature to make claims about a project of this size being under or over budget. Same goes for the timeline.", "\"If I was building a project I would never communicate that early in a job because there’s just too many unknowns,\" Forrest said. \"There’s too many opportunities just to easily lose that time.\"", "He said there are a number of challenges including labor shortages in the construction industry and Florida’s volatile weather that could affect the timeline and costs of a project.", "\"We can all be optimistic. I’m an optimistic person, but I’m a realistic person when it comes to building and recognizing the challenges that exist,\" he said.", "Kriseman said construction on the new police station is \"ahead of schedule and under budget.\"", "In reality, there is no definitive evidence that supports Kriseman’s claim about being under budget, and the city’s architect estimates that the project is three weeks ahead of schedule.", "The most important thing to note in this check is the that the police station still has a long way to go and the progress could change. So any claims about the project being over or under budget or ahead of schedule are too premature.", "We rate this claim Mostly False.", "Email exchanges, Brigitta Shouppe, campaign spokeswoman for Rick Baker, Aug. 15", "Email exchanges, Jacob Smith, Rick Kriseman’s campaign manager, Aug. 16, 2017", "Email exchange, Ben Kirby, Kriseman spokesperson, Aug. 17 & 21, 2017", "Email exchanges, Raul Quintana, city architect, Aug. 18 & 21", "Interview, St. Petersburg Police Department spokesperson Yolanda Fernandez, Aug. 23, 2017", "Interviews, Kyle Parks, B2 communications, Aug. 23, 2017", "Interview, Jeff Forrest, president of Winter Park Construction, Aug. 23, 2017", "Tampa Bay Times, \"Editorial: How much is too much?\" Feb. 24, 2017", "Tampa Bay Times, \"Get the latest look at the St. Petersburg Police Department's new digs,\"", "Tampa Bay Times, \"St. Petersburg's new police HQ on track to be greener, but also pricier,\" Feb. 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]