["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A post that’s being shared widely on Instagram discourages people from getting a COVID-19 vaccine and instead advocates for \"naturopathic solutions.\"", "A man speaking in a video clip in the post mentions vitamin D, vitamin C \"and everything else from colloidal silver to the black seed oil — there are so many things that are killing this virus.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In May 2020, Glenn Grothman, a Republican congressman from Wisconsin, said that research illustrated a correlation between vitamin D deficiencies and higher COVID-19 mortality rates. We rated that True. And what’s more: early studies suggested that vitamin D could possibly curb the severity of COVID-19 symptoms and reduce mortality rates.", "But the latest research isn’t so hopeful on that front. A study from McGill University in Canada found no evidence that vitamin D supplements could improve coronavirus outcomes, Business Insider reported on March 10.", "And unlike earlier research into vitamin D deficiencies, another study from Aristotle University in Greece found no correlation between such deficiencies and higher mortality rates.", "Neither of these new studies has been peer-reviewed but as The Guardian noted, they reached the same conclusion: \"evidence for a direct link between vitamin D deficiency and Covid outcomes is lacking.\"", "In December, the National Institute for Health and Care Excellence in England published a rapid review of recent studies on vitamin D and COVID-19. Its conclusion: sufficient evidence to support using vitamin D supplements to prevent or treat COVID-19 is still lacking and should be further investigated, according to The Lancet.", "Back in January 2020, we rated False a claim that the coronavirus could be slowed or stopped with the \"immediate widespread use of high doses of vitamin C\" because there was no evidence that the supplement has any effect on the COVID-19.", "According to the National Foundation for Infectious Diseases, that’s still true today.", "In its COVID-19 treatment guidelines, last updated in November 2020, the National Institutes of Health notes that there is insufficient data to \"recommend either for or against the use of vitamin C\" for treating both critically ill and non-critically ill COVID-19 patients.", "Vitamin C is believed to benefit patients with severe and critical illnesses, according to the National Institutes of Health, but there have been no completed controlled trials of vitamin C in COVID-19 patients and \"the available observational data are sparse and inconclusive.\"", "Colloidal silver — a liquid that contains silver particles — is often billed as a cure for disease, but there isn’t scientific evidence to back that up.", "The U.S. Food and Drug Administration has said that it’s not safe or effective for treating any disease or condition, and the agency has issued warning letters to companies selling the product as a treatment or prevention for COVID-19.", "People selling black seed oil — extracted from Nigella sativa, or black cumin seeds — as a COVID-19 treatment have also come under federal scrutiny. In a May warning letter to a company encouraging consumers to fight the coronavirus with black seed oil, the U.S. Federal Trade Commission wrote that no reliable scientific evidence supported claims that black seed oil can prevent or treat COVID-19.", "The FDA has sent similar warning letters to companies selling black seed oil to treat or prevent COVID-19 as recently as September.", "The Journal of Pharmacopuncture, which is focused in part on alternative medicines, published an article in June on Nigella sativa as a \"potential herb for COVID-19,\" but its conclusion was far from the claim in the Instagram post, saying that such a supplement \"may reduce the adverse effects of conventional medicines\" but that randomized controlled trials were needed to determine any benefits in treating COVID-19 patients.", "A post on Instagram discourages people from getting a COVID-19 vaccine and instead advocates for \"naturopathic solutions,\" including vitamins D and C, colloidal silver and black seed oil.", "While research into some supplements like vitamin D has seemed promising, subsequent studies have questioned whether it can protect against COVID-19. And there’s no reliable scientific evidence to support the idea that vitamin D, vitamin C, colloidal silver or black seed oil can kill the coronavirus, as this post claims.", "Research to date shows COVID-19 vaccines available in the U.S. are safe and effective at preventing known and potential harms of becoming infected with COVID-19.", "We rate the claim in this post False.", "Instagram post, March 9, 2021", "PolitiFact, Glenn Grothman on target about tie between vitamin D and COVID-19, but vitamin D isn’t a known cure, June 8, 2020", "National Foundation for Infectious Diseases, COVID-19 social media graphics, visited March 10, 2021", "PolitiFact, No, vitamin C cannot slow or stop the spread of the coronavirus, Feb. 29, 2020", "Business Insider, Vitamin D may not help with severe COVID-19 cases, contrary to what researchers thought, Nov. 20, 2020", "Business Insider, Vitamin D may not be as protective against COVID-19 sa previously thought, new data suggest, March 10, 2021", "The Guardian, Vitamin D supplements may offer no Covid benefits, data suggests, March 9, 2021", "The Lancet, Vitamin D and COVID-19: why the controversy? Jan. 11, 2021", "National Institutes of Health, Vitamin C, last updated Nov. 3, 2020", "PolitiFact, No, a silver solution won’t cure the coronavirus, Feb. 12, 2020", "U.S. Food and Drug Administration, Coronavirus update: FDA and FTC warn seven companies selling fraudulent products that claim to treat or prevent COVID-19, March 9, 2020", "National Library of Medicine, The influence of pulsed electric fields and microwave pretreatments on some selected physicochemical properties of oil extracted from black cumin seed, Nov. 20, 2017", "U.S. Federal Trade Commission, Warning letter, May 1, 2020", "U.S. Food and Drug Administration, Fraudulent Coronavirus Disease 2019 (COVID-19) products, visited March 11, 2021", "Journal of Pharmacopuncture, Prophetic medicine — Nigella Sativa (black cumin seeds) — potential herb for COVID-19?, June 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]