["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Teenage offenders are led shackled into the C.A. Dillon Youth Development Center in Butner, N.C., in 2003. News & Observer photo.", "Wisconsin at one time was one of nine states in the nation in which 17 year-olds are  treated as adults in criminal justice system", "Legislative activity on the issue in recent years has changed that.", "In a July 2020 report, the National Conference of State Legislatures said that in 47 states, the maximum age of juvenile court jurisdiction is age 17.", "Three states -- Georgia, Texas and Wisconsin -- now draw the juvenile/adult line at age 16. Those who are 16 are not automatically tried as an adult, but those who have turned 17 are.", "One of the little-discussed aspects of Wisconsin Gov. Tony Evers 2021-22 budget is a series of proposed changes related to the juvenile justice system.", "Among them: Evers would raise the age for automatically charging someone as an adult from 17 to 18 — an idea Republican lawmakers rejected two years ago.", "In a Feb. 16, 2021 news release, state Rep. LaKeshia Myers, D-Milwaukee, commended Evers on the moves.", "\"By restructuring the Department of Corrections Division of Juvenile Corrections (DJC) to include older teenagers, we will end the practice of criminalizing young offenders and waiving them into adult prisons,\" Myers said. \"Wisconsin is one of only nine states in the nation in which 17 year-olds are automatically treated as adults in the criminal justice system.\"", "Is Myers correct? Not exactly.", "When asked to provide backup for the statement, Myers’ office directed us to several articles, including a Nov. 1, 2014 Wisconsin Bar Association piece titled \"Adults Only: Returning 17 year olds to Juvenile Court\" and an Oct. 19, 2015 Appleton Post Crescent article \"Lawmakers: Keep 17-year-olds from adult court.\"", "That article noted that a review showed \"Wisconsin is one of just nine states nationwide that prosecutes all 17-year-olds charged with a crime or municipal ordinance violation as adults. In two states, New York and North Carolina, adult court begins even earlier: at age 16.\"", "The same fact was cited in a June 11,  2018 blog entry on the website for the law firm Gimbel, Reilly, Guerin and Brown LLP.", "Alas, what was true in 2014, 2015 and 2018 is no longer true in 2021, due to legislative activity on the issue in recent years.", "In a July 1, 2020 report, the National Conference of State Legislatures said that in 47 states, the maximum age of juvenile court jurisdiction is age 17. That is, those who are age 17, are not automatically tried as an adult.", "\"Three states -- Georgia, Texas and Wisconsin -- now draw the juvenile/adult line at age 16,\" the NCSL report states. That is, those who are 16 are not automatically tried as an adult, but those who have turned 17 are.", "An official with NCSL said in the past seven years states have passed legislation that modified the ages of youth who fall under the jurisdiction of juvenile courts and they have also modified waiver laws, which apply to cases where a younger person may be  tried in adult court in certain cases after a hearing by a judge.", "\"You can look at it like age of jurisdiction laws are the ‘rule’ and transfer laws are the ‘exceptions to the rule,’\" Anne Teigen, program director of the NCSL’s  juvenile justice program, said in an email. \"States have enacted legislation that have changed both.\"", "All states have transfer laws that allow or require young offenders to be prosecuted as adults for specific serious offenses, regardless of their age.", "Teigen noted that since many of the \"Raise the Age\" laws were passed recently — including in New York, North Carolina, Missouri and Michigan — not all have been fully implemented.", "The bottom line here, though, is that Wisconsin is currently one of three, not one of nine.", "So, in that respect, Myers’ general point -- that Wisconsin is an outlier -- is even more on target, but she is using outdated information to make her point.", "Myers said \"Wisconsin is one of only nine states in the nation in which 17 year-olds are automatically treated as adults in the criminal justice system.\"", "That was true at one time, but the current number is three. So, the underlying point is on target, but the statistic cited is off.", "Our definition for Half True is \"the statement is partially accurate but leaves out important details or takes things out of context.\"", "That fits here.", "Rep. LaKeshia Myers, News Release, \"Rep. LaKeshia Myers’ statement on Gov. Evers’ Biennial Budget Address,\" Feb. 16, 2021.", "Email exchange, Kenya Parker, Rep. Myer’s staff, March 4, 2021", "Milwaukee Journal Sentinel \"Tony Evers proposes rollback of Act 10 in budget that boosts school spending by $1.6 billion and raises $1 billion in taxes,\"Feb. 16, 2021", "State of Wisconsin \"Budget in Brief\" Feb. 2021, page 26.", "Wisconsin Bar Association \"Adults Only: Returning 17 year olds to Juvenile Court.\" Nov. 1, 2014.", "Milwaukee Journal Sentinel \"The State Supreme Court could review the Slender Man stabbing ase after Geyser’s attorney files an appeal,\"Sept. 14, 2020.", "Appleton Post Crescent \"Lawmakers: Keep 17-year-olds from adult court,\" Oct. 19, 2015", "Gimbel, Reilly, Guerin and Brown \"Wisconsin laws and policies for juvenile offenders charged as adults\", June 11, 2018.", "National Conference of State Legislatures,\"Juvenile age of jurisdiction and transfer to adult court laws\"", "July 1, 2020", "Email,  Anne Teigen, National Conference of State Legislatures, March 9, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]