["By Angelo Fichera", "Posted on November 6, 2020", "Facebook users are sharing a meme that alleges a host of inaccuracies in Detroit’s voter rolls in the context of the 2020 election. But the claims stem from a 2019 lawsuit that was withdrawn after the group that filed it said the city had taken action on the issues.", "A purported screenshot of a TV news report out of Detroit, Michigan, is circulating on Facebook — misleadingly propelling outdated claims about the city’s voter rolls in the context of the 2020 election.", "The screenshot is alleged to be a report from a Fox 2 report in Detroit that outlines a lawsuit claiming a number of issues — including thousands of duplicates and dead people — with the city’s rolls.", "“And so it begins!!!” reads text above the screenshot in a meme.", "“Straight out of Fox 2 in Michigan,” reads another, posted Nov. 4.", "But the claims in the viral image were part of a lawsuit filed in late 2019 that was voluntarily withdrawn earlier this year after the organization behind it said the city had largely resolved the issues.", "The screenshot shows an alleged Fox 2 report whose headline reads, “Detroit Voter Roll Lawsuit.” Beneath it are bullets of claims from the lawsuit: “4,788 duplicate registrations,” “32,519 more registered voters than eligible voters,” “2,503 dead people registered” and “one voter born in 1823.”", "(While the station did cover the lawsuit, it has said the viral image “was never part of our original story.”)", "The claims shown in the image were indeed put forward by the Indiana-based Public Interest Legal Foundation, which filed a federal lawsuit against Detroit in December 2019. The legal group has sued a number of cities around the country over voter roll maintenance. The Brennan Center for Justice, which represented parties intervening in the Detroit case, has countered that the foundation has used “exaggerated claims” in such cases.", "Detroit disputed the allegations in court, saying that some were inaccurate or overstated — and that it had already resolved some of the apparent inaccuracies by the time of the lawsuit.", "For example, in a declaration filed with the court, Director of Elections George Azzouz said Detroit had already removed almost all of the names that were alleged to be duplicates or deceased. And the voter said to have a birthdate of 1823 was in fact born in 1983 and registered in 2008, he said, so the matter was a typographical error.", "We should note — as we’ve written before when addressing studies looking at such issues — the presence of outdated and inaccurate voter registration records is not itself evidence of voter fraud.", "And in this case, the foundation dropped its lawsuit in June — months after it was filed.", "The foundation’s filing to voluntarily dismiss the lawsuit said that it had been able to “ascertain that remedial actions were taken after the filing of this lawsuit.”", "“Defendants have taken action on the list of likely deceased registrants provided by the Plaintiff,” the group said. “Further, almost all of the duplicate registrations that Plaintiff brought to Defendants’ attention have been corrected.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“Detroit Voter Roll Cleanup Lawsuit Ends.” Public Interest Legal Foundation. 30 Jun 2020.", "Farley, Robert. “More Trump Deception on Voter Fraud.” FactCheck.org. 26 Jan 2017.", "“Photo alleging Detroit voter born in 1823 is from 2019 lawsuit that’s been cleared up.” Fox 2 Detroit. 5 Nov 2020.", "“Public Interest Legal Foundation v. Winfrey.” Brennan Center for Justice. Updated 30 Jun 2020.", "The Public Interest Legal Foundation v. Janice M. Winfrey. Plaintiff’s Brief in Support of Motion for Voluntary Dismissal Pursuant to Fed. R. Civ. P. 41(A)(2). United States District Court, Eastern District of Michigan, Southern Division. 29 Jun 2020.", "The Public Interest Legal Foundation v. Janice M. Winfrey. Declaration of George Azzouz. United States District Court, Eastern District of Michigan, Southern Division. 10 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]