["About this rating", "The image was a meme generated online and was rebuked by the company.", "Not long after Donald Trump's victory in the 2016 U.S. presidential election, an image began circulating online claiming that a Mexican supermarket chain was collecting \"donations\" toward his proposed border wall between the two countries.", "On 10 November 2016, a YouTube video claimed to show a picture of a receipt from a Soriana Hiper market in Monterrey, Nuevo Leon that included a 10-peso charge for an \"additional donation [for] Trump wall.\" The image then spread online, with one version containing the caption:", "Look what Soriana is doing. Save the picture and share it before it's deleted.", "Soriana, which operates more than 800 stores around Mexico, refuted the picture in a statement released on 15 November 2016, saying the photo in question was false and \"tendentiously manipulated\":", "The translation reads, in part:", "We reaffirm our position and commitment with our country as a 100% Mexican company, as one of the biggest job-generators in the country and with an important business platform for our suppliers and commercial partners. Our commitment has always been and will always be with our country, particularly with the Mexican family economy.", "The \"Trump wall\" receipt was based off of another fake photo that circulated in 2013, accusing the company of charging customers for a \"additional donation\" to the Teletón, the annual national fundraiser for childrens' healthcare:", "One of Trump's campaign promises was that his administration would not only build a wall along the U.S.-Mexico border, but make the latter country pay for it. That statement is still on his campaign website. He has since stated:", "It could be some fencing.", "However, it should be noted that an unmistakable wall already exists along much of the border between Mexico and the United States.", "\"Muro de trump esta siendo cobrado en soriana.\" De Todo Un Poco Consejos Practicos. YouTube. 10 November 2016. https://www.youtube.com/watch?v=y2D1ROTY1SA", "La Rancherita del Aire, S.A. de C.V. \"Circula en redes sociales supuesto ticket de compra con cobro extra por muro de Trump.\" rancherita.com.mx. 11 November 2016.", "sdpnoticias.com. \"Cobran indebidamente Teletón en tickets de compra.\" www.tolucanoticias.com. 6 November 2013.", "Stahl, Lesley. \"President-elect Trump speaks to a divided country on 60 Minutes.\" CBS News. 13 November 2016.", "Delano, James Whitlow. \"This Is What the U.S.-Mexico Border Wall Actually Looks Like.\" National Geographic. 4 March 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]