["This post has been shared more than 200 times since it was posted on August 17, 2020.", "The post shows two pictures of the newly issued Indonesian 75,000 rupiah banknote, alongside a long caption.", "Below is a screenshot of a part of the misleading post:", "The post’s Indonesian language caption reads in part: “‘New Bill’ A Prank Gift.", "“Credible information says that the new 75,000 rupiah bill is not meant to be used as a Medium of Exchange, but rather it functions only as a kind of Merchandise, or memorabilia money, to celebrate the 75th anniversary of Indonesian independence.”", "The Indonesian central bank, Bank of Indonesia (BI) issued a new Indonesian 75,000 rupiah bill on August 17, 2020, to celebrate the 75th anniversary of the Indonesian independence, hence it is also referred to as a “commemorative bill”.", "The same claim has also been shared hundreds more times after it being posted here, here, here and here on Facebook, and also here and here on Twitter.", "But the claim is false; BI says that the new banknote is legal tender.", "The Indonesian central bank said in a press briefing on August 18, 2020, that the new bill is legal tender and has the same function as the other existing banknotes.", "At the 5:03 mark of the video, BI Deputy Governor Rosmaya Hadi can be heard saying: “The bill functions not only as a medium of exchange, but more importantly also a symbol of our national sovereignty.”", "In a Q&A found here, Bank of Indonesia also says that the new banknote is a “legal tender” that can be used within the territory of Indonesia.", "Furthermore, a sentence is printed on the back of the bill, which translates to English as: “BY THE GRACE OF GOD ALMIGHTY, THE UNITARY REPUBLIC OF INDONESIA HAS ISSUED RUPIAH AS LEGAL TENDER WITH THE VALUE OF SEVENTY-FIVE THOUSAND RUPIAH.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]