["The video has been shared on Facebook, for example here and here, and Twitter, for example here on a Pakistani account where it has been viewed more than a million times and retweeted nearly 30,000 times since it was posted January 1, 2019.", "The video shows a man wearing camouflage army uniform beating a man clad only in his underwear who is cowering on the floor of a room.", "The tweet is captioned: “This is a Chinese officer beating a Muslim Uyghur for having a copy of the Quran in his house! Everyone send this out so the world knows what is happening in East Turkistan. China is killing all Muslims. Please Retweet to expose Chinese terrorism against innocent Muslims.”", "In the video, the semi naked man can be heard saying in Indonesian language “Ampun pak”, which means “Have mercy”, according to reporters in AFP’s Jakarta bureau.", "A reverse image search found the video footage was widely shared on social media in Indonesia in May 2017, for example here on the liveleak.com website with a caption saying: “Thief beaten by military soldier in Indonesia! I understood that was a pickpocket thief, who deserve justice.”", "A report in the Tribun Jateng newspaper published on May 24, 2017 on the video was headlined: “The facts behind the beating of a pickpocket by an Indonesian military officer.”", "The article says that the man in the video was a military officer who had beaten a suspected thief, allegedly at a railway station in the capital Jakarta.", "The officer has been dismissed from his duties at the railway station, the article added.", "“PT KAI Commuter Jabodetabek (KCJ) has made a clarification in response to the viral video showing a man in military attire flogging another man allegedly in a room in a commuter line station,” the article says, referring to a Jakarta train network.", "“PT KCJ corporate communication manager Eva Chairunisa said the officer in military attire had been dismissed from KCJ and had been returned to his unit,” the article said.", "A July 10, 2017 video posted on YouTube, which has been viewed more than 60,000 times, shares the same footage of the semi naked man being beaten in a room with a caption saying: “A thief caught by a member of the TNI .. ??”", "TNI refers to the Indonesian army.", "On January 3, 2019 a senior Chinese diplomat in Islamabad Lijian Zhao said the video in the misleading tweet did not show a Chinese officer beating a Uighur.", "Fake news! Not Chinese language!! Not even Chinese police uniform!!! This is sheer propaganda against China, trying to sabotage relations between China & muslim countryies. There’s no ‘East Turkistan’ in China. Only terrorists & their sympathizers call Xinjiang ‘East Turkistan’. https://t.co/kCMm8zX6CE", "The Chinese diplomat’s tweet says: “Fake news! Not Chinese language!! Not even Chinese police uniform!!! This is sheer propaganda against China, trying to sabotage relations between China & muslim countryies. There’s no ‘East Turkistan’ in China. Only terrorists & their sympathizers call Xinjiang ‘East Turkistan’.”", "China has been accused of abusing the human rights of the majority-Muslim Uighur population in western Xinjiang, with more than one million Uighurs held in detention camps, according to a UN estimate in this AFP story on the issue.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]