["About this rating", "In the fall of 2020, various social media users shared a right-wing hoax claiming that China had amassed troops in Canada in preparation to invade the U.S. The conspiracy theory appears to have originated with Hal Turner, a white supremacist radio personality and blogger.", "Turner's post carries the incendiary headline, \"Arm Yourselves and Prepare; China Massing 'Tens-of-Thousands' of Troops in Prince Rupert and Vancouver Canada. Invade USA?\" The claim has been circulating on various platforms, with some sharing a brief YouTube video as \"proof.\"", "In the video, a man in a car claims to be driving by Chinese troops gathering on a road in Salt Spring Island, Vancouver. But if you actually watch the video, all you see are people wearing green fatigues casually walking in loose formation. There's no evidence the people are \"Chinese military,\" as the man narrating the video states.", "In an email to Snopes, a spokesperson for the Royal Canadian Mounted Police, Canada's national police force, said they have \"no awareness\" of China amassing troops on Canadian soil.", "Turner's post claims that the troop placement was enabled by \"the globalist/Commie Prime Minister of Canada, Justin Trudeau\" who in 2019 signed the Foreign Investment Protection Act with China allowing Chinese security forces to be stationed in Canada \"without the knowledge or consent of local authorities.\" This is a mischaracterization of the agreement between China and Canada.", "The agreement was not signed by Trudeau, but by his predecessor, Stephen Harper. It went into effect in 2014 — a year before Trudeau took office — and there is no mention in the agreement of Chinese troop placement on Canadian soil.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]