["Since President Joe Biden took the oath of office on Jan. 20 in a peaceful transition of power, QAnon followers have been grappling with their failed predictions of a political “great awakening.” While some have accepted the new reality, others are looking for evidence to undercut Biden’s presidency and allow QAnon prophecies to prevail.", "A viral meme is challenging social media users who recognize Biden as the president to ask themselves a series of questions meant to dispute his presidency.", "“Questions to ask someone who thinks Biden is the President,” begins the meme.", "More:Fact check: Biden administration delays implementation of Trump rule on insulin, EpiPens", "Each of the nine questions the meme asks has a rational answer, and they fail to prove Biden’s presidency is illegitimate. USA TODAY has previously fact-checked claims that Biden illegally won the election and is an illegitimate president. None were true.", "USA TODAY reached out to several Facebook users that posted the meme and has yet to get a response.", "Biden decided to fly to Washington for Inauguration Day, rather than take Amtrak as originally planned, because of ongoing threats of far-right extremism that were deemed a security risk.", "Throughout his career, Biden’s preference for Amtrak has been a pillar of his public persona. Biden earned the nickname “Amtrak Joe” by spending much of his 36-year Senate career commuting 90 minutes each way between his home in Wilmington, Delaware, and the U.S. Capitol by train each day.", "Traditionally, outgoing presidents provide transportation to Washington for the incoming administration. CNN reported on Jan. 19 that the Trump administration did not offer Biden’s team transportation to the capital. His arrival via private plane has nothing to do with the legitimacy of his presidency.", "This claim is false. A military band played “Hail to the Chief” when Biden’s family arrived at the White House after the inauguration ceremony.", "Not long before, “Hail to the Chief” played for Donald Trump as he took the stage at Joint Base Andrews before he left for Mar-a-Lago with his family.", "The song is traditionally played every time the president arrives at a formal occasion. In accordance with tradition, the song is played twice on Inauguration Day: once for the outgoing president and once for the incoming president.", "More:Fact check: Lincoln watched baseball games in front of White House, but image in meme is from 1945", "This claim is false. Biden received a 21-gun salute when he arrived at Arlington National Cemetery after the inauguration ceremony at the U.S. Capitol.", "Trump was also given a 21-gun salute before addressing a crowd and boarding Air Force One at Joint Base Andrews.", "This is false. In a previous fact check USA TODAY found there was no evidence to support the claim that a video of Biden’s inauguration aired in Spain hours before it occurred.", "Conspiracy theorist Charlie Ward claimed without evidence that he received a recording of the inauguration 10 hours early in a Jan. 21 YouTube video. YouTube later removed the video for violating community standards.", "More:Fact check: National Guard will remain in DC through Trump's impeachment trial", "This is false. C-SPAN footage of the inauguration ceremony shows Biden did not remove his hand from the Bible until he completed the oath of office.", "The president took the oath on a massive Bible that has been in his family since 1893. Biden was sworn in on the same Bible twice as vice president and seven times as a senator.", "This is false.", "Vice President Kamala Harris was sworn in before the president, as is customary, according to the Joint Congressional Committee on Inaugural Ceremonies. The Constitution does not stipulate in what order the presidential and vice presidential oaths of office should follow, making this claim also false.", "Vice President Mike Pence was sworn in before Trump at the last inauguration ceremony in 2017,as was Biden with President Barack Obama in 2013 and 2009.", "USA TODAY fact-checked claims that National Guard members had turned their back in dissent to Biden's motorcade after a video of troops on Jan. 20 went viral. We found that guard members had turned their backs to protect the president from external threats as he arrived at the Capitol. A National Guard spokesperson confirmed the action was protocol and not an expression of disapproval as critics had widely misconstrued it be.", "This is also false. Biden does have the nuclear launch codes.", "Trump’s decision not to attend Biden’s inauguration, the first president to do so in more than 150 years, broke traditions in many ways and created logistical abnormalities. One such dilemma was the hand off of the military “football,” which contains the nuclear codes.", "On Jan. 20, when Trump left Washington for Mar-a-Lago, he was still president and so the football traveled with him. However, it was deactivated at noon, when Biden became president.", "A military aide accompanied Trump to Florida, while another military aide handed Biden a second football, which was then activated when Biden took office at noon, according to NBC News.", "More:Fact check: Biden temporarily banned new oil and gas leasing on public lands", "While some leaders at the Pentagon did temporarily withhold information from the Biden transition team, Reuters reported Jan. 26 that the resistance has stopped.", "Department of Defense spokeswoman Susan Gough told Reuters that the Pentagon was moving ahead with the transition and had on-boarded 32 Biden administration appointees by Jan. 25.", "Politico reported Jan. 20 that Trump administration Pentagon appointees had obstructed the transition team’s request for information regarding special operations missions and vaccine distribution. Politico described the hindrance as “unprecedented in modern presidential transitions” and predicted that it would “hobble the new administration on key national security matters.”", "More:Fact check: Nancy Pelosi will not resign if Donald Trump is acquitted in impeachment trial", "We rate a viral meme, which lists a series of questions those who accept Joe Biden's presidency should ask themselves, as FALSE because the questions are all based on false claims, conspiracy theories or outdated information. Biden is legally the president of the United States.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]