["Former Arizona Gov. Jan Brewer, in Washington, in February 2014. (AP photo)", "Former Arizona Gov. Jan Brewer came to the defense of Republican presidential candidate Donald Trump, suggesting Trump’s controversial claims about illegal immigrants bringing \"crime\" and being \"rapists\" aren’t necessarily off the mark.", "Brewer, who championed tough immigration laws in Arizona, said on CNN that studies and research showing no distinguishable rise in crime among illegal immigrants are wrong.", "\"I find it interesting that people … 1,000 miles away can rely on whatever statistics they want to rely on,\" Brewer said. \"But if you come to Arizona and you talk to people that live on the border, you talk to people that live in Arizona, you will find that, you know, the facts are not true.", "\"We know from their data, from the federal data, that they (border patrols) only stop or apprehend one out of four illegal people crossing our border,\" Brewer said.", "PunditFact decided to find out if this fact istrue.", "We reached out to Brewer to see if she could provide us with the \"federal data\" she was looking at, and also to clarify what she meant by \"our\" border -- did she mean the Arizona border, the border states, or the entire U.S. border? But we did not hear back.", "In the absence of an answer from Brewer, PunditFact looked around for available federal data that could support Brewer’s claim.", "First, we mapped out all U.S. Border Patrol sectors. The majority, of course, are found along the Southwest border of the United States. According to 2014 data from the U.S. Border Patrol, this area was responsible for about 98.5 percent of all apprehensions. A similar breakdown is evident in previous years as well.", "In total, there were 479,371 apprehensions were made along the Southwest border in 2014. According to Brewer, that means about 1.4 million illegal immigrants weren’t stopped and were able to cross into the country.", "Jeffrey Passel, a senior demographer at the Pew Research Center, found that number high.", "\" ‘Conventional wisdom’ (in the 1980s-1990s) used to be that 1 in 3 was caught,\" Passel said.", "\"Since then, the Border Patrol has increased significantly; there are miles and miles of fences; substantial technology has been deployed. It seems unreasonable to think that they apprehend a smaller fraction.\"", "And even still, the 1 in 3 figure was at best a rough estimate, Passel said. The government did not seem to keep a record of the effectiveness of Border Patrol apprehensions in the 1980s and 1990s, and since then, that trend has only mildly improved.", "The recent data", "The most recent data PunditFact could find dated back to 2011 and included a lot of caveats.", "The U.S. Government Accountability Office published data about the effectiveness of the Border Patrol at various stations in the Southwest sector from 2006-11. The government measures \"apprehensions,\" \"turn backs\" and \"got aways.\" Here is a chart printed by the Washington Post that summarizes that data:", "In short, according to the Government Accountability Office, 84 percent of people trying to cross the Southwestern border in FY 2011 were either apprehended or ran back to Mexico. Only 16 percent \"got away,\" meaning they presumably made it into the United States.", "You can go through the numbers for yourself in more detail, but in no way do they support the idea that three in four illegal immigrants crossing the border makes it to the United States.", "It’s no better if you specifically focus on Brewer’s home state of Arizona. Looking at sectors covering the Arizona border (Tucson and Yuma), patrols apprehended 64 percent and 74 percent of border crossers respectively. In both cases, another 20 percent of people turned back to Mexico -- meaning only between 6 and 13 percent of people made it across the border successfully.", "Limits of the data", "Obviously, counting the number of people who managed to avoid detection is a tricky business.", "According to the 2012 GAO report, \"indications of illegal crossings are obtained through various sources such as direct agent observation, referrals from credible sources (such as residents), camera monitoring, and detection of physical evidence left on the environment from animal or human crossings.\"", "The \"detection of physical evidence left on the environment\" is known as \"sign-cutting.\" It includes searching for evidence such as \"dusty footprints, torn cobwebs, broken twigs, (and) overturned pebbles.\" Of the 85,467 people who \"got away\" across the Southwest border in 2011, about 83 percent of them were identified using \"sign-cutting.\"", "The accuracy of \"sign-cutting\" is debated.", "In one 2013 article published in the Huffington Post, Border Patrol Chief Mike Fisher said that sign-cutting \"is not an exact science.\"", "On the other hand, Border Patrol agent Richard Gordon, who uses sign-cutting frequently, appears to trust the method. \"It's tried, and it's true, and it works,\" said Gordon in the same article.", "Both \"turn backs\" and \"got aways\" use sign-cutting as a source of information.", "Another problem with the numbers may be caused by data overlap. According to the 2012 GAO report, sometimes there could be \"cases where the same turn back (or \"got away\") identified by a camera is also identified by sign-cutting. Double counting may also occur when agents in one zone record as a got away an individual who is (later) apprehended and then reported as an apprehension in another zone.\"", "Because of this, \"Border Patrol headquarters officials said that while they consider turn back and got away data sufficiently reliable to assess each sector’s progress toward border security … they do not consider the data sufficiently reliable to compare -- or externally report -- results across sectors.\"", "Border Patrol agents also seem to disagree about some of the published statistics.", "\"Ask any line agent in the field and he or she will tell you that at best we apprehend 35-40 percent of the illegal immigrants attempting to cross,\" said Border Patrol agent Chris Cabrera in a Breitbart.com article.", "Our ruling", "Brewer said that, based on federal data, \"they only stop or apprehend one out of four illegal people crossing our border.\" The federal data doesn’t support that.", "According to the Government Accountability Office, 61 percent of people trying to cross the Southwestern border in FY 2011 (the last year available) were apprehended and another 23 percent were stopped and ran back to Mexico. Only 16 percent \"got away,\" meaning they presumably made it into the United States.", "It’s obviously hard to know the real numbers with certainty given the nature of the topic, but Brewer erroneously pointed to federal data that does not back her up. We rate her claim Mostly False.", "azcentral.com, \"Arizona governor signs immigration law; foes promise fight,\" April 24, 2010", "CNN, CNN Tonight transcript, July 8, 2015", "Zeemaps.com, \"Border Patrol Sectors: Apprehensions 2014,\" July 10, 2015", "U.S. Customs and Border Protection, \"United States Border Patrol: Sector Profile Fiscal Year 2014,\" accessed July 13, 2015", "U.S. Customs and Border Protection, \"United States Border Patrol: Total Illegal Alien Apprehensions by Fiscal Year,\" accessed July 13, 2015", "United States Government Accountability Office, Border Patrol: Key Elements of New Strategic Plan Not Yet in Place to Inform Border Security Status and Resource Needs, December 2012", "The Washington Post, \"Border security is the key to immigration reform. So how do we measure it?,\" June 21, 2013", "The Huffington Post, \"Under pressure, Border Patrol now counts getaways,\" April 21, 2013", "Breitbart.com, \"Border Patrol Agent: We Are Punished for Reporting Illegal Alien Groups of More Than 20,\" March 17, 2015", "Email interview with Jeffrey Passel, senior demographer at Pew Research Center, July 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]