["The Pakistani government declared that captured Indian pilot Abhinandan Varthaman will be released on March 1 as a “peace gesture”. A video doing rounds on social media since before PM Imran Khan’s statement is still being shared, claiming that the woman in the clip is wing commander Varthaman’s wife requesting the BJP to not politicise the sacrifice of soldiers.", "SP MLA Rajesh Yadav was among those who shared the clip.", "भाजपाईयों तथा मोदी आप भी सुनिए ये पायलट अभिनंदन जी की पत्नी कुछ सलाह दे रहीं हैं? थोड़ी सी भी शर्म बची हो तो शहीदों के फोटो लगाकर वोट मांगना बंद करों? वैसे बता दें कि इन्हें देशद्रोही मत बोलना क्योंकि ये खुद एक आर्मी अफसर हैं pic.twitter.com/Mh1mFVA8NB", "— Rajesh SP (@MLArajeshSP) February 28, 2019", "Indian Youth Congress’s online magazine Yuva Desh also tweeted the video with the identical claim.", "अभिनंदन की पत्नी का संदेश कि सैनिकों के बलिदान पर बीजेपी न करे राजनीति। #Abhinanadan pic.twitter.com/1bA0628I9L", "— Yuva Desh (@yuvadesh) February 28, 2019", "Congress Seva Dal member Harvinder Singh tweeted the video as well.", "विंग कमांडर अभिनन्दन कुमार की पत्नी की भाजपाइयों को नसीहत । ओर किसी की न सही इनकी तो सुन लो संघियों । https://t.co/o3PqhlfKH5", "— Harvinder Singh (@harvindsingh11) February 28, 2019", "The clip is also viral on Facebook.", "If one listens to the woman’s statements made in the video, she begins with saying – “I am the wife of an army officer.” A little further into the clip, she can be heard saying, “…just imagine the kind of tension, the kind of pain the family of Abhinandan is going through right now.” As the woman refers to wing commander Abhinandan’s family in the third person, it is apparent that she cannot be his wife.", "The woman in the video is one Sirisha Rao.", "Humble request.@BJP4India dont count your seats at the cost of soldiers sacrifice #MeraJawanSabseMajboot pic.twitter.com/v749N8ygBy", "— Sirisha Rao (@SirishaRao12) February 28, 2019", "Rao is a volunteer with AAP Haryana. Speaking to Boomlive she said, “In the video, I clearly say I am the wife of an army officer and as we all know Varthaman is a pilot with the air force so why is it that people are sharing the video claiming I am his wife?”", "This is the complete transcription of Rao’s entire statement – “Hello everyone, I am the wife of an army officer. On behalf of the families of all the armed forces, I request my fellow Indians, especially the political leaders, the political leaders not to politicise the sacrifice of our soldiers. It takes so much to be a soldier. And just imagine the kind of tension, the kind of pain the family of Abhinandan is going through right now. So please till the time the tension is eased at Indo-Pak border stop your political rallies and don’t you dare, I repeat, don’t you dare snatch away the credit of our soldiers. So please stop counting your tickets and stop doing your politics. You have enough times to play your politics but not at this time and not at the cost of our soldiers’ sacrifice. It is my humble request to all political leaders, especially the BJP political leaders.”", "Misinformation is on the rise since the start of the ongoing tensions between India and Pakistan. Social media users are advised to self-verify unsourced information before sharing it as authentic news.", "[This article has been updated with the identity of the woman who made the video.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]