["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker (left) and Foxconn chairman Terry Gou have struck a multi-billion deal to bring a manufacturing plant to Wisconsin. Some question whether the state is offering too much in incentives. (Mike De Sisti/Milwaukee Journal Sentinel)", "Amid the euphoria over the announcement that a company promising $10 billion and 13,000 jobs will set up shop in Wisconsin, questions have been raised about whether the state is giving away too much in incentives in order to close the deal.", "\"Diligence Required on Foxconn Job,\" warned a headline on a July 28, 2017 blog post from One Wisconsin Now, a liberal advocacy group that claims 96,000 online supporters.", "But the post itself went further, opening with this salvo:", "Gov. Scott Walker wants state taxpayers to dole out up to $250 million annually in incentives to Taiwanese electronics manufacturer Foxconn to lure a manufacturing plant to Wisconsin that he claims will generate $181 million in tax revenue.\n\nThink about that. Gov. Walker proposes we pay about $70 million more a year in incentives to a foreign corporation than will flow back to our state coffers. Does that sound like a good deal to you?", "So is that really the deal: Taxpayers pay up to $250 million a year to get the manufacturing plant, but get back only $181 million a year in tax revenue?", "This claim is essentially correct on the two numbers, but it leaves out a big part of the equation.", "The deal", "Two days before the blog post, Walker joined President Donald Trump and other officials at the White House to announce that Foxconn, after considering several other states, had decided to put the first liquid crystal display (LCD) manufacturing facility in North America in Wisconsin. The displays would be made for computer screens, televisions and the dashboards of cars.", "Walker tweeted that the company, perhaps best known for making Apple’s iPhone at factories in China, would be bringing 13,000 jobs to the state. We rated his claim Half True. Foxconn itself has said only that the plant will create 3,000 jobs, \"with the potential to grow to 13,000 new jobs.\"", "Much hinges on the company’s pledge to invest $10 billion, in exchange for $3 billion in incentives from the state.", "The numbers", "To back its statement, One Wisconsin Now pointed us to reports from the Milwaukee Journal Sentinel that said the $3 billion in incentives could be doled out at a rate of $200 million to $250 million per year over 15 years; and that the state expects to collect $181 million in state and local tax revenue annually.", "But it stands to reason the state wouldn’t approve a losing deal without expecting something more.", "And that’s what we heard from the economic and tax experts we talked to. They agreed that Walker is making the deal not only to get the Foxconn plant, but the many other businesses, jobs and related economic activity that is expected to be triggered by such a massive development.", "The Walker administration estimates \"at least 22,000 indirect and induced jobs throughout the state\" and an economic impact of least a $7 billion per year. The massive development is expected to generate other new businesses, new housing and other economic activity that will, in turn, produce even more tax revenue.", "\"That’s what the state is banking on,\" Marquette University economics professor Abdur Chowdhury said, referring to what some call the \"multiplier effect.\"", "Whether Foxconn follows through in full on its promises, and to what extent it will generate other economic development in Wisconsin, of course, remains to be seen.", "Chowdhury cited Foxconn’s promises in other places that didn’t come to pass. And two other experts -- Michael Hicks, director of the Center for Business and Economic Research at Ball State University in Muncie, Ind., and Steven Deller, interim director of the  Center for Community and Economic Development at the University of Wisconsin Extension -- told us they think estimates on the Foxconn multiplier effect are too rosy.", "But whether Wisconsin is making a good deal isn’t part of this fact check.", "Our rating", "One Wisconsin Now says Walker \"wants state taxpayers to dole out up to $250 million annually in incentives\" to Foxconn \"to lure a manufacturing plant to Wisconsin that he claims will generate $181 million in tax revenue.\"", "Walker does want to offer $200 million to $250 million per year over 15 years in incentives in order to get Foxconn to put its plant in Wisconsin, and the estimate is that the project will produce $181 million per year in tax revenue.", "But what’s left out of the statement is that Walker and others are pursuing the deal in large part because the massive development is expected to generate other new businesses, new housing and other economic activity that will, in turn, produce even more tax revenue.", "For a statement that is partially accurate but leaves out important details, our rating is Half True.", "One Wisconsin Now, blog post, July 28, 2017", "Interview, One Wisconsin Now deputy director Mike Browne, Aug. 1, 2017", "Gov. Scott Walker, \"Wisconn Valley facts and figures,\" accessed Aug. 1, 2017", "Milwaukee Journal Sentinel, \"8 fast facts on Foxconn's planned $10 billion investment in Wisconsin,\" July 26, 2017", "Twitter, Patrick Marley tweet, July 26, 2017", "Twitter, Patrick Marley tweet, July 26, 2017", "Email, Center on Wisconsin Strategy associate director Laura Dresser, July 31, 2017", "MarketWatch.com, \"This 1 number sums up why that Foxconn deal is over-the-top bad for Wisconsin,\" July 31, 2017", "PolitiFact Wisconsin, \"Scott Walker says Foxconn 'bringing' 13,000 jobs to Wisconsin -- what exactly does that mean?\" July 27, 2017", "Interview, Wisconsin Taxpayers Alliance president Todd Berry, July 31, 2017", "Email, University of Wisconsin Extension Center for Community and Economic Development interim director Steven Deller, July 28, 2017", "Interview, Ball State University’s Center for Business and Economic Research director Michael Hicks, July 31, 2017", "Interview, Marquette University economics professor Abdur Chowdhury, Aug. 1, 2017", "Interview, Brian Jacobsen chief portfolio strategist at Wells Fargo Funds Management and Wisconsin Lutheran College business professor, July 31, 2017", "Wisconsin State Journal, \"Analysis: Foxconn project would create 35K jobs in Wisconsin,\" July 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]