["About this rating", "Singer and activist Willie Nelson told a San Antonio news station he quit smoking weed for health reasons.", "However, Nelson has not stopped using marijuana altogether.", "Nelson's spokeswoman implied in a follow-up interview that in spite of his comments, Nelson \"does what he wants\" when it comes to smoking marijuana.", "Singer and activist Willie Nelson is famous for numerous pursuits, but one of his biggest popular culture claims to fame is his affinity for marijuana. So when the 86-year-old said in an interview that he quit smoking for health reasons, it prompted some very against-type anxiety among fans.", "It's true that Nelson told San Antonio's KSAT-TV that he stopped smoking weed because he believes smoking has damaged his lungs over the years:", "Nelson, 86, said “I have abused my lungs quite a bit in the past, so breathing is a little more difficult these days and I have to be careful.”", "“I started smoking cedar bark, went from that to cigarettes to whatever,” he said. “And that almost killed me.”", "It didn’t, so he made a decision.", "“I don’t smoke anymore — take better care of myself,” Nelson said.", "The news resulted in something of an internet panic. Celebrity news and gossip publication Page Six, for example, opened its report saying, \"It’s like Michael Jordan retiring from the NBA. It’s like Donald Trump quitting Twitter. It’s like Lindsay Lohan forsaking drama. Willie Nelson has quit weed.\"", "But while Nelson did give up smoking to preserve his health, there are more ways to consume marijuana than puffing on a joint. Nelson's spokeswoman Elaine Schock clarified for the Associated Press that Nelson hasn't stopped using pot. She also hinted that his statement about no longer smoking wasn't exactly a hard-and-fast rule:", "His spokeswoman, Elaine Schock, told The Associated Press in an email Wednesday that Nelson hasn’t given up cannabis, and she points out there are different ways to consume it.", "“That said,” she said “Willie does what he wants, when he wants, when it comes to smoking.”", "Venema, Paul. \"Willie Nelson Says He’s No Longer Smoking Marijuana Due to Breathing Issues.\"\r\n  KSAT-TV. 29 November 2019.", "Coleman, Oli. \"Willie Nelson Has Quit Smoking Weed.\"\r\n  Page Six. 3 December 2019.", "Associated Press. \"Willie Nelson Says He’s Not Smoking, But Is Still Using Pot.\"\r\n  4 December 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]