["Rep. Trey Gowdy, R-S.C., speaks during a House Judiciary hearing on Capitol Hill in Washington on Dec. 7, 2017.", "A new Internet hoax claims that two officials who were working for Rep. Trey Gowdy, R-S.C., on a criminal investigation of former Secretary of State Hillary Clinton went missing and were later found dead.", "\"Trey Gowdy breaks his silence after 2 of his investigators are found tortured and killed,\" read the headline on the blog WhatHappensintheUSA.com.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "The article falsely claims that two officials were reportedly on their way to deliver a search warrant on the Clinton Presidential Library when they were tortured and killed, with no evidence left behind.", "If such a crime were true, it would be picked up by legitimate journalists. But there is no evidence of anything like that happening in Little Rock, Ark., where the presidential library dedicated to former president Bill Clinton is located.", "Gowdy, who previously announced his plan to retire earlier this year, was the former chairman of the House select committee investigating the 2012 attack on the U.S. diplomatic properties in Benghazi, Libya, and Hillary Clinton’s response to the attacks as secretary of state. The final Benghazi report was issued in 2016, and found no personal culpability on Clinton’s behalf.", "The fake news article also said that Gowdy had no comment about the made-up incident for safety reasons. The story also reported a phony statement by Gowdy about a \"vast conspiracy.\"", "When searching these statements, we found no credible reports that Gowdy has made any similar claims. We ran this conspiracy by Gowdy's office, and they confirmed it was inaccurate.", "We rate this story Pants on Fire.", "What happens in the USA, Trey Gowdy breaks his silence after 2 of his investigators are found tortured and killed, March 24, 2018", "Clinton Presidential Library, website", "New York Times, House Benghazi Report finds no new evidence of wrongdoing by Hillary Clinton, June 28, 2016", "NPR, Rep. Trey Gowdy, who gained attention with Benghazi Hearings, to retire, Jan. 31, 2018", "Office of Representative Trey Gowdy, March 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]