["About this rating", "In late September 2023, multiple reputable news outlets reported U.S. Sen. Dianne Feinstein of California, a centrist Democrat who was elected to the Senate in 1992, had died. She was 90.", "As the news spread online, so did a rumor about her time as the mayor of San Francisco decades ago.", "Years prior, in February 2019, a group supporting Sen. Bernie Sanders of Vermont resurrected the controversy in a widely shared Facebook post critical of Feinstein.", "\"The People for Bernie Sanders\" group posted a meme containing black-and-white photographs of a man atop a flagpole surrounded by demonstrators, along with the following text: \"1984: Protestor seizes confederate flag their city's mayor repeatedly flew in front of City Hall. (The city was San Francisco and the mayor was Senator Dianne Feinstein.)\"", "The People for Bernie Sanders added a link to a 2015 article from the website of the San Francisco Bay View newspaper preceded by the comment: \"Ooooof, yes it's true. When she wouldn't stop replacing the flag, they took down the pole\":", "The meme itself was taken (without attribution) from a December 2017 tweet posted on the Twitter account @steckel:", "1984: Protestor seizes confederate flag their city's mayor repeatedly flew in front of City Hall.", "(The city was San Francisco and the mayor was Senator Dianne Feinstein.) pic.twitter.com/X2vk9znSNE", "— lie, cheat, steal, kill, win, win (@steckel) December 16, 2017", "The meme posted by \"The People for Bernie Sanders,\" as well as the article cited as evidence, both left out important context and made specific claims about Feinstein's role in the controversy that we were unable to verify.", "Feinstein became mayor of San Francisco in 1978, after the assassination of George Moscone and City Supervisor Harvey Milk, events portrayed in the 2008 film Milk. A Confederate battle flag had flown outside San Francisco's Civic Center since 1964 as part of an 18-flag display intended to symbolize the various stages of American history, according to contemporaneous news reports.", "Because of its historical associations with slavery and white supremacy (a history we have previously examined in greater depth), the flying of the Confederate battle flag outside San Francisco's City Hall engendered controversy and protests in 1964, and demonstrators actually stole the flag in July before it was quickly replaced.", "By 1981, many of the flags displayed in the \"Pavilion of American Flags\" at the Civic Center had fallen into disrepair, and that year the San Francisco construction company Bechtel paid to have them all replaced, including the Confederate battle flag.", "Speaking at a Memorial Day unveiling ceremony for the new flags, then-Mayor Feinstein said \"San Francisco is proud to fly these flags where both visitors and residents alike may see and appreciate the more than 200 years of America's rich history which they symbolize.\"", "In April 1984, a group of socialist activists from the Spartacist League coordinated the removal of the Confederate battle flag from its pole at the Civic Center. The man shown in the photographs included in the meme was Richard Bradley, who symbolically wore a Union soldier's uniform when he ripped down the flag two days in a row beginning on 15 April 1984, as the Los Angeles Times reportedat the time:", "A Confederate flag that was part of a historic display in front of San Francisco's City Hall was cut down and burned by protesters who called it 'a banner of racist terror.' While about 50 protestors watched, one man climbed up the 40-foot flagpole and cut the flag down. Then he and another man burned it. Richard Bradley, 34, a member of the Spartacist League, and Peter Woolston, 41, an officer of the International Longshoreman's Warehouse Union Local 6 in San Francisco, were arrested.", "The flag was replaced the next morning, but Bradley once again climbed the pole and removed it before being re-arrested, as the San Francisco Examiner reported:", "Richard Bradley shinnied up a flagpole in front of San Francisco City Hall for the second time in as many days yesterday to tear down a Confederate flag he finds offensive. When he got to the ground, after ripping the flag to shreds and throwing the pieces to the ground, he was arrested and charged with malicious mischief. He was arrested on the same charge Sunday after he climbed the same flagpole and tore apart another Confederate flag.", "Bradley belongs to the Spartacist League and the Labor Black League for Social Defense, two organizations that consider the Confederate flag a symbol of racism. The groups have vowed to continue tearing down the flag, if the city insists on replacing it.", "The flag is part of an 18-flag display in front of City Hall that is designed to depict flags that played important roles in the history of the United States, according to Tom Malloy, director of the city's Recreation and Parks Department. Malloy said he will continue to fly the Confederate flag until or unless the Board of Supervisors orders it down.", "Later on the day of Bradley's second arrest, Feinstein announced the Confederate flag would not be replaced again after the intervention of Doris Ward, a member of San Francisco's Board of Supervisors (akin to a City Council) who would later go on to make history as the first black person to preside over that body, the San Francisco Examiner wrote on 18 April:", "The Confederate flag, which was torn down twice this week by groups who consider it offensive, will not fly again above Civic Center plaza, Mayor Feinstein says. The mayor made her decision yesterday, after Supervisor Doris Ward asked her not to replace the flag. \"I want to make it very clear that my decision is based only on Supervisor Ward's request,\" Feinstein said. \"I'm not impressed because some group shinnies up a flag pole and tears down a flag.\"", "... Ward got involved in the issue Monday evening [16 April], after talking with members of the Spartacist League. Yesterday Ward sent a letter to the mayor, asking her not to replace the Confederate flag. \"The Confederate flag was carried as the banner of slavery, and is still used to today to represent movements such as the Ku Klux Klan, which attempt to restrict the basic freedoms of American people,\" Ward said in a prepared statement.", "Ward aide Chelsea Baylor said the supervisor has received several calls each year from people who are offended by the Confederate flag. \"I think it's a legitimate concern,\" Feinstein said after receiving Ward's request. \"We will take a look at how history can be depicted with another flag.\"", "On 27 April, Feinstein announced a new flag would fly, that of \"the California Hundred,\" a famous group of West Coast volunteers who journeyed across the United States to fight with the Union Army in the Civil War.", "It's not clear whether Bradley heard about this announcement, but he took matters into his own hands for the third time just two days later. By his own account, he scaled the pole once again on 29 April, raising a replica of the garrison flag of Fort Sumter, the South Carolina fort where Confederate artillery fire heralded the beginning of hostilities in the Civil War in April 1861.", "The following day, city authorities ordered the removal of the unauthorized Fort Sumter flag, but the back-and-forth over the issue didn't end there. In late June, someone raised another Confederate flag on the same pole at the Civic Center, this time the first Confederate national flag (known as the \"Stars and Bars\").", "Thomas Malloy, the head of the city's department of Recreation and Parks, later told a committee of the San Francisco Board of Supervisors that the installation of the Confederate national flag had been done \"quite by accident,\" as reported by the Oakland Tribune:", "Malloy ... acknowledged a confederate banner was run up the pole during the last few days of June. That banner, which Malloy said was raised 'quite by accident,' was not the familiar Confederate 'battle flag' with blue diagonal cross bars, but the less well-known Confederate 'national flag' known as the Stars and Bars, which features three red and white stripes and a circle of white stars on a blue field in the upper left-hand corner.", "Malloy told [Supervisor Doris] Ward and Supervisor Nancy Walker that he first noticed the flag on June 21, but did not recognize it as a Confederate symbol. Initially, he said, he was simply pleased that the empty hole in the display had been filled. Ward and Walker said they too did not recognize the flag.", "On 29 June, unidentified persons cut down the flagpole itself. According to a 2015 article in the Spartacist League's Workers Vanguard newspaper (the source cited by \"The People for Bernie Sanders\"), the pole was taken down by \"anti-racist militants\" after Mayor Feinstein purportedly \"raised the 'Stars and Bars.'\"", "In early July, the pole was replaced, and the pro-Union flag of the \"California Hundred\" flew where the Confederate battle flag once had.", "When Feinstein became mayor of San Francisco in 1978, a Confederate battle flag had been flying outside City Hall for 14 years, along with 17 other flags designed to collectively serve as symbols of American history.", "We know that the installation of the Confederate battle flag had been controversial from the outset, and that protesters removed it shortly after it was unveiled in 1964. At the time, San Francisco Mayor John Shelley pronounced his misgivings about it, labeling it a symbol of \"legalized sedition\" and saying \"It makes me shiver every time I see that flag flying.\"", "Feinstein certainly did not order the flag to be removed during the first six years of her tenure as mayor, and in 1981 she accepted a donation of 18 new flags, including the Confederate battle flag, saying \"San Francisco is proud to fly these flags where both visitors and residents alike may see and appreciate the more than 200 years of America's rich history which they symbolize.\"", "It could be argued that the decline into disrepair of the \"Pavilion of American Flags\" represented a good opportunity to reevaluate the inclusion of the Confederate battle flag in that display, and that Feinstein did not, at that juncture, decide to exclude it from the display or refuse to accept it as one of the 18 donated flags. However, that inaction was not the same as affirmatively expressing support for the flying of the Confederate battle flag in particular.", "In 1984, we know that Richard Bradley removed the Confederate battle flag on 15 April, and that another one was re-erected the following day. Crucially, however, we don't know who ordered its replacement. We asked Feinstein's U.S. Senate office whether it was she, in her capacity as mayor, or someone else who was responsible for the replacement of the Confederate flag on 16 April 1984 but did not receive a substantive response in time for publication.", "The official directly responsible for the flag display at the Civic Center was Thomas Malloy, who ran the department of Recreation and Parks. In public remarks made after Bradley removed the Confederate flag for the second time on 16 April, Malloy indicated he would insist on keeping the Confederate flag flying, despite the protests over it: \"The flags as a set were intended to depict American history. As long as that avenue is purported to represent the full range of significant American flags, I don't want to fall victim to revisionist history. We have no intention of removing that flag.\"", "Malloy died in 1989, so we were unable to ask him whether it was he who ordered that the Confederate flag be reinstated on 16 April 1984, or that the \"Stars and Bars\" be installed in June 1984 (an incident that he described as accidental).", "Both @steckel's Twitter meme and \"The People for Bernie Sanders\" neglected to mention a crucial fact: that it was Feinstein who finally ordered the Confederate battle flag not be replaced after 16 April 1984. And only 11 days later, she announced that it would be replaced with a flag honoring Union soldiers from California. It is misleading and disingenuous to omit those facts from any content examining Feinstein's role in the 1984 Confederate flag controversy.", "Furthermore, the additional claim made by \"The People for Bernie Sanders,\" that Feinstein \"wouldn't stop replacing the flag\" until the pole itself was removed, is misleading. First, because the Confederate battle flag was only replaced once in April 1984, not repeatedly. Second, because it's not clear that Feinstein herself, as opposed to another city official or even a rogue employee, was responsible for its replacement. It's true that the first Confederate national flag (the Stars and Bars) was installed in June 1984, but we could find no evidence that Feinstein was responsible for that act, and the director of Recreation and Parks, Thomas Malloy, said it was done \"quite by accident.\"", "Finally, the claim that the destruction of the pole itself is what brought an end to the flying of the Confederate battle flag is both illogical and contradicted by the available facts. First, the pole was replaced in July 1984, shortly after the original one was removed. If Feinstein had been intent on continuously and repeatedly re-erecting a Confederate battle flag there, a new pole was shortly available for that very purpose, and the temporary removal of a pole from that location would have proved no obstacle to her supposed agenda.", "Second, Feinstein had already said no new Confederate battle flag would be displayed at the Civic Center more than two months before the pole was removed. She had even specified that the flag would be replaced by one honoring Union soldiers. It was those decisions, not the temporary removal of a flagpole, that brought a permanent end to the presence of any Confederate flag outside City Hall in San Francisco.", "Workers Vanguard.   \"1984: Confederate Flag of Slavery Taken Down from San Francisco Civic Center -- 3 Times!\"     2 August 2015.", "Associated Press.   \"Confederate Flag in SF Stirs Protest.\"     The Fresno Bee.   18 June 1964.", "The San Francisco Examiner.   \"Historic Flags.\"     26 February 1964.", "Mikkelson, David.   \"The Truth About Confederate History: Part 1.\"      Snopes.com.   28 June 2015.", "The Statesman Journal.   \"San Francisco Again Has a Confederate Flag ...\"     4 August 1964.", "The San Francisco Examiner.   \"Special S.F. Memorial Day.\"     20 May 1981.", "Boldenweck, Bill and Sydney Kossen.   \"Memorial Day and Liberty Ship Nostalgia.\"     The San Francisco Examiner.   21 May 1981.", "Los Angeles Times.   \"A Confederate Flag...\"     16 April 1984.", "The San Francisco Examiner.   \"Black Activist Rips Flag Again.\"     17 April 1984.", "Fagan, Kevin and Sarah Ravani.   \"Doris Ward, First African American to Lead SF Board of Supervisors, Dies at 86.\"     The San Francisco Chronicle.   18 April 2018.", "The San Francisco Examiner.   \"Dixie Flag Won't Rise Again, Feinstein Decides.\"     18 April 1984.", "The San Francisco Examiner.   \"Feinstein Runs a New Flag Up the Pole.\"     28 April 1984.", "Bradley, Richard.   \"Flagpole Hitter (Letter to the Editor).\"     The San Francisco Examiner.   3 May 1984.", "The [Oakland] Tribune.   \"State Banner Favored Over Confederate Flag.\"     6 July 1984.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]