["About this rating", "One common form of urban folklore is the \"legal talisman\" text, typically a message informing readers that they can gain significant advantage simply by invoking some little known legal stratagem that will protect them from penalty or punishment they might otherwise experience. Social media users were exposed to another example of this form in 2017, one which (spuriously) advised them they were not legally obligated to pay any debts that creditors had sold off to third parties:", "DON'T PAY THEM A DIME!", "If your original creditor sold your debt to a collection agency, they also wrote off your debt on their taxes which wrote off your obligation to pay. You can dispute the transaction via dispute.transunion.com (along with any other collection agency owned items lingering on your report.) Your dispute reason is \"contract was cancelled\" and write \"NO CONTRACT\" in the dispute comments. I have cleared THOUSANDS off my own report and have been working to help my friends and family do the same! for FREE! Peace and love to all! Knowledge is power!", "Debt can indeed legally be sold or assigned, and a creditor's doing so does not relieve the debtor of obligation to pay — otherwise, the debt purchasing industry would not exist. Typically, a creditor sells a debt for a fraction of its value: For example, a $10,000 debt might be sold for $2,000 to a debt purchaser/collector, with the creditor reporting that $2,000 as income and writing off the remaining $8,000 as unrecoverable debt. The debt purchaser is then entitled to collect any or all of that $10,000 amount from the debtor — the fact that the original creditor has written off some or all of the debt does not remove the debtor's obligation to pay the full amount. (It's true that in such circumstances the debtor no longer owes anything to the original creditor, but the debtor is still legally obligated to pay whoever bought up their debt.)", "Likewise, it is not true that a creditor's selling off a debt to a collection agency means negative information about that debt must be removed from a consumer's credit report. Any legally incurred debt, regardless of who currently holds the right to collect it, may be validly reported to, and listed by, credit reporting agencies such as Equifax, Experian, and TransUnion.", "This spurious advice may have one beneficial aspect to it, although it is incidental in nature. Consumers have the right to challenge erroneous entries on their credit reports, a process that requires credit reporting agencies to either validate the challenged information in a timely manner or correct their records:", "Credit reporting companies must investigate the items in question — usually within 30 days — unless they consider your dispute frivolous. They also must forward all the relevant data you provide about the inaccuracy to the organization that provided the information. After the information provider receives notice of a dispute from the credit reporting company, it must investigate, review the relevant information, and report the results back to the credit reporting company. If the information provider finds the disputed information is inaccurate, it must notify all three nationwide credit reporting companies so they can correct the information in your file.", "It's possible that consumers can abuse this process to prompt the removal of otherwise valid debt information from their credit reports simply by challenging it — if the debt is old enough and/or has since been sold off, it may be the case that neither the original creditor nor the debt purchaser can produce documentation validating the debt, or that they may not consider it worth their while to bother doing so (especially if the debt is relatively small), or that they may be unable to address the issue within the timeframe prescribed by law. In such cases (i.e., when challenged entries are not validated) credit reporting agencies are obligated to remove the information from their reports, but that process has nothing to do with whether or not the debt has been sold. A valid debt may remain on your credit report no matter how many times it has been sold or resold; there is no legal basis for disputing it and demanding its removal simply by claiming \"NO CONTRACT.\"", "Or, as one reddit contributor put it:", "Disputing a debt through the credit reporting agencies might get it off your credit report, if the creditor is too swamped to bother responding to the dispute. There used to be (and probably still are, though I haven't looked recently) \"credit repair\" firms that would charge decent chunks of money to \"clear up\" your credit reports, primarily by filing disputes and hoping the creditors didn't bother to respond.", "If the creditor does respond to the dispute, it stays on your credit report. Also, important to note that even if an unanswered dispute does by chance lead to the debt being removed from your credit report, you can still be sued over it. Credit reporting agencies are private companies — their reports have no legal weight at all. If a creditor sued you, you couldn't just say \"it's not on my credit report, so I don't owe it\" as a defense in court.", "The attempted legal explanation in [this] forwarded post is 110% BS though. If they disputed a debt on their report and it was later removed, that happened because the creditor didn't bother responding to the dispute, not because of some crackpot pseudo-legal theory that the debt is no longer valid. Plenty of people have been sued by debt collectors over debts that had been sold to them by the original creditor, and had the judge rule in the debt collectors favor that the debt was valid and the debtor needed to pay up.", "Consumer Financial Protection Bureau.   \"If a Credit Reporting Error Is Corrected, How Long Will It Take Before I Find Out the Results?\"\r\n    8 August 2016.", "Credit Karma.   \"How to Dispute an Error on Your Credit Report.\"\r\n    16 December 2011.", "Federal Trade Commission.   \"Disputing Errors on Credit Reports.\"\r\n    February 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]