["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Jim Sensenbrenner, a suburban Milwaukee Republican, has long been known for holding public town hall meetings. (Mike De Sisti/Milwaukee Journal Sentinel)", "The rhetorical bombs that Democrat Tom Palzewicz has been lobbing at GOP Rep. Jim Sensenbrenner, the senior member of Wisconsin’s congressional delegation, includes this whopper of a tweet from May 14, 2018:", "Today's a good day to remind the #WI05 district that your current Congressman, @JimPressOffice, has been in office for 40 years. In that time, he's led on exactly one bill - the wildly invasive & unpopular Patriot Act. Chip in & help #RetireSensenbrenner", "Palzewicz, a suburban Milwaukee businessman, is making a longshot run to unseat Sensenbrenner.", "So, Sensenbrenner has served in the House since 1979, but the USA Patriot Act is the only bill he has \"led\"?", "Chalk this one up to the risks of railing on Twitter.", "Or maybe not.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc", "Patriot Act", "The USA Patriot Act was introduced by Sensenbrenner in the wake of the 9/11 attacks and was signed into law by GOP President George W. Bush in October 2001. (Wisconsin Democrat Russ Feingold cast the lone no vote in the Senate.)", "The measure granted law enforcement increased surveillance powers to intercept phone and email communications in the name of fighting terrorism, but with little judicial or congressional oversight.", "Based on a law he signed in 2015, PolitiFact National gave Democratic President Barack Obama a Promise Kept on his pledge to revise the law to increase oversight on government surveillance.", "So, what else has Sensenbrenner done?", "An apology", "When we asked for evidence to back up the claim, Palzewicz’s campaign staff sent us this statement, attributed to the candidate:", "My campaign used imprecise language, which is an issue in a medium such as Twitter where brevity is king. We were expressing the opinion that over a 40-year career, he doesn’t have a lot of major legislation to his name. The Patriot Act is the only thing of note. That said, it’s not 100% accurate, in that he has had his name on other pieces of legislation, and I apologize for that.", "Twitter can be hazardous, of course.", "But we found that Palzewicz also made the attack on a website he’s using to raise money for his campaign.", "500 sponsorships", "The state Republican Party responded to us on Sensenbrenner’s behalf, citing Congress.gov data. That data shows that in his career, Sensenbrenner was the lead sponsor on 500 bills or amendments, 99 of which passed the House and 34 that became law.", "The measures include these three, each of which was signed into law in 2006:", "Voting Rights Act: A 25-year extension of the act was signed into law. It was initially enacted in 1965 to fight against racist policies in the South that often kept blacks from voting.", "Adam Walsh Act: Established a national system for the registration of sex offenders and offenders against children.", "Violence Against Women Act: Reauthorized a law that provides funding for programs to fight domestic violence, sexual assault and other crimes.", "Our rating", "Palzewicz says Sensenbrenner \"has been in office for 40 years\" and \"he's led on exactly one bill,\" the Patriot Act.", "Palzewicz told us he meant to say the anti-terrorism law is the only Sensenbrenner-sponsored bill of note.", "But as for what Palzewicz actually claimed, Sensenbrenner has sponsored 500 bills and amendments, including 34 that became law.", "That makes Palzewicz’s statement not only false but ridiculous -- Pants on Fire.", "Twitter, Tom Palzewicz tweet, May 14, 2018", "Email, Tom Palzewicz campaign coordinator Austin Kieler, May 16, 2018", "Email, Wisconsin Republican Party communications director Alec Zimmerman, May 16, 2018", "Congress.gov, Jim Sensenbrenner-sponsored measures, accessed May 16, 2018", "Crowdpac.com, Tom Palzewicz page, accessed May 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]