["About this rating", "Some cell phone service providers allow users to access their voicemail accounts via external methods such as landlines, and those users could keep the voicemail greetings updated in the absence of cellular and internet service.", "Users lacking the option and means of accessing their voicemail accounts from landlines would not be able to keep their greetings updated in the absence of cellular and internet service.", "As Hurricane Florence advanced on the mainland U.S. in September 2018, a fresh batch of seemingly helpful storm-related (mis)information spread online, including a graphic purportedly offering advice to cellphone users who might soon find themselves without service:", "HURRICANE TIP: If you lose electricity, phone service, & wifi, just update your voicemail message greeting to notify family and friends of how you are and keep them updated. You can change your voicemail greeting as many times as you want and can do it without data!", "But this is not necessarily the case, a spokesperson for AT&T Wireless, Tova Kline, told us. \"There is no data or talk charge for changing your voicemail. However if you lose phone service, you won't be able to update your voicemail message,\" she said.", "However, some cellular service providers allow users to access and update their voicemail by calling their own numbers from working landlines or phones on other wireless networks, so users whose accounts include such an option and who have access to alternative service could keep the voicemail greetings updated even when their own mobile phones cannot connect to cellular or internet service.", "AT&T and other wireless service carriers have revealed a series of preventative measures to help maintain phone service as Hurricane Florence approaches the mid-Atlantic region, including the use of wireless \"flying COW\" (short for \"cells on wheels and wings\") drones that can maintain connectivity for up to 40 square miles once they are activated.", "The trade group CTIA, which represents the wireless communications industry, has also published emergency preparedness guides for cell phone users in both English and Spanish, as well as a post dealing specifically with cellphone use during and after hurricanes.", "Experts recommend fully charging all your electronic devices in advance of a storm, turn off any features you're not currently using, communicate by text (rather than voice) whenever possible, and power down your devices when you're not using them.", "Snider, Mike.   \"What Wireless Providers Like Verizon, AT&T Are Doing to Prepare for Hurricane Florence.\"\r\n    USA Today.   11 September 2018.", "Oberhausen, Jen.   \"Using Your Mobile Phone Before, During and After Hurricane Emergencies.\"\r\n    CTIA.   7 May 2018.", "Kendrick, James.   \"Riding Out the Hurricane with Your Cell Phone.\"\r\n    ZDNet.   26 August 2011.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]