["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, a lengthy message arguing that \"COVID 19 does not exist\" was widely circulated on social media. This post proved popular in part because it was attributed to a person who seemingly had the credentials to make such a determination: Dr. Rob Oswald, a virologist and immunologist at Cornell University's Department of Molecular Medicine.", "Here's the introductory paragraph of this viral message:", "“I have a PhD in virology and immunology. I'm a clinical lab scientist and have tested 1500 \"supposed\" positive Covid 19 samples collected here in S. California. When my lab team and I did the testing through Koch's postulates and observation under a SEM (scanning electron microscope), we found NO Covid in any of the 1500 samples.", "While the included image in this viral post does show a real person named Oswald, he did not write this post.", "Purveyors of misinformation often falsely attach trusted names to fraudulent claims in order to make their misinformation appear more credible. If a doctor wrote this post, then the logic goes, there must be something to it. But Oswald had nothing to do with the viral message posted above.", "This text has been circulating online since at least Dec. 6, when an anonymous Blogger named \"Sojourner\" posted it in the comments section of an article published at Wadeburleson.org. At the time, the text was not attributed to Oswald or any other medical professional, and the post's apparent author, Sojourner, noted in another comment that he/she was \"not a professional,\" was \"merely a hillbilly,\" and had simply copied and pasted the message.", "Since many people may not find an anonymous message posted by a \"hillbilly\" to be credible, subsequent versions of this post falsely claimed that the message had originated with a reputable source, Oswald. But that, of course, is not the case.", "Shortly after this message went viral, Oswald updated his webpage at Cornell University to include a statement about COVID-19. He wrote:", "COVID-19 is real. Any Facebook post that suggests otherwise is a hoax and is not true. Wear a mask, practice social distancing, and get the vaccine when it becomes available.", "When we reached out to Oswald, he elaborated and told us that he was \"horrified by the contents\" of this message, and that this post was not connected to him or Cornell University.", "Oswald said:", "I certainly did not write this and am rather horrified by the contents.", "[...]", "It lists the author as a virologist and immunologist living in southern California--neither of these descriptions fit me. Also, it mentions Cornell and a supposed lawsuit against the CDC. Cornell has been at the forefront of COVID research and testing, committing huge resources into maintaining the spread of the virus. To attempt to link Cornell to the contents of this letter is disappointing to say the least.", "In addition to saying that neither he nor the university had anything to do with this message, Oswald also explained that the contents of this viral message were also dubious.", "Oswald said:", "The contents are just completely wrong. The virus is incredibly well studied with many full genome sequences from patients, contrary to the suggestion that only 40 or so nucleotides have been sequenced. You can see the vast extent of the work as compiled by the National Library of Medicine: https://www.ncbi.nlm.nih.gov/sars-cov-2/", "Not only that, but the molecular structure of at least the spike protein of the virus has been solved by cryo-EM (one of our former students is an author on this work): https://science.sciencemag.org/content/367/6483/1260", "So to suggest that no virus actually exists is just false.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]