["About this rating", "Rumors about Democratic presidential candidate's having some kind of (potentially debilitating) neurological disorder have circulated ever since the then-secretary of state fainted from dehydration while suffering from a stomach virus and sustained a concussion in December 2012.  Those rumors were resurrected in July 2016 when a video clip of Clinton was circulated along with claims that it showed her experiencing a brief seizure and proved she was ill and unfit to hold office:", "This was more than a month old when it went viral in July 2016.  NBC News posted a video of the incident taken from another angle on 10 June 2016 and explained that Clinton had just been asked about the possibility of her selecting Elizabeth Warren as her running mate as she left a meeting with the Massachusetts senator:", "Presumptive Democratic presidential nominee Hillary Clinton is asked by NBC News’ Monica Alba if she discussed a possible V.P. role with Sen. Elizabeth Warren.", "The occurrence depicted above was covered by several news outlets in June 2016, with none of them reporting the candidate had experienced a \"seizure.\" The Hill, for instance, reported that Clinton \"exaggeratedly bob(bed) her head\" after reporters repeated the question about Warren, while the New York Daily News  wrote that Clinton \"gave an exaggerated startled response\" to the question.", "CBS reporter Hannah Chanpong suggested that Clinton movements were simply an exaggerated reaction to her being \"startled\" when some reporters in her blind spot started suddenly barraging her with questions about her putative vice presidential choice.  The fact that Clinton immediately repeated her initial reaction for humorous effect supports the hypothesis that it stemmed from a conscious movement and not an involuntary seizure:", "Clinton, seemingly startled by us reporters, says \"try the cold Chai\" when asked if she discussed VPs with Warren. pic.twitter.com/oiCD5hoE0h", "— Hannah Chanpong (@hannahfc) June 10, 2016", "Notably, rumors that Clinton was captured on camera underoing a seizure didn't start circulating until well over a month later, when they were presented without any evidence beyond uninformed speculation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]