["The video was shared here on Twitter on February 17, 2020. It has been viewed more 244,000 times.", "The caption states: \"The fallen put outside ..we need the truth! #truth #CoronavirusOutbreak #corruption.\"", "The 33-second video, which appears to have been taken by a motorcyclist, shows a row of people lying on a street.", "Below is a screenshot of the misleading post:", "The novel coronavirus has killed at least 2,000 people and infected more than 74,000 others in China after it emerged in the central Chinese city of Wuhan in late 2019, as reported here by AFP on February 19.", "The same video was shared here on Twitter with a similar claim. It was viewed almost 140,000 times before it was deleted. The same video was also shared here on Facebook with a similar claim.", "The claim is false; the video shows people sleeping rough in Shenzhen, a Chinese city more than 700 miles south of Wuhan.", "A store seen at the nine-second mark of the video can be seen in this Baidu Maps imagery of Hualong Road, Shenzhen.", "Below is a Baidu Maps screenshot of the filming location:", "A video shot on the same street was uploaded earlier on Twitter on February 13 here and here. The captions in both posts state the clip shows people sleeping on the street in Shenzhen.", "This footage, which offers close-up shots of the people on the street taken from a slightly different angle, shows a person propping up their head with a pillow at the 15-second mark.", "Below is a screenshot comparison between the video in the misleading posts (L) and the close-up video (R) with corresponding features circled in red by AFP:", "The Shenzhen government announced on February 9, 2020, that people would require permits to enter and exit residential areas in the city, as part of a government effort to halt the coronavirus spread, according to this February 15 report by Guangdong newspaper Nanfang Daily.", "This February 17 video taken in Shenzhen shows quiet streets under the new policy, as well as a similar scene at the 41-second mark, where duvets can be seen on a park bench.", "Below is a screenshot of the duvets in the video:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]