["By Angelo Fichera", "Posted on July 31, 2018", "Q: Are campaign banners for President Trump’s reelection campaign being made in China?", "A: News reports have documented Trump 2020 flags being produced in China, but it’s unclear who ordered those. The campaign says that “all of our merchandise is 100% made in the USA.”", "There are several posts on Facebook purportedly showing Chinese factory workers in China manufacturing banners for Trump’s 2020 campaign. I don’t want to repost unless this is true.", "Any idea?", "Ever since President Donald Trump’s 2016 campaign rooted itself in a theme of “America First,” critics have called attention to the businessman’s own eponymous products that were being made outside the U.S. — such as Trump shirts made in Bangladesh and sports coats made in India.", "But are his 2020 reelection campaign banners, or flags, being made in China? That’s the question a dozen readers have asked us in recent weeks, in the midst of news coverage on the topic and subsequent criticism by Sen. Bernie Sanders, who cited one such report.", "Sanders wrote in a Facebook post: “Given the choice between hiring American workers at a living wage or hiring much less expensive workers from China that he can exploit, Trump opts for the low-cost overseas labor day in and day out.”", "While pictures, videos and interviews with factory managers show that factories in China are producing banners supporting Trump’s reelection campaign, who exactly ordered those products isn’t clear. The campaign rebutted the implication that it was ordering banners overseas, telling us that “all of our merchandise is 100% made in the USA.”", "In early July, however, the owner of a flag-making factory in China’s Zhejiang province told the NPR podcast “The Indicator” that he was filling an order for Trump reelection flags.", "“We also make flags for Trump for 2020. It seems like he has another campaign going on in 2020. Isn’t that right?” Li Jiang said in the interview through an interpreter, according to the show’s July 3 transcript. The host of the podcast later said Li was making “thousands of blue and white Trump 2020 flags.”", "The podcast noted that Li’s factory in 2016 made flags in support of both Trump and rival Hillary Clinton. Li also said the product labels indicate the flags are made in China.", "A July 25 Reuters article showed photographic and video evidence of banners being made at another Chinese factory, the Jiahao Flag Co. in the country’s Anhui province. The video shows women inside the factory working on blue, white and red Trump 2020 flags that say, “Keep America Great!”", "A manager, Yao Yuanyuan, told Reuters that the factory has produced 90,000 flags since March — and she speculated that the purchaser was “taking advantage of the fact that the tariffs haven’t gone up yet, with lower prices now.” Amid a trade feud, the Trump administration has imposed tariffs on $34 billion worth of products from China, and it has threatened additional tariffs on another $200 billion worth of Chinese goods.", "But, Reuters reported, Yao “says the buyers are located in both China and abroad and she doesn’t know if they are affiliated with Trump’s official campaign or the Republican Party.”", "In a statement responding to our questions, Michael Glassner — the chief operating officer for the campaign — said: “We have made it clear all along that all of our merchandise is 100% made in the USA. Any vendor who claims to have a relationship with us otherwise is lying or violating our protected trademark rights.”", "“This applies to all of the recent fake news about Made in China products for the 2020 campaign,” the statement said.", "We asked the campaign if it was aware of other parties that may have ordered the flags being made in China, but we did not get a response.", "The Trump reelection campaign’s spending records filed with the Federal Election Commission, as of June 30, show the campaign paid $1,524 for “flags” in June to Wisconsin-based Medalcraft Mint, though it’s unlikely that purchase was actually for flags. Medalcraft’s website doesn’t advertise such products, and a representative told FactCheck.org by phone that the company doesn’t make flags. The company made the official inaugural medal for Trump — which it had done for the prior two presidents as well, according to its website.", "A search of the campaign’s reports for “collateral” shows many other payments for products such as T-shirts, mugs and hats — but none to the Chinese factories in question. Many purchases are from Ace Specialties in Louisiana and Cali-Fame in California.", "Donald J. Trump for President, Inc. – Committee overview. U.S. Federal Election Commission. Accessed 30 Jul 2018.", "Glassner, Michael. Chief Operating Officer, Donald J. Trump for President, Inc. Email statement to FactCheck.org. 30 Jul 2018.", "“Made in China: Trump re-election flags may get burned by his tariffs.” Reuters. 25 Jul 2018.", "“Star Spangled Indicator.” The Indicator from Planet Money. NPR. 3 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]