["About this rating", "In January 2017 a Facebook user going by the name \"Caleb Lee\" claimed that both an employee and a manager at a Pizza Hut restaurant in Alabama not only refused him a military discount, but also disparaged police and U.S. servicemembers in the process:", "According to a 15 January 2017 news report from Huntsville television station WAFF, after Pizza Hut investigated the report and determined the incident it described was fabricated, Lee vanished from social media:", "A Huntsville Pizza Hut is reeling after they say a man made up a negative story, posted it to Facebook, and got thousands of shares. Pizza Hut managers are reacting and hoping to clear the air about the “fabricated incident.”", "Pizza Hut customer Caleb Lee made a Facebook post claiming he asked for a military discount. When he didn’t see it on his receipt, he asked to speak to a store manager, according to his Facebook post. The post went on to say that the “corporate manager” cursed at him and told him to leave his store.", "Store managers at the 4802 University Dr. NW location said the military man’s story was made up.", "According to a statement the franchise released, they tried to reach out to Lee on social media, but he removed himself from Facebook.", "Pizza Hut’s statement says that managers conducted a thorough investigation. The store reviewed surveillance footage and confirmed the individual was a customer that day and did ask for a military discount. Pizza Hut states the rest of Lee’s story doesn’t check out: They said he wasn't approached by anybody else and he left the establishment.", "Shortly thereafter, Pizza Hut released a statement in an effort to undo the damage done by the rapidly spreading falsehood:", "We want to thank everyone for your concerns with the situation that has been made up on Facebook. We have had a thorough investigation about the matter and have reviewed all video surveillance footage of the day the individual claims it occurred.", "Caleb Lee is in fact a customer of ours and did come in and have buffet with us on Jan 12th between 1-2pm. When Mr Lee finished enjoying his meal he paid for his meal, at which time, he did ask if we gave a military discount. His server and the store manager explained we did not offer a discount. Mr Lee paid for his meal and exited the facility.", "Mr Lee was never approached by any other person during his visit with us. It is very unfortunate that he felt the need to fabricate a story and post it to social media. We have tried to contact Mr. Lee, but we are unable to as he has removed himself from all social media. As anyone could guess, this has had a very negative impact on our business and reputation.", "As a Pizza Hut Franchise, we have been serving our communities, here in Huntsville, AL, since 1967. We have always had the utmost respect for all customers, including all uniformed professions, be it Military, Law Enforcement, Firefighters or Responders. Any actions like what was stated would have resulted in immediate termination of any employee no matter the position they hold. We will continue as always to serve our guests with the utmost respect today and in the future.", "As of 2 February 2017 the original post had been deleted, but copies of it remained in circulation, with commenters still pledging to cease dining at Pizza Hut (unaware of the rumor's near-immediate debunking):", "Lee wasn't the first to embellish a personal anecdote based on the \"shunned serviceman\" legend (which has in recent years grown to encompass police).", "Rumors of the sort date back at least a quarter-century, when Lancaster, Pennsylvania's Shady Maple buffet was targeted by claims that they treated soldiers discourteously during the first Gulf War. Gas stations are a frequent target of the often fabricated claims, and law enforcement variations tend to pop up during times of widespread dispute over policing and criminal justice.", "Jordan, Leah.   \"Pizza Hut: Customer's Facebook Story Was Fabricated, But Negative Impact on Their Business Is Real.\"\r\n    WAFF-TV [Hunstville, AL].   15 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]