["Democratic gubernatorial candidate Richard Cordray, left, and Ohio Attorney General and Republican gubernatorial candidate Mike DeWine shake hands before a debate at Marietta College in Marietta, Ohio, Oct. 1, 2018. (AP)", "A TV ad by Democrat Richard Cordray in Ohio attacks Republican Mike DeWine for his position on pre-existing conditions as part of the Affordable Care Act.", "\"If insurance companies do not have to pay for pre-existing conditions my son won’t get the blood thinners he needs,\" said the woman in the TV ad. \"There’s plenty of people that just cannot survive without their medications. When I heard that Mike DeWine wanted to allow insurance companies to refuse to pay for pre-existing conditions it made me sick to my stomach.\"", "DeWine later countered with his own TV ad in which his daughter says DeWine \"supports health care coverage for people with pre-existing conditions.\"", "We wanted to fact-check Cordray’s ad to see if DeWine wanted to allow insurance companies to refuse to pay for pre-existing conditions.", "DeWine isn't the only Republican to oppose Obamacare while stating support for the popular protection for pre-existing conditions.", "Looking over Dewine’s entire record, we find that he was a strong opponent of the Affordable Care Act for years, but now is staking out a more moderate position.", "DeWine’s campaign said that he has shown support for pre-existing coverage stretching back to the 1990s when he campaigned for and then won a seat in the U.S. Senate. In 1994, DeWine wrote on a survey by the Ohio Nurses Association that \"pre-existing conditions must no longer be a bar to insurance.\"", "For example, in 1996 he voted along with the entire Senate in favor of a health insurance accountability bill that placed limits on pre-existing condition exclusions, among other things.", "But as attorney general, DeWine has fought against the federal health care law. On his first day in office in 2011, DeWine joined a multistate lawsuit against the Affordable Care Act.", "DeWine called the health care law a \"huge federal overreach\" because it mandated individuals to purchase insurance or face a penalty. He didn’t mention pre-existing conditions, but the law guarantees coverage for people who have them.", "When the U.S. Supreme Court upheld the individual mandate in 2012, DeWine said he was disappointed in the outcome.", "As attorney general, the first references we could find of DeWine defending pre-existing condition coverage were from this year.", "For example, DeWine said during a September gubernatorial debate, \"I’ve always been for coverage of people pre-existing illnesses.\"", "More recently, DeWine has not joined either side of a multistate lawsuit filed in a Texas federal court in February by Republican attorney generals and governors. That lawsuit argues that the law is no longer constitutional because Congress gutted the individual mandate as part of the 2017 tax overhaul.", "DeWine didn’t join the lawsuit because he believes it's up to Congress to decide whether to repeal Obamacare via that route, his office spokesman Dan Tierney told PolitiFact.", "DeWine argues that it’s possible to oppose the law and the mandate, while keeping pre-existing condition coverage. But that’s not what the federal government has said. The Justice Department said in a legal brief that the individual mandate is inseparable from protections for people with pre-existing conditions. That’s because if there were no mandate, people would wait until they were sick to purchase health insurance.", "Cordray’s ad said, \"Mike DeWine wanted to allow insurance companies to refuse to pay for pre-existing conditions.\"", "DeWine was a strong opponent of the Affordable Care Act, joining a lawsuit to fight against it in 2011. DeWine argues his opposition was over the individual mandate, but if the lawsuit had prevailed it, would have struck down a law that guaranteed coverage for people with pre-existing conditions. This year, while being attacked over his health care record, DeWine said he has favored coverage for pre-existing conditions and pointed to his record decades earlier in the U.S. Senate.", "We rate this claim Half True.", "Richard Cordray, TV ad, Sept. 25, 2018", "Mike DeWine, TV ad and list of votes and statements, Oct. 3, 2018", "U.S. District Court for the Northern District of Texas, Federal defendants memo, June 7, 2018", "Henry J Kaiser Family Foundation, \"Kaiser Health Tracking Poll – Late Summer 2018: The Election, Pre-Existing Conditions, and Surprises on Medical Bills,\" Sept. 5, 2018", "Attorney General Mike DeWine press release, \"Attorney General DeWine Authorizes Action to Challenge Constitutionality of Health Care Law,\" Jan. 11, 2011", "Mike DeWine vs Richard Cordray debate, Sept. 19, 2018", "The Toledo Blade, \"Attorney General's Race: DeWine pledges action against health-care law,\" Oct. 10, 2010", "Columbus Dispatch, \"GOP OPPOSITION Health-law advocates fear effect of repeal,\" Nov. 29, 2010", "Cleveland Plain Dealer, \"DeWine moves to have Ohio join health-care law challenge,\" Jan. 11, 2011", "Columbus Dispatch, \"Cordray calls on DeWine to protect preexisting health coverage,\" June 14, 2018", "Columbus Dispatch, Governor hopefuls run on AG records; Aug. 20, 2018", "Los Angeles times, \"Once their rallying cry, Obamacare is suddenly a sticky campaign issue for Republicans,\" Aug. 21, 2018", "Columbus Dispatch, \"Cordray jabs at DeWine on health care,\" Sept. 21, 2018", "Columbus Dispatch, \"Ad Watch: Cordray hits DeWine over health care,\" Sept. 26, 2018", "St Louis Post Dispatch, \"GOP risks fallout from Justice Department move on health law,\" June 9, 2018", "C-SPAN, Mike DeWine in U.S. Senate debate, 1994", "New York Times, \"Trump Claims to Protect Pre-Existing Health Conditions. That’s Not What the Government Says,\" Sept. 21, 2018", "New York Times, \"AP FACT CHECK: Trump's Falsehoods on Health Plan Protections,\" Oct. 1, 2018", "PolitiFact, \"In Ohio governor's race, liberal PAC exaggerates impact of Obamacare repeal,\" July 10, 2018", "PolitiFact, \"Ohio Republican Mike DeWine changed position on Medicaid expansion,\"July 20, 2018", "PolitiFact, \"Did Patrick Morrisey join a lawsuit to allow insurers to deny coverage for pre-existing conditions?\" June 26, 2018", "PolitiFact, \"Rick Scott wants to go back to denying coverage for pre-existing conditions, Charlie Crist says,\" April 4, 2014", "Interview, Gail Wilensky, head of Medicare and Medicaid under President George H.W. Bush, Oct. 1, 2018", "Interview, Linda Blumberg, health policy analyst at the Urban Institute, Oct. 1, 2018", "Interview, Christine Eibner, health policy analyst with the RAND Corp., Oct. 1, 2018", "Interview, Dan Tierney, Attorney General Mike DeWine spokesman, Sept. 28, 2018", "Interview, Joshua Eck, Mike DeWine campaign spokesman, Oct. 1, 2018", "Interview, Christina Freundlich, Richard Cordray spokeswoman, Sept. 28, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]