["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former presidential candidate Bernie Sanders (left) did a town hall meeting in Kenosha, Wis., that was broadcast by MSNBC on Dec. 12, 2016. (Milwaukee Journal Sentinel/Mark Hoffman)", "At a post-election town hall meeting in Kenosha, Wis., 2016 Democratic presidential candidate Bernie Sanders opined on why Republican Donald Trump is headed for the Oval Office and not the Democratic nominee, Hillary Clinton.", "\"One of the arguments as to why Trump won is the belief that most of – or many of -- his supporters are sexist or are racist or are homophobes. I happen not to believe that`s the case,\" Sanders said at the Dec. 12, 2016 meeting, which was broadcast on MSNBC.", "\"I think what he did do is, he said, ‘You know what, there is a lot of pain in this country; people are scared and people are worried.’ One example: Right now, 50 percent of older workers, 55 to 64 -- you know how much money they have in the bank, as they enter retirement? Who wants to guess?", "\"Zero!\" the Vermont senator exclaimed. \"What do you think? People are scared to death of retirement.\"", "On another haves and have-nots claim -- that \"the top one-tenth of 1 percent\" of Americans \"own almost as much wealth as the bottom 90 percent\" -- we gave Sanders a Mostly True.", "But, are half of Americans approaching retirement with nothing in the bank?", "Sanders’ evidence", "To support Sanders’ statement, his campaign cited a May 2015 report on the financial status of retirees and workers approaching retirement from a gold-standard source, the nonpartisan U.S. Government Accountability Office.", "Sanders had requested it in his role as ranking member of the Senate Subcommittee on Primary Health and Retirement Security.", "The report used data from the latest triennial Survey of Consumer Finances done by the  Federal Reserve Board, in 2013. It is the premier survey of wealth in the United States, according to Wellesley College economics professor Courtney Coile, who is the associate director of the Retirement Research Center at the National Bureau of Economic Research.", "The GAO found that 52 percent of households age 55 and over have no money in what the report defined as retirement savings -- an Individual Retirement Account (IRA) or a defined-contribution plan, such as a 401(k).", "But that group includes people who are well into retirement.", "The situation is somewhat less dire for the group that Sanders cited at the town hall, those ages 55 to 64. The report found that 41 percent of the people in that group have no money in defined-contribution plans or IRAs.", "There’s another point of clarification, however. The report did not consider in that statistic other savings that the 55 to 64 age group have.", "The Center for Retirement Research at Boston College ran those numbers for us, using the same Federal Reserve survey data, although it expressed the statistic a little differently.", "The center found that 38.5 percent of Americans ages 55 to 64 do not have a retirement account such as an IRA, traditional pension or 401(k), but nevertheless have some savings. With that group, the median amount of their savings is $1,000 -- in other words, half of them have savings of more than $1,000 and half have less.", "So, it’s not as though those people have \"zero\" in the bank, although many don’t have savings that would last them very long in retirement.", "Our rating", "Sanders said 50 percent of workers ages 55 to 64 have \"zero\" money \"in the bank as they enter retirement.\"", "His claim is somewhat high, but doesn’t give a misleading impression. A widely respected government report says 41 percent of Americans 55 to 64 have no savings in common retirement accounts such as an IRA or a 401(k).", "It’s also worth noting that some in that group have other savings not in retirement accounts, though for many of them it’s less than $1,000.", "For a statement that is partially accurate but leaves out important details, our rating is Half True.", "YouTube, video (7:45) of Bernie Sanders MSNBC Kenosha town hall, Dec. 12, 2016", "Email, Bernie Sanders spokesman Warren Gunnels, Dec. 13, 2016", "U.S. Government Accountability Office, \"Retirement Security -- Most Households Approaching Retirement Have Low Savings (Figure 2),\" May 2015", "Employee Benefit Research Institute, 2016 Retirement Confidence Survey, March 2016", "Economic Policy Institute, \"The State of American Retirement,\" March 3, 2016", "Interview, Boston College Center for Retirement Research associate director Andrew Eschtruth, Dec. 19, 2016", "Federal Reserve Board, \"Report on the Economic Well-Being of U.S. Households in 2015,\" May 2016", "Email, Wellesley College economics professor and National Bureau of Economic Research’s Retirement Research Center associate director Courtney Coile, Dec. 16, 2016", "Email, University of Massachusetts at Amerherst economics professor Peter Arno, Dec. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]