["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Early voting -- known as in-person absentee voting prior to election day -- is popular in Milwaukee. (Milwaukee Journal Sentinel photo by Michael Sears)", "When The Nation revealed what it described as a Republican effort to suppress voting in Green Bay, news outlets around Wisconsin and across the country quickly responded with their own versions of the story.", "The article from The Nation, a magazine that describes itself as the flagship of the political left, called out the Green Bay city clerk for being opposed to opening a special early voting site at the University of Wisconsin-Green Bay.", "Featured was an email in which the clerk, who is responsible for administering elections, expressed concern about giving an advantage to Democrats.", "A group called Our Democracy 2020 responded to the article the next day, Oct. 26, 2016, with a news release that made this charge:", "\"To refuse to allow early voting on the UW-Green Bay campus because the clerk was afraid it would help Democrats not only shows outrageous partisan bias, it also interferes with the exercise of our most basic right.\"", "The clerk did express fear that opening a satellite location for early voting on campus would help Democrats.", "But in rejecting the campus site -- which would have been the only satellite location in the city -- was the clerk trying to avoid giving an unfair advantage to any political party, as election clerks by state law are supposed to do?", "Or was she showing \"outrageous partisan bias?\"", "The group and the backstory", "This is the first time we’ve checked Our Democracy 2020, a Madison-based coalition that formed in January 2015. The group, whose members include Common Cause Wisconsin and an affiliate of One Wisconsin Now, says its priorities include seeking changes in voting rights by the year 2020.", "The early voting at issue here is more formally known as in-person absentee voting -- that is, casting a ballot in person before election day.", "In July 2016, in a lawsuit involving One Wisconsin Now, a federal judge struck down limits on early voting that were approved by Republican Gov. Scott Walker and GOP lawmakers. As a result, cities were allowed to offer early voting in more locations, not just at City Hall. Milwaukee and Madison added satellite locations, but so far, Green Bay and most other communities in Wisconsin have not.", "(On election day, you must vote at the designated polling place near your home. But early in-person voting can be done at any location in your city that offers it.)", "The Green Bay situation", "The email featured in The Nation’s article, as well as related emails, were provided to the magazine by the One Wisconsin Now affiliate, which the article said obtained the emails through a public records request. The liberal advocacy group later provided the emails to us.", "They show that on Aug. 23, 2016, in the weeks after the court ruling, state Rep. Eric Genrich, D-Green Bay, began asking Green Bay City Clerk Kris Teske what her plan was regarding Green Bay offering early voting.", "He said he would like to see the city offer multiple satellite locations; UW-Green Bay was not mentioned. Teske said in her first reply: \"I’m very reluctant to have a satellite location for (ballot) security purposes and it is not budgeted for.\"", "Two days later, more emails were exchanged. Teske told Genrich the city would offer early voting at her office, leading Genrich to ask her again about multiple satellite locations.", "Teske replied: \"I don’t know what else there is to discuss,\" she began, reiterating that she lacks staff and money for satellite voting, and adding: \"There is no reason why anyone can’t either vote in our office, ask for an absentee ballot to be mailed to them, or vote on election day.\"", "Genrich persisted, asking for a meeting with Teske, and he evidently somehow conveyed to Teske that he wanted satellite voting at UW-Green Bay. (Long lines at the UW-Green Bay polling site for Wisconsin’s April 2016 primary election were cited as one reason for opening an early voting site on the campus.)", "Teske's reply, in the email featured in The Nation article, was sent the next day, Aug. 26, 2016, to the Wisconsin Ethics Commission. It read:", "I have a state representative who is being very persistent about having an alternate polling location at UWGB. I don’t like the idea at all for many reasons: Staffing, ballot security, budget, etc. He is on the ballot for 25 of our wards.", "I was reading the statutes and read: No site may be designated that affords an advantage to any political party. UWGB is a polling location for students and residents on election day but I feel by asking for this to be the site for early voting is encouraging the students to vote more than benefiting the city as a whole. I have heard it said that students lean more toward the Democrats and he is a Democrat. I have spoken with our (mayoral) chief of staff and others at City Hall and they agree that budget wise this isn't going to happen.", "A response came two weeks later, on Sept. 9, 2016, from Nathan Judnic, legal counsel for the Wisconsin Election Commission. He wrote that budget and ballot-security concerns are legitimate reasons for not offering satellite locations. But he also told Teske that if the UW-Green Bay polling site \"is OK for election day, and there is no political advantage then, I’m not sure what the difference is for in-person absentee voting at that same location.\"", "Teske, in turn, told Judnic that if she could open a satellite location, it would not be at UW-Green Bay because the campus is difficult to navigate and therefore students would likely be the only early voters in the city using it.", "A final note on the partisanship part of the claim regarding Teske:", "Teske does not show up in a database of donor to state political candidates. She was appointed city clerk by Green Bay Mayor James Schmitt. The mayor’s position is nonpartisan, but Schmitt backed the controversial move by Walker to strip away most collective bargaining rights from most public employees. And in March 2016 he attended a Donald Trump presidential campaign rally in Green Bay.", "Our rating", "Our Democracy 2020 says Teske refused to allow early voting on the UW-Green Bay campus because she \"was afraid it would help Democrats,\" showing \"outrageous partisan bias.\"", "Teske did express concern about giving an advantage to Democrats because of her belief that the site would be in area with more voters who support Democrats, and because the site was requested by a Democratic state lawmaker.", "But Teske also cited other reasons for not supporting the campus site for early voting -- including a lack of funding, a concern for ballot security and a concern for a state law that prohibits offering a satellite site that gives an advantage to any political party.", "Ultimately, the city decided not to open any satellite sites for early voting for the Nov. 8, 2016 election.", "For a statement that is partially accurate but leaves out important details, our rating is Half True.", "Our Democracy 2020, news release, Oct. 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]