["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Dec. 21 2020, the U.S. Senate passed the Consolidated Appropriations Act of 2021. Its aim was to merge a COVID-19 relief bill with the annual appropriations bill that allocates funds for the federal government. For COVID-19 relief, the bill authorized a one-time payment of $600 to most Americans — an amount criticized as inadequate compared to the economic suffering it seeks to mitigate.", "One popular tweet expressing this frustration asserted that each member of \"Congress made almost $100,000 during the time they were arguing whether or not we deserved $600.\"", "The veracity of this statement depends at least in part on how the assertion is specifically defined, but in general it is factually defensible. Members of Congress — both senators and representatives — each get paid $174,000 per year. What remains to be defined is the amount of time they spent \"arguing\" over the bill that provided a $600 stimulus check.", "In our view, it is fair to say that the fight for a second stimulus check began the moment after the CARES Act (which included authorization of a $1200 stimulus payment) was signed into law on March 27, 2020. There was bipartisan recognition that this massive spending bill would be insufficient to combat the economic problems caused by COVID-19. \"The minute we’re done with phase three,\" Senate Republican Policy Committee Chairman Roy Blunt said to The Hill on March 27, referring to the CARES act, \"we’ll start talking about phase four because all of us know that phase three can’t have included everything that needs to be included.” For Democrats, this explicitly included a desire for further direct payments to individual American citizens. Even before CARES officially became law, on March 25, House Speaker Nancy Pelosi told CNN, \"We'll get more direct payments in another bill.\"", "The \"fight\" over these direct payments, then, started as the first checks were authorized. The Consolidated Appropriations Act of 2021 was approved and sent to the president for his signature (or potential veto) on Dec. 21, 2020.", "Using these endpoints, the period of time \"during\" which this debate occurred would be 269 days. This represents 74% of the year. The most straightforward solution to the question would be to take 74% of the annual $174,000 salary. By this math, each lawmaker made at least $128,760 \"during\" the time it took the bill to pass.", "More restricted definitions might argue for a shorter time period of debate or argue that only days in which Congress was in session should count. The fact that politicians were talking about a second check even before CARES act was signed, however, makes that argument a hard sell. Because debates surrounding COVID-19 stimulus are not limited to session days, the latter argument does not make much sense either. As such, a simple approach that looks only at the amount of time it took members of Congress to pass a second bill suggests earnings of over $100,000 each, leading us to rank the claim \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]