["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post shows a disturbing image of a badly bruised woman and claims her injuries were sustained by her boyfriend, former Democratic congressman Keith Ellison, who now serves as Minnesota’s attorney general.", "The post displays a split image of Ellison on the left and, on the right, a photo of a woman with a swollen cheek and a bruised eye.", "Text above and below the image says:", "\"Keith Ellison the candidate for Minnesota attorney general and deputy chair of the democratic national committee did this to his girlfriend. But the Democrats don’t want to talk about this.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The information in the post is old. Ellison won the race for Minnesota’s attorney general in November 2018, after which he stepped down as deputy chair of the DNC.", "But was the woman in the photo Ellison’s girlfriend? And is he responsible for the injuries?", "No, and no. The image is miscaptioned and has appeared online on various websites for several years.", "After running a reverse-image search we found the photo of the injured woman has been shared online since at least 2013 on Russian websites, with little description or detail. The photo started including Ellison’s name right around the time his ex-girlfriend, Karen Monahan, accused him of abuse in 2018.", "In August of that year, Monahan’s son wrote a lengthy Facebook post that claimed Ellison abused his mother. Monahan confirmed her son’s account.", "In a statement, Ellison acknowledged the two were in a relationship that ended in 2016, but denied abusing her or that such a video existed.", "It was in that context that this bruised photo of a woman began to circulate online, with people claiming it was Monahan. But Monahan herself tweeted a response saying that it was not her, and asked users not to share it \"with any connection to me or my story. Please honor this ladies wounds, pain and trauma.\"", "This picture is NOT me. Please do not share with any connection to me or my story. Please honor this ladies wounds, pain and trauma. Thank you. https://t.co/JQn95QwyWW", "Monahan released medical notes from her doctor that said she reported she was in a physically and emotionally abusive relationship, and that she identified the partner as Ellison. But the doctor also noted that she did not have \"any physical injuries that required a physical examination.\"", "Facebook post, Sept. 18, 2019", "CNN, Rep. Keith Ellison wins bid for Minnesota attorney general despite abuse allegations, Nov. 7, 2018", "CNN, The allegations of abuse against Keith Ellison aren't going away, Sept. 23, 2018", "Vox, The latest developments in the abuse allegations against Rep. Keith Ellison, explained, Sept. 25, 2018", "TinEye, Reverse-image search, Sept. 25, 2019", "New York Times, Representative Keith Ellison Denies Domestic Abuse Allegations, Aug. 13, 2018", "Snopes, Does This Photograph Show a Woman Abused by Keith Ellison?, Sept. 22, 2018", "Twitter, Karen Monahan post, Aug. 12, 2018", "Twitter, Karen Monahan post, Sept. 18, 2018", "Twitter, Karen Monahan post, Sept. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]