["By Saranac Hale Spencer", "Posted on September 5, 2019", "A fake tweet circulating online attributes a made-up statement about hurricane preparation to Rep. Alexandria Ocasio-Cortez.", "Two popular targets for misinformation — Rep. Alexandria Ocasio-Cortez of New York and major weather events — have been combined in one recent falsehood.", "A fake tweet created as some states on the east coast prepared for Hurricane Dorian claims that Ocasio-Cortez posted this on her Twitter page: “I see people are rushing out to fill up their cars for this hurricane at the gas station This wouldn’t be an issue if they had electric cars. If the power is out for a week how are they going to get gas? We need to start planning ahead and moving forward.”", "Ocasio-Cortez, who has made a reputation for herself as an environmental advocate, didn’t post that message.", "Her Twitter account shows no such post and neither does Politwoops, a website that publishes the deleted tweets from public officials’ Twitter accounts.", "She did tweet on Aug. 30 — the same date as the fake tweet — about posters promoting her Green New Deal, which is aimed at addressing climate change and creating jobs.", "But the phony tweet has been circulating on Facebook — where it was shared by the Libertarian and Republican parties of Jefferson County, Colorado, and by the Republican Party of Elbert County, Colorado — and Twitter, where one account rephrased the claim as a quote from the congresswoman and it was retweeted a thousand times.", "This is just the latest example of a false statement attributed to Ocasio-Cortez that we’ve written about.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Funke, Daniel. “9 tips to avoid spreading misinformation about hurricanes.” Poynter. 12 Sep 2018.", "McDonald, Jessica. “The Facts on the ‘Green New Deal.’” FactCheck.org. 15 Feb 2019.", "Ocasio-Cortez, Alexandria (@AOC). Twitter. Accessed 3 Sep 2019.", "Deleted Tweets From Alexandria Ocasio-Cortez, D-N.Y. ProPublica and Politwoops. Accessed 3 Sep 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]