["On the presidential primary campaign trail in Iowa, Sen. Elizabeth Warren, D-Mass., brought out a favorite talking point: ways the president can bring down drug prices without waiting for Congress.", "It’s not the first time Warren and other candidates have referenced this alleged power. In this case, she pointed to insulin, EpiPens and HIV/AIDS drugs as possible targets.", "We asked the Warren campaign for the basis of her claim and they directed us to her \"Medicare for All\" transition plan. It identifies two legal mechanisms ― \"compulsory licensing\" as outlined in 28 U.S. Code Section 1498 and the so-called march-in rights provision of the 1980 Bayh-Dole Act.", "We spoke to legal and pharmaceutical policy experts about whether those mechanisms could be used to bring down drug prices, as Warren described. The answer? Yes. But it’s complicated and controversial.", "The legal mechanisms", "Of the two legal levers, Section 1498 is perhaps more straightforward.", "The law says the government can intervene to take over patents without a company’s permission, if the price is too high. The government can then create competition to bring down prices by importing those products from abroad, or manufacturing them. The original manufacturer can sue for damages but cannot stop Washington from breaking the patent.", "\"What they would do is announce they are taking other bids from other companies to supply the product\" to government programs such as Medicare, said Aaron Kesselheim, a professor of medicine at Harvard Medical School who researches drug pricing laws and has written extensively about Section 1498.", "The provision has been used before ― in the 1960s to procure cheap generic drugs ― and was invoked as recently as 2001, as a threat to get a better price on Ciprofloxacin, a high-powered antibiotic used to treat anthrax. It also was used in 2014 in non-pharmaceutical contexts, such as by the Defense Department to acquire lead-free bullets.", "Invoking this part of the U.S. code wouldn’t necessarily apply to all drugs, said Jacob Sherkow, a professor at New York Law School. But products such as the ones Warren mentioned ― insulin and EpiPens, for instance, which are patented in the United States and abroad, and cost far less in other countries ― would qualify. And that could send a message to other drug manufacturers.", "\"If you’re a particularly aggressive president, you can find some low-hanging fruit, and use 1498 to show other pharmaceutical companies you’re damn serious,\" Sherkow said.", "There are other caveats. Sherkow noted that licensing a competing drug is only part of the equation; competition often brings down drug prices, but not always. In addition, not all drugs have equivalent patents here and abroad, which complicates importation. But many of the technical obstacles are surmountable, argued Amy Kapczynski, a professor at Yale Law School.", "The march-in rights authority a little trickier. Bayh-Dole, the law that created march-in rights, suggests the government can \"march in\" when a drug isn’t available amid concerns over public health, such as an epidemic. It applies only to pharmaceuticals for which the government holds all the patents because it funded the research that led to their development. An example could be Truvada for PrEP, the HIV prevention pill, Kesselheim said.", "Unlike Section 1498, march-in rights have  never been used to negotiate a lower price ― despite multiple petitions to the National Institutes of Health, the federal agency that would approve and oversee the process.", "The question is whether high prices can constitute both a barrier and a public health concern having rendered  a drug unavailable. Sherkow, for one, expressed skepticism.", "NIH has historically opted against making this determination. For one, its directors have typically argued that cost isn’t within their area of expertise. And, for another, they have suggested that \"marching in\" would discourage pharmaceutical companies from using government-funded research ― ultimately leading to fewer breakthrough drugs being developed.", "\"That is a matter of culture, and I think a president could alter that perspective,\" Kesselheim said.", "Doing so, though, would require political capital. Even though Congress isn’t required to vote on the matter, the president would have to, for instance, appoint officials willing to change the NIH perspective ― and those leaders do require Senate confirmation. \"You’d probably have to defend it in court,\" Kesselheim added.", "Finally, these mechanisms would also draw sharp pushback from the pharmaceutical industry. Given the fervor over the drug pricing debate, neither Section 1498 nor march-in rights should be used ubiquitously, Kesselheim said.", "\"It is a complicated enough and politically charged enough procedure, that it’s something that should be reserved as a safety net for real public health emergencies,\" he said. \"I think Sen. Warren is identifying some of those cases.\"", "They’re all talking about it", "Warren’s proposals are part of a larger pattern ― Democratic presidential candidates including Vermont Sen. Bernie Sanders and former South Bend, Indiana, Mayor Pete Buttigieg ― have talked about ways to bring down drug prices without congressional action.", "Minnesota Sen. Amy Klobuchar also referenced such action during the January presidential primary debate.", "\"I have a plan of 137 things I found that a president can do herself in the first 100 days without Congress that are legal. And one of those things is that you can start bringing in less expensive drugs from other parties,\" she said.", "According to Klobuchar’s campaign, she was referring to a list she published on Medium in June 2019 in which she wrote that she would use \"existing Food and Drug Administration authority to grant a waiver that allows people to import safe prescription drugs for personal use from countries like Canada to decrease drug costs for seniors and all Americans.\"", "Sherkow said this is indeed another example. Section 804 of the Federal Food, Drug, and Cosmetic Act authorizes the HHS secretary to order the importation of specific drugs if it would impose no additional risk to the public’s health and safety and would result in a significant cost reduction. But this example also highlights the complexities involved and why it is not necessarily fast or easy.", "He pointed out that the president would have to nominate a candidate for secretary, get that person confirmed, then have the secretary make this order in respect to specific drugs, certify that the drugs are safe and would result in cost reduction ― then have the importation take place.", "\"Kudos to anyone for trying that in the first 100 days,\" Sherkow said.", "Our ruling", "Warren said, \"\"The president of the United States already has the legal authority to reduce the price of many commonly used prescription drugs.\" Multiple presidential candidates have talked about ways to bring down drug prices without new legislation.", "We focused on Warren’s argument: that the president already has this legal authority for many drugs, and that the power stems from Section 1498 and the march-in rights provision of a 1980 law. On these points, she is on firm ground.y", "Legal experts agreed that laws on the books do, in some cases, give the president that executive power ― and the cases Warren outlined are viable candidates, especially for \"compulsory licensing.\" The same experts also pointed out that even with this authority, the politics and logistics could be tricky, and that using these mechanisms wouldn’t address the entire drug pricing issue.", "We rate this statement True.", "Email exchange with Warren for President campaign, Jan. 27, 2020.", "Email exchange with Amy for America campaign staff, Jan. 15, 2020.", "Medium, \"My First Term Plan for Reducing Health Care Costs in America and Transitioning to Medicare for All,\" Nov. 15, 2019.", "Medium, \"Senator Amy Klobuchar Releases Plan of More Than 100 Actions for Her First 100 Days As President,\" June, 18, 2019.", "Health Affairs, \"'Government Patent Use': A Legal Approach to Reducing Drug Spending,\" May 2016.", "KFF, \"What’s the Latest on Medicare Drug Price Negotiations?\" Oct. 17, 2019.", "Letter to Tom Price on drug importation from Sens. Chuck Grassley, John McCain and Amy Klobuchar, Feb. 14, 2017.", "KHN, \"In The Battle To Control Drug Costs, Old Patent Laws Get New Life,\" Oct. 5, 2018.", "Yale Journal of Law and Technology, A Prescription for Excessive Drug Pricing: Leveraging Government Patent Use for Health, 2017.", "Email interview with Amy Kapczynski, professor of law, Yale Law School, Jan. 27, 2020.", "Telephone interview with Aaron Kesselheim, professor of medicine, Harvard Medical School, Jan. 27, 2020.", "Telephone interview with Jacob Sherkow, professor of law, Innovation Center for Law and Technology, New York Law School, Jan. 15, 27, 2020.", "Email exchange with Walid Gellad, director of the Center for Pharmaceutical Policy and Prescribing at the University of Pittsburgh, Jan. 15, 2020.", "21 U.S. Code 384: Importation of prescription drugs, Dec. 8, 2003.", "Pew Charitable Trusts, \"Policy Proposal: Importation of Prescription Drugs,\" April 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]