["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Poll workers check absentee ballot envelopes for signature on Nov. 3, 2020, at the Milwaukee Central Count facility. (Michael Sears/Milwaukee Journal Sentinel)", "About 30 states require absentee ballots not be counted until Election Day.", "But only a handful also require ballots not be processed until that point. Wisconsin is among the states with that limitation.", "It took all day and then some for Milwaukee election officials to count their mountain of absentee ballots in the 2020 presidential election", "And those 170,000 votes proved decisive. When the ballots were added to the state total about 3:30 a.m. Nov. 4, Wisconsin swung from a lead for President Donald Trump to a lead for former Vice President Joe Biden. A later canvass and recount confirmed Biden won the state by about 21,000 votes.", "But the swing and timing sparked an avalanche of misinformation, with Trump and an array of other Republicans claiming there was something nefarious about the late arrival of Milwaukee’s votes. Of course that’s ridiculous: We’ve noted in multiple False and Pants on Fire ratings that the absentee votes from Milwaukee, a Democratic stronghold, were long expected to heavily favor Biden and to come in late.", "The controversy stems from limitations in state law on when election workers can process absentee votes — limitations that were unchanged despite the massive increase in this kind of voting amid the pandemic.", "State Sen. Tim Carpenter, D-Milwaukee, raised this point in a letter to the state’s Republican legislative leaders, seeking a bipartisan task force to improve Wisconsin’s voting system.", "\"Wisconsin is one of the few states that doesn’t allow absentee ballots to be processed before Election Day,\" Carpenter said in the Dec. 11, 2020, news release.", "\"Allowing this simple change would stop the false accusation that tens of thousands of ballots are secretly being dumped after midnight changing the outcome of the election. We all know our current process and know that is not true. It is just a matter our laws requiring workers to wait until 7:00 AM on Election Day to begin tabulating.\"", "Is Carpenter right that Wisconsin law handcuffs election officials in a way most states don’t?", "The short answer is yes.", "The longer answer depends a bit on how you define processing.", "The National Conference of State Legislatures compiled details on how each state handled absentee ballots for the 2020 election.", "Their research showed many states limit counting of absentee votes to Election Day — about 30 in all.", "But few go as far as Wisconsin in not allowing any ballot processing until that day. Only Alabama, Indiana, Mississippi, Pennsylvania, West Virginia and Wyoming require that ballots not be processed until Election Day. (Michigan requires smaller cities to wait until Election Day, while those with 25,000 or more people can start a day early.)", "The timelines vary among the other states, with some allowing ballots to be processed as soon as they are received, while others begin the process a set amount of time before Election Day.", "A New York Times breakdown of when states are allowed to begin \"pre-processing\" ballots — defined as verifying signatures, opening envelopes and flattening ballots to get them ready for tabulation — shortened that list further, showing only Alabama, Mississippi, Pennsylvania and Wisconsin limiting this to Election Day.", "We saw dramatically different vote reporting dynamics in states that allow this earlier ballot processing. In North Carolina, for example, where absentee votes can be processed five weeks before the election and counted two weeks before, an early lead for Biden turned into a Trump win as in-person votes were added to the tallies later in the day.", "Carpenter said Wisconsin is one of the few states that don’t allow absentee ballots to be processed before Election Day.", "However we define that processing, it’s clear Wisconsin in the extreme minority. Just a handful of states ban election workers from beginning work on absentee ballots before Election Day.", "We rate this claim True.", "Tim Carpenter, news release, Dec. 11, 2020", "National Conference of State Legislatures, Absentee and Mail Voting Policies in Effect for the 2020 Election, Nov. 3, 2020", "New York Times, Where Americans Can Vote by Mail in the 2020 Elections, Aug. 14, 2020", "National Conference of State Legislatures,VOPP Table 16: When Absentee/Mail Ballot Processing and Counting Can Begin, Oct. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]