["About this rating", "A few days after President Trump inadvertently used the non-word \"covfefe\" in a tweet complaining about the media, the web site USPOLN published an article saying that White House Press Secretary Sean Spicer had claimed that Trump had the authority to alter the spellings of words. Published on 2 June 2017, the item read:", "White House Press Secretary Sean Spicer drew widespread laughter from reporters when he insisted that President Donald Trump’s infamous “covfefe” tweet was not a misspelling. After one reporter asked Spicer if “people should be concerned that the president posted somewhat of an incoherent tweet last night,” Spicer simply replied, “No.” The reporter then asked Spicer why the misspelled tweet stayed up for so long. “The president and a small group of people know exactly what he meant,” Spicer replied, which elicited laughter throughout the room. Reporters then tried to ask Spicer what “covfefe” actually means, but he quickly moved on to another question ... The press secretary then turned to defending the president’s tweet. “You don’t realize how much this is all playing into Donald Trump’s hand, this is exactly what he’s after. He’s that smart, believe me[.\"]", "“My point is – it’s beyond whether or not it happened intentionally. Many of you may not like it, but the fact is that Donald Trump is the head of state and as such, it is within his legal right and power to decide how words in the English language are spelled, written, conjugated and all that good stuff ... Because, that’s just one of the many perks of being President of the United States. It comes with the territory and it’s up to you to decide whether or not you want to use it,” Spicer concluded.", "Spicer made no such claim about \"covfeve,\" as USPOLN was a fake news site whose disclaimer explained:", "DISCLAIMER: USPOLN may include information from sources that may or may not be reliable and facts that don’t necessarily exist. These Articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney.", "Spicer's actual response to questions about the mistyped word did draw widespread media attention, however. The Boston Globe reported:", "“Do you think people should be concerned that the president posted somewhat of an incoherent tweet last night and that it then stayed up for hours?” a reporter asked Spicer, according to audio of the briefing.", "“Um, no,” Spicer replied.", "“Why did it stay up so long? Is no one watching this?” the reporter pressed.", "“I think the president and a small group of people knew exactly what he meant,” Spicer replied.", "However, it is clear that the President simply mistyped the word \"coverage.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]