["About this rating", "Following the Oct. 13, 2020, confirmation hearing of Judge Amy Coney Barrett, U.S. President Donald Trump’s pick for the Supreme Court, dictionary publisher Merriam-Webster updated its definition and usage guidelines its entry of “sexual preference” to include a statement to the effect that use of the term is “offensive.”", "Barrett's use of the term during the hearing incited anger in the LGBTQ community from those who argue that the phrase is outdated and linked to anti-gay sentiments.", "This claim that Merriam-Webster added the comment is true — but the reason for the change isn't what had been largely assumed.", "The screenshot below was taken from the Merriam-Webster website’s definition of “sexual preference,” and reflected the most current definition at the time of this writing (highlight added).", "Though Merriam-Webster didn't change its usage guidelines because of Barrett's comments, a spokesperson with the dictionary told Snopes that the public attention focused on the term after her comments prompted the update. The dictionary update came after Barrett was questioned by members of the Senate Judiciary Committee on her position surrounding LGBTQ issues. She responded by noting that she had “never discriminated on the basis of sexual preference and would not ever discriminate on the basis of sexual preference.”", "In its update, the 150-year-old dictionary publisher argued that using the term “sexual preference” implies the “suggestion that a person can choose who they are sexually or romantically attracted to.”", "Peter Sokolowski, editor-at-large for Merriam-Webster, told Snopes in an email that the work of revising the dictionary is ongoing and continuous — and the update was a routine part of the job.", "“Our scheduled updates, which add new words and also add new definitions, usage guidance, and example sentences to existing dictionary entries, take place several times per year,” said Sokolowski. “From time to time, we release one or some of these scheduled changes early when a word or set of words is getting extra attention, and it would seem timely to share that update: the public is implicitly asking us a question by looking up a word, and we are immediately able to provide additional information.”", "“In this case, we released the update for sexual preference when we noticed that the entries for preference and sexual preference were being consulted in connection with the SCOTUS hearings. A revision made in response to an entry's increased attention differs only in celerity—as always, all revisions reflect evidence of use,” noted Sokolowski, adding that similar updates were issued in March 2020 for terms connected to the COVID-19 pandemic.", "The controversy arose on the second day of her confirmation hearing when Barrett was asked by Sen. Diane Feinstein, D-Calif., to comment on whether the nominee agreed with LGBTQ-related opinions held by the late Justice Antonin Scalia, whom Barrett spent decades clerking for, particularly whether Barrett agreed that the “U.S. Constitution does not afford gay people the fundamental right to marry.”", "During his career, Scalia wrote dissenting opinions when it came to LGBTQ issues, defending a state’s ability to openly discriminate against the LGBTQ community (Romer v. Evans in 1996), defending a state’s right to criminally prosecute someone for same-sexual activity (Lawrence v. Texas in 2003), and defending the federal government’s right to deny federal recognition of same-sex marriages (U.S. v. Windsor in 2013). Many news publications and political commentators have argued that Barrett’s religious roots in a conservative Christian community may hinder her ability to objectively rule, particularly when it comes to issues of abortion, gay rights, and racial injustice.", "Barrett replied with the following:", "Senator, I have no agenda, and I do want to be clear that I have never discriminated on the basis of sexual preference and would not ever discriminate on the basis of sexual preference. Like racism, I think discrimination is abhorrent. On the questions of law, however, because I’m a sitting judge and because you can’t answer questions without going through the judicial process, can’t give answers to those very specific questions.", "Sen. Mazie Hirono, D-Hawaii, noted that Barrett used the term sexual preference “not once, but twice,” even though it was considered to be an “offensive and outdated term.”", "“It is used by anti-LGBTQ activists to suggest that sexual orientation is a choice. It is not. Sexual orientation is a key part of a person’s identity,” responded Hirono, who added that she didn’t think its use was “an accident.”", "Barrett responded to Hirono, saying that she did not mean to imply that she thought sexual orientation was an “immutable characteristic or that it’s solely a matter of preference,” and denied meaning to make any offense, citing a case that allowed same-sex couples to marry.", "“Senator, I’m saying I was not trying to make any comment on it. I fully respect all the rights of the LGBTQ community. Obergefell is an important precedent of the court. I reject any kind of discrimination on any sort of basis,” furthered Barrett.", "https://www.c-span.org/video/?476316-1/barrett-confirmation-hearing-day-2-part-1&live=", "The dictionary update went viral after Steve Krakauer shared a tweet on Oct. 13, 2020, in which he pointed out that Merriam-Webster previously included a definition of “preference” as “orientation” or “sexual orientation,” and later updated to include the word “offensive.”", "\"As recently as last month, Webster's Dictionary included a definition of 'preference' as 'orientation' or 'sexual preference.' TODAY they changed it and added the word 'offensive.' Insane—I just checked through Wayback Machine and it's real,\" Krakauer tweeted.", "Krakauer’s claim is also accurate. An analysis of pages archived using the internet archival website Wayback Machine found that Merriam-Webster's definition of “preference” included hyperlinks to both “orientation” and “sexual preference,” but did not include the word “offensive” as of Sept. 28. By Oct. 14, the definition had been updated to include the word “offensive.”", "Barrett's use of the term \"sexual preference\" sparked outrage within the LGBTQ community and was described as “archaic” because its use implies that sexuality is a choice.", "“The word ‘preference’ signals that sexual orientation is a choice, rather than an immutable characteristic. That assumption has been used to undermine protections for people based on sexual orientation,” Nick Morrow, deputy communications director at the Human Rights Campaign (HRC), told Snopes in an email.", "The organization, which advocates for equal rights and protections for LGBTQ communities, has voiced concerns over Barrett’s nomination, noting that she is “hostile to the rights of LGBTQ people.”", "“There is no room for hate or discrimination on the Supreme Court. If Barrett is confirmed, our marriages, our families, our health care and our LGBTQ youth would be at risk,\" said Alphonso David, president of the HRC, in a statement sent to Snopes. \"This upcoming term and beyond, we expect crucial cases about the future of LGBTQ rights to appear before the Court. Amy Coney Barrett poses a clear threat to any progress we can expect to see from the Court, and her record shows she will take every opportunity to oppose us and scale back our rights.\"", "Phillips, Morgan.   \"Merriam-Webster Changes Its Definition of ‘Sexual Preference’ As Barrett Gets Called Out for Using Term.\"\r\n    Fox News.   14 October 2020.", "Williams, Janice.   \"Merriam-Webster Dictionary Adds ‘Offensive’ to ‘Sexual Preference’ Definition After Amy Coney Barrett Uses Term in Hearings.\"\r\n    Newsweek.   14 October 2020.", "Miller, Ryan.   \"Merriam-Webster Dictionary Updates ‘Sexual Preference’ Entry After Amy Coney Barrett Hearing.\"\r\n    USA Today.   15 October 2020.", "Stern, Mark Joseph.   \"Why Amy Coney Barrett’s Use of ‘Sexual Preference’ is So Alarming.\"\r\n    Slate.   13 October 2020.", "\"United States v. Windsor.\"\r\n    Oyez.   26 June 2013.", "\"Lawrence v. Texas.\"\r\n    Oyez.   26 June 2003.", "\"Romer v. Evans.\"\r\n    Oyez.   20 May 1996.", "Reich, Robert.   \"Trump and Barrett’s Threat to Abortion and LGBTQ Rights is Simply Un-American.\"\r\n    The Guardian.   18 October 2020.", "Feldman, Noah.   \"Amy Coney Barrett Should Recuse Herself on Abortion Cases.\"\r\n    Bloomberg.   18 October 2020.", "\"Amy Coney Barrett Senate Confirmation Hearing Day 2 Transcript.\"\r\n    Rev.   13 October 2020.", "\"Coronavirus and the New Words We Added to the Dictionary in March 2020.\"\r\n    Merriam-Webster.   March 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]