["The purported news graphic was shared on Twitter on February 22, 2021. It was retweeted more than 300 times before it was deleted.", "The graphic contains an image of Carlito Galvez, the Philippine official in charge of Covid-19 vaccine procurement. It attributes a quote to him in Tagalog that reads: \"Let us not belittle Sinovac. Despite its 50.4% efficacy, it's better than nothing. The low efficacy rate is just not for health workers. It can be given to poor Filipinos so it doesn't go to waste.\"", "“His own words,” the misleading post’s caption states. “Galvez, why don't you give your lung the jab so the vaccine doesn't go to waste.”", "An identical graphic was also shared here on Twitter; and here, here and here on Facebook.", "The posts surfaced online after the Philippines’ drug regulator granted emergency approval to CoronaVac, made by Chinese firm Sinovac, on February 22, 2021. It said, however, the vaccine was not recommended for health workers due to published data suggesting it has lower efficacy than Covid-19 vaccines made by Pfizer/BioNTech and Oxford/AstraZeneca.", "Workers considered essential to the economy and soldiers were likely to receive the first vaccinations in the Philippines, AFP reported.", "Although trials in Turkey found CoronaVac to be 91.25 percent effective, other, more robust trials in Brazil only demonstrated an efficacy rate of around 50 percent.", "The graphic in the social media posts, however, had been doctored.", "Keyword searches on Google found the original was posted on Twitter by local news organisation ABS-CBN on December 22, 2020. It contains a different quote.", "\"All in all, if there's going to be (contract) signing this coming month, we will have 60 million (doses of Covid-19 vaccine) for the second quarter and third quarter,\" the original quote reads.", "Galvez made the comments in a meeting on December 21, 2020, in which top government officials discussed the country’s Covid-19 vaccination programme.", "The doctored image mimics the black, white and red colours used in the original ABS-CBN graphic, as well as the photo caption \"Jonathan Cellona, ABS-CBN News/file\", as highlighted below.", "ABS-CBN denied publishing the graphic in the misleading posts, calling it “a fake art card using ABS-CBN News' template” in this statement posted on Twitter on February 23, 2021.", "Galvez’s office denied he made the remarks in a tweet on February 23, which said he “has never issued any such public statement and will never do so.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]