["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A disturbing image of what appears to be a tiger on fire has been viewed more than 20 million times since it was posted on Jan. 4.", "Given the timing, many commenters assumed the photo depicts a scene from this season’s devastating bush fires in Australia — which has burned millions of acres and killed over 20 people and millions of animals.", "The Facebook account that posted the image, Mr. Fluffy PH, included it in a multi-photo post shared 84,000 times that shows animals surrounded by smoke or fire, with the caption, \"Huge wildfire in Australia has resulted in deaths of more than 480 milion animals. Hundred of rare koalas are also reported dead among them. Lets pray for Australia Source: University of sydney report #wildfire.\" The Facebook page also has as its cover image a separate photo that shows a kangaroo rushing past a burning house on Dec. 31; that picture was legitimately captured in New South Wales, Australia, by photojournalist Matthew Abbott.", "The University of Sydney estimated Jan. 3 that 480 million animals have been killed in the New South Wales bushfires since September 2019.", "The tiger image, however, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found that the photo is several years old, was not taken in Australia and does not show animals killed in a fire.", "The image is from 2012 and depicts a bonfire of confiscated taxidermy animals in Jakarta, Indonesia. (Several commenters on the multi-photo post also said that some of the other images are from other fires, as well).", "Trading in or being in possession of protected animals or their body parts is a criminal offense in Indonesia, and animal traffickers can face up to five years in jail and fines up to $10,000 USD.", "Jakarta officials seized 258 animal remains in the 2012 raid, according to an article by the Daily Mail, which included 15 tigers, 2 sun bears and 48 deer, before destroying them. The animals had all been killed by poachers before being stuffed and sold to be displayed in peoples homes.", "Australia’s fire season is shaping up to be one of the deadliest for the country’s wildlife, but this image is unrelated. We rate the post Mostly False.", "Facebook post, Jan. 4, 2020", "Facebook post, Jan. 4, 2020", "CNN, Here's just how bad the devastating Australian fires are -- by the numbers, Jan. 6, 2020", "New York Times, Apocalyptic Scenes in Australia as Fires Turn Skies Blood Red, Jan. 2, 2020", "Tin Eye, reverse-image search, Jan. 6, 2020", "Daily Mail, Bonfire of the endangered animals: Rare stuffed tigers and bears heaped on to pile and burned, Nov. 14, 2012", "Convention on International Trade in Endangered Species of Wild Fauna and Flora, List of Contracting Parties, Accessed Jan. 6, 2020", "Sydney Morning Herald, Australian tip-off leads to online wildlife trafficking sting in Indonesia, Feb. 11, 2016", "NBC News, Australia's fires could change the country forever, Jan. 4, 2020", "University of Sydney, A statement about the 480 million animals killed in NSW bushfires since September, Jan. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]