["By D'Angelo Gore", "Posted on December 17, 2020", "A Democratic super PAC cherry-picks from huge appropriations bills that Georgia Republican Sen. David Perdue opposed in order to accuse him of trying to increase his own pay while rejecting pay increases for the military.", "In a TV ad from American Bridge 21st Century, Dave, “a lifelong Georgia Republican” and former U.S. Marine Corps drill instructor, says, “When I look at David Perdue, I see a man that only serves himself by voting for pay raises for himself while he votes against military pay raises.”", "But Perdue has said he opposed the spending legislation in question for reasons that had nothing to do with the provisions concerning congressional or military pay, which were only part of the bills.", "The group, officially known as AB PAC, says the ad is airing in five media markets across Georgia and “is part of a multi-million dollar program to help defeat Kelly Loeffler and David Perdue in the January 5th Georgia runoff election.” The ad has already run more than 1,200 times since Dec. 12, according to AdImpact.", "Under a 1989 law, members of Congress are eligible to receive an annual cost-of-living adjustment to their salary that is determined by a formula based on private sector wages. The adjustment happens automatically unless members pass legislation to stop it.", "And since 2009 — when pay for most U.S. senators and representatives was raised to $174,000 — Congress has consistently voted to approve bills including language to block additional hikes. Perdue, who has been in the Senate since 2015, has voted for some of those bills.", "To support the claim that Perdue backed “pay raises for himself,” the ad cites his March 2018 vote against an omnibus spending bill, known as the Consolidated Appropriations Act of 2018, which included a section freezing congressional pay for that fiscal year. The ad also cites Perdue’s December 2016 vote against the Further Continuing and Security Assistance Appropriations Act of 2017, which funded the government though April 28, 2017, and included language prohibiting a bump in member wages for the 2017 fiscal year.", "But the votes on the large appropriations bills were not simply for or against raising pay for Congress.", "Perdue, who had an estimated average net worth of almost $26 million as of 2018, actually issued press releases explaining both of his votes; in neither case did he say he was motivated by the provisions rejecting the cost-of-living adjustments.", "Perdue said he voted against the 2018 omnibus bill — which still became law — because of its estimated $1.3 trillion cost and the way it was put together.", "“Unfortunately, this spending bill is not a product that represents everybody. It’s a product written by a few politicians who got in a room and decided how to spend a trillion dollars. The result is a massive spending package projected to increase the federal debt by another trillion dollars. This is no way to fund the federal government,” he said in a March 22, 2018, statement.", "Perdue said he opposed the 2017 continuing resolution — which also was enacted — because it funded the government only temporarily rather than for the full fiscal cycle.", "“Here we go again. For the 19th consecutive year, Washington has not funded the federal government on time. As the current continuing resolution is expiring in the midnight hour, Congress is once again trying to pass a temporary fix three months after the beginning of the current fiscal year. This is ridiculous,” he said in a Dec. 10, 2016, release.", "By law, increases in basic military pay are determined by a statutory formula, and the automatic adjustments can only be changed by the president or Congress.", "To support the claim that Perdue “votes against military pay raises,” the ad again cites his March 2018 vote against the omnibus bill, which, among other things, included funding for a 2.4% pay increase for military personnel. The ad also highlights his September 2018 vote against a minibus spending bill and continuing resolution for fiscal year 2019 that included money for a 2.6% military pay raise, as well as other appropriations for the departments of defense, labor, health and education.", "But as we already noted, Perdue said he voted against the 2018 spending bill out of concern about its overall cost and the budget process — not because of a pay increase for service members. In fact, he said he wouldn’t support the legislation despite the fact that it included additional military funds.", "“While this bill provides our military with more funding, it does not provide them with more certainty in the long-term,” he said in his statement. “The larger problem here is the budget process has failed again. It is imperative the newly formed Joint Select Committee change the budget process to address the structural problems that lead to this unacceptable outcome.”", "As for the two-bill minibus and continuing resolution that he later opposed that year, Perdue said he did so because it was yet another short-term spending bill.", "“Here we go again. In typical Washington fashion, Congress has once again fallen short of completing its Constitutional responsibility. We had the opportunity to fully fund the government on time for the first time in 22 years. Congress has used over 180 continuing resolutions instead of getting it all done. We are going to walk past the deadline on September 30th and fall into the same trap. This is unacceptable,” he said in a Sept. 18, 2018, statement.", "“We didn’t cancel August recess and make significant progress on the appropriations process only to give up this close to the finish line. In the real world, you are held accountable to complete the job. The goal should be to never do another continuing resolution.”", "In a statement to FactCheck.org, Perdue’s campaign argued that he has supported pay increases for the military.", "“Since taking office, Senator Perdue has consistently supported our women and men in uniform and has been the top advocate for Georgia’s military community,” Perdue’s communications director, John Burke, said in an email. “He was proud to vote for the largest military pay increase in a decade and is committed to ensuring our armed forces are compensated for the very important work they do to keep us safe.”", "That’s a reference to Perdue’s votes for the National Defense Authorization Act of 2020, which authorized the statutorily calculated 3.1% increase in military pay, and the Consolidated Appropriations Act of 2020, which included funding for the raise.", "But the super PAC attacking Perdue defended its ad, arguing that the claim about the senator “voting for pay raises for himself while he votes against military pay raises” is factual.", "“Nothing in that statement is untrue,” American Bridge 21st Century spokesperson Zach Hudson said in an email to us.", "“Perdue has voted for pay raises for himself. He has voted against military pay raises. It doesn’t matter what else he has voted on. He has cast votes that justify those statements.”", "But it’s not as simple as Hudson says.", "The super PAC is focusing on one or two sections of massive spending bills that Perdue said he opposed for reasons unrelated to pay increases for Congress or the military. He didn’t vote specifically for congressional pay raises or against military pay raises, which the ad could lead viewers to believe.", "Robert Farley contributed to this article.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]