["The Bharatiya Janata Party introduced three new agricultural bills in the Parliament, which were passed in the Lok Sabha on September 17, 2020. Farmers across the country, especially from Punjab and Haryana, have been protesting the new laws at the Delhi border since November.", "BJP Delhi leader Tajinder Pal Singh Bagga shared a 49-second clip of Arvind Kejriwal on March 20, where the Delhi Chief Minister is saying, “Agriculture is a very important issue, I completely concede. And there are many dimensions to it, sir. The biggest dimension is agriculture pricing, the kind of prices we are giving. All the controls that we have placed on the farmers will also have to be removed. A farmer can sell only in the mandi, why can’t he sell outside of it? Why can’t he sell in other states, why only in his own state? All these controls that we have put on the small farmer. They are opposing the same controls that you are unhappy with. I think these need to be removed, there needs to be deregulation. The government needs to step off and reconsider the prices that we are offering, I’m just giving a small example…”", "Bagga claimed that Kejriwal welcomed the farm bills introduced by the Modi government. His tweet was retweeted by more than 2,200 people and garnered more than 31,000 views at the time of writing.", "मोदी जी द्वारा लाये गए बिल को पढ़ने के बाद @ArvindKejriwal जी ने बिल को सुपोर्ट करने का फैसला किया । हम केजरीवाल जी का हार्दिक धन्यवाद करते है । pic.twitter.com/oGwNiLflJw", "— Tajinder Pal Singh Bagga (@TajinderBagga) March 20, 2021", "Several Twitter users also shared Bagga’s video.", ". @ArvindKejriwal जी ने बिल को सुपोर्ट करने का फैसला किया ,और अब सर जी सभी किसानों को समझाने के लिये गाँव गाँव मे जाकर आंदोलन और धरना भी करेंगे कि जो ये बिल @narendramodi जी लाये है इसमें किसान भाइयों को फायदा ही फायदा है । हम केजरीवाल जी का तहेदिल से हार्दिक धन्यवाद करते है । pic.twitter.com/CnghLqeu2z", "— Sarika Jain (@SarikaJainBJP) March 20, 2021", "It is also circulating on Facebook.", "मोदी जी द्वारा लाये गए बिल को पढ़ने के बाद अरविंद केजरीवाल जी ने बिल को सुपोर्ट करने का फैसला किया । हम केजरीवाल जी का हार्दिक धन्यवाद करते है ।", "Posted by Kunal Nath Madhav on Saturday, March 20, 2021", "Alt News has received verification requests for the video on its mobile application.", "We noticed that ‘CII’ appears on the banner behind Arvind Kejriwal in the clip. Based on this, we performed a keyword search on YouTube and found the original clip uploaded by the Confederation of Indian Industry (CII) seven years ago. Kejriwal had attended the CII National Council Meeting 2013-14 held in Delhi. This video was uploaded on February 17, 2014.", "One among the members of the conference questioned Kejriwal, “As a nation, we need another green, yellow and white revolution. It is difficult to improve food prices unless we increase productivity on a large scale. And not just economic growth, but also law and order. Your point on corruption is correct, but we have to move beyond that in agriculture. What do you think about this?”", "The Delhi Chief Minister’s reply can be heard onward the 7:22 mark. He said, “Agriculture is an important issue, I accept that. I would like to give a small example…I don’t remember exactly whether it was wheat or rice. According to the Haryana government records, the cost of production of that particular product is Rs 1,580 per quintal. And the minimum support price is Rs 1,250. You are not even giving the farmer a cost at the minimum support price, so how will he live? There will obviously be a problem. The Swaminathan report says that we should give them cost plus 50% of the profits. If you start giving the farmer an honest profit–but there are many other complicated things. I think we need to do many more things in agriculture… ”", "Not only did Tajinder Bagga post a video from 2014 to falsely suggest that Kejriwal spoke in support of the agricultural laws introduced seven years later, but he also did not share the part where the Chief Minister talked about increasing the minimum support price (MSP). The new legislation does not have any provision safeguarding the continuance of the existing MSP.", "Earlier in January, BJP leader Sambit Patra shared a cropped video of Kejriwal, claiming that he had come out in support of the farm laws. Alt News found that the Delhi Chief Minister was in fact opposing the law but his speech was clipped and edited from different parts and merged together.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]