["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Even if Republican senators agree to consider President Barack Obama’s Supreme Court nominee, his record on gun rights alone will stop his confirmation, says Fox News host Bill O’Reilly.", "On his show March 16, O’Reilly acknowledged that Obama’s pick — Merrick Garland, chief judge of the federal court of appeals for the D.C. circuit— is \"not some crazy left-wing bomb thrower.\"", "\"But he voted, so the folks know, in Washington, D.C., to keep guns away from private citizens, and the Supreme Court of course said no, that is unconstitutional,\" O’Reilly added. \"But he voted to keep the guns away. Just that vote, and you must know this, alienates most in the Republican Party, so they never would vote to confirm him.\"", "A few conservative groups and figures have already attacked Garland for his position on guns since his nomination. We’re putting O’Reilly’s specific claim that Garland voted \"to keep guns away from private citizens\" on the Truth-O-Meter.", "D.C. gun ban", "O’Reilly’s statement refers to a landmark case on gun rights, District of Columbia vs. Heller. In its 2008 ruling, the Supreme Court found that Washington’s gun regulations — essentially amounting to a ban on handguns in the home — were unconstitutional.", "This ruling was significant because it was the first time the court held that the Second Amendment guarantees an individual’s right to own a firearm for self defense. Up until Heller, the widespread understanding of the Second Amendment was that the right to bear arms did not necessarily extend beyond militia service.", "Before the case went to the Supreme Court, though, it appeared in the federal court of appeals for the D.C. circuit, where Garland has been a judge since 1997, as Parker vs. District of Columbia. In a 2-1 decision, a panel of three D.C. Circuit judges came to the same conclusion as the Supreme Court: The Washington handgun ban was unconstitutional.", "Based on O’Reilly’s claim, one might assume that the single dissenting vote in this D.C. Circuit opinion belonged to Garland. However, it was Judge Karen Henderson who dissented, while Judges Laurence Silberman and Thomas Griffith signed the majority opinion.", "Garland didn’t vote on this case at all.", "After the D.C. Circuit handed down its 2007 decision, the city of Washington asked the court to rehear the case en banc, meaning all of the court’s judges would reconsider the case, not just the panel of three. The court ended up denying the city’s petition, but Garland was among the group of D.C. Circuit judges who was in favor of rehearing the case.", "It’s not fair to conclude that Garland supported the Washington gun regulations because he wanted to reconsider the case, as he did not take a formal position on the merits of the case. Rehearing a case en banc is generally used when a case goes against precedent or presents a question of significant importance, and that was true of the Heller case.", "D.C. Circuit Judge A. Raymond Randolph, a well-known conservative, joined Garland in voting to reconsider the case. And the Bush administration, though supportive of the notion that the Second Amendment protects individual rights, filed an amicus brief to the Supreme Court asking them to send Heller back to the lower courts for consideration, noted Adam Winkler, a Second Amendment law expert at the University of California Los Angeles Law School.", "\"Garland voted for his court to consider the constitutionality of D.C.'s law,\" Winkler said. \"Such a vote does not tell us one way or another how Garland feels about the Second Amendment.\"", "We should also note another case, which some critics say indicates that Garland has a left-leaning opinion of the Second Amendment. In 2000, he joined the majority opinion in a 2-1 finding that the FBI could hold on to gun purchase records for six months for auditing purposes, to make sure the instant background check systems worked.", "The National Rifle Association called the six-month record retention an \"illegal national registration of gun owners,\" while the court found that it was a common-sense auditing system, not a national firearm registry, according to news reports from the time.", "Our ruling", "O’Reilly said Merrick Garland \"voted, so the folks know, in Washington, D.C., to keep guns away from private citizens.\"", "Garland never heard the case about Washington gun laws from the bench, and so he never voted on it.", "He voted in favor of reconsidering the case, but it’s impossible to extrapolate from that vote his position on the merits of the case.", "We rate O’Reilly’s claim False.", "Washington Post, \"Appeals Court Rules FBI Can Keep Gun Records; Judges Allow 6 Months' Grace for Audits,\" July 12, 2000", "Washington Post, \"D.C.'s Ban On Handguns In Homes Is Thrown Out,\" March 10, 2007", "Washington Post, \"D.C. Asks Supreme Court to Back Gun Ban,\" Sept. 4, 2007", "Washington Post, \"Appellate Judges Let Gun Ruling Stand,\" May 9, 2007", "Washington Post, \"Justices Reject D.C. Ban On Handgun Ownership,\" June 27, 2008", "SCOTUSblog, \"The Potential Nomination of Merrick Garland,\" April 26, 2010", "Supreme Court, amicus brief on behalf of the Bush administration, January 2008", "D.C. Circuit, request for en banc petition, April 9, 2007", "D.C. Circuit, denial of en banc request petition, May 8, 2007", "Federal Rules of Appellate Procedure, Rule 35. En Banc Determination, accessed March 17, 2016", "Oyez, District of Columbia v. Heller, June 26, 2008", "Nexis news search, conducted March 17, 2016", "Email interview, UCLA Law professor Adam Winkler, March 17, 2016", "Email interview, White House spokesperson Jesse Lee, March 17, 2016", "Email interview, Fox spokesperson Dana Klinghoffer, March 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]