["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• There is no evidence that House Speaker Nancy Pelosi purchased stock in foreign oil companies before the Keystone pipeline project was halted on Jan. 20.", "• Pelosi’s transaction report filed Jan. 21 does not list any trades involving oil companies.", "More Facebook posts are claiming that House Speaker Nancy Pelosi sought to profit from advance knowledge of policy changes under President Joe Biden.", "One such post says, \"Pelosi bought 1.5m in foreign oil stock day before shut down of American line.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found no evidence to back the claim. Pelosi’s most recent government disclosure form for stocks does not include any oil company stock purchases. No media outlet has reported on such a transaction, and her staff said the claim is false.", "The post’s reference to the \"shut down of American line\" likely means Biden’s Jan. 20 executive order that revoked construction permits for the Keystone XL pipeline, designed to carry crude oil from Canada to the Gulf Coast.", "Biden’s opposition to the project was well-known long before his order, so the executive order was not a surprise. Biden was vice president in the Obama administration, which rejected a permit for the pipeline on environmental grounds. His campaign affirmed his opposition in May 2020, when he was the presumptive Democratic nominee for president.", "The claim says Pelosi bought the oil stock the day before the shutdown order, which would have been Jan. 19. Pelosi filed a Periodic Transaction Report dated Jan. 21 that disclosed her husband’s purchase of stock or stock options in four companies, none of which were oil companies. The reports are required when members of Congress — or their spouses or dependent children — make stock purchases worth more than $1,000.", "The reports must be filed within 30 days of when the member became aware of the transaction, but no more than 45 days after the transaction. The Jan. 21 report was the only one Pelosi has filed in 2021. Any Jan. 19 transaction would have to be reported by March 5.", "Drew Hammill, deputy chief of staff for Pelosi, said the claim is false, adding that the speaker does not own any stocks. We didn’t get a response to a request for further information. A financial disclosure report Pelosi filed in August 2020 lists substantial holdings of individual stocks by her husband.", "The Jan. 21 transaction report was the subject of other claims that Pelosi traded in Tesla stock ahead of a Biden order calling for government purchases of electric vehicles.  PolitiFact rated the claim Mostly False.", "A Facebook post says, \"Pelosi bought 1.5m in foreign oil stock day before shut down of American line.\" It appears to suggest that Pelosi sought to profit from knowing that a Jan. 20 executive order would shut down construction on the Keystone XL pipeline.", "Biden’s opposition to the Keystone XL pipeline was well-known for years, and his campaign said in May 2020 that he would halt it if elected.", "Pelosi filed a government disclosure form on Jan. 21, 2021, indicating recent purchases of stocks and stock options by her husband, and none were oil companies. It is the only such disclosure she has filed in 2021.", "Media outlets have not reported any recent Pelosi family stock transactions involving oil companies, and her deputy chief of staff said the claim is false.", "We rate this claim False.", "Clerk, United States House of Representatives, Financial Disclosure Reports Database, accessed Feb. 24, 2021", "Facebook post, Feb. 22, 2021", "Periodic Transaction Report, Jan. 21, 2021", "PolitiFact, \"Post about Keystone pipeline falsely claims Buffett gave $58M to Biden campaign\", Jan. 29, 2021", "PolitiFact, \"Facebook post misrepresents Pelosi stock trade, Biden policy on electric vehicles,\" Feb. 2, 2021", "U.S. House of Representatives, \"Ethics in Government Act Periodic Transaction Report,\" accessed Feb. 24, 2021", "White House, \"Executive Order on Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis,\" Jan. 20, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]