["About this rating", "If you are experiencing distress, please contact the National Suicide Prevention Lifeline at 1-800-273-8255 or visit online here.", "One of the most enduring conspiracy theories around is known as the \"Clinton body bags.\" That theory posits that any death that can be linked to former U.S. President Bill Clinton and former U.S. Secretary of State Hillary Clinton should be linked, even if no real-world evidence exists to do so. Basically the theory suggests that people who had incriminating evidence against the Clintons have all died under suspicious circumstances, with the assumption the Clintons were responsible for the deaths.", "No evidence exists that the Clintons, who have have been in the public spotlight for decades and investigated multiple times, are guilty of \"bumping off\" anyone. But as with many conspiracy theories, the lack of evidence hasn't stopped the spread of misinformation.", "The most recent iteration of this theory focused on the death of Salvatore (\"Sal\") Cincinelli, an FBI agent who died in Austin, Texas, in July 2019. Junk news sites like True Pundit picked up on the story, reporting without evidence that Cincinelli \"investigated the Clinton Foundation\" and thus his passing must be linked to the Clintons. The Foundation is a charitable non-profit founded by the two Democrats and is the frequent fixation of the Clintons' political opponents and conspiracy theorists.", "We know of no link between Cincinelli and the Clintons or their foundation, though he is linked to a different high-profile case. Cincinelli was the brother of Valerie Cincinelli, a former New York City police officer who has been accused of attempting to hire a contract killer to murder her ex-husband and her boyfriend's teenage daughter.", "Austin police are investigating Cincinelli's death as self-inflicted. Police were called to a \"deceased person\" at the address of the Container Bar on Rainey Street in downtown Austin just before midnight on July 16. The FBI has declined to comment on the case, including possible motive. But a 2012 Reuters story featuring Cincinelli characterized him as having left a high-paying career on Wall Street two years prior to join the FBI as a financial-crimes specialist.", "Some readers on social media thought it suspicious that local news outlets didn't report the death, but that is no surprise. Except under special circumstances, such as when an incident involves a public figure, legitimate news sources generally avoid reporting on suicides because of a well-documented risk of copycat fatalities. Mental health organizations also urge that when reporting is necessary, outlets should avoid sensationalizing or providing information that could encourage others to follow suit.", "The suicide story became public when the New York Post first reported it about a week after it occurred, noting that the FBI agent was related to Valerie Cincinelli, an ongoing news item in New York.", "In sum, no evidence exists that Cincinelli's death is linked to the Clintons or the Clinton Foundation, and the connection appears to be a fabrication by junk news sites and those parroting it on social media without evidence. At this time, the only information available is that Austin police are investigating the death as a suicide.", "Celona, Larry, et al. \"FBI Agent Brother to Cop Accused of Murder-for-Hire plot, Dead By Suicide: Sources.\"\r\n  New York Post. 23 July 2019.", "Kapp, Trevor, et al. \"FBI Agent Brother of Accused Murder for Hire Suspect Valerie Cincinelli Commits Suicide at Age 41.\"\r\n  New York Daily News. 24 July 2019.", "Flitter, Emily. \"Wall Street Credibility Helped FBI Agent Nab Martoma, Others.\"\r\n  Reuters. 6 December 2012.", "CBS, Associated Press. \"NYPD Officer Accused of Ordering Hit on Her Husband and Teen Girl.\"\r\n  20 May 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]