["About this rating", "In November 2019, readers asked us if this mysterious, yet familiar \"Trump actors\" post on CraigsList was real:", "Actors needed (Phoenix Convention Center) (Phoenix, Arizona)\nActors/help needed for event tomorrow from 2-11 pm.\n$15 per hour.\nDuties include protest activity and holding signs that are Pro Trump.\nMinorities welcome and needed!\nLooking to fill about 500 spots.\n*reply and ask for Steve Trig and mention the Craigslist ad.", "Similar posts have been covered by the news media and by Snopes. One, which we identified as \"Unproven\" in July 2016, appeared to be seeking actors to replace missing or ejected delegates at the Democratic National Convention. Another, which we rated \"False\" in October 2018, appeared to solicit paid attendees to President Donald Trump's rally in Erie, Pennsylvania. Yet another Craigslist ad appeared to recruit participants for either a white supremacist rally or related counter protests in Charlottesville, Virginia, in August 2017. We also rated that \"Unproven.\"", "The Phoenix Craigslist posting displayed above was dated Nov. 1, 2018, and has since expired or been taken down from Craigslist. We were unable to contact the poster or find the Steve Trig named in it; however, its timestamp makes it difficult to tie the post to any official rally hosted by Trump’s campaign or other large-scale political events at the Phoenix Convention Center after Nov. 1, 2018.", "One notable “Pro Trump” event at the Phoenix Convention Center we found was a Trump rally in 2017 (predating the Craigslist post in question), and a similar Craigslist ad mysteriously appeared and disappeared before that event also, according to AZCentral.", "Trump held a rally in Arizona in October 2018 — again, predating the Craigslist post — but it was nearly 20 miles from the Convention Center in Mesa.", "A Phoenix Convention Center spokesperson told KTAR News in August 2018 that Trump’s team inquired about a September 2018 event, but the facility didn’t have space available.", "The Arizona Republican Party planned an election night party on Nov. 6, 2018, but that was in Scottsdale. The Arizona Democrats were also holding an election night party on Nov. 6.; that event was in Phoenix, just two blocks away from the Convention Center.", "It’s worth noting that the practice of “astroturfing,” or buying the appearance of grassroots support, is well-documented and not limited to one political party.", "We rate the newer variation as \"Unproven\" because, while the ad raises some flags, we are not able to independently verify who posted it, nor which event it was recruiting actors to attend.", "Have you seen other variations of this claim? Let us know.", "Schneider, Dan. \"1-800-HIRE-A-CROWD.\"\r\n    The Atlantic. 22 July 2015.", "Wikipedia. \"List of Post-Election Donald Trump Rallies.\"", "Bond Huberman is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]