["By Rem Rieder", "Posted on June 26, 2020", "In a June 24 tweet, President Donald Trump falsely claimed that his predecessor had “destroyed” Maine’s lobster and fishing industry.", "It is true that, in an effort to protect a rich but delicate marine area, then-President Barack Obama in 2016 created a nearly 5,000-square-mile marine monument off the New England coast to be off-limits to fishing and lobstering. But he grandfathered in lobster and crab harvesting for seven years — so there has been absolutely no impact as of yet on the lobster industry. And statistics show that the rest of the fishing industry has hardly been destroyed.", "On June 5, Trump signed a proclamation opening up the monument, the Northeast Canyons and Seamounts Marine National Monument about 130 miles east-southeast off of Cape Cod, to commercial fishing. Trump said Obama had no reason to stop fishing in the area, and he was acting to “reverse that injustice.”", "A few weeks later, Trump took to Twitter to make his false claim about the lobster industry:", "Pres. Obama destroyed the lobster and fishing industry in Maine. Now it’s back, bigger and better than anyone ever thought possible. Enjoy your “lobstering” and fishing! Make lots of money!", "— Donald J. Trump (@realDonaldTrump) June 25, 2020", "Just after midnight the following day, Trump followed up with this tweet:", "It was my great honor to free up 5000 square miles of ocean off the coast of Maine. Enjoy!", "— Donald J. Trump (@realDonaldTrump) June 25, 2020", "Obama’s action in creating the sanctuary was applauded by environmentalists but opposed by Maine fishermen. Trump’s reversal of his initiative received the opposite reaction. But, as we said, commercial lobstering hadn’t yet been affected by Obama’s proclamation, and it’s not clear that, even if it had gone into effect, a total ban on fishing in the monument would have had a huge impact on the overall industry.", "In 2017, Trump ordered the Interior Department to review national monuments to make sure that they had been properly classified as such. In July 2018, the Washington Post reported that Randal Bowman, the staff member overseeing the process, suggested deleting language from the review that said most fishing vessels near the Northeast Canyons and Seamounts Marine National Monument had “generated 5% or less of their annual landings from within the monument.” The passage should be removed because it “undercuts the case for the ban being harmful,” Bowman said in an email.", "Maine’s lobster industry had a record year in 2016, Obama’s last year in office, with a haul of 132 million pounds worth $540 million. In fact, the industry did very well during his eight-year tenure. This, of course, had little to do with Obama.", "It is true that the lobster haul has declined in the ensuing years. Preliminary data for 2019 pegs the haul at 101 million pounds worth $485 million. But Obama’s action had nothing to do with it, since lobster fishing has been unaffected. His Sept. 15, 2016, proclamation said commercial fishing for red crab and American lobster would be exempted from prohibited activities until mid-September 2023. “After 7 years, red crab and American lobster commercial fishing is prohibited in the monument,” the proclamation said.", "As for Maine’s overall fishing industry, 2016 was a big year as well, with a take of 303 million pounds worth $733 million. There was a falloff in 2019, but hardly a destruction of the industry. According to preliminary data, the catch was 217 million pounds worth $673 million. The lobster falloff from 2016 –completely unaffected by Obama — of $55 million represented a huge proportion of the overall $60 million decline.", "All of which suggests that Obama’s action had a relatively small effect on the fishing industry overall.", "Of course, there are many factors that affect the lobster industry, including the vagaries of the fishing harvest, climate change and trade developments. And now the industry, like the rest of the nation, is struggling with the impact of the COVID-19 pandemic.", "One factor that hit Maine hard was Trump’s tariffs on China. In retaliation, on July 6, 2018, China slapped tariffs on a number of U.S. products, including lobster. The tariffs, which went as high as 35%, dropped to 30% this year. So China, which enjoys its Maine lobster, began buying lobster from Canada instead, a big blow to the Maine industry.", "In the first six months of 2019, the U.S. exported less than 2.2 million pounds of lobster to China, compared with 12 million pounds during the first six months of 2018, according to trade data from the National Oceanic and Atmospheric Administration Fisheries. Maine accounts for nearly 90% of the U.S. lobster supply, according to the state.", "Trump is now moving to extend his farm bailout program to the lobster industry.", "Environmentalists were distraught that Trump had ended the fishing ban and worried about the impact on the aquatic ecosystem.", "“This rollback essentially sells off the future of the ocean and the future of the ecosystem for almost no present economic benefit,” said Miriam Goldstein, the ocean policy director at the Center for American Progress, a liberal think tank.", "But the fishing industry cheered his action.", "“The process by which this monument was established is a non-transparent process that does not allow for stakeholder input, does not — does not produce any kind of economic analysis of the negative impacts, and prevents all of us from enjoying the benefits of our healthy marine resources,” said Maggie Raymond, executive director of the Associated Fisheries of Maine, at the June 5 roundtable in Bangor, Maine, where Trump announced his decision. “So, again, we appreciate that you’ve recognized that and are taking action to correct that.”", "We take no position on Trump’s policy decision. But the evidence shows he is wrong to claim Obama “destroyed” the lobster industry — it hadn’t yet been banned from the marine monument. And a review conducted by Trump’s own administration found fishing vessels overall garnered a small percentage of their catch from that area.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]