["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Trey Radel, R-Fort Myers, is back to work in Congress following a few weeks in rehab after he got busted for cocaine possession in Washington.", "He’s lucky he has that job, some say. With a drug arrest on his record, he wouldn’t be eligible for a host of other gigs -- like driving a bus in his own district.", "Radel’s conviction prompted some high-profile Republicans to call for his ouster. Lee County Sheriff Mike Scott, who was mentioned as a potential opponent, announced on Facebook Jan. 11 that he won’t run. But Scott vowed to be a \"staunch advocate for his political replacement\" and unleashed this attack:", "\"While Radel returned to his congressional office following a microwave stint in rehab and a gaggle of rehearsed apologies, I have hundreds of inmates in our jail that are unable to return to their home due to similar or lesser drug offenses,\" Scott said on Facebook. \"The sad reality is that Trey Radel does not even qualify to drive a Lee County school bus at this point, yet he occupies a seat in Congress.....\"", "Scott’s Facebook post was reported by multiple news outlets.", "Is Scott correct that Radel’s cocaine possession conviction means he would not meet the qualifications to drive a Lee County school bus?", "Radel’s misdemeanor conviction", "On Oct. 29, Radel was nabbed after he bought 3.5 grams of cocaine for $260 from an undercover agent in the District of Columbia. He then brought agents to his apartment where he handed over a vial of cocaine. Radel kept his case quiet until it reached court a few weeks later -- and then the news exploded about the 37-year-old TV reporter turned tea party freshman busted for cocaine. (We emailed a Radel spokesman to alert him to our fact-check and did not get a reply.)", "On Nov. 20, Radel pleaded guilty to misdemeanor cocaine possession and was sentenced to one year of probation. Radel spent about a month in rehab and returned to Congress in early January.", "Radel was charged under the District of Columbia’s Uniformed Controlled Substances Act, which divides controlled substances into five graded schedules, U.S. Attorney spokesman William Miller told PolitiFact.", "\"The most dangerous controlled substances are contained in Schedule I, with incrementally less serious offenses in Schedules II through V. Cocaine -- both in crack and powder form -- is in Schedule II. Possession of any controlled substance other than PCP without intent to distribute is a misdemeanor,\" Miller said in an email. Possession with intent to distribute most controlled substances would result in a felony.", "In 2012, the U.S. attorney in D.C. charged 700 people with misdemeanor possession of cocaine. Most pleaded guilty like Radel and entered a diversion program or had their cases dismissed. Only a small fraction received jail time (Radel didn’t).", "If Radel had been arrested for cocaine possession in Florida, he would have faced a felony.", "\"Possession of cocaine in any amount is a felony in Florida,\" Scott said in an email. Three and a half grams \"would constitute a third-degree felony, while greater quantities and/or trafficking amounts can escalate the degree of seriousness.\"", "In Florida, \"even residue is a felony,\" said Broward public defender Howard Finkelstein. Some Florida counties don’t prosecute residue cases, but prosecutors do in Broward, and first-time offenders typically get adjudication withheld and probation, he said.", "Across the country, a misdemeanor drug possession statute isn’t unusual, though felonies appear to be more of the norm.", "Last year, California considered a bill that would have made possession a \"wobbler,\" meaning it could have been charged as a misdemeanor or a felony. A bill analysis said that 13 states plus the District of Columbia have misdemeanor drug possession laws. (Democratic Gov. Jerry Brown vetoed the bill.)", "There are differences in states’ laws depending on whether it relates to a first-time offender, the particular drug or other factors.", "\"Every state gets to totally make up its own penal code, and it shows,\" said Margaret Dooley-Sammuli, a senior policy advocate for the American Civil Liberties Union in California, which advocated for the bill.", "School bus drivers", "On the unlikely chance that Radel plans to apply to be a Lee County school district bus driver, would his conviction mean he wouldn’t qualify?", "Lee County school district won’t hire an individual -- including a bus driver -- who has pleaded guilty to a misdemeanor drug charge less than five years ago or a felony drug charge less than 10 years old, or someone who is currently on probation, said Ranice Monroe, the school district’s director of professional standards and equity.", "Even if a defendant gets an adjudication withheld, the district won’t hire the individual, Monroe said.", "\"Our standards are high,\" Monroe said. \"We don’t make exceptions.\"", "If someone was already a bus driver and then pleaded guilty to a drug charge the employee would face discipline including the potential of being fired, Monroe said.", "\"What we perceive is you are taking drugs, which is a violation of our rules,\" she said.", "We also contacted spokespersons for a few other Florida school districts to ask if a cocaine possession conviction would make a school bus driver candidate ineligible.", "Miami-Dade County has a similar policy to Lee County. Broward likely wouldn’t hire such an individual, said spokeswoman Nadine Drew. Pasco schools’ guidelines call for a committee review but not automatic denial of employment for drug convictions. However, a recent cocaine possession conviction would likely disqualify someone, spokeswoman Linda Cobbe said.", "School bus drivers must have a commercial driver's license.", "A cocaine possession plea \"in and of itself would not necessarily prevent a person from obtaining a CDL or result in a revocation of a CDL,\" John Lucas, a spokesman for the Florida Department of Highway Safety and Motor Vehicles told PolitiFact in an email. \"That decision would have to come from the courts. However, the Department of Highway Safety and Motor Vehicles could take action if the person was found to be in possession of cocaine while operating a commercial vehicle.\"", "Our ruling", "In a Facebook post vowing to advocate for Radel’s replacement, Scott said, \"The sad reality is that Trey Radel does not even qualify to drive a Lee County school bus at this point, yet he occupies a seat in Congress.\"", "Radel was convicted of misdemeanor cocaine possession in Washington. If he had been charged in Florida he would have faced a felony.", "Under the unlikely scenario that Radel’s future career plans include applying for a job as a Lee County school bus driver, the district’s policies state that it won’t hire anyone currently on probation or who pleaded guilty to a misdemeanor drug charge within the past five years, or a felony drug charge in the past decade.", "Radel’s future as a congressman may be in the hands of the voters of Southwest Florida. But Scott is correct that Radel’s drug conviction has put the brakes on him becoming a bus driver.", "We rate this claim True.", "Facebook, Lee County Sheriff Mike Scott post about U.S. Rep. Trey Radel, Jan. 11, 2014", "Florida statute, Drug abuse prevention and control, Accessed Jan. 14, 2013", "District of Columbia code, Section 48-904.01, Accessed Jan. 14, 2013", "U.S. Attorney’s Office, Statement of the Offense United States of America vs. Henry Joseph Radel, Nov. 20, 2014", "California Senate Bill 649, Senate public safety analysis, April 22, 2013", "Miami-Dade School District, Employment standards, Accessed Jan. 15, 2014", "Miami Herald, \"Tea Party Rep. Trey Radel busted for cocaine in D.C.,\" Nov. 19, 2014", "Miami Herald’s Naked Politics blog, \"Congressman Trey Radel, 8-ball, looks like a politically dead man walking,\" Nov. 20, 2014", "Fort Myers News-Press, \"Sheriff Mike Scott says he’s not after Trey Radel’s seat,\" Nov. 20, 2013", "Washington Post, \"Trey Radel to take leave of absence after guilty plea to cocaine charge,\" Nov. 20, 2014", "Huffington Post, \"Florida sheriff: Trey Radel does not even qualify to drive a Lee County school bus,\" Jan. 13, 2014", "Shark Tank, \"Sheriff blasts Trey Radel: ‘he does not even qualify to drive a Lee County school bus,’\" Jan. 14, 2014", "NBC News, \"Sheriff Mike Scott’s response to Congressional inquiries,\" Jan. 14, 2014", "NPR, \"Defying GOP leaders, Rep. Trey Radel won’t resign after rehab,\" Jan. 2, 2014", "Interview, Lee County Sheriff Mike Scott, Jan. 14, 2014", "Interview, William Miller, U.S. Attorney spokesman, Jan. 14, 2014", "Interview, Samantha A. Syoen, spokeswoman for State Attorney’s Office 20th Judicial Circuit, Jan. 14, 2014", "Interview, John Lucas, Florida Department of Highway Safety and Motor Vehicles spokesman, Jan. 14, 2014", "Interview, Ed Griffith, Miami-Dade State Attorney’s Office spokesman, Jan. 14, 2014", "Interview, Howard Finkelstein, Broward public defender, Jan. 14, 2014", "Interview, David Harris, University of Pittsburgh law professor, Jan. 14, 2014", "Interview, Ranice Monroe, Lee County school district’s director of professional standards and equity, Jan. 15, 2014", "Interview, Margaret Dooley-Sammuli, Senior Policy Advocate at ACLU of San Diego and Imperial Counties, Jan. 15, 2014", "Interview, Linda E. Cobbe, spokeswoman Pasco County schools, Jan. 15, 2014", "Interview, Nadine Drew, spokeswoman Broward County schools, Jan. 15, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]