["About this rating", "In late February 2018, a \"developing story\" saying that Hollywood producer and accused sexual assaulter Harvey Weinstein had committed suicide appeared on faux ABC News web site abcnewgo.com:", "Disgraced Hollywood mogul Harvey Weinstein shot and killed himself, officials said — just months after spending time in Arizona for addiction treatment.", "The film mogul, shot himself at a Scottsdale hotel in Arizona and the weapon reportedly was found at the scene. He was 65. His body was discovered inside the hotel room and officials in Arizona are now waiting for toxicology test results to determine the exact cause of death.", "Earlier this week, Harvey Weinstein took to Facebook to post about the accusations leveled against him, claiming they were “false” and “only GOD knows the truth.”", "According to the report, Weinstein, who had been accused of sexual assault by more than 80 women since October is alleged to have earlier sent a private message via facebook to a close pal before his suicide. The content read: “The accusations are sicknesses that will take my life, I cannot handle them any longer. THEY Have Won This Life. BUT HEAVEN IS MY HOME.”", "No such reports appeared in any reliable news sources, although the Los Angeles Times reported earlier in February that Weinstein was living in Arizona while undergoing addiction treatment.", "Weinstein did not write the social media statements attributed to him in the article. Rather, in a maudlin move, someone copied them from a Facebook post that Kentucky state representative Dan Johnson posted shortly before he died from a self-inflicted gunshot wound on 13 December 2017. Politico reporter Akela Lacy quoted Johnson's post as follows:", "The accusations … are false GOD and only GOD knows the truth, nothing is the way they make it out to be. AMERICA will not survive this type of judge and jury fake news. Conservatives take a stand,” the post read. “9-11-2001 NYC/WTC, PTSD 24/7 16 years is a sickness that will take my life, I cannot handle it any longer. IT Has Won This Life . BUT HEAVEN IS MY HOME.", "It wasn't the first time that a fabricated report of a celebrity death appeared on ABCNewGo.com. The site reported that ailing British comedian Ken Dodd had died in January 2018, prompting an angry denial from his publicist.", "Lacy, Akela.  \"Following Molestation Allegations, Kentucky Lawmaker Dies in Apparent Suicide.\"\r\n  Politico.  13 December 2017.", "Ng, David.  \"Even in Exile, Harvey Weinstein Mainstains an Upscale Lifestyle. But His Expenses Are Adding Up.\"\r\n  Los Angeles Times.  23 February 2018.", "Shennan, Paddy.  \"'Upsetting and Completely Untrue': Sir Ken Dodd's Publicist Addresses False Death Reports.\"\r\n  The Mirror.  23 January 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]