["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this April 21, 2010 aerial file photo taken in the Gulf of Mexico more than 50 miles southeast of Venice on Louisiana’s tip, an oil slick is seen as the Deepwater Horizon oil rig burns. (AP Photo)", "On the anniversary of the Deepwater Horizon BP oil spill, Sen. Edward Markey, D-Mass., attacked President Donald Trump for his stance on drilling and portrayed Congress as doing nothing in the aftermath of the 2010 explosion.", "\"Trump looking to open up E Coast & new areas for offshore oil drilling when Congress has passed no new safety standards since BP,\" Markey tweeted April 20.", "We wanted to know what Trump’s plans were and if Congress has done nothing since the explosion.", "The April 20, 2010, explosion of BP’s Deepwater Horizon rig was the worst offshore drilling catastrophe in U.S. history. The explosion killed 11 workers, and 134 million gallons of oil were released into the Gulf of Mexico.", "We emailed a spokesman for Trump and did not get a reply; however, a spokesman for the Bureau of Ocean Management sent information about the reorganization of federal agencies that oversee drilling during the Obama administration.", "Trump on drilling", "In 2006, Congress passed a bill to ban oil drilling within 125 miles off much of Florida’s coast and up to 235 miles at some points. The ban is set to expire in 2022.", "There have been efforts by some Republicans to expand offshore drilling, but so far they have failed. Sen. Bill Cassidy, R-La, sponsored The American Energy and Conservation Act of 2016 to allow drilling 50 miles off Florida’s Gulf Shores, but the Senate rejected moving ahead on it in November. In response, Sen. Bill Nelson, D-Fla., filed a bill to extend the ban by five years, but the Senate hasn’t voted on his bill.", "During the campaign, Trump generally spoke favorably of expanding oil drilling, although he sounded skeptical about a proposal to allow offshore drilling closer to the Florida beaches in an interview with the Tampa Bay Times, PolitiFact’s parent company, in February 2016.", "\"They've already got plenty in the Gulf,\" Trump said. \"It would be a little bit of a shame (to expand drilling closer to Florida), because there's so much fracking, and there's so much oil that we have now that we never thought possible. That's an issue I'd absolutely study and do the right thing.\"", "But later in the campaign Trump endorsed more drilling and promised to \"accomplish a complete American energy independence. Complete. Complete.\"", "Trump’s America First Energy Plan called for opening up onshore and offshore leasing on federal lands.", "A couple months into his administration in March, Trump’s Interior Secretary Ryan Zinke proposed leasing 73 million acres offshore Texas, Louisiana, Mississippi, Alabama, and Florida for oil and gas exploration and development starting in August 2017.", "That was similar to the Obama administration plan. As he was leaving office, President Barack Obama banned drilling in the Arctic and Atlantic oceans for the next five years, but allowed it in the gulf primarily in areas other than Florida.", "But despite Trump’s rhetoric, the industry hasn’t shown much interest in expanding drilling due to low oil prices, said Athan Manuel, who directs Sierra Club’s Lands Protection Program.", "\"Ideologically the Trump administration wants to push drilling everywhere, but companies are being cautious right now because the cost so low,\" he said.", "On March 28, Trump issued an executive order that called for a review of agency actions that \"potentially burden the safe, efficient development of domestic energy resources,\" including oil.", "Regulations following explosion", "After BP’s Deepwater Horizon explosion, lawmakers couldn’t agree on safety standard legislation. In 2010, the House approved an overhaul of safety standards, but it never got the approval in the Senate.", "The Obama administration took some steps to tighten rules in an effort to avoid similar spills, although the rules took several years to develop, and some environmentalists have criticized them as insufficient.", "In April 2015 -- five years after the explosion -- the administration unveiled a proposed rule to tighten safety standards for blowout preventers, devices that are designed to stop undersea oil wells from exploding. During the Deepwater Horizon explosion, the blowout preventer malfunctioned. The rule was finalized in March 2016.", "Bob Bea, an expert on risk management and a former Shell executive, told PolitiFact that little has changed in either the regulatory regime or the industrial regime in the United States. He repeatedly said during the Obama administration that the government hadn’t gone far enough in terms of risk assessment.", "\"Yes, new government 'rules' have been enacted, and new industry 'guidelines' have been issued, but either they have not been implemented or they have not been implemented properly,\" he said.", "The Government Accountability Office reported in March 2017 that the Interior Department has struggled to successfully implement key initiatives to improve offshore oversight. For example, a risk-based facility inspection initiative was halted due to concerns about its usefulness and unclear protocols.", "Our ruling", "Markey tweeted, \"Trump looking to open up E Coast & new areas for offshore oil drilling when Congress has passed no new safety standards since BP.\"", "During the campaign, Trump frequently expressed support to open up more oil drilling. Since in office, his administration proposed leasing 73 million acres offshore starting in August 2017.", "After the 2010 Deepwater Horizon explosion, Congress couldn’t agree on safety standards. The Obama administration took some steps to improve safety standards, though some environmentalists say that the government didn’t go far enough.", "We rate this claim True.", "U.S. Senator Ed Markey, Twitter, April 20, 2017", "Government Accountability Office, Stronger Leadership Commitment Needed at Interior to Improve Offshore Oversight and Internal Management, March 21, 2017", "White House Executive Order, \"Presidential Executive Order on Promoting Energy Independence and Economic Growth,\" March 28, 2017", "Congressional Research Service, \"Deepwater Horizon Oil Spill: Recent Activities and Ongoing Developments,\" April 17, 2015", "U.S. Department of Interior, Well Control Final Rule Fact Sheet, March 2016", "U.S. Department of Interior, Secretary Zinke Announces Proposed 73-Million Acre Oil and Natural Gas Lease Sale for Gulf of Mexico, March 6, 2017", "Bureau of Ocean Energy Management, The reorganization of the former MMS, Accessed April 20, 2017", "National Academies of Sciences, Engineering and Medicine, Responding to Oil Spills in the U.S. Arctic Marine Environment, 2014", "Sen. Edward Markey press release, \"East Coast Senators Introduce Bill to Prevent Atlantic Offshore Drilling, Say #KillTheDrill,\" April 22, 2015", "Robert Bea, \"US permits Arctic drilling, but questions about safety remain,\" May 22, 2015", "Washington Post, \"President Obama bans oil and gas drilling in large areas of Atlantic and Artic oceans,\" Dec. 20, 2016", "Washington Post, \"Trump's new Gulf of Mexico oil and gas drilling proposal looks a lot like Obama's,\" March 6, 2017", "Washington Post, \"Trump moves to open Atlantic coast to oil drilling for first time in more than 30 years,\" April 7, 2017", "Bloomberg News, \"Report: Trump to expand Arctic, offshore oil drilling,\" April 6, 2017", "New York Times, \"Rule Aims to Prevent Offshore Rig Disasters,\" April 14, 2015", "Miami Herald, \"Five years after The Big Spill: Drilling, questions continue in the Gulf,\" April 19, 2015", "PolitiFact, \"Politics and the Gulf oil spill: separating fact from fiction on the one-year anniversary,\" April 19th, 2011", "PolitiFact Florida, \"Bill Nelson says Donald Trump intends to expand oil drilling,\" Nov. 22, 2018", "Trump-O-Meter, Achieve energy independence, Jan. 16, 2017", "Interview Robert Bea, Professor Emeritus,Center for Catastrophic Risk Management University of California Berkeley, April 21, 2017", "Interview, Athan Manuel, Director of Lands Protection Program Sierra Club, April 21, 2017", "Interview, Giselle Barry,Senator Edward J. Markey (D-Mass.) spokeswoman, April 21, 2017", "Interview, John Filostrat, Bureau of Ocean Energy Management spokesman, April 21, 2017", "Interview, Alexandra Adams, National Resources Defense Council senior advocate oceans program, April 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]