["About this rating", "On 14 June 2019, a set of terrifying photographs purportedly showing a \"possum-eating\" spider in Australia was posted to the \"Tasmanian Insects and Spiders\" Facebook page:", "These photographs appear to be real, but the caption may have left viewers with a misleading impression about the relative sizes of the creatures pictured.", "The meal in question was a pygmy possum, a small, mouse-sized possum that ranges in size from about 5 to 12 cm (2 to 4.7 inches), and not a common opossum, which can grow to the size of a house cat.", "The spider in this image was a huntsman spider, also known as the giant crab spider, which can attain a leg span up to 12 inches in length:", "Huntsman spiders are large, fast spiders distributed in warm climates throughout the world. They are notable for the way that they catch their prey.", "Huntsman spiders \"don't build webs to catch prey,\" explained entomologist Christy Bills, Invertebrate Collections manager at the Natural History Museum of Utah. Rather, they hunt down their prey, a habit that gives them their common name.", "There are thousands of subspecies in this family (Sparassidae). The average huntsman spider species is about 1 inch (2.5 centimeters) long with a leg span of up to 5 inches (12.7 cm). The giant huntsman spider, however, has a leg span of up to 12 inches (30 cm), making it the largest spider by diameter; it is often described as being \"the size of a dinner plate.\" Peter Jäger, head of the arachnology department at the Senckenberg Research Institute in Frankfurt, Germany, discovered the giant huntsman in a cave in Laos in 2001, according to the World Wide Fund for Nature (WWF). Only a few people in the world have seen this behemoth arachnid.", "While these spiders typically feed on insects, they've also been known to eat frogs, lizards, and even small birds. Australia Museum arachnology collection manager Graham Milledge told The Guardian that he'd never seen a hunstman spider take a pygmy possum: “It would be fairly rare ... It’s the first time I’ve seen a pygmy possum as prey.”", "John Woinarski, a conservation biology professor at Charles Darwin University, said that huntsman spiders don't typically eat pygmy possums because these species inhabit different areas. One place they both can be found, however, is Mount Field: \"There are some habitat differences between the two species, and [an] eastern pygmy possum is more likely to occur in alpine and subalpine habitats, such as Mt Field.\"", "Huntsman spiders may not typically eat pygmy possums, but these large arachnids have been observed eating other small mammals. In 2016, a hunstman spider was filmed in Queensland, Australia, dragging a mouse up the side of a refrigerator:", "Szalay, Jessie.   \"Giant Huntsman Spider: World's Largest Spider by Leg Span.\"\r\n    Live Science.   11 November 2014.", "Crew, Bec.   \"The Western Pygmy Possum Is the Cutest Australian Animal.\"\r\n    Australian Geographic.   25 September 2014.", "Davies, Ella.   \"The World's Largest Spider Is the Size of a Dinner Plate.\"\r\n    BBC News.   15 March 2016.", "Martin, Lisa.   \"'Epic Photo': Huntsman Spider Eats Pygmy Possum in Australia.\"\r\n    The Guardian.   18 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]