["President Donald Trump arrives to speak at a campaign rally in Oshkosh, Wis. (AP Photo/Evan Vucci)", "Based on population, the United States has one of the highest death rates worldwide.", "The United States has  a higher rate of infection than Canada, Australia and most European countries.", "At an event in Oshkosh, Wis., President Donald Trump said the country was \"doing great\" in the fight against the coronavirus.", "\"We're coming back and our numbers are better than almost all countries,\" Trump said Aug. 17.", "When we asked the White House about the claim, the press office noted that by one measure, the United States is doing well.", "Looking at the percentage of confirmed cases that lead to death, the United States has a rate that’s about half that in Europe and the rest of the world.", "But the source the White House cites, Oxford University’s Our World in Data project, says that \"During an outbreak of a pandemic the case fatality rate is a poor measure of the mortality risk of the disease.\"", "There are other ways to track the suffering and reach of the coronavirus and by those, the United States is not doing well.", "Measured against the size of the population, the United States has the 10th-highest death rate in the world. It’s doing better than the United Kingdom, Spain, Italy, Sweden and Chile, but worse than France, Canada and Germany, to pick a few examples.", "Factoring in population size, the United States has one of the highest rates globally of people who have tested positive — 16,430 per million residents, which is lower than Chile, but higher than any other large country. Put another way, the virus is known to have infected a higher fraction of the population in the U.S. than in many other places.", "Trump often says that the United States finds more cases because it tests more than other nations. We’ve rated that claim False and Pants on Fire, depending on how he says it. Testing is a way to measure progress against the coronavirus, but the key indicator of progress is whether the percentage of tests that come back positive declines as more tests are done.", "With a positivity rate of about 7%, the United States ranks in the middle of the pack, doing better than countries such as Mexico and Argentina, but worse than just about every country in Europe, as well as Canada and Australia.", "Trump said that the United States’ COVID-19 \"numbers are better than almost all countries.\" The White House pointed to one number to back that up — the number of deaths relative to the number of known cases. But the source it cited said that wasn’t a good measure of the threat of the disease.", "By other yardsticks, the United States is doing worse than many countries, including many major developed economies.", "It has a higher death rate in relation to its population, the virus is known to have reached a larger share of the population, and the percentage of tests that come back positive is higher than in many other nations.", "We rate this claim False.", "FactBase, Donald Trump Delivers a Campaign Speech on the Economy in Wisconsin, Aug. 17, 2020", "Oxford University - Our World in Data, Case fatality rate, Aug. 18, 2020", "Johns Hopkins Coronavirus Resource Center, Mortality analysis, Aug. 17, 2020", "Oxford University - Our World in Data, Coronavirus cases, Aug. 17, 2020", "Oxford University - Our World in Data, Share of positive tests, Aug. 17, 2020", "PolitiFact, Fact-checking Donald Trump’s visit to Oshkosh, Aug. 17, 2020", "Statement, White House press office, Aug. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]