["About this rating", "In mid-March 2021, as Americans started receiving one-time payments of up to $1,400 from the federal government to help offset economic hardships of the COVID-19 pandemic, social media users circulated posts questioning whether people without permanent homes had access to the checks.", "One post by model-activist Hamdia Ahmed, for example, claimed people without permanent homes did not have access to the so-called \"economic impact payments\" (EIP) like most Americans who would receive the money via direct deposits into their bank accounts or mailed checks. The tweet encouraged homeless people to physically visit an office of the Internal Revenue Service (IRS) to file documentation that would make them eligible for a prepaid debit card.", "\"I was really upset that homeless people did not have access to the $1,400 stimulus check,\" Ahmed wrote. \"If you are homeless, you can go to a tax return office where they file something called [an] EIP return.\"", "Ahmed's claim was a slight mischaracterization of facts, though its underlying sentiment was true: People without permanent home addresses -- whether because they were living outside or in a homeless shelter, couch-surfing or due to other reasons -- or who did not file taxes in recent years because they lived below the poverty line indeed had to take additional steps to receive the government-issued payments. We outline those steps below.", "However, most recipients of the stimulus money -- regardless of their housing situation -- could receive the cash via a prepaid debit card (instead of a direct deposit or mailed check), pending what information the IRS had on file for them. See here for more information on that option.", "Generally speaking, everyone living in the U.S. with Social Security numbers or Individual Taxpayer Identification Numbers (which the IRS assigns to workers without Social Security numbers) must file annual taxes if they meet single status filing requirements, are under the age of 65, and earn an annual income of $12,400 or more. For older people, workers must file the documentation if their earnings are $14,050 or more.", "Put another way, the laws governing who must file tax returns each year have nothing to do with people's housing status and everything to do with their incomes. Hypothetically, a young adult could be employed as a prep cook at a restaurant -- earning some $13,000 per year -- and be considered \"homeless\" because she sleeps on friends' couches and doesn't have a permanent address. Nonetheless, tax law requires that person to file taxes with the IRS.", "That said, in April 2020, the IRS issued the first round of stimulus checks to all U.S. citizens and immigrants with Social Security numbers who met the below-listed salary requirements based on their tax returns for the previous year. (People with higher salaries received smaller stimulus payments.) In most situations, the IRS deposited the money directly into recipients' bank accounts or mailed checks, based on how they completed their 2019 tax return.", "So anyone who did not file taxes in 2019 (whether because they did not earn enough money to meet the legal requirements for filing tax returns or due to other reasons) had to take the additional step of submitting information to the IRS in order to receive the above-listed COVID-19 financial relief.", "To do that, they could use what is called an \"online non-filer tool\" or mail paperwork to the agency. The deadline for completing that step, however, was Nov. 21.", "Fast forward to spring of 2021, when U.S. President Joe Biden signed a $1.9 trillion relief package, and the IRS started issuing its third round of such payments based on different salary levels (listed here).", "People who did not file taxes in recent years, regardless of their housing status, who used the non-filer tool to receive the first stimulus check should have automatically received a second payment ($600) and were set to get their third stimulus check in the same way, according to MarketWatch.", "But not everyone who didn't file taxes received, or responded to, that message about using the non-filer tool to claim their stimulus money. As of fall 2020, the IRS estimated that group totaled roughly 9 million people. Those people had to take a different route to receive the money.", "Even though the deadline for using the online non-filer tool had passed as of Ahmed's tweet, people could still receive one or all stimulus payments by filing 2020 tax returns before May 17 and marking the money as a \"Recovery Rebate Credit\" on the form.", "\"If someone misses the November 21 deadline, they can claim the payment as a credit on a 2020 federal income tax return next year\" the IRS website reads.", "In other words, people who were not legally required to file taxes due to their low incomes and did not use the above-mentioned non-filer tool before it shutdown must fill out a 1040 or 1040-SR in spring 2021 -- either using the IRS' Free File Program online (a tax preparation and filing software program) or setting up a free in-person counseling appointment.", "Tax-return offices will also help in exchange for a share of the rebate, or community organizations, such as the Washington-based Angel Resource Connection, are prepared to help low-income people without permanent homes navigate the process.", "When people without stable homes submit information to the IRS, either via tax returns or the non-filer tool, they can have the agency send their stimulus money to a place that's convenient to them if they don't have a bank account for direct deposits. MarketWatch reported:", "If you don’t have a permanent address, you can arrange to have your stimulus money sent to a local post office, homeless shelter or religious place of worship. You can also contact United Way’s 211 Economic Impact Payment Helpline by calling (844)-322-3639 for assistance.", "In sum, considering the fact that all people who do not normally file taxes -- including those without permanent homes -- must submit information to the IRS via an online non-filer tool or 2020 tax return in order to receive any stimulus money, including the third round of payments in spring 2021, we rate this claim \"True.\"", "To check the status of your stimulus payment, or to determine whether you quality for one, go to the IRS' website.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]