["“*Beware* Fake fingers being made for casting votes, I don’t know where we are going?” is a message viral on social media. A Facebook group We Support Republic was among those who shared it.", "Several individual users have also shared the message.", "The image of ‘fake fingers’ has been circulated on Twitter as well.", "*Beware*", "Fake fingers being made for casting votes, I don’t know where we are going?@bablusharmabjp @rajnathsingh @narendramodi @MPRakeshSingh pic.twitter.com/Zrdi6O2cVe", "— Common Man.. (@CommonM94514726) April 11, 2019", "Upon reverse-searching the image on Google, Alt News found that the same photograph of ‘fake fingers’ was also circulated in 2017 during the legislative assembly elections.", "A known purveyor of misinformation Abhishek Mishra was among those who posted it, but he later took it down.", "Former CEC SY Quraishi shared a WhatsApp forward carrying the image and tweeted, “someone sent this.”", "Someone sent this! pic.twitter.com/bnwRZLSLiL", "— Dr. S.Y. Quraishi (@DrSYQuraishi) February 20, 2017", "Several people commented on Quraishi’s tweet with a screenshot claiming that the image represented prosthetic fingers for Yakuza members. BBC had fact-checked the message in 2017.", ".@DrSYQuraishi Dear Kejri fan sir, stop believing WhatsApp forwards from AAPtards.. pic.twitter.com/YXhsemmdZ2", "— Srcsmst (@srcsmst) February 21, 2017", "An ABC News article covered the story in 2013. “In Japan, a stunted pinkie signifies membership in the yakuza, or Japanese mafia. In a ritual known as “yubitsume,” yakuza members are required to chop off their own digits to atone for serious offenses. The left pinkie is usually the first to go, though repeated offenses call for further severing. As a result, those who get out, have a hard time finding work because of the stigma attached to those missing fingers,” according to the media outlet.", "Images of prosthetic fingers used by a Japanese Mafia is currently viral as ‘fake fingers’ made for casting votes. With the elections ongoing, there is a good chance for misinformation of this sort to surge online. Alt News had earlier debunked a message that falsely claimed that the BJP is the only party contesting for a majority in the Lok Sabha. In other cases, old photos and videos were shared to suggest that people dressed up in burqas to cast fake votes. A photoshopped image of Bollywood couple Deepika Padukone and Ranveer Singh was circulated to claim that the duo was campaigning for the BJP.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]