["The photo was published here on Twitter on February 11, 2021. It has been retweeted more than 250 times.", "“The monks in Myanmar went to the streets. And look at the monks in China. Chinese monks from the past generations went down the mountain to cheat and hide in the temple in troubled times. If there is a chance for riots, they never let it go,” the Chinese-language caption reads.", "Tens of thousands of people have rallied across Myanmar in opposition to a military coup on February 1, 2021. The military arrested democratically-elected leader Aung San Suu Kyi and President Win Myint, which they justified by alleging widespread voter fraud in November elections won by Suu Kyi’s party in a landslide.", "But international and local observers -- as well as Myanmar's own election monitor -- reported no major issues that might have affected the integrity of the vote.", "The same photo was shared alongside a similar claim on various platforms, including Facebook here and here; on Twitter here and here; and on Weibo here.", "The photo, however, has been shared in a misleading context.", "A keyword and reverse image searchon Google found the image in AFP’s photo archives. It was taken by an AFP photographer on September 24, 2007.", "“Buddhist monks march in protest in Yangon, 24 September 2007, in the strongest show of dissent against the ruling generals in nearly two decades,” the photo caption reads. “More than 100,000 people flooded the streets of Yangon in two major marches that snaked their way through the nation's commercial capital led by robed monks chanting prayers of peace and compassion.", "Major protests broke out in Yangon during the summer of 2007. Buddhist monks staged democracy marches that were brutally crushed by the army.", "The protests were dubbed the \"Saffron revolution\", inspired by the colour of the monks' robes.", "In 2016, Aung San Suu Kyi's National League for Democracy (NLD) took power, ending decades of repressive junta rule.", "Below is a screenshot comparison of the photo in the misleading post (L) and the AFP photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]