["By Angelo Fichera", "Posted on January 7, 2021 | Updated on May 24, 2021", "Viral social media posts and a Republican House member have amplified claims wrongly identifying some right-wing figures at the U.S. Capitol riot as part of “antifa.” The claims feed into an unfounded conspiracy theory that anti-fascist activists in disguise orchestrated the event.", "Following a pro-Trump mob storming the U.S. Capitol on Jan. 6, viral posts spread a groundless theory that members of “antifa” — not supporters of President Donald Trump — were actually behind the riot.", "There has been no evidence put forward that “antifa,” an umbrella term used to describe anti-fascist groups, was responsible for the events.", "U.S. Capitol Police announced that 14 people were arrested on Jan. 6, most for unlawful entry. That’s in addition to the 69 individuals arrested by the D.C. Metropolitan Police Department, 41 of which were on Capitol grounds (but not all of those were inside), a spokesman told us. The latter department’s acting chief, Robert J. Contee III, said during a Jan. 7 press conference that he could not yet identify any particular groups involved. Federal authorities are also investigating. The FBI’s assistant director in charge of the FBI Washington field office, Steven D’Antuono, said in a Jan. 8 call with reporters that there was currently “no indication” that antifa activists had disguised themselves as Trump supporters and carried out the Capitol riot.", "But some of the social media posts have claimed, wrongly, that specific individuals photographed in the events were part of “antifa.”", "One Facebook post shared by more than 4,000 users claimed, “FYI These are NOT Trump supporters….Antifa THUGS.” The post included a photo of the rioters inside the Capitol with an arrow pointing to a man wearing a headpiece with fur and horns.", "The man seen in the photo has actually been identified as Jake Angeli, who has been videotaped at similar events in the past and has been described as “a fixture at Arizona right-wing political rallies over the past year” by the Arizona Republic.", "Attorney Lin Wood — who has peddled other election-related conspiracy theories — likewise retweeted a post suggesting Angeli was “antifa” and saying that he was at an “AZ BLM rally in June.”", "But a larger version of the same photo shows Angeli was carrying a sign for QAnon, the pro-Trump conspiracy theory.", "Angeli can also be seen carrying a QAnon sign in a video taken in November 2020 and shared by Travis View, a podcast host who researches QAnon. In the video, Angeli discusses a conspiracy theory about the media.", "Another tweet shared by Wood suggested that a different, bearded man pictured in the Capitol was a member of antifa by comparing the photo to an image from the website phillyantifa.org.", "But the Philly Antifa website was actually identifying the man in the photo, and another man, as alleged neo-Nazis — not its own members.", "The faulty claims about those three individuals were also at the core of a dubious Washington Times story, headlined: “Facial recognition firm claims Antifa infiltrated Trump protesters who stormed Capitol.”", "The story was shared more than 87,000 times, according to CrowdTangle analytics data, and cited by Republican Rep. Matt Gaetz (at 1:16:00) when the House resumed debate over an objection to certify Arizona’s Electoral College votes.", "The story claimed that a group called XRVision (whose work has been previously cited by right-wing outlets) “used its software to do facial recognition of protesters and matched two Philadelphia Antifa members to two men inside the Senate.” It further said that “XRVision also has identified another man who, while not known to have Antifa links, is someone who shows up at climate and Black Lives Matter protests in the West.”", "But an attorney for XRVision provided us with a statement saying that the story misrepresented its work and that “XRVision didn’t generate any composites or detection imagery for the Washington Times nor for a ‘retired military officer,'” as was claimed by the Washington Times.", "The statement instead claimed that XRVision identified the three individuals — the two alleged neo-Nazis pictured on the Philly Antifa website and Angeli — and that it did not identify any of them as being members of antifa.", "“The image analysis that we performed were distributed to a handful of individuals for their private consumption and not for publication,” the statement said. “Our attorney is in contact with the Washington Times and has instructed them to ‘Cease and Desist’ from any claims regarding sourcing of XRVision analytics, to retract the current claims, and publish [an] apology.”", "The Washington Times has since removed its story.", "Mark Bray, a historian at Rutgers University and author of “Antifa: The Anti-Fascist Handbook,” told us in an email that he had seen “no evidence of antifa involvement” in the riot. He said “the entire political nature of what happened is completely anathema to what antifascists advocate.”", "Other known figures on the right were among those who publicly showcased their participation in the riot. For example, Tim Gionet, an alt-right personality known as “Baked Alaska,” live-streamed his participation in breaking into the Capitol.", "During the riot, four individuals died — three due to presumed medical emergencies. A fifth individual, Capitol Police Officer Brian Sicknick, died Jan. 7 as a result of injuries sustained during the riot.", "Update, May 24: Although Capitol Police and the Justice Department initially reported that Sicknick died as a result of injuries sustained during the riot, the Washington Post has since reported that District of Columbia Chief Medical Examiner Francisco J. Diaz found that Sicknick suffered two strokes nearly eight hours after being sprayed with a chemical irritant during the riot. Diaz told the Post that Sicknick died of natural causes, but “all that transpired played a role in his condition.”", "One woman, Ashli Babbitt, reportedly an Air Force veteran, was fatally shot by a Capitol Police officer while rioters were “forcing their way toward the House Chamber” inside the Capitol, the department’s chief said. On Twitter, Babbitt espoused her support for Trump and QAnon.", "Update and correction, Jan. 8: An earlier version of this story misspelled Babbitt’s last name. We have corrected that error and updated this story to include information on the Jan. 7 death of a Capitol Police officer and a Jan. 8 statement by an FBI official.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“1.7.21 Chief Contee and @mayorbowser provide situational updates.” D.C. Metropolitan Police Department. 7 Jan 2021.", "Babbitt, Ashli (@Ashli_Babbitt). Twitter. Accessed 7 Jan 2021.", "Bray, Mark. Historian, Rutgers University. Email to FactCheck.org. 7 Jan 2021.", "Della Rocca, Brian R. Attorney for XRVision. Statement to FactCheck.org. 7 Jan 2021.", "“House Rejects Objection to Arizona Electoral Votes.” C-SPAN. 6 Jan 2021.", "“Keystone United Exposed Day 15.” Philly Antifa. 24 Sep 2018.", "Peiser, Jaclyn and Justin Jouvenal. “Woman fatally shot as pro-Trump mob stormed the Capitol identified as Air Force veteran.” Washington Post. 7 Jan 2021.", "Ruelas, Richard. “Longtime Arizona QAnon supporter in horned helmet joins storming of U.S. Capitol.” Arizona Republic. 6 Jan 2021.", "“Statement of Steven Sund, Chief of Police, Regarding the Events of January 6, 2021.” U.S. Capitol Police. 7 Jan 2021.", "Sternbeck, Dustin. Spokesman. D.C. Metropolitan Police Department. Phone interview with FactCheck.org. 7 Jan 2021.", "Tenbarge, Kat. “White nationalist Baked Alaska livestreamed himself from inside the US Capitol as he joined rioters.” Insider. 6 Jan 2021.", "“U.S. Capitol Police Arrests – January 6, 2021.” U.S. Capitol Police. 7 Jan 2021.", "View, Travis (@Travis_View). “Back on Nov. 5, 2020, @julianfeeld and I traveled to Phoenix, AZ to observe Trump supporters protest outside of the Maricopa County Tabulation center. There we saw Jake Angeli, aka the “Q Shaman,” speak to the crowd. Today Angeli led the charge into the Senate chamber in D.C.” Twitter. 6 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]