["“Did you know? Line 17 of the $1.9 TRILLION CV #Stimulus awards a $25 MILLION BONUS to House Reps,” claims a March 7, 2021 Facebook post from before Congress gave final approval to the package.", "“No big surprise. They are all Corrupt,” one user commented. Another echoed the sentiment, writing: “We thought they were working for us , but after all the only ones voting for the bill were Democrats !”", "But the claim is false.", "On March 11, 2021 President Joe Biden signed H.R.1319, known as the American Rescue Plan Act of 2021, which spreads aid across broad sections of pandemic-stricken US society.  No Republicans voted for the measure.", "The $1.9 trillion it unlocks will fund payments worth up to $1,400 for many Americans, unemployment aid, child tax credits, vaccinations, education, and aid to state and local governments.", "However, nowhere in the multi-hundred-page document is there a bonus for House or Senate members, whose salary has been $174,000 per year since 2009, except for those with special responsibilities.", "“This claim is false. There is no funding in the bill for either the House or the Senate,” Evan Hollander, spokesman for the House Committee on Appropriations, which is responsible for funding federal government activity, told AFP by email.", "Since most pages of the document feature a line 17, it is unclear which one in particular the posts refer to. A word search for “House” does not yield any results in reference to a bonus.", "The relief act is the latest in a series of cash injections aimed at countering the Covid-19 pandemic’s effects. When a $2.2 trillion package passed during former president Donald Trump’s administration in March 2020, online users claimed that House members voted to give themselves a raise.", "The CARES Act, as that package is known, featured $25 million dollars under a “Salaries and Expenses” heading for the House “to prevent, prepare for and respond to coronavirus.” This amount may have inspired this year’s claims, although the American Rescue Plan features no such provision.", "“The CARES Act, passed a year ago, included $25 million to support the House’s capability to telework, including for the purchase of equipment and improvements to the network,” Hollander said.", "“The funds were also appropriated to reimburse the staff of the House Child Care Center and pay the contracts for House food services,” he said.", "“None of the funds were for member salaries, which are paid directly from the Treasury pursuant to the Constitution.”", "AFP Fact Check has previously debunked a claim that the latest measure would cost each American $5,750.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]