["About this rating", "Criticisms of President Trump are often followed by comparisons to President Obama. That was the case following Veterans Day weekend in November 2018 as social media users shared a photograph of the 44th President at Arlington National Cemetery in the wake of President Trump's controversial decision to skip an event commemorating the 100th anniversary of the end of World War I:", "This is a genuine image of President Obama at Arlington National Cemetery. However, a number of social media users shared this photograph as if it were taken \"over the weekend\" in November 2018:", "Over the weekend, a lone figure could be seen at the Arlington National Cemetery walking in the rain. He quietly surprised many families who had traveled to see the graves of their loved ones. He offered kind words of love and encouragement. He was the 44th President. #44forever", "This photograph was taken on a rainy Veterans Day in 2009 by Associated Press photograph Pablo Martinez Monsivais. It is available via the AP with the following the caption:", "President Barack Obama walks through grave markers in during a unannounced visit to Section 60 at Arlington National Cemetery in Arlington, Va.,Wednesday, Nov. 11, 2009.", "Although this image was misrepresented as if it showed a recent event, the caption is largely accurate. After attending a wreath-laying ceremony at the Tomb of the Unknowns at Arlington, the 44th president made an unannounced visit to a section of the cemetery reserved for the veterans of the wars in Iraq and Afghanistan:", "Here's a contemporary report from the Associated Press:", "On a cold, rain-soaked Veterans Day, President Barack Obama walked slowly through the white, stone markers at the section of Arlington National Cemetery reserved for troops killed in Iraq and Afghanistan, the two wars he oversees as commander in chief.", "Obama on Wednesday observed Veterans Day with a traditional wreath-laying ceremony at the Tomb of the Unknowns at Arlington before an unannounced visit to the section reserved for those who fought in Iraq and Afghanistan.", "\"We gather here mindful that the generation serving today already deserves a place alongside previous generations for the courage they have shown and the sacrifices that they have made,” Obama said in a brief speech following the wreath-laying. Obama pledged he would do right by all veterans and families, saying: \"America will not let you down” ...", "Before returning to the White House to discuss the Afghan strategy with his top military and national security advisers, Obama walked through Arlington’s Section 60, where fallen troops from Iraq and Afghanistan are buried.", "The president stopped at the grave of Spc. Ross McGinnis, a Medal of Honor recipient who was killed in Iraq, before he and first lady Michelle Obama walked through the rows of white headstones marking the fallen, the first president to do so while in office, according to cemetery staff. The Obamas shook hands and embraced surprised family members there to pay their respects, pausing to speak with them briefly beside the graves.", "Contrary to the viral caption, however, President Obama was accompanied by First Lady Michelle Obama (and presumably some White House security). An image from White House photographer Pete Souza shows the Obamas during their visit to Section 60:", "He was at Arlington National Cemetery for Veterans Day, and after his remarks, made an impromptu stop at Section 60, where troops from Afghanistan and Iraq are buried. He paused to leave a Presidential coin in front of the tombstone for 19-year-old Medal of Honor recipient Specialist Ross McGinnis. Later that same day, the President held a briefing in the Situation Room on Afghanistan.", "Pace, Julie.   \"Obamas Honor Fallen Soldiers at Arlington.\"\r\n    Associated Press.   12 November 2009.", "Nakamura, David.   \"Critics Pile on After Trump Cancels Visit to U.S. Military Cemetery Outside Paris, Citing Weather.\"\r\n    The Washington Post.   10 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]