["The 32-second video was published on Facebook here on April 1, 2020.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi-language caption translates to English as: “Coronavirus is not spreading in India but it is being spread in the country. The latest example was found from Nizamuddin.”", "Nizamuddin is a locality in Delhi with a large Muslim population. It has also been identified as a major COVID-19 hotspot after at least 10 deaths and several infections were linked to an Islamic religious gathering in the area, AFP reported.", "The video was also shared alongside similar claims here, here, here and here on Facebook and here, here, here and here on Twitter.", "However, these claims are false.", "A reverse Google image search using video keyframes extracted with InVID-WeVerify, a video verification tool, found a longer version of the video published here on the online video platform Vimeo on July 31, 2018.", "Below is a screenshot of the video on Vimeo:", "The video caption reads, in part: “Please watch this video depicting crazy behaviors of these gullible Bohras. Bohra chief priest Syedna Mufaddal, also called SMS, has directed Bohras to clean their big 4’-5’ group-eating plate called Thal. So, these brainwashed Bohras who are trained to follow each word of Syedna as a knee jerk reaction, are licking dirty plates, bowels, spoons and eat every grain and drop of waste food. They are not hungry like dogs in the picture, they eat and overfill their stomachs, just for fulfilling command of SMS.”", "Syedna Mufaddal is a religious leader among the Bohra community, a sect within Islam.", "On a community website, Bohra Muslims’ dining etiquette is described as: “Bohras have a no-wastage policy so not a single morsel should be left on the thaal when it is taken away.”", "In response to the misleading video, Huzaifa Patanwala, a member of Mumbai’s Bohra Committee, told AFP that the footage was taken in 2018, almost a year before the COVID-19 outbreak.", "“The video circulating on social media and claiming that Muslims are licking utensils to spread coronavirus is fake and grossly misconstrued. The video was made by some students of our community in 2018,” he said.", "Murtaza B. Sadri, another member of the Bohra Committee, added that the video was filmed at the community centre in Marol area of Mumbai to educate “community members against wastage of food as per the teachings of our spiritual leader”.", "He said: “Not to waste even a single grain of food is one of the many pillars of teachings of our spiritual leader Syedna and this video was shot by seminary students of our community to demonstrate how to do it.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]