["By Angelo Fichera", "Posted on September 5, 2018", "Q: Did Nike end its new deal with Colin Kaepernick because he made “anti-white” remarks?", "A: No. That made-up story was first published by a website that says its work is satire.", "Some are calling for a boycott of Nike after the sports apparel company debuted an ad campaign featuring Colin Kaepernick, the former NFL player who started the recent, and controversial, trend of players protesting during the national anthem. Some reported burning their Nike products in disapproval.", "Others applauded the company for putting a spotlight on Kaepernick, the one-time San Francisco 49ers quarterback who began kneeling on the sidelines during the anthem in 2016 to speak out against social injustice. The ad is part of the 30th anniversary of Nike’s “Just Do It” campaign; the company will also reportedly sell new Kaepernick apparel.", "But only in a fictional account did Nike end its deal with Kaepernick.", "A false story making that claim was posted Sept. 3 on conservativecolumns.com after Kaepernick posted the ad on social media. The report claimed that a recording of “anti-white” remarks made by Kaepernick had been sent to Nike officials.", "“BREAKING: Colin Kaepernick Immediately Loses Nike Endorsement After Anti-White Rant,” declares the headline.", "“Kaepernick lost the endorsement almost as soon as he got it when his anti-white attacks got him in trouble with Nike leadership,” the story says.", "In reality, the story was first published by America’s Last Line of Defense, an online publication that claims its work is satire and that has used a number of websites to post its content.", "There are hints of satirical intent.", "The original post was published on the Last Line of Defense website “worstpot.us/ever,” and the story’s URL includes the statement: “just-admit-you-hate-his-skin-color.” The story also references “Nike president Charles Bartowski,” which was the name of the central character on the NBC show “Chuck.” (Nike’s president, chairman and CEO is Mark Parker.)", "But the story’s headline and opening paragraphs stand to mislead those who don’t read the full piece critically. While the Last Line of Defense website includes a disclaimer and a satire label, the version that was posted on conservativecolumns.com is not identified as such.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“About.” Worsepot.us. Accessed 4 Sep 2018.", "“About Nike – Executives.” Nike.com. Accessed 4 Sep 2018.", "“BREAKING: Colin Kaepernick Immediately Loses Nike Endorsement After Anti-White Rant.” Conservativecolumns.com. 3 Sep 2018.", "“BREAKING: Colin Kaepernick Immediately Loses Nike Endorsement After Anti-White Rant.” Worstpot.us. 3 Sep 2018.", "“Chuck (TV Series 2007-2012).” IMDb.com. Accessed 4 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]