["A video of people pelting stones and bricks at cars passing by a road is viral on social media with the claim that they attacked Bihar Chief Minister Nitish Kumar’s convoy. The clip is circulating ahead of upcoming Bihar polls.", "नीतिश कुमार जी आप इतना अच्छा काम करते ही क्यों हो की जनता के बीच से आप को भागना पड़ रहा है 😂🤭🤪 pic.twitter.com/VkCJWMCDSv", "— MDNAJIM🛡️🇮🇳 (@MDNAJIM2) October 18, 2020", "The video is also circulating on Facebook with the caption, “Nitish Kumar ji, why do you do such good work that you have a run away from the public? (नीतिश कुमार जी आप इतना अच्छा काम करते ही क्यों हो की जनता के बीच से आप को भागना पड़ रहा है.)”", "The same clip was doing the rounds in June as people attacking Home Minister Amit Shah’s convoy in Bihar during election campaigning.", "தேர்தல் பிரச்சாரம் செய்ய பீகார் சென்ற அமித்ஷா கார் மீது கல்லெறிந்து மக்கள் எதிர்ப்பு;", "சீன ராணுவத்தின் தாக்குதல், கொரோனா பாதிப்புகளை அரசியல் லாபத்துக்காக திசைதிருப்புவதாக குற்றச்சாட்டு!#bjpfails#IndianArmy pic.twitter.com/9fYfsIAopl", "— #DMK4TN (@DMK4TN) June 22, 2020", "Alt News had also received fact-check requests on its official mobile application.", "This slideshow requires JavaScript.", "A reverse-image search of one of the keyframes of the video led us to the same clip broadcast by News18 on January 13, 2018. According to its description, “WATCH: While Bihar CM Nitish Kumar was on his way to a village in Buxar, some villagers started pelting stones on the CM’s convoy.”", "Bihar CM Nitish Kumar’s Convoy Attacked.", "WATCH: While Bihar CM Nitish Kumar was on his way to a village in Buxar, some villagers started pelting stones on the CM’s convoy.", "Posted by News18 on Saturday, 13 January 2018", "The incident was reported across media outlets. As per NDTV, “…people of Nandan village wanted the chief minsiter to visit the Dalit basti which led to a disagreement followed by stone-pelting. Mr Kumar has safely left the area.”", "A two-year-old video of Bihar CM Nitish Kumar’s convoy attacked in Bihar during state-wide tour has been falsely linked to upcoming Bihar elections.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]