["By Brooks Jackson and Robert Farley", "Posted on June 11, 2018", "Sen. Bernie Sanders claims that “the average American worker today, despite the strong economy, is not getting ahead.” Not so. Hourly wages have been rising faster than inflation for years, and that trend has continued under President Donald Trump.", "“Real” (inflation-adjusted) hourly wages for production and nonsupervisory employees have gone up nearly 0.8 percent since Donald Trump took office, after rising 2.8 percent during Obama’s eight years in office.", "To be sure, the rise has gone in fits and starts. Sanders seized a hiccup in the long-term trend during an interview with CNN’s Chris Cuomo on June 7, when he said “real wage increases for the average American worker … last year” amounted to “zero.”", "Sanders, June 7: [D]o you know what the increase in wages — real wage increases for the average American worker was last year?", "Cuomo: About 3 percent.", "Sanders: Zero. Not a — nope. It kept pace with inflation for the average American worker. It didn’t make a nickel more after you account for inflation. …", "So, the bottom line is, the average American worker today, despite the strong economy, is not getting ahead.", "Asked for backup, Sanders’ press office pointed to a May 10 report from the Bureau of Labor Statistics that shows the real hourly wage for production and nonsupervisory employees on private nonfarm payrolls did not go up at all between April 2017 and April 2018. (See Table A-2.)", "But that is no longer correct. Figures downloaded from the BLS website, which are based on slightly more recent and extensive data than in the press release, show a 0.1 percent increase in real hourly wages in that 12-month period. Even that figure remains preliminary, and subject to revision for another month or so.", "The larger fact is that real hourly wages have been generally rising since hitting a low point in 1994-95. As of April, they were 19 percent higher than that low point (though still 1.5 percent below the highest point reached in 1972).", "Furthermore, paychecks are rising even faster than hourly wage rates, because part-time workers are finding more work and full-time workers are getting more overtime pay. Inflation-adjusted weekly earnings for production and nonsupervisory employees have risen 1.4 percent under Trump, after rising 3.7 percent under Obama.", "Looking at all private-sector workers (including managers and supervisory workers), real weekly earnings went up 4 percent during Obama’s eight years, and have gone up another 1.1 percent under Trump, according to the most recent figures from the Bureau of Labor Statistics.", "Those figures are a bit volatile because the Consumer Price Index can fluctuate a bit month to month. During Trump’s time in office, for example, the 12-month change in real hourly earnings has fluctuated between a decrease of 0.4 percent (during the 12 months ending February 2017) and an increase of 0.8 percent (during the 12-month period ending June 2017).", "That’s mainly due to the yo-yo effect seen in gasoline prices (which make up more than 5 percent of the CPI) and sometimes food prices. And as we all know, gasoline prices have been on a tear in recent months, but can drop almost as quickly as they rise. The Energy Information Administration expects them to drop in September, after the summer driving season is over.", "Sanders is free to argue that the rise in real wages and earnings is too slow, and that the average worker isn’t getting ahead fast enough. That’s a matter of opinion. And he’d be correct to say that real hourly wages haven’t yet recovered to the peak levels seen in the early 1970s. But he’s wrong to seize on a monthly blip in the statistics to support a misleading claim that they are not getting ahead at all.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]