["About this rating", "On 8 July 2015, Change.org user Ryan Koch of Des Moines initiated a petition on that site seeking to \"Change the name of Cracker Barrel to Caucasian Barrel.\" That petition appeared at a time of heightened racial controversy in the United States: in particular, while debate was ongoing about whether display of the Confederate flag should be retired to primarily historical contexts in the wake of a racially-motivated shooting at a Charleston, South Carolina, church on 17 June 2015.", "The petition facetiously suggested that the Cracker Barrel Old Country Store chain of restaurants and gift shops employed an \"offensive slur\" in its name:", "I say all of us European Americans start protesting C****er Barrel. It uses an offensive slur and it is deeply offensive and mocks our long and proud heritage.", "The name is offensive, their logo stereotypes European Americans as people who sit on chairs and lean against what appears to be a bourbon barrel, claiming we are all a bunch of alcoholics. Sure, they'll SAY it's a \"cracker\" barrel but everyone knows crackers don't come in barrels, they come in bags and boxes!", "Change the name C****er Barrel to Caucasian Barrel. After all, white people should have something to be offended by, too!", "The petition was popular on social media sites, where some users found it clever (and others claimed the joke as their own):", "I demand that Cracker Barrel immediately change its name to Caucasian Barrel because I am offended", "— Jamey McMahan (@jameymcmahan75) July 10, 2015", "Since @Redskins name is offensive, we should change the @CrackerBarrel name next. #RedskinsNation pic.twitter.com/v9rWHs61YD — David (@dpartenio) July 10, 2015", "We need to change the name Cracker Barrel to Caucasian Barrel. I find the word 'cracker' highly offensive. — Tyler Lovett (@DontYouLovett) July 10, 2015", "The petition suggested the name \"Cracker Barrel\" was suspect, as \"everyone knows crackers don't come in barrels.\" However, an obituary for Cracker Barrel founder Dan Evins published in the Washington Post in 2012 gave the following explanation for the chain's nomenclature:", "To distinguish his station from others, he added a small restaurant and gift shop and called the outfit Cracker Barrel — a reference to old-time country stores where people played checkers atop barrels used to carry crackers and other wares.", "According to NPR, the pejorative term \"cracker\" was essentially \"reclaimed\" by poor white people well before the Cracker Barrel chain existed:", "By the early 1800s, those immigrants to the South started to refer to themselves that way as a badge of honor and a term of endearment.", "After his tongue-in-cheek petition garnered a good deal of attention, Ryan Koch clarified that it was not meant to be regarded as anything other than a form of satirical expression:", "I started this satirical petition in lieu [sic] of constant media reports of various groups and organizations constantly wanting to change things throughout the country because they claim they are offended.", "The petition was meant to shed light on how ridiculous all of the political correctness currently going on in the country is, and how we should focus on real issues such as crime, unemployment, veteran suicide, and corrupt politics rather than cater to everyone who feels they need to be offended.", "I do not in any way feel the need for, or want Cracker Barrel to change their name. I do not have any ill feelings towards the restaurant chain, and I enjoy dining at their locations frequently. I am not expecting a response from Cracker Barrel in regards to this petition, as they were not involved in the creation of it.", "Neither Cracker Barrel nor anyone who reads the petition should take its purpose of changing the name seriously.", "The petition is strictly for satirical and comedic purposes to show how ridiculous political correctness is getting in America.", "Cracker Barrel themselves said of the issue that:", "Cracker Barrel is aware of this satirical petition and recognizes that individuals have the right to express their opinion on all types of things. At Cracker Barrel, our mission is Pleasing People. While we respect the opinions of these individuals, our brand is well-known as a home away from home so we have no plans to change our name as it is synonymous with great food and great service.", "Thousands of people have since signed the \"Change the name of Cracker Barrel to Caucasian Barrel\" petition, but it doesn't seem many (if any) considered the missive anything other than a critique of a culture that detractors feel has become too sensitive.", "On 15 September 2016, a web site covered the ancient nontroversy and revived the rumor that \"liberals\" sought to change the name of Cracker Barrel, but the petition on which that claim was based remains purely a satirical one.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]