["A letter which was purportedly written by Karnataka Congress leader M B Patil to Sonia Gandhi in July 2017, has been shared by a few social media users. According to the tweet, the letter exposes the divide-and-rule policy of the Congress party which had allegedly fomented division within the Hindu community in Karnataka by pledging a separate status for the Lingayat community.", "कांग्रेस किस हद तक जा सकती है ध्यान से देखिए कर्नाटक के कांग्रेसी मंत्री M.b. patil का सोनिया गांधी को पत्र जिसमें साफ लिखा है कि भाजपा को हराना है तो हिंदुओं को तोड़ दो। और ऐसा करने के लिए global Christian council or world Islamic organisation आपकी मदद करेगा।@SoniyaGandhinc pic.twitter.com/W55s9wVJ9K", "— 🚩भगवाधारी कट्टर हिन्दू नितेश कुमार सिंह धनगर🚩⚔️ (@BhagvadhariD) March 22, 2021", "The official Twitter handle of the Bharatiya Janata Party Karnataka state unit had shared the letter on April 16, 2019. It was retweeted over 1400 times and ‘liked’ over 1800 times.", "Congress exposed", "The entire Lingayat & Veerashaiva community division was planted under direct instruction of Sonia Gandhi", "The letter written to Sonia Gandhi by Congress leader MB Patil exposes shocking details of how Sonia Gandhi wanted to divide Hindu communities in Karnataka pic.twitter.com/ZC6CpQf1fN", "— BJP Karnataka (@BJP4Karnataka) April 16, 2019", "An excerpt from this letter is quoted below.", "“The unanimous opinion is that in order to win the 2019 Lok Sabha elections, it is essential to curb the RSS growth in Karnataka and defeat BJP in the 2018 Assembly elections. This can be achieved by uniting the Muslims and Christians on the basis of their faith; divide the Hindus on the basis of caste/sub-caste and sect and sub/sect.”", "The same ‘letter’ had circulated widely ahead of the assembly election in Karnataka in May 2018. The fake news website Postcard News had even published an article based purely on this fake letter. The article was, expectedly, later deleted and so was Postcard News founder Mahesh Vikram Hegde’s tweet regarding the same.", "The letter is fake. Not only are the language and contents a dead giveaway, but a quick Google search also reveals that ‘Global Christian Council’ and ‘World Islamic Organisation’, organisations with which the Congress has supposedly schemed to politically divide the state, do not even exist. The names of the organisations are a figment of imagination.", "Moreover, M B Patil, in a conversation with Alt News had confirmed that the letter is fake. Alt News’ earlier fact-check can be read here.", "The English news channel Republic TV initially reported about this letter, publishing an article with the words “SENSATIONAL: BJP shares purported Congress’ 2017 strategy letter addressed to Sonia Gandhi pitching explosive caste and religion divide and conquer plan”.", "The article is now no longer on the website. A little later, Republic TV updated their reportage with the word ‘fake’ to describe the letter. It may be noted that this was in the nature of an update, and not a clarification or an acknowledgement of error.", "With assembly elections in five states underway, such recirculation of previously bunked information is to be expected. Alt News has been debunking false news ahead of the polls.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]