["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Two images taken March 29, 2020, show the different scenes early in the pandemic. Two people relax in St. Petersburg, Fla., left, while, in New York, a woman wearing a facial mask makes her way across 6th Avenue near Radio City Music Hall. (AP)", "We’ve seen plenty of posts comparing New York and Florida on their handling of the coronavirus that seem to make the case that Republicans in Florida are managing the pandemic better than Democrats in New York.", "But the comparisons are fraught for a number of reasons. The pandemic largely erupted in the United States in New York, before doctors had the equipment and therapeutics needed to fight the disease. Florida benefited from the lessons New York learned.", "The numbers in this particularly viral image need context and some lack accuracy.", "Who would have thought a global pandemic would only heighten a longstanding rivalry between Florida and New York?", "Tensions flared early in the COVID-19 outbreak when Florida issued restrictions on travelers from New York, then a raging hot spot for the virus. New York returned the favor in the summer, putting Florida travelers on its own quarantine list.", "Now, social media users are comparing the two states’ handling of the virus, sharing a pro-Florida Instagram post from an account called \"Unwoke Narrative\" that points to the states’ politically opposed governors as reasons for differences in state COVID-19 data.", "Invoking the names of Florida’s Republican Gov. Ron DeSantis and New York’s Democratic Gov. Andrew Cuomo, a graphic titled \"Cuomo vs. DeSantis: How NY & FL Handled the Virus\" lists several COVID-19 figures for each state. \"Cuomo maintained strict lockdowns, crushing jobs and freedom,\" it says. \"DeSantis took the opposite route and rejected tyranny. Who was right?\"", "Spoiler alert: The graphic determines Florida is the winner \"even though Florida has a larger population,\" \"is disproportionately elderly\" and \"is visited by more potentially infected tourists.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It cites as sources the Washington Examiner, New York Post, NBC, Washington Post and Statista. The accompanying text points readers to a website with more information. Some of the numbers check out. The graphic is close, for example, on the spread between the states’ hospitalizations and vaccinations administered.", "But when we reviewed the overall claim, we found the broader comparison misleads by oversimplifying the relationship between the data and lockdown rules in each state.", "Let’s take a look.", "The post’s most glaring omission, experts told us, was its lack of context about the pandemic’s timing and impact in the two states.", "\"New York was the epicenter of the pandemic last spring, long before Florida had significant numbers of cases,\" said Richard Mollot, executive director at the Long Term Care Community Coalition, a nonprofit focused on improving quality of care for people in nursing homes and assisted living facilities.", "The virus hit New York early and hard, before there was enough access to personal protective equipment and before health officials or emergency room doctors and nurses knew much about the virus, including the best ways to treat and stabilize it.", "The result was mass devastation and death. During that early stage, the state was averaging over 900 deaths a day.", "Dr. Marissa Levine, a professor of public health at the University of South Florida, said not only was New York’s experience unlike any other in the nation, but it also informed how the rest of the country would manage the pandemic. \"There’s no question that Florida hospitals were able to learn from what New York went through and benefited as a result,\" she said.", "Cuomo’s administration has faced intense scrutiny over its undercounting of COVID-19 nursing home deaths. New York’s attorney general released a Jan. 28 report that found the state had failed to report thousands of deaths. Hours later, the state’s health department added more than 3,800 deaths to the tally, each a resident whose hospital death had not been previously counted.", "Yes, New York is reporting higher numbers of COVID-19 deaths of nursing home and assisted living facility residents than Florida, but we couldn't find data that puts it as high as the graphic reports — 15,000+ in New York compared with 9,000+ in Florida. The latest state numbers from Feb. 4, which includes the hospitalization data, show about 13,300 have died in New York. Florida’s total is around 9,700.", "Priya Chidambaram, a senior policy analyst at Kaiser Family Foundation who has tracked the pandemic’s impact on long-term care facility residents, said the post is problematic because states collect and report data differently.", "\"They're not necessarily comparable,\" she said. \"Non-nursing home settings are defined differently in each state. The best way to compare is to look at recent trends in federal data.\"", "As of Feb. 7, such federal data showed New York had 10.1 positive COVID-19 cases per 1,000 nursing home residents, while Florida was at 6.3. When it came to deaths per 1,000 residents, New York was at 2.99 residents and Florida at 1.85.", "It’s important to note that the states don’t have comparable nursing home population numbers, at least as of 2019. New York was reporting about 19,000 more residents in certified nursing facilities than Florida, according to Kaiser Family Foundation data.", "The post is right that New York has had more deaths than Florida, even when accounting for population.", "The numbers it says it relies on are not far from what we saw recorded on Feb. 25, when New York was reporting about 247 deaths per 100,000 people compared with Florida’s 143.", "But the metric again ignores New York’s unprecedented early peak and the ebb and flow of death rates across states over time. Daily deaths have surged in Florida at times when they remained low in New York, and vice versa.", "\"There’s a time factor here,\" Levine said. \"These pandemics are really epidemics that happen in different places at different times, and you have to really consider that when you’re doing comparisons.\"", "On April 14, for example, when the first wave peaked in New York, the state had a seven-day average of 39.3 deaths per 1 million residents while Florida was at 2.1, according to the COVID Tracking Project. On Aug. 16, Florida recorded a seven-day average 8.5 deaths per million people while New York was at 0.2.", "\"The implication is that the political decisions in Florida versus New York has led to those numbers, but I think that would be a very shallow interpretation of the data,\" said Dr. Thomas Tsai, an assistant professor in health policy and management at Harvard T.H. Chan School of Public Health. \"Lockdown measures do work.\"", "PolitiFact previously found that some of the more strictly regulated states performed better than Florida, as of early December 2020. And a study that Tsai participated in that has been preliminarily accepted for publication found that first-wave lockdowns did result in a downtick in COVID-19 cases two weeks later.", "Daily case numbers provide a snapshot of how one state compares with another on any given day. And the post’s figures showing Florida had 7,400 daily cases as of Feb. 8 while New York was at 9,000 is in the ballpark with what we see in COVID Tracker data for that period.", "But the metric does not reflect additional data points that place New York in a better position than Florida: the number of people tested and each state’s rolling positivity average. It again ignores that there were times when daily cases were high in Florida when they were not in New York.", "On Feb. 8, New York reported a 5.1% positivity rate, according to state data and Florida saw a 7% positivity rate. The seven-day average of positive cases for the week ending Feb. 8 show New York in a better position, too, with a 5.2% average compared with 8.3% in Florida.", "Job losses in New York over the course of the pandemic have outpaced Florida’s, but experts caution against making such comparisons.", "The graphic shows over 1 million jobs lost in New York versus more than 400,000 in Florida, and that lines up with data from the U.S. Bureau of Labor Statistics.", "Florida’s economy, fueled by out-of-state tourism and service industries, was hit hard by the pandemic. But the impact on jobs may have been mitigated by its warm weather, which allowed for dining and other types of public gatherings and businesses to continue operating outdoors.", "Jed Kolko, chief economist at Indeed, said places that have faced longer-term economic challenges, like much of upstate New York, have lost more jobs in the pandemic.", "Douglas Holtz-Eakin, president of the right-of-center American Action Forum, urged caution when comparing state economies, including adjusting for time periods when the states were having similar impacts from the virus and state policies. \"I’m not morally opposed to compare across states, but you do have to be careful to do the comparison in a fair way,\" he said.", "While Florida was able to keep its economy more open, it came at a cost.", "To better understand the balance between economic recovery and public health, MoneyGeek analyzed the rate of case growth and deaths versus the rate of jobs recovered using data from the Bureau of Labor Statistics and Johns Hopkins.", "Looking at job losses from February 2020 and measuring job gains in each state from the point of highest job loss to the point of highest recovery, the report found that red states like Florida \"recovered 35% more jobs than blue states — 65% compared to 48%. However, red-state recovery rates came at a higher price, with 99% more COVID-19 cases and 78% more deaths per recovered job than blue states.\"", "Florida recorded 50 cases per 100 jobs recovered, according to the analysis, while New York recorded 19.", "An Instagram post says New York’s lockdown measures led to more death and economic destruction while Florida’s more open approach led to less.", "The post overstates the correlation between the numbers and lockdown rules. It leaves out important factors, including environment and public health initiatives, and ignores that the two states collect and report data differently.", "Most significantly, it ignores that New York City was the epicenter of the nation’s first wave, before doctors had the equipment, therapeutics and experience needed to fight the new disease. States like Florida were able to learn and benefit from New York’s experience.", "We rate this Mostly False.", "Correction, March 5, 2021: A subhead in this story has been updated to more precisely describe New York's position as one of the nation's earliest and hardest hit states in the COVID-19 pandemic.", "Instagram post, Feb. 11, 2021", "UnwokeNarrative.com, Cuomo vs. DeSantis: New York's and Florida's Covid Response, Feb. 11, 2021", "Kaiser Family Foundation, COVID-19 Has Claimed the Lives of 100,000 Long-Term Care Residents and Staff, Nov. 25, 2020", "Kaiser Family Foundation, Total Number of Residents in Certified Nursing Facilities, 2019", "Health.NY.gov, Nursing Home and ACF COVID Related Deaths Statewide, Data through Feb. 4, 2021", "New York Times, N.Y. Severely Undercounted Virus Deaths in Nursing Homes, Report Says, Updated Feb.17, 2021", "PolitiFact, What’s missing from Florida ‘5 times better’ claim on COVID-19 death rates, July 31, 2020", "PolitiFact, Is Florida doing better on COVID-19 than \"locked down\" states?, Dec. 2, 2020", "The COVID Tracking Project, Deaths per Million over Time, Accessed Feb. 25, 2021", "Impacts of US State-Level Social Distancing Policies on Population Mobility and COVID-19 Case Growth During the First Wave of the Pandemic, Nov. 19, 2020", "U.S. Bureau of Labor Statistics, All Employees: Total Nonfarm in New York, retrieved from FRED, Federal Reserve Bank of St. Louis, February 21, 2021", "U.S. Bureau of Labor Statistics, All Employees: Total Nonfarm in Florida, retrieved from FRED, Federal Reserve Bank of St. Louis, Feb. 22, 2021", "MoneyGeek, The Cost of American Job Recovery, Feb. 8, 2021,", "Chart 3: Job Change by Industry, February to December 2020, Accessed Feb. 26, 2021", "The Sun Sentinel, Florida reports 5,610 new COVID-19 cases, with 148 more deaths, Updated Feb. 23, 2021", "Phone interview with Douglas Holtz-Eakin, president of the American Action Forum, Feb. 22, 2021", "Email interview with Jed Kolko, chief economist at Indeed, Feb. 22, 2021", "Email interview with Richard Mollot, executive director at the Long Term Care Community Coalition, Feb. 22, 2021", "Phone interview with Priya Chidambaram, senior policy analyst at Kaiser Family Foundation, Feb. 23, 2021", "Phone interview with Dr. Marissa Levine, Professor of Public Health at the University of South Florida, Feb. 22, 2021", "Phone interview with Dr. Thomas Tsai assistant professor in health policy and management at Harvard T.H. Chan School of Public Health, Feb. 23, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]