["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assemblymember Michael P. Kearns, a Democrat who’s running on the Republican line for Erie County clerk, says he has a history of standing up to leadership in government.", "Kearns claims in a television ad that he wasn’t shy about calling out Sheldon Silver, who served as State Assembly speaker for two decades before his conviction on federal corruption charges in 2015.", "\"When I saw corruption and sexual harassment cover-ups I called on Sheldon Silver to resign,\" Kearns says in the ad.", "Some of his colleagues in the Assembly found it difficult to oppose Silver, even after his arrest.", "Kearns says he didn’t fall into that camp. Is that true?", "Sexual harassment in the State Assembly", "Kearns first called for Silver to resign in 2013. It was Kearns’ first full year in the Assembly.", "Kearns chose to conference with the Democratic majority in the Assembly when he first took office in 2012. That lasted about a year.", "Then news broke that Silver had helped cover up reports of sexual harassment in the State Assembly. A state ethics report accused former Assemblyman Vito Lopez of harassing at least eight women during his time in the chamber.", "The report accused Silver and his staff of failing to properly investigate the sexual harassment claims against Lopez. Silver also approved a confidential settlement of more than $100,000 for two women who accused Lopez of harassment.", "When the ethics report was released, Kearns called for Silver to resign. He also left the Democratic conference in the Assembly.", "\"I am a father with a teenage daughter,\" Kearns wrote in The Buffalo News. \"I must ask, ‘Would I trust my daughter’s welfare under Sheldon Silver’s leadership or supervision?’ The record is clear beyond a reasonable doubt: The answer is ‘no.’ \"", "Silver’s corruption charges", "Kearns again called for Silver to resign in 2015.", "Silver was arrested on federal corruption charges in January 2015. Federal prosecutors accused Silver of using his position as speaker to accept millions of dollars worth of bribes and kickbacks.", "Kearns, who never re-joined the Democratic conference, called for Silver’s resignation the morning he was arrested.", "\"Secret settlements, sex scandals and now criminal allegations. All of the above should disqualify Silver from keeping leadership position,\" Kearns said in a tweet minutes after Silver’s arrest.", "At first, most Democratic Assembly members rallied behind Silver, their leader of two decades. Silver eventually stepped down after calls for his ouster mounted.", "Kearns did not re-join the Democratic conference until Silver was convicted later that year. His conviction has since been overturned, but prosecutors are expected to bring a new case against the long-time assemblymember.", "Our ruling", "Kearns said when he \"saw corruption and sexual harassment cover-ups I called on Sheldon Silver to resign.\"", "Kearns first called on Silver to resign in 2013. He even left the Democratic conference because he did not support Silver as speaker. His position never changed.", "We rate his claim as True.", "Kerns for Clerk Ad, Oct. 23, 2017, Mickey Kearns for Clerk YouTube page", "\"Report Finds Lawmaker Was Shielded by Leaders\", New York Times, May 15, 2013", "\"Kearns leaves Democratic caucus, calls on Silver to resign speakership\", WBFO, May 21, 2013", "\"Bad Week Is Merely Bump for Assembly’s Master of Power\", New York Times, May 20, 2013", "\"Kearns: Silver’s cover-ups make him unfit to serve as speaker\", The Buffalo News, May 24, 2013", "\"Validated Kearns will rejoin Democrats after silver conviction\", City&State, Dec. 1, 2015", "\"New York State Assembly Speaker Sheldon Silver says 'I'm sorry' for his role in the Vito Lopez sex scandal coverup\", New York Daily News, May 21, 2013", "\"Sheldon Silver, Assembly Speaker, Took Millions in Payoffs, U.S. Says\", New York Times, Jan. 22, 2015", "\"Sheldon Silver arrested for taking $4M in bribes, kickbacks\", New York Post, Jan. 22, 2015", "\"Lawmakers on both sides of aisle call on Sheldon Silver to quit in bombshell corruption case\", New York Daily News, Jan. 22, 2015", "Michael Kearns Tweet, Jan. 22, 2015", "\"The day the Assembly said no to Sheldon Silver\", POLITICO New York, Jan. 27, 2015", "\"Sheldon Silver to resign as Assembly speaker\", New York Post, Jan. 27, 2015", "\"With Leadership Fight Underway, Session Is Cancelled\", NY State of Politics, Jan. 26, 2015", "\"Erie County Republicans support Kearns for County Clerk\", WIVB, April 12, 2017", "\"Erie County GOP backs Democrat Kearns in race for County Clerk\", WBFO, April 12, 2017", "2012 Special Election Results, NYS Board of Elections", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]