["President Donald Trump is back at the White House after receiving treatment for COVID-19 at Walter Reed Army Medical Center. But a viral video by right-wing media  outlet InfoWars claims the doctors there weren’t really trying to help the president.", "“President Trump is being given very dangerous experimental drugs that no one has ever been given together,” InfoWars’ Alex Jones said. “President Trump is in grave danger. Evidence is mounting he’s being deliberately killed at Walter Reed Military Hospital.”", "Jones insinuates that in addition to Trump’s treatment being “dangerous” that it may be a part of a bigger scheme by the “Deep State,” a term – coined by conspiracy theorists –  for an alleged secret network of influential members of government agencies and the military running the country behind the scenes.", "The video was shared on Facebook on Oct. 3 by the group Trump Supporters NZ, where commenters expressed outrage over the allegations.", "“I was just telling a friend that I couldn't believe they would use an experimental drug on the POTUS,” one commenter wrote. “I pray he's ok.”", "In a video published Oct. 5, Jones strengthened his accusation, alleging Walter Reed “tried to kill Trump and failed.”", "Neither InfoWars nor Trump Supporters NZ responded to USA TODAY’s requests for comment.", "Fact check:Fake Trump quote about battling coronavirus, his body", "Since announcement of his diagnosis on Oct. 2, Trump received an extensive medical regimen that included Regeneron's experimental antibody drug and Gilead's remdesivir.", "Remdesivir first emerged in October 2015, when it was found to be effective during the Ebola outbreak in West Africa. The drug, a result of collaboration between Gilead, the U.S. Centers for Disease Control and Prevention and the U.S. Army Medical Research Institute of Infectious Diseases, works by interfering with a virus's ability to copy its genetic material. It was considered a potential COVID-19 treatment early in the coronavirus pandemic and underwent clinical trials in February in Wuhan, China.", "In April, the National Institutes of Health released preliminary data that showed remdesivir cut recovery time for severely ill patients from 15 to 11 days. While it did not significantly improve the death rate, this result gave medical experts reason to believe the antiviral could prove helpful for patients with early to mild disease.", "Subsequent preliminary data from Gilead published in The New England Journal of Medicine found \"remdesivir was superior to placebo in shortening the time to recovery in adults hospitalized with Covid-19 and evidence of lower respiratory tract infection\" in patients given a 10-day course.", "Fact check:Trump's antibody therapy not made from fetal stem cells but fetal-derived cells used during testing", "Regeneron's experimental antibody \"cocktail,\" known as REGN-COV2, is a combination of two antibodies, proteins made by immune cells called B cells. These antibodies, REGN10933 and REGN10987, are engineered to lock on to SARS-CoV-2's spike protein, preventing it from interacting with its target on the host cell surface, the ACE2 receptor.", "According to a memorandum written by White House physician Dr. Sean Conley, Trump received an 8-gram dose of Regeneron's antibody cocktail prior to his hospitalization. The dosage is higher than doses studied in some REGN-COV2 clinical trials to date but appears to work well, according to initial data released by Regeneron in September.", "Dr. Ilan Schwartz, an infectious disease expert at the University of Alberta in Canada, told USA TODAY that giving Trump the antibody cocktail was not unreasonable.", "“I think there's enough data to support that it's probably safe,\" he said. \"It's certainly not ready for prime time, but in exceptional circumstances, it would be reasonable (to give to a patient).\"", "USA TODAY interviewed several doctors about Trump’s treatment, and many supported the decision to try both drugs. It’s true, though, that they’ve never been studied in combination, the doctors said.", "Dr. Anthony Fauci, the country’s leading infectious disease expert, said he, too, has confidence in the president’s doctor, calling Conley and other Walter Reed doctors “very qualified.”", "“I am really confident that the president of the United States is getting the optimal care that you can get with the team over at Walter Reed,” he told CNN Monday.", "Fact check:Trump's hospital records, weight have not been released", "Jones said in the video he was suspicious that Trump’s doctors were not prescribing or discussing the use of steroids, which have been known to mitigate the negative autoimmune response. The video was released Oct. 3, and one of the physicians treating Trump announced his dexamethasone use Oct. 4.", "Dexamethasone is from a class known as corticosteroids, which are similar to a natural hormone produced in the adrenal glands, endocrine glands that sit atop the kidneys. It is commonly prescribed to counteract inflammatory conditions like arthritis, severe allergies or asthma, overall dampening the immune system. Preliminary findings from the United Kingdom's national clinical trial RECOVERY found it lowered mortality among patients receiving mechanical ventilation or oxygen but not among those who did not receive respiratory support.", "Herein lies the problem with dexamethasone: It may be harmful to patients with early or mild disease, a category the president's team of physicians maintain despite his receiving supplemental oxygen.", "“You don’t want to give it to a patient too early,” Nahid Bhadelia, the medical director of Boston Medical Center’s Special Pathogens Unit, told STAT News in a October interview. “It’s a blunt instrument, so it may suppress a good immune response as well as a bad one.”", "Fact check:Viral post that claims COVID-19 is a fraud cites no evidence", "The term “deep state” has come to mean a supposedly secret network of longtime government insiders puppeteering American politics who are critics of Trump working against him and his policies. Trump has bolstered the conspiracy theory before, most recently claiming the “deep state, or whoever” is making it more challenging to push out a vaccine.", "A common thread in conspiracy theories, particularly QAnon-adjacent ones, is that Trump has been tasked with taking down this “deep state” — and it’s not happy about that.", "Jones suggests in the video that the “deep state” is crumbling because the president was “set to win” the election, so now, in desperation, it is working to kill him. He said that this secret network is suppressing whistleblower scientists, and that doctors have  been involved in presidential assassinations before.", "All these claims, including claims the “deep state” exists, are unfounded.", "The scientists Jones claims are being suppressed by the \"deep state\" are members of a group called America’s Frontline Doctors. They first made headlines after giving a press conference July 27 claiming hydroxychloroquine is an effective cure for COVID-19. That’s not true.", "Many have a track record of making unproven medical claims. One, Dr. Stella Immanuel, has said she believes that alien DNA exists and that cysts are caused by sex with “spirit husbands and wives.”", "Fact check:No evidence ex-N.J. Gov. Chris Christie is on ventilator for COVID-19", "There’s also no evidence that doctors have ever intentionally attempted to assassinate a president. There are two presidents who arguably died by doctors’ hands: James Garfield and William Harrison.", "After four months in office, Garfield was shot in the back. It wasn’t fatal, missing all vital organs and lodging itself behind Garfield’s pancreas, according to CBS News. Garfield’s doctors, like all doctors in America at the time, didn’t believe in germs, so they poked and prodded with unsanitized hands. Garfield ultimately died from a number of infections.", "Harrison came down with pneumonia. When he died, the Boston Medical and Surgical Journal issued a critical report of Harrison’s care, claiming the doctors had only treated the president for a common cold instead of “insidious pneumonia,” the Washington Post reported.", "The video specifically mentions presidents John F. Kennedy and Ronald Reagan as examples of “deep state\" attempts to kill presidents. While conspiracy theories about the two assassination attempts — just one a success — have existed for years, they are unfounded.", "Fact check:Satirical post falsely claims Trump would be fine if he hadn't gotten tested", "There is no evidence to support the claim that doctors at Walter Reed Army Medical Center are intentionally killing the president. We rate this claim FALSE because it is not supported by our research and because it espouses a conspiracy theory that presents an unfounded and implausible conclusion.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]