["About this rating", "In September 2019, readers alerted us to text circulating online, attributing anti-immigrant statements to President Donald Trump without evidence.", "Example:", "Muslims who want to live under Islamic Sharia law were told on Wednesday to get out of AMERICA, as the government targeted radicals in a bid to head off potential terror attacks.", "Separately, TRUMP angered some American Muslims on Wednesday by saying he supported spy agencies monitoring the nation's mosques.", "Here's what President Trump had to say:", "\"IMMIGRANTS, NOT AMERICANS, MUST ADAPT.. Take It Or Leave It. I am tired of this nation worrying about whether we are offending some individual or their culture. Since the terrorist attacks, we have experienced a surge in patriotism by the majority of Americans.", "\"This culture has been developed over two centuries of struggles, trials and victories, by millions of men and women who have sought freedom.", "\"We speak ENGLISH, not Spanish, Lebanese, Arabic, Chinese, Japanese, Russian, or any other language. Therefore, if you wish to become part of our society, learn the language!", "\"Most Americans believe in God. This is not some Christian, right wing, political push, but a fact, because Christian men and women, on Christian principles, founded this nation, and this is clearly documented. It is certainly appropriate to display it on the walls of our schools.", "\"If God offends you, then I suggest you consider another part of the world as your new home, because God is part of our culture.", "We will accept your beliefs, and will not question why. All we ask is that you accept ours, and live in harmony and peaceful enjoyment with us.", "\"This is OUR COUNTRY, OUR LAND, and OUR LIFESTYLE, and we will allow you every opportunity to enjoy all this. But once you are done complaining, whining, and griping about Our Flag, Our Pledge, Our Christian beliefs, or Our Way of Life, I highly encourage you take advantage of one other great AMERICAN freedom, 'THE RIGHT TO LEAVE'.", "\"If you aren't happy here; then LEAVE. We didn't force you to come here. You asked to be here. So accept the country that accepted you.\"", "The text was a near-verbatim reproduction of a previous rumor, which we rated as \"Misattributed\" in October 2001. At that time we found the remarks had their roots in two different sources:", "This item is a hybrid that combines an introductory reference to statements made by Australian politicians about Muslims following the July 2005 London Tube bombings with an opinion piece about immigrants written by a U.S. Air Force veteran following the September 2001 attacks on the U.S.", "While there are examples of controversial comments that can be attributed to Donald Trump, the comments in this circulated email are not his.", "We rate the newer variation as \"Misattributed\" because the text is a near-exact reproduction of comments that we researched in a previous fact check.", "Have you seen other variations of this claim? Let us know.", "Bond Huberman is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]