["About this rating", "A prank Facebook post that appeared to link to an article reporting that the restaurant chain Whataburger was closing its doors appeared in June 2017:", "However, clicking on the link takes you to a fake news story about the restaurant chain's faux announcement on the prank web site Channel22news.com:", "The Texas based food chain is shutting its doors effective April 26 due to numerous reports of food poisoning with high concentrations of salmonella found in meat served in the DFW area during the month of April Anyone who has eaten at Whataburger should be tested for salmonella poisoning. Symptoms can show up as many as three weeks out. I doctors [sic] urge all people who have eaten at these restaurants especially in the Dallas-Fort Worth area to immediately seek medical attention if they have eaten there more than once during past few weeks. The more time you’ve eaten there the higher likelihood of an infection occurring. Lawsuits have already been filed and Whataburger has decided to shut its doors due to the litigation and payouts that it expects to have to make. Filing bankrupt in a downtown Austin courthouse Wataburger spokesman, Jeff smith said “We have taken the advice of our counsel and filed Chapter 7 and have shut our doors.” It is unclear what the future holds for the Texas based chain. One thing for certain, Allyson Heffernan is sure to be disappointed!", "Channel22News is clearly labeled with various disclaimers and carries a \"you got owned\" meme in its header:", "We do NOT support FAKE NEWS!!! This is a Prank website that is intended for Fun. Bullying, Violent Threats or posts that Violate Public Order are NOT permitted on this Website.", "Channel22News, as well as other sites of its ilk, allow users to generate their own fake news stories. These stories are then packaged into social media posts that resemble genuine news items. Because many people share links on social media without actually reading the stories, these \"pranks\" frequently reach large audiences.", "In response to the prank, Whataburger created a Facebook post of their own:", "An article is being circulated stating that Whataburger will be closing all stores. This article is a hoax, and we aren’t going anywhere.", "Dewey, Caitlin.   \"6 in 10 of You Will Share This Link Without Reading it, a New, Depressing Study Says.\"\r\n    Washington Post.   16 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]