["About this rating", "A 26 October 2016 post written by Carly Fraser on her website “Live Love Fruit,” which has been shared over a million times on Facebook, alleges that various popular brands of tea contain dangerous levels of pesticides. However, the article inaccurately describes three different testing results that are currently five years out of date.", "At the article’s conclusion, Fraser suggested that other brands that were allegedly healthier. The reality is that this post is a textbook example of affiliate marketing, and Fraser’s blog receives money from Amazon if people purchase the teas she linked to.  \"I am an affiliate of Amazon and link to tea companies I currently drink, trust and recommend,\" Fraser told us via email.", "With this context in mind, and with the understanding that the referenced test results are five years out-of-date, we will dissect each of the claims made by Fraser and explain how she has muddied the science behind food residue testing.", "In the United States, governmental bodies regularly test domestic and imported agricultural food commodities to determine how much pesticide residue they might contain. This form of regulation is different than the rules that govern the application of pesticides; it instead governs the small amounts of pesticide residue allowed to remain in, or on, food products. These limits, termed maximum residue tolerances or limits (MRLs) are different depending upon both the chemical used and the commodity type because the level of exposure to pesticide residue a consumer might experience through diet differs depending upon the food type.", "In some cases, residue limits are set for dried tea, which is the type of testing highlighted in Fraser’s story. Setting such limits is a scientifically demanding process, and not all pesticides that show up in tests have established limits for dried tea products. In such cases, the presence of a pesticide-related chemical in the food commodity means the product is considered “adulterated,\" but that does not mean the product is necessarily subject to regulatory action, as explained to us via email by U.S. Food and Drug Administration (FDA) residue expert Chris Sack:", "If a product contains a pesticide residue for which EPA has not set a tolerance, at any level, it is adulterated. We actually classify the residue that way in our data. The regulatory action is a separate thing. Think of it like the speed limit. If I am traveling at 1 mph over the limit, I am in violation of the limit. However, the authorities do not normally take action for that small of an infraction. There needs to be room for error and for unforeseen circumstances. The radar could be off, my speedometer could be off, a burst of wind might push me over the limit by that much. These are a few considerations. The same applies to pesticides. I should note that 0.01 ppm is the default MRL in several countries, including the EU, Japan, Australia, etc. In the US we flag the adulterating residue, but we don’t normally take action until the residue is 0.01 ppm, or higher.", "In essence, this means there are two ways to run afoul of food residue laws as they regard the trace presence of pesticide in food commodities. In cases where there are enough data and research to determine an MRL value for a specific pesticide, a food product can contain levels above a \"legally acceptable limit.” In cases where no MRL is set for a certain chemical on a certain commodity, the mere presence (above 0.01 ppm) of that chemical is a violation of the law.", "The potential health risks from this latter for the infraction are not necessarily as serious a health risk as being above a medically determined upper limit. In many cases, these pesticide chemicals have MRLs set for non-tea food items that are far higher than 0.01 ppm, but because of a lack of data for dried tea (even though tea typically has higher tolerances than types of food thanks to the chemical loss that occurs when brewing tea), the extremely low bar of 0.01 ppm counts as an infraction. Lumping these two types of infractions together provides a misleading portrait of the testing results used for this blog post. In point of fact, no chemical with a set MRL for dried tea presented results that came close to being in excess their MRL in any of the three sets of scientific testing highlighted by \"Live Love Fruit.\"", "Fisher’s first set of claims stemmed from testing performed by the Canadian Broadcasting Corporation in 2014. This test was a followup to testing the news outlet had performed in 2009 and 2011, which had demonstrated the presence of residue of certain pesticides at levels considered illegal in Canada:", "CBC News recently conducted an investigation on the pesticide levels in some of the most major tea-producing companies. Using an accredited lab, the investigators utilized testing methods employed by the National Food Inspection Agency to test pesticide residues on dry tea leaves.", "The investigators found that over half of all teas tested had pesticide residues that were above the legally acceptable limit. Multiple chemicals were found in 8 out of 10 teas, with one brand of tea containing over 22 different types of pesticides (Uncle Lee’s Legends of China tea brand).", "A large majority of these pesticides are currently being banned in several countries due to the health risks they pose to works [sic] that handle them, and the negative effects they have on the environment (as well as the health of those that consume the products).", "Two explicit claims made here: First that “over half of all teas tested had pesticide residues that were above the legally acceptable limit,” and second that “a large majority of these pesticides are currently being banned in several countries.”", "The first claim was false, as not a single chemical identified by the CBC, in cases for which an MRL had been set, was “above the legally acceptable limit.” Below is a table of the largest value identified by the CBC for each chemical they found, compared to those chemicals' MRLs in both the United States and Canada. These are the only chemicals that could possibly be “above an acceptable limit,” since they actually have such limits set. None of them came anywhere close to exceeding those established limits:", "Two chemicals identified by the CBC, ethofenprox and dimethoate, were found in concentrations below the 0.01 ppm level required for the U.S government to consider any regulatory action. The remaining chemicals identified by the CBC would technically be in violation of U.S. law -- not because their concentrations exceeded a scientifically validated health limit, but in most cases because no such limit had been established specifically for tea and therefore the presence of any amount was considered a violation.", "Fraser’s second claim, that half the referenced chemicals were banned in multiple countries, was also false. Though around half of the chemicals identified by the CBC had no MRLs set for them, this does not necessarily mean their use was banned, just that its presence was not approved for dried tea. Of all the chemicals identified by the CBC, only one of the chemicals, endosulfan, appeared on the Rotterdam Convention list of pesticides “that have been banned or severely restricted for health or environmental reasons by” several countries. However, that chemical was legally allowed in Canadian tea at the time of the CBC's tests, and the levels identified by the CBC were four orders of magnitude lower than the current U.S. maximum allowable limits, and therefore its presence in tea was not in violation of any U.S. law.", "Fraser’s next source of information was a 2014 Greenpeace report about pesticide residue in tea sourced from India:", "Greenpeace also released a study exposing many popular tea brands that contain high levels of pesticide residues -- some which even tested positive for DDT, an incredibly toxic pesticide that was banned years ago.", "This report (like the others) has limited relevance to 2018, as the testing occurred in 2014 and only involved samples from India, and while India is the largest exporter of tea in the world, other regulatory bodies test imported tea for compliance with their own laws. The Greenpeace report found that:", "Nearly 94% (46 out of 49) of the tea samples contained residues of at least one of 34 pesticide active ingredients, at concentrations above the analytical limit of quantification (LOQii).", "Once again, scale matters. All this statement means is that the laboratory was able to confidently detect the presence of pesticide-related residues, not that 94% of the samples contained chemicals in concentrations that were violations of established residue limits. The most commonly found pesticides identified by Greenpeace were found in concentrations substantially lower than the legal limits set for them in the United States:", "Thiamethoxam", "Cypermethrin", "Acetamiprid", "Thiacloprid", "The arguably more concerning aspect of this report was the presence of DDT in some samples, as its use has been banned for decades and comes with well-documented health risks. If DDT had been found in the United States market, where the FDA regularly tests for its presence in imported consumable products, that import would face regulatory action.", "Monitoring the global tea market for pesticides is without question a vitally important task, and the threat of pesticides in the global food market requires constant attention. Such test results, however, should be put in legal and scientific contexts as opposed to being weaponized for profit, as was the case with the Live Love Fruit post.", "The final report Fraser used, from 2013, is in need of context as well. Glaucus Research Group is a short-selling operation, which means they attempt to profit by predicting when a stock will decline in value. The Glaucus report focused explicitly on Hain-Celestial teas, as they were attempting, publicly and successfully, to short that stock back in 2013:", "The Hain Celestial Group, Inc. (“Hain” or the “company”) is a $3 billion roll-up of disparate food brands that we believe is masquerading as a healthy/organic food company. In this report we present compelling evidence (based on independent lab tests and other due diligence) suggesting that products representing 85% of the Company’s 2012 internal growth are beset by quality control issues and/or deceptive marketing practices. We believe that once the Company’s exaggerated claims are exposed, Hain will revert to its historical internal growth rate of 3% and eventually trade in-line with mature packaged goods companies at a 15.5x forward p/e multiple. As Hain currently trades at 24x forward earnings, this implies downside of 35%.", "Of this report, Fraser said:", "Yet another round of tests conducted by Glaucus Research found that 91% of Celestial Seasonings tea tested had pesticide residues exceeding the U.S. limits. For example, Sleepytime Kids Goodnight Grape Herbal contained 0.26 ppm of propachlor, which is a known carcinogen under California’s Propsition [sic] 65.", "The suggestion that 91% of Celestial Seasonings tea were in “excess” of allowable limits came from tabulating the presence of all pesticide-related chemicals found, including those without set limits. Blurring these two groups together made it seem as though a larger number of pesticides existed in concentrations that had been medically evaluated to be harmful to humans, as opposed to counting only those chemicals whose presence alone constituted a violation.", "Propochlor is considered a human carcinogen under California’s Proposition 65, but every cup of coffee sold is considered a carcinogen under California law as well since the law is blind to the how much of a given chemical is present.", "While allowable tolerances for propochlor exist in other products, no such limits have been established for tea, and therefore its presence in a children’s tea product (if true) should be troubling. The company faced widespread online backlash and a temporary reduction in share value as a result of the report.", "For what it's worth, Hain-Celestial described Glaucus’s results as “false and misleading” and claimed they undertook to have the brands highlighted by the Glaucus report retested, finding that no pesticides were detected:", "Celestial Seasoning sent the same teas highlighted in the report to the National Food Lab for testing. The National Food Lab detected no pesticides in the teas, Celestial Seasonings officials said, adding that the Boulder firm has stringent testing procedures for all raw ingredients that come into the facility.", "Ingredients that don't meet acceptable limits under the U.S. Environmental Protection Agency, the U.S. Food and Drug Administration, the European Union Pharmacopeial Convention, among others, are rejected, Celestial Seasonings officials said.", "After we reached out to Fraser, she updated her post with more detail about some of the chemicals she highlighted. These updates, however, did not really take into account scale. For example, she highlighted endosulfan as an example of a dangerous level of a pesticide residue:", "For example, endosulfan, one of the most toxic pesticides on the market today, was found in Uncle Lee’s Legends of China Green Tea and Tetley Pure Green Tea. Endosulfan is a chlorinated insecticide that is chemically similar to the infamous DDT (which was banned over 48 years ago).", "This statement is true, but the CBC results she highlighted showed levels of endosulfan in tea at concentrations of 0.04 ppm. In the United States, endosulfan's presence would not be a violation until it reached a concentration of 24 ppm, orders of magnitude higher than the level found in Uncle Lee’s Legends of China Green Tea.", "In short, the claims of dangerous pesticides “above the legal limit” rely on incorrect or misleading descriptions of out-of-date testing that was performed in most cases by advocacy groups. These misleading and outdated descriptions were presented, at least in part, for the purpose of making a profit off people clicking online links for organic tea products and muddied the online discourse surrounding pesticide and food science. While the reports accurately highlighted the presence of some pesticide-related chemicals that do not have MRL limits set for dried tea contained in tea products, those reports in nearly all cases did not provide evidence of “dangerous” or “deadly” levels of those chemicals, just their trace presence.", "\"It’s now almost 2019,\" Fraser wrote in a 1 December 2018 update to her post, \"and seeing as how these studies were conducted over four years ago, it is hard to say whether they have changed up the pesticides they are using, or whether they have stopped using them at all.\" We concur.", "Fraser, Carly.   \"8 Popular Tea Bag Companies That Contain Illegal Amounts of Deadly Pesticides.\"\r\n    Live Love Fruit.   26 October 2016.", "United States Environmental Protection Agency.   \"Setting Tolerances for Pesticide Residues in Foods.\"\r\n    Accessed 30 November 2018.", "United States Code of Federal Regulations.   \"Title 40, Part 180 -—Tolerances and Exemptions for Pesticide Chemical Residues in Food.\r\n    Accessed 30 November 2018.", "Health Canada.   \"Maximum Residue Limits for Pesticides (Database).”\r\n    Accessed 30 November 2018.", "Jaggi, Shivani et al.   \"Leaching of Pesticides in Tea Brew.\"\r\n    Journal of Agricultural and Food Chemistry.   5 October 2001.", "Rotterdam Convention.   \"Annex III Chemicals.”\r\n    Accessed 30 November 2018.", "Greenpeace.   \"Trouble Brewing.”\r\n    August 2014.", "Bonar, Samantha.   \"High Levels of Pesticides Found in Celestial Seasonings Tea.\"\r\n    LA Weekly.   17 June 2013.", "Wallace, Alicia.   \"Change of Guard at Boulder's Celestial Seasonings.\"\r\n    Daily Camera.   27 October 2013.", "Glaucus Research Group.   \"The Hain Celestial Group, Inc.”\r\n    21 February 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]