["About this rating", "In the days immediately following Hurricane Irma making landfall in Florida in early September 2017, many Floridians lost electrical power — including those with solar panels. Shortly after the powerful storm hit, the alternative weekly newspaper Miami New Times offered an explanation as to why those with solar panels, who seemingly should be unaffected by a utility grid failure so long as there is sunlight, were also, quite literally, in the dark.", "In a 14 September 2017 article, the New Times reported that thanks to lobbying, the utilities company Florida Power & Light (FPL) had so much undue leverage over when and whether customers could make use of solar panels that they were able to prevent solar users from accessing sun-based electricity in Irma's aftermath. The New Times reported:", "FPL's lobbying wing has fought hard against letting Floridians power their own homes with solar panels. Thanks to power-company rules, it's impossible across Florida to simply buy a solar panel and power your individual home with it. You are instead legally mandated to connect your panels to your local electric grid.", "More egregious, FPL mandates that if the power goes out, your solar-power system must power down along with the rest of the grid, robbing potentially needy people of power during major outages.", "Although the \"big corporate government/axis of evil\" narrative was too juicy for many conspiracy sites to pass up, Floridians are not, in fact, mandated by law to connect solar panels to the power grid. Utility providers are instead required to allow customers to connect their solar panels to the grid for \"net metering,\" meaning they can enjoy lower utility bills if their homes generate more power than they use, because excess power is sold back to the utility company. Florida statute actually makes it unlawful for any entity block residents from having solar panels.", "Further, FPL doesn't \"mandate\" that solar panels power down if the grid goes offline in a crisis. This is a safety precaution and industry-wide standard put in place to prevent line workers from being electrocuted while restoring power during an outage — and it is not unique to Florida. The \"mandate\" cited by the New Times is in fact a guideline which reflects this standard and includes an important caveat. The guideline reads (emphasis added):", "Renewable generator systems connected to the grid without batteries are not a standby power source during an FPL outage. The system must shut down when FPL's grid shuts down in order to prevent dangerous back feed on FPL's grid. This is required to protect FPL employees who may be working on the grid.", "We asked Patrick Altier, owner of the Florida-based energy company Solar Trek, to explain further. Altier told us that Floridians who have solar panels on their homes can use energy from the sun during a grid failure — if they purchase additional equipment to prevent volts of electricity from traveling through power lines and harming unsuspecting neighbors or repair crews. To illustrate this, he gave us two scenarios:", "In my home, I have a grid-type solar system, meaning when the grid shuts down my solar shuts off. The reason for that is simply common sense and safety. [If it didn't shut off] I'd be back-feeding up to 600 volts to the utility lines, and a linesman could get killed. Electricity is like water — it takes the path of least resistance. So there’s a current that, if it’s not being used by my home, could back-feed down the utility line for a long ways and be potentially life threatening.", "The other scenario is, at my office, I have a solar system that's called a battery-interactive system. When the grid goes down, a transfer switch switches me off the grid and into the battery system, so there's no way I could back-feed and hurt a utility linesman.", "What’s happening [with these news stories] is, they're taking something that was designed as a safety feature and they're trying to make it look like the utilities are the bad guys when they're just trying to keep their employees safe.", "The reason many homeowners don't have the additional equipment necessary to allow them to keep their power on when the grid is down is because of the purchasing cost, said Mark Bubriski, director of public affairs for FPL. However, if customers have installed a battery system, such as a Tesla Powerwall or an SMA Sunny Island, they can use their solar panels safely during a grid failure. No laws or mandates prohibit them from doing so.", "Conspiratorial theorizing about living off-grid is not new and tends to be popular, perhaps because it plays on the always-present American distrust of both governmental and corporate overreach. That perhaps explains why the New Times story struck a nerve — it reports, for example, that \"FPL is... allowed to disconnect your panels from the grid without warning you. The company can even put a padlock on it.\" It also reports that utilities companies can \"charge a $400 or $1,000 application fee for consumers who want to install systems more powerful than 10 kilowatts.\"", "These are not misleading characterizations, but they make mundane operations seem ominous, Bubriski said. Technically, FPL can shut off power without warning for safety reasons, such as in the case of a fire or other hazard. FPL can also padlock certain inverters on large systems with manual shutoff switches to ensure the only ones able to access it are FPL workers. He also explained that the application fees, particularly the higher ones, wouldn't affect most customers because the tiered fees only come into play for systems twice the size of the average Florida home.", "That is not to say FPL hasn't been criticized — and as with any topic of public interest, there are legitimate concerns to be raised. For example, some have criticized the speed with which FPL restored power after Irma (as of 25 September 2017, all FPL customers who lost power during Irma have been brought back online). And FPL and the local industry at large have been dragged for drafting what critics call favorable legislation. These stories, however, aren't as clickable as the big-government-big-corporate conglomerate robbing the American public of free energy, which may explain why that is the one that made national headlines despite its mendacity.", "Iannelli, Jerry. \"Why Didn't FPL Do More to Prepare for Irma?\"\r\n  Miami New Times. 14 September 2017.", "IFLScience.com. \"Thanks to Lobbying, It's Illegal To Power Your Home With Solar Panels In Florida.\"\r\n  18 September 2017.", "ZeroHedge.com. \"In Florida, You Can't Use Your Own Solar Panels in a Crisis.\"\r\n  18 September 2017.", "Florida Power & Light. \"Customer-Owned Renewable Generation Grid Interconnections (FAC-6.065).\"", "Salisbury, Susan. \"After Hurricane Irma: Why Solar Power Can’t Replace Storm-Damaged Grid.\"\r\n  Palm Beach Post. 18 September 2017.", "WTSP. \"VERIFY: Can Solar Users Access Panels When Power Grid Is Out?\"\r\n  21 September 2017.", "Salisbury, Susan. \"State’s Consumer Advocate Urges FPL Customers to File Complaints.\"\r\n  Palm Beach Post. 23 September 2017.", "Klas, Mary Ellen. \"FPL Drafted Portions of Bill That Puts Tough Requirements on Rooftop Solar Companies.\"\r\n  Miami Herald. 5 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]