["“I love the Simpsons, but don’t you think it’s time the FBI and CIA investigate the creators of the cartoon, cause this it’s just hitting the nail right in the head,” read one of the Facebook posts that shared the image on May 31, 2020.", "A video containing the same image and claim was also published on YouTube, here. “George Floyd death was predicted by the Simpsons,” the headline of the video viewed more than 50,000 times says.", "The image can also be found on Twitter, here and in a blog post which claimed “The Simpsons predicted Derek Chauvin kneeling on George Floyd's neck in a 1990's episode. During the episode the police character ‘Chief Wiggum’ stands on a black character's neck as Lisa Simpson holds a sign saying ‘Justice for George’.”", "The Simpsons writers are known for sometimes creating eerily predictive episodes that come to fruition -- for example, this episode from 1998 foreshadowed a deal between Walt Disney Co. and 21st Century Fox.", "However, this drawing is not an original from the series and was made after Floyd’s death.", "AFP found the original by Italian artist Yuri Pomo who confirmed he was the creator.", "“This ain’t related with any episode of The Simpsons, this is a piece I did due to what happened recently,” Pomo told AFP on Instagram. “I used the most famous cartoon in the world (...) to help raise awareness of the world’s actual situation.”", "“What we face is real! Serious! And absolutely wrong,” he added.", "Pomo also published, here and here, other Simpsons-themed pieces as an homage to Floyd and two other African-American victims this year, Ahmaud Arbery, 25, and Breonna Taylor, 26. Three white men have been arrested in the killing of Arbery in Georgia, and authorities are investigating the police killing of Taylor during a Kentucky drug raid.", "Floyd, a 46-year-old unarmed restaurant worker, died from suffocation while in Minneapolis police custody on May 25, according to a private autopsy report. He had been accused of trying to buy cigarettes with a counterfeit bill and his aggressive arrest was caught on video.", "The images showed a handcuffed Floyd gasping for breath as a white policeman pressed his knee on his neck for nearly nine minutes. The now-fired former officer, Derek Chauvin, was charged with third-degree murder on May 29.", "Peaceful and violent protests have gripped the nation in the worst unrest since 1968.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]