["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Plugging legislation that would allow restaurants that brew their own beer to sell their bottled suds to a beer distributor, state Rep. Mike Villarreal suggested craft brewers are \"the future\" of the beer industry.\n\n\"The only segment in the beer market that is growing is the craft beer segment,\" the San Antonio Democrat said during a March 22 press conference about House Bill 660, which was left pending in a House committee.\n\nResponding to our query, Peter Clark, Villarreal’s legislative director, passed on a March 21 press release from the Colorado-based Brewers Association, a trade association representing craft brewers. The association defines a craft brewer as small (produces less than 6 million barrels a year), independent (less than 25 percent is owned by an alcoholic beverage industry member who isn’t a craft brewer) and traditional (at least 50 percent of its total production volume is malt beer or beer that enhances the flavor with grains such as barley or wheat).\n\nAccording to the release, small and independent craft brewers saw production increase 11 percent and retail sales increase 12 percent in 2010. But total U.S. beer sales were down 2.2 percent in 2009 and 1 percent in 2010. Total beer volume dropped from 205.7 million barrels in 2009 to 203.6 million in 2010, the release says.\n\nThe National Beer Wholesalers Association, which represents 3,300 licensed independent U.S.  beer distributors issued a press release the following day applauding craft brewers’ \"continued growth.\"\n\nHarry Schuhmacher, editor of Beer Business Daily, a trade publication focused on the commercial beer industry, told us that Villarreal’s claim is \"definitely true.\" He likewise cited the Brewers Association, which he said tracks craft beer volumes, and the Washington-based Beer Institute, a lobbying group that tracks the entire industry.\n\nThe Beer Institute pointed us to statistics showing that total estimated domestic beer production decreased 1.6 percent from 2009-10.\n\nCraft beer \"has really taken on a life of its own in the last four or five years,\" Schuhmacher said. \"And the beer industry itself has always grown\" until 2008, when the recession hit, he said. \"Ironically, craft beer, which is the highest-priced segment in the beer industry, continued to grow and indeed accelerate.\"\n\nTexas has followed the nationwide trends tracked by the Brewers Association and the Beer Institute, said Rick Donley, president of the Texas Beer Alliance, which supports Villarreal’s bill. \"The only thing that has a real growth to it right now is the craft beer segment,\" he said.\n\nThe Wholesale Beer Distributors of Texas, which opposes the legislation, didn’t respond to our query.\n\nThe sales trend in microbrews hasn’t been lost on the big brewers. On March 28, Anheuser-Busch announced plans to buy Chicago craft beermaker Goose Island. \"Sales of these more expensive and more sophisticated craft beers are a tiny drop in the bucket compared to mass market beer sales, but they’re growing faster than mainstream beers,\" according to a National Public radio story about the deal.\n\nLast September, CNBC reported that publicly-traded craft beer companies had seen \"explosive growth\" in the U.S. while overall beer sales were down. And an August MarketWatch report said: \"While beer consumption in recent quarters has remained mostly anemic for the major commercial beer brewers... sales for premium or so-called craft beers have continued at a steady pace.\"\n\nWe rate Villarreal’s statement as True.", "House Bill 660 press conferencewith Rep. Mike Villarreal, March 22, 2011\n\nHouse Bill 660relating to the sales of malt liquor, ale and beer by the holder of a brewpub license, filed Jan. 13, 2011\n\nBrewers Association, Press release: Brewers association reports 11 percent volume growth for U.S. craft brewers in 2010.\n\nBeer Institute, Statistical update, accessed March 30, 2011\n\nNational Beer Wholesalers Association, Press release: America’s beer distributors applaud craft beer’s growth, March 22, 2011\n\nNPR, Anheuser-Busch to buy Goose Island Brewery, March 29, 2011\n\nCNBC, Investors’ thirst growing for craft beer stocks, Sept. 17, 201\n\nMarketWatch, Heady times for boutique beer, Aug. 11, 2010\n\nE-mail Interview with Peter Clark, legislative director for state Rep. Mike Villarreal, March 28, 2011\n\nInterview with Rick Donley, president and CEO, Beer Alliance of Texas, March 29, 2011\n\nInterview with Harry Schuhmacher, editor, Beer Business Daily, March 29, 2011\n\nE-mail interview with Kathleen Joyce, press secretary, National Beer Wholesalers Association, March 30, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]