["About this rating", "In early April 2016 a number of blogs and recreational vehicle enthusiast sites began reporting that the U.S. Department of Housing and Urban Development (HUD) was moving to make popular \"tiny houses\" and recreational vehicle (RV) living illegal under a sweeping new law. Due to the popularity of tiny homes, the rumor caused a bit of consternation on social media sites among a number of the dwellings' fans. One of the most shared versions of this rumor was published by a web site called Activist Post on 31 March 2016:", "The tiny house movement has taken America by storm, in part because our economy is in the toilet. People are striving to reduce their expenses by embracing minimalism. They’re breaking free from the corporate grind because, as I’ve always advised, they are learning to live with less and radically reducing their expenses.", "But, these days in America, you are sharply admonished when you try to live your life outside of the strictures of the 9-5 world. Is it any surprise that the government is now taking steps to limit our ability to drastically reduce our expenses? They always seem to make illegal anything we try to do to be more independent and moving into a tiny house appears to be the next on their list.", "After quoting the purported \"HUD law\" in question, the post concluded by stating that \"if this law is passed, living in a tiny house or an RV may become illegal in April [2016].\" A similar blog entry posted by Don't Comply held that the purported tiny house ban was one of the latest attempts by the government to interrupt citizens' abilities to become more self-sufficient or take up residence \"off-grid\":", "For years the government has been cracking down on citizens who are polishing their skills in minimizing the involvement in the matrix and exiting the rat race. Learning to survive comfortably with less by unplugging from the burdensome requirements that larger permanently fixed residences demand is catching the eye of The Department of Housing and Urban Development.", "Government will do what they do best and limit and make illegal anything we do to be more independent and moving into smaller homes is their next target. View the proposed law here.", "If this Draconian law is passed, the evil curse of government will be extended to the lives of the free roaming human beings. Being unattached to the grid is a no-no in the eyes of these indoctrinated so-called officials. The Freedom to live where and how one chooses is under assault, this law will dismantle the force field of liberty when it pertains to the utilization of the earth as a home.", "Often, the circulating blog posts used malleable language such as \"we believe\" in warning readers that tiny houses were about to be regulated out of existence:", "This is a quick announcement because we need your help to stop tiny houses from becoming illegal per the fed's new HUD proposal regarding recreational vehicles.", "The United States Department of Housing and Urban Development is proposing to make changes to the Code of Federal Regulations Part 3282 docket FR-5877-P-01 which covers Manufactured Home Procedural and Enforcement Regulations (as well as Revision of Exemption for Recreational Vehicles). We believe this includes tiny houses on wheels.", "Although many panicked pieces quoted the HUD policy in question, few explained what it was or how it might affect owners or future builders of tiny houses. These items referenced a pending \"law\" or claimed tiny houses would soon be \"outlawed,\" leading many readers to infer that whatever HUD was up to, it would result in an actual law rendering both existing and in-development tiny homes illegal (and leaving their residents homeless). However, links to the HUD web site led to remarkably benign language regarding the proposed rule:", "This proposed rule would modify the current exemption for recreational vehicles in the Manufactured Home Procedural and Enforcement Regulations. Under the current exemption, questions have arisen regarding whether park model recreational vehicles are regulated by HUD's manufactured home program. These park models are being produced with patio roofs, screened in porches, and other extensions that exceed the 400 square foot maximum exemption in the current regulations. Additionally, some of these models are being marketed as suitable for year round living.", "The HUD summary went on to explain what changes to existing rules were being proposed by that agency, describing what appeared to be a need created by the increasing number of dwellings that fall outside the existing recreational vehicle (RV), manufactured home, and standard house classifications:", "HUD's proposed rule would permit recreational vehicle manufactures to certify that a unit is exempted from HUD's regulations. Specifically, HUD's proposed rule would define a recreational vehicle as a factory build vehicular structure, not certified as a manufactured home, designed only for recreational use and not as a primary residence or for permanent occupancy, and built and certified in accordance with either the National Fire Protection Association (NFPA) 1192-2015, Standard for Recreational Vehicles, or the American National Standards Institute (ANSI) A119.5-15, Recreational Park Trailer Standard. In addition, to provide consumers notice regarding the manufacturing standards used to construct the unit, HUD's rule would require that units claiming the exemption display a notice that identifies the standards used to construct the unit and states that the unit is designed only for recreational use, and not as a primary residence or permanent dwelling.", "The wording of that passage suggested the proposal targeted structures that were atypical for permanent dwellings (such as tiny houses) to ensure they were built to general housing standards governing dwellings used for year-round living. Units bearing modifications considered atypical for RVs and other recreational use units would be specifically marked as not suitable for primary residence and subject to HUD's RV standards (or reclassified).", "We contacted a local Chief Building inspector to parse the proposed regulation and determine whether the rule as stated would result in any sort of ban. He indicated that the proposal appeared to pertain solely to the classification of structures (even tiny ones) marketed as year-round residences, to ensure that those dwellings complied with building codes and the structures didn't present a safety hazard to occupants. He added that a different set of rules applies to RVs, but that those temporary and mobile dwellings are similarly regulated for safety.", "The web site Tiny House Build espoused an unperturbed viewpoint in an article about the pending rule change, holding that the intent of the tiny house movement included acceptance of such dwellings as code-compliant permanent residences:", "The new proposal would dictate that a tiny house, if built to ANSI or NFPA standards, is an RV and thus not suitable for permanent occupancy. The reality is that it is already illegal to live permanently in an RV in most places anyway. That is something that local zoning ordinances specifically dictate. So the problem here is the idea of certifying your tiny house as an RV rather than seeking permanent residential status through the building codes division.", "Consider that in almost every community in the United States where zoning laws are enforced, RVs are considered temporary shelter and are only suitable for up to thirty consecutive days of occupancy. That doesn't fit the model of tiny houses as permanent residences at all. For HUD to include all RVs that are \"not self-propelled,\" thus including THOWs [tiny houses on wheels] is an acceptable practice on their part. In fact, I am not opposed in any way to HUD overseeing the construction of RVs if that is important to their industry. This is because my intention is, and always has been, to secure a path to legalization for tiny houses through the International Residential Code (IRC).", "The writer of the article (presumably a tiny house enthusiast) surmised that \"[t]he reality is ... we are discussing the wrong topic: recreational vehicles (RVs),\" adding that \"tiny housers should not be concerned because our goal is to live in our tiny houses permanently, not to certify them as RVs [which is] what HUD's recent proposal aims to clarify.\" He also posited that it was counterproductive to \"refer to [tiny] homes as 'tiny house RVs' because that implies temporary housing, not a permanent residence,\" opining that tiny homeowners would be better off \"work[ing] within an existing residential code ... to gain code approvals and legal, PERMANENT residential status.\"", "Similarly unbothered by the proposal was the Recreational Vehicle Industry Association (RVIA), which issued a joint  statement alongside other industry groups on 11 February 2016. Like the tiny house expert, the RV trade groups welcomed the proposal as both beneficial to and long-desired by the RV industry. Stating that \"this proposed rule provides a critical solution to the regulatory uncertainty that has plagued RV manufacturers, dealers and campgrounds for decades,\" RVIA maintained that \"[w]ithout it, the entire RV lifestyle could be regulated out of existence\":", "To respond to the inapplicability of the 1982 definition to modern RVs, RV manufacturers, dealers and campgrounds put their heads together with the manufactured housing industry to propose new language to clarify that modern RVs are not manufactured homes. All parties agreed that RVs should be built in accordance with NFPA and ANSI RV standards, not HUD manufactured home standards. All parties agreed that the key distinction continues to be that manufactured homes are designed and built for permanent residency while RVs are designed and built to be used by families as a recreational, camping, or seasonal accommodation ... In the newly proposed rule, HUD accepted this consensus proposal with the additional requirement that park model RVs contain a consumer-facing notice that the manufacturer certifies that the structure is a recreational vehicle designed only for recreational use. The RVIA PMRV seal applied to every PMRV already contains this notice, so it is not an additional burden to industry.", "So this proposed rule gives RV manufacturers the critical regulatory clarity and certainty they have long sought: so long as they build to the nationally-recognized RV standards, the modern RVs they are building do not and will not fall under HUD's jurisdiction.", "The proposed rule gives RV dealers additional critical regulatory clarity they have long sought: the proper paperwork, forms, and disclosures the RV dealer needs to provide during a sales transaction are based on the design intent of the recreational vehicle.", "Yet another skeptical perspective came from former lawyer and accountant Howard Payne  of RVDreams. Payne stated that portions of the law causing concern had existed for more than 30 years:", "Folks have been freaking out about the part of the definition that says \" .... designed only for recreational use and not as a primary residence for permanent occupancy\". Well, that's been part of the definition since 1982, and similar language is included in just about every RV owners manual. So that part of the definition isn't new, and the new language is actually broader and officially exempts more RVs from the HUD Code. The \"400 square feet\" language in the prior definition was what was throwing some fifth wheels into question.", "While there are a lot of full-time RVers (nobody really knows the numbers), full-timers are still a very, very small niche in the RV world. While we are an independent, vocal bunch that doesn't want government interference, this proposed rule certainly isn't targeting full-timers ... RV-Dreams only exists because of full-time RVers and those that are considering full-time RVing. Our livelihood is based on there being a desire of people to become full-time RVers and our desire to help them reach that goal. There may be laws, rules, or regulations in the future that severely curtail the ability of people to live in their RVs, but this minor rule, buried within manufactured housing regulations, isn't one of them. Hopefully, this entry provides some facts and perspective.", "In short, while a number of confused commenters flooded HUD's proposal page based on inaccurate rumors, the proposed rules were seen as a net positive by tiny home experts, RV enthusiasts, RV trade groups, and anyone deeply involved with full-time RVing or tiny house living. A handful of blogs broadly misinterpreted the proposed rule changes as HUD \"outlawing\" tiny homes, despite the fact HUD doesn't possess the authority to pass such laws. The proposed rule rumored to be a \"tiny house ban\" was in fact simply a clarification of classifications for RVs and similar dwellings and in no way banned or criminalized tiny home ownership or building.", "Morrison, Andrew.     \"Should Tiny Houses Be Afraid: HUD Proposal FR-5877-P-01.\"\r\n     TinyHouseBuild.com.      21 March 2016.", "Payne, Howard.    \"HUD Proposed Rule Clarifies Definition of RVs for a Limited Purpose.\"\r\n    RV-Dreams.    16 February 2016.", "Recreational Vehicle Industry Association.    \"A Joint Statement from RVIA, RVDA and ARVC.\"\r\n      11 February 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]