["About this rating", "Medieval volcanic eruptions that occurred nearly 1,000 years ago likely triggered a partial blackout of the night sky, completely hiding the moon from the view of Earth’s inhabitants and resulting in widespread climatic changes for several years.", "According to an April 2020 study published in the research journal Scientific Reports, researchers at the University of Geneva analyzed tree-ring records and ice-core samples and then compared their findings to written historical accounts dating back to the 12th century. They found that a millennium-old account of a lunar eclipse was more likely the result of a series of volcanic eruptions that emitted dust and ash into the sky, blocking the moon and causing widespread famines around Europe. The story first broke in April 2020 when the study was originally published, and recirculated again in December 2020 when the entertainment blog Oddee shared the findings in a post.", "The 1110 lunar eclipse was described in the Peterborough Chronicle as having completely blocked the moon — a historical account that has long stumped scientists, historians, and astronomers", "“On the fifth night in the month of May appeared the moon shining bright in the evening, and afterwards by little and little its light diminished, so that, as soon as night came, it was so completely extinguished withal, that neither light, nor orb, nor anything at all of it was seen. And so, it continued nearly until day, and then appeared shining full and bright,” read the text.", "The writer noted that it was an otherwise clear night sky, which suggested that the disappearance of the moon could not simply be explained by cloud cover. It was long believed that this celestial event was due to a lunar eclipse, long interesting astronomers, historians, and climatologists alike, including George Frederick, who described the supposed eclipse as an “instance of a ‘black’ eclipse when the moon becomes quite invisible instead of shining with the familiar coppery hue.” But before the modern research, the eclipsed moon was not directly linked to the presence of volcanic aerosols that might have blocked it.", "The original manuscript of the \"Annals of Saint Evroult,\" which was used in the 12th century to determine the annual changing dates on which Easter fell, may be key. History notes added in the margins described a major three-year famine that started in France in 1109, which may have been the result — at least partially — of climatic disturbances resulting from a volcanic eruption.", "The original manuscript of the \"Annals of Saint Evroult.\" Scientific Reports", "To further explore the veracity of these historical accounts, the researchers analyzed the chemical composition of ice core samples from Greenland and Antarctica. These long-cored layers of ice play a key role in understanding our planet’s history. Climatic events are recorded in layers of tree-like ice rings; and as ice and snow layers build up over thousands of years, so do particulate matter and dissolved chemicals. Discovered in these locked layers were spikes in sulfate aerosols both before and after the year 1110, indicating that a series of volcanic eruptions likely emitted aerosols in the stratosphere.", "This data was then compared to tree-ring records from the same period. As ice cores lock in climatic events, tree rings grow in response to climatic changes to record the planet’s history. Through this analysis, the researchers determined that during the years in question, the planet experienced more precipitation and greater cloud cover — both of which may have been the result of increased volcanic matter in the stratosphere.", "But the volcanic theory isn’t necessarily new. It was long theorized that volcanic events at both poles resulted in sulfate deposition. However, the researchers now conclude that a potentially “forgotten” cluster of eruptions contributed to the climatic events described in the historical documents.", "“Here, we show that a unique medieval observation of a ‘dark’ total lunar eclipse attests to a dust veil over Europe in May 1110 CE, corroborating the revised ice-core chronologies,” wrote the authors. “Furthermore, careful evaluation of ice core records points to the occurrence of several closely spaced volcanic eruptions between 1108 and 1110 CE.”", "It is important to note that the sources of the volcanic eruptions remain unknown, and further research may help to characterize where in the world these events took place.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]