["By Lori Robertson", "Posted on May 25, 2017", "Vice President Mike Pence went too far in claiming that a new report showed that “the average premium across this country has actually doubled under Obamacare.” The report, from the Department of Health and Human Services, focuses only on insurance purchased on the HealthCare.gov exchanges in 39 states and notes that it is “an approximation” with limitations.", "Also, the vast majority of people buying plans on those exchanges aren’t actually paying the 2017 premium prices that HHS includes in its report, because 83 percent of them got premium tax credits to help pay for insurance.", "Pence made his claim in a speech at Cajun Industries in Louisiana on May 24.", "Pence, May 24: Obamacare, in the facts, has caused premiums to skyrocket across America. Here are the numbers, this is fresh out from Health and Human Services yesterday. The average premium across this country has actually doubled under Obamacare. More than a 100 percent increase in only four years. … These are the real numbers that have been released by our administration, and they’re numbers that the past administration just never would have released to the public.", "A Department of Health and Human Services report published May 23 says that premiums on the individual market “have increased significantly since the Affordable Care Act’s key provisions have taken effect.” That’s a comparison of 2013 premiums, before the ACA’s major changes to the individual market went into effect, and 2017 HealthCare.gov exchange premiums. That overall finding is no surprise. As the report notes in its introduction, the ACA changed how insurers could price plans on the individual market — limiting price differentials based on age, and banning pricing based on health status or gender. And the law required insurers to accept any customer, regardless of preexisting conditions, and include a set of essential benefits in their plans.", "That means cheap, skimpy plans for healthy customers became a thing of the past.", "“In most states these regulations increased insurance coverage requirements and would be expected, on average, to increase the price of ACA-compliant plans relative to pre-ACA plans all else equal,” the HHS report said.", "But as the report itself makes clear, its specific figures on increases from 2013 to 2017 come with some caveats or limitations.", "The “real numbers,” as Pence put it, on the increase in individual market premiums pre- and post-ACA may not be quite as high as a doubling. And more important, Pence, as we’ve seen politicians do repeatedly, doesn’t make clear that he’s only talking about the individual market and not average premiums overall. About 7 percent of the total population gets coverage on the individual, or nongroup, market, where people who don’t have employer-sponsored coverage or insurance through government programs such as Medicaid and Medicare buy their own policies. More specific to this report, 9.2 million people in 2017 enrolled in plans in the 39 HealthCare.gov states, the focus of the HHS analysis, not “across this country,” as Pence said.", "The HHS report found that “average exchange premiums were 105% higher in the 39 states using Healthcare.gov in 2017 than average individual market premiums in 2013,” an increase from a $232 average monthly premium to $476. The analysis used two different data sets. HHS used what’s called MLR data (medical loss ratio) for the individual market in 2013 and compared that to data from the Centers for Medicare & Medicaid Services on plans purchased through the HealthCare.gov websites in the 39 states using the federally run exchange in 2017.", "HHS acknowledges that this isn’t a “perfect comparison,” but says it “provides an approximation for how average individual market premiums have increased” under the Affordable Care Act.", "The medical loss ratio data, which insurers send to the National Association of Insurance Commissioners and to HHS, is only available through 2015. But the data that are available show that the average MLR premiums have been lower than average HealthCare.gov exchange premiums under the CMS data. (See Appendix B in the HHS report.)", "For instance, using the MLR-to-CMS comparison shows a 53.4 percent increase in average premiums from 2013 to 2015 in those 39 states, but using an MLR-to-MLR comparison shows a 41.8 percent increase for the same time frame. Either is still a sizable increase, but shows the HHS’ less-than-perfect comparison may be skewed higher than an apples-to-apples comparison would reveal.", "There are other limitations, most of which the HHS report also acknowledges:", "Not surprisingly, the report found that states that already had insurance benefit requirements similar to those that went into effect in 2014 under the ACA, “had smaller premium increases between 2013 and 2017.”", "As previous HHS analyses of individual market premiums have shown, there was variation among the states, ranging from a 12 percent premium increase in New Jersey to a 223 percent increase in Alabama. Twenty-four of the 39 states, however, had average increases of 100 percent or more.", "And, as we’ve often noted, how the premium increases affect those who buy their own insurance depends on the individual. For those who are healthy and were happy with less-generous benefits, their premiums likely went up. For those with preexisting conditions, their premiums may have gone down, even before factoring in tax credits.", "A Kaiser Family Foundation 2014 survey asked those who bought insurance on the individual market in 2013 and again in 2014, under the ACA requirements, about their experiences. Whether those individuals paid more or less for their premiums, after tax credits, was largely split: Forty-six percent said their monthly out-of-pocket premium was lower, while 39 percent said their premium was higher. Fifteen percent said it was about the same.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]