["A set of videos is circulating on social media with the narrative that these depict child-kidnappers who sell kidneys of children for money. Alt News was asked to verify the videos which are currently shared on WhatsApp to fuel rumours. The message used to share the video claims – “These videos were circulated from district morena of Madhya Pradesh. They were extracting kidneys and heart from children.” The visual description of the four videos from top-left is as follows:", "Alt News was able to ascertain that out these four videos, three are unrelated to the child-kidnapping. We have traced the origins of each video with their actual narrative.", "With the help of digital verification tool InVid, we obtained multiple frames of the video which were then used to perform a reverse image search on Google. One of the earliest references to the incident happens to be in an American news website Breitbart. The 2018 article includes screenshots of the gory video and claims that the incident took place at a ranch near the boundary between Michoacan and Guerrero states in Mexico. The same video was uploaded on the video-sharing platform BitChute with a similar narrative. While Alt News is unable to confirm any other details of the incident, it is clear that the video is not from India and has no links to any child-kidnapping incident. The people in the video are not conversing in any Indian language. Alt News is not posting the video here due to its graphic nature.", "This incident took place in Neemuh district of Madhya Pradesh earlier this year in mid-July. According to a Dainik Bhaskar report, a mob near Bhadwa Mata temple caught three young men red-handed while they were stealing goats offered at the holy place. The mob took the law in their own hands by thrashing the men for stealing the goats and burning their motorcycle. A case was registered by the police against the three accused of stealing, while six others were booked for beating them.", "Alt News reached out to Neemuch police. SP Rakesh Kumar Sagar said, “The accused were arrested and produced before the court.” Neemuch City police also informed Alt News that all the accused are released on bail.", "The video, therefore, has nothing to do with child-kidnapping.", "This video was earlier debunked by Alt News when it was shared with a similar narrative of organ trafficking. It was found that the clip depicts the aftermath of a riot which broke out in Alcaçuz prison in Brazil on January 14, 2017. The people in the video are conversing in Portuguese with a Northeast Brazilian accent. On January 14, a riot between rival gangs had broken out in Alcaçuz prison which led to the death of at least 30 inmates. In the aftermath of the violence that took place in the prison, gory visuals of mutilated bodies were seen. This incident was reported by several international media outlets. You can read our detailed fact-check here.", "This report by IBC24 News refers to an incident that happened in Madhya Pradesh’s Morena city on August 7, 2019. “People have caught a baba (saint) and beaten him up. He was taking three school children with him. People handed him over to the police.”, said the anchor. According to the broadcast, the incident took place near Hanuman crossroad area under the jurisdiction of station road police station. An eleven-year-old girl had lodged a case against the baba and he was sent to jail, said a Dainik Bhaskar report. He was allegedly trying to kidnap her.", "Alt News contacted Station Road police station to inquire about the current status of the case. Town Inspector Ashish Rajput said, “We have concluded the investigation, the statements have been taken and the accused was arrested. He will now be produced before the court. When asked as to what have they established since the incident, he added, “according to the eye-witnesses, the baba had attempted to take the girl with him.”", "In conclusion, three out of four videos of incidents are unrelated to child-kidnapping but were shared on social media to stoke false rumours. Circulating gory videos of mutilation to suggest that these depict child-kidnappers who sell organs is baseless fear-mongering. While one of the viral videos – the news report on child-kidnapping – turned out to be true, the court’s judgement on the case is still pending.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]