["A screenshot of a supposed tweet by Journalist Rana Ayyub is viral on social media. It is being claimed that Ayyub put out an insensitive tweet on former President Pranab Mukherjee’s death. The alleged tweet reads, “The man who rejected martyr Afzal Guru’s petition has died today. Afzal Guru is at peace today.” Twitter user Jyotsna Varma, who is followed by PM Modi, posted the screenshot. In her tweet, Varma demanded action against the journalist while tagging Home Minister Amit Shah and Prime Minister Narendra Modi.", "Several people have targeted Ayyub while posting this screenshot. Murali, Jai Shree Raam, and #IamSushant were some of the Twitter handles that targeted the journalist.", "We compared a genuine tweet put out by Ayyub’s handle with this screenshot. The tweet used for comparison carries an image along with the text as in the case of the viral screenshot. A comparison reveals stark differences between the genuine tweet and the screenshot of the alleged tweet.", "It is also noteworthy that all the screenshots shared on social media are identical—they have the same number of retweets, comments and likes.", "Rana Ayyub also tweeted about the fake screenshot, “Hello @TwitterIndia this photoshopped tweet is being circulated and shared by thousands on all social media leading to targeted abuse and harassment,” she wrote. Ayyub also quote-tweeted Jyotsna Varma and said, “Hello @TwitterIndia @instagram, this concerted attack using photoshopped tweets has begun yet again. This is not the first time, will not be the last. You don’t know who photoshopped it but you do know who is spreading this fake news to threaten and target me.” In the past as well, Rana Ayyub has been at the receiving end of misinformation on social media.", "Hello @TwitterIndia @instagram , this concerted attack using photoshopped tweets has begun yet again. This is not the first time, will not be the last. You don’t know who photoshopped it but you do know who is spreading this fake news to threaten and target me. https://t.co/vT7QqAcwcJ", "— Rana Ayyub (@RanaAyyub) September 1, 2020", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]