["About this rating", "Raggedy Ann was created in 1915 by Johnny Gruelle, whose daughter Marcella died at the age of 13 after receiving a vaccination.", "Raggedy Ann was patented before Marcella's death and had nothing to do with vaccine opposition.", "In January 2017, Facebook pages \"The Truth About Vaccines\" and \"VacTruth.com\" shared memes promotion the notion that the Raggedy Ann and Andy dolls were created as part of an anti-vaccination movement:", "Different versions of this claim had appeared as early as 2009, and the alternative health site RealFarmacy published a 2014 article that linked Raggedy Ann with a death caused (they said) by vaccination:", "In 1921, Johnny Gruelle's 8-yr old daughter was vaccinated in school without her parents' permission. Between the time she became ill from the vaccination and her death a few months later, her body was completely limp, like a rag doll. It was this sick vaccine-injured child that inspired Gruelle to create the Raggedy Ann doll.", "This myth was hinted at by the Wall Street Journal in February 2015.", "In general, the memes and articles advanced the claim that Raggedy Ann dolls were created by Johnny Gruelle in 1915 as symbols of the dangers and deaths purportedly associated with vaccines. The rumor clearly had sticking power and regularly made the rounds on social media, and although aspects of it may be correct, the gist of the \"vaccination\" claim is easily disputed.", "Historians at doll enthusiast site DollKind.com noted that Gruelle's purported creation of a \"dead\" and \"lifeless\" tribute to his daughter with X marks over the doll's eyes were \"absurd\":", "Raggedy Ann has been historically associated with the anti-vaccination movement, and there is some truth and some fiction associated with this belief. The tragic truth that still wrenches our hearts to this day is that Johnny Gruelle's little daughter died after being given a mandatory smallpox vaccination at school. The child was just 13 years old, and her loss was devastating to Johnny Gruelle, who then became a proponent of the anti-vaccination movement. However, there is an absurd school of thought that asserts that the Raggedy Ann doll was created as a limp and lifeless-looking creature to symbolize Gruelle's dead child. This is certainly not the case, and Gruelle's registered patent of the Raggedy Ann character occurred right around the time of Marcella's death. Evidence indicates that he had been working on perfecting Raggedy Ann prior to this tragedy in his family.", "On the Raggedy Land web site, author Patricia Hall noted that the legend was one of many associated with Raggedy Ann, a brand popular with children for several decades:", "Johnny Gruelle's little rag dolls have also found themselves at the center of several legend cycles -- groups of stories that, while containing kernels of truth, are more myth than they are history. What makes this even more intriguing is that fact that Johnny Gruelle, either unwittingly or with the great sense of humor he was known for, initiated many of these legends, a number of which are continuously repeated as the factual history of Raggedy Ann and Andy.", "According to that site, plans for what would become an extremely popular rag doll were well underway when Marcella becae ill and died of an infection at the site of a previously administered vaccination:", "When the real-life Marcella Gruelle died, at age 13, from the ravages of an infected vaccination, her parents were, understandably devastated. Under different circumstances, this would have been a time of great rejoicing for Gruelle and his family. He was connecting with juvenile publishers, and was working on several sets of illustrated fairy stories. In November (the same month of Marcella's death) Gruelle had been granted final approval by the U.S. Patent office for his doll called \"Raggedy Ann.\" But all was overshadowed by the death of his beloved daughter.", "As both doll historians stated, Marcella died not because of a vaccination, but possibly because of an infection related to the vaccination. Advances in medical sterilization and clinical protocols suggest a death like Marcella's would be highly implausible under typical circumstances more than a century later.", "Antibiotics and sterilization changed dramatically between the 20th and the 21st centuries.  No honest comparison could be drawn between medicine in 1915 and 2017, as illustrated by Centers for Disease Control statistics (unrelated to vaccines):", "At the beginning of the 20th century, for every 1000 live births, six to nine women in the United States died of pregnancy-related complications, and approximately 100 infants died before age 1 year (1,2). From 1915 through 1997, the infant mortality rate declined greater than 90% to 7.2 per 1000 live births, and from 1900 through 1997, the maternal mortality rate declined almost 99% to less than 0.1 reported death per 1000 live births (7.7 deaths per 100,000 live births in 1997). Environmental interventions, improvements in nutrition, advances in clinical medicine, improvements in access to health care, improvements in surveillance and monitoring of disease, increases in education levels, and improvements in standards of living contributed to this remarkable decline. Despite these improvements in maternal and infant mortality rates, significant disparities by race and ethnicity persist. This report summarizes trends in reducing infant and maternal mortality in the United States, factors contributing to these trends, challenges in reducing infant and maternal mortality, and provides suggestions for public health action for the 21st century.", "Both Doll Kind and Hall's myths about Raggedy Ann's origins were well circulated, and Marcella's death is an integral part of the doll's apocrypha. However, Johnny Gruelle filed his patent for the dolls on 28 May 1915 and received it on 7 November 1915. Marcella coincidentally passed away on 8 November 1915, one day after her father's patent was granted.", "Given that Gruelle filed the patent several months before his daughter died, it is impossible that he created the dolls as a response to his daughter's death. Raggedy Ann was in the works long before Marcella received any vaccinations, became ill, or died.", "Hall, Patricia.   \"Raggedy Ann And Andy: History And Legend .\"\r\n    Raggedy Land.   Accessed 11 January 2017.", "Oshinsky, David.   \"The Return Of The Vaccine Wars.\"\r\n    Wall Street Journal.   20 February 2015.", "Walsh, Timothy.   \"1900s-1920s: Raggedy Ann.\"\r\n    Timeless Toys: Classic Toys And The Playmakers Who Created Them.   1 October 2005   (page 39).", "United States Patent Office.   \"US D47789 S: Design For A Doll.\"\r\n    7 September 1915.", "Doll Kind.   \"Raggedy Ann - Facts, Fiction, And Faqs.\"\r\n    Accessed 11 January 2017.", "Morbidity and Mortality Weekly Report (MMWR).   \"Achievements In Public Health, 1900-1999: Healthier Mothers And Babies.\"\r\n    September 1999.", "American Chemical Society.   \"Discovery And Development Of Penicillin.\"\r\n    Accessed 11 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]