["A meme first shared at the height of the European migrant crisis of 2015 has resurfaced on Facebook in North America in late 2019. It claims that official figures from the UNHCR, the international body in charge of protecting refugees, show that 75 percent of these people forced to flee their countries are men between 19 and 45 years old, while only 13 percent are women, and 12 percent are children.", "“This is not the profile of a humanitarian disaster but the demographics of an invasion,” the post concludes.", "The post was also shared on Facebook here by a candidate for US Senate and on Pinterest here.", "However, these numbers differ greatly from real UNHCR data, which is a combination of numbers collected in UNHCR refugee camps and government agency figures.", "“We do not endorse this communication at all,” Emmanuelle Paciullo, a communications officer for the UNHCR in Canada told AFP in an email regarding the figures in the meme above.", "A refugee as defined by the UN agency is “someone who has been forced to flee his or her country because of persecution, war or violence.” At the end of 2018, there were 20,360,562 refugees under the UNHCR’s mandate. Another 5.5 million Palestinian refugees fall under the United Nations Relief and Works Agency (UNRWA).", "Of those twenty million, 50 percent were under 18, 48 percent were women, and 24.4 percent were men between the ages of 18 and 59.", "These proportions do vary based on the country or region in which refugees settle. In Canada, UNHCR data counted 114,109 refugees and people in refugee-like situations at the end of 2018. Of those, 37 percent were under 18, while 48 percent were women, and 31.27 percent were men between 18 and 59 years old.", "The numbers also show that, both globally and in Canada, four percent of refugees are over 60 years old, an age category that was left out of the false publication.", "The current global refugee population registered with the High Commissioner for Refugees is the highest on record. Turkey hosts the largest refugee population, with nearly four million individuals at the end of 2018. More information on refugee statistics is available on the UNHCR’s webpage here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]