["About this rating", "In February 2019, a young boy died in Guanajuato, Mexico, after allegedly suffering physical abuse at the hands of his mother. While the original reporting focused on the trauma suffered by the child and the arrest of his parent, identified as Margarita \"N,\" later iterations included a wrinkle in the crime: The boy was supposedly murdered because he refused to wear a dress.", "In December 2019, 10 months after the death of 7-year-old Karol Rámon, the website Newstarget.com reported that an \"LGBT-obsessed\" mother had beaten her son to death because he refused to dress like a girl:", "Yet another innocent, underage boy has been brutally victimized by the Cult of LGBTQ for refusing to become one of them.", "Seven-year-old Karol Rámon, as the media is calling him, was reportedly “beaten with a belt, a chair, a whip and even a hammer” by his lesbian mother, identified as Margarita, simply because he objected to her perverted fetish that he dress like a girl.", "The assertion that this boy was beaten to death because he refused to wear a dress was not based on factual information. The Office of the Attorney General made no mention of clothing choice as a possible motive in the agency's March 2019 statement about the boy's death. A spokesperson for the Guanajuato Prosecutor's Office also told the news site AFP that the claim the boy was killed for refusing to wear a dress was not supported by evidence:", "“That information is false. There is nothing to mention that (the murder) had to do with the child's clothing, that he dressed in this or that way, that he had to do with his sex ... I don't know where they took that information from.\"", "The tragic story was first reported on by local news outlets in March 2019, a few days after the boy was admitted to a private sanitarium and pronounced dead. Proceso.com.mx reported  that hospital staff alerted authorities immediately after seeing the boy's gruesome injuries, and that his mother acknowledged to authorities she had \"inflicted so much physical abuse that the child's body did not resist.\"", "Proceso's report also included a sentence about the boy's living situation that mentioned his mother was a lesbian. While this detail was not the focus of that news article, it eventually led to rumors about the nature of his death.", "A few days after Proceso's report, the website La Opinion published an article stating that a lesbian couple had beaten their son to death after he refused to wear a dress (translated via Google):", "A terrible crime has shocked the inhabitants of the community of Juventino Rosas in Guanajuato, and Mexico in general, claiming the life of a 7-year-old boy whose life was taken by his own mother and her same-sex partner, all because the child did not want to fulfill their whim.", "The minor, who was identified as Karol Ramón, was constantly mistreated by his mother and her partner. But these women ended up giving him a brutal beating after the boy refused to dress in girls' clothes.", "La Opinion cited no sources for the declaration that Karol was killed for refusing to wear a dress. Additionally, that article falsely stated that Margarita's partner was a \"fugitive\" and was wanted in connection with the boy's death. Although neither of these details was accurate, La Opinion's report was picked up and spread by a number of other news outlets.", "Tabasco Hoy reprinted the La Opinion piece verbatim, and the erroneous report was also rehashed in an article published by ACI Prensa. On June 20, 2019, the story reached a larger English-speaking audience when the Daily Wire published an article headlined \"Boy, 7, Reportedly Beaten to Death by Mother for Refusing to Dress Like a Girl.\"", "This version of events was spread widely, but the Guanajuato Regional Prosecutor's Office stated no evidence supported it. The Prosecutor's Office also said no evidence linked the mother's partner to the crime.", "ACI Prensa subsequently added a correction to its story: \"A previous version of this article indicated that a 'lesbian couple beat a child because he refused to dress as a woman' based on local media reports. The Guanajuato Regional Prosecutor's Office based in Celaya told the Animal Politico website that only the child's mother, Margarita \"N,\" was involved and has no evidence that the motive was the child's clothing.\"", "The Daily Wire added a similar update: \"According to a correction posted by ACI Prensa, the Guanajuato Regional Prosecutor’s Office reportedly said there is 'no evidence' that the motive for the child’s murder was due to his clothing, contradicting local reports. The motive remains unclear.\"", "The Attorney General's office told La Republica that the boy was allegedly killed by his mother, that the mother's partner was not involved, and that there \"no basis\" existed to claim that the boy was killed because he would not dress like a girl:", "According to the investigation, the alleged murderer is the mother of Karol Ramón. In declarations for the Republic, the Attorney General's Office of Guanajuato, Celaya headquarters, indicated that there is \"no element that establishes evidence to link your partner.\" In this way, the participation of 'Esmeralda' has been ruled out.", "Mexican institution also denied the information linking the clothing of the child with his death. To say he was killed \"because it would not dress like girl\" has no basis. \"It is totally false,\" rejected the Attorney General of Guanajuato.", "Huff, Ethan.   \"Filled with Pride: LGBTQ-Obsessed Mother Beats Seven-Year-Old Son to Death Because He Refused to Dress Like a Girl.\"\r\n    News Target.   29 December 2019.", "Espinosa, Veronica.   \"El Niño Karol Ramón Fue Maltratado y Golpeado Hasta Que Murió; Su Madre Está Presa.\"\r\n    Proceso.   1 March 2019.", "Tobasco Hoy.   \"Pareja Del Mismo Sexo Mata a Su Hijo Por Negarse a Vestirse Como Niña.\"\r\n    14 June 2019.", "Ramos, David.   \"Lesbiana Asesina a Golpes a Su Hijo en México [CORREGIDO].\"\r\n    ACI Prensa.   14 June 2019.", "Prestigiacomo, Amanda.   \"Boy, 7, Reportedly Beaten to Death by Mother for Refusing to Dress Like a Girl.\"\r\n    Daily Wire.   20 June 2019.", "La Republica.   \"Es Falso Que 'Lesbianas Mataron a Su Hijo Porque él No Se Quería Vestir de Niña.'\"\r\n    19 June 2019.", "La Opinion.   \"Asesinan a Su Hijo Por Negarse a Vestirse Como Niña.\"\r\n    6 March 2019.", "AFP Mexico.   \"El Homicidio No Fue Por Su Vestimenta, Pero la Madre Sí Mató a Su Hijo.\"\r\n    2 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]