["A video of a biker who while performing a stunt was knocked down by a speeding car on the road has been shared with the claim that the accident happened in Karnataka’s Bengaluru. In the video which seems to be filmed by a fellow rider, the biker can be seen performing a wheelie which is a stunt where the front wheel of a bike is lifted in the air and the vehicle is ridden on the rear wheel.", "Twitter handle @Selvachn posted the video with the message, “Bangalore Electronic city flyover..”.", "Bangalore Electronic city flyover.. pic.twitter.com/WLhN8QWGtS", "— SG (@selvachn) October 18, 2019", "Several other individuals on Facebook have shared the video with an identical claim.", "Alt News performed a Google search with keywords, “biker wheelie car hits”, and found a post wherein a user claimed that the incident took place in Brazil.", "Subsequently, we found an article published by a website called ViralTab. According to this article, the incident took place on the Santos Dumont (SP-075) motorway in the city of Campinas located in the southern Brazilian state of Sao Paulo.", "Jovem empina moto e é atingido por carro em alta velocidade na rodovia; vídeo é impressionante", "Motociclista fazia manobras na Rodovia Santos Dumont, em Campinas, quando foi atropelado por veículo. https://t.co/HPtJ4u2s01 pic.twitter.com/diAWuVaC49", "— Diário da CPTM (@DiariodaCPTM) July 25, 2019", "Brazilian newspaper Correio reported that the 19-year-old boy had survived the ‘spectacular’ accident on July 20, 2019. The boy was rushed to UPA São José. “According to the Civil Police, the driver stopped for help,” reported Brazilian news portal G1.", "In conclusion, a video of an incident where a biker who was performing stunts was run over by a speeding car is being shared on social media with the narrative that the incident took place in Bengaluru, Karnataka. However, the video is at least three-months-old and from Brazil.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]