["Kurt Russell attends a ceremony honoring her and Kurt Russell with stars on the Hollywood Walk of Fame on May 4, 2017, in Los Angeles. (AP)", "A recent Facebook post displaying a picture of Kurt Russell with a quote from the actor praising President Donald Trump has been circulating the social media site.", "After its posting on Saturday, the photo-quote combo quickly spread and has been shared more than 7,500 times within three days. Facebook flagged this post as part of its efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.)", "As you might have guessed, Kurt Russell didn’t actually say it.", "Here is the quote attributed to the actor, in full:", "\"President Donald J. Trump is relentless. I've never seen a man so dedicated & determined. I'd like to think I would be as courageous as he is, but I just don't know. The world is after him & he stands there in the face of pure evil, rock solid & ready to fight for us. God bless this brave man.\" #VoteRedToSaveAmerica", "We found the first instance of this quote originated on Twitter the morning of Nov. 3 by an account belonging to \"Snake Plissken,\" which uses Kurt Russell’s photo as a profile picture. Kurt Russell played a character named S.D. Bob \"Snake\" Plissken in the films \"Escape from New York\" and \"Escape from L.A.\"", "In addition to the fact that the account does not have a blue verified check mark signifying it is actually an account belonging to the famous actor Kurt Russell, the account’s Twitter biography states plainly, \"I’m not Kurt Russell.\"", "Nevertheless, as of Monday afternoon, the tweet has been retweeted over 5,000 times and has more than 12,000 likes.", "Russell has had his quotes taken out of context before. This time, there is no indication that even a granule of the this quote originated with the actor.", "We rate this claim Pants on Fire!", "Facebook post on Nov. 3, 2018", "Twitter post on Nov. 3, 2018", "Fandom Heros Wiki entry for \"Snake Plissken,\" accessed Nov. 6, 2018", "Thatsnonsense, \"Did Kurt Russell call President Trump \"relentless\" – Fact Check\" Nov. 5, 2018", "PolitiFact, \"Story takes actor Kurt Russell's comments about politics out of context,\" June 27, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]