["Then-President Donald Trump speaks during an \"Operation Warp Speed Vaccine Summit\" on the White House complex on Dec. 8, 2020, in Washington. (AP/Vucci)", "As president, Donald Trump expressed support for the COVID-19 vaccines and vaccination by touting their life-saving potential and saying they would be safe and available to all. In a Dec. 17 tweet, he explicitly said, “Get those ‘shots’ everyone!”", "One day after former President Donald Trump urged Americans to \"go get your shot,\" the New York Times reported that he and first lady Melania Trump had quietly received their own COVID-19 vaccines on their way out of the White House in January.", "The news rankled MSNBC host Rachel Maddow, who criticized Trump as having failed to promote the vaccines during his time in the White House.", "\"While he was president, President Trump never encouraged Americans to get vaccinated,\" Maddow said March 1 on her prime-time TV show. \"Now we know that he himself took the vaccine in secret and never told anyone. What possible benefit was there to him to keep that secret from the public?\"", "\"I mean, think about all the good that could have done,\" Maddow continued, citing recent polling that showed vaccine hesitancy is disproportionately high among Republican voters.", "Trump had been a vaccine skeptic for years before he entered the White House.", "His under-the-radar vaccination marked a divergence from the example set by other officials who got their vaccines in front of TV cameras, including President Joe Biden, Vice President Kamala Harris and former Vice President Mike Pence.", "But is it true that as president, Trump \"never encouraged Americans to get vaccinated,\" as Maddow claimed?", "In short, no. Trump’s public comments about the vaccines were typically in reference to his administration’s efforts to fast-track their development. But in several cases, he touted the life-saving potential of the vaccines. And in a tweet, Trump gave the encouragement Maddow said he never did during his time in the White House.", "\"The Vaccine and the Vaccine rollout are getting the best of reviews,\" Trump tweeted Dec. 17, one day before the Food and Drug Administration cleared a second vaccine for use. \"Moving along really well. Get those ‘shots’ everyone!\"", "A screenshot of former President Donald Trump's Dec. 17 tweet about COVID-19 vaccines. (Factba.se)", "MSNBC did not offer comment for this fact-check. But after PolitiFact reached out, Maddow showed Trump’s December tweet on air as part of a correction.", "\"I thought when we reported last night that while he was president, he had actually never told Americans to get vaccinated,\" Maddow said March 2. \"It turns out he did say, in one tweet in December, that everybody should get their shots.\"", "Maddow’s original comments echoed the New York Times’ report about Trump’s private vaccination. The newspaper wrote that Trump’s \"go get your shot\" comment at the Conservative Political Action Conference Feb. 28 was \"the first time he encouraged people to go get vaccinated,\" and that \"he never publicly encouraged people to take it while he was in office.\" That is not accurate. The New York Times did not respond to requests for comment.", "PolitiFact reviewed months of Trump’s vaccine comments using Factba.se, an interactive transcript website that tracked his public statements throughout his presidency.", "Trump’s \"get those ‘shots’ everyone\" comment from December was a specific example we found of him publicly and explicitly urging people to get vaccinated. But the former president signaled his support in many other ways, expressing hope that the vaccines, once tested and approved, would end the pandemic and help bring about a return to normal life.", "For months leading up to the arrival of the first vaccines, Trump feverishly claimed credit for their quick development. At campaign rallies, he told supporters a vote for Biden would \"delay the vaccine,\" while a vote for him would result in a vaccine to \"quickly eradicate the virus.\"", "As clinical trials were getting underway, Trump said in a September press conference that he \"encourage(d) everybody to enroll, as many people as we can,\" in the trials.", "The vaccines, he said, should go first to frontline workers, the elderly and people with underlying medical conditions. They would not be mandated, he said, but they would be widely available.", "Trump attended a White House summit celebrating the expected approval of the first vaccines. \"Every American who wants the vaccine will be able to get the vaccine,\" Trump said Dec. 8.", "Even as he repeatedly claimed, falsely, that the U.S. was rounding the corner on the pandemic without vaccines, Trump continued to tout the progress on development, saying at one October rally: \"We have unbelievable vaccines that are coming out real soon.\"", "By the time the first vaccine was cleared for use, Trump had lost his reelection bid, and his public comments focused more on promoting false claims about the election. A few weeks later, following the U.S. Capitol riot, Trump was barred from Twitter, his preferred communication tool.", "Top government officials publicly urged him to encourage people to get the vaccine, and White House press secretary Kayleigh McEnany promised he would do so because \"he wants to see all Americans get this vaccine.\" But behind the scenes, Trump declined to be the face of the vaccination campaign, instead letting Pence handle the load, the Associated Press reported.", "Trump was vague about when he would be inoculated, writing in a Dec. 14 tweet, \"I am not scheduled to take the vaccine, but look forward to doing so at the appropriate time.\"", "But Trump also celebrated the rollout of the vaccines on Twitter. He repeatedly said that the vaccine was a \"miracle,\" that it was \"safe and effective,\" and that it would end the pandemic.", "\"It will save millions of lives, and soon end the pandemic once and for all,\" Trump said Dec. 11, the day the FDA authorized the Pfizer-BioNTech vaccine for use.", "\"These vaccines are also very safe,\" Trump continued. \"American citizens participated in clinical trials that were far larger than normal, and had no serious side effects. The dedicated and independent experts at the FDA meticulously studied the results of the trials, and it has now passed the gold standard of safety.\"", "In remarks toward the end of the year, Trump said the world would benefit from the vaccines and held up the rollout as a historic medical achievement.", "Some health experts said Trump could have done more.", "Peter Hotez, from the Baylor College of Medicine, said on CNN that if Trump had regularly encouraged Americans to take the vaccine, it would have made a \"big difference,\" especially among his followers, who have relatively high vaccine skepticism, polling shows.", "\"If the president had been out there touting the impact of vaccines, we would have melted away a lot of that chunk of vaccine hesitancy and vaccine refusal, I believe,\" Hotez said.", "Dr. Anthony Fauci, the nation’s top infectious disease expert, said he wasn’t aware that Trump got vaccinated. He called it a \"lost opportunity\" to persuade vaccine hesitant people to get shots.", "\"That would’ve been an extraordinarily good opportunity to get a signal to the people who would clearly have listened to him the way they listened to him in many other ways,\" said Fauci, who got his own shot on camera. \"He has a great deal of influence.\"", "Maddow said, \"While he was president, President Trump never encouraged Americans to get vaccinated.\"", "Trump expressed confidence in the vaccines and vaccination in many different ways — on Twitter and in public remarks — touting their life-saving potential and saying they would be safe and available to all.", "We rate Maddow’s claim False.", "UPDATED, March 4, 2:26 p.m.: This fact-check was updated to reflect Maddow’s on-air correction on March 2. The rating is not changed.", "The Rachel Maddow Show on Facebook, March 2, 2021", "MSNBC, \"Trump kept January vaccination a secret; let supporters go astray on Covid science,\" March 1, 2021", "MSNBC, \"Trump’s rare exhortation to vaccinate leaves partisan jab gap,\" March 4, 2021", "Various searches via Factba.se, accessed March 3, 2021", "Various searches via CrowdTangle, accessed March 3, 2021", "Mediaite, \"Fauci Says He Was ‘Not Aware’ Trump Got Vaccinated in January: ‘Lost Opportunity’ He Didn’t Do It Publicly,\" March 3, 2021", "The Washington Post, \"The Daily 202: Many Republicans don’t want the coronavirus vaccine. Trump could change that,\" March 2, 2021", "The New York Times, \"Trump and his wife received coronavirus vaccine before leaving the White House,\" March 1, 2021", "CIVIQS, \"Coronavirus Vaccination,\" March 1, 2021", "CNN, \"Trump got vaccinated in secret. Here's why this matters,\" March 1, 2021", "Business Insider, \"Trump should take a COVID-19 shot to build confidence in the vaccine among his supporters, the White House coronavirus testing czar says,\" Dec. 21, 2020", "The Associated Press, \"Pence, top congressional leaders get vaccines; Trump absent,\" Dec. 21, 2020", "The Hill, \"Trump stays off-camera as vaccine is distributed,\" Dec. 18, 2020", "Politico, \"MAGA-world may resist the vaccine, but it still wants Trump to get credit,\" Dec. 16, 2020", "Politico, \"Slaoui urges Trump to encourage supporters to get vaccine,\" Dec. 15, 2020", "The New York Times, \"President Trump on Vaccines: From Skeptic to Cheerleader,\" March 11, 2020", "PolitiFact, \"Timeline: How Donald Trump responded to the coronavirus pandemic,\" March 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]