["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In June, two Kansas teens were fired from their summer job at a local pizza joint for asking why one of the two — a girl — was getting paid 25 cents less an hour than her male friend, who was doing the same job with the same level of work experience.", "The manager told the two employees they were being let go because discussing wages is against company policy.", "This is legal, Democratic presidential candidate Hillary Clinton said, after telling the teens’ story to an audience in Tampa, Fla.", "\"And you know what? That's legal,\" she said in her Sept. 6 remarks. \"If you find out about somebody else's salary even if you're doing exactly the same job, you can be retaliated against, including being fired, in most places.\"", "Compensation transparency is a major issue among advocates for gender pay equality — including Clinton, whose platform calls on Congress to pass the Paycheck Fairness Act, which includes steps intended to increase compensation transparency.", "But Clinton’s claim is incorrect. Through a patchwork of federal and state laws, most workers in the United States enjoy some sort of protection that makes it illegal for a boss to retaliate against them for discussing pay.", "\"If we take a snapshot today,\" said David Fortney, a leading employment lawyer in Washington, \"I don’t think it is accurate. The majority of employees do have that protection.\"", "Primarily, there’s the National Labor Relations Act.", "This 80-year-old law gives most private-sector workers the right to engage in \"concerted activity,\" which means taking action to protect or improve their employment conditions. The National Labor Relations Board specifies \"employees addressing their employer about improving their pay\" as an example of protected activity.", "The National Labor Relations Board, which administers the law, has regularly found company policies banning employees from talking about their pay to be illegal under this law. For example, the board in 2015 decided that a certain employee policy at T-Mobile was invalid because it restricted employees’ rights to discuss wage and salary information.", "There are significant limitations to the National Labor Relations Act, however. It doesn’t cover public-sector (government) workers, independent contractors, agricultural laborers, railway or airline workers, people in supervisor positions, or people falling into a few other small categories.", "Labor and employment experts told us that despite the exceptions, the law still covers most private sector workers.", "Fourteen states and the District of Columbia have pay-transparency laws that go beyond the National Labor Relations Act.", "In these states, many of the groups not covered by the National Labor Relations Act, such as government employees and supervisors, have the right to discuss their pay without retaliation.", "As of September 2016, the states include: California, Colorado, Connecticut, Illinois, Louisiana, Maine, Maryland, Michigan, Minnesota, New Hampshire, New Jersey, New York, Oregon, Vermont and the District of Columbia. Together, this group makes up about one-third of the entire U.S. population.", "Then there are additional federal rules covering a few other industries.", "While the National Labor Relations Act doesn’t cover \"concerted activity\" for certain interstate carriers, such as the rail and air industries, the Railway Labor Act does protect those workers.", "In April 2014, President Barack Obama signed an executive order that bans any company doing contract work for the federal government from retaliating against employees for discussing their compensation.", "Additionally, the federal government (as well as many state and local governments) has a formal pay schedule, which means compensation information for different jobs and experience levels are in the public domain already.", "A worker who is concerned about pay discrimination but doesn’t fall under any of the previously discussed rules might find protection under Title VII of the Civil Rights Act.", "Title VII prohibits employers from discriminating on the basis of race, gender, religion or national origin. It also prohibits employers from retaliating against an employee who speaks out against discriminatory practices.", "While the language of the law doesn’t specifically protect employees who discuss their wages, it’s reasonable to think it would protect those employees if the discussion pertains to unfair pay discrimination, said Cynthia Estlund, a labor and employment law professor at New York University. She added that the Supreme Court has generally allowed for a broad interpretation of that aspect of Title VII.", "Given these rules, most workers have some sort of legal right to discuss their pay and raise the issue with their boss. But whether people know they have this right is a different story.", "Many workplaces have policies — written down or just generally understood — prohibiting employees from discussing pay, despite the fact that this is typically illegal. The Clinton campaign pointed us to a study out of the Institute for Women’s Policy Research, in which half of all workers surveyed reported that discussing compensation is either discouraged, prohibited or could lead to punishment.", "People, including employees, employers and even some labor lawyers, just don’t realize that they have these rights, experts told us.", "One reason might be that people associate the National Labor Relations Act with union members, even though it applies to workers who aren’t part of a union, too, said William Martucci, a lawyer who represents companies in employment cases.", "Additionally, some people might consider the punishment for an employer who discourages pay transparency to be so weak as to be ineffective, he said. Companies generally have to give wrongfully terminated employees back pay and the option to take their job back.", "\"It’s an area fraught with misunderstanding,\" Martucci said.", "The Paycheck Fairness Act that Clinton supports would, in part, create a universal prohibition on retaliating against an employee for discussing wages. This would bring visibility and uniformity to a legal right that many workers don’t realize they have, but as it stands, most workers already have that legal right.", "Wait, what happened with the Kansas pizza kids?", "As for the Kansas pizza restaurant, a Pizza Studio franchise, it seems that the National Labor Relations Act covered the two teens’ right to discuss pay without retaliation, as they were not supervisors. The national chain’s executive director of operations said in a statement that the manager who fired them had a \"misunderstanding\" of company policy. The manager has since been let go.", "The two teens spoke at the Democratic National Convention in July.", "Our ruling", "Clinton said, \"That's legal: If you find out about somebody else's salary even if you're doing exactly the same job, you can be retaliated against, including being fired, in most places.\"", "Under various federal and state laws and regulations, most workers in the United States have the legal right to discuss compensation and raise pay discrimination concerns with their employers. Consequently, employers generally can’t retaliate against an employee for engaging in those discussions.", "However, the laws are a patchwork, meaning that some small percentage of people could fall through the cracks. And the fact that many people and companies don’t realize what the law says weakens their effect.", "We rate Clinton’s statement Mostly False.", "Clinton campaign, remarks in Tampa, Sept. 6, 2016", "National Labor Relations Board, Employee Rights, accessed Sept. 9, 2016", "U.S. Labor Department, pay secrecy issue brief, June 2016", "NPR, \"'Pay Secrecy' Policies At Work: Often Illegal, And Misunderstood,\" April 13, 2014", "The Atlantic, \"When the Boss Says, 'Don't Tell Your Coworkers How Much You Get Paid,'\" July 15, 2014", "Kansas City Star, \"Teen’s wage disparity at KCK pizza shop fires up equal-pay debate — and Hillary Clinton,\" June 27, 2016", "Government Accountability Office, \"Information on the Number of Workers with and without Bargaining Rights,\" Oct. 15, 2002", "Institute for Women’s Policy Research, \"Pay Secrecy and Wage Discrimination,\" January 2014", "National Women’s Law Center, \"How the Paycheck Fairness Act Will Strengthen the Equal Pay Act,\" May 29, 2015", "American Bar Association, \"The Paycheck Fairness Act,\" July 27, 2016", "GovDocs, employee compensation secrecy fact sheet, accessed Sept. 9, 2016", "Email interview, Clinton spokesman Josh Schwerin, Sept. 8, 2016", "Email interview, Catherine Fisk, law professor at the University of California, Irvine, Sept. 8, 2016", "Email interview, Jessica Kahanek, NLRB spokeswoman, Sept. 9, 2016", "Phone interview, William Martucci, counsel at Shook, Hardy & Bacon, Sept. 8, 2016", "Phone interview, David Fortney, counsel at Fortney & Scott, Sept. 9, 2016", "Phone interview, Nita Beecher, counsel at Fortney & Scott, Sept. 9, 2016", "Phone interview, Cynthia Estlund, NYU law professor, Sept. 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]