["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton speaks with Jimmy Fallon during an appearance on The Tonight Show on March 6.", "Hours after Super Tuesday polls closed in Texas at 7 p.m., voters across the state were still standing in lines to cast their ballots.", "In one North Texas county, Democratic primary voters reported long lines while Republican voters cast ballots with ease. In Austin, people reported lengthy waits throughout the day and some were still waiting to vote at 10:15 p.m. At Texas Southern University in Houston, the last Democratic voter cast his ballot at 1 a.m. Wednesday.", "In an appearance on NBC’s \"The Tonight Show\" Wednesday, Hillary Clinton remarked on the long lines in Texas.", "\"It is so wrong what is being done to try and purge people from voting lists, not let them register or, as we saw in places yesterday, particularly in Texas: The Republican side gets 25 machines, the Democratic side gets five machines,\" Clinton said. \"People were literally standing in line for seven hours. I want to applaud everybody that stood in a line yesterday, because they were doing the right thing for our country.", "Clinton is right that some voters in Texas stood in line for hours to vote on Tuesday, but is she right about the cause? Were more machines allocated to Republican primary voters than to Democrats in Texas?", "Clinton’s team did not return a request for comment.", "Differences by county", "In Texas, elections are conducted at the local level and procedures differ in each of the state’s 254 counties.", "For example, in Travis, Harris and Tarrant counties, voters can go to any polling place within the county to vote in the primary and general elections. In other counties, voters are restricted to polling places within the precincts where they live.", "During primary elections, both political parties work with election officials to agree on how the elections are run — including selecting the number of polling places and how voting machines are allocated.", "In Travis County, which also saw long lines, Democrats and Republicans can vote using the same machines at any polling place during the primary.", "Some polling places in the county saw staffing disruptions early in the day that caused delays, as eleven people responsible for opening different polling locations did not show up for work over fears of catching the coronavirus.", "In Harris County, an equal number of voting machines for each party was placed at every polling place.", "Michael Winn, Harris County’s elections supervisor, told the Austin American-Statesman that this created longer lines for Democratic voters since the Democratic ballot drew more interest than the Republican one, and the county has more Democratic voters.", "Winn said people in Harris County voted in the Democratic primary at a 2-to-1 ratio compared with Republicans — but two-thirds of voting centers were located in Republican commissioner districts.", "Local party officials expressed trepidation at Harris County’s plan to divide voting machines equally in emails obtained by the Houston Chronicle.", "In one Feb. 18 message to county staff, Donna Stanart, the primary election director for the Republican Party wrote: \"A 50/50 split will be a problem at the polls that are going to be heavier for Democrats or heavier for Republicans.\"", "Harris County Clerk Diane Trautman said in a statement that officials initially believed they were being \"fair and equitable by allocating equal amounts of equipment to each party.\"", "In Tarrant County, election officials warned of long lines on Super Tuesday after local party officials agreed to have a set number of voting machines for each party, based on a review of past voter turnout data.", "The plan called for 1,015 Democratic machines and 1,767 Republican machines across the county’s 192 polling sites, according to the Fort Worth Star-Telegram.", "State lawmakers plan to hold a hearing to investigate the excessive wait times voters experienced and other issues reported by news outlets on Super Tuesday.", "In a letter to the Texas secretary of state and a handful of local election administrators urging action on improving voting infrastructure in the state, Mimi Marziani, president of the nonprofit Texas Civil Rights Project, outlined the different issues voters experienced on Super Tuesday.", "\"From the time polls opened to when they closed, voters faced a series of obstacles: polling sites that opened hours late or not at all; broken voting machines and ballot-printers; crashed election websites; too many untrained poll workers; and voters’ names missing from the registration rolls,\" she wrote.", "\"Then, especially later in the day, many voters in our major cities faced absurdly long wait times due to an inadequate number of polling locations, a lack of operational machines per location, and the failure to properly staff each location. As chronicled by numerous press reports, wait times lasted as long as seven hours at points, particularly in communities of color and on college campuses.\"", "Our Ruling", "Clinton said that voters in Texas had to wait in long lines because \"the Republican side gets 25 machines, the Democratic side gets five machines.\"", "Clinton is right that people in Texas waited for hours to vote, but she’s off on the polling machine disparity.", "In the county that experienced the longest lines on Super Tuesday, a main problem was the opposite of what Clinton described: a local decision to provide an equal number of machines for Republicans and Democrats at each voting location.", "We rate this claim Mostly False.", "The Tonight Show Starring Jimmy Fallon, Hillary Rodham Clinton on Joe Biden's Super Tuesday Win, March 5, 2020", "Texas Civil Rights Project Letter to Texas Secretary of State, March 5, 2020", "Austin American-Statesman, Travis County voters faced long lines on Super Tuesday — but they had choices, clerk says, March 4, 2020", "Dallas Morning News, `No one should wait six hours to vote,' but in Texas, thousands did on Super Tuesday, March 4, 2020", "Dallas Morning News, Long lines, broken machines causing frustration for some voters in Dallas, Tarrant counties, March 3, 2020", "Houston Chronicle, Harris County Democrats waited for hours to vote. Two-thirds of polling sites were in GOP areas., March 4, 2020", "Texas Tribune, Texas voting lines last hours after polls close on Super Tuesday, March 3, 2020", "Texas Tribune, Harris County's cascade of election day fumbles disproportionately affected communities of color, March 4, 2020", "New York Times, Why Did It Take So Long to Vote in Texas and California?, March 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]