["About this rating", "The zunzuncito, or bee hummingbird, is the world's smallest bird.", "This photograph does not show a zunzuncito, but rather a miniature figurine.", "An image supposedly showing the world's smallest bird, a zunzuncito, was widely circulated on social media in 2019. A posting from the Facebook page Nature Gold, for instance, racked up more than 45,000 shares:", "The zunzuncito (Mellisuga helenae), also known as the bee hummingbird or Helena hummingbird, is considered the world's smallest bird. However, the above-displayed photograph does not show this tiny bird. In fact, this photograph doesn't feature a real animal at all but a miniature figurine of a chickadee.", "The figurine was created by a Bulgarian artist named Ina who runs the Facebook page Malinik Miniatures. This figurine was sold for $65 on eBay and was described as follows:", "Dollhouse Miniature Realistic Chestnut-backed Chickadee OOAK bird - Malinik Miniatures", "This bird is handmade from bees putty and wire armature for the legs. Then applied fibers and feathers. Marking with acrylics and pastels.", "On the Malinik Miniatures Facebook page, Ina posted a photograph that showed the creation of this miniature chickadee:", "Though this viral photograph is not of a real bird, the zunzuncito is indeed real and considered to be the world's smallest bird.", "The zunzuncito weighs less than a dime and only grows to about 2.25 inches. Here's how the National Audubon Society described this miniature hummingbird:", "The Bee Hummingbird, which is found only in Cuba, is an absolute miniature, even among hummingbirds. It measures a mere two and a quarter inches long. Bee Hummingbirds are often mistaken for bees. They weigh less than two grams — less than a dime. That’s half the weight of our backyard hummers, like the Ruby-throated or Rufous. The female builds a nest barely an inch across. Her eggs are about the size of a coffee bean.", "In flight, the Bee Hummingbird’s tiny wings beat 80 times a second. And during a courtship flight, they beat up to 200 times per second! The male’s entire head and throat shine in fiery pinkish-red, and blazing red feathers point like spikes down the sides of the breast.", "Here's a picture showing a real bee hummingbird:", "This is hardly the first time an artistic creation has been mistaken for a real-life animal. We've previously covered figurines that supposedly showed a baby platypus, baby owls, a Japanese Giant Emperor Moth, a \"haiku bird,\" and a rare \"marbled fuark.\"", "Audubon.   \"Get to Know the Bee Hummingbird, the World’s Smallest Bird.\"\r\n    17 September 2018.", "Guinness Book of World Records.   \"Smallest Bird.\"\r\n    Retrieved 17 December 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]