["The video has been viewed more than 12,000 times after it was published on Facebook here on May 9, 2020.", "The 25-second video shows what appears to be a convoy of military vehicles travelling along a mountain road. At the 15-second mark, there is an explosion.", "Translated from Arakanese to English, the caption states in part: “Four of seven ‘Fish Paste Thieves’ trucks were taken down (by AA) in Buthidaung\". The post continues to state at least 40 soldiers from Myanmar’s army were killed in the town in the western Rakhine State.", "“Fish Paste Thieves” is a nickname given to Myanmar’s military by the supporters of the Arakan Army (AA), a rebel group fighting for more autonomy for ethnic Rakhine State in the country’s northwest.", "The claim was also shared more than 800 times here on Facebook alongside a screenshot that shows a similar caption.", "The claim is false; the video has circulated in reports about an attack on a Turkish military convoy in May 2016.", "Reverse image searches on Google using keyframes from the video found a longer version published here in May 2016 on Gerilatv, a website associated with People's Defence Forces (HPG), the military wing of the outlawed Kurdistan Workers’ Party (PKK).", "Below are two sets of screenshot comparison of the video in the misleading post (L) and the Gerilatv footage (R) with corresponding features circled in red by AFP:", "The Kurdish-language caption of the Gerilatv video states: “Sabotage of Semdinli - 18 May 2016”.", "Semdinli is a town in southeast Turkey.", "This AFP report was published about the incident on May 18, 2016.", "The AFP report states in part: “Four Turkish soldiers were killed and nine others were wounded today in an attack on a military convoy blamed on Kurdistan Workers Party (PKK) militants, the army said.", "“The military convoy was travelling on the road between Semdinli and Aktutun in the southeastern Hakkari province when it was hit by the roadside bomb left by the ‘separatist terror group’, the army said, using its customary phrase for the PKK.”", "Separately, there have been no recent reports of an attack on Myanmar's military in which so many soldiers were killed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]