["An article headlined “African Country Bans Face Masks – Also Reopen Schools And Shops” was published on a site called Reporting the News on May 27, 2020. According to data from the social media monitoring tool CrowdTangle, it garnered more than 187,000 Facebook interactions, including more than 27,000 shares.", "A similar article titled “Kwaheri Corona (Goodbye Corona): Magufuli bans use of face masks in Tanzania” was published two days earlier on this Kenyan website.", "The two sites quoted a letter allegedly issued to the press by President John Magufuli’s office.", "Translated from Swahili, it reads: “The President of Tanzania His Excellency Dr John Pombe Magufuli on May 24, 2020, has banned the use of face masks because it is creating anxiety among the citizens leading to the closure of businesses across the country. The president has also allowed public vehicles to resume to normal operations and carry passengers as per the maximum capacity as before. He has also directed the opening of schools.” The letter uses the signature of Gerson Msigwa, who is the director of presidential communication.", "The claim was shared in multiple Facebook posts here, here and here.", "However, Magufuli has made no such announcement banning face masks -- neither at the time this claim emerged in May nor since.", "A search of the press releases listed on the presidency’s official websites did not reveal any such letter sent to newsrooms, nor did any Tanzanian media outlets report on this.", "On May 24, 2020, Msigwa discredited the letter attributed to him on social media, stamping it as “fake” on his official Twitter account.", "pic.twitter.com/MScChnuPdx", "At the same time, Tanzanian government spokesperson Hassan Abbasi, while responding to a similar claim of a ban on face masks captured in a screenshot taken from a tweet (and passed off as an order by Magufuli), labelled it as “fake”.", "“This is fake and should be ignored. Let’s continue observing guidelines from our health experts to protect ourselves as well as protecting others,” Abbasi tweeted in Swahili.", "While Magufuli did not issue the claimed banning order, Tanzania has not strictly enforced precautionary measures against COVID-19 such as wearing face masks and avoiding social gatherings. The Tanzanian leader is on record encouraging citizens to gather in places of worship as well as declaring the country free of COVID-19 thanks to prayers,  as reported here and here.", "“I believe that corona (sic) has been eradicated from Tanzania through the power of our God. And we thank Him very much… Today I don’t see anyone wearing a face mask,” Magufuli said during a church service amid cheers.", "In another gathering, as reported here by AFP, Magufuli urged Tanzanians to pray and not depend on face masks for protection.", "What about public transport?", "Magufuli has not issued any directives allowing public transport to return to normal, which in Tanzania means carrying passengers above full capacity.", "In March, the Transport Regulatory Authority instructed the public transport sector to limit passengers to the number of seats available, while the last directive from former Dar es Salaam regional commissioner Paul Makonda, who stepped down on July 15, 2020, allowed buses to add four students more than the number of seats, therefore allowing four passengers to stand.", "Meanwhile, all primary and secondary schools in Tanzania resumed academic sessions on June 29, 2020, following a directive by Magufuli.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]