["Carly Fiorina discussed the number of women living in poverty on ABC's \"This Week.\" (File)", "Editors note: After this fact-check published, we looked deeper into the stat Fiorina cited. You can read that work here.", "It is a powerful statistic that speaks to a fundamental injustice in this world. It emerged nearly two decades ago and has been used as a call to action ever since.", "Over the weekend, former Hewlett-Packard CEO Carly Fiorina repeated it on ABC’s This Week.", "\"Seventy percent of the people living in abject poverty are women,\" Fiorina said.", "But so far as anyone can tell, that statement has no basis in fact.", "We reached out to Fiorina’s office and asked for the supporting data. We did not hear back.", "We went to the World Bank data pages and contacted the bank’s research staff. We exchanged emails with the United Nations Development Programme, and UN Women, an entity focused on gender equality. None of them could point to statistics that would confirm this claim.", "\"I checked with our research colleagues, and we can indeed not verify this figure either,\" said Nanette Braun, chief of communications and advocacy at UN Women headquarters.", "It’s a telling admission, given that UN Women references the statistic on its own Web page.", "Duncan Green, who spent eight years as director of research for Oxfam-Great Britain, the international poverty relief organization, flagged a problem with the statistic three years ago in a blog post on Oxfam’s website. Green is now Oxfam’s special strategic adviser.", "\"Every expert (feminist economists, poverty researchers etc.) I’ve consulted on this agrees the number is dodgy,\" Green wrote. \"Yet people just keep on using it, presumably because its message is one they want to promote.\"", "The original statistic dates to at least 1995, when it was mentioned in the United Nations Human Development Report. The report warned about rising disparities.", "\"The most persistent of these has been gender disparity, despite a relentless struggle to equalize opportunities between women and men. The unfinished agenda for change is still considerable. Women still constitute 70 percent of the world's poor and two thirds of the world's illiterates.\"", "The 70 percent figure shows up a couple of times in the 205-page report but not in any of the report’s statistical tables. In fact, staff at the United Nations Development Programme said they no longer use it.", "Experts told us they’re not sure what the real figure is, but that it’s likely lower than 70 percent.", "\"Its not easy to say how many women are poor because data on poverty are typically constructed on a household basis,\" said Diane Elson, professor of sociology at the University of Essex.", "In other words, surveys don’t count how many women and men live in each household. Statisticians, some within the United Nations itself, began debunking the 70 percent figure as early as 1998 -- just three years after it gained prominence.", "Sylvia Chant, professor of development geography at the London School of Economics, pointed us to 2002 data from the Economic Commission for Latin America and the Caribbean. In Latin American countries, by a slight margin, women were more likely to live in poverty in rural areas. But the reverse was sometimes true in cities.", "\"In 10 out of 17 countries, the proportion of men in poverty is actually on a par with or slightly higher than women,\" Chant wrote in 2008. \"Women are nowhere near the level of 70 percent of people in income poverty as popularly expounded.\"", "A 2001 analysis of 10 developing countries largely found no statistically significant differences. Where there was a gap, in every country but one, it was very narrow, and sometimes, as in the Latin America survey, men outnumbered women in poverty.", "Chant said Fiorina’s claim is no more right today than when it first emerged.", "Green, the Oxfam adviser, agreed.", "\"It was wrong then, and remains wrong,\" Green said.", "One note: While we don’t have a worldwide figure, we can use Census Bureau data to come up one for the United States. According to the most recent data, females account for 55 percent of Americans living in poverty.", "Our ruling", "Fiorina said that women account for 70 percent of the people in the world who live in poverty. She provided no support for the claim, nor does any seem to exist. We contacted the international bodies that rely on such statistics, and they told us they do not have the data to back up the claim. Independent experts echoed that point.", "At least in Latin America and the United States, the data suggest a much lower figure. We rate this claim False.", "ABC News, This Week, Jan. 12, 2014", "Oxfam, Are women really 70% of the world’s poor? How do we know?, Feb. 3, 2010", "Journal of Development Studies, The ‘Feminisation of Poverty’ and the ‘Feminisation’ of anti-poverty programmes: Room for revision?, February 2008", "Economic Commission for Latin America and the Caribbean, Database of social, economic, and environmental indicators for Latin America and the Caribbean, accessed Jan. 14, 2014", "Economic Commission for Latin America and the Caribbean, CEPAL - Social statistics, 2005", "United Nations Development Programme, Human Development Report - 1995, 1995", "International Fund for Rural Development, Rural poverty report 2011, 2010", "UN Women, Women, poverty and economics, accessed Jan. 14, 2014", "International Food Policy Research Institute, Are women overrepresented among the poor? An analysis of poverty in ten developing countries, June 2001", "U.S. Census, American Community Survey: Poverty by sex - 2012", "Email interview, Duncan Green, senior strategic adviser, Oxfam - GB, Jan. 14, 2014", "Email interview, Sylvia Chant, professor of development geography, London School of Economics, Jan. 13, 2014", "Email interview, Diane Elson, professor of sociology, University of Essex, Jan. 14, 2014", "Email interview, Nanette Braun, chief, communications and advocacy, UN Women headquarters, Jan. 14, 2014", "Email interview, Joyce De Pina, communications specialist, United Nations Development Programme, Jan. 14, 2014", "Email interview, Leila Rafei, data help desk, World Bank, Jan. 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]