["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A bogus online post that said Miami-based Carnival Cruise Line was providing cruises and cash to people affected by an unnamed hurricane was from a website that generates fake news articles.", "\"Carnival Cruise Lines will now offer FREE Cruises,\" read the headline on a Sept. 20, 2017, post on BreakingNews247.net. The post featured an image of the vessel the Carnival Sunshine.", "\"Carnival is now offering Free Cruises to those effected (sic) by the Hurricane,\" the post read. \"Just call Carnival or Message John Heald and say you want a stress free cruise with ( hash tag) Carnivalfamily and they will have you set up on a 4-7 night cruise of your choice. Just pay taxes and port fees. You also will receive $100 per cabin OBC.\"", "There’s no mention of which 2017 hurricane sparked the offer, whether it be Harvey, which drenched Texas, or Irma, which blew through Florida (the \"OBC\" stands for on-board credit).", "But Carnival isn’t offering such a deal, because the story is fake.", "It’s not readily apparent, but BreakingNews247.net is one of a gaggle of websites that allow users to create their own stories, labeling them as \"prank\" articles.", "Below the text and some advertisements is a button that reads \"Create a Prank.\" Clicking on it allows a user to build their own fake story.", "PolitiFact has written about similar sites before. A range of websites allowing people to generate these kinds of stories have been reported by Facebook users for all manner of faux stories, as part of the social network’s efforts to curb fake news.", "While some people may look at the sites as a way to create jokes, they open up the potential for a scam known as \"like farming.\" That’s when users create posts to gain as many likes as possible. The scammers then use highly ranked links to spread malware, gain readers’ personal information or otherwise make money.", "This particular post first appeared sometime before Sept. 15, according to the Miami Herald. It drew Carnival’s attention after being posted on Facebook.", "The post suggested readers contact Heald, who is a real British Carnival cruise director. Heald addressed the hoax on his own Facebook profile, in which he engages Carnival customers.", "\"It is a fake page and we have reported the author accordingly,\" Heald wrote in a Sept. 15 Facebook post.", "Heald said on the post that he was aware which Facebook group was spreading the fake story but didn’t elaborate. He also called the original poster a \"soulless, heartless wanker\" and further talked about the issue in a video posted to his profile later that day.", "But the fake story was still available at BreakingNews247.net. As of this writing, a counter on the article said it had been shared more than 83,000 times.", "Don’t pack your bags just yet, because there’s no free pleasure cruise for hurricane victims. We rate this claim Pants On Fire!", "BreakingNews247.net, \"Carnival Cruise Lines will now offer FREE Cruises,\" Sept. 20, 2017", "ConsumerAffairs.com, \"Like-farming Facebook scams: Look before you ‘like’,\" April 22, 2015", "PunditFact, \"Story about Checkers shooting came from fake news generating website,\" July 6, 2017", "Facebook, John Heald post, Sept. 15, 2017", "Facebook, John Heald video, Sept. 15, 2017", "Miami Herald, \"A free cruise for hurricane victims turned out to be a prank by a ‘heartless’ scammer,\" Sept. 20, 2017", "Carnival.com, Hurricane relief page, accessed Sept. 20, 2017", "Interview with Jennifer de la Cruz, Carnival Cruise Line spokeswoman, Sept. 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]