["About this rating", "Example:", "REQUEST FOR URGENT BUSINESS RELATIONSHIP", "FIRST, I MUST SOLICIT YOUR STRICTEST CONFIDENCE IN THIS TRANSACTION. THIS IS BY VIRTUE OF ITS NATURE AS BEING UTTERLY CONFIDENTIAL AND 'TOP SECRET'. I AM SURE AND HAVE CONFIDENCE OF YOUR ABILITY AND RELIABILITY TO PROSECUTE A TRANSACTION OF THIS GREAT MAGNITUDE INVOLVING A PENDING TRANSACTION REQUIRING MAXIIMUM CONFIDENCE.", "WE ARE TOP OFFICIAL OF THE FEDERAL GOVERNMENT CONTRACT REVIEW PANEL WHO ARE INTERESTED IN IMPORATION OF GOODS INTO OUR COUNTRY WITH FUNDS WHICH ARE PRESENTLY TRAPPED IN NIGERIA. IN ORDER TO COMMENCE THIS BUSINESS WE SOLICIT YOUR ASSISTANCE TO ENABLE US TRANSFER INTO YOUR ACCOUNT THE SAID TRAPPED FUNDS.", "THE SOURCE OF THIS FUND IS AS FOLLOWS; DURING THE LAST MILITARY REGIME HERE IN NIGERIA, THE GOVERNMENT OFFICIALS SET UP COMPANIES AND AWARDED THEMSELVES CONTRACTS WHICH WERE GROSSLY OVER-INVOICED IN VARIOUS MINISTRIES. THE PRESENT CIVILIAN GOVERNMENT SET UP A CONTRACT REVIEW PANEL AND WE HAVE IDENTIFIED A LOT OF INFLATED CONTRACT FUNDS WHICH ARE PRESENTLY FLOATING IN THE CENTRAL BANK OF NIGERIA READY FOR PAYMENT.", "HOWEVER, BY VIRTUE OF OUR POSITION AS CIVIL SERVANTS AND MEMBERS OF THIS PANEL, WE CANNOT ACQUIRE THIS MONEY IN OUR NAMES. I HAVE THEREFORE, BEEN DELEGATED AS A MATTER OF TRUST BY MY COLLEAGUES OF THE PANEL TO LOOK FOR AN OVERSEAS PARTNER INTO WHOSE ACCOUNT WE WOULD TRANSFER THE SUM OF US$21,320,000.00(TWENTY ONE MILLION, THREE HUNDRED AND TWENTY THOUSAND U.S DOLLARS). HENCE WE ARE WRITING YOU THIS LETTER. WE HAVE AGREED TO SHARE THE MONEY THUS; 1. 20% FOR THE ACCOUNT OWNER 2. 70% FOR US (THE OFFICIALS) 3. 10% TO BE USED IN SETTLING TAXATION AND ALL LOCAL AND FOREIGN EXPENSES. IT IS FROM THE 70% THAT WE WISH TO COMMENCE THE IMPORTATION BUSINESS.", "PLEASE,NOTE THAT THIS TRANSACTION IS 100% SAFE AND WE HOPE TO COMMENCE THE TRANSFER LATEST SEVEN (7) BANKING DAYS FROM THE DATE OF THE RECEIPT OF THE FOLLOWING INFORMATIOM BY TEL/FAX; 234-1-7740449, YOUR COMPANY'S SIGNED, AND STAMPED LETTERHEAD PAPER THE ABOVE INFORMATION WILL ENABLE US WRITE LETTERS OF CLAIM AND JOB DESCRIPTION RESPECTIVELY. THIS WAY WE WILL USE YOUR COMPANY'S NAME TO APPLY FOR PAYMENT AND RE-AWARD THE CONTRACT IN YOUR COMPANY'S NAME.", "WE ARE LOOKING FORWARD TO DOING THIS BUSINESS WITH YOU AND SOLICIT YOUR CONFIDENTIALITY IN THIS TRANSATION. PLEASE ACKNOWLEDGE THE RECEIPT OF THIS LETTER USING THE ABOVE TEL/FAX NUMBERS. I WILL SEND YOU DETAILED INFORMATION OF THIS PENDING PROJECT WHEN I HAVE HEARD FROM YOU.", "YOURS FAITHFULLY,", "DR CLEMENT OKON", "NOTE; PLEASE QUOTE THIS REFERENCE NUMBER (VE/S/09/99) IN ALL YOUR RESPONSES.", "Even as you read this, the world famous Nigerian Scam (also known as a \"4-1-9\" or \"Advance Fee Fraud\" scheme) is parting yet more of the 'something for nothing' crowd from their money.", "Here's how it works: Letters (or, nowadays, e-mail messages) postmarked from Nigeria (or Sierra Leone, or the Ivory Coast, or almost any other foreign nation) are sent to addresses taken from large mailing lists. The letters promise rich rewards for helping officials of that government (or bank, or quasi-government agency or sometimes just members of a particular family) out of an embarrassment or a legal problem. Typically, the pitch includes mention of multi-million dollar sums, with the open promise that you will be permitted to keep a startling percentage of the funds you're going to aid in squirreling away for these disadvantaged foreigners.", "If you're not saying \"scam\" by now, you should be. Should you agree to participate in this international bail-out, something will go wrong. Paperwork will be delayed. Questions will be asked. Officials will need to be bribed. Money from you — an insignificant sum, really, in light of the windfall about to land in your lap — will be required to get things back on track. You pay, you wait for the transfer ... and all you'll get in return are more excuses about why the funds are being held up and assurances that everything can be straightened out if you'll just send a bit more cash to help the process along. Once your bank account has been sucked dry or you start making threats, you'll never hear from these Nigerians again. As for the money you've thrown at this, it's gone forever.", "In a nutshell, the con works by blinding the victim with promises of an unimaginable fortune. Once the sucker is sufficiently glittery-eyed over the prospect of becoming fabulously rich, he is squeezed for however much money he has. This he parts with willingly, thinking \"What's $5,000 here or $10,000 there when I'm going to end up with $2 million when this is all done?\" He fails to realize during the sting that he's never going to get the promised fortune; all of this messing around is designed to part him from his money.", "In another form taken by the Nigerian scam, a church or religious organization is contacted by a wealthy foreigner who says he desires nothing more than to leave his considerable fortune to that particular group. Maybe he says he's led a life of sin and is now trying to make good, or maybe he claims that as a devout Christian he heard about their good works and wants to leave his money to help continue them, but whatever the backstory, it's just a tale. Once again, there will be delays, each of them necessitating the \"beneficiary\" to spend a few thousand here and a few thousand there in an effort to collect money that never materializes.", "In a 2002 version of the con, the victim is informed he has just won an important prize in a foreign lottery he doesn't remember entering. Only when he tries to collect the money is he approached for payment of facilitation fees to get his winnings to him. It's the same con, with just a few elements unimportant to the execution of the thievery changed about.", "The scam is known as the Nigerian scam, but many countries are routinely named as the homelands the appeals originate from. Likewise, the backstory, the tale that supposedly explains how these people came into possession of this incredible sum and why they now need help getting it out of wherever, changes from one e-mail to the next. There are hundreds of versions in existence, each naming different people, describing different situations, and coming from a myriad of far-flung countries. Forget about matching one backstory to another or being suspicious of e-mails from Nigerians but not applying the same caution to approaches from folks from other places — grasp instead the general principle of the scam: Someone from someplace far away wants to give you (or your church) millions of dollars but needs your help in moving the money from there to here. It doesn't matter if the letter says it came from Sri Lanka and the \"funds\" that need moving are gold bricks or uncut diamonds — it's the Nigerian scam. Don't let the naming blind you to that.", "Once the scam is explained, it seems so obvious a con that you'd wonder who would fall for it. Yet fall for it people do because they're mesmerized by the wealth that will soon be theirs. They also fail to realize there's a hook hanging just out of sight; at first all they see is that someone wants to give them something, thus they're ill-prepared to mentally shift gears when that person turns the tables. Because the premise of \"I'm going to get millions of dollars\" is wholeheartedly swallowed early on, it's not at a later point questioned when things begin to go wrong with the transaction and the dupes who have been targeted are asked to dig up some funds to help move things along.", "The Nigerian scam is hugely successful. According to a 1997 newspaper article:", "\"We have confirmed losses just in the United States of over $100 million in the last 15 months,\" said Special Agent James Caldwell, of the Secret Service financial crimes division. \"And that's just the ones we know of. We figure a lot of people don't report them.\"", "But this is a new scam, right? People are falling for it because they've yet to catch on?", "Wrong. Very, very wrong.", "The Nigerian Scam has been emptying the pockets of victims for decades — first through letters, then with faxes, and now via e-mail. In its earliest incarnation, which dates to at least the 1920s, it was known as 'The Spanish Prisoner' con. In that long-ago version, businessmen were contacted by someone trying to smuggle the scion of a wealthy family out of a prison in Spain. But of course the wealthy family would shower with riches those who helped secure the release of the boy. Those who were suckered into this paid for one failed rescue attempt after another, with the fictitious prisoner continuing to languish in his non-existent dungeon, always just one more bribe, one more scheme, one more try, away from being released.", "These days it's trapped funds not errant sons of well-to-do families that are the objects of these global wild goose chases, but the con is the same. The undisputed headquarters of the scam is Nigeria, with some of the cons progressing so far as to have the victims fly to that country to meet with the \"officials\" they are purportedly assisting. Things got so out of hand, in fact, that in 1991 the Nigerian government felt compelled to issue a statement disavowing its participation in this scheme:", "The Central Bank of Nigeria (CBN) said on Thursday that swindlers using Nigerian names had extorted millions of dollars from people in the United States, Asia and Europe under the guise of transferring cash abroad.The elaborate fraud involves fake official approval to transfer up to 15 million dollars in excess claims on bogus Nigerian contracts as well as pledges to cut the claims amount for help in the use of offshore bank accounts.", "A CBN statement warned foreign companies and businessmen not to fall for the confidence trick, saying that the bank had been surprised and embarrassed by enquiries relating to the fraud. \"The bank has no knowledge or record whatsoever of the purported claims or transfers, or even the related alleged contracts,\" it said.", "Ah, but is it the same scheme? You tell me:", "British companies are being warned against a get-rich-quick scam involving thousands of letters sent from firms based in Nigeria.The letters ask UK firms to assist in the transfer of funds from Nigeria to Britain — by sending signed headed paper, invoices and bank account details — in return for a cut of the sum transferred. Instead of transferring sums, the UK firm's money is removed by the fraudsters. Scotland Yard says that some companies have lost thousands of pounds in this way. About 25,000 letters are circulating in the UK. But the scale of the losses — which could run to many millions according to the Confederation of British Industry — is masked because some victims are ashamed to admit that they took part in such schemes in the first place.", "The real Central Bank of Nigeria tries to warn people about this scam, but it's a case of the guy with the broom following the elephant — the elephant always gets there first. They even placed a half-page ad explaining the scam and warning off those who might be tempted to fall for it in major U.S. newspapers, such as the 27 October 1998 issue of the Los Angeles Times. That ad mentioned some new variations on the old scheme:", "A recent variation of the scam directed primarily at charitable organisations and religious bodies overseas involves bogus inheritance under a will. Again the sole aim is to collect the 'advance fees' already described above. A new strategy that has also been used to defraud the 'victims' is to offer to use chemicals to transform ordinary paper into United States dollar bills, which would be subsequently shared by the parties.", "Should you have occasion to feel something's not quite right about a deal being offered, drop by the websites of both the Better Business Bureau (BBB) and the National Fraud Information Center (NFIC).", "Salon.com editor Douglas Cruickshank also penned \"I crave your distinguished indulgence (and all your cash),\" a wonderful textual analysis of Nigerian fraud messages.", "The Secret Service asks if you have been victimized by the Nigerian scam to forward appropriate written documentation to the United States Secret Service, Financial Crimes Division, 950 H Street, NW, Washington, D.C. 20223, or telephone (202) 406-5850, or contact by e-mail. Per their automated response system, they no longer want faxed copies of the various Nigerian scams.", "However, it needs to be pointed out there is only so much the Secret Service or any law enforcement agency can do if the perpetrators of the scam are not within their jurisdiction. Your local police department cannot send officers to Nigeria to arrest the fellows who are attempting to con you out of your life savings any more than Nigerian police could show up on your doorstep to put the handcuffs on you.", "Folks angered by Nigerian scam come-ons often want to see justice done and done quickly, yet often there is little that can be done because those behind the thefts are in other parts of the world. Ergo, the best protection is an awareness that the laws of your country are not always enforceable in other lands, so it behooves you to always proceed with caution when dealing with people or business entities in foreign locales.", "Additional information:", "Advisory Regarding “Advance Fee Fraud” Schemes (U.S. Secret Service)\nThe “Nigerian” Scam: Costly Compassion (Federal Trade Commission)\nConsumers Now Target of Nigerian Scam Letters (Better Business Bureau)\nNigerian Letter Scams Go Hi-Tech (Better Business Bureau)", "Collins, Jeff.   “Beware a Nigerian Postmark.”\r\n    The Orange County Register.   24 May 1997   (p. B1).", "Fagan, Mary.   “August Is a Wicked Month for Fraud.”\r\n    The Independent.   16 August 1991   (p. 23).", "Moore, Ronnie.   “Officials Issue Warning of Nigeria Money Scam.”\r\n    Chattanooga Free Press.   26 March 1997   (p. B3).", "Sullivan, Brian.   “Nigeria Launches Web Site to Target E-mail Scams.”\r\n    Computerworld.   26 March 2002.", "Omaha World Herald.   “Nigerian Letter Sent to U.S. Sets Up Scam.”\r\n    4 October 1996   (p. 41).", "The Reuter Library Report.   “Nigeria Says Millions of Dollars Extorted From Foreigners.”\r\n    5 September 1991.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]