["About this rating", "A McDonald's restaurant in Beaverton, Oregon, first opened in August 1961. McDonald's confirmed that its atrium and lobby had not been renovated since the mid-1980s.", "However, McDonald's also told us that the building's wallpaper, artwork, and roofing were updated in the early 2000s.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On Jan. 6, 2021, a Reddit post about a \"retro\" McDonald's made the website's front page. Its title on the r/mildlyinteresting subreddit read: \"This McDonalds hasn't been renovated since the 80's/90's.\"", "Photo via u/carbonbasedcat (Reddit)", "The post achieved an upvote score of 94% and a whopping 60,300 points. For those unfamiliar with Reddit, this percentage and number of points meant that it was upvoted tens of thousands of times, and was extremely popular.", "Reddit user u/carbonbasedcat, who created the post, told us that the photographs were captured the same day that the Reddit post was made. Social-distancing stickers were visible on the floor, and a clear barrier was present at a cash register. Tables and chairs were also chained off. This was all due to safety measures and dine-in restrictions during the COVID-19 pandemic.", "Photo via u/carbonbasedcat (Reddit)", "One Reddit user said: \"The amber colored glass ashtrays is all that’s missing.\" Another person asked: \"Is this inside a museum?\"", "In fact, the photographs showed a real McDonald's restaurant located in Beaverton, Oregon. The state of Oregon has no shortage of nostalgic tourist stops, whether it be filming locations for the 1985 classic \"The Goonies\" or the last Blockbluster video.", "Photo via Ally R. (Yelp)", "The \"retro\" look of the old McDonald's included swivel chair seats and a pink and blue color scheme. The front of the restaurant also had curved atrium windows.", "Photo via Valentine Power (Google Maps)", "Reddit users commented that perhaps the McDonald's location used to be a Taco Bell, Burger King, or Wendy's. However, McDonald's USA employee Lindsay Kirsh-Rainey told us that McDonald's had operated at 9475 S.W. Beaverton Hillsdale Highway since August 1961. Kirsh-Rainey is the company's field brand reputation manager in the Pacific Northwest.", "The month and year of August 1961 placed its opening around two decades after the company was first launched in the 1940s.", "Kirsh-Rainey provided more details about the history of the Beaverton restaurant. The Reddit post that claimed the restaurant had a look that appeared to be from the 1980s or 1990s was correct. She confirmed that the lobby and atrium were redone in the mid-1980s. However, there have been some changes since that time. She told us that the current owner, Don Armstrong, bought the restaurant in 2003. Wallpaper and pictures were redone in 2006. As for the exterior of the building, \"the old brown roof was removed and replaced with the metal roof around 2010.\"", "Photo via Baby Neil (Google Maps)", "We found one more detail about the history of the building: In 2013, the Portland Tribune reported on a birthday party with around 80 people that occurred at the same McDonald's restaurant. The article mentioned the incorrect opening date, but the rest of the story told of a gathering for 95-year-old Ardith Tall:", "Living in a nearby neighborhood for decades, Tall, an accomplished artist and retired employee of Portland’s Emmet Travel School, has visited the restaurant every morning for at least the past 10 years. She’s been a regular patron since the restaurant — one of Oregon’s first McDonald’s — first opened in 1963. To reward the Idaho native's longtime loyalty and good humor, the restaurant's management — with the encouragement of Tall's friend Cynthia Richards — decided to throw a birthday party with nearly as many guests as years Tall has been on the planet. They provided a birthday cake, party favors and a birthday card for Tall containing a $50 \"Arch Card\" for her to use at subsequent visits.", "\"This is our first big party here,\" said Linda Sarrazin, a McDonald's swing-shift manager who lives in Aloha. \"Ardith has been coming in for a very long time. We like her great smile, her youthfulness. When she said she was turning 95, I said, 'No, you can’t be 95!' Her personality and her smile, it rubs off on everyone.\"", "Commandeering her favorite window seat, which was lined with about 15 of her striking nature and scenery paintings, Tall enjoyed a breakfast burrito, chatted with friends and relatives and accepted gifts throughout the three-hour gathering.", "Tall lived two more years. According to Legacy.com, she died in 2015. Her favorite window seat still remained in the restaurant in 2021, as did much of the restaurant location's nearly 60 years of history.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]