["About this rating", "Carsyn Leigh Davis did die of complications from COVID-19 and did, 13 days earlier, attend a large party at her youth church, during which social distancing appears to have been relaxed.", "However, it cannot be assumed that Davis contracted COVID-19 at the June 10 church event, which the organizers described as a \"Release Party,\" not a \"COVID party.\" The latter description originated from other commentators critical of the church and its purported COVID-19 policies.", "It's not clear what rules or guidelines, if any, were implemented or enforced by organizers of the June 10 \"Release Party,\" or what proportion of the young attendees wore masks and observed social distancing.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, readers asked us about the circumstances surrounding the passing of Carsyn Leigh Davis, a 17-year-old from Fort Myers, Florida, who died after contracting the COVID-19 coronavirus disease weeks earlier.", "In particular, readers asked us to examine the accuracy of news reports and online posts that claimed Davis had died 13 days after attending a \"COVID party\" at her family's church.", "The website Raw Story published an article with the headline \"Florida Teen Dies After Conspiracy Theorist Mom Takes Her to Church 'COVID Party' and Tries to Treat Her With Trump-Approved Drug: Report.\" The article went on:", "\"A Florida mother took her high-risk teenage daughter to a 'COVID party' at their church, tried treating the girl at home with unproven drugs when she got sick — and then hailed her as a patriot after she died.\"", "The claim that Davis had attended a \"COVID party\" appears to have originated in a July 5 blog post on the website FloridaCovidVictims.com, which wrote that:", "\"She [Davis] had survived cancer, her mom reported, and was a caring and giving person. She was known for her huge heart and good nature, despite all of her health problems. She had nearly died as a child, but developed a strength and love of life that made everyone around her smile. So then why in God’s name did her mother take her to a 'COVID Party' at their church on June 10 to intentionally expose her immuno-compromised daughter to this virus? ... On June 10, Carysn’s [sic] mom, Carole, took Carsyn, a 16-year-old girl who was immuno-compromised with a history of health issues (including cancer), to a 'COVID party' at her church, where more than 100 children without masks were in attendance.\"", "The \"COVID party\" claim was subsequently repeated in articles and posts published by Newsweek, the Daily Kos, and Alternet.", "Davis did die of complications from COVID-19, with several underlying health problems as contributory causes. On June 10, she did attend an event at her local youth church at the First Assembly of God in Fort Myers. However, reports that it was a \"COVID party\" were inaccurate and based on a gross misrepresentation of real descriptions of the event.", "An investigations report by the Miami-Dade County Medical Examiner Department provided the following account of Davis' death:", "17 year old female with a complex medical history including opsoclonus myoclonus syndrome (resolved at 5 years of age), hypothalamic-pituitary axis dysfunction, precocious puberty, morbid obesity who present [sic] with respiratory failure. The decedent's mother and father are a nurse and physician's assistant, respectively.", "On June 10, the decedent attended a church function with 100 other children. She did not wear a mask. Social distancing was not followed. The parents prophylactically treated her with azithromycin (6/10-6/15). On June 13, she developed frontal headache, sinus pressure, mild cough. The family thought her symptoms were due to a sinus infection. The symptoms persisted.", "On June 19, the mother noted she looked \"gray\" while sleeping. She tested the decedent's O2 saturation and it was in the 40s. The mother borrowed the decedent's grandfather's home oxygen (he has COPD) and her O2 saturation rose to the 60s on 5L. The parents gave her a dose of hydroxychloroquine. The parents took her to Gulf Coast Medical Center and she was transferred to Golisano Hospital PICU.", "On June 19, 2020, she was found to be positive for SARS CoV-2. Her LFTs [liver function tests] were significantly elevated. The parents declined intubation. The decedent received convalescent plasma therapy on June 20 and 21st. On June 22, 2020 the decedent's condition had not improved and intubation was required. The decedent was intubated. Her cardiorespiratory status continued to decline.", "On June 22, 2020, despite aggressive therapy and maneuvers, her best O2 saturation was low 70s. The mother requested heroic efforts despite knowing she had low chance of meaningful survival. Preparations were made to perform ECMO [extracorporeal membrane oxygenation] on the decedent. The decedent was transferred from Golisano Hospital to the Nicklaus Children's Hospital for ECMO. She was transported without incident directly to the cath lab at Nicklaus Children's for ECMO cannulation. After cannulation she required escalation of inotropic support and vasopressor support. She was transferred to the PICU after the procedure and continued to deteriorate requiring increasing doses of pressors.", "Chest X-ray was performed and showed severe bilateral infiltrates and subcutaneous emphysema. She developed worsening distributive shock and multiorgan failure. She was to undergo dialysis and plasmapheresis however due to rapid deterioration and inability to bring up oxygen saturation, these interventions were unable to be performed. Echocardiogram was performed and showed no cardiac function, pupils were 5 mm and fixed. She was pronounced dead on 6/23/2020 at 1306.", "The report specified that Davis' cause of death was \"Complications of COVID-19 (SARS-CoV-2) Pneumonia,\" with the following listed as contributory causes: \"Hypothalamic-Pituitary Axis Dysfunction, Morbid Obesity, Bronchial Asthma.\"", "It's not clear how or where Davis contracted COVID-19. According to the medical examiner's report, she first developed symptoms three days after attending a church event with 100 other children. However, COVID-19 symptoms can take between two and 14 days to appear after exposure, so it cannot be assumed that Davis caught the virus at the June 10 church event.", "It's true that Davis' parents did attempt to treat her illness with azithromycin and hydroxychloroquine, a controversial proposed treatment for COVID-19 that has been touted by President Donald Trump. That aspect of the news reports mentioned above was accurate.", "However, no evidence has been presented to support the claim that the June 10 church event was billed as a \"COVID party,\" or was designed as a forum for young people to intentionally or wantonly expose themselves and others to the disease.", "Rebekah Jones, a data scientist who was fired by the Florida Department of Health after what the department told Snopes was a \"a repeated course of insubordination\" and \"blatant disrespect\" for her colleagues, first uncovered the medical examiner’s report on Davis’ death. (Jones has insisted she was fired for refusing to manipulate COVID-19-related data, while the Associated Press reported she had repeatedly made unauthorized public comments on the state’s COVID-19 data-collection methods.)", "That document was first published on FloridaCovidVictims.com, which is run by Florida Covid Action, an alternative provider of COVID-19 data in Florida, and an initiative by Jones and others.", "On Twitter, Jones posted what appeared to be a screenshot taken from the Facebook page of First Youth Church at the First Assembly of God in Fort Myers — the Davis family's church. In a June 10 post, First Youth Church wrote:", "\"Service is back and better than ever! We will be having our Release Party in the gym TONIGHT at 6:45. There will be games, awesome giveaways, free food, a DJ and music, and the start of our new sermon series. AND we'll be starting Summer Nights afterwords [sic] with karaoke and basketball! We hope to see you there!\"", "It was Jones, and not the church itself, who described the June 10 event as a \"COVID party,\" and the screenshot, presented as evidence by Jones, actually undermines her own contention that the event attended by Davis and others was a \"COVID party.\" The FloridaCovidVictims.com blog post was especially misleading, because it placed quotation marks around the phrase \"COVID party,\" falsely indicating that that description originated with the organizers themselves.", "On July 7, in response to the news reports mentioned above, the First Assembly of God posted a strongly worded news release on Facebook, firmly rejecting claims that the church had hosted a \"COVID party\":", "\"Over the past 24 hours First Assembly of God of Fort Myers has been accused of hosting 'COVID-19 parties.' Nothing could be farther from the truth. First Assembly of God of Fort Myers is following all of the health protections and protocols recommended by the state and local government with regard to holding its church services. Let us be clear — media reports and postings accusing the church of ignoring protocols or actively engaging in behavior intended to expose our congregation to the virus are absolutely false and defamatory.\"", "The statement added that claims of a \"COVID party\" were \"based upon irresponsible speculation and inaccurate information.\"", "Although the medical examiner's report notes that Davis herself did not wear a mask at the June 10 event, it's unclear whether others did. Snopes sent a list of questions to First Assembly of God officials, including asking what COVID-19 mitigation guidelines or rules, if any, the church had implemented during the \"Release Party.\" We did not receive a response of any kind in time for publication.", "Pastor David Thomas told WBBH that the church had taken unspecified precautions to ensure the safety of children at the event, but that it was left to individual children to decide whether to practice social distancing. This indicates that any official church enforcement of social distancing at the event was relaxed.", "After initial publication, several news outlets and websites updated their articles to reflect the fact that the characterization of the June 10 event as a \"COVID party\" had come from others, and not from the youth church organizers themselves. FloridaCovidVictims.com, whose original blog post formed the basis of several other articles, later removed all references to a \"COVID party,\" instead describing the June 10 event as \"a large youth event at her church, where more than 100 children without masks were in attendance.\" The updated post did not provide evidence to substantiate the claim that the 100 children in attendance did not wear masks.", "Newsweek replaced the phrase \"coronavirus party\" with \"church party\" in its headline, and Raw Story replaced \"church 'COVID party'\" with \"church event\" in its headline, adding the following note: \"Jones’ analysis of the medical examiner’s report suggested that Davis had intentionally exposed her daughter to the virus at the event, but there’s no additional evidence to support that claim. This report has been updated to reflect subsequent reporting on the teen’s illness.\"", "At the time of this Snopes reporting, neither the Daily Kos nor Alternet had published similar updates or corrections.", "Gettys, Travis.  \"Florida Teen Dies After Conspiracy Theorist Mom Takes Her to Church 'COVID Party' and Tries to Treat Her With Trump-Approved Drug: Report.\"\r\n  Raw Story.  6 July 2020.", "FloridaCovidVictims.com.  \"Carsyn Leigh Davis.\"\r\n  5 July 2020.", "Czachor, Emily.  \"Florida Teen Dies After Mother Took Her to Church Coronavirus Party, Then Treated Her With Hydroxychloroquine.\"\r\n  Newsweek.  6 July 2020.", "Aur Ganuz.  \"Human Sacrifice on the Altar of Ignorance.\"\r\n  The Daily Kos.  6 July 2020.", "Mathis, Benjamin.  \"Investigations Report -- Carsyn Leigh Davis.\"\r\n  Miami-Dade County Medical Examiner Department.  23 June 2020.", "The U.S. Centers for Disease Control and Prevention.  \"Symptoms of Coronavirus.\"\r\n  Accessed 7 July 2020.", "Farrington, Brendan and Bobby Caina Calvan.  \"Public Remarks Prompted Florida Virus Data Curator's Firing.\"\r\n  The Associated Press.  23 May 2020.", "Iati, Marisa.  \"Florida Fired Its Coronavirus Data Scientist. Now She's Publishing the Statistics on Her Own.\"\r\n  The Washington Post.  13 June 2020.", "First Assembly of God (Fort Myers, Florida).  \"Press Release Regarding False Statements About COVID-19 Party at First Youth Church.\"\r\n  7 July 2020.", "Dean, Evan.  \"Medical Examiner: Teen Who Died From COVID-19 Attended Large Church Event Days Before Death.\"\r\n  WBBH.  6 July 2020.", "Updated [10 July 2020]: Added clarity about the alleged circumstances surrounding the termination of Rebekah Jones from her position at the Florida Department of Health.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]