["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The man running Gov. Charlie Crist's campaign for U.S. Senate is bragging that Crist set a fundraising record in 2009.", "\"In our first quarter we broke the record for fundraising in a U.S. Senate race in Florida,\" Crist campaign manager Eric Eikenberg wrote Dec. 18 in a campaign update to supporters. \"And we have met our goals time and again thanks to many of you who have invested in the Governor's message and vision of commonsense conservative leadership.\"", "Crist raised $4.37 million between May 12 and June 30, 2009, according to federal election campaign  documents  .", "Is that a record for a single reporting period?", "To check, we turned to the two most trusted repositories of federal campaign finance information -- the government-run Federal Elections Commission and the nonpartisan, not-for-profit Center for Responsive Politics.", "According to them, Florida's overall Senate fundraising benchmark was set in 2006 by U.S. Sen. Bill Nelson. Nelson  raised  a little more than $18 million for his re-election campaign against Republican Katherine Harris.", "But his best quarter -- from January through March 2006 -- netted only $2.82 million, according to  FEC records  .", "Crist's number crushes that mark.", "Other than Nelson, former U.S. Sen. Mel Martinez seemed to be a possible state recordholder. But Martinez's biggest haul was only  $1.7 million  , from January through March 2004. He repeated the feat again from April through June 2004.", "Martinez ended up raising a little more than $12 million for the 2004 election, slightly more than Democratic opponent Betty Castor in that cycle.", "No one else comes close to Crist's quarter fundraising total, records show.", "Crist raked in $4.37 million in his first campaign fundraising quarter and has raised $6.89 million through September. Nelson raised $6.53 million for his entire 2000 race, compared with $8.66 million for that year's GOP candidate, Bill McCollum. In the 1998 campaign between Crist and former Sen. Bob Graham, the candidates combined to raise about $7 million.", "Crist's take from May 12 to June 30 is the largest three-month gain for any Senate candidate in Florida history. We rate the Crist campaign claim True.", "Federal Election Commission campaign fundraising information, accessed via  www.fec.gov", "Campaign finance information for Bill Nelson, Charlie Crist, Center for Reponsive Politics, accessed via  www.opensecrets.org", "\"Mel Martinez leads in early fundraising,\" Miami Herald, April 1, 2004, accessed via Nexis", "\"  Crist rakes in record $4.3M  ,\" St. Petersburg Times, July 9, 2009", "\"  Lobbyists generous to Charlie Crist campaign  ,\" Miami Herald, July 22, 2009", "\"Hopefuls are poles apart,\" St. Petersburg Times, Oct. 20, 1998, accessed via Times archives", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]