["About this rating", "In June 2020, a still shot from the 2011 movie \"Captain America\" started to circulate on social media along with the claim that the film had \"predicted\" the COVID-19 pandemic by featuring a billboard containing a visual representation of the new strain of coronavirus that causes the disease:", "While this is a genuine still shot from the movie \"Captain America,\" the so-called \"image of a 'coronavirus'\" circled on the right is actually an advertisement for pasta.", "The above-displayed still shot comes from the closing scene of the film when -- spoiler alert -- Steve Rogers, played by actor Chris Evans, wakes up in modern day New York City. As he takes in the surroundings of the city's famous Times Square, the viewer gets a glimpse at some of the billboards that populate the area.", "Here's the clip. You can get a decent look at the \"coronavirus\" symbol around the 2:07 mark:", "For comparison's sake, here's an illustration of the coronavirus from the Centers for Disease Control and Prevention (CDC):", "While the circled image in the movie still may appear at first glance to resemble the CDC's illustration of the coronavirus, the circled image actually shows a billboard for Barilla pasta.", "The closing scene of \"Captain America\" was filmed on location in Times Square, which means many of the advertisements in the background were actually being displayed in real-world New York around the time the movie was filmed. This 2011 Shutterstock image, for instance, shows many of the same billboards (including the Corona Light beer and \"coronavirus\" signs) in Times Square.", "We found a few other images taken in 2011 that give a much better view of this \"coronavirus\" billboard. In this photograph from Flickr photographer Jimmy Svensson, and this image from the French advertising website Lareclame, it's clear that this billboard actually features an advertisement for Barilla pasta.", "While we can't show you those images here for copyright reasons, you can view them on Flickr and Lareclame.  We can give readers a glimpse of the general billboard design, which shows Barilla pasta in the shape of a firework:", "The movie \"Captain America\" did not predict the COVID-19 pandemic, but briefly showed a Barilla pasta ad in the background. Nine years later, social media users took a blurry screenshot of it and attempted to connect it to a global pandemic.", "We reached out to Barilla, and a spokesperson gave us the following statement, edited slightly for clarity:", "\"This is definitely not the type of question we normally find ourselves in the position of being asked ... Any potential reference to the current global pandemic we find ourselves in would be purely coincidental. If the Marvel Universe is able to predict the future, I sure hope I don't come across any evil demigods who are intent on decimating the planet and the universe.\"", "On Location Vacations.   \"‘Captain America’ Filming in Times Square Today!\"\r\n    23 April 2011.", "Jensen, Jeff.   \"'Captain America': About that ending....\"\r\n    Entertainment Weekly.  23 July 2011.", "lareclame.fr.   \"Bonne Année, Bonne Plâtrée!\"\r\n    2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]