["During a news conference called by Donald Trump to explain where money went from a veterans fundraiser, the presumptive Republican nominee for president was asked about the Veterans Administration health system.", "\"I'm entirely in favor of fixing the VA health care. The VA is one of the great catastrophes in this country,\" he said. \"People are waiting five days, six days, seven days on line. They're dying while they wait on line. And I am in favor of, if they can't get to a doctor within a reasonable period of time, they're gonna go see a doctor and the country's going to pay for it. They're going to a private doctor, or a public hospital, or a public doctor but someplace that can take care (of them) immediately. We're losing thousands of people waiting on line.\"", "We looked at this issue in October when Trump contended that, \"Over 300,000 veterans have died waiting for care.\"", "At the time, he didn't explain where he got the estimate, but it dovetailed with a Sept. 2, 2015, report from the VA Office of Inspector General that tried to investigate a claim that 47,000 veterans died because the VA didn't process their health care applications in a timely manner.", "We rated Trump's claim Mostly False for several reasons, one of which was, as the report clearly stated, that 300,000 number — actually 307,173 — was an upper limit, reflecting the maximum number of unprocessed enrollment applications where, according to Social Security records, the applicant had died.", "But because the VA recordkeeping was so horrible, the report concluded, \"we cannot determine specifically how many pending (enrollment system) records represent veterans who applied for health care benefits or when they may have applied.\"", "As PolitiFact reported last year, investigators said that some of those people were not veterans; not all of them were seeking health care or necessarily any VA service; and some of them died before 1998, when the database began.", "For example, the count is complicated by the fact that VA services include home loans and disability payments, some health care to family members of veterans and non-veteran employees of the VA system, and people receiving humanitarian care.", "In addition, in 2013, the VA added millions of records from other arms of the agency into the mix. Many of those ended up in the pending file because the software didn't allow a determination of whether the people were actually applying for medical care.", "Thus, an accurate count was impossible.", "However, Trump's new assertion backs off the 300,000 claim dramatically.", "At the news conference, he simply said that \"thousands\" had died waiting for health care from the VA, a disturbing but still far more modest claim.", "Having close to 2,000 instances would qualify as \"thousands,\" so if just 1 percent of the 307,173 records logged by the inspector general were cases of veterans dying before their paperwork could be processed, his claim would clear the bar.", "Clearly, deadly delays do happen.", "Investigators looking into operations at the urology unit of the Phoenix VA reported in 2015 that 1,484 cancer patients experienced significant delays in their care, 10 \"were placed at 'unnecessary risk for adverse outcomes.' At least half of those died,\" according to the Washington Post.", "CNN concluded in 2014 that it had identified 19 people who had died because of delays in getting simple medical screens at VA hospitals around the country. At one, the Dorn Veterans Medical Center in Columbia, S.C., at least six people had died. \"At the Charlie Norwood VA Medical Center in Augusta, Ga., the VA said three veterans died as a result of delayed care,\" CNN reported.", "In addition, the VA system is huge, with 1,550 sites providing some type of health care. It wouldn't take many cases at each site to have thousands dying because they couldn't get a timely appointment.", "We asked the Trump campaign for the source of the statistic, but didn't hear back.", "Our ruling", "Trump said, \"We're losing thousands of (veterans) waiting on line\" because they can't get speedy health care from the Veterans Administration.", "Similar claims that 300,000 died because of delays by the VA clearly don't have hard evidence to back them up. Instances at individual VA hospitals seldom go into double digits, so there's no hard evidence there that the number of deaths is in the thousands either. Trump dialed back the rhetoric, but the claim still leaves out important context. We rate this claim Half True.", "https://www.sharethefacts.co/share/6610da3e-57d0-4e27-b0d2-29c80e1f3a58", "PolitiFact.com, \"Trump says 300,000 veterans died waiting VA care,\" Nov. 9, 2015", "Veterans Administration, \"Veterans Health Administration — Review of Alleged Mismanagement at the Health Eligibility Center,\" Sept. 2, 2015", "The Washington Post, \"Cancer patients died waiting for care at troubled veterans’ hospital, probe finds,\" Oct. 20, 2015 and \"Fact Checker: Carly Fiorina’s claim that 307,000 veterans ‘died waiting for health care,’\" Sept. 21, 2015", "Interview, Michael Nacincik, spokesman, VA Office of Inspector General, June 1, 2016", "Interview, Michael Tanner, senior fellow, Cato Institute, June 1, 2016", "U.S. Department of Veterans Affairs, \"Important facts, context on the OIG report on VA’s Health Enrollment Center,\" Sept. 3, 2015", "USA Today, \"636,000 vets wait a month or more for doc appointments,\" July 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]