["The video was shared in this June 16, 2019, post on Facebook, where it has been viewed more than 630 times.", "Below is a screenshot of the misleading post:", "The Indonesian language caption translates to English as:\n\t“Oh my God \n\tSmuggled METH from CHINA..the volume is tons\n\tAnd only for a SPECTACLE.”", "The same video with a similar claim was shared on Facebook here, where it had been viewed more than 480,000 times and shared more than 16,000 times before it was removed.", "The footage was also shared on YouTube here with a similar claim.", "The claim is false; the video has circulated online since at least 2013 in reports about cigarettes seized by the Romanian Border Police.", "Reverse image searches using keyframes from the video on Google and Yandex found this video uploaded to the official YouTube account of the Romanian Border Police on June 30, 2013.", "Below is a screenshot comparison of the video in the misleading posts (L) and the video published by the Romanian Border Police (R):", "A Romanian-speaking journalist in AFP’s Bucharest bureau analysed the video uploaded by the Romanian Border Police.", "The title of the video translates to English as: “Around 100,000 packs of cigarettes hidden in logs”.", "The Romanian-language caption of the video translates to English as: “On 28 of June, border police officers from Radauti sector received a notice from the Dornesti Custom Office regarding the fact that, after a freight train which entered from Ukraine through Viscani point was checked in CFR Dornesti station, inside some logs transported by that train a certain amount of cigarettes was observed.", "\"Given the circumstances, the border police was called to make verifications. Therefore, a thorough control started and an impressive quantity of cigarettes was found inside the logs, almost 100,000 packs of cigarettes coming from Ukraine valued at over 800,000 lei (170,000 euros). The whole quantity was confiscated by the border police and an investigation was started under the charge of illegal smuggling.”", "The text superimposed on the video translates to English as: “BORDER POLICE - NATIONAL AUTHORITY FOR CUSTOMS”.", "The cigarettes can be seen at the 31-second mark in the police YouTube video.", "Below is a screenshot from the video at this point:", "The seizure of smuggled cigarettes by Romanian police was reported in this article on the website of Romanian television programme ProTV News published June 28, 2013.", "The headline translates to English as: “Cigarettes in logs, the last innovation of the smugglers. Spectacular images from Suceava.” Suceava is a city in Romania.", "The first paragraph translates to English as: “Police officers in Suceava thought they've seen it all, but that was until they found a special transport coming from Ukraine\".”", "This report published by Romanian newspaper Adevarul on August 9, 2018, states that suspects were indicted in connection with the alleged smuggling.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]