["About this rating", "A video circulated on social media in October 2019 bore a misleading caption: \"James Clapper Outs Barack Obama as Mastermind Behind Russia Hoax.\"", "The caption accompanied a video of former U.S. Director of National Intelligence James Clapper in an interview with CNN, discussing the Trump administration's decision to investigate the origins of inquiries into Russian meddling in the 2016 presidential election. The video appeared to have been uploaded to a video-sharing blog platform.", "Clapper did not say what the video caption claimed: He did not \"out\" Obama as the \"mastermind\" behind the \"Russia hoax.\" Clapper instead aired his dismay at the turn of events in which Obama's successor, Donald Trump, had essentially compelled the government to launch an investigation into its own findings that the Kremlin had manipulated the 2016 presidential election.", "The original CNN video can be viewed by following this link. Here is a transcript of the exchange between Clapper and CNN host Jim Sciutto:", "SCIUTTO: As you know, the president now has sitting members of this government. You have the attorney general traveling the world now, meeting with U.S. intelligence partners, trying to find out, in his view, whether they participated in some sort of Obama administration-led effort to undermine President Trump in the last election here. You also know that John Durham, who is a former prosecutor, senior Justice Department official, he's pursuing his own investigation on the origins of that probe. Are you concerned that Barr's or Durham's investigation will find wrongdoing and seek to punish former intelligence officials?", "CLAPPER: Well, I don't know, I don't think there was any wrongdoing. I think at the time all of us were trying to navigate a very, very difficult, politically fraught, highly-charged situation. I know for my part, my main concern was, were the Russians, and the threat posed by the Russians to our very political fabric. And the message I'm getting from all this is, apparently what we were supposed to have done was to ignore the Russian interference, ignore the Russian meddling and the threat that it poses to us, and oh by the way, blowing off what the then-commander-in-chief, President Obama, told us to do, which was to assemble all the reporting that we could, that we had available to us and put it in one report that the president could pass on to the Congress and to the next administration. And, while we're at it, declassify as much as we possibly could to make it public. And that's what we did. And it's kind of disconcerting now to be investigated for having done our duty and done what we were told to do by the president.", "Multiple investigations have concluded that Russians interfered in the 2016 U.S. presidential election and that their activities were aimed at helping Donald Trump to get elected. Even though Trump repeatedly called those investigations \"witch hunts,\" he appeared to admit in May 2019 to at least knowing that Russians had interfered in the election:", "Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....", "— Donald J. Trump (@realDonaldTrump) May 30, 2019", "Trump and his supporters, however, have undertaken an aggressive campaign to discredit investigations that have concluded the Russians interfered in the 2016 election with the aim of helping Trump win, to the extent that Trump has leveraged his own administration to investigate the inquiry that led to that finding.", "In October 2019 President Trump was facing an impeachment inquiry over a phone call he had with the Ukrainian president, with Trump being accused of holding back key military aid in exchange for Ukraine's assistance in obtaining damaging information about a Trump political rival. But in that call, Trump also asked Ukrainian President Volodymyr Zelensky to look into a debunked conspiracy theory positing that the hacked Democratic National Committee server from 2016 was in Ukraine — a conspiracy theory that exculpates the Russians in the hacking operation.", "In other words, the Obama administration conducted an investigation based on evidence which led to the conclusion that Russians had manipulated the 2016 presidential election. To say Obama was the \"mastermind\" of a \"hoax\" amounts to political propaganda favoring Trump while distorting reality.", "CNN.   \"Clapper: Trump Administration Is Sending Us This Message.\"\r\n    7 October 2019.", "Shane, Scott.   \"What Intelligence Agencies Concluded About the Russian Attack on the U.S. Election.\"\r\n    The New York Times.   6 June 2017.", "Mazzetti, Mark and Katie Benner.   \"Trump Pressed Australian Leader to Help Barr Investigate Mueller Inquiry’s Origins.\"\r\n    The New York Times.   30 September 2019.", "Mazzetti, Mark et al.   \"Barr and a Top Prosecutor Cast a Wide Net in Reviewing the Russia Inquiry.\"\r\n    The New York Times.   6 October 2019.", "Shane, Scott.   \"How a Fringe Theory About Ukraine Took Root in the White House.\"\r\n    The New York Times.   3 October 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]