["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent Facebook post supporting laws requiring voters to show their identification at the polls falsely claimed that IDs are required to enter Washington D.C.", "\"Checking ID’s to get into Washington DC,\" the Feb. 26 post said. \"If we had checked ID’s at the polls we wouldn’t be in the mess we are in.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Alaina Gertz, a spokesperson for the Metropolitan Police Department in DC, told us that there is no such requirement.", "\"I do not recall a time we ever had this requirement in the city,\" Gertz said.", "Searching online we found no evidence to support the claim in the Facebook post. The Transportation Security Administration requires adult airline passengers to show ID at airport checkpoints in order to travel — but that is a requirement nationwide and not specific to travelers headed to DC.", "As for voter ID laws, more than half of the United States asks or requires voters to show some form of identification at the polls, according to the National Conference of State Legislatures. Among those states, six, including Georgia — which was the subject of many false fraud claims in the 2020 election — have strict photo ID laws.", "We rate this Facebook post False.", "Facebook post, Feb. 26, 2021", "PolitiFact, Fact-checking false claims about the 2020 election, Nov. 19, 2020", "National Conference of State Legislatures, Voter identification requirements | Voter ID laws, Aug. 25, 2020", "Email interview with Alaina Gertz, public affairs specialist, Metropolitan Police Department, March 1, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]