["The Facebook posts, including this one with more than 1,000 shares, link to this article published on February 13, 2020, on a sparse website under the domain feednews.com. The domain mainly shares stories about Nigeria. The article’s headline states: “A lost plane in 1945 reappeared after 75 years and the crew were asking if the World war 2 has ended (sic).”", "The same article was shared here and here on Facebook, as well as here on Twitter.", "A keyword search for “plane 1945 reappeared” on CrowdTangle, a social media monitoring tool, found other websites where the same article appears (including here and here), as well as the earliest version of the article, which was published by World News Daily Report (WNDR).", "All the articles use almost identical text, excluding the first paragraph of WNDR’s article, which reads: “One of a group of five Grumman TBM Avenger torpedo bombers that disappeared over the Bermuda Triangle on December 5, 1945, mysteriously reappeared this morning at the Patrick Air Force Base in Brevard, Florida.”", "This claim is entirely fabricated. WNDR is a satirical website, as it explains in a disclaimer on its “About Us” page. The site assumes “all responsibility for the satirical nature of its articles and for the fictional nature of their content.”", "WNDR's disclaimer also states that “all characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.”", "The images used in the WNDR article (and copied in the other articles) come from two different sources.", "AFP ran a reverse image search and found the image of the man standing at a lectern in the archives of the Defense Visual Information Distribution Service, a resource for media following US military issues. Taken on April 19, 2019, it shows General Tod Wolters speaking during a press conference at the Royal Air Force in England.", "The second image, found on this Flickr page, shows a Grumman TBF Avenger aircraft. According to the photograph’s metadata, it was shot on July 14, 2014.", "The lost squadron", "The WNDR article makes reference to a real historical event - the disappearance of Flight 19, a squadron of five TBM Avenger Torpedo Bombers that went missing after departing the US Naval Air Station in Florida for a training mission on December 5, 1945. Its fate remains a mystery, fueling the legend of the Bermuda Triangle.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]