["An altered photo is making its rounds on social media, claiming to show Democratic U.S. Reps. Ilhan Omar of Minnesota, Alexandria Ocasio-Cortez of New York and Rashida Tlaib of Michigan wearing dresses adorned with stars that form the shape of a swastika, the Nazi symbol.", "Also in the photo are three other Democratic representatives: Ayanna Pressley of Massachusetts, to whose head a red bow was added, and congressional newcomers Cori Bush of Missouri and Jamaal Bowman of New York, whose face masks were altered to display the swastika-like graphic imposed on Omar, Tlaib and Ocasio-Cortez's dresses.", "\"Look at rashida , omar and aoc dress , there is a swastika !\" the text below the photo reads. USA TODAY has reached out to the user who posted the image.", "Omar was criticized in 2018 and 2019 for what commentators said was using an anti-Semitic trope in a tweet criticizing Israel's policies. She later apologized but has remained a target of criticism.", "A reverse Google image search shows the original photo was posted Jan. 3 to Bush's Twitter account with the words \"Squad Up.\" There are no swastikas in that photo, nor the bow. It also shows Ilhan, Ocasio-Cortez and Tlaib wearing different-colored dresses than the ones they appear to have on in the altered photo.", "\"The Squad\" is a term used to describe the young, liberal group of women of color who often have been targets of former President Donald Trump and other conservatives. News website The Hill said Bush's posting of the photo indicates she and Bowman are its newest members.", "Since the image with the swastikas showed up in early January, independent fact-checkers have shown the image to be altered. Still, it has been shared hundreds of times.", "The image is ALTERED, based on our research. The original photo was posted to Twitter by freshman Rep. Cori Bush in January.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]