["About this rating", "In March 2021, a video started circulating on social media that was presented as if it showed U.S. Vice President Kamala Harris \"failing\" or \"refusing\" to salute members of the military as she boarded Air Force Two:", "This is a genuine video of Harris boarding Air Force Two. This video was originally shared by Peter Velz, Harris' director of press operations, on March 19 and shows the vice president boarding Air Force Two at Dobbins Air Reserve Base in Georgia.", "While Harris does not salute in this video, there is no requirement for the vice president of the United States (or the president, for that matter) to salute military personnel. As such, it is inaccurate to say that she \"failed\" to salute and outright misleading to say that she \"refused.\"", "Generally speaking, military members in uniform are required to salute the president of the United States, but those in civilian attire (which would include the president and the vice president) are not required to salute. The Army's 2019 guide on \"Salutes, Honors, and Courtesy\" states:", "The President of the United States, as the commander in chief, will be saluted by Army personnel in uniform.", "Civilian personnel, to include civilian guards, are not required to render the hand salute to military personnel or other civilian personnel.", "Salutes are not required to be rendered or returned when the senior or subordinate, or both are in civilian attire.", "The military news website Task and Purpose notes that although soldiers are required to salute their commander-in-chief in certain circumstances, there is no regulation that requires the president to return this salute. For much of the United States' history, presidents did not return salutes to military members. The informal tradition of saluting military personnel started with President Ronald Reagan in the 1980s.", "In 1986, Reagan explained why he started returning salutes during remarks he made to military personnel and their families during a trip to Keflavik, Iceland. As Reagan tells it, he knew that as president he shouldn't salute military members as he was dressed in civilian clothes. After a few highballs, a whisky cocktail, he decided that he should be allowed to return the salute. Reagan was informed that while there was no such regulation, he was the president of the United States and that \"no one would say anything\" to stop him:", "When I got this job -- [laughter] -- and I would be approaching Air Force One or Marine One and those marines would come to a salute and I -- knowing that I am in civilian clothes -- I would nod and say hello and think they could drop their hand, and they wouldn't. They just stood there. So, one night over at the Commandant's quarters, Marine Commandant's quarters in Washington, and I was getting a couple of highballs, and I didn't -- [laughter] -- know what to do with them. So, I said to the Commandant -- I said, \"Look, I know all the rules about saluting in civilian clothes and all, but if I am the Commander in Chief, there ought to be a regulation that would permit me to return a salute.'' And I heard some words of wisdom. He said, \"I think if you did, no one would say anything.'' [Laughter]", "While Reagan's successors have largely maintained this practice, there is no requirement for them to do so.", "We searched for videos of Harris' predecessor, former U.S. Vice President Mike Pence, boarding and disembarking Air Force Two to see if he returned salutes. We have not viewed every video of Pence boarding a plane, but we can say that Pence regularly saluted the guards stationed outside of the plane. Former U.S. President Donald Trump, too, commonly saluted these guards, although we did find a few occasions where Trump did not salute.", "This video shows Trump and Pence disembarking Air Force One in Indianapolis in 2018. Trump walks by the two officers at the bottom of the plane without saluting. Pence, too, walks by before turning and briefly offering a salute. It should be noted that Trump did not \"fail\" or \"refuse\" to salute in this instance, nor did he violate longstanding protocol. He simply disembarked from a plane.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]