["About this rating", "On 29 November 2016, the web site The Resistance: The Last Line of Defense published an article that appeared to report that President Obama's plans to attend Fidel Castro's funeral were quashed by Donald Trump:", "It seems nothing was going to stop the traitor-in-chief from finishing his legacy of hating America and embarrassing us on a global scale. Until he got a call from President-Elect Trump, that is. Dr. Ben Carson, one of Trump’s closest advisors, was in the room when the call was placed to Obama that halted the trip.  Carson told The Associated Press:", "\"Donald had really done his homework on this and found an old executive order written by Kennedy that forbids US officials from traveling to state funerals of dictators who denounce this great country. Castro held onto his hatred for America until the day he died and now he can rot in hell with it. Donald told Obama that if he went to the funeral he’d be in violation and would be locked up come January 21st. If he rescinded the order he’d be telling Americans he thought it was OK to send dignitaries to the funerals of terrorists.\"", "The site employed a common fake news tactic in linking to the Associated Press web site, not a specific article. Not only did no such article exist on the Associated Press web site or of any other credible news source, but The Resistance's disclaimer described its content as \"total baloney\":", "DISCLAIMER: The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney.", "TheLastLineOfDefense.org only publishes hoax stories that are calculated for maximal outrage clicks and shares. Other hoaxes that have emerged from this particular web site included claims that Beyoncé stormed offstage after Hillary Clinton hurled racial epithets at her, that vans full of undocumented people were driven from polling place to polling place to vote over and over again, and that Lady Gaga was arrested for negative tweets about Melania Trump.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]