["Medicare figured prominently in the first debate between President Barack Obama and Republican nominee Mitt Romney.\n\nThe cost of the popular government health care program for seniors is growing rapidly and broadly believed to be unsustainable. Throughout the campaign, the candidates have been accusing each other of endangering the program, or not doing enough to maintain it.\n\nRomney raised a charge we’ve heard before, that \"on Medicare for current retirees, (Obama) is cutting $716 billion from the program.\"\n\nWhat Obamacare does\n\nThe cut Romney spoke of refers to an aspect of the Affordable Care Act, known as Obamacare.\n\nObamacare does not literally cut funding from the Medicare program’s budget. Rather, the health care law instituted a number of changes to try to bring down future health care costs in the program.\n\nThe spending reductions were mainly aimed at insurance companies and hospitals, not beneficiaries. The law made significant reductions to Medicare Advantage, a subset of Medicare plans run by private insurers. Medicare Advantage was started under President George W. Bush, and the idea was that competition among the private insurers would reduce costs. But the plans have actually cost more than traditional Medicare. So the health care law scales back the payments to private insurers.\n\nHospitals, too, will be paid less if they have too many re-admissions, or if they fail to meet other new benchmarks for patient care.\n   \nThe overall Medicare budget is projected to go up for the foreseeable future, even with the health care law’s cost-saving measures. The law tries to limit the program’s growth, though, making it less than it would have been without the law, but not reducing its overall budget. So claims that Obama would \"cut\" Medicare need more explanation to be fully accurate. In the past, we’ve rated similar statements Half True or Mostly False, depending on the wording and context.\n   \n$716 billion\n       \nIn 2011, the CBO determined that the federal health care law would reduce Medicare outlays by $507 billion between 2012 and 2021. In a more recent estimate released this year, the CBO looked at the years 2013 to 2022 and determined the health care law affected Medicare outlays by $716 billion.\n       \nSo it’s timing that’s making the cuts bigger, not changes to Medicare. And the cuts are from future spending, not the program’s current budget.\n\nOur ruling\n   \nRomney said, \"on Medicare for current retirees, (Obama) is cutting $716 billion from the program.\"\n\nThat amount -- $716 billion -- refers to Obamacare’s reductions in Medicare spending over 10 years, primarily paid to insurers and hospitals. But the statement gives the impression that the law takes money already allocated to Medicare away from current recipients.\n   \nWe rate his statement Half True.", "PolitiFact, \"Romney says Obama 'cuts' $716B from Medicare to pay for Obamacare,\" Aug. 20, 2012\n\n10 News, interview with Mitt Romney, Aug. 15, 2012\n   \nCongressional Budget Office, Letter to the Honorable John Boehner providing an estimate for H.R. 6079, the Repeal of Obamacare Act, July 24, 2012\n           \nCongressional Budget Office, CBO's Analysis of the Major Health Care Legislation Enacted in March 2010, March 30, 2011\n           \nCongressional Budget Office, H.R. 2, Repealing the Job-Killing Health Care Law Act, February 18, 2011\n           \nCongressional Budget Office, The Long-Term Budgetary Impact of Paths for Federal Revenues and Spending Specified by Chairman Ryan, March 20, 2012\n           \nPolitiFact, \"Medicare 'cuts' in the health care law will hurt seniors, says 60 Plus Association,\" Sept. 20, 2010\n   \nThe Kaiser Family Foundation, Health Reform and Medicare: Overview of Key Provisions, July 2010\n\nPolitiFact, \"$500 billion from Medicare for Obamacare, Mitt Romney says,\" June 16, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]