["Information recieved through RTI reveals that, on an average, Rs 80 lacs are paid to the beautician each month for make up of our PM.", "Posted by Sunil Dsouza on Monday, 6 May 2019", "This clip was also shared earlier this month by the official page of Gurugram Congress.", "ये है गरीब का बेटा,मेकअप करा रहा है। आरटीआई के जरिए खुलासा हुआ है कि इसके श्रृंगार के लिए ब्यूटीशियन को 80 लाख रुपए प्रतिमाह भुगतान किया जाता है।", "Posted by Gurugram Congress on Saturday, 4 May 2019", "The video is massively viral on Facebook in both English and Hindi.", "A similarly-worded claim was also circulated in 2018. However, instead of a clip video, photographs of the PM at the same event were used.", "15 लाख रुपये महीने की पगार पर रखी गई मेकअप आर्टिस्ट के हाथों मेकअप कराकर सजधज कर रोने को निकलते नौटंकीबाज।", "Posted by Aditya Chaturvedi on Monday, 22 October 2018", "The clip used to propagate that the Prime Minister spent Rs 80 lakh on beauticians has been picked up from the video showing the making of PM Modi’s wax statue in Madame Tussauds, Singapore. The clues are hidden in the video itself.", "At about 8 seconds into the video, a paper reads out – ‘Madame Tussauds Body Measurement.’", "The video of the making of PM Modi’s wax statue was uploaded in 2016. The claim that beauticians were applying make-up on the PM is false as Madame Tussauds employees can be seen taking his body measurements.", "Moreover, no such RTI revealing that PM Modi spends Rs 80 lakh a month on beauticians was found in media reports. The social media claims are, therefore, false.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]