["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker winks at the crowd after signing the 2013-'15 state budget.", "Gov. Scott Walker opposes increasing the federal minimum wage, fearing it would prompt employers to do less hiring.", "In making his case, Walker paints a picture of low-wage workers as people working the counter at fast-food restaurants.", "\"I started out, just like Paul Ryan did down the road from me, working at McDonald's,\" Walker told Chuck Todd on MSNBC’s \"The Daily Rundown\" on Jan. 6, 2013.", "He added: \"Jobs that involve the minimum wage are overwhelmingly jobs for young people starting out in the workforce. The last thing you want to do is have fewer young people (working) at a time when unemployment rates are still way too high for teenagers going into their 20s.\"", "Walker’s characterization of the low-wage population touches on a critical element of the debate over raising the national wage, which stands at $7.25 an hour.", "Just who is making the minimum wage? Neither side can seem to agree on the makeup of those on the bottom end of the earning scale.", "Is Walker right that \"jobs that involve the minimum wage are overwhelmingly jobs for young people starting out in the workforce\"?", "His statement is in the context of calls for a higher national minimum wage, so we’ll focus primarily on the national view rather than on individual states, 21 of which have higher minimums than the federal standard.", "Nationally, 4.7 percent of hourly workers toil for $7.25 an hour or less (It can be less due to various exemptions in labor law, such as for employees who receive tips and others. Plus, many people making the minimum round it down to $7 when responding to the survey).", "That’s about 3.6 million people 16 or older, based on conservative estimates drawn from the monthly Current Population Survey conducted by the U.S. Census Bureau for the Bureau of Labor Statistics. Labor market researchers frequently cite the survey.", "Of that total, 1.6 million report being right at the federal minimum wage -- 2.1% of the hourly workforce.", "The  BLS includes both groups -- those at the wage mark, and those below it -- in its statistical reports on minimum wage workers.", "Tips, commissions and overtime pay are not included in the pay data. Salaried workers are not part of the mix.", "Women, residents of the south, never-married workers, part-timers and service employees are more likely than their counterparts to work for $7.25 or less. Restaurant and other food service workers make up the biggest group.", "Teenagers overall are more likely than other age groups to work for the minimum, but even in that group nearly 80 percent of the teens earned more than $7.25.", "Here are the labor bureau’s findings on age:", "-- \"Minimum wage workers tend to be young,\" the labor bureau said in a February 2013 report that looked at numbers for 2012. \"Although workers under age 25 represented only about one-fifth of hourly paid workers, they made up about half of those paid the federal minimum wage or less.\"", "--Teenagers (16 to 19) make up about one-quarter (24.1 percent) of hourly paid workers making $7.25 or less, or 31 percent of those right at the minimum wage.", "Age range of worker", "Breakdown of workers at minimum or less", "Breakdown of workers at exactly minimum wage", "16 to 19 years old", "24.1 percent", "30.9 percent", "20 to 24", "26.5", "24.1", "25 to 34", "20.3", "15.5", "35 to 44", "10.9", "9.8", "45 to 54", "10.4", "10.5", "55 to 64", "5.4", "6.4", "65 to 69", "1.4", "1.6", "70 and over", "1.1", "1.2", "So how do the facts square with Walker’s comment that \"jobs that involve the minimum wage are overwhelmingly jobs for young people starting out in the workforce.\"", "He refers generally to \"young people\" and then later refines that to \"teenagers\" new to the workforce.", "So let’s look at both.", "Teenagers, as noted in the chart, make up 24 percent to 31 percent of the low-wage set, depending the measure. That group appears to best fit Walker’s description of \"people starting out in the workforce.\"", "But some college-age youths are new to the workforce as well, and the labor bureau calls the 16 to 24 group \"young\" people in its analysis.", "That 16 to 24 set makes up more than half of hourly federal minimum wage workers -- 51 to 55 percent, again depending on whether you look at those exactly at the wage, or include those below it as well.", "Walker said the low-wage group is \"overwhelmingly\" young people, and mentioned teenagers.", "That strikes us as overstated given that workers older than 24 make up 45 percent to 49 percent of federal minimum wage workers. Teenagers are less than one-third of the overall low-wage group.", "But there’s no strict numerical definition of \"overwhelming\", so we asked two experts for their opinion.", "Mark Calabria, an economist at the libertarian Cato Institute, told us that Walker has a numerical point, though describes it incorrectly. \"Overwhelming\" implies more than a majority, he said.", "\"Disproportionately\" was a more apt description, given that such a large share of those low-wage jobs are held by young people who make up a small share of the hourly worker pool, said Calabria, a former senior staffer on the U.S. Senate Committee on Banking, Housing and Urban Affairs.", "Walker spokesman Tom Evenson made the disproportionality argument to back up the governor’s statement. Among other numbers, he highlighted the fact that those 16-24 hold an estimated 55 percent share of jobs right at the federal minimum wage.", "David Cooper, an economic analyst and minimum wage researcher at the liberal Economic Policy Institute, didn’t dispute the numbers, but said \"overwhelmingly\" was off the mark.", "Cooper also argued that the focus on the national minimum wage provided a misleading demographic profile of low-wage workers. Many work for more than $7.25, and therefore are not counted as minimum-wage workers by the labor bureau, but earn the minimums set by their state, he noted.", "The average age of minimum wage workers goes up under this broader view, said Cooper. EPI supports increasing the national minimum wage. Some Democrats and President Barack Obama are pushing for a $10.10 minimum.", "Our rating", "On cable TV’s MSNBC, Walker said \"Jobs that involve the minimum wage are overwhelmingly jobs for young people starting out in the workforce.\"", "The best estimates are that 24 percent to 55 percent of such jobs are held by teenagers and young adults.", "That’s a lot, and from a relatively small component of the overall hourly-wage workforce, but his use of \"overwhelming\" strong suggests that a very large majority of those jobs are held by young people.", "They are not.", "We rate his claim False.", "The Daily Rundown with Chuck Todd, MSNBC, video, Scott Walker appearance, Jan. 6, 2014", "Interview with Mark Calabria, director of financial regulation studies at the Cato Institute, Jan. 8, 2014", "Interview with David Cooper, economic analyst, Economic Policy Institute, Jan. 8, 2014", "Email and phone interview with James Sherk, senior policy analyst in labor economics, Heritage Foundation, Jan. 10, 2014", "Email exchange with Tom Evenson, press secretary, Office of Gov. Scott Walker, Jan. 9, 2014", "Cato Institute, \"Who Works at the Minimum Wage,\" by Mark Calabria, July 31, 2013", "Economic Policy Institute, \"Raising the Minimum Wage to $10.10 Would Lift Wages for Millions and Provide a Modest Economic Boost,\" updated Dec. 19, 2013", "Email exchange with The Heritage Foundation regarding work on minimum wage issue by James Sherk, Senior Policy Analyst in Labor Economics in the Center for Data Analysis at The Heritage Foundation. Jan. 7, 2014", "US Department of Labor, \"Minimum Wage Laws in the States, January 1, 2014.\"", "The Heritage Foundation, \"Who Earns the Minimum Wage? Suburban Teenagers, not Single Parents,\" by James Sherk, Feb. 28, 2013", "Bureau of Labor Statistics, \"Characteristics of Minimum Wage Workers, 2012,\" Tables 1-10, and briefing paper, accessed Jan. 8, 2014", "Pew Research Center, \"Who Makes Minimum Wage?\" July 19, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]