["By Eugene Kiely", "Posted on July 17, 2016", "Donald Trump introduced Indiana Gov. Mike Pence as his running mate July 16, but, in doing so, oversold Indiana’s economic performance under Pence:", "As the presumptive Republican presidential nominee, Trump introduced his running mate to voters at a July 16 campaign event in New York. Pence has been Indiana’s governor since Jan. 14, 2013, and the economy in Indiana, and elsewhere in the country, has improved since then, as the country slowly recovered from the Great Recession, which lasted from December 2007 to June 2009.", "At the event, Trump read from a list of Indiana’s economic statistics, which his campaign later emailed to the media. (He starts speaking about Pence at 20 minutes into the C-Span video.) The statistics he cited were accurate. But, in some cases, the businessman embellished the stats with his commentary.", "Trump said the “primary reason” for selecting Pence was the decline in his state’s unemployment rate, which Trump said dropped to “less than 5 percent” this year. That’s close to accurate. As of May, the state’s rate was 5 percent — down from 8.4 percent in January 2013, when Pence became governor, as Trump said. That’s a drop of 3.4 percentage points, according to the U.S. Bureau of Labor Statistics.", "However, Indiana’s unemployment rate has roughly tracked the national average. During that same time, the national unemployment rate declined from 8 percent to 4.7 percent — a drop of 3.3 percentage points, according to BLS.", "Trump also praised Pence for adding private sector jobs. “Private sector job growth is up by more than 147,000 jobs since 2013,” Trump said. “That’s, like, very unusual.”", "It’s not unusual at all.", "Indiana has added 147,800 jobs since 2013, according to BLS. But 18 other states added more jobs. Predictably, larger states such as California (1.3 million) and Texas (840,000) had larger gains, but so did states with smaller populations, such as South Carolina (152,000) and Oregon (157,000).", "More importantly, Indiana’s private-sector job growth rate — the percent change in the state’s number of private-sector jobs — lagged behind 20 states and the District of Columbia, according to our analysis of BLS data.", "Indiana’s job growth rate was 5.9 percent. Florida led the way with a 12.7 percent increase, followed by Utah (12.4 percent) and Oregon (11.5 percent).", "Trump also praised Pence for balancing the state budget, suggesting that it was unusual. But it is not at all unusual at the state level because of constitutional and legal requirements.", "Trump, July 16: Governor Pence balanced the budget — can you imagine a balanced budget? Our budget is so out of whack in this country we don’t know what we are doing. We’re going to owe very soon $21 trillion dollars. He balanced the budget. They don’t know what that means.", "Like nearly all states, Indiana is legally required to balance the budget. “All the states except Vermont have a legal requirement of a balanced budget,” according to the National Conference of State Legislatures.", "Trump also touted Indiana’s bond rating. “It’s also rated triple A — their bonds, are rated triple A. Very few states have that,” Trump said.", "Indiana does have a AAA bond rating, but that has been the case since July 18, 2008, according to Standard & Poor’s latest “History of U.S. State Ratings.” That’s nearly five years before Pence took office.", "As of July 11, 2016, 14 other states currently have AAA ratings, so Trump exaggerates when he says that “very few states have that.” They are: Delaware, Florida, Georgia, Iowa, Maryland, Missouri, Nebraska, North Carolina, South Dakota, Tennessee, Texas, Utah, Virginia and Wyoming. That’s nearly one third of all states.", "Trump correctly said that Indiana’s labor force has increased by more than 186,000 people under Pence. But then he suggested that it was unusual for a state to see an increase in its labor force, based on his experience campaigning in other states.", "Trump, July 16: Since January 2013, Indiana’s labor force has increased by more than 186,000 jobs. You have to understand I’ve gone around to all these states — I’ve gone to all of them — and every time I have statisticians, and I say, “Give me the stats on a state,” and it’s always bad. Down, down, down. Down 40 percent, 50 percent, 60 percent in some cases. Here’s somebody where it’s gone up.", "Indiana has seen an above average increase in its labor force. The addition of 186,527 people in the state’s labor force since January 2013 represents a 5.9 percent increase, according to BLS. Our analysis shows that only six states and the District of Columbia have seen greater growth rates, with Delaware (8.9 percent) leading the way.", "However, to imply that no other state has seen an increase — or that they have seen steep decreases — is wrong.", "A total of 41 states and the District of Columbia have all seen increases in their labor force. Nine states have seen decreases. They are Virginia, New Mexico, Rhode Island, Alaska, Vermont, Wyoming, West Virginia, Maine and Kentucky.", "Trump is hardly the first to overstate economic achievements. We have written numerous such stories over the years. He is just the latest to do so.", "https://www.sharethefacts.co/share/5137a5c6-73e3-4c9a-ae1c-6b3695619494", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]