["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Thursday, April 2, 2020, in Washington, as White House adviser Jared Kushner listens. (AP)", "• Jared Kushner, President Donald Trump’s son-in-law and adviser, has not posted tweets on his account since 2016.", "• Kushner did not delete tweets after the news broke about Trump’s tax history.", "Recent revelations about President Donald Trump’s tax history sparked misinformation about the online activity of his son-in-law, Jared Kushner.", "One Facebook post claims Kushner, Trump’s senior adviser, deleted all of his tweets after the New York Times published its investigation of the president’s tax returns on Sept. 27.", "\"Shoutout to Jared Kushner who deleted all of his tweets after the tax story broke,\" the post reads. \"Genius. No way anyone has copies of that s---.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim is wrong. PolitiFact searched archived versions of Kushner’s Twitter profile to determine that he hasn’t had tweets on his account in many years. There were no tweets to delete.", "According to Kushner’s verified Twitter profile, he joined the site in April 2009 and he currently has \"0 Tweets.\"", "This is consistent with archived versions of Kushner’s Twitter profile from years past.", "One of the earliest archived versions of Kushner’s profile from April 5, 2011, shows that he had tweeted three times, mostly about his decision to join Twitter. In March 2014, those were still the only tweets on Kushner’s profile.", "By Oct. 18, 2016, those tweets were deleted.\"@jaredkushner hasn't tweeted yet,\" the archived Twitter profile reads.", "Another version of the profile archived on the website archive.today confirms Kushner had no tweets on his account as of Jan. 10, 2017, more than a week before Trump took office.", "Similarly, as of Aug. 17, 2020 — a little more than a month before the New York Times investigation brought Trump’s tax history back into the spotlight on Sept. 27 — Kushner still had no tweets on his account.", "\"@jaredkushner hasn’t Tweeted,\" the archived Twitter profile reads. \"When they do, their Tweets will show up here.\"", "We rate this claim False.", "Facebook post, Sept. 27, 2020", "New York Times, \"Long-concealed Records Show Trump’s Chronic Losses And Years Of Tax Avoidance,\" Sept. 27, 2020", "Web Archive, Jared Kushner’s Twitter profile, April 5, 2011", "Web Archive, Jared Kushner’s Twitter profile, March 5, 2014", "Web Archive, Jared Kushner’s Twitter profile, Oct. 18, 2016", "Archive.today, Jared Kushner’s Twitter profile, Jan. 10, 2017", "Archive.today, Jared Kushner’s Twitter profile, Aug. 17, 2020", "Snopes.com, \"Did Jared Kushner Delete Tweets After News Surfaced About Trump’s Taxes?\" Sept. 28, 2020", "Lead Stories, \"Fact Check: Jared Kushner Did NOT Delete Tweets After Story Broke Exposing Trump's Lack of Tax Payments,\" Sept. 28, 2020", "Associated Press, \"Jared Kusher didn’t delete all his tweets after Trump tax story,\" Sept. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]