["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Liberals Are Cool recently put out this meme about alleged draft dodgers", "It’s a Vietnam-era insult that still stings in 2013.", "Draft dodger – the term conjures up images of Americans unwilling to serve their country and sneaking off to Canada to avoid being drafted for military service.", "A group called Liberals Are Cool applied that term in an Internet meme - an idea or concept shared via social media - to six well-known Republicans – Mitt Romney, Donald Trump, Dick Cheney, Ted Nugent, Rush Limbaugh and Bill O’Reilly.", "\"Q: What do these ‘Patriotic Americans’ have in common? A: They are all Draft Dodgers,\" according to the meme received March 17 by PolitiFact New Jersey.", "Draft dodging is a serious accusation, but in Liberals Are Cool’s case, theirs lacks any shred of accuracy.", "Let’s explain how the draft worked during the Vietnam era, which the Selective Service System defines as August 1964 through December 1972.", "Men who received a draft notice in the mail had about three weeks to return paperwork requesting a hearing for a deferment, Selective Service System spokesman Pat Schuback said. A local draft board then decided whether to grant the waiver.", "\"For the Vietnam war and World War II, any time there was a draft, there were classifications of deferments,\" Schuback said. \"If you were eligible for it, you were entitled to claim that deferment.\"", "That’s what happened to the men targeted by Liberals are Cool, according to military classification histories that the Selective Service System shared with us, as well as other public records and published reports.", "The six each applied for and received education deferments because they were students when their names came up for military service.", "Romney also received a religious deferment during the time he was doing Mormon missionary work.", "Romney and Trump also had very high draft numbers, meaning that although they were eligible for military service, their numbers were never called. The first draft lottery for Vietnam occurred on Dec. 1, 1969.", "Cheney received an additional deferment when he became a father. A federal law at the time exempted a parent from military service for reasons of \"extreme hardship on dependents.\"", "Schuback didn’t have Nugent’s and O’Reilly’s classification histories available but numerous published reports – including ones from Snopes.com and TheSmokingGun.com indicate that both received education deferments. Both websites use public documents for fact-checking.", "Limbaugh and Nugent were ultimately disqualified from service for medical reasons, according to Snopes.com and TheSmokingGun.com.", "Education deferments were not unusual, Schuback noted. In fact, millions of Americans received them.", "During the Vietnam era there were 26,800,000 men in the United States. Of those, 2,215,000 were drafted. The number of deferments during that time was 1,541,000 – more than 50 percent of the population eligible for military service, according to the book \"I Want You! The Evolution of the All-Volunteer Force,\" by Bernard D. Rostker that was put out by the RAND Corporation.", "So what is a ‘draft dodger’? It’s not someone who received a legitimate and legal deferment from military service, Schuback said.", "\"A draft dodger is someone who got drafted and has then fled, or it also might be a person who made a statement by not registering (for the draft),\" he explained.", "\"I’m not a draft dodger,\" Schuback added, citing himself as an example. \"I got a deferment because I was pursuing a college degree. Calling that a draft dodger is not correct. They can use it a different way but it’s not correct.\"", "Liberals Are Cool did not respond to our request for comment.", "Our ruling", "A Liberals Are Cool meme claims \"Q: What do these ‘Patriotic Americans’ have in common? A: They are all Draft Dodgers,\" referring to Romney, Trump, Cheney, Limbaugh, Nugent and O’Reilly.", "Liberals Are Cool doesn’t acknowledge that the six registered properly for the draft, then applied for and received legal deferments so they could complete their education – an opportunity given more than half the men eligible for the U.S. draft during the Vietnam era.", "Liberals Are Cool may not like that these men didn’t face combat, but calling them ‘draft dodgers’ is wrong – and ridiculous. As a result, we’re cranking up the heat for this ruling: Pants on Fire!", "To comment on this story, go to NJ.com.", "To see a list of military classification codes from the U.S. Selective Service System, and the military classification histories for Romney, Trump, Cheney and Limbaugh, click here.", "Internet meme, \"Q: What do these ‘Patriotic Americans’ have in common? A: They are all Draft Dodgers,\" March 17, 2013", "LiberalsAreCool.com, accessed March 19 and 20, 2013", "Phone interviews with Pat Schuback, spokesman, Selective Service System, March 19 and 20, 2013", "Review of Military Classification History for Willard Mitt Romney, Donald J. Trump, Rush Hudson Limbaugh III and Richard Bruce Cheney, Selective Service System, accessed March 19 and 20, 2013", "Selective Service System Classifications 1948-1976, accessed March 19 and 20, 2013", "\"I Want You! The Evolution of the All-Volunteer Force,\" Bernard D. Rostker via the RAND Corporation, accessed March 20 and 21, 2013", "RAND.org, accessed March 21, 2013", "National Archives and Records Administration website, accessed March 21, 2013", "TheSmokingGun.com, Gun Enthusiast Ted Nugent Wasn’t Anxious To Bear Arms Against Those Pesky Vietcong, Feb. 12, 2013, accessed March 20, 2013", "Slate.com, Elizabeth Cheney, Deferment Baby: How Dick Cheney dodged the Vietnam draft, March 18, 2004, accessed March 20, 2013", "Snopes.com, Mitt Romney: I Was Too Important To Go To Vietnam, Aug. 21, 2012, accessed March 20, 2013", "Snopes.com, Ted Nugent Dodged The Draft? April 2012, accessed March 20 and 21, 2013", "TheSmokingGun.com, Deferments Helped Trump Dodge Vietnam, April 28, 2011, accessed March 20 and 21, 2013", "Selective Service System Extract Of Registrant Classification Record for Theodore Anthony Nugent, via TheSmokingGun.com, accessed March 21, 2013", "NNDB.com, Draft Deferment: Vietnam, accessed March 21, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]