["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "We've come across a number of \"doomsday asteroid\" rumors over the years. These claims typically stem from fearmongering headlines that make NASA's observations appear scarier than they actually are.", "In early March 2020, for instance, tabloids published articles claiming that NASA had issued a warning about a large asteroid approaching Earth that could, it if hit, end civilization. These articles referenced a real asteroid, but they misrepresented NASA's observations as a \"warning\" and failed to mention in headlines how the space agency's data showed the asteroid passing Earth at a safe distance of a nearly 4 million miles (16 times farther than the moon).", "In March 2020, we came across a fresh variation of this formula. This time, a viral Facebook post claimed that NASA and the Vatican Observatory were hiding the discovery of a doomsday asteroid, and world leaders had implemented a \"scapegoat\" virus — the coronavirus, which causes COVID-19 — in order to distract the global population from their imminent demise and force people to spend more time with family as they sheltered in place:", "The World Deserves the Truth.... Please brace yourself for the following information I'm about to share with you. It's not going to be easy to understand or cope with and I'm sure many will reject the truth entirely, but I can no longer keep this classified information from the public, so do with it what you will.", "In the first week of November 2019, NASA and the Vatican Observatory both discovered and confirmed a fast approaching comet that is so extremely large that a collision with earth on its current path is inevitable. On November 9th 2019, the United Nations held a secret meeting with world leaders to develop an \"exist strategy\" to make everyone as comfortable as possible for what scientists have carefully calculated and confirmed as the apocalypse in the months to follow.", "The plan would implement a scapegoat virus (COVID-19) which will cause flu like symptoms, spread easily/fast, distract from the truth, and force a worldwide quarantine with the sole purpose of initiating home time to be spent with family, while minimizing the overall panic, anarchy, and premature mass casualties that would otherwise take over with public knowledge / foresight of the apocalypse.", "Unfortunately we are not talking about an obstacle we will have the ability to overcome, this comet will bring with it death and extinction of every living organism we know to exist, a complete global annihilation from which there will be no survivors or Earth as we know it. Understandably the UN doesn't want to create a global panic, however I truly believe that everyone should have the right to know, and deserves a chance to accept this truth.", "The details of this information will all be confirmed in the weeks leading up to the end, watch as the global elites step down from their positions by the masses, they will be doing exactly what they want you to do, which is spend time at home with family and be at peace.", "These are certainly scary times, but it is my hope that we as a civilization can be responsible with this information, and come together to enjoy what brief moments we have left on this beautiful planet. With love, peace, and blessings to all humanity, your brother/friend and recently retired CIA agent, Scott W.", "This post, in a word, is nonsense. But let's take a closer look at some of its logical flaws:", "The gist of the post is that world leaders released a \"scapegoat virus\" in order to distract people around the world from their imminent death-by-asteroid. In addition to providing a diversion, this virus also allowed world leaders to announce a global quarantine and force people to stay at home with their families, according to the post.", "But that isn't what happened. World leaders did not come together to announce in one voice that everyone should stay home and spend time with family. Rather, the response to the spread of COVID-19 has differed from one country to the next. In the United States, even, some cities and states are currently under shelter-in-place orders, but others are not. If the goal was to make people spend more time with family before the apocalypse, wouldn't these self-quarantine orders be more uniform?", "Messaging from the United States government also appears to fly in the face of this rumor. President Donald Trump recently said that he wanted people to get back to work by mid-April, which would, of course, be a futile exercise if he knew the world was truly coming to an end. Trump was also downplaying the seriousness of this disease in early 2020, behavior which would have contradicted decisions made at some alleged \"secret meeting\" of world leaders in November 2019.", "If the plan was to force people to spend more time with family, a \"scapegoat virus\" may not have been the best tactic. Not all families live together under the same roof, or even in the same country. Travel restrictions put in place to help slow the spread of COVID-19 could prevent people from seeing family members for indefinite periods of time. Also, government agencies worldwide have encouraged social distancing, which has left many elderly people separated from families, as the Brooks family tried to demonstrate here:", "Again, if this secret plan was designed to force families to spend time together, a \"scapegoat virus\" may have caused more problems than this post alleges it solves. Hundreds of thousands of people have been diagnosed with COVID-19 and that has caused medical personnel to work overtime. Because they are at risk for contracting the disease, some doctors are practicing social distancing from their own families.", "While the COVID-19 pandemic has shut down many businesses, such as restaurants and bars, \"essential services\" are still operating. Delivery drivers, grocery store employees, warehouse workers, etc., are all people with families, too.", "From what we can tell, world leaders did not convene at the United Nations on this date to discuss the release of a \"scapegoat virus\" in order to distract attention from a doomsday asteroid. Trump, for instance, attended a college football game in Louisiana on this date, while German Chancellor Angela Merkel was commemorating the fall of the Berlin wall.", "While, theoretically, this \"secret meeting\" could have happened via teleconference, we are highly skeptical of the notion that leaders from the 193 sovereign states that are members of the United Nations would have unanimously agreed over the course of a single meeting to let a potentially deadly virus loose in order to distract the world from an asteroid.", "Central to the post's bogus claim is the assumption that COVID-19 was human-made. But this idea has been repeatedly debunked by scientists studying the disease. Put simply, COVID-19 was not made in a laboratory.", "Live Science writes: \"No evidence suggests that the virus is man-made. SARS-CoV-2 closely resembles two other coronaviruses that have triggered outbreaks in recent decades, SARS-CoV and MERS-CoV, and all three viruses seem to have originated in bats. In short, the characteristics of SARS-CoV-2 fall in line with what we know about other naturally occurring coronaviruses that made the jump from animals to people.\"", "And again, for reasons mentioned above, manufacturing a pandemic does not seem like the ideal way to get people to spend more time among family.", "This post originated with Facebook user \"Scott W\" whose profile seems to have been deleted in the days after he posted this message. The only biographical information we can glean from this post is that \"Scott W\" claims to be a retired CIA agent. It sounds like an authoritative title, but ask yourself: Why would a retired CIA agent be privy to this \"secret\" plan?", "Furthermore, if this was truly a retired CIA agent who wanted to expose a hidden \"truth\" about the apocalypse, why would he do so on an anonymous, unverified Facebook page? Why wouldn't he provide some sort of evidence to show that his was an accurate account? If \"the world deserves the truth,\" this \"CIA agent\" did a terrible job of providing it.", "COVID-19 is a real disease that has already killed thousands of people and could potentially kill millions more if left unchecked. While appreciating your loved ones is certainly not bad advice (especially during times of crisis), the truth that the \"world deserves to know\" about this disease is that we're currently in the middle of a very real pandemic.", "Please keep yourself informed about COVID-19. If you have a question about the disease or a related matter, you can contact us here. You can also read previous Snopes fact-checks about the coronavirus here. The websites of the World Health Organization and the Centers for Disease Control and Prevention are also full of crucial information.", "But if hazardous asteroids are your main concern, review the NASA database tracking near-Earth Objects (NEO) here.", "CNN.   \"ER Doctor Self-Quarantining away From Wife and Kids.\"\r\n    17 March 2020.", "Wayland, Michael.   \"Trump Says Coronavirus Outbreak is ‘All Under Control’ and a 'Very Small Problem’ in US.\"\r\n    CNBC.   30 January 2020", "Liptak, Kevin; Vazquez, Maegan; Valencia, Nick; Acosta, Jim.   \"Trump Says He Wants the Country 'Opened Up and Just Raring to Go by Easter,' Despite Health Experts' Warnings.\"\r\n    CNN.   24 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]