["In early September, a Pakistani woman was raped in front of her two children after her car ran out of fuel near the eastern city of Lahore, prompting nationwide protests. Here is an AFP report on the case.", "Soon after, a short video of a woman speaking about the attack began circulating on Facebook, for example here, with an Urdu-language caption that translates as: “Woman who became a victim of rape on Lahore Ring Road made her statement viral.”", "Another Facebook post claims the footage is a “statement by the Gujranwala gang rape victim”. This Facebook post states the victim has “spoken about it publicly”.", "The video shows a woman saying: “On the 10th of September 2020, I was driving in Pakistan from Lahore to Gujranwala with my two children in my car. My car broke down on the highway, it ran out of fuel and I called the police for help. While I waited for the help to arrive, some men broke the windows of my car, dragged me and my children out of the car, dragged us to a field and gang raped me multiple times in front of my children. The rapists stole my jewellery, cash and bank cards. The lead police investigator Omar Sheikh blamed me for my gangrape because……..  I should not have been travelling alone without a male figure.", "“Except, this it not my story, but a story of another Pakistani woman and multiple countless Pakistani women who experience extreme sexual violence or blamed for it and are forced into silence while society continues to turn a blind eye to the everything that is going on.”", "The same video alongside a similar claim was shared here, here, here and here on Facebook; here, here and here on YouTube; and on here and here on Twitter.", "The clip has been shared in a misleading context.", "The woman speaking in the video is not the assault victim. A British woman named Anam Iqbal, who describes herself online as a human rights activist, originally posted the video here on her TikTok account in a bid to raise awareness about the Pakistani woman's case.", "Below is a screenshot of Iqbal’s TikTok post in desktop view:", "In response to the misleading posts about her video, Iqbal posted another video on TikTok here on September 13, 2020 to clarify that she was not the victim of the assult. She made the video to raise awareness about violence against women, she said.", "The text superimposed on the video reads: \"I am not the victim of the motorway incident. I was raising awareness on rape culture. Watch videos fullyyy and read articles properlyyyy before spreading misinformation.\"", "Below is a screenshot of her TikTok post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]