["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, the website everylegalvote.com was founded with the apparent goal of quantifying the impact of voter fraud on the U.S. presidential election. The centerpiece of this website is an electoral map that purports to show the results of the 2020 election as they stand now, how it looks when you factor in voter fraud, and how it looks when all voter fraud is removed. In the latter scenario, the website declares that U.S. President Donald Trump clearly won the election over his Democratic opponent, Joe Biden.", "Many of the claims made on this site are not tethered to reality. The map is nonsense and is based on extrapolations from unverified claims, debunked rumors, and unproven data.", "If you visit everylegalvote.com (a site McAfee's Webadviser software marked as \"suspicious\"), you can click the \"with voter fraud,\" \"current status,\" and \"without voter fraud\" tabs to change the results of the election. Pressing each button results in unusually precise changes to the data. In Arizona, for example, Biden's vote count changes from 1,648,642 \"with voter fraud\" to 1,591,641 \"without voter fraud.\" How did this website determine that there were 57,001 fraudulent votes in Arizona? It isn't really explained.", "The website makes some general claims about how it uses \"proven statistical methods\" to find anomalies in the data, but it's short on detail.", "The website states:", "The fraud disaggregation process uses a large amount of voter patterns and proven statistical methods to find and document mathematical anomalies indicative of voter fraud or ballot tampering.", "As we collect and analyze more data we will be able to demonstrate with increasing granularity the difference between an election without tampering and one with more anomalies, which are indicative of tampering", "Furthermore, this site states that it gets its data in part from \"fraud stories from every day Americans,\" but we found that many of the listed stories to be based on unfounded claims or debunked rumors. In Arizona, for example, the site lists five stories related to voter fraud. Two of those stories concern the debunked claim that ballots marked with Sharpies would be invalidated; one is just a tweet from Arizona Rep. Paul Gosar calling for a recount (Gosar's desire for a recount deals with debunked claims concerning Dominion Voting software), and another is a video that claims to show \"voter fraud caught on camera in Arizona\" but shows nothing of the sort. In fact, Arizona is barely mentioned in that video. As far as we can tell, Arizona is mentioned once regarding the debunked Sharpie claim and another time when the YouTube user suggests that ballots \"just appeared.\" But ballots didn't just \"appear\" in Arizona. The vote count changed as votes were counted.", "The one story listed in this section that is at least tied to reality deals with an influx of split-ticket votes. While there did appear to be an uptick in split-ticket voting this year (voting a split-ticket is when you vote for one party's president but vote for the other party for the other selections on your ballot), this is completely legal and is not indicative of fraud.", "Arizona Attorney General Mark Brnovich, a Republican, dismissed the notion of fraud in his state during an appearance on Fox News.", "Arizona Central reported:", "No conspiracy, just split-ticket voters", "“If indeed there was some great conspiracy, it apparently didn't work,” Brnovich told Fox Business’ Neil Cavuto on Wednesday. “The county election official, who's a Democrat, lost, and other Republicans won.”", "He was referring to Maricopa County Recorder Adrian Fontes, who is trailing Republican Stephen Richer by more than 3,000 votes.", "Some Republicans point to the fact that Trump and GOP Sen. Martha McSally lost while GOP candidates did well in down-ballot races as evidence of a conspiracy. Someone, they reason, must have changed those votes at the top of the ticket.", "Brnovich shot that one down.", "“It came down to: People split their ticket,” he told Cavuto. “People voted for Republicans down ballot, and they didn't vote for President Trump or Martha McSally. So, that's the reality.\"", "It's not clear how everylegalvote.com calculated that two hoaxes, a call for a recount, a misunderstanding of how election works, and an increase in split-ticket voting amounted to a 57,001 fraudulent vote swing for Biden.", "While the electoral map discussed above is the central feature of everylegalvote.com, this website also includes a \"voter fraud primer\" that briefly discusses the various ways voter fraud can supposedly be spotted. This section, however, is rife with false claims and misleading statements. We'll take a look at a few such claims below:", "Everylegalvote.com claims: Fraud is real. Fraud happens every day. In elections, fraud is a common issue.\nReality: Voter fraud is exceedingly rare.", "Study after study after study after study after study after study after study after study have concluded that voter fraud in the United States is rare. While testifying under oath before the U.S. Senate Homeland Security and Governmental Affairs Committee in September 2020, FBI Director Christopher Wray said: \"We have not seen, historically, any kind of coordinated national voter fraud effort in a major election, whether it’s by mail or otherwise.\"", "In the days following the 2020 general election, election officials in every state reported that they had not seen evidence of voter fraud.", "Everylegalvote.com claims: It is NOT normal to stop counting the ballots in the middle of a count. The evidentiary chain is broken (what if someone sneaks a pile of fraud ballots in at 3:30 a.m.?). In every presidential election in the U.S. until 2020, counts were never stopped until they were completed.\nReality: Vote counts have been stopped or slowed before (most notably the recount in 2000), and claims that the vote \"stopped\" in 2020 are exaggerated.", "There have been multiple claims that vote counts were stopped during the 2020 election, but the majority of these claims have either proven false or have been clarified with simple explanations. Trump claimed, for example, that the vote in North Carolina had been \"called off.\" But that's not the case. All of the available ballots in the state had been counted at that time and election officials were waiting for more legally cast mail-in ballots to arrive. In Philadelphia, there was some confusion after a reporter wrote that the state would not be reporting any more mail-in ballot numbers for the night, but city Commissioner Al Schmidt quickly clarified that, writing that \"Philadelphia will NOT stop counting ALL legitimate votes cast by eligible voters.\" A viral Facebook post claimed that voting stopped in six states during the 2020 election, but that claim was false.", "It should also be noted that Trump's campaign has filed numerous lawsuits asking for the vote count to be stopped (something that everylegalvote.com argues is only done by those attempting to commit fraud) and that Trump himself has posted messages on Twitter such as \"STOP THE COUNT!\"", "Everylegalvote.com claims: It is well established that [mail-in] voting is the easiest way to defraud a candidate. \nReality: Mail-in voting is slightly more prone to fraud than in person voting, but the risk for fraud in both forms of voting is still extremely low. We covered claims about an increased risk of mail-in voter fraud here.", "Everylegalvote.com claims: The Democrat vs. Republican ratio in each batch of [mail-in] ballots should be very uniform across a region or a state.\nReality: In the months leading up to the election, it was widely reported that Democrats were returning more mail-in ballots than Republicans.", "The COVID-19 pandemic caused a surge in mail-in voting as many people wanted to avoid waiting in long lines surrounded by people. While Democrats urged their supporters to vote by mail, Trump continually pushed false claims about mail-in votes. It's not surprising, in other words, that one party saw more voters use mail-in ballots.", "Everylegalvote.com claims: We dig deep into this here, where we show that many states, including Virginia, Wisconsin, Pennsylvania, Georgia, Michigan, Maine, and all show signs of ballot tampering and injections of Democrat ballots after the initial in-person votes have been counted.\nReality: This is not how elections work. Mail-in ballots are legal and are counted the same as in-person ballots.", "In most cases, mail-in votes are cast before election day. While states have different rules on when they can start counting votes, and while some states count in-person votes first, it simply is not accurate to say that that mail-in ballots were \"injected\" into the vote count.", "You can read an AFP Fact Check about this claim here.", "Everylegalvote.com claims: No Witnesses Allowed: Whenever one side tries to prevent the other side from watching ballots being opened or counted, it is a red flag. That side has something to hide. Fraud is the only thing that would be hidden from the opponent’s team in an election count. Democrat operatives prevented Republicans from observing the count in Pennsylvania, Georgia, Wisconsin, Michigan, Arizona, and Nevada.\nReality: Observers from both parties were allowed to watch the vote count.", "The claim that Republicans were prevented from observing the vote has been repeated in a variety of forms. A variety of news outlets and fact-checkers have investigated these claims and found them without merit. Judges, too, have dismissed lawsuits from the Trump campaign that made this allegation.", "PBS reported on one such lawsuit that had been filed in Philadelphia:", "A federal motion filed by lawyers for President Donald Trump’s campaign that sought to halt vote counting in Philadelphia has been dismissed as moot.", "The Thursday afternoon filing against the city’s election board sought an injunction to halt vote counting over allegations that observers from the Trump campaign had been unfairly barred from parts of the city’s ballot-counting area inside the Pennsylvania Convention Center.", "In an evening hearing, U.S. District Judge Paul Diamond said the campaign admitted that its observers had been allowed into the venue but that they had not been given equal access or numbers as Democrats.", "The federal judge seemed frustrated at times with arguments from the campaign.", "“I’m sorry, then what’s your problem?” said Diamond, a President George W. Bush appointee, after Trump lawyers conceded that observers had been admitted to the facility.", "Everylegalvote.com claims: Too many voters. When a political party is losing an election in the Third World, the party will pile on additional votes manufactured for its candidate. These always show up in the totals, which typically exceed the number of actual voters that exist in a precinct or county. There are numerous counties in the 2020 election with over 100% voters supposedly voting, and some states have astronomically high turnout percentages, such as Wisconsin.\nReality: Voter turnout was up in 2020, but no state saw \"over 100% voters.\"", "This is another claim that has come in many forms. We previously investigated two rumors claiming that voter turnout had exceeded 100%. In both cases, the rumor compared old voter registration data with current voter turnout data. Here are links to these articles.", "Everylegalvote.com claims: The Dominion Voting machines are known to be connected to the Internet, allowing for bad actors to change vote tallies in the machines as they report counted ballots for each candidate. These machines have already been caught changing votes to Biden from Trump in Michigan and Georgia and Philadelphia. Here is a video showing 19,958 votes taken from Trump and given to Biden at 10:23pm on election night.\nReality: Dominion Voting software is not changing votes. Election officials have already addressed these \"glitches\" (which in most cases were actually human errors that were quickly corrected) and these problems did not impact the vote count.", "There have been multiple claims about fraud concerning Dominion Voting Software, but, again, these claims have all proven baseless. You can read our write-up of these rumors here, or check out The New York Times' investigation. For the purposes of this article, we'll point readers to a statement from Christopher Krebs, the director of the U.S. cybersecurity and infrastructure security agency, who called these claims \"nonsense.\"", "Everylegalvote.com claims: \"Dead\" people vote. To determine who has voted, the registered voter data has to be processed. Many citizen journalists and citizens have checked the state databases and found dead parents, siblings, and people born as far back as the early 1800s registered for absentee ballots and with voted ballots tallied in the swing states.\nReality: Dead people, generally speaking, don't vote.", "The claim that dead people are voting tends to pop up every election, but these claims are almost always based on a misreading of the data. A lawsuit filed by the Trump campaign, for example, claimed that a dead person had voted in Michigan. Election officials in the state, however, found that this was really a case of mistaken identify.", "The local news outlet Bridge Michigan reported:", "\"Rather than a dead voter, though, it appears to be a case of mistaken identity caused by confusion over 'common names,' said Tracy Wimmer, a spokesperson for Michigan Secretary of State Jocelyn Benson's office.\"", "News outlets, fact-checkers, and election officials have debunked similar claims. A viral list of dead people who supposedly voted in Michigan, for instance, was found to be full of holes. CNN reported:", "Of the 50, 37 were indeed dead and had not voted, according to the voter information database. Five people out of the 50 had voted -- and they are all still alive, according to public records accessed by CNN. The remaining eight are also alive but didn't vote.", "While it isn't common for a vote to be cast in a dead person's name, this has happened before. Most often, this involves a spouse casting a vote for a deceased partner. It is possible that 2020 will see a few examples of this occurring, but this not indicative of widespread voter fraud.", "Everylegalvote.com claims: Witnesses this election have sworn they were ordered to back-date hundreds of ballots at the USPS, which is a crime.\nReality: A witness did swear that workers were ordered to back-date ballots. And then, under threat of perjury, he recanted his testimony.", "The Washington Post reported:", "Richard Hopkins’s claim that a postmaster in Erie, Pa., instructed postal workers to backdate ballots mailed after Election Day was cited by Sen. Lindsey O. Graham (R-S.C.) in a letter to the Justice Department calling for a federal investigation. Attorney General William P. Barr subsequently authorized federal prosecutors to open probes into credible allegations of voting irregularities and fraud before results are certified, a reversal of long-standing Justice Department policy.", "But on Monday, Hopkins, 32, told investigators from the U.S. Postal Service’s Office of Inspector General that the allegations were not true, and he signed an affidavit recanting his claims, according to officials who spoke on the condition of anonymity to describe an ongoing investigation. Democrats on the House Oversight Committee tweeted late Tuesday that the “whistleblower completely RECANTED.”", "Everylegalvote.com does not provide an accurate view of how voter fraud impacted the 2020 election. As of this writing, claims of voter fraud are largely unsubstantiated, making any claims that one candidate benefited from fraud while it served as a detriment to another to be, at best, premature.", "While the website presents itself as an educational resource for those seeking to learn about the impact of voter fraud, these \"lessons\" hinge on debunked rumors, hoaxes, and misleading claims.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]