["The claim was shared in this Facebook post published on March 15, 2021.", "An image in the post shows a cheque reading “PRESIDENT DONALD J. TRUMP”. A news ticker below reads “RELIEF BILL VOTE”, while the logo of US TV channel ABC News and text “#WORLDNEWSTONIGHT” is visible in the bottom-right corner.", "“Ummm… So who is current president of America ??? Stimulus cheques in the mail signed by PRESIDENT Donald J Trump,” the caption reads.", "The image was also shared on Facebook here and here, and on TikTok here.", "The post circulated after US President Joe Biden signed the American Rescue Plan Act into law on March 11, 2021, weeks after he announced the $1.9 trillion package to help families and small businesses struggling with the financial impact of the Covid-19 pandemic.", "The plan includes a third round of Economic Impact Payments of up to $1,400 per eligible person. This follows two previous payments during the pandemic issued under Trump in March and December 2020.", "Trump’s name appeared in the memo line of the cheques, as can be seen in these photographs on Getty Images.", "However, under the Biden administration, the cheques will be signed by an official from the US Treasury’s Bureau of the Fiscal Service, not by the president.", "White House press secretary Jen Psaki told reporters on March 9, 2021, that Biden’s name would not appear on these relief cheques.", "“We are doing everything in our power to expedite the payments and not delay them, which is why the President’s name will not appear on the memo line of this round of stimulus cheques. The cheques will be signed by a career official at the Bureau of Fiscal Service,” Psaki said.", "ABC News report", "Furthermore, the screenshot of a cheque bearing Trump’s signature circulating on social media has been taken out of context.", "A Google search of “relief bill vote ABC World News Tonight” led AFP to this report by ABC World News Tonight posted on Facebook on March 10, 2021.", "In the video, the same image of a cheque bearing Donald Trump’s name that is circulating on social media appears at 0:53.", "Narrating the report, ABC News’s chief White House correspondent Cecilia Vega explains, “We’re not going to see President Biden’s signature on those stimulus cheques, like we saw there -- you can see it -- with President Trump.”", "The image of the cheque used in the ABC News report matches this photo by Getty Images photographer Chip Somodevilla.", "The Internal Revenue Service said in a media release that it began processing payments on March 12, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]