["About this rating", "On 18 December 2017, the web site Huzlers leveraged news about the cryptocurrency Bitcoin spiking in value to falsely claim a man had swindled over million dollars from people by selling altered Chuck E. Cheese tokens as \"Bitcoins\":", "Marlon Jensen, 36, was arrested a Sunday morning when NYPD stormed his home. NYPD received calls from the fraud victims that someone had sold them “Bitcoins”, only to find out there actually was no tangible bitcoin currency available. NYPD found $1.1 Million of cash inside Marlons home. According to police, Marlon had scratched off most of the Chuck E. Cheese engravements on the coins, and would write “B” on each coin with permanent marker.", "“People are retarded haha”, said NYPD Officer Michael West, “My 8 year old son would know those weren’t bitcoins and lord knows he’s not the brightest”.", "Huzlers is a well-known purveyor of hoaxes typically based on popular topics, and as always, there was no truth to the claim. Aside from the fact that bitcoins are not an actual form of physical currency, Chuck E. Cheese retired their usage of tokens in 2016 and introduced cards in their stead.", "Huzlers features a disclaimer asserting that it is \"the most infamous fauxtire & satire entertainment website in the world ... [i]f it's trending on social media you'll find it here!\" The fake news outfit previously sucked up social media views with fictitious tales about 15 consecutive days of darkness, cocaine in Coors Light beer, and, more recently, a tall tale about a famous bullied child being robbed of GoFundMe donations.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]