["About this rating", "On 9 January 2017, TheSeattleTribune.com published an article reporting that a former Army sniper saved a family in an adjacent house from violent home intruders:", "According to Elmore, he wasn’t quite ready to go to sleep when he retired to his bedroom around 1:15 AM- so he decided to engage in one of his favorite activities – breaking down and cleaning one of his firearms. The firearm that Elmore decided to break down and clean was his M24 Sniper Riffle (officially referred to as the M24 Sniper Weapon System).", "At approximately 1:50 AM – after cleaning and reassembling the rifle, Elmore rested it on the sill of his bedroom window to adjust its scope. While adjusting the scope it unintentionally landed on one of his neighbor across the street’s open windows; Elmore told police and reporters that he was amazed at what he saw happening inside ... What Elmore saw through the high-powered scope on his riffle was – his neighbors, Fredrick and Lydia Cole tied to chairs in their upstairs family-room. The couple’s 2-children Douglas (11-years-old) and Daniel (6-years-old) were sitting near their mother – also tied to kitchen-style chairs ... According to Elmore, while waiting for the police to arrive things continue to escalate rapidly at the Cole residence and he was greatly concerned for the family’s safety. Elmore told reporters that his military training and instinct kicked in and he knew that he had to do something to intervene.", "In the body of the article, a screenshot of a purported Facebook post attributed to \"Fredrick Cole\" appeared:", "The photograph appeared to be a stock image. The header image was also an old stock photograph of a man with a gun, and no images of any of the involved parties were included (probably because they never existed).", "While the Seattle Tribune initially looks like the digital counterpart to a major city newspaper, it is just one of several fake news sites (including the Boston Tribune and the Baltimore Gazette) working the same local news angle to rack up shares and ad revenue. TheSeattleTribune.com is a newer platform for the fake news purveyor Associated Media Coverage:", "A standard fake news disclaimer stated:", "The Seattle Tribune is a news and entertainment satire web publication. The Seattle Tribune may or may not use real names, often in semi-real or mostly fictitious ways. All news articles contained within The Seattle Tribune are fictional and presumably satirical news – with the exception of our ‘list style’ articles that include relevant sources.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]