["Twitter user Neha @ShantiseAshanTi shared a CCTV footage of a man assaulting a medical worker inside a hospital and wrote, “Viral video of Zee News staff member assaulting doctor refusing to get tested. Can we share this like a few thousand times before checking for authenticity like news channels do.”", "Viral video of Zee News staff member assaulting doctor refusing to get tested. Can we share this like a few thousand times before checking for authenticity like news channels do.#ZeenewsSpreadingCorona #CoronaZeehad #Zeenewsbandkaro pic.twitter.com/tWSYff3mK2", "— Neha (@ShantiseAshanTi) May 19, 2020", "The video has been shared in the backdrop of 28 employees of Zee News testing positive for coronavirus.", "Neha was the first to share the video which was eventually picked up by a few others. One Mehnur Nooree (@MehnurN) claimed that a staff reporter of Zee News refused getting tested and assaulted a doctor.", "Viral Video!", "Ye hai Zee News staff reporter! corona positive paya gaya hai lekin woh test k liye inkar raha tha… Uske baad doctor per hamla#AntiNationalThinking pic.twitter.com/LcqBomzHVM", "— Mehnur Nooree (@MehnurN) May 19, 2020", "The clip was also shared on Facebook with the same caption.", "Viral video of Zee News staff member assaulting doctor refusing to get tested. Can we share this like a few thousand times before checking for authenticity like news channels do.", "Posted by Nida Shariff on Tuesday, 19 May 2020", "The video was uploaded by China Global Television Network (CGTN) on October 14, 2018. The incident occurred on September 22, 2018, when the husband and daughter of a pregnant woman beat up doctors at Peking University First Hospital for refusing a cesarian delivery.", "“Security footage from the hospital show Dr. He being punched and kicked in the head and stomach by the patient’s family members, leaving him with multiple fractures, according to his colleague,” said a report published by CGTN.", "According to Beijing News, the doctor suffered a “fractured jaw and eye sockets and had been hospitalised for treatment.”", "An old video from China was therefore shared as an employee of Zee News assaulting a doctor. It is noteworthy that Neha (@ShantiseAshanTi) was pointed out by several users that the video is not from India. In response to a user who asked her for “proof”, she said, “We will provide proof may be after a few lakh views and if found wrong will issue regret statement like news channels do.”", "We will provide proof may be after a few lakh views and if found wrong will issue regret statement like news channels do", "— Neha (@ShantiseAshanTi) May 19, 2020", "In her original tweet Neha had written something similar — “Can we share this like a few thousand times before checking for authenticity like news channels do.” It is likely that the Twitter user put out the video to mock the common practice in mainstream media, including Zee News, where unverified information is aired and later taken down with (or without) clarifications. After Nizamuddin Markaz in Delhi was identified as a COVID-19 hotspot, Zee News had compared Tablighi Jamaat with Al Qaeda and suicide bombers while sourcing the ‘information’ to WikiLeaks. Alt News had earlier published a fact-check on an article where Zee News falsely claimed that Muslim restauranteurs in Britain served human faeces to non-Muslim customers. However, pushing out deliberate misinformation cannot be the strategy to fight the issue of rampant misinformation on mainstream media and social media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]