["One of the social media stars of the Conservative Political Action Conference in February was artist Tommy Zegan’s golden statue of former President Donald Trump.", "Attendees stopped to take photos with the 6-foot-tall statue, replete with Trump’s customary red tie and not-so-customary American flag shorts and flip-flops, carrying a copy of the U.S. Constitution and a magic wand.", "But a photo shared widely on social media, including this post on Facebook, of evangelical leaders gathering around the statue to pray isn’t one of them. That image has been altered to replace Trump with the statue.", "The image plays on criticism of religious conservatives that quickly emerged on social media as images of the statue circulated. Text over the top of it in the March 2 Facebook post reads “Evangelicals literally praying to a golden idol. LITERALLY.”", "The Facebook user who shared the photo did not respond to a request for comment.", "Fact check:Photo of high gas prices in Beverly Hills lacks context", "Zegan told The New York Times that he started on the statue in 2018 because he was unhappy with others depicting the then-president.", "Made of fiberglass, the statue weighs in at about 200 pounds, according to Politico, and Zegan built it in Rosarito, Mexico. It was painted in Tampa, Florida, and delivered to CPAC via U-Haul.", "The wand in the statue’s right hand is a reference to former President Barack Obama suggesting in 2016 that Trump would need one to restore manufacturing jobs. Zegan calls the statue a “humorous caricature.”", "Zegan also built a stainless steel version of the sculpture, according to his website, and plans to auction the fiberglass version from CPAC. He told CNN he hopes the stainless steel version will make it into Trump’s presidential library.", "Fact check:Breaking down spending in the COVID-19 relief bill", "The widely circulated image of people standing around the statue, eyes closed and arms extended in prayer, is an altered version of a photo from more than a year earlier.", "A reverse image search showed the original photo was from a Jan. 3, 2020, event launching the \"Evangelicals for Trump\" coalition in Miami. An Associated Press photographer made the original image.", "Trump spoke to more than 5,000 people at a Miami megachurch that day, according to the Associated Press.", "The image of a group of evangelicals praying over a gold statue of former President Donald Trump is ALTERED. The image has been doctored from an original to substitute the statue for Trump. The original photo was taken on Jan. 3, 2020, at a rally in Miami, while the Conservative Political Action Conference, where the altered image purports to have been taken, was in late February 2021.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]