["About this rating", "On 18 June 2019, the Twitter account StrataGeoData posted an image of a giant ammonite fossil:", "Nice find by the team today! Titanites sp., a giant ammonite fossil from south eastern British Columbia! This site is known, just crazy awesome to see it for real!#geology #consulting #exploration #minerals #BritishColumbia #gold #silver #teamwork #sus… https://t.co/lBzOZQuJJh pic.twitter.com/RIHYdA1Ss0", "— SGDS Hive - Andy Randell (@StrataGeoData) June 19, 2019", "Several readers alerted Snopes to the picture, concerned that it was perhaps a hoax. In fact, the fossil displayed is a famous specimen first reported in 1947 by British Columbia Geological Survey geologist Chuck Newmarch outside the town of Fernie, British Columbia, as reported in Mountain Culture< magazine:", "In July 1947, geologists stumbled upon the ammonite fossil while mapping coal seams in Fernie’s Coal Valley. The discovery of a “fossil truck tire” in the sandstone by Coal Creek was reported, and Chuck Newmarch, a geologist with the British Columbia Geological Survey, was sent to investigate. He recognized it as a giant specimen of ammonite, a long-lost relative of the modern-day, shelled nautilus, which is in the cephalopod family that includes the octopus, the squid and the cuttlefish.", "Andy Randell, who tweeted the picture of the fossil from his companies’ social media accounts, confirmed this was the specimen in question. The expedition by Randell's non-profit society, Below BC, is a project \"to explore parts of British Columbia’s geological heritage.\" He provided further background on the photograph:", "The fossil is of a Titanites sp., probablyTitanites occidentalis. It is thought to be the biggest in Canada, but this cannot be confirmed unless the specimen is officially shipped to a museum or university, and collection of this specimen has been deterred since the 1940s!", "The photo was taken on Monday 17th June. The geologist in the photo is Allegra Whistler and is one of my Strata GeoData staff. The picture was taken by Jacob Moffat, also part of my team. We have been working closely with local Government and Mining Offices as part of a heritage project who then gave us the location to enhance our project ...", "From our office, we run two companies that I founded: Strata GeoData Services (known as SGDS Hive) and our non-profit society Below BC. The latter is what this visit was done under as we recently received a grant from Geoscience BC to explore parts of British Columbia’s geological heritage. We are using a variety of methods to digitise collections and sites to use for educational purposes and to allow people from all over to explore our geological heritage.", "Ammonites went extinct at the end of the Cretaceous period at the same time as the dinosaurs, 65 million years ago. But in the 140 million years before that event, some species of ammonites evolved into very large, very capable predators, and the specimen shown in the tweet is far from the largest ammonite fossil on record. That honor belongs to a 78-million-year-old fossil of the ammonite species Parapuzosia seppenradensis found near the town of Munster, Germany. The animal that formed this incomplete fossil would have been over eight feet in diameter.", "Legacy.com.   “Charles B. 'Chuck' Newmarch.\"\r\n    23 December 2008.", "GeoscienceBC.   “Valuable BC Rock Collections Digitized for Access and Preservation.”\r\n    11 June 2019.", "British Geological Survey.   “Ammonites.”\r\n    Accessed 21 June 2019.", "Payne, Jonathan L. et al.   “Two-phase Increase in the Maximum Size of Life Over 3.5 Billion Years Reflects Biological Innovation and Environmental Opportunity.”\r\n    PNAS.   6 January 2009.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]