["Sun’s out, scams are out. The perennial promise of free tickets to Six Flags amusement parks is a time-honored summertime tradition. As is fact-checking these offers that are, in fact, too good to be true.", "\"6-Flags-offers 5-FREE Passes & Unlimited FREE-Rides to everyone Come with Family &-Enjoy..\" reads the title of an undated post on a website called \"Local Airlines Fare.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But the post, which has been shared as a link on Facebook, doesn’t mention free passes again. Instead, it describes someone buying a season pass and then discusses the Knoebels amusement park in Pennsylvania.", "Six Flags did not immediately respond to an email from PolitiFact asking about the post. But free pass scams are common, often taking the form of contests or surveys.", "In 2012, Six Flags Over Texas warned on Facebook that \"ticket scammers\" were again out \"in full force.\"", "\"The ONLY valid offers for free Six Flags tickets are available on OUR Facebook page, OUR Twitter page, and OUR website,\" that post says. \"If it doesn’t come DIRECTLY from us, it just might be a scam.\"", "In 2016, the Six Flags Twitter account tweeted this reminder: \"We don’t give away free tickets just for visiting a link or sharing a post with your friends. #scamoftheweek\"", "That year, the company posted advice on its website for sussing out whether such contests are scams. Occasionally, Six Flags does sponsor contests and sweepstakes, the post says. But those contests are promoted directly on the company’s website and social media pages. Sometimes, the company’s partners may run their own contests and \"more often than not, contests from official Six Flags partners can be reached directly from the Six Flags website.\"", "We couldn’t find anything on the Six Flags website about the company offering five free passes to everyone. While people with season passes to Six Flags can bring a friend for free, we found no evidence that the promise offree passes and unlimited rides that’s currently circulating on Facebook is authentic.", "We rate it False.", "Local Airlines Fare website, visited June 27, 2019", "Patch, \"Six Flags ticket scam reported in New Jersey,\" March 14, 2016", "NBC News, \"Free Six Flags tickets? Stop the ride, it’s a Facebook scam,\" March 21, 2012", "Six Flags over Texas Facebook post, June 1, 2012", "Six Flags tweet, May 6, 2016", "Six Flags, \"Six Flags contest fraud alert,\" July 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]