["About this rating", "On March 25, 2020, Twitter user Sage Boggs posted a thread that seemingly revealed a shocking (literally) fact: The Triscuit got its name in the early 1900s because it was one of the first foods to be baked with electricity.", "The entire thread is worth a read (you can view it here). We've included screenshots of the most relevant tweets below:", "Factually speaking, we didn't find much to quibble with in Boggs' thread.", "Triscuit crackers were developed in the early 1900s, and early advertisements did tout the \"wheat biscuits\" as being \"baked by electricity.\" For example, this ad was published in The Montgomery Advertiser in September 1903:", "At first, however, we weren't entirely convinced that this electric baking method served as the inspiration for the Triscuit name. In fact, Boggs' thread left us with more questions than answers. Wouldn't the letters \"ele\" better signify this product's relationship to electricity? Why not \"Elescuits\"? And aren't Triscuit snacks marketed today as crackers, not biscuits? Why not \"Tricker\"? Does \"tri\" really not refer to \"three\"? Not thrice-baked, not three ingredients, not three of anything?", "And what exactly does \"baked by electricity\" mean? In short, we just don't trust these crackers.", "We went digging in the archives to learn more about the origins of Triscuit. Our working theory was based on the etymology of the word \"biscuit,\" which was derived from the medieval Latin word \"biscoctum,\" meaning \"twice-baked.\" The quiz show Jeopardy used this logic for a clue during a 2018 episode, positing: \"The name of this cracker that’s been around since 1903 suggests that it was baked 3 times.\"", "However, we were unable to find any advertisements or company materials describing the Triscuit as a thrice-baked cracker.", "In fact, what we did find about the Triscuit cooking process supported the idea that it was truly an electric biscuit. The story of the Triscuit starts in the late 1800s when a man named Henry D. Perky developed a machine to produce little square biscuits made of shredded wheat. (You can see one of Perky's early patents from 1900 here).", "Perky's inventions not only produced a tasty treat, they were also a major development in food manufacturing. A 1904 article in Western Electrician described how Triscuit crackers were baked, and praised the Natural Food Company for making \"the largest development of electric cooking in the world\" that had been \"successful in every way.\"", "Western Electrician wrote:", "In the winter of 1902-3, about a year and a half ago, the Natural Food Company of Niagara Falls, N.Y., began the manufacture of a new product they call Triscuit, it being a cracker of shredded wheat baked or toasted by having heat applied to both sides at the same time. The operation consists of passing the product through a machine between two endless link belts enclosed except at one end. The links of the belts are electric stoves, and are so arranged that the Triscuit is fed in and held pressed between the faces of the two stoves throughout the complete circuit of the machine. The operation is continuous. Each machine has about 2,500 stoves and has a product of 17,500 triscuits an hour. They are operating about 10,000 of these stoves, and their failures up to date have been less than one per cent from all causes. This is the largest development of electric cooking in the world, and is successful in every way; the cost for baking, including labor, being less for the same amount of product of triscuits than for shredded whit biscuit using coal.", "When we first came across the \"electric biscuit\" advertisement in Boggs' thread above, it seemed to be more of a clever advertising gimmick then a core aspect of a Triscuit. However, as noted in the article in Western Electrician, the electric baking process of a Triscuit was a major development in the food production world.", "A cookbook of shredded wheat recipes presented by the Shredded Wheat Company in 1911 also noted that the Triscuit cooking process had \"attracted the attention of electricians from all over the world\":", "Making Triscuit, the Shredded Wheat Wafer: The process of making Triscuit, the shredded wheat wafer, is even more wonderful. Triscuit is Shredded Whole Wheat compressed into a cracker or wafer, and cooked by electricity in a specially-devised machine, so interesting and wonderful in its operations that it has attracted the attention of electricians from all over the world. It consists of a series of moving \"waffle-irons\" which serve to compress and indent the wafer while the electric current supplied to each \"Waffle-iron\" cooks it.", "The following advertisement from a 1903 issue of American Motherhood called the Triscuit \"the highest achievement known to the science of food production.\"", "Another pair of early advertisements from 1903 emphasized the \"electric\" aspect of this shredded wheat snack:", "While we were busy combing through information from the 1900s, the answer to this pressing question popped up in a more modern medium: The official Twitter account for Triscuit caught wind of Boggs' thread and updated the company's profile to include lightning bolts and the text: \"elecTRIcity biSCUIT... but you can just call us Triscuit #ifykyk.\" (If you know, you know.)", "Triscuit also posted a message in response to Bogg's thread, reading: \"We had to go all the way up the ladder but we CAN confirm.\"", "There you have it. Triscuit crackers were named not because they contain three ingredients, or comprise three layers, or because they were baked three times, but because they were baked by electricity.", "Our search into the origins of the Triscuit came with quite a few surprises, but the most shocking (pun intended) to us cracker-eaters was how Triscuit was advertised as something of miracle food. It was good for children, made purely of \"God's creation\" (wheat), and could be eaten at any time of day, according to promotional materials. We also found several cookbooks featuring Triscuit recipes, and while many sounded appealing, such as Triscuit with cheese, butter, or jam, we must direct your attention to the \"King's Menu\" from volume 16 of the 1903 book The King and His Navy and Army.", "The King's Menu included three Triscuit dishes: Triscuit Croutons, Cream Fruit Triscuit, and Pigeons on Triscuit Toast:", "Ayer, James.   \"Electric Heating and the Field it Offers Central Stations.\"\r\n    Western Electrician.   16 July 1904.", "Shredded Wheat Company.   \"Shredded Wheat Dishes.\"\r\n    1911.", "American Motherhood.   \"A Whole Wheat Proudct, Triscuit, the Electric Baked Biscuit.\"\r\n    1903.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]