["As the country witnessed Bharat bandh announced by the Congress party to protest record fuel prices, a video went viral on social media, which showed a man holding a dead baby in his hand and expressing his anguish over losing his child. It has been claimed that due to the disruption of normal life as a result of the bandh, the child could not be saved as the ambulance could not arrive in time.", "Among those who shared this video, calling it the outcome of the Bharat bandh was a Twitter user Modified Renu (@Renu_18), who is followed on the social media platform by Prime Minister Narendra Modi. The video has been retweeted over 230 times so far.", "Tears in my eyes..😢😢 This is what we are delivering ?? Who is responsible ??? Doesn’t this video haunt u ppl who have called for a #BharatBandh ? pic.twitter.com/TrZfXhe3eS", "— Mօɖɨʄɨɛɖ Rɛռʊ (@renu_18) September 10, 2018", "Alternatively, the video has also been used by opponents of BJP to target the party. The tweet posted below has been retweeted close to 300 times.", "The sufferers are poor Indians- who are dying due to lack of basic health care. And BJP & Modi are busy in Jumla Bazi, Hindu Muslim politics;", "Jago Bharat Jago! #BharatBandh pic.twitter.com/BnretYMRtH", "— Salman Nizami (@SalmanNizami_) September 10, 2018", "The video along with the accompanying claim has also found its way on to Facebook.", "The incident in question occurred on September 7, 2018 and has nothing to do with Bharat bandh declared for September 10. According to a report by Lallantop, the video is from Sitamarhi in Bihar. Four year old Simran had succumbed to a snake bite on her finger, after no driver was available on duty to take her to Sadar hospital in Sitamarhi by an ambulance. Simran’s family hastily arranged a tempo to take her to the hospital but she could not be saved. Simran died on the way to the hospital.", "Moreover, Alt News found that this video had been uploaded on September 9 by a Facebook user which claimed that the child had died due to a snake bite.", "बिहार: सिताम्बर जिला, चैनपुर में एक छोटी बच्ची को साँप ने काटलिया असपताल ले जाने पर वह से एम्बुलेंस नही मिलने के karn बच्ची की मौत!!!💁‍♂ दुबकर मर जाओ देश चलाने वालों!!!!", "Posted by Taufik Siddiki on Sunday, September 9, 2018", "It may be noted that reports have emerged of a two-year old child who died in Jehanabad, Bihar after road blockade apparently stopped an ambulance on the way. However, this report is separate and not related to the social media claim presented in this article. Moreover, contradictory claims have emerged with regard to this report with district administration stating otherwise.", "There is no direct correlation with Bharat Bandh but generally,during a Bandh,frequency of vehicles is less.This may have caused little inconvenience.But even the family of the deceased said that ambulance wasn’t stopped due to #BharatBandh: Alok Ranjan Ghosh,DM Jehanabad #Bihar pic.twitter.com/jM6ADooNFQ", "— ANI (@ANI) September 10, 2018", "Using unrelated images and videos for politicking on social media is now an established practice, which was seen in this instance wherein an unrelated video of an incident that took place three days back was shared as the outcome of the Bharat bandh.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]