["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Oct. 4 Facebook post  about an international police force coming to the U.S. drew shocked reactions from people who saw it in their feeds.", "\"HOUSE PASSES BILL TO PAY U.N. TO RUN LOCAL POLICE BOARDS IN 46 U.S. CITIES,\" the post says. \"International police force coming soon. Bill #HR 7120.\"", "The account that posted the claim noted in comments that the legislation is also called the \"George Floyd Justice Act.\"", "One person replied that they felt Floyd’s death \"was plotted and manipulated.\"", "\"Praying…. emailing…. calling….\" someone else said. \"WE SAY NO! NO! NO!!!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "But HR 7120, a piece of legislation that’s also referred to as the George Floyd Justice in Policing Act of 2020, does not even mention the United Nations.", "The bill, which passed the Democratic-led House on June 25, is described as legislation \"to hold law enforcement accountable for misconduct in court, improve transparency through data collection, and reform police training and policies.\"", "It was introduced after the death of George Floyd, a Black man who was killed when a white police officer pressed his knee against Floyd’s neck. It’s the \"most sweeping federal intervention into law enforcement in years,\" the New York Times said. \"It would eliminate legal protections that shield police officers from lawsuits, make it easier to prosecute them for wrongdoing, impose a new set of restrictions on the use of deadly force, and effectively ban the use of chokeholds.\"", "It would also create a national registry to track police misconduct, require law enforcement agencies to report use of force data, ban no-knock warrants in federal drug cases, require officers to use more body and dashboard cameras, and tie some federal grants to law enforcement agencies adopting anti-discrimination training and practices.", "House Republicans said the bill overreaches, and it has stalled in the Senate. President Donald Trump has also threatened to veto the legislation if it did reach his desk.", "In June, Floyd’s brother urged the United Nations to investigate racism, police brutality and police killings of unarmed Black people in the United States, the New York Times reported.", "But this bill in no way empowers the United Nations to run police boards in dozens of cities in the United States. The legislation does describe developing and creating best practices for civilian review boards — \"an administrative entity that investigates civilian complaints against law enforcement officers\" —  but as this 2018 Justice Department report notes, \"civilian oversight of law enforcement agencies is nothing new.\"", "We rate this post False.", "Facebook post, Oct. 4, 2020", "H.R. 7120 - George Floyd Justice in Policing Act of 2020", "The New York Times, House passes sweeping policing bill targeting racial bias and use of force, June 25, 2020", "The New York Times, George Floyd’s brother urges U.N. to investigate police killings in U.S., June 17, 2020", "USA Today, House approves sweeping police reform package that would ban chokeholds, end qualified immunity after George Floyd’s death, June 25, 2020", "Vox, The House just passed a sweeping police reform bill, June 25, 2020", "Department of Justice, Civilian oversight of police in major cities, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]