["The video clip circulated in numerous Facebook posts in Nigeria, including this one shared more than 1,200 times since November 9, 2020. It has also been shared with similar claims in other languages such as German, Spanish, Portuguese, and French.", "“Bags of Recovered Ballots thrashed & dumped inside the Bush (sic),” reads part of the video’s caption.", "It was shared in Nigeria a few days after the US presidential election on November 3. Former vice president Joe Biden was declared the winner, but incumbent President Donald Trump has not conceded and instead has resorted to allegations of electoral fraud.", "The video shows a man in a yellow reflector vest and two police officers pulling transparent bags out of a bush. The camera zooms in to show what appear to be packages and envelopes inside the bags. The words “mail” and “united” are visible on one of the bags.", "But the claim that these bags contain discarded ballots is false. The video is unrelated to the recent election.", "In the top left-hand corner of the video, a watermark for TikTok and the username “@kuntefason” is visible. AFP Fact Check found the video was uploaded to TikTok on November 7, 2020.", "The TikTok post garnered more than a thousand comments, including some that gave clues as to the video’s origin.", "“I literally own a business on this road,” a TikTok user commented. “I am 100% pro-Trump and I believe this election is filled with fraud. BUT-let me tell you 100% facts here... Boone County Sheriff Deputies are led by a Sheriff who is a champion for the people. If these were ballots, you would know!”", "The user continues: “This road is filthy and full of trash because we are an Amazon hub and truckers park overnight every day – they leave lots of filth and garbage.”", "This comment, as well as spotting an Amazon truck in the video, gave AFP Fact Check a hint as to the location.", "Using Google Maps Street View, we found that the video was indeed filmed in Kentucky’s Boone County near an Amazon hub.", "Physical features such as the Waffle House restaurant, the curve in the road, and the building in the background (which is the Amazon hub) are visible both in the video and on  Google Maps Street View.", "Meanwhile, local authorities also dismissed the claim as false.", "“Those [bags] were simply containing discarded Amazon packages and not ballots,” Lieutenant Philip Ridgell of the Boone County Sheriff’s Office told AFP Fact Check.", "The officers found the packages on the side of the road on November 7, 2020, and contacted Amazon, Ridgell said. “Our officers contacted the nearby Amazon facility, who confirmed that the packages were from one of the fulfillment centers.”", "Contacted by AFP Fact Check, Amazon confirmed that these bags contained only Amazon packages.", "Referring to the person who lost the bags, Amazon spokesperson Maria Boschetti said that “this individual is no longer part of our Amazon delivery network and are working with law enforcement as they investigate.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]