["About this rating", "In March 2021, as Democratic politicians argued for an increase in the minimum wage in the U.S., many social media users pointed out that McDonald's employees in Denmark already make about $22 an hour. We fact-checked this claim in a previous article, and found that it was accurate. After publishing this article, some readers asked us if the relatively high pay of McDonald's employees in Denmark caused the price of the Big Mac, arguably McDonald's most famous menu item, to skyrocket.", "In short, the answer is no. A McDonald's customer will pay approximately the same amount — give or take a dollar or two — for a Big Mac in Denmark as they would for a Big Mac in the United States. In fact, in many cases you'll actually pay less for a Big Mac in Denmark than you would in the United States.", "Menu prices vary from each McDonald's location, so it's a little difficult to say exactly how much an American would pay for a Big Mac while visiting Denmark. Anecdotally speaking, we checked menu prices via meal-delivery services (UberEats for the United States and JustEat for Denmark) to see how much this popular burger costs in their respective countries. At a McDonald's location in Copenhagen, for example, this burger cost 30.00 kr (about $4.73). At a McDonald's location in Tulsa, Oklahoma, a Big Mac costs $4.82.", "This single example lines up with the Big Mac Index, an interactive tool from the Economist that compares Big Mac prices around the world. According to the Big Mac Index, \"a Big Mac costs DKr30.00 in Denmark and US$5.66 in the United States.\" When adjusted for GDP, the Economist found that \"a Big Mac costs 13% less in Denmark (US$4.90) than in the United States (US$5.66) at market exchange rates.\"", "While our quick check of menu prices and the Economist's Big Mac Index suggest that this burger costs, on average, less in Denmark than in the United States, other informal studies have come to different conclusions.", "Opinion columnist Nicholas Kristof wrote in The New York Times in May 2020, for instance, that \"my spot pricing suggested that (a Big Mac might) cost about 27 cents more on average in Denmark than in the United States.\" Ida Auken, a Danish politician, wrote in The Washington Post that \"a burger in Denmark costs roughly a dollar more that it costs in the United States.\"", "In short, the price of a Big Mac in Denmark and the United States is roughly the same, give or take a dollar, despite the fact that employees in Denmark are paid substantially more than their U.S. counterparts.", "31 March 2021 [CORRECTION]: Original article erroneously used Swedish Krona instead of Danish Krones in its conversions.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]