["The photo was shared on Facebook here on September 13, 2020.", "The post’s caption reads: “Reportedly Indian MI 17 crashed in ladakh. Needs to be confirmed. However, Our Kashmiri sources are confirming it to be true. Alhamdolillah.”", "Indian and Chinese troops have come to blows along the border in Ladakh this June, according to this AFP report. Ladakh is partly claimed by Beijing.", "The photo was also shared alongside similar claims in posts mostly from Pakistan on Facebook here, here, here and here; and on Twitter here, here, here and here.", "Mubasher Lucman, a well-known Pakistani TV journalist, also shared the photo here on Twitter alongside a similar claim. The post was retweeted over 1,600 times. Several Facebook users also shared screenshots of his tweet, for example here and here.", "However, the claim is false.", "A reverse image search on Google found the photo was published alongside other photos of the downed helicopter here in a report about the crash-landing of an IAF helicopter near the famous Hindu temple of Kedarnath on April 3, 2018.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the photo published in April 2018 media report (R):", "“An Indian Air Force (IAF) helicopter crash-landed in Kedarnath on Tuesday, police said. The accident took place when the MI-17 chopper was trying to land far from the Kedarnath shrine,” reads the first paragraph of the report.", "The accident was widely reported in Indian media alongside similar photos and video of the ill-fated helicopter, for example here by the Times of India and here by India TV on April 3, 2018.", "The government-run Press and Information Bureau also refuted the claim, saying \"no such incident has taken place recently anywhere in #Ladakh\" and publishing a screenshot of a misleading Facebook post here on Twitter on September 15, 2020.", "The last time an IAF helicopter crashed was on February 27, 2019, when IAF personnel accidentally shot down their own helicopter near the de-facto border with Pakistan in Kashmir.", "IAF chief Rakesh Kumar Singh Bhadauria can be heard describing the incident as “big mistake” at a press conference following an inquiry into the matter in October 2019 in this NDTV report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]