["Rep. Brian Higgins, D-Buffalo, claimed the House Republican tax reform bill could slash middle-class incomes as much as 9 percent.", "New York state taxpayers would lose money if Congress decides to end the federal deduction of state and local taxes, he said.", "\"The elimination of income and sales taxes in New York is equal to 9 percent of taxable income, meaning that if you make $100,000 a year you lose $9,000,\" Higgins said at a hearing. \"If you make $50,000 a year, you lose $4,500.\"", "About 3.3 million people in New York state take advantage of the state and local tax deduction, according to the Urban-Brookings Tax Policy Center, a tax policy and research organization. More than half of those who take the deduction make $100,000 a year or less.", "Is Higgins right that those taxpayers could lose as much as $9,000?", "Explaining the SALT deduction", "The current tax code allows taxpayers to deduct their state and local taxes from their federal taxes. About one-third of filers do this in New York state.", "That helps residents in states like New York where property taxes are higher. Filers can also deduct either their state income tax or sales tax, but not both.", "The House Republican tax plan would cap the maximum property tax deduction at $10,000 and end the deduction for state income and sales tax altogether.", "About two-thirds of filers choose instead to take the standard deduction, a fixed amount set each year.", "Where’s the number from?", "What Higgins said is different from what he meant to say, said Theresa Kennedy, the congressman’s spokeswoman.", "He meant to say filers would no longer be able to deduct $9,000 -- not lose $9,000 outright.", "Higgins supports that claim with data from the Government Finance Officers Association. The group said the average state and local tax deduction in New York state is equal to 9 percent of a filer's income. That's where Higgins get the $9,000 figure from. Nine percent of $100,000 is $9,000.", "That’s in the ballpark. People making between $75,000 and $100,000 deduct $9,949 on average in state and local taxes, according to data from the Tax Policy Center.", "\"How much they'll actually save depends on the tax rate,\" said Frank Sammartino, a senior fellow at the center.", "Couples making $100,000 are currently taxed at 25 percent. That wouldn’t change under the Republican plan. A $9,000 tax deduction could save that couple $2,250 in tax, according to the IRS.", "One caveat", "Even if Higgins had said deduction in his statement, he would still be wrong.", "Higgins made his claim after House Republicans decided to keep the deduction for property taxes. The deduction would be capped at $10,000. If someone’s property tax bill is more than that amount, the difference could not be deducted. The Senate bill does not include that proposal.", "Sammartino said Higgins’ claim would hold up if there isn’t a compromise.", "\"Nine thousand would be true if it was a complete repeal,\" Sammartino said. \"But it would be something less than that\" with the deduction for property taxes.", "The average property tax deduction is $6,522 for someone making between $75,000 and $100,000 in New York. That falls below the cap.", "\"People would be protected to some degree,\" Sammartino said.", "Kennedy, the spokeswoman for Higgins, said the bill still affects residents in his district, regardless of the final numbers.", "\"We can debate the exact numbers which will be different for each taxpayer, but the bottom line is that hardworking Western New Yorkers have a lot to lose in both the Senate and House legislation which continues to change by the minute,\" Kennedy said.", "Our ruling", "Higgins said New York state taxpayers could lose as much as 9 percent of their taxable income if state and local tax deductions end.", "Higgins meant to say residents would no longer be able to deduct 9 percent of their income from their federal taxes, not that they would lose that money outright.", "But even if he said what he meant, that would still be inaccurate. House Republicans came to a compromise on property tax deductions that refute the numbers in his statement.", "We rate the claim False.", "Video of remarks from Rep. Brian Higgins at tax reform hearing, Nov. 3, 2017", "Email conversation with Theresa Kennedy, spokesperson for Rep. Brian Higgins", "\"The Impact of Eliminating the State and Local Tax Deduction\", Government Finance Officers Association, Sep. 2017", "Phone interview with Frank Sammartino, Senior Fellow and the Urban-Brookings Tax Policy Center", "State and Local Tax Deduction by State and AGI | Tax Policy Center", "State and Local Income Tax Deduction By State and AGI | Tax Policy Center", "State and Local Sales Tax Deduction By State and AGI | Tax Policy Center", "State and Local Real Estate Tax Deduction By State and AGI | Tax Policy Center", "Tax Credits vs. Tax Deductions, Internal Revenue Service", "\"All your major questions about the GOP tax plan, answered\" The Washington Post, Nov. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]