["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic banterer Paul Begala, a former Bill Clinton adviser who was once student-body president at the University of Texas, tried a Texas tack on CNN's \"Situation Room\" Dec. 6 to poke at Sarah Palin possibly being the front-runner for the Republican presidential nomination in 2012.\n\nPalin governed Alaska, Begala said, which he described as home to fewer people than the Texas capital of Austin. An Austin American-Statesman editorial columnist, Ken Herman, later noted that Alaska has about 700,000 people, while Austin has about 786,000.\n\nBegala continued: \"Now, quick: Who's the mayor of Austin? Turns out it's Lee Leffingwell. And Lee Leffingwell's been the mayor of Austin for about as long as Sarah Palin was governor of Alaska, but nobody is saying that Lee Leffingwell ought to be president.\"\n\nWe're not getting into the population contrast or Leffingwell's designs on the White House. But has he been hizzoner about as long as Palin was governor?\n\nAccording to a city of Austin web page, Leffingwell's term as mayor started June 22, 2009. So he's held that post for nearly 18 months of his three-year term. Palin was sworn into office as Alaska's governor Dec. 4, 2006, according to the Associated Press. She resigned effective July 26, 2009, according to another AP news article, having served about 32 months of her four-year term.\n\nWe asked Begala about his calculation. He replied by e-mail that while he checked the populations of Austin and Alaska, he also \"should have checked the mayor's duration in office versus Palin's. I stand corrected.\"\n\nIn the spirit of his broadcasted Palin dig, Begala added: \"So in another year and a half let's run the mayor for prez.\"\n\nNo comment. His statement is False.", "The Associated Press, news articles, \"Jubilant crowd welcomes Sarah Palin to Fairbanks,\" posted by the Juneau Empire, Sept. 11, 2008 and \"Sarah Palin Steps Down, Sean Parnell Sworn in as Governor of Alaska,\" posted by Fox News July 26, 2009 (accessed Dec. 13, 2010)\n\nCity of Austin, website, \"Austin City Council, Mayor Lee Leffingwell\" (accessed Dec. 13, 2010)\n\nAustin American-Statesman, political column, Ken Herman, editorial section staff writer, \"How's that hopey, weirdy thing working out for ya?,\" Dec. 12, 2010 (accessed Dec. 13, 2010)\n\nCNN, program transcript, \"Situation Room,\" Dec. 6, 2010\n\nE-mail (excerpted), Paul Begala, Democratic commentator, response to PolitiFact Texas, Dec. 13, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]