["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Atlanta residents are finding their mailboxes flooded with fliers from politicians vying for the City Council, the school board and the mayor’s office.", "One flier attacking the record of a veteran city councilwoman gained our attention.", "\"Natalyn Archibong skipped City Council meetings or was late 90% of the time,\" Matt Rinker’s flier says.", "\"Then She Voted Herself a Pay Raise,\" the flier says in red letters.", "PolitiFact Georgia wondered about the accuracy of the flier, particularly the part about Archibong voting herself a pay raise. In 2012, Archibong was one of four council members who voted against a pay raise that still passed by a 10-4 margin.", "Archibong represents the District 5 seat on the council, which includes several east Atlanta neighborhoods located in Fulton and DeKalb counties. An attorney in private practice, Archibong was first elected in 2001 and is hoping to be re-elected to a fourth four-year term.", "The District 5 council race has become particularly nasty in its final days, with accusations flying back and forth among the four candidates. On Thursday, Archibong filed a lawsuit in DeKalb County against Rinker and candidate Christian Enterkin, accusing them of slander. Enterkin also claimed in a flier that Archibong was late or absent to council meetings 90 percent of the time in 2011 and 2012. Enterkin’s flier did not mention Rinker’s claim that Archibong voted herself a pay raise.", "DeKalb County Superior Court Judge Gregory Adams denied Archibong’s motion for a temporary restraining order of statements about the councilwoman’s attendance record and other claims about her.", "The city convenes a panel of citizens once every four years to review the salaries of the mayor and the council. In 2004, the panel met and proposed raising the council’s pay from about $32,000 to $39,473. In March 2005, the council voted by a 9-3 margin to approve the pay raise. Archibong supported the salary increase and voted in favor of it. Rinker said via email he was referring to the 2005 vote.", "The 2012 vote raised the salaries of council members from $39,473 to $60,000 and takes effect in 2014.", "Archibong also sent PolitiFact Georgia attendance records that were certified by the city clerk’s office. Those records show Archibong has missed just one council meeting this year and two meetings per year in 2011 and 2012. They show she didn’t miss any council meetings in 2009 and 2010. Council records, though, raised some questions about Archibong’s punctuality.", "Our review of City Council meeting minutes since the beginning of 2010 shows Archibong was either absent or not listed as present when the meeting convened about 75 percent of the time. In most cases, Archibong’s arrival time was listed about one hour after the meeting was convened. The news website East Atlanta Patch published a spreadsheet that concluded Archibong was either absent or late 78.6 percent of the time during the same time frame.", "The council often hands out proclamations to citizens and visiting dignitaries at the beginning of meetings and then allows time for public comments before voting on legislation that is on its agenda. It is often 30 minutes to one hour before the council actually gets to the agenda. Most council members sit through the proclamations and public comments. Others, instead, hold sidebar conversations with their colleagues or administration officials or conduct other activities.", "\"I don't sit through proclamations,\" Archibong told us. \"I'm at work though, because the Committee on Council precedes the full council meeting.\"", "The Committee on Council is a semimonthly gathering of select council members who discuss council administrative issues. The committee typically meets less than two hours before council meetings.", "Was Archibong around when the council took its first vote of the day? She was nearly every time, council records show.", "So, what does this mean about the accuracy of Rinker’s flier? He’s right that Archibong voted to increase her pay, but that was eight years ago. The councilwoman voted against a pay raise in 2012. This makes Rinker’s flier confusing, if not misleading.", "As for her attendance record, Rinker’s number comes close to our count concerning how often Archibong is either absent or was not present when the council convened. Council records show Archibong is usually present when the council makes its first vote of the day.", "Rinker’s claim contains some elements of truth, but there is a lot of context that needs to be considered before fully understanding what he put in the flier. On our rating scale, this one gets a Mostly False.", "Matt Rinker flier.", "The Atlanta Journal-Constitution, \"Atlanta council OKs pay increase,\" Dec. 4, 2012.", "The Atlanta Journal-Constitution, \"Atlanta council votes to give itself raises,\" March 22, 2005.", "The Atlanta Journal-Constitution, \"Council due raise -- but how big?,\" March 10, 2005.", "Atlanta City Council meeting minutes.", "DeKalb County Superior Court records.", "Emails from Natalyn Archibong, Oct. 29 and 30, 2013.", "Email from Matt Rinker, Oct. 30, 2013.", "Patch.com attendance record analysis of Natalyn Archibong by Keith Bullington, Oct. 25, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]