["By Sydney Schaedel", "Posted on April 2, 2020", "A post circulating on social media falsely claims that a blend of sodium bicarbonate and lemon juice will “eliminate” the novel coronavirus. The post also claims this “cure” has prevented any COVID-19 deaths in Israel — but more than 30 people have died of the disease there.", "As COVID-19, the disease caused by the novel coronavirus, spreads around the world, numerous false and misleading claims of “cures” for the virus are spreading on social media.", "A recent claim is from a post titled “In Israel No Death from COVID 19.”  It falsely states that the “cure” for COVID-19, “or the way to eliminate it,” has been discovered, and that it comes from Israel, where it says the virus “did not cause any death.”", "In reality, as of April 2, more than 6,800 people in Israel have tested positive for COVID-19, and 36 have died. Over 100 people were in serious condition and 83 were on life support.", "The post also claims that this “cure” is the reason that the “People of Israel is relaxed” about COVID-19.", "Actually, the Israeli government has issued emergency regulations that include reducing entry to the public space, imposing responsibility on employers, closing non-essential stores and imposing restrictions on public transport, as well as “home isolation” guidelines.", "The post’s “recipe” for the phony cure includes lemon and bicarbonate — short for sodium bicarbonate, or baking soda, which is commonly used as an antacid.", "“Mix and drink as hot tea every afternoon,” the post says. “The action of the lemon with hotter baking soda immediately kills the virus [and] completely eliminates it from the body.”", "This claim is baseless. According to the World Health Organization, “to date, there is no specific medicine recommended to prevent or treat the new coronavirus.”", "Krutika Kuppalli, an infectious diseases physician and fellow with the Johns Hopkins University Center for Health Security, confirmed this in an interview.", "“There’s no data that shows using lemon juice or hot tea or anything like that would kill a virus,” she said.", "Angela Rogers, assistant professor of medicine at the Stanford University Medical Center, noted in an email that “there is nothing that has been shown yet to kill or eliminate COVID-19 virus, and it’s still not clear whether any other therapies in the news (steroids, targeted immune modulators, azithromycin, hydroxychloroquine) are actually helpful.”", "Kuppalli said people can lower their risk of contracting the virus by washing their hands, covering their coughs and sneezes, maintaining distance from each other, and following public health measures that have been implemented in their area.", "We’ve reported on many falsehoods and misleading statements about the new coronavirus. See “A Guide to Our Coronavirus Coverage” for stories, videos and resources.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Coronavirus disease (COVID-19) advice for the public: Myth busters.” World Health Organization. Accessed 1 Apr 2020.", "“Live Updates//Netanyahu, Mossad Chief to Enter Quarantine After Health Minister Diagnosed With Coronavirus.” Haaretz. 2 Apr 2020.", "“The Novel Coronavirus: Emergency Regulations.” State of Israel Ministry of Health. Accessed 1 Apr 2020.", "Kuppalli, Krutika. Infectious diseases physician and fellow, Johns Hopkins University Center for Health Security. Telephone interview with FactCheck.org. 1 Apr 2020.", "Rogers, Angela. Assistant professor of medicine, Stanford University Medical Center. Email to FactCheck.org. 1 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]