["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate former Vice President Joe Biden arrives as he visits Pittsburgh Local Fire Fighters No. 1 in Pittsburgh, Pa.(AP Photo/Carolyn Kaster)", "Two separate groups find that more law enforcement officers died from COVID-19 than all other causes, including gunfire and car accidents.", "Corrections officers are included in the tally.", "At the Republican National Convention, President Donald Trump cast himself as a stalwart friend of police and an effective leader in the fight against COVID-19.", "In a speech in Pittsburgh, Democratic nominee Joe Biden said Trump was neither.", "\"Do you feel safer under Donald Trump?\" Biden asked Aug. 31. \"More cops have died from COVID this year than have been killed on patrol.\"", "That stat raised eyebrows, and we checked to see if it was true. Biden didn’t say exactly what the best data show, but the comparison is largely accurate.", "Tallies of deaths by two national groups show that COVID-19 has killed more law enforcement officers than gunfire and other hazards of the job in 2020. The caveat to Biden’s claim is there is some statistical fuzziness regarding who is a cop and what it means to be on patrol.", "Roughly one-third of these tallies include corrections and detention center officers who work inside institutions where the virus can spread more readily. Some Customs and Border Protection field officers and other first responders are also included. While these occupations are counted as part of law enforcement, they might not come to mind as the cops that Biden referred to.", "The COVID-19 death toll is still the greatest single cause of death when those occupations are excluded.", "The National Law Enforcement Officer Memorial Fund lists 101 dead officers from COVID-19 compared with 87 from anything else, including gunfire, car accidents or other causes. If it weren’t for COVID-19, officer deaths were on track to be lower this year than last.", "The National Law Enforcement Officer Memorial Fund says on its website that before it adds an officer to its list of deaths due to the virus, \"substantive evidence will be required to show the death was more than likely due to the direct and proximate result of\" exposure in the line of duty.", "Another source, the Officer Down Memorial Page, shows 101 deaths from COVID-19 and 81 deaths from all other causes. Communications director Jessica Rushing said the count is updated daily.", "(The Fraternal Order of Police has tracked 208 deaths from COVID-19, but not fatalities from other causes. It notes that it doesn’t verify the COVID-19 deaths.)", "According to Rushing’s group, gunfire is the second most common cause of death.", "By a factor of three, COVID-19 is the leading cause of death for the broad group of officers.", "That has as much to do with the pattern of police fatalities as it does with the virus, said Rutgers criminologist Frank Edwards. Deaths in the line of duty due to any cause tend to average about eight each month.", "FBI data on deaths in the line of duty further back this point. The FBI numbers distinguish between accidental and felonious deaths of officers in the community. They show that in a typical month, criminal acts kill less than five officers a month.", "Excluding the corrections and detention officers, the toll from COVID-19 remains at about 70 in the Officer Down count — still double the loss of life due to gunfire, but not higher than the sum of other causes of death.", "Biden said that more cops have died from COVID-19 than while on patrol.", "COVID-19 by itself has killed more law enforcement officers than all other causes combined, according to two groups that track these numbers.", "No matter how we parsed the data — by excluding correctional and detention center officers, or by focusing on felonious deaths to officers that could be considered \"on patrol\" — COVID-19 posed the greatest single threat to officers’ lives.", "We rate this claim Mostly True.", "C-SPAN, Joe Biden Delivers Remarks on Public Safety and Law Enforcement, Aug. 31, 2020", "Officer Down Memorial Page, Fallen Officers From the COVID-19 Pandemic, Aug. 31, 2020", "Officer Down Memorial Page, 2020 Honor Roll of Heroes, Aug. 31, 2020", "Fraternal Order of Police, COVID-19 Line-of-Duty Deaths, accessed Aug. 31, 2020", "National Law Enforcement Officers Memorial Fund, Preliminary 2020 Fallen Officer Fatalities, Aug. 31, 2020", "National Law Enforcement Officers Memorial Fund, COVID-19 and its impact on law enforcement, Aug. 31, 2020", "Federal Bureau of Investigation, Law Enforcement Officers Killed and Assaulted, accessed Sept. 1, 2020", "Email exchange, Jessica M. Rushing, communications director, Officer Down Memorial Page, Aug. 31, 2020", "Email exchange, Jessica T. Cahill, press liaison, Fraternal Order of Police, Aug. 31. 2020", "Email exchange, Michael Gwin, spokesman, Biden for President, Aug. 31, 2020", "Email exchange, Frank Edwards, assistant professor, School of Criminal Justice, Rutgers - Newark, Aug. 31, 2020", "Email exchange, Lori Fridell, professor of criminology, University of South Florida, Sept. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]