["The video was published here on Facebook on April 2, 2020. It has been viewed more than one hundred of thousand times and shared 4,600 times.", "The one-minute 56-second video shows large hailstones falling onto a parked car on a street.", "Below is a screenshot of the misleading post:", "The post’s Thai-language caption translates to English as: “It’s not a movie, not taken abroad but the incident happened in Chiang San district, Chiang Rai province today, another trouble in Thailand!!!?”", "Chiang Rai is a province in northern Thailand.", "The same video was shared alongside a similar claim here, here and here.", "The claim is false.", "A reverse Google image search using video keyframes extracted with InVID-WeVerify, a video verification tool, found the same video published on YouTube by ViralHog, a US-based viral content site.", "The video, which has been viewed more than 47,000 times is titled “Surprise Hail Storm Smashes Car in Seconds || ViralHog”.", "The video’s caption states: “Occurred on November 17, 2019 / Palmview, Queensland, Australia. A massive hail storm hit the Sunshine Coast. Within minutes cars were destroyed and $100,000’s worth of damage was done to cars and homes.\"", "Below is the screenshot of the video in the misleading post (L) and the YouTube video (R):", "A subsequent keyword search also found this report which included the video published on Australian news site 7news.com.au on November 18, 2019.", "The article’s headline reads: “Brisbane hail: Severe storms to smash parts of southeast Queensland”.", "Below is a screenshot of the article:", "The report credits the video to the Facebook account of Lisa Thomas, who told AFP via email on April 14, 2020: “Yes I filmed that video of my daughter's car. It was filmed on the Sunshine Coast in Queensland, Australia. The video is licensed through ViralHog. ”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]