["About this rating", "In October 2018, New York City became the first municipality in the United States to adopt a law allowing residents born there to select a gender-neutral option (\"X\") on their birth certificates. The law removed a previous requirement that New Yorkers obtain an affidavit from a medical professional before a birth certificate could be amended to remove or change a sex designation.", "Mayor Bill de Blasio signed the bill, titled \"Amending sex designation on birth records and the issuance of birth records,\" into law on 9 October 2018, and it took effect on 1 January 2019. The bill also allowed parents to select \"X\" instead of \"male\" or \"female\" on their newborns' documents.", "Although some readers questioned whether the story was true, New York City isn't the first part of the U.S. to enact such a law: California, Oregon, Washington state, and (beginning 1 February 2019) New Jersey also have gender-neutral birth certificate options.", "According to the recently adopted New York bill:", "This legislation would allow individuals to change the sex designation on their birth record to conform to the individual’s gender identity. The application would be supported by a signed and notarized statement by the individual, attesting that the request for a change of gender to female, male, or “X” is to conform the person’s legal gender to the person’s gender identity. The term “X” means a gender that is not exclusively male or female. Currently, individuals requesting to correct the gender on their birth certificates must submit affidavits from licensed physicians or medical professionals attesting that the changed sex designation more accurately reflects the applicant’s gender identity.", "The official Twitter account for the New York City mayor's office reminded residents that the law would go into effect come the New Year:", "To all trans and non-binary New Yorkers: We see you, hear you and respect you. Starting in 2019, all New Yorkers will be able to change their gender on their birth certificate to M, F or X — without a doctor's note. pic.twitter.com/we4TbCVdhJ", "— NYC Mayor's Office (@NYCMayorsOffice) December 29, 2018", "In a statement, NYC Unity Project Director Ashe McGovern welcomed the new law, saying:", "As a non-binary trans person, I intimately understand the discrimination our communities face as a result of mismatched or inaccurate identity documents. With this move, the Mayor is signaling clearly that New York City sees us, hears us, and deeply supports our fundamental right to self-determination.", "Associated Press.   \"NYC Passes Law Allowing Gender-Neutral Birth Certificates.\"\r\n    10 October 2018.", "New York City Council.   \"Amending Sex Designation on Birth Records and the Issuance of Birth Records.\"\r\n    9 October 2018.", "Sullivan, Emily.   \"New York City Creates Gender-Neutral Designation for Birth Certificates.\"\r\n    NPR.   17 October 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]