["By Eugene Kiely, Lori Robertson and D'Angelo Gore", "Posted on January 22, 2020", "White House lawyers distorted the facts on the impeachment process and other issues during the Jan. 21 Senate trial:", "In addition, Senate Majority Leader Mitch McConnell said his resolution outlining the impeachment trial procedures “tracks closely” with the rules of trials for other presidents. How closely McConnell’s resolution tracks with the procedures used in the past may be a matter of opinion. However, there are some differences between the rules for Trump’s trial and President Bill Clinton’s.", "The lawyers and McConnell made their remarks during the opening comments and debate over the rules for the trial of the president.", "White House counsel Cipollone falsely suggested that Republicans weren’t given the same access as Democrats to the closed-door depositions in the fall led by the House intelligence committee.", "Cipollone, Jan. 21: The proceedings took place in a basement of the House of Representatives. … Not even [House intelligence committee chairman Adam] Schiff’s Republican colleagues were allowed into the SCIF.", "Cipollone was referring to the closed-door interviews conducted in a Sensitive Compartmented Information Facility, a secure room used to discuss or view classified and sensitive material. But both Democrats and Republicans on the committees leading the impeachment inquiry in the House had access to the SCIF.", "Transcripts of the closed-door proceedings, which were held before public hearings began on Nov. 13, show Republican committee members asking questions of the witnesses. For instance, the Oct. 17 closed-door testimony of Gordon Sondland, the U.S. ambassador to the European Union, was later publicly released, and it shows several Republican lawmakers were present, including the ranking minority members of the intelligence, oversight and foreign affairs committees: Republican Reps. Devin Nunes, Jim Jordan and Michael McCaul. They all asked questions of Sondland, the transcript shows. The House intelligence committee Democratic and Republican lawyers — Daniel Goldman and Steve Castor — also were present and questioned Sondland.", "Similarly, the Nov. 16 deposition of Mark Sandy, the deputy associate director for national security at the Office of Management and Budget, shows both Democrats and Republicans from the committees were present and asked questions.", "During the Jan. 21 Senate proceedings, Schiff, who is also one of the House impeachment managers, later addressed Cipollone’s claim, saying: “He’s mistaken. Every Republican on the three investigative committees was allowed to participate in the depositions. And more than that, they got the same time we did.”", "Cipollone may have been misleadingly referring to an effort by Republicans who weren’t on the intelligence, oversight or foreign affairs committees to gain entrance to the SCIF. That Oct. 23 event, led by Reps. Matt Gaetz and Steve Scalise, was held to protest the non-public aspect of the impeachment inquiry at that point, the lawmakers said.", "Cipollone further complained that “the president was forbidden from attending” the closed-door depositions and that “the president was not allowed to have a lawyer present.”", "The depositions weren’t hearings or trials, but rather a congressional inquiry. As we mentioned, Republican counsel — though not the president’s — did participate.", "In his opening remarks, Sekulow, one of Trump’s personal attorneys representing him at the Senate impeachment, criticized how the House Judiciary Committee conducted its impeachment hearings. But he got the facts wrong.", "Sekulow’s comment came after Schiff spoke of “the trifecta of constitutional misconduct justifying impeachment.”", "Sekulow, Jan. 21: Mr. Schiff also talked about a trifecta. I’ll give you a trifecta. During the proceedings that took place before the Judiciary Committee, the president was denied the right to cross-examine witnesses, the president was denied the right to access evidence, and the president was denied the right to have counsel present at hearings.", "None of that is true. Trump was offered all of that, but he declined to participate in the House Judiciary Committee hearings.", "In a Nov. 26, 2019, letter, Rep. Jerry Nadler — the chairman of the Judiciary Committee — invited Trump and his lawyer to attend the committee hearings and ask questions of the witnesses (subject to Nadler’s approval).", "The letter also offered to provide Trump with evidence gathered during the impeachment inquiry – including transcripts of the closed depositions and appending information and materials.", "“I write to ask if — pursuant to H. Res. 660 and the relating Judiciary Committee Impeachment Inquiry procedures — you and your counsel plan to attend the hearing or make a request to question the witness panel,” Nadler’s letter said.", "The resolution itself, which was included in the letter, said: “The House authorizes the Committee on the Judiciary to conduct proceedings relating to the impeachment inquiry referenced in the first section of this resolution pursuant to the procedures submitted for printing in the Congressional Record by the chair of the Committee on Rules, including such procedures as to allow for the participation of the President and his counsel.”", "In a section of the letter that bears the headline “Impeachment Inquiry Procedures in the Committee on the Judiciary,” Nadler laid out the procedures – including this offer to the president and his legal team:", "Nadler letter to Trump, Nov. 26, 2019: The President’s counsel shall be furnished a copy of the report(s), record(s) or other materials referenced in section 2(5) and (6) or section 3 of H. Res. 660, and any material furnished to the Committee pursuant to this section. The President and his counsel shall be invited to attend and observe the initial presentations, and the President’s counsel may ask questions, subject to instructions from the chair or presiding member respecting the time, scope and duration of the examination.", "Section 2 of H. Res. 660 refers to these records:", "(5) The chair is authorized to make publicly available in electronic form the transcripts of depositions conducted by the Permanent Select Committee in furtherance of the investigation described in the first section of this resolution, with appropriate redactions for classified and other sensitive information.", "(6) The Permanent Select Committee is directed to issue a report setting forth its findings and any recommendations and appending any information and materials the Permanent Select Committee may deem appropriate with respect to the investigation described in the first section of this resolution. The chair shall transmit such report and appendices, along with any supplemental, minority, additional, or dissenting views filed pursuant to clause 2(l) of rule XI, to the Committee on the Judiciary and make such report publicly available in electronic form, with appropriate redactions to protect classified and other sensitive information. The report required by this paragraph shall be prepared in consultation with the chairs of the Committee on Foreign Affairs and the Committee on Oversight and Reform.", "The records referenced in section 3 described “additional materials” that may be transferred from the House intelligence committee to the Judiciary Committee.", "Nadler gave the president until Dec. 1 to respond — three days before the first hearing, which was scheduled for Dec. 4.", "Cipollone, the White House counsel, replied by the Dec. 1 deadline with a letter that said the president and his legal team would not participate in the Dec. 4 hearing, but reserved the right to decide if he will attend future hearings. Cipollone criticized the hearing format, which he described as “an academic discussion” that would not “provide the president with any semblance of a fair process.”", "The Dec. 4 hearing was limited to testimony from four constitutional scholars on the constitutional grounds for impeachment.", "“[A]n invitation to an academic discussion with law professors does not begin to provide the President with any semblance of a fair process,” Cipollone wrote. “Accordingly, under the current circumstances, we do not intend to participate in your Wednesday hearing.”", "On Dec. 6, Cipollone wrote a second letter to Nadler that called the impeachment inquiry “completely baseless” and a “waste” of time. He didn’t say whether the White House would participate in any future hearings, but that same day an unnamed White House official told CNN: “The letter communicates that we will not participate in this process.”", "The Judiciary Committee held a hearing on Dec. 9 that was limited to testimony from the majority and minority committee lawyers for the House intelligence and judiciary committees.", "On Dec. 13, the committee voted along party lines, 23-17, to approve two articles of impeachment against Trump.", "In a 658-page report, “Impeachment of Donald J. Trump President of the United States,” the committee said, “Consistent with House precedent, after the evidence arrived at the Judiciary Committee, the Committee invited President Trump and his counsel to participate in the process. Notably, and unlike past Presidents, President Trump declined to attend any hearings, question any witnesses, or recommend that the Committee call additional witnesses in his defense.”", "Cipollone repeated a false talking point about a dramatic interpretation Schiff once gave of Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky.", "Cipollone, Jan. 21: Let’s remember how we all got here: They made false allegations about a telephone call. The president of the United States declassified that telephone call and released it to the public. How’s that for transparency? When Mr. Schiff found out that there was nothing to his allegations, he focused on the second telephone call. … When Mr. Schiff saw that his allegations were false, and he knew it anyway, what did he do? He went to the House and he manufactured a fraudulent version of that call. He manufactured a false version of that call; he read it to the American people, and he didn’t tell them it was a complete fake.", "On Sept. 25, Trump did release a White House memo of his July 25 phone call, which was at the heart of an anonymous whistleblower complaint that prompted the impeachment inquiry. That memo backed up the main points the whistleblower made about the phone call. In fact, Acting Director of National Intelligence Joseph Maguire testified that the complaint “is in alignment with” the memo.", "There was a second, previous phone call on April 21, for which Trump released a memo in mid-November, but that call wasn’t the focus of the complaint.", "Schiff did give an embellished rendition of the White House memo of the July phone call at the start of a Sept. 26 House intelligence committee hearing. As we’ve explained before, Schiff said he was recounting “the essence of what the president communicates” and “in not so many words.”", "We leave it for readers to judge whether or not it was immediately clear that Schiff was giving his own take on the call. Some of what he said was similar to the memo, and some of it wasn’t. But it was clear to at least one Republican member in the hearing, who called out Schiff for the embellishments about an hour after the chairman’s dramatized remarks.", "A few minutes later, Schiff responded: “My summary of the president’s call was meant to be at least part in parody.”", "Sekulow also made a misleading claim about special counsel Robert Mueller’s report on Russian interference in the 2016 presidential election.", "The Mueller report concluded that “[t]he Russian government interfered in the 2016 presidential election in sweeping and systematic fashion” in a successful attempt to help elect Trump.", "Russia did this through two operations: “a social media campaign that favored … Trump and disparaged presidential candidate Hillary Clinton,” and “computer-intrusion operations” that allowed Russia to steal and then release emails and documents that were damaging to the Clinton campaign.", "The special counsel’s office also investigated whether Trump or his campaign associates and allies coordinated with Russia on any of this illegal activity. Sekulow said that part of the investigation came up “empty.”", "Sekulow, Jan. 21: And then we had the invocation of the ghost of the Mueller report. I know something about that report. It came up empty on the issue of collusion with Russia. There was no obstruction. In fact, the Mueller report — to the contrary of what these managers say today — came to the exact opposite conclusions of what they say.", "It’s true that the Mueller report did not conclude that Trump committed a crime by either coordinating with the Russians or obstructing justice, but the investigation did not come up “empty” on either obstruction of justice or collusion.", "On obstruction of justice, the Mueller report documented 11 “key events” where the president attempted to influence the investigation.", "“Our investigation found multiple acts by the President that were capable of exerting undue influence over law enforcement investigations, including the Russian-interference and obstruction investigations,” the report said. “The incidents were often carried out through one-on-one meetings in which the President sought to use his official power outside of usual channels. These actions ranged from efforts to remove the Special Counsel and to reverse the effect of the Attorney General’s recusal; to the attempted use of official power to limit the scope of the investigation; to direct and indirect contacts with witnesses with the potential to influence their testimony.”", "The report, however, said there were “difficult [legal] issues that would need to be resolved,” in order to reach a conclusion on Trump’s conduct.", "Factoring into his decision not to weigh in on prosecution, Mueller wrote, was an opinion issued by the Office of Legal Counsel finding that “the indictment or criminal prosecution of a sitting President would impermissibly undermine the capacity of the executive branch to perform its constitutionally assigned functions” in violation of “the constitutional separation of powers.”", "Mueller report: Because we determined not to make a traditional prosecutorial judgment, we did not draw ultimate conclusions about the President’s conduct. The evidence we obtained about the President’s actions and intent presents difficult issues that would need to be resolved if we were making a traditional prosecutorial judgment. At the same time, if we had confidence after a thorough investigation of the facts that the President clearly did not commit obstruction of justice, we would so state. Based on the facts and the applicable legal standards, we are unable to reach that judgment. Accordingly, while this report does not conclude that the President committed a crime, it also does not exonerate him.", "The special counsel’s investigation also “did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.” But it presented evidence of “multiple contacts … between Trump Campaign officials and individuals with ties to the Russian government.”", "Those contacts included Donald Trump Jr.’s eagerness to accept “very high level and sensitive information” that promised to “incriminate Hillary” as “part of Russia and its government’s support for Mr. Trump,” as laid out in an email Trump Jr. received from a Russian acquaintance. “[I]f it’s what you say I love it,” responded Trump Jr., who days later attended a meeting expecting to obtain the material from a Russian lawyer who “had previously worked for the Russian government and maintained a relationship with that government throughout this period of time,” the Mueller report said.", "Among other incidents, Trump Jr. also made direct contact with WikiLeaks’ Twitter account and Trump confidant Roger Stone exchanged Twitter messages with Guccifer 2.0, which the Mueller report describes as one of two “online personas” used by Russian military intelligence to release hacked Clinton campaign emails to media outlets and WikiLeaks.", "“In sum, the investigation established multiple links between Trump Campaign officials and individuals tied to the Russian government. Those links included Russia offers of assistance to the Campaign. In some instances, the Campaign was receptive to the offer, while in other instances the Campaign officials shied away,” the report said. “Ultimately, the investigation did not establish that the Campaign coordinated or conspired with the Russian government in its election-interference activities.”", "Senate Majority Leader McConnell claimed that his resolution outlining the Senate impeachment trial procedures “tracks closely” with the rules in trials of former presidents.", "McConnell, Jan. 21: The organizing resolution we’ll put forward already has the support of a majority of the Senate. That’s because it sets up a structure that is fair, evenhanded, and tracks closely with past presidents that were established unanimously.", "But the proposed Senate impeachment trial procedures that McConnell released on Jan. 20 — and the amended ones the Senate later adopted in a party-line vote the next day — differ from the unanimously approved Clinton trial rules in a few ways.", "For example, McConnell’s original resolution does not automatically admit into evidence records from the House impeachment inquiry, which is what happened during the Clinton impeachment trial. Instead, McConnell was pressured by Democrats and some Republicans into amending his resolution to state that materials from the House inquiry “will be admitted into evidence,” rather than “may be admitted into evidence” based on a vote. Still, McConnell added language stipulating that the admission of such evidence was subject to an objection from Trump’s defense team.", "McConnell’s original proposal also called for members of the House and the president’s defense team to make their respective opening cases for or against impeachment in 24 hours, over no more than two days. But during the Clinton trial, House managers and the president’s lawyers were given 24 hours to do the same, with no restriction on the number of days it could take.", "McConnell ended up changing his resolution to permit both sides up to three days to make their arguments.", "And while the Clinton trial rules called for senators to vote on a motion to dismiss the impeachment, that same language was not included in the rules for the Trump trial. It’s possible, though, that Trump’s defense could still propose such a motion.", "During Trump’s trial, after both sides make their opening case, senators will be given 16 hours to ask questions. That is to be followed by an additional four hours of arguments, split equally between the House managers and the team representing the president. This will occur before the senators debate and then vote on whether to subpoena new witnesses or documents not already admitted into the record.", "Those additional rules are much like those for Clinton’s trial in 1999.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]