["About this rating", "A January 2019 letter from a landlord in Arkansas to her tenants highlighted the mounting concern over the effect of an ongoing partial government shutdown on persons relying upon federal assistance to cover their housing costs.", "Annette Cowen's directive to residents at the apartment complexes she runs in the state was first reported by local news outlets before spreading online:", "To all tenants:", "Due to the shutdown of the federal government, your rental assistance portion of your rent is not being paid. As of now, you have no rental assistance and your rent must be paid prior to January 20th or eviction procedures may begin against you. Until the government opens again, you are responsible for ALL your rental amount. Your complex is not in the business of furnishing free rent. Rent must be paid prior to January 20th or eviction proceedings may begin against you. If rents are not collected the complex has no money to pay bills including water, sewer and garbage.", "I would suggest you personally contact your Senators and Representatives in Washington D.C. if you want your rental assistance to be paid. You must pay all your rent immediately.", "Cowen told another local news outlet she wanted her tenants to understand her \"situation.\"", "\"It's more than just having a roof over their head,\" she said. \"What good is that if there is no water and no heat.\"", "A number of the residents renting from Cowen take part in the Section 515 rural housing program operated by the U.S. Department of Agriculture (USDA). That program is for people with low to moderate incomes or living with disabilities.", "But it is unclear whether Cowen would have the ability to carry out evictions in the event the government shutdown, which began in December 2018, continued to stop landlords from receiving the federal subsidies. Those funds help people who use Section 515 or its counterpart, Section 8, the program administered by the federal department of Housing and Urban Development (HUD).", "\"There's no way that they can evict anybody,\" Democratic Rep. Collin Peterson of Minnesota said of the situation concerning her tenants. Peterson is the ranking member of the House Agriculture Committee, which oversees the USDA.", "Also, at least one HUD regulation on housing vouchers issued under Section 8 states that tenants cannot be evicted in the event their voucher payments are not available. The agency itself advised landlords taking part in programs serving multi-family households in a letter on 4 January 2019 that they use their own reserve accounts to cover a lapse in funding, instead of carrying out evictions.", "Thirteen days after HUD's letter to landlords, Rep. Marc Veasey of Texas and Virginia Sen. Mark Warner, both Democrats, released their own letter signed by 170 Democratic Party lawmakers urging President Donald Trump to re-open HUD to avoid a potential crisis. That letter read in part:", "\"The American people should not be used as leverage, or be held hostage, to fulfill a political agenda. The longer this shutdown extends, the more harm will be done to seniors, families with children, people with disabilities, and other Americans who rely on these programs. We urge you to end this shutdown and provide immediate relief to Americans being impacted by this funding crisis. In these times of uncertainty and tension, we must continue to prioritize the American people.\"", "Republican lawmaker Rick Crawford, who represents Arkansas's First Congressional District, said of the possibility of evictions: \"We wouldn't allow that to happen.\" We contacted his office asking if he had specific actions in mind to avoid that prospect but did not hear back.", "Days after Cowen's letter circulated online, she said she had been contacted by a USDA official who told her there would be enough funding to provide subsidies for her tenants relying on them through at least February 2019.", "\"You all did a really good job by contacting your senators and representatives and you all got the job done!\" she said in a new letter to residents. \"You can be assured that all the news people are aware of our situation both statewide and nationwide. Thank you for the help! Your voice does matter! Hopefully our government will open back up soon and our lives will be back to normal.\"", "We also contacted the House Committee on Financial Services asking for more specific information as to how long the program helping Cowen's tenants could be funded in the event that the government shutdown extended past January 2019, but had yet to hear back.", "Esparza, Michael.   \"Government Standoff Putting Landlord & Tenants at Odds.\"\r\n    KARK-TV.   14 January 2019.", "Monk, Ginny.   \"Letter to Residents at Arkansas Complexes Sets Off Panic Over Cash to Pay Rent.\"\r\n    Arkansas Democrat-Gazzette. 17 January 2019.", "Briggs, Zack.   \"Partial Government Shutdown Impacting Those Living in Federally-Subsidized housing.\"\r\n    KATV-TV.   13 January 2019.", "Delaney, Arthur and Sanjana Karanth.   \"Arkansas Eviction Scare Is a Preview of Shutdown Hell.\"\r\n    Huffington Post.   17 January 2019.", "Government Publishing Office.   \"Electronic Code of Federal Regulations.\"\r\n    Accessed 17 January 2019.", "The Washington Post.   \"HUD's Jan. 4 Letter to Landlords, On the Shutdown.\"\r\n    Accessed 17 January 2019.", "Correction [18 January 2019]: Updated the story to reflect that the rural housing subsidy program is overseen by the House Committee on Financial Services.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]