["About this rating", "In a letter shared by the joint labor union Screen Actors Guild and American Federation of Television and Radio Artists (SAG-AFTRA) on Feb. 4, 2021, former U.S. President Donald Trump resigned as a member of the union. Trump’s resignation came just as the union leadership was moving to expel Trump in the wake of his alleged provocation of a mob that attacked the U.S. Capitol on Jan. 6.", "The letterhead appeared to carry the logo for what was called the “Office of the Former President,” created by Trump’s team in Palm Beach, Florida, to serve as the official outlet for Trump’s statements and to share his future plans.", "However, now, the stationery on which the letter was submitted says “Office of Donald J. Trump.”", "The letter was shared on SAG-AFTRA’s website, along with the union's response to Trump, which was a simple, “Thank you.”", "As seen in the document, the end of the letter is indeed signed with “President Donald J. Trump.”", "In the letter, Trump cited his own acting experience and contributions to television:", "I’m very proud of my work on movies such as Home Alone 2, Zoolander and Wall Street: Money Never Sleeps; and television shows including The Fresh Prince of Bel-Air, Saturday Night Live, and of course, one of the most successful shows in television history, The Apprentice – to name just a few! I’ve also greatly helped the cable news television business (said to be a dying platform with not much time left until I got involved in politics), and created thousands of jobs at networks such as MSDNC and Fake News CNN, among many others.", "He concluded with a criticism of the union’s actions:", "Your organization has done little for its members, and nothing for me – besides collecting dues and promoting dangerous un-American policies and ideas – as evident by your massive unemployment rates and lawsuits from celebrated actors, who even recorded a video asking, “Why isn’t the union fighting for me?” These, however, are policy failures. Your disciplinary failures are even more egregious. I no longer wish to be associated with your union.", "Professor and author Seth Abramson pointed out how signing the letter this way is “troubling,” given that Trump is on trial for inciting the riots:", "However, signing a letter as “President” does not appear to be out of the ordinary. Former President Barack Obama's statements are also released under \"President Obama.\" Former presidents are still addressed as “President [insert name]” or “Mr. President.” All U.S. presidents retain their titles for life.", "Given that the official letter was shared by SAG-AFTRA, along with Trump’s signature, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]