["About this rating", "On 18 April 2017, The Last Line of Defense posted an article positing that Michelle Obama filed for divorce after discovering that former president Barack Obama had a pregnant mistress:", "According to her lawyer, Alan Dershowitz, Michelle Obama has filed for divorce on the grounds of infidelity. Shortly after reports came out of her husband’s affair, Mrs. Obama took Sasha and left DC to go stay in the family mansion in Chicago. When she saw the picture of the woman who was about to ruin her marriage and bring her husband’s third child into the world, she immediately called for backup.", "Dershowitz is an old friend of Michelle’s from Harvard.This is the picture that has her in an uproar:", "If the claim were legitimate, it would likely come as a surprise to the British woman pictured in the article as well as her husband, an electrician named Steven. The photograph was published in a UK tabloid in June 2012 as part of an article about women and their experiences with post-pregnancy changes to their bodies. There was absolutely no connection between the years-old tabloid article and Barack Obama.", "The Last Line of Defense (The Resistance) is an openly junk news site that consistently hoodwinks readers, but whose disclaimer admits its \"satirical\" purpose:", "The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "In other words, none of its stories include any truth — including this one.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]