["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Feeding off of the national discussion about the prominence of Confederate statues, a fake news article claimed one state went so far as to change its name to distance itself from the country’s first president.", "The fake news headline said, \"Washington State Legislature votes to change its name because George Washington owned Slaves.\"", "With 50,267 shares as of Sept. 27, the article says that the state is now named \"Soros State,\" after investor and philanthropist, George Soros for, according to the article, all of his help in eliminating the history of slavery in the United States.", "However, the Soros State does not exist, because the state of Washington did not change its name.", "The article was made on a site called www.breakingnews365.net. The About section at the bottom of this site states, \"This website is an entertainment website, news are created by users. These are humourous news, fantasy, fictional, that should not be seriously taken or as a source of information.\" (The poor grammar is how it appears on the page.)", "The main page of www.breakingnews365.net gives users the option to \"prank your friends now\" and create his or her own article. It also gives users the option to add a photo and suggests that he or she should make titles that would \"make your friends curious.\"", "There is also an identical website called www.breakingnews247.net that PolitiFact has reported on before.", "But if you missed the warning at the bottom of the page and the grammar mistakes within the article, there are other ways to disprove the validity of this article.", "George Soros is the founder of Open Society Foundations, a philanthropic organization devoted to strengthening democracy and protecting marginalized communities. In the past, he advocated for Georgetown University to offer financial aid for African-American students \"whose forbears were slaves.\"", "But unlike what the story claimed, Soros does not have any apparent history of trying to eliminate the history of slavery in the United States.", "The breakingnews365.net article does not specify when the special session was that would have approved the name change. The Washington State Legislature adjourned its last special session July 20, 2017.", "The Washington State Legislature’s report of all the bills passed in 2017 contains no mention of a bill that changes the name or a recent special session.", "The statement that Washington state changed its name is made up, so we rate it Pants on Fire!", "www.breakingnews365.net, Washington State Legislature votes to change its name because George Washington owned Slaves, Sept. 24, 2017", "http://www.breakingnews365.net, Prank Your Friends Now", "www.breakingnews247.net, Prank Your Friends Now", "PolitiFact, Carnival isn’t giving hurricane victims a free cruise, despite fake news post, Sept. 21, 2017", "Open Society Foundations, Missions & Values", "New York Times, The Slave’s in Georgetown’s Past, Apr. 25, 2016", "Washington State Legislature, What’s Happening on the Floor?", "Washington State Legislature, BILLS PASSED THE 2017 LEGISLATURE, July 24, 2017", "Business Insider, The incredible life of billionaire investing legend George Soros, Jan. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]