["About this rating", "On Oct. 6, 2016, a rumor raced through social media that Joyce Meyer, a Christian writer and inspirational speaker, had suddenly died after a short illness. The rumor was fueled wholesale by an article from a previously-unknown web site of extremely dubious veracity called Updater24:", "According to the reports, she died a few minutes on arrival at the hospital and details of the cause of her death was not given as her body has now been sent for autopsy.", "Several world renowned ministers of God have turned on Twitter to express their shock for Joyce's demise.", "Joyce Meyer, 73, is a Charismatic Christian author and speaker and president of Joyce Meyer Ministries. Meyer and her husband Dave have four grown children, and live outside St. Louis, Missouri.", "Updater24's \"About\" page contains no disclaimer stating its content is untrue or intended to be satirical. However, some of its other articles (with headlines such as \"BREAKING: Garden of Eden Discovered in Grenada\", for example) and the lack of bylines, along with entire passages entirely copied and pasted from Wikipedia pages, follow the same pattern as other pages that specialize in hoax news, which generate clicks and in turn, advertising revenue for their owners.  (Some also contain malware.)", "If someone as high profile as Meyer were to suddenly die, the news would certainly appear on her own web page or in her hometown newspaper, not an obscure site that has no bylines or contact information, and which appears to only specialize in clickbait and plagiarized content.", "News of Joyce Meyer's untimely death also didn't appear to have reached Joyce Meyer herself, who, hours after the unfortunate news broke, was still tweeting:", "It is tremendously uplifting to think on the goodness of God and all the marvelous works of His hands. #Battlefield20", "— Joyce Meyer (@JoyceMeyer) October 7, 2016", "Meyer later released a video to further quash the death hoax:", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]