["U.S. Sen. Ron Johnson, shown here in an interview, has attacked Democratic challenger Russ Feingold on Social Security and is the target of an attack regarding Social Security. (Milwaukee Journal Sentinel)", "Social Security is one of the most commonly used vehicles for attack ads in election campaigns. And the Wisconsin U.S. Senate race, which will be decided Nov. 8, 2016, is no exception.", "Republican incumbent Ron Johnson said his Democratic challenger, former U.S. Sen. Russ Feingold, \"voted to raise taxes on Social Security benefits for seniors\" and \"tried to give Social Security benefits to illegal immigrants.\" Our rating was Mostly False. Feingold did support a measure that increased taxes on Social Security benefits for higher-income seniors, not across the board, but did not try to give benefits to illegal immigrants.", "Mostly False was also our rating when the Wisconsin Democratic Party said Johnson \"supported a plan to cut benefits and raise the retirement age\" for Social Security. Johnson has said he is open to considering such proposals and he voted for a federal budget proposal that contained them. But voting for a federal budget proposal and its myriad programs isn’t an explicit show of support for cutting benefits and raising the retirement age for Social Security.", "(Go here to see all of our fact checks in the Johnson-Feingold race.)", "Now comes Americans United for Change, a liberal advocacy group that released an ad Oct. 26, 2016 that makes this claim:", "\"Ron Johnson calls Social Security a Ponzi scheme and wants to privatize the program.\"\n\nWe’ll check both parts.", "‘Ponzi scheme’", "During the U.S. Senate campaign in 2010, in which Johnson ousted Feingold, Johnson said Washington politicians \"run Social Security like a Ponzi scheme\" (a claim we rated Mostly False). A Ponzi scheme is illegal -- it’s an investment fraud that involves the payment of purported returns to existing investors from funds contributed by new investors.", "Johnson has emphasized the pay-as-you-go nature of Social Security -- using taxes on today’s wage earners to fund the retirement checks of millions of Americans -- and decried the \"raiding\" of the Social Security trust fund.", "The claim from Americans United for Change, though, is that Johnson currently calls Social Security a Ponzi, not that it’s run like one.", "The Huffington Post reported that Johnson told a local Americans for Prosperity group in June 2016: \"We’ve got to convince more of our fellow citizens that Social Security really is — and by the way, I was wrong when I said this in 2010, I said it’s a Ponzi scheme. Ponzi schemes are illegal. So, Social Security is — it’s a legal Ponzi scheme.\"", "Johnson has also called Social Security a legal Ponzi scheme on other occasions during the current campaign.", "‘Privatize the program’", "The Huffington Post article said Johnson supported privatizing Social Security, but that the public wasn’t ready for the idea. He was quoted as saying: \"Currently, politically, you can’t do it.\" The article didn’t say whether Johnson explained what sort of privatizing he would favor.", "Johnson’s campaign did not dispute the Huffington Post story, which the website said was based on a recording it obtained. The campaign told us Johnson is willing \"to consider any serious proposal that would protect Social Security.\"", "In 2015, Johnson told a small of group of people he would \"take a look\" at a form of privatization, according to a video clip that was posted to YouTube. He said perhaps he would be open to raising taxes for Social Security if people could keep part of the funds rather than having them go to the Social Security fund. Johnson also said it \"was a shame\" that a privatization initiative from President George W. Bush wasn’t explored more fully.", "And that brings up an important point.", "The claim that Johnson \"wants to privatize the program\" could be taken to mean a complete privatization. But there is no indication he backs that. The Bush initiative amounted to partial privatization. It would have allowed younger workers to contribute portions of payroll taxes into government-approved private mutual fund accounts.", "Our rating", "Americans United for Change says: \"Ron Johnson calls Social Security a Ponzi scheme and wants to privatize the program.\"", "Ponzi schemes are illegal. Johnson calls Social Security a legal Ponzi scheme to emphasize that it uses taxes on today’s wage earners to fund the retirement checks of millions of Americans.", "Johnson has expressed support for some form of privatization of Social Security, such as allowing individuals to invest some of their Social Security contributions, but it’s not clear that he backs complete privatization.", "https://www.sharethefacts.co/share/9edf489e-cf8b-41ad-b0f3-359c9ac03823", "YouTube, Americans United for Change ad, Oct. 26, 2016", "Huffington Post, \"GOP Senator Calls Social Security A ‘Legal Ponzi Scheme,’\" June 23, 2016", "Interview, Ron Johnson campaign spokesman Ben Voelkel, Nov. 4, 2016", "Email, Americans United for Change spokesman Jeremy Funk, Nov. 3, 2016", "YouTube,  video clip of Ron Johnson talking to voters, Sept. 1, 2015", "Ashland Daily Press, \"Johnson talks issues during stop in Ashland,\" Aug. 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]