["About this rating", "The number of mail collection boxes declined by more than 12,000 nationally from 2011 to 2016, according to an August 2016 report, largely because they were underused.", "It is difficult to prove that the removal of these mailboxes during the Obama administration was politically motivated, or at all connected to elections.", "Amidst mounting concerns over the U.S. Postal Service’s ability to handle an influx of mail-in ballots for the November 2020 election due to  COVID-19 quarantines, a spate of mailbox removals across the country in the summer of 2020 led to accusations from Democrats that U.S. President Donald Trump’s Republican administration was hindering the voting process. In response, numerous conservative media outlets argued in August 2020 that thousands of mailboxes were also removed during U.S. President Barack Obama's administration — mainly from 2011 to 2016.", "Snopes readers asked us to verify whether mailboxes had indeed been removed during the Obama years. We learned this was true — but some context is in order.", "Here's the background: In the summer of 2020, Democrats accused the Trump administration of actively harming the Postal Service’s ability to function in an effort to hurt the voting process in November. Reports mounted of mailboxes being removed, high-speed mail sorting machines being taken out of service, and postal workers being asked to work reduced hours. Trump also said he opposed additional funding for the Postal Service because that could make mail-in voting easier (which he has argued would favor Democrats), though he clarified he was concerned about voter fraud (a claim we have debunked). In mid-August, the Postal Service warned states that workers may not be able to deliver ballots on time based on current election rules. We could neither prove nor disprove the Democrats' claims in a previous investigation.", "Conservative media — including Fox News, Breitbart, and The Blaze — countered the accusations from Trump's critics by referring to an August 2016 report from the Postal Service's Office of Inspector General that outlined the declining number of mail-collection boxes during the previous five years. Nationally, the number of collection boxes declined by more than 12,000, from 2011 to 2016. This decline was criticized by customers at the time, who said USPS had “gone too far.”", "However, the reasons for the decline in the number of mailboxes during the Obama years appeared to have little to do with politics surrounding elections. According to the 2016 report:", "As the Postal Service adapts its collection infrastructure to meet customers’ needs at a reasonable cost, it has eliminated underused collection boxes that on average receive fewer than 25 pieces a day, and added collection boxes that are convenient for customers.", "In fact, the number of blue steel mailboxes across the U.S. has been steadily declining for decades under various administrations. In 1985, the country had 400,000 mailboxes. In 2011, there were 160,000. Today, there are around 142,000 collection boxes in operation. Many blame the gradual death of the Postal Service on the growth of the internet, labor costs, and congressional meddling.", "Since he took over in June 2020, Postmaster General Louis DeJoy instituted the aforementioned series of changes that led to accusations from Democrats that the Postal Service was being deliberately gutted. He also announced a hiring freeze and banned “unnecessary overtime,” and reports grew of letters piling up at post offices as mail-sorting equipment was removed. DeJoy has also been a prominent political ally to Trump, which fueled some of the fire, too.", "On Aug. 18, after public outcry, DeJoy announced that mailboxes would no longer be removed. U.S. House Speaker Nancy Pelosi tweeted that she had a conversation with DeJoy where he admitted that he did not intend to replace the missing infrastructure, which she feared would disenfranchise voters. In his statement, DeJoy said:", "The Postal Service is ready today to handle whatever volume of election mail it receives this fall. Even with the challenges of keeping our employees and customers safe and healthy as they operate amid a pandemic [...]", "Snopes reached out to the Postal Service for details about the quantity of mailboxes that had been removed in 2020, and how that compared with the number of mailboxes removed during the Obama years. The agency did not offer specifics, with a spokesperson telling us that removals are often instituted due to declining mail volumes:", "[...]the Postal Service reviews collection box density every year on a routine basis to identify redundant/seldom used collection boxes as First-Class Mail volume continues to decline. Based on the density testing, boxes are identified for potential removal and notices are placed on boxes to give customers an opportunity to comment before the removal decision is made.", "To sum up, it is true that the number of mailboxes fell significantly in the Obama years, but this was part of a decades-long decline. The politically motivated argument also established a false equivalency by comparing vastly different time ranges, and disregarding how the many policy changes instituted over the last few months could potentially impact voting by mail. We thus rate this claim as “Mostly True.”", "Blitzer, Ron.   \"USPS flashback: Obama administration removed thousands of mailboxes.\"\r\n   Fox News.   18 August 2020.", "Evon, Dan.   \"Were USPS Mailboxes Removed in Oregon?\"\r\n   Snopes.   14 August 2020.", "Jones, Carolyn.   \"Mailboxes Disappearing as Usage Drops Off.\"\r\n   San Francisco Chronicle.   8 September 2011.", "Kaufman, Ellie.   \"Postal Service Warns Nearly Every State it May Not be Able to Deliver Ballots in Time Based on Current Election Rules.\"\r\n   CNN.   15 August 2020.", "Lee, Jessica.   \"Do Mail-In Ballots Increase Risk of Voter Fraud?\"\r\n   Snopes.   26 May 2020.", "Lee, Jessica.   \"Is USPS Purposefully Slowing Mail To Help Reelect Trump?\"\r\n   Snopes.   6 August 2020.", "Meixner, Sophie.   \"The United States Postal Service is Under the Spotlight Leading Up to The Election. Here's A Breakdown.\"\r\n   ABC.net.au.   18 August 2020.", "Office of Inspector General: United States Postal Service.   \"Collection Box Removal Process - Eastern Area.\"\r\n   22 August 2016.", "Pollak, Joel B.   \"Fact Check: Obama-Biden Removed at Least 14,000 Mailboxes.\"\r\n   Breitbart.   17 August 2020.", "Sacca, Paul.   \"Flashback: Thousands of USPS Mailboxes Removed During Obama-Biden Administration.\"\r\n   The Blaze.   16 August 2020.", "Schwartz, Matthew S.   \"Democrats Warn Of 'Assault' On The Postal Service As Election Nears.\"\r\n   NPR.   15 August 2020.", "USPS.com.   \"Postmaster General Louis DeJoy Statement.\"\r\n   18 August 2020.", "Weissmann, Jordan.   \"Who Killed the Postal Service?\"\r\n   The Atlantic.   5 December 2011.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]