["The image was uploaded to Facebook here by New Zealand-based former blues musician and former political candidate Billy Te Kahika.", "The image shows what appear to be two giant beach chairs with green seats. The logo on the seats shows the name of the Israeli city of Tel Aviv-Yafo, also known as Tel Aviv.", "One message on a beach chair states in English “RESERVED FOR VACCINATED PEOPLE ONLY”. The other Hebrew-language message on the other chair reads: “Being vaccinated now in Tel Aviv-Yafo.”", "The caption of the Facebook post goes on to say that “Prominent Doctors in Israel are now starting to speak up about the negative impacts. Equally as important is this new form of apartheid & persecution that is coming”.", "A reverse image search shows in the past both Gordon and Frishman beaches in Tel Aviv with oversized chairs on the beach sporting messages, see here and here.", "The two beaches, situated within 500 metres of each other, are a key attraction in Tel Aviv. The chairs measure 1.8 by 2.4 metres and are intended to “give people something to take a picture with”, according to this report by American/Israeli online magazine Israel21C.", "The misleading post’s caption reads in part: “This just in from Israel showing how the Government of Israel is setting up for persecution and isolation of those who do not wish to be part of a clinical trial.”", "Billy Te Kahika is a prominent anti-lockdown advocate and conspiracy theorist who has consistently spread misinformation on social media, according to an AFP report.", "AFP Fact Check debunked some of his claims made on social media in the lead up to the 2020 New Zealand General Election, see here and here.", "The image has also been shared by Facebook users from around the world  here, here and here.", "The claim, however, is misleading as it omits important context: The chairs' messages were voicing support for vaccinations in Israel, but have been removed due to a translation error from Hebrew to English.", "A spokesperson for the Tel Aviv municipality, the government body responsible for the chairs, confirmed with AFP the photo featured in the Facebook post shows the seats at Frishman Beach with messages supporting vaccinations in Israel.", "However, the messages were removed February 28, 2021, after the municipality realised they were being misinterpreted due to a translation error, the Tel Aviv municipality said in a March 10 email.", "\"The writing on the chairs represented part of a campaign to support vaccinations among the wider public. We made an error with regards to the wording and the message was interpreted differently than intended,” said the spokesperson.", "The English message on the chairs read “RESERVED FOR VACCINATED PEOPLE ONLY”, but the Hebrew version stated “BEING VACCINATED NOW IN TEL AVIV-YAFO”.", "Images of the beach chairs uploaded to Facebook here and here show the English version of the message was removed from one of the chairs. See screenshots below.", "The Tel Aviv municipality eventually removed the Hebrew message and replaced them with “I LOVE TEL AVIV-YAFO” in both English and Hebrew, as seen in this photo supplied by Tel Aviv Yafo below.", "According to the Tel Aviv municipaliy spokesperson, the city has not separated beach chairs on it's beaches based on someone’s vaccination status; has not done so in the past and has no plans to do it in the future.", "Israel has outpaced the rest of the world when it comes to administering COVID-19 vaccines to its population, with 53.7 percent of Israelis having received the first dose of the COVID-19 vaccine and 41.5 percent the second, according to this report from Isreali newspaper Haaretz.", "The country has also instituted a vaccination certificate called a Green Pass which allows people who are fully vaccinated to avoid some Covid-19 restrictions. “The certificate takes effect one week after receiving the second dose and expires after six months,” reads the Israeli Health Ministry website.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]