["By D'Angelo Gore", "Posted on February 6, 2019", "Stacey Abrams, in the Democratic response to President Donald Trump’s State of the Union address, presented a distorted picture of the U.S. economy since the Republican-backed tax bill became law.", "“The Republican tax bill rigged the system against working people,” said Abrams, a former Georgia state legislator who lost her bid to become governor last year. “Rather than bringing back jobs, plants are closing, layoffs are looming, and wages struggle to keep pace with the actual cost of living.”", "It’s true that some manufacturing companies in the U.S., such as General Motors, have recently announced plant closures and employee layoffs. But, overall, both total employment and manufacturing employment are up since Trump took office in January 2017, and since he signed the Tax Cuts and Jobs Act into law in December 2017.", "As of this January, total nonfarm employment was up nearly 4.9 million since Trump took office, and it had increased almost 3 million since the tax law was enacted, according to Bureau of Labor Statistics estimates. In addition, employment in the manufacturing sector is up 454,000 since Trump became president, including 277,000 while the tax law has been in effect.", "Also, weekly earnings, in inflation-adjusted dollars, have been going up under the Trump administration, although Abrams said “wages struggle to keep pace with the actual cost of living.” (Inflation and the cost of living are not exactly the same, but they are closely related.)", "BLS data show that, as of December, real (or inflation-adjusted) average weekly earnings for rank-and-file production and nonsupervisory workers have gone up 2.6 percent since Trump took office, and almost 1.4 percent since the tax bill became law in December 2017.", "Similarly, the average real weekly earnings of all private-sector workers have increased by 2.6 percent during Trump’s tenure, and nearly 1.4 percent since December 2017.", "We recently wrote about a similar claim when Sen. Kamala Harris, a Democratic presidential candidate, said, “The cost of living is going up, but paychecks aren’t keeping up.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]