["About this rating", "A local Illinois television station accidentally aired a graphic that appeared to show the results from the state's 2020 Democratic primary one day before the election.", "The station did not display \"tomorrow's results,\" but rather a test graphic featuring fictional data that was never meant to air.", "On March 16, 2020, a Facebook user was watching a local news broadcast when an image graphic supposedly showing results from a 2020 Democratic presidential primary election popped up on the screen. This wouldn't have been very unusual except for one thing: The election hadn't happened yet.", "The Facebook user posted a video of the broadcast on Facebook. The image graphic in question, shown below, shows former U.S. Vice President Joe Biden winning the Illinois primary with 50% of the vote and defeating Sen. Bernie Sanders:", "WCIA truly did broadcast the above-displayed graphic the day before the 2020 Illinois primary.", "However, this is not a story about election rigging or a news station with unusual prognosticating abilities. This is a story about a broadcasting error.", "Television news stations do a lot of prep work before live broadcasts, especially for an election. One thing they do is make image graphics similar to the one above. Once the visuals are set, reporters can plug in the results and quickly produce an image ready for television. In the case above, one of these \"test\" visuals was accidentally aired on television. CNN made a similar mistake in 2013 when they accidentally published pre-written obituaries for people who were still very much alive.", "WCIA reporter Mark Maxwell reached out to the Facebook user after her post went viral and explained that this was a \"test\" graphic that was never meant to air:", "We do routine test rehearsals before every election to make sure the graphics work properly and to give directors some practice. The error was in putting the dry run on air. That shouldn’t have happened and we’re looking into it. Obviously, we never intended to give the wrong information or wrong impression. None of those numbers were based on any real polling returns. Since your post is being widely shared, I’d appreciate it if you would consider updating the original post so people don’t get the wrong idea.", "Rich Flesch, the News Director of WCIA, also reached out, writing:", "WCIA 3 News --- Sorry it was an error by our team. We are currently doing election rehearsals with test data and not intended to go on TV. We apologize for any inconvenience.", "The user updated her Facebook post to include both of these responses.", "The claim that this image shows \"tomorrow's results\" can also be debunked by looking at the actual results of the primary election in question.", "On March 17, 2020, the day after WCIA accidentally published the test graphic, the election took place and the real results were made available. While the test graphic showed Biden winning with 986,341 votes (or 50%), Biden actually ended up getting 913,067 votes (or 59.1% of the vote). Sanders fared better in the test graphic with 893,249 votes (for 45%); in the election he took in 556,904 votes (or 36%).", "The New York Times.   \"Live: Illinois State Primary Election Results 2020.\"\r\n    17 March 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]