["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During the second presidential debate in St. Louis, Donald Trump tried to pull off the equivalent of making a bank shot while hanging upside down — that is, using the words of First Lady Michelle Obama to hammer Hillary Clinton.", "\"I've gotten to see the commercials that they did on you,\" Trump said. \"And I've gotten to see some of the most vicious commercials I've ever seen of Michelle Obama talking about you, Hillary.\"", "This assertion caught us off-guard, since Michelle Obama has campaigned vigorously for Clinton in this election cycle, including a high-profile speech at the Democratic National Convention in Philadelphia. We didn’t remember \"vicious\" attack ads from Obama during the 2008 campaign, either.", "So what’s going on? There are commercials out there showing Michelle Obama, but it’s not at all clear if she’s talking about Hillary Clinton. And the ads were made by a pro-Trump super PAC.", "What Michelle Obama said", "The Trump campaign didn’t respond to an inquiry for this article, but he appears to be referring to comments made by Michelle Obama on Aug. 12, 2007, at a Women for Obama South Side Community Kickoff gathering at the Grand Ballroom, a historic venue in the Obamas’ hometown of Chicago.", "At the event, which took place during the 2008 primary contest, Michelle Obama said:", "\"One of the things, the important aspects of this race, is role modeling what good families should look like. And my view is that if you can't run your own house, you certainly can't run the White House. Can't do it.\"", "Initially, these comments didn’t attract much attention, though a clip of the event was aired on a local Chicago television newscast.", "However, Michelle Obama made a similar comment on the stump during a visit to Atlantic, Iowa. Here’s what she said:", "\"One of the most important things that we need to know about the next president of the United States is, is he somebody that shares our values? Is he somebody that respects family? Is (he) a good and decent person? So our view was that, if you can't run your own house, you certainly can't run the White House. So, so we've adjusted our schedules to make sure that our girls are first, so while he's traveling around, I do day trips. That means I get up in the morning, I get the girls ready, I get them off, I go and do trips, I'm home before bedtime. So the girls know that I was gone somewhere, but they don't care. They just know that I was at home to tuck them in at night, and it keeps them grounded, and, and children, the children in our country have to know that they come first. And our girls do and that's why we're doing this. We're in this race for not just our children, but all of our children.\"", "Michelle Obama’s comments in Iowa first attracted attention in an Aug. 23, 2007, dispatch by Chicago Sun-Times reporter Jennifer Hunter, who wrote that the comment \"could be interpreted as a swipe at the Clintons.\"", "Hunter’s article was then picked up by the conservative Drudge Report, and from there various television networks and other news outlets followed up. Most reports mentioned the possibility that Michelle Obama was taking a veiled shot at the Clintons’ well-documented marital tribulations.", "Barack Obama rejected that interpretation, saying in a conference call with reporters that \"there was no reference beyond her point that we have had an administration that talks a lot about family values but doesn’t follow through.\" He added that his wife often spoke about children and families in her remarks on the trail.", "It’s possible to see her words as a veiled shot at the Clinton’s marriage. It’s also possible that she was simply expressing pride in how her own family had arranged its affairs to make sure their young children weren’t left out.", "We will leave it to readers to decide which interpretation is closest to the mark. However, we are confident that Trump’s framing of Obama’s comments is incorrect.", "What ad is Trump referring to?", "Hearing Trump’s comments from the debate -- \"I've gotten to see the commercials that they did on you\" -- it sounds as if he intends \"they\" to mean the Obamas. That would be a nice bit of opposition research for the Trump campaign.", "However, the Obamas never aired such commercials. Rather, an ad along those lines has been made by a pro-Donald Trump super PAC.", "The 30-second spot, titled, \"Can’t Run Your House,\" airs footage taken by a local television station from Obama’s 2007 appearance in Chicago. That was the event in which she said, \"One of the things, the important aspects of this race, is role modeling what good families should look like. And my view is that if you can't run your own house, you certainly can't run the White House. Can't do it.\"", "The ad was created by Make America Number 1, a group currently headed by Rebekah Mercer, whose father, hedge-fund billionaire Robert Mercer, initially supported Texas Sen. Ted Cruz during the GOP primaries and then switched his support to Trump. Rebekah Mercer took over the top position at Make America Number 1 after veteran Republican strategist David Bossie left to join Trump’s campaign.", "By phrasing it the way he did, Trump implies that the Obamas ran ads against Clinton attacking their family life. In reality, it was a pro-Trump group that aired the ad in question -- and that makes a big difference in how powerful a point this is.", "Our ruling", "Trump said, \"I've gotten to see the commercials that they did on you. And I've gotten to see some of the most vicious commercials I've ever seen of Michelle Obama talking about you, Hillary.\"", "Trump is wrong to imply that Michelle Obama’s criticism came in an ad her husband ran against Hillary Clinton. Instead, it came from an ad made by a pro-Trump super PAC. And, the comments from Michelle Obama are somewhat oblique. They might be about Hillary Clinton, but they also might be simple pro-family sentiments. We rate Trump’s statement False.", "Donald Trump, remarks in the second presidential debate in St. Louis, Oct. 9, 2016", "Make America Number 1, \"Can’t Run Your House,\" Sept. 29, 2016", "YouTube, local news clip of Michelle Obama visit in Chicago, accessed Oct. 11, 2016", "USA Today, \"Wealthy donor will run anti-Clinton super PAC,\" Sept. 7, 2016", "ABC News, \"Obama: Nothing Personal,\" Aug. 23, 2007", "Chicago Sun Times, \"Michelle gets stronger all the time; 'I don't want my girls to live in a country based on fear.\" Aug. 21, 2007 (via Nexis)", "Chicago Sun Times, \"A swipe at the Clintons? Here's how I saw it; My view of Michelle Obama's speech set tongues wagging,\" Aug. 23, 2007 (via Nexis)", "Chicago Defender, \"Michelle Obama hosts Women for Obama South Side Community Kick-Off,\" Aug. 9, 2007", "David Axelrod, tweet, Oct. 9, 2016", "Email interview with Josh Schwerin, spokesman for Hillary Clinton, Oct. 10, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]