["Editor's note: The Instagram post from United We Dream mentioned below has since been deleted.", "The claim: Posting on social media for Blackout Tuesday dilutes feeds and erases protesters’ posts", "In an effort to amplify the voices of protesters, social media users muted themselves  Tuesday. Music executives Jamila Thomas and Brianna Agyemang declared “#TheShowMustBePaused” on June 1.", "“Tuesday, June 2nd is meant to intentionally disrupt the work week,” they wrote on the website named after the hashtag. “Monday suggests a long weekend, and we can’t wait until Friday for change.”", "The online movement was declared “Blackout Tuesday,” and social media users, including Drake, Kevin Hart and Rihanna, began posting images of black screens on their platforms. Blackout Tuesday posts quickly spread beyond the music industry to individual accounts.", "Participants faced criticism early Tuesday morning, when users claimed the use of #BlackLivesMatter and #BLM hashtags diluted feeds and buried protesters’ posts.", "“It has come to my attention that many allies are using #BlackLivesMatter hashtag w black image on insta,” activist Kenidra Woods tweeted Tuesday morning. “We know that’s it no intent to harm but to be frank, this essentially does harm the message. We use hashtag to keep ppl updated. PLS stop using the hashtag for black images!!”", "Other users claimed posting with either hashtag defeated the point because of Instagram's algorithms.", "“The Instagram algorithm is merging #BlackOutTuesday posts with the #BlackLivesMatter hashtag. This is obstructing vital information from being accessible to folks using the BLM Hashtag,” United We Dream told its 137,000 followers. “Regardless of which hashtag you use when posting, you will be unintentionally participating in the erasure of information and resources.”", "When a commenter asked United We Dream how it discovered this flaw, it responded, “We tested it.\"", "“That’s not exactly how it works. If the (#BlackLivesMatter) hashtag was ever on the post, and later the hashtag was removed, the post still spears on the thread,” an Instagram user commented. “If someone uploaded the post with the BLM hashtag they should delete and reupload the post with the right (hashtag).\"", "Instagram addressed the hashtag confusion on Twitter on Tuesday afternoon.", "\"We're hearing asks from the community that posts related to Blackout Tuesday use the hashtag #blackouttuesday, and not #blacklivesmatter,” Instagram tweeted. “The #blacklivesmatter hashtag aggregates important information and resources for the community.”", "Instagram explained to USA TODAY that because the “Most Recent\" section of the hashtag page shows posts reverse chronologically, a rush of new \"Blackout Tuesday\" posts can bury older #BlackLivesMatter and #BLM posts.", "“To confirm, we are not taking any actions that limit the reach of (protesters') posts,” Instagram spokeswoman Stephanie Otway told USA TODAY.", "According to Instagram, United We Dream and the commenter are incorrect.", "“If you edit your post to remove a hashtag, your post will no longer be shown on that hashtag page,” she said. “In some cases, it may take up to 10 minutes for the post to be removed once you edit it. If someone uses #blacklivesmatter and #blackouttuesday in their caption, the post will appear on both hashtag pages – we are not merging the pages.”", "More:Trying to post a black square on Instagram using #BlackLivesMatter? It might be blocked.", "United We Dream did not return USA TODAY's request for comment.", "We rate the claim that posting for \"Blackout Tuesday\" dilutes feeds and buries protesters' voices as PARTLY FALSE because some of it was not supported by our research. Activists and Instagram confirmed that using the #BlackLivesMatter and #BLM hashtags for Blackout Tuesday posts makes demonstrators' posts harder to find. However, Instagram is not merging #BlackOutTuesday and #BlackLivesMatter posts. When a post is edited to remove the #BlackLivesMatter hashtag, it will stop appearing on the thread after 10 minutes, Instagram said.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]