["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A candidate for attorney general from western Pennsylvania has spent a quarter of a million dollars running ads in the Philadelphia area branding himself as a former prosecutor who’s tough on cops.", "In a new TV advertisement for Stephen Zappala, a Democrat and the district attorney of Allegheny County, a narrator says Zappala is \"the only DA in our state to convict an on-duty police officer of criminal homicide.\"", "The idea that only one police officer in Pennsylvania had been convicted of criminal homicide was surprising. So we decided to check the claim.", "The ad refers to the 1995 shooting death of Jerry Jackson, an unarmed black man stopped by police for driving the wrong way on a one-way street in Pittsburgh. Investigators said John Charmo, a white former police officer with the Pittsburgh Housing Authority, shot Jackson 13 times with his service weapon in a tunnel following a high-speed chase.", "Charmo wasn’t immediately charged under the previous district attorney. But the case was re-opened by Zappala in 1999 after Jackson’s family discovered video evidence of the shooting via a civil case. The officer was subsequently charged with homicide.", "In 2001, a jury deadlocked and Zappala feared another jury would acquit, so he worked out a plea deal with Charmo. The officer pleaded guilty to involuntary manslaughter and was sentenced to 11 1/2 to 23 months behind bars -- a fraction of the amount of time he would have been sentenced to had he been convicted on a murder charge.", "Zappala’s campaign for attorney general contends that under Pennsylvania law, a guilty plea of involuntary manslaughter is legally a conviction of criminal homicide. In this case, it resulted in what his campaign manager called \"substantial\" prison time that kept Charmo off the police force.", "\"This case happened more than a decade before Ferguson or any of the other high profile incidents that sparked the Black Lives Matter movement,\" Zappala’s campaign manager Marty Marks said. \"Which is the point of the ad’s message.\"", "Zappala’s campaign made the $250,000 ad buy and commercials began running this week in the Philadelphia area. His primary opponent Josh Shapiro, a Montgomery County commissioner, also began airing TV ads this week. Northampton District Attorney John Morganelli is also seeking the Democratic nomination while Joe Peters, a former prosecutor, and John Rafferty, a state senator, are running on the Republican side.", "Zappala’s campaign claims the guilty plea on the Charmo case sets their candidate apart, but the Pittsburgh Citizen Police Review Board that analyzes complaints against police officers says the claim is \"a stretch.\"", "\"[The Charmo case] was so very, very messy,\" said Beth Pittinger, executive director of the Review Board. \"To compress that accurately into a political ad would be very difficult.\"", "Marks pointed to a Washington Post analysis of 5,000 police-involved shootings since 2005 that found 54 officers nationwide were criminally charged and, of those, 11 were convicted. None of those convictions were in Pennsylvania.", "At least two other officers in Pennsylvania besides Charmo have pleaded guilty to involuntary manslaughter on charges related to actions they took on duty that resulted in the death of another person. In both of those cases -- one in Coopersburg and one in Williamsport -- the officers were guilty of hitting and killing a person while drive at a high rate of speed in their police cruisers.", "Marks said it’s a \"false equivalency\" to compare officers who got into a car accident that resulted in a loss of life with the case of Charmo who shot Jackson 13 times.", "Additionally, Easton police officer Scott Cameron pleaded guilty to involuntary manslaughter after he shot and killed John E. Rapp in 1998. But that case was prosecuted by the state attorney general, not a district attorney.", "Our ruling", "Zappala’s campaign made the claim that he is \"the only DA in our state to convict an on-duty police officer of criminal homicide.\" That claim was referring to the case of Officer Charmo, who pleaded guilty to involuntary manslaughter in 2001 and ultimately spent less than a year in prison.", "Two other police officers in different counties have also pleaded guilty to involuntary manslaughter, but both were after an officer hit someone with their vehicle. Zappala’s campaign left out context that Charmo pleaded guilty and that two other officers also were guilty of the same charge as Charmo. But he does appear to be the only DA in Pennsylvania who won a conviction of an on-duty police officer in a shooting incident.", "We rule the claim Half True.", "Email, Marty Marks, campaign manager for Stephen Zappala for PA. March 23, 2016.", "News article, \"Police officers prosecuted for use of deadly force,\" Washington Post. Accessed March 23, 2016.", "News article, \"Officer takes plea in tunnel shooting,\" Pittsburgh Post-Gazette. Accessed March 23, 2016.", "News article, \"Ex-Williamsport cop pleads guilty to involuntary manslaughter,\" PennLive. Accessed March 23, 2016.", "News article, \"Easton officer pleads guilty to involuntary manslaughter,\" The (Allentown) Morning Call. Accessed March 23, 2016.", "YouTube video, \"Eighteen,\" ZappalaForPA. Posted March 22, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]