["Power outages in Texas left many residents without heat and electricity during recent ice and snow storms. Some conservative politicians blamed the outages on frozen wind turbines when, in reality, energy officials said the primary cause appeared to be failures across the state’s natural gas operations.", "An image spreading on social media during the storms suggested that renewable energy deprived half a million homes of power by causing the shutdown of a coal-powered plant.", "\"Monticello power plant just outside of Pittsburg TX has been closed since 2018 because of renewable energy,\" the post says. \"She alone can produce enough reliable power for over 500,000 homes. How is that green energy working out for y’all?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Monticello plant near Pittsburg, Texas — about two hours east of Dallas — once had an operating capacity of 1,880 megawatts, which is enough to power as many as about 940,000 homes depending on conditions. But it has been offline since January 2018. Luminant, the state’s largest electricity generator, announced in October 2017 that it was retiring the plant.", "In a statement, the president of Luminant’s parent company, Vistra, said \"the market’s unprecedented low power price environment has profoundly impacted its operating revenues and no longer supports continued investment.\"", "Before the plant could go offline, the state’s main grid operator, the Electric Reliability Council of Texas, had to ensure that it wasn’t needed to supply reliable power to consumers.", "Monticello was one of the state’s largest coal-powered plants, and the Houston Chronicle described it at the time as one in \"a string of coal plant closures nationwide as a glut of cheap natural gas and continued advances in solar and wind energy technology continue to depress wholesale power prices.\"", "We reached out to Vistra about the post. Meranda Cohn, a spokesperson for the company, told PolitiFact that when it announced the retirement of Monticello and two other plants, Vistra said it was because the plants were \"economically challenged\" in a competitive market.", "\"Sustained low wholesale power prices, an oversupplied renewable generation market, and low natural gas prices, along with other factors, have contributed to the decision,\" she said.", "Back in 2017, another Vistra spokesperson told the Dallas Morning News that the decision was \"purely economic … this is a coal plant operating in a market that’s flooded with cheap natural gas.\"", "Kenneth Medlock, Center for Energy Studies senior director at the Baker Institute for Public Policy at Rice University, confirmed that renewables have put pressure on coal, but he said \"they are definitely not the sole driver of coal closures.\"", "\"Coal is largely being displaced by low-cost natural gas,\" Medlock said in an email. \"This is just a matter of data, where one can tangibly see the effect of very cheap natural gas on power generation across the U.S., not just in Texas.\"", "The price of power in the wholesale market in Texas is set by the price of natural gas, said Bruce Bullock, director of the Maguire Energy Institute at Southern Methodist University. Cheap natural gas plus the rapid growth of wind energy in Texas \"essentially made coal uneconomic.\"", "Our ruling", "The image that’s being shared on social media claims that the Monticello power plant closed because of renewable energy.", "Renewable energy contributed to the plant’s demise but so did other factors. Namely: cheap natural gas.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, Feb. 17, 2021", "Texas Tribune, No, frozen wind turbines aren’t the main culprit for Texas’ power outages, Feb. 16, 2021", "Texas Tribune, Texas largely relies on natural gas for power. It wasn’t ready for extreme cold, Feb. 16, 2021", "Luminant, Luminant announces decision to retire its Monticello Power Plant, Oct. 6, 2017", "Houston Chronicle, Vistra closing mega coal plant in East Texas, Oct. 6, 2017", "Dallas Morning News, East Texas coal plant, once a big polluter, snuffed out by cheap natural gas, Oct. 6, 2017", "Email interview with Meranda Cohn, senior communications and media relations director, Vista, Feb. 22, 2021", "Email interview with Kenneth Medlock, Senior Director, Center for Energy Studies, Baker Institute for Public Policy, Rice University, Feb. 22, 2021", "Email interview with Bruce Bullock, Pat and Jane Bolin Endowed Director", "Maguire Energy Institute, Southern Methodist University, Feb. 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]