["About this rating", "Saudi Arabia's prohibition on the establishment of non-Muslim houses of worship and the (public) performance of non-Muslim religious services has long rankled many citizens of Christian-predominant countries, especially those countries -- such as the U.S. -- that keep military troops stationed in the Saudi kingdom to help protect its security. (Other Muslim countries in the Middle East are not so restrictive of Christianity and other non-Muslim religions.)", "Discontent with this situation has prompted the online spread of tropes and memes along the lines of \"We'll accept Muslims/mosques here when they allow Bibles/churches in Saudi Arabia\":", "But one meme has taken this concept a step further, asserting that the country of Poland actually enacted a legal ban on mosques there until such time as Christian churches are allowed in Saudi Arabia:", "It is true that the construction of mosques has met with opposition over the last several years in Catholic-predominant Poland:", "In a sight familiar in some west European countries but new to Poland, dozens of protesters demonstrated in a Warsaw suburb against the construction of a mosque.", "Plans by Poland’s tiny Muslim community to build a place of worship and an Islamic cultural center face opposition in a sign that concerns about Islam may be spreading eastwards to the staunchly Catholic European Union member.", "Between 15,000 and 30,000 Muslims, many of them immigrants from Chechnya, live in Poland — the biggest ex-communist EU state where more than 90 percent of the 38-million population declare themselves Catholics.", "However, mosques do in fact exist in Poland, and searches of legislation and news reports turn up no reference to any legal ban on the existence or construction of mosques within Poland.", "This meme appears to be based not on reality, but on a viewpoint represented by Dominik Tarczyński, a member of Poland's \"ultraconservative\" Law and Justice Party, who has been quoted as vehemently opposing Poland's acceptance of any non-Christian refugees: \"We don't want Poland being taken over by Muslims, Buddhists, or someone else ... and no one will ever force us to take Muslims, Buddhists, non-believers in huge numbers ... For me, multicultural society, it's not a value ... it's not a virtue. Christian culture, Roman law, Greek philosophers, these are the virtues for us.\"", "On multiple occasions Tarczyński has voiced his opinion that Poland should not exhibit any more tolerance to Muslims than Saudi Arabia does to Christians:", "A Polish lawmaker from the ruling Law and Justice Party, Dominik Tarczyński, said that his country will send a clear message to radical Muslims that they cannot claim rights that Europeans lack in Saudi Arabia.", "Tarczyński drew attention from the Western public in a televised duel with well-known liberal journalist Cathy Newman on the topic of illegal migration when he said that Poland had received a total of zero migrants which he is proud of. He also said that the country was open to peaceful migration and received a large number of Ukrainians.", "With his attitude that the West is at a very unstable place with the Islamic world currently, Tarczyński claims that there are plans from the theocratic Saudi Arabia to begin mass construction of mosques in the capital of Poland, Warsaw.", "When asked about the request of the Muslim population in Poland to be allowed to go forward with building mosques, Tarczyński said \"We will be pleased to accept it, right after they allow Poland to build a cathedral in Saudi Arabia.\"", "A representative of the ruling party pointed out that in Islamic countries there is a significant intolerance towards Christians, and bearing in mind that public wearing or displaying of a cross is forbidden in Saudi Arabia, the same principle should be applied to wearing a burqa in Poland.", "Nonetheless, Tarczyński's words are reflective of a political viewpoint, not of any actual regulation or policy of his country's government that has barred the construction of any mosques in Poland until churches may be built in Saudi Arabia.", "Al Jazeera News.   \"Polish MP: 'For Me, Multiculturalism Is Not a Value.'\"\r\n    9 November 2019.", "Baczynska, Gabriela.   \"Mosque Building Brings Islam Fears to Poland.\"\r\n1 April 2010.\r\n    Reuters.   1 April 2010.", "McAlister, Zoe.   \"Poland Will Allow Building Mosques When S. Arabia Allows Building Churches.\"\r\n    Newswire.Net.   31 January 2019.", "Riley, Jennifer.   \"Bibles, Crucifixes Not Allowed Into Saudi Arabia.\"\r\n    Christian Post.   10 August 2007.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]