["About this rating", "A photograph purportedly showing an airplane with dozens of wooden arrows stuck into its underside is frequently shared online, accompanied by one of a number of fabricated backstories:", "Someone sent me this as the natives are protesting all the pipelines being built. Greenpeace supplied all the arrows since they are more environmentally friendly than bullets.", "In April 2014, the web site Fellowship of the Minds shared the same image along with text holding that it depicted President Obama's plane after he undertook a flight over a reservation in Oklahoma:", "Obama took a private plane flight over an Indian reservation in Oklahoma. This is what happened ...", "This photograph does not show a plane that was attacked by Native Americans. Rather, it captures an installation that was created by the art collective Los Carpinteros. The piece, entitled Avião (Plane), was displayed at the Faena Art Center in Buenos Aires, Argentina in May 2012:", "Through an economy of improvisation and precariousness, the artist’s work utilizes industrial objects to ironically challenge the notions of civilization and the mechanisms of perception by juxtaposing affluent western society against a rationed society with minimal consumption.", "An imposing Piper Comanche aircraft pierced by wooden arrows makes up Avião, a large-scale installation alluding to the development and conquest of space, and symbolizing the cultural shock caused by technological progress in various different civilizations.", "Stolz, George.   \"Los Carpinteros: Seeing Double.\"\r\n    Art News.   24 June 2013.", "Hosmer, Katie.   \"Hundreds of Wooden Arrows Pierce Airplane from Below.\"\r\n    My Modern Met.   24 June 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]