["About this rating", "The ADA requires that businesses with mandatory mask rules for customers due to COVID-19 also must accommodate people who may not be able to wear masks due to medical conditions or disabilities. In many cases individuals do not need to disclose or provide proof of those medical conditions.", "However, the face mask \"exempt\" cards featured in social media posts were declared fraudulent by the U.S. Department of Justice. The FTBA, the organization mentioned on the card to “report” potential violations to, also does not appear to be officially recognized by any government agencies as an enforcing body.", "Mandatory mask-wearing in public gradually became the law of the land in regions across the United States in 2020 due to the COVID-19 coronavirus disease pandemic. Seemingly in response to such regulations, images of cards and flyers citing the Department of Justice (DOJ) began cropping up across the internet, proclaiming certain laws made the bearer exempt from wearing face masks", "These cards were shared on California-based Facebook groups in June, around the same time the state issued an executive order requiring Californians to wear face masks in public. Snopes readers asked us if the cards were valid. We learned they were not.", "I am exempt from any ordinance requiring face mask usage in public. Wearing a face mask posses [sic] a mental and/or physical risk to me. Under the Americans with Disability Act (ADA), I am not required to disclose my condition to you … Denying access to your business/organization will be also reported to FTBA for further actions.", "Presented like a business card, it mislabeled the Americans with Disabilities Act (ADA) as singular \"Disability\" act, included the ADA information line's phone number, and claimed there would be steep fines for any violation.", "In an announcement on ADA.gov, while not explicitly referencing the above card, the Department of Justice (DOJ) declared such postings or flyers on the internet that used its seal as fraudulent. The San Luis Obispo County Public Health Department, California, reiterated this:", "The Freedom to Breathe Agency (FTBA), according to its Facebook page, was previously known as the Anti-Mask Task Force, and described itself as a \"movement of proud American citizens who are dedicated to protecting their freedom and liberty.\" They would not be able to enforce any action against offenders because they are not connected to a government agency.", "But the card's fake credentials implied that able-bodied bearers could exploit legitimate ADA regulations meant to protect people with disabilities. Snopes fact-checked a similar story in May 2020, when we learned that the ADA requires that businesses with mandatory mask regulations must accommodate individuals who cannot wear masks due to their health or a disability.", "Coinciding with claims made in the card's text, in many parts of the U.S., people aren’t required to disclose their physical condition if a business asks for proof of disability. But able-bodied people who seek to exploit such protections would not be supported by the ADA if, for example, they tried to sue a business for refusing them entry. In our previous investigation, we reached out to numerous ADA centers across the country. The New England ADA Center, for instance, told us:", "The ADA protects the privacy of people who have disabilities. People who lie about a medical condition and don’t have one, do not have rights under the ADA.", "In sum, even though their arguments rely on existing protections for people with disabilities, such cards arguing that bearers can be exempted from wearing masks are totally fake. We thus rate this claim as \"Mostly False.\"", "ADA.gov.   \"COVID-19 ALERT: Fraudulent Facemask Flyers.\"", "Bostock, Bill.   \"Anti-mask protesters are trying to commandeer US disability laws to get into stores without face coverings.\"\r\n   Insider.   19 May 2020.", "Bubnash, Kasey.   \"SLO County Public Health Department warns of fake face covering exemption cards.\"\r\n   New Times.   23 June 2020.", "Emergencyslo.org.   \"Face Coverings.\"", "Evon, Dan.   \"Can People Without Disabilities Use an ADA ‘Mask Loophole’ in Stores?\"\r\n   Snopes.   12 May 2020.", "Fisher Phillips.   \"Businesses That Mandate Masks For Employees And Customers Need To Consider ADA Issues.\"\r\n   30 May 2020.", "Martin, Jeffery.   \"Face Mask Exemption Cards and Flyers with DOJ Seal Are Not Real, Feds Say.\"\r\n   Newsweek.   24 June 2020.", "Willon, Phil, and Money, Luke, and Fry, Hannah, and  Rong-Gong, Lin II, and Vega, Priscilla.   \"Everything You Need to Know about California’s Mandatory Mask Rules.\"\r\n   Los Angeles Times.   19 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]