["About this rating", "On 16 May 2018, the House Committee on Science, Space, and Technology held a hearing ostensibly to discuss the ways in which \"technology could be deployed for climate change adaptation.\" As this committee’s hearings are wont to do, however, some committee members used their time to interrogate the expert witness about the veracity of basics of climate science.", "In this case, that witness was Philip Duffy, the president of the Woods Hole Research Center in Massachusetts. The most infamous exchange occurred between Duffy and Representative Mo Brooks, a Republican from Alabama. Philip Bump at the Washington Post described it in a gripping play-by-play:", "Brooks asked Duffy what else might be contributing [to observed sea-level rise besides expanding oceans and melting ice]. Duffy pointed to ground subsidence, which is the sinking of the ground in places that can exacerbate the problem of rising sea levels. [...] “Those are all that I know of,” Duffy replied.", "“What about erosion!” Brooks exclaimed. “Every single year that we’re on Earth, you have huge tons of silt deposited by the Mississippi River, by the Amazon River, by the Nile, by every major river system — and for that matter, creek, all the way down to the smallest systems. And every time you have that soil or rock whatever it is that is deposited into the seas, that forces the sea levels to rise.", "Because now you’ve got less space in those oceans because the bottom is moving up. [...] What about the white cliffs of Dover?” Brooks continued. “California, where you have the waves crashing against the shorelines and time and time again you have the cliffs crash into the sea. All of that displaces the water which forces it to rise, does it not?”", "Brooks is accurate when he says that tons of material — silt, sand, dissolved solids, maybe some rocks from the cliffs of Dover, etc. — are constantly flowing into the world’s ocean basins. According to the National Oceanic and Atmospheric Administration:", "It is estimated that the rivers and streams flowing from the United States alone discharge 225 million tons of dissolved solids and 513 million tons of suspended sediment annually to the ocean. Throughout the world, rivers carry an estimated four billion tons of dissolved salts to the ocean annually.", "Though his question makes sense from an elementary physics standpoint, Brooks is inaccurate in suggesting that this contributes in any meaningful way to the sea level rise attributed to anthropogenic global warming. Certainly, when you put something into water, that water is displaced and the water rises relative to the volume of that object — we can thank Archimedes for that one. On human timescales, however, the amount of water displaced by this sediment flow is essentially undetectable.", "We asked Phil Woodworth, the former director of the Permanent Service for Mean Sea Level (PSMSL), an international organization that maintains tide gauge records worldwide, about Brooks’ question. He told us, \"As large as these river transports of sediments are, the ocean volume is so enormous that they don’t result in a significant change in global-average sea level.\"", "According to the IPCC’s Fifth Assessment Report, which is a consensus statement produced with the input of thousands of international scientists and overseen by the United Nations, sea levels overall since 1900 have gone up on average 1.7 millimeters per year with an uncertainty of 0.2 millimeters in either direction. (Satellite data from 1993 onward indicate that this rate has been accelerating in recent years and is now thought to be around 3.3 millimeters per year).", "That IPCC report also estimated that the annual contribution of sea level rise caused by sediment dumped into ocean basins is about 0.01 millimeters per year — a meaningless number compared to the uncertainty associated with historical sea level data. The Post, using the 3.3 millimeter per year rate estimate relevant to more recent sea level rise, described how much material would need to be carried into the ocean every year:", "So to make the oceans rise 3.3 millimeters, we would need to displace that 1.2 trillion cubic meters of water upward by dropping in 1.2 trillion cubic meters of dirt or stone or whatever. How much is that? It’s a sphere of earth a bit over 8 miles in diameter. [...] If the sphere were stone, it would weigh about 6.6 quadrillion pounds. Just drop that in the ocean and — bloop! — 3.3 millimeters of sea-level increase [...].", "Put another way, it’s a volume of earth equivalent to taking the top five inches of every one of the United States’ 9.1 million square miles of land area and using it to coat the bottom of the world’s oceans [every year]. That would push sea levels up by 3.3 millimeters [annually].", "Of course, on geologic time scales (tens of millions of years) such an amount material added to the oceans would, in theory, become meaningful. That would be true if not for the fact that — also on geologic time scales — the ocean floor actively recycles old seafloor at rates comparable to the mass added by sediment each year. On these timescales the major factors driving global sea level variability are much larger-scale processes like the subduction of continents, the rise and fall of ocean ridges, and the volcanic processes that create new rocks.", "Tim Herbert, a professor of oceanography at Brown University, told us that Brooks’ argument — if looked at on these timescales — is akin to focusing on one side of a cyclic process while ignoring the processes that go the other direction. On relevant timescales, Herbert told us, the most important point is that current rate of sea level rise is substantially higher than what geologists believe to be a normal background rate:", "[There is] very clear evidence that for thousands of years in the Holocene, sea level rose very modestly. Sea level began to rise at a much steeper rate ~1850 (time of the first measurable sea level response to the input of CO2 that began with the Industrial revolution) and then has been steeply rising over the past few decades in parallel with the steep rise in CO2 and global temperatures. Every good study I know shows that current rates of sea level rise are 3-4 times the natural background rate.", "While Brooks is correct both in his understanding of Archimedes' principle and in his statement that tons of sediment flow into the oceans each year, his assertion that this sediment flow is in any way a measurable contributor to the sea level rise scientists are discussing in the context of anthropogenic global warming is false.", "Waldman, Scott.   “Lawmaker Says Tumbling Rocks Are Causing Seas to Rise.”\r\n    E&E News.   17 May 2018.", "Niler, Eric.   “Congress' Chief Climate Denier Lamar Smith and NOAA Are at War”\r\n    Wired.   11 November 2015.", "Bump, Philip.   “Here’s How Big a Rock You’d Have to Drop Into the Ocean to See the Rise in Sea Level Happening Now.”\r\n    Washington Post.   17 May 2018.", "NOAA.   \"Why Is the Ocean Salty, But Rivers Flowing Into it Are Not?\"\r\n    Accessed 17 May 2018.", "Church, J.A., et al.   “Climate Change 2013: The Physical Science Basis (Ch 13).”\n    Cambridge University Press, 2013.", "Church, J.A., et al.   “Climate Change 2013: The Physical Science Basis (Ch 13).”", "Cambridge University Press, 2013.", "Miller, Kenneth G., et al.   “The Phanerozoic Record of Global Sea-Level Change.”\r\n    Science.   25 November 2005.", "Müller, R. Dietmar, et al.   “Long-Term Sea-Level Fluctuations Driven by Ocean Basin Dynamics.”\r\n    Science.   7 March 2008.", "Update [21 May 2018]: Added comment from Tim Herbert.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]