["About this rating", "The pharmacy-store chain CVS and the company's associated PAC donated hundreds of thousands of dollars toward political causes supporting President Donald Trump.", "CVS isn't a \"major donor\" just to the Trump campaign; the company and its employee PAC also donated significant funds to Democratic candidates and organizations.", "Internet outrage has driven many a news cycle. In the summer of 2019, some of that outrage was directed at businesses whose executives, or the businesses themselves, made financial contributions toward reelecting President Donald Trump in 2020. One of those businesses was the pharmacy chain CVS.", "Well, well ... color me unsurprised.", "In case you needed more reason to #BoycottCVS aside from their attack on Women's Healthcare, they are MAJOR contributors to trump's 2020 campaign. Yup.", "Fuck CVS.\nHello @Walgreens.#BoycottCVShttps://t.co/jEzhSe2BO3", "— BrooklynDad_Defiant! (@mmpadellan) August 15, 2019", "Much of the outrage at CVS was focused around a story published by Out, a magazine focused on the LGBTQ community, which reported that \" CVS Health Corp. is allegedly one of the largest donors to the president’s reelection campaign.\" That story, published Aug. 15, 2019, is based on reporting from The Wall Street Journal in February 2018. The story was about the reelection campaign-fundraising efforts by Trump, which started as soon as he took office. The Journal reported:", "Mr. Trump began his re-election fundraising with a $10 million fete at his Trump International Hotel in Washington last June. His campaign’s most recent event, timed to celebrate the anniversary of his inauguration, was Jan. 20 at Mar-a-Lago, another family business.", "For each donation at those events, the first $5,400 — the legal maximum — goes to his re-election campaign, while the rest is divided among Republican Party committees, including the Republican National Committee and several state parties.", "The largest donors to Mr. Trump’s campaign include political committees for CVS HealthCorp. and LendingTree Inc. loan servicing company, FEC reports show. The largest donors to the America First super PAC were Geoffrey Palmer, a Los Angeles property developer and friend of Mr. Trump’s who gave $2 million, and Ohio-based Murray Energy Corp., the largest privately held U.S. coal-mining company, which gave $1 million. The chief executive, Robert Murray, wrote an action plan on coal for the Trump administration and gave it to the Energy Department.", "Per the company's own disclosures, CVS corporate and the political action committee (PAC) associated with the store chain made a total of $535,000 in donations in 2017 to political organizations that support Trump. Because CVS is a public corporation, federal law bars it from donating directly to federal races, but CVS associates can do so through their advocacy PAC called the CVS Health Corporation Employees Political Action Committee. The corporation can make contributions to state and local candidates and donate to political organizations, as well.", "The PAC associated with CVS made a single $35,000 contribution in 2017 to Trump Victory, a joint fundraising committee spearheaded by the Republican National Committee (RNC), Trump's campaign and 11 state Republican parties. Also in 2017, CVS corporate made a $500,000 donation to America First Policies, a political nonprofit organization that promotes Trump's agenda. Per the Journal's reporting, America First is a \"part-super PAC, part-nonprofit group that routinely meets with Mr. Trump and top White House officials to discuss political strategy.\" The organization has raised millions of dollars.", "After news reports revealed America First staffers made racist, homophobic and sexist comments, CVS, along with fellow corporate donors Dow Chemical and Southern Company, released statements vowing not to contribute any more money to the organization, stating they were unaware of the comments when the contributions were made. A CVS spokesperson at the time said the company donated the money in support of the 2017 Tax Cuts and Jobs Act legislation, which America First promoted.", "About the contribution to Trump Victory, CVS Spokesman Mike DeAngelis told us, \"Our understanding is that the [Trump] election campaign received a small portion and the RNC retained the majority. The donation amount was in line with donations made by other companies and associations to the RNC, and we’ve made similar donations to Democratic campaign committees.\" The CVS PAC has made no additional contributions to the Trump reelection campaign, DeAngelis added.", "CVS did indeed donate to Democratic candidates and organizations. A review of CVS' corporate and PAC political donations reveals the company could be considered a \"major donor\" to Democratic causes and candidates if one chose to frame it that way. For example, CVS donated $130,000 to Democratic candidates for the New York state legislative races in 2018. The company donated a combined $150,000 each to the Democratic and Republican Governors Associations and Attorney Generals Associations in 2018 and a total of $61,000 to the Congressional Black Caucus Foundation and Congressional Hispanic Caucus Institute.", "Although it's true that CVS, through corporate donations and through its employee PAC, made large contributions toward causes that support Trump's political efforts, the company also has donated large sums to Democratic candidates and organizations. Therefore to state that CVS is a \"major Trump donor\" excludes the additional context of the company's overall political activities and doesn't tell the entire story. As such, we rate this claim \"Mixture.\"", "Lang, Nico. \"CVS Is Reportedly a Major Donor to Trump’s 2020 Campaign.\"\r\n  Out. 15 August 2019.", "Bykowicz, Julie. \"Trump Makes Quick Work of Re-Election Fundraising.\"\r\n  The Wall Street Journal. 1 February 2018.", "CVS Health. \"Political Activities & Contributions.\"", "Flores, Reena. \"Donald Trump, RNC Sign Joint Fundraising Deal.\"\r\n  CBS News. 18 May 2016.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]