["About this rating", "The decades-old interiors and exteriors of American chain restaurants may bring back warm memories to those who spent their youth enjoying meals within their walls. That very nostalgia may have been one factor that led TikTok user @edmundrambo to publish a series of videos about the way restaurants used to look. In Part 1, he gathered photographs that depicted the older color palette that defined Taco Bell. Part 2 looked at McDonald's and its old golden arches. As for Part 3, it was all about Pizza Hut. The last picture in the video appeared to show an advertisement that said: \"Surprise! Pizza is good for you!\"", "On the purported advertisement was displayed the words: \"Pizza Delicious. Pizza Nutritious.\"", "Surprise! Pizza is good for you! The pizza meat - high in protein, modest in calories, and containing many essential nutrients. Bet you never thought anything that tasted so delicious could be so nutritious. Pizza Hut just wanted you to know.", "The advertisement was real. Here's how we found out it was genuine. We first took a screenshot of the video and tried a reverse-image search with Google. That search led to several pictures on Pinterest, which were likely where TikTok user @edmundrambo downloaded the ad for use in his video.", "A study of the Pinterest links turned up nothing, at least at first. However, this Pinterest link contained a clue:", "https://br.pinterest.com/pin/812688695245342854/", "On the Pinterest page was a link to a blog image file. The end of the long file name was: \"1977+comics+superman+bronze+age+hut+ad+advertisement+1.gif.\" Given the words in the url, we then looked to eBay for Superman comics that mentioned Pizza Hut from 1977 or 1978. It was there that we found the answer.", "In 1977, Pizza Hut offered a \"Pizza Hut Collector's Edition\" for DC Comics, and the advertisement appeared within its pages:", "Courtesy: lida1774 (eBay)", "The 1977 advertisement showed nutrition information for two pizzas: the Thin 'N Crispy Pizza with 510 calories in 3 slices, and the Thick 'N Chewy Pizza with 640 calories in 3 slices. The calorie counts were for smaller pizzas measuring 10 inches (25 cm).", "As for whether pizza is \"good for you\" or nutritious, pizza can include an entire spectrum of crusts, sauces, cheeses, and toppings. Pizza is not usually a personal trainer's first suggested choice of diet. However, that doesn't go for all exercise types.", "A homemade cauliflower crust with vegetables may be considered to be nutritious, while another pizza packed with meats, cheeses, sauce, and a hand-tossed crust may not. For example, a large Meat Lover's pizza from Pizza Hut that measured 14 inches (36 cm) had the following nutrition information per slice: 390 calories, 21g total fat, 50mg cholesterol, 860mg sodium, 34g total carbohydrates, 2g sugars, and 17g protein. This would mean that a person who ate three slices of pizza would consume 1,170 calories and 63g total fat in a single meal, and that's before including beverages and dessert.", "Speaking of dessert, Pizza Hut offered a \"Triple Treat Box\" in December 2020. It included two medium 1-topping pizzas, five breadsticks, and 10 mini Cinnabon brand cinnamon rolls:", "The TV advertisement included a quick shot of what appeared to be a vintage Pizza Hut hanging chandelier lamp, a callback to the old days when the restaurant chain advertised in a comic book that \"pizza is good for you.\"", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]