["About this rating", "In early December 2018, the Netflix entry for 'Friends' briefly stated that the show would only be available for steaming until 1 January 2019.", "Netflix quickly removed the \"available until\" note from the show's entry and publicly stated that 'Friends' would continue to be available to stream in the United States \"throughout 2019.\"", "Fans of the iconic 1990's sitcom Friends were left bereft in December 2018, when reports emerged that the show would no longer be available to watch via the streaming service Netflix after 1 January 2019.", "On 2 December 2018, Twitter users posted screenshots of the show's Netflix entry, which indicated that Friends was \"available until 01/01/2019\" and therefore would presumably be removed from Netflix after that date:", "@netflix what is this madness?? the literal source of my happiness, a.k.a. Friends, is leaving?? heartbroken?? pic.twitter.com/WxCOhuD0BL", "— Noelle Michaud (@noellemichaud14) December 2, 2018", "WHAT DID FRIENDS EVER DO TO YOU @netflix pic.twitter.com/9DgJKhYiMN", "— jenn? (@Jennwybieracki_) December 2, 2018", "Publications including Variety, E! News, BuzzFeed and Collider broke the news to their readers with articles of their own on the subject. However, those reports were updated when Netflix responded to the outcry on Twitter, clarifying that Friends would remain available to viewers \"throughout 2019\":", "The Holiday Armadillo has granted your wish: “Friends” will still be there for you in the US throughout 2019 pic.twitter.com/Yd0VqRzk3r", "— Netflix US (@netflix) December 3, 2018", "As of 4 December 2018, the show's Netflix listing (on desktop and the mobile app) did not specify how long episodes would be available via Netflix:", "It was not clear why the show briefly appeared with an end-of-availability date of 1 January 2019. The Hollywood Reporter speculated that Netflix might be in negotiations with Warner Bros. TV (who produced Friends) and that the two companies' agreement over streaming various television series could be coming to an end as Warner Bros. TV explores the possibility of launching their own streaming service in early 2019.", "We asked Netflix whether the \"01/01/2019\" date which briefly appeared in December was due to a typo, a technical error, or the result of something more substantive (such as ongoing negotiations with Warner Bros.) but did not receive a response in time for publication.", "Spangler, Todd.   \"'Friends' to Remain on Netflix Through End of 2019.\"\r\n    Variety.   3 December 2018.", "Harnick, Chris.   \"Is 'Friends' Leaving Netflix in January 2019?!\"\r\n    E! News.   3 December 2018.", "Abidor, Jen.   \"'Friends' Is Leaving Netflix on January 1 and I'm Completely Distraught.\"\r\n    BuzzFeed.   3 December 2018.", "Chitwood, Adam.   \"'Friends' Leaving Netflix Next Year?\"\r\n    Collider.   3 December 2018.", "Lewis, Hilary and Georg Szalai.   \"'Friends' Won't Leave Netflix Until 2020.\"\r\n    The Hollywood Reporter.   3 December 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]