["About this rating", "In September 2016, a number of unreliable political web sites attempted to drag popular \"redneck\" comedian Jeff Foxworthy into the presidential campaign fray, posting articles under headlines such as \"With Just 7 Words, Jeff Foxworthy DESTROYS Hillary Clinton\" and \"Jeff Foxworthy Just Backed Trump, CRUSHED Hillary With 7 Awesome Words On Why We Need Donald\" suggesting that the comic had publicly criticized Hillary Clinton and was now the target of condemnation by \"liberals\":", "Legendary comedian Jeff Foxworthy has made it abundantly clear that he is not happy with the direction our country in heading in. He is tired of watching Obama’s agenda manifest, stripping Americans of our hard-won freedoms.", "“If you can get arrested for hunting or fishing without a license, but not for entering and remaining in the country illegally — you might live in a nation that was founded by geniuses but is run by idiots,” he said as part of his comedy routine.", "“If you have to get your parents’ permission to go on a field trip or to take an aspirin in school, but not to get an abortion — you might live in a nation that was founded by geniuses but is run by idiots,” he continued.", "Foxworthy has also published [sic] endorsed Republican Presidential nominee Donald Trump, commenting he is terrified for our nation if Hillary become president.", "“I think people are fed up with having a commander in chief that does the apology tour around the world,” he concluded.", "Virtually nothing about the content of such articles was true (nor were the \"7 words\" of Foxworthy's that supposedly \"destroyed\" Hillary Clinton ever identified).", "For starters, Foxworthy (whose comedy is rather apolitical) said nothing publicly that could be considered a \"slam\" of Hillary Clinton; he didn't proclaim he was \"tired of watching Obama’s agenda manifest, stripping Americans of our hard-won freedoms\"; nor was he \"attacked\" en masse by liberals (especially over statements he never made in the first place).", "The first two quotes in the article, identified as being taken from Foxworthy's comedy routine, were actually lifted from an online list titled \"A Country Founded by Geniuses but Run by Idiots\" that was falsely attributed to Foxworthy (and debunked here.)", "Although Foxworthy publicly endorsed and campaigned for Republican presidential nominee Mitt Romney in 2012, we found no evidence that he has endorsed 2016 GOP nominee Donald Trump, nor that he said he was \"terrified for our nation\" if Hillary Clinton should become President.", "About the only bit of truth to this piece was that back in September 2015, in response to a question about whether Trump's style of campaigning was \"tapping into American patriotism,\" Foxworthy made reference to President Obama's mythical \"apology tour, saying: \"Absolutely, [Trump] is tapping into the American spirit. I think people are fed up with having a commander in chief that does the apology tour around the world.”", "Another comedian with whom Foxworthy often appears,  Daniel Lawrence Whitney (better known by his stage name of \"Larry the Cable Guy\"), did say during an August 2016 appearance on the \"Fox and Friends\" television program that he thought Hillary Clinton would \"be the end of the country\":", "Larry the Cable Guy said that while he is still on the fence about who he is voting for in November, he thinks Hillary Clinton \"will be the end of the country.\"", "\"Hillary will be the end of the country, that's all I got to say,\" the comedian, whose real name is Daniel Lawrence Whitney, told Fox News. Whitney added that this election has left him torn because while he wants \"a change,\" he has not been able to make up his mind about Donald Trump and said that he also likes Libertarian presidential candidate Gary Johnson.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]