["The video was uploaded to YouTube on April 1, 2020. It has been viewed more than half a million times.", "The video’s Indonesian-language title translates to English as: \n\t“#LATESTNEWS #VIRALNEWSTODAY #VIRALTODAY\n\tLATEST NEWS ~ WEST SUMATRA RESIDENTS ANGRY, EXPEL THE CHINESE, SET THEIR COMPANY ON FIRE”.", "West Sumatra is a province located on Indonesia’s Sumatra island.", "The 10-minute four-second video was published here and here on Facebook, with similar claims. It has been viewed at least 87,000 times and shared more than 4,500 times.", "The claim is misleading; the video contains clips from different incidents before April 2020, including the burning of properties belonging to a gold mining company in West Sumatra in 2011 and a rally against the arrival of Chinese tourists in the same province in January 2020.", "Reverse image and keyword searches in Google revealed that the video consists of at least five clips taken from different incidents that happened in Indonesia between June 2011 and January 2020.", "There are no reports of West Sumatra residents expelling Chinese citizens and burning a Chinese company in April 2020.", "The first clip shows a crowd in an airport as shown in the screenshot below:", "This clip has previously appeared on CNN Indonesia here on January 27, 2020, in a news report about Chinese tourists who arrived in Padang, the capital of West Sumatra province, in January 2020.", "Translated from Indonesian to English, the title of the CNN Indonesia’s report reads: “The arrival of 174 Chinese tourists in Padang triggered controversy”.", "According to the report, the tourists arrived at the airport on January 26, 2020, and were immediately welcomed by the West Sumatra governor.", "Residents objected to the Chinese tourists because they were concerned that COVID-19, which was first identified in the Chinese city of Wuhan in late 2019, could spread to West Sumatra, Liputan6.com reported here on January 27, 2020.", "Below is a screenshot comparison between the first clip in the misleading video (L) and the CNN Indonesia video (R):", "The second clip shows a group of people being interviewed by a journalist. A screenshot of the footage can be seen below:", "The clip previously appeared in this iNews video on January 29, 2020, in a report about a rally against the arrival of the Chinese tourists in West Sumatra.", "The title of the video reads: “The Minang Society Forum demands Chinese tourists to leave West Sumatra - iNews Evening 30/01”, referring to the name of the group who held the rally.", "According to the report, the group demanded the Chinese tourists go home because they were afraid the tourists might bring COVID-19 to the province.", "Below is a screenshot comparing the second clip in the misleading video (L) and the iNews video (R):", "The third clip shows a group of people standing in one direction, as shown in the screenshot below:", "This clip has circulated online since at least in June 2017, in social media posts about Chinese workers in the Indonesian province of Southeast Sulawesi, including this June 6 and this June 7 video on YouTube.", "The title of the video reads: “#Ironic / It is viral in social media. Workers from China in Kendari”.", "The caption read, in part: “This coverage really slaps me, it makes my eyes wide open. The rumor regarding the Chinese workers’ invasion is not a fairytale. This morning I see that with my own eyes”.", "Kendari is the capital city of Southeast Sulawesi province.", "Below is a screenshot comparison between the third clip in the misleading video (L) and the YouTube video (R):", "The fourth clip shows workers in blue workwear. A screenshot of the footage can be seen below:", "The clip has appeared in multiple news reports dated September 2018, including the Wartakota here on September 17, 2018, and Detik.com here, on September 18, 2018.", "The Indonesian-language title of the video reads: “It is viral workers from China measure land in Tambun, Bekasi”.", "The caption reads: “The four foreign workers used an instrument normally used to measure land”.", "Tambun refers to a district in the Bekasi regency, located near Jakarta.", "Below is a screenshot comparison between the fourth clip in the misleading video (L) and the Wartakota video (R):", "The fifth clip shows people standing in front of a burning building. A screenshot of the video can seen below:", "The clip is actually taken from an old video that appeared in this June 17, 2011 article by Liputan6.com.", "Below is a screenshot of the Liputan6.com report:", "The headline reads: “Residents of South Solok set six foreign boats on fire”.", "South Solok is a regency in West Sumatra province.", "Liputan6.com said the company employed some “foreign workers” without mentioning their nationalities.", "The report also said the local residents burned the vessels and buildings because they “felt they had been treated unfairly” by the local authorities.", "“So far, residents who mined gold were often caught by the police. Meanwhile, mining companies that employed foreigners were left alone,” the report said of the residents’ argument.", "The report contains a video showing the same scene. Below is a screenshot comparison between the fifth clip in the misleading video (L) and the video in the Liputan6.com report (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]