["About this rating", "On 16 May 2017, Daily USA Update published an article featuring a supposed \"leaked photograph\" depicting former president Barack Obama handcuffed before a judge and facing charges that he wiretapped President Donald Trump:", "BREAKING: LEAKED PICTURE OF OBAMA BEING DRAGGED BEFORE A JUDGE IN HANDCUFFS FOR WIRETAPPING TRUMP", "After Trump made it clear that Obama had illegally tapped the phones at Trump Tower, the FBI issued a warrant for his arrest. Since then, little has been heard from the former president other than a denial.", "This morning, Obama was stopped at a checkpoint at Toronto International Airport, where he was trying to fly to an unknown destination under the alias “Bruce Wilekenmeyer.” The CRMP officer who stopped him recognized him beneath a fake mustache, took him into custody and turned him over to the US Embassy.", "After a short transport back to Washington, Obama was brought before a special session of US District Court where he could be formally charged and ordered not to leave the country before being released into his attorney’s custody.", "A court reporter who also moonlights for Breitbart took great personal risk to snap this photo since there are no photographs, video recording or any other recording devices allowed in federal courtrooms unless specifically ordered by a judge.", "Neither the image nor the claim were new in May 2017. They were originally published in March 2017 by the notorious fake news site  Last Line of Defense, whose disclaimer reads as follows:", "DISCLAIMER: America’s Last Line of Defense is a satirical publication that uses the imagination of liberals to expose the extreme bigotry and hate and subsequent blind gullibility that festers in right-wing nutjobs. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "The photograph of President Obama purportedly in handcuffs was clearly doctored (with obvious pixellation around his head), using an original photograph swiped from 2009 news articles about the arraignment of a television producer accused of blackmailing David Letterman.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]