["A video of former J&K CM Farooq Abdullah is doing rounds on social media. In the video, Mr Abdullah can be heard chanting “Bharat Mata Ki Jai” slogans at an event. People on social media are sharing the video with the message, “Soon after Mr Amit Shah became Home Minister of India Mr Farooq Abdullah”. It is being claimed that Mr Abdullah was chanting the slogans after Amit Shah’s appointment as the Home Minister in the new cabinet of PM Modi.", "Soon after Mr. Amit Shah became Home Minister of India …. Mr. Farooq Abdullah …..", "Posted by Hanumanlu Gangone on Monday, 3 June 2019", "Several individual users on Twitter and Facebook are sharing the video with the same narrative.", "Alt News found that Farooq Abdullah’s video is related to a speech, which he gave on August 20, 2018, at an all-party prayer meet to pay tribute to former Prime Minister late Atal Bihari Vajpayee. At 5:30 minutes into the video, Mr Abdullah concluded his eulogy by asking people to chant “Bharat Mata Ki Jai” along with him.", "This tribute, delivered by Mr Abdullah, was also reported by several mainstream media outlets. “Watch: Farooq Abdullah ends emotional tribute to Vajpayee with rousing chant of Bharat Mata Ki Jai”, reads the headline of a report published by DNA on August 20, 2018.", "In conclusion, an old video of Farooq Abdullah was shared with a false narrative that he had raised “Bharat Mata Ki Jai” slogans after Amit Shah was appointed as the Home Minister.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]