["This Facebook post from July 24, 2020, has been shared more than 3,000 times and was published shortly after Buhari joined other African leaders in Mali for crisis talks last month.", "“PUBLIC UNVEILING OF THE LATEST BUHARI HYPER-REALITY FACE MASK IN MALI,” reads the post’s introduction. It goes on to compare, in fine detail, two photographs of Buhari -- a recent one from his Mali trip and an older portrait.", "It claims that owing to the purported differences in size, colour and shape of the necklines and ears, the most recent photograph cannot be Buhari, but is instead a body double.", "“Nobody can recreate a dead man without making silly mistakes. Buhari is dead and buried,” the post concludes.", "The owner of the Facebook page responsible for the post is “Mazi Nnamdi Kanu”, the British-Nigerian leader of the Indigenous People of Biafra (IPOB) who are demanding independence from Nigeria.", "Similar claims to Kanu’s are made in another post, archived here, while this one reaches the same conclusion with the hashtag #BuhariIsDead by juxtaposing two low-quality images of Buhari and focusing on purported changes to his front teeth.", "Kanu again uses two comparative images in this post from August 9, 2020, to drive home his claim that a Buhari imposter is running the country, or the “Zoo” as he calls it. Shared nearly 5,000 times, the pictures -- one clearly altered -- are dated four years apart and claim to be evidence of two different people.", "Adding to the recent spate of claims is an old post from 2018, which has been shared more than 23,000 times and which recently resurfaced on Facebook. It claims that American cable network CNN reported the death of Buhari two years ago and includes a picture of a purported news anchor delivering a broadcast with an inset image showing a crowd carrying a body shrouded in white.", "The headline below a “breaking news” label reads “Nigeria president Buhari is dead in UK”, while the post’s caption claims that “CNN have finally release the news of demise of Buhari which took January 27 2017 (sic)”.", "Buhari, who is also the chairman of the Economic Community of West African States (ECOWAS), is alive. He has made a number of public appearances since these posts were published, including this one on July 31, 2020. Buhari also met with northeast governors and security chiefs on August 10, 2020. See the video here.", "AFP Fact Check ran multiple reverse image searches on the alleged television broadcast by CNN and found the same picture format on the internet back in 2017. We traced it to a website called PhotoFunia, where news headers can be edited to say whatever a user wants.", "The picture used in the inset is a Naij.com photo of the funeral for Abubakar Audu, the former governor of Kogi state in central Nigeria.", "Conspiracies claiming that Buhari has died began in 2017 and AFP Fact Check found one common factor on social media networks where the claim is being shared -- Biafra.", "The Indigenous People of Biafra (IPOB) is a separatist group demanding independence in southern Nigeria. The group, led by Kanu, was declared a terrorist organisation by the Buhari government in September 2017 -- incidentally when the death claims about Nigeria’s leader first emerged and Kanu himself was released from prison after serving 18 months for criminal conspiracy, intimidation and belonging to an illegal organisation.", "The earliest mention of the claim found by AFP Fact Check was in a video posted on Twitter on September 3, 2017. Like other posts shared at the time, it claimed a body double who had undergone facial reconstruction was ruling the country in place of Buhari. AFP Fact Check debunked this claim here and related ones here and here.", "Fredrick Nwabufo, a Nigerian journalist who has written extensively about Biafra (here and here), told AFP Fact Check that the movement’s supporters see Buhari as an obstacle to the realisation of their separatist goals, and employ the body-double narrative to “de-legitimise” the government.", "“The (Biafran) leadership needs the controversy to stay alive -- to remain relevant,” said Nwabufo.", "David Ajikobi, Nigerian editor of fact-checking organisation Africa Check, said supporters continue to share the false claims because of their “confirmation bias”.", "“People believe misinformation and disinformation because of their biases,” said Ajikobi, adding that the Buhari posts tend to resurface during security crises, elections and political campaigning. Ajikobi said social media networks must respond quicker to shut down misinformation before it begins to spread.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]