["About this rating", "A quote that has circulated on the internet for at least a decade has been attributed to a number of people—most notably to the founder of psychoanalysis, Sigmund Freud.", "The quote says: “Before you diagnose yourself with depression or low self esteem, first make sure you are not, in fact, just surrounded by assholes.”", "The quote has been attributed to Freud in a book about actress Marilyn Monroe, on an artist network’s website, and on Twitter, but sometimes with variations that replace the word \"assholes\" with \"jerks\":", "It seemed unlikely, just based on the language, that these were the words of an Austrian man who lived during the 19th and early-20th century. Our readers asked us about the origins of this quote, and we found that it was not in fact Freud who said it, but possibly just a person on the internet.", "We reached out to the Sigmund Freud Museum in Vienna, and a spokesperson confirmed that, “There is no written evidence nor any other reliable source confirming that this would be a Freud quote. Also the wording speaks against Sigmund Freud.” The spokesperson added that this question had come up before, and that the quote had circulated on social media for a few years.", "We also reached out to the Sigmund Freud Archives and the Library of Congress’ archives containing Freud’s writings. We will update this post if more information becomes available.", "So where did the quote actually come from?", "According to Quote Investigator, a website that looks into such questionable quotes, the earliest version of this quote was claimed by a now-deleted Twitter user @debihope. In a tweet from 2010, @debihope wrote, “Before you diagnose yourself with depression or low self esteem, first make sure you are not, in fact, just surrounded by assholes.” She responded in 2014, claiming the words were hers: “Popped right out of my own head and based on a past boyfriend.”", "The quote, however, spread across the internet through other tweets, and over the course of a decade was not only attributed to Freud, but also to science fiction writer William Gibson. Gibson had retweeted the quote, and graphics subsequently spread claiming he was the source. Gibson later debunked this himself:", "Given that we know this is not a Freud quote, and a now-deleted Twitter account said it was the source, we rate this claim as “Misattributed.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]