["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The poll was of beer drinkers, not Americans overall.", "The poll was conducted by a PR firm. The firm did not release full details about the poll.", "If coronavirus hadn’t yet caught your attention, maybe disturbing news about the widening health threat and beer did.", "CNN, Esquire and other American mainstream news media reported incorrectly on a survey examining consumers’ feelings about the coronavirus and Corona beer.", "Some of those news stories, shared on Facebook, were topped by this errant headline:", "\"Poll Finds 38% of Americans Say They Will Not Drink Corona Beer Because of Virus.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The survey was done by a New York City firm, 5W Public Relations. The firm announced the results on Feb. 27, 2020, as public health concerns rose in the United States. The next day President Donald Trump held a news conference about the nation’s response to coronavirus.", "The survey \"via phone\" of 737 American beer drinkers over age 21 on Feb. 25 and 26 was done \"regarding their opinions about the popular Mexican beer brand, Corona, as a result of the deadly coronavirus that's spreading around the world,\" the PR firm’s news release said.", "So, this was a survey of beer drinkers, not of Americans overall.", "The first result reported in the release:", "\"38% of beer-drinking Americans would not buy Corona under any circumstances now.\"", "The release also does not say whether the survey was representative of American beer drinkers.", "The firm did not provide us the results of other questions, but told us these were the questions used in the survey:", "Are you a beer drinker?", "Are you a Corona drinker?", "Is Corona related to the coronavirus?", "In light of the coronavirus, do you plan to stop drinking Corona?", "Would you buy Corona in a store?", "Would you order a Corona in a restaurant/bar/public venue?", "Would you buy Corona under any circumstances now?", "The questions asked by the firm underscore the problems with the reliability of this poll. And because the PR firm won’t release more details, it’s ultimately untrustworthy.", "Respondents, for instance, were asked if Corona is related to the coronavirus but were never told it isn’t. They were then asked a leading question, \"In light of the coronavirus, do you plan to stop drinking Corona?\" that suggests some correlation between the beer and the virus even though there is none. And some respondents may have said they don’t drink Corona and would continue not to drink Corona.", "Nevertheless, the news release to the media was clear that the 38% figure applied to beer drinkers, not Americans overall.", "At PolitiFact, we’re used to seeing a fair number of either misleading polls, or misleading reports about polls. In this case, the lack of transparency by the polling firm (a PR company) means you should be skeptical, too. Some news organizations, however, were not. You can read PolitiFact’s guide to polling to better understand what to look for and what types of polls to stay away from.", "A statement shared on Facebook said: \"Poll Finds 38% of Americans Say They Will Not Drink Corona Beer Because of Virus.\"", "The poll was of American beer drinkers, not Americans overall. Other details of this \"poll\" — including the specific question asked — are unknown, so it’s difficult to say beer drinkers wouldn’t drink Corona beer because of the virus, or some other reason.", "We rate the statement False.", "Facebook, post, Feb. 28, 2020", "Cision PR Newswire, 5W Public Relations news release, Feb. 27, 2020", "Email, Bobbie Windatt, associate vice president, corporate communications and marketing at 5W Public Relations, March 2, 2020", "The Atlantic, \"What the Dubious Corona Poll Reveals,\" Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]