["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There’s no vaccine yet to protect against COVID-19 — just furious efforts underway to develop one. But a recent blog post makes a big claim: that \"the government has released their initial plans to force a vaccine on everyone.\"", "\"Earlier today, the Trump administration released its plans to vaccine everyone in a short time,\" reads the Sept. 16 post on a website called Before It’s News. \"Three potential vaccines are currently in Stage 3 trials in the United States and could be ready in weeks, President Donald Trump said Tuesday. Time is running out. And Trump has the military lined up and ready to distribute this vaccine to the public, whether you want it or not.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First: the U.S. government has not released plans to force a vaccine on all residents.", "Trump has floated the prospect of a vaccine becoming available \"within a matter of weeks.\" But Robert Redfield, director of the federal Centers for Disease Control and Prevention, told lawmakers on Sept. 16, the day this blog post was published, that a vaccine wouldn’t likely be generally available to the American public until at least the middle of 2021.", "Also that day, the U.S. Department of Health and Human Services and the Defense Department released documents detailing the Trump administration’s plan to deliver \"safe and effective COVID-19 vaccine doses to the American people as quickly and reliably as possible.\"", "\"Detailed planning is ongoing to ensure rapid distribution as soon as the FDA authorizes or approves a COVID-19 vaccine and the CDC makes recommendations for who should receive initial doses,\" a news release about the administration’s plan says.", "The Defense Department will help distribute the vaccine, according to the release, but there is no mention of forcing it on Americans. An 11-page strategy to distribute a vaccine from the Pentagon and HHS also does not discuss forcing vaccines on people.", "Once larger quantities of a vaccine become available, the administration has two objectives, the strategy says: providing \"widespread access to vaccination\" to achieve coverage across the U.S. population; and making sure that groups that have a higher risk of suffering more severely from COVID-19 access the vaccine.", "The strategy uses language that indicates vaccination is voluntary — though strongly encouraged.", "\"The objective is to ensure no one desiring vaccination will face an economic barrier to receiving one,\" it says at one point. HHS \"is also committed to ensuring rural populations can receive the vaccine.\"", "The strategy also acknowledges that some people are wary of vaccines.", "\"Strategic communications and public messaging are critical to ensure maximum acceptance of vaccines,\" it says, \"requiring a saturation of messaging across the national media.\"", "An information campaign is planned to \"ensure maximum vaccine acceptance,\" the strategy says. Not force.", "We rate this blog post False.", "Blog post, Sept. 16, 2020", "Politico, Trump claims vaccine coming ‘within a matter of weeks,’ contradicting health officials, Sept. 21, 2020", "The Hill, Why the director of the CDC thinks our lives won’t get back to normal for nearly another year, Sept. 16, 2020", "U.S. Department of Health and Human Services, Trump administration releases COVID-19 vaccine distribution strategy, Sept. 16, 2020", "U.S. Department of Health and Human Services and Department of Defense, From the factory to the frontlines, Sept. 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]