["About this rating", "Students at the Mason Classical Academy in Naples, Florida, did rank highly among schools in the local district for English Language Arts and Mathematics in 2017, and their scores improved from the year before.", "The school never adopted Common Core in the first place, so the improvement in results was not linked to Common Core.  In Mathematics, four public schools that participate in Common Core ranked above the Mason Classical Academy.", "The Common Core State Standards Initiative, commonly known as Common Core, has provoked almost endless debate since the administration of U.S. President Barack Obama introduced it in 2010. Critics say the program — which entails a set of national standards for English and mathematics among K-12 students — is too rigid and does not allow individual states, school districts, and schools enough leeway or freedom to improvise and make adjustments in how they teach their students.", "To that end, the conspiracy theorist web site YourNewsWire.com seized upon on what appeared to be an argument for abandoning Common Core, in the example of an independent charter school in Florida. In July 2017, the blog posted an article with the headline \"Florida School Ditches Common Core — Soars to Number One.\" The article read, in part:", "A school in Florida that dumped the Common Core program in favor of traditional teaching methods has soared to the number one position in the State’s top schools list, according to government statistics.", "Earlier that summer, good test results by students at the Mason Classical Academy in Naples, Florida also prompted articles by FreedomProject.com (a web site that promotes classical education and \"Judeo-Christian values\") and the disreputable \"alternative health\" blog NaturalNews.com, which wrote, \"Florida school dumps common core then skyrockets to number one in English Language Arts, with 90 percent scoring proficient.\"", "The clear message in all these reports was that a decision by the school to abandon the Common Core standards had caused its students' statewide test results to improve dramatically.", "This is false. In reality, the Mason Classical Academy has never used Common Core; therefore, the improvement in its students' test results between 2016 and 2017 could not have had any connection to Common Core. As its principal, David Hull, wrote in 2014:", "Which is more critical, a solid education or passing state tests? Can we accomplish delivering both? Is it ethical to focus more on state standards than a rigorous curriculum influenced by one of the most prestigious colleges in the world, Hillsdale College? Are we able to accomplish our mission with state mandates and Common Core breathing down our necks? Do we have our students practice for state tests on computers because tests are now computer-based? Are our students at an automatic disadvantage because we choose paper and pencil over keyboards and mice? These are difficult questions to answer, and ones that will be revealed only by time.", "In 2017, Hull revisited the issue, comparing Common Core to Big Brother:", "The general theme of the original article argues that MCA is a charter school that has abandoned Common Core, and doing so catapulted the school to number one status. The pursuit of truth requires humility, so I therefore must admit, although the argument is on the right track, the author misses much of the bigger picture. Common Core is not solely responsible for America's less-than-stellar educational performance. Common Core is more like a placebo fighting a long ignored infection. But while placebos have often worked to bring therapeutic relief to people, Common Core has not accomplished what is necessary to repair public education. What ails our system is mainly due to progressive education, and the cure requires more than a placebo.", "If one is looking for a simple answer to why Common Core is bad, then my opinion is this: CC is bad because it favors teaching skills over knowledge, and it helps perpetuate the decline of Western Civilization mainly through the sidelining of quality literature and history instruction ...", "If we are in want of educational reform, then we must see the faults of education for what they truly are. Common Core does harm education in many ways, but it is not the root cause. Progressive education is the root cause, and the problems stemming from it have compounded in countless ways throughout far too many schoolhouses across the country, both public and private. I know that many will take offense to what was written here, but the tales must be told.", "Furthermore, while the school's students did have outstanding results in English Language Arts in 2017, their mathematics results were not quite as good, though still among the best in the Collier County school district.", "FreedomProject.com reported that when it comes to the statewide Florida Standards Assessment, the Mason Classical Academy \"scored number one in English Language Arts (ELA) in the county, with 90 percent of its third graders scoring proficient.\" This is only partly true. The school's third-graders did rank first among 33 schools in the county for English, as did the fifth-graders, although the fourth-graders ranked 7th.", "When it comes to mathematics, the second discipline relevant to Common Core, the school's students didn't perform as well. In 2017, the Mason Academy ranked fifth in the school district across all three grades with, on average, 81 percent of students receiving a score of at least \"proficient\" across all three grades. The four schools that outperformed the Mason Classical Academy on Florida Standards Assessment mathematics testing in 2017 — the basis of the argument put forward by FreedomProject.com and others — were all public schools implementing the Common Core set of standards.", "This significantly undermines the causal connection that FreedomProject.com and others made between higher test results and the absence of Common Core.", "Collier County Schools District.   \"Florida Standards Assessment Results.\"\r\n    June 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]