["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At a CNN town hall in New Hampshire, U.S. Sen. Amy Klobuchar of Minnesota, one of the Democratic candidates for president in 2020, was asked by a member of the audience: \"Why can’t we have Medicare for All?\"", "That proposal would create a single, national health insurance program that would cover everyone.", "Without committing specifically to Medicare for All, Klobuchar, who is seen as running to the political center, said, \"I believe we have to get to universal health care in this country.\" And a few minutes later, she made a statistical claim we want to check.", "\"But the other part of the equation is doing something about prescription drugs,\" Klobuchar said. \"They are nearly 20 percent of our health care costs now when you include hospital prescription drugs.\"", "We wanted to know if her estimate for the share of prescription drugs on health spending is accurate.", "Klobuchar’s campaign pointed us to a recent estimate from the federal government, which uses personal health expenditures, and from a research center, which uses total health expenditures.", "There are differences in the data. (Personal spending, for example, does not account for spending on administration or construction). But both measures roughly work out in her favor.", "• 16.7 percent: This estimate by the U.S. Department of Health and Human Services was for how much of spending on personal health expenditures went for prescription drugs in 2015. (The estimate for 2018 is 16.8 percent.)", "By the way, almost three-quarters of the estimated $457 billion spent on prescription drugs was at retail outlets such as store pharmacies. The rest was for non-retail drugs — those dispensed by medical providers, such as in a hospital or doctor’s office.", "We found that same 16.7 percent figure matches a current estimate on how much is spent on retail and non-retail drugs as a percentage of personal health expenditures.", "That estimate comes from a May 2018 report by Altarum, a non-profit research group based in Ann Arbor, Mich. (The report itself says prescription drugs amount to 14.2 percent of total health expenditures, but Altarum told us the figure is 16.7 percent when considering only personal health expenditures.)", "• 15 percent: This estimate, for total 2016 health care spending, was done by the Center for Health Policy and Outcomes at Memorial Sloan Kettering Cancer Center in New York. It was published in July 2018.", "Like the federal estimate, this estimate counted spending on retail and non-retail drugs; but it is different in that it counted revenues that accrued not only to drug manufacturers, but also to intermediaries such as distributors.", "Economist Gail Wilensky, a senior fellow at the Project Hope health foundation, cautioned us that estimates on how much is spent on hospital prescription drugs are more difficult to produce than what is spent on retail prescription drugs.", "But Klobuchar did specifically include hospital prescription drug spending in her claim.", "And two other health care experts — the Kaiser Family Foundation’s Cynthia Cox and Katherine Baicker, dean of the Harris School of Public Policy at the University of Chicago — told us the estimates that include hospital drugs are reliable, and that measuring prescription drug spending against personal health expenditures is solid.", "Klobuchar says prescription drugs \"are nearly 20 percent of our health care costs now when you include hospital prescription drugs.\"", "The best estimates we’ve found put the figure for spending on prescription drugs between 15 percent, when considering total health care spending, and 17 percent, when considering only personal health care spending.", "We rate her statement Mostly True.", "YouTube, CNN town hall (5:00), Feb. 18, 2019", "CNN, town hall transcript, Feb. 18, 2019", "Email, Amy Klobuchar campaign spokeswoman Carlie Waibel, Feb. 19, 2019", "U.S. Department of Health and Human Services, \"Observations on Trends in Prescription Drug Spending,\" March 8, 2016", "Health Affairs, \"Spending On Prescription Drugs In The US: Where Does All The Money Go?\" July 31, 2018", "The Campaign for Sustainable Rx Pricing, \"The Facts About Rising Prescription Drug Costs,\" 2016", "Journal of Managed Care & Specialty Pharmacy, \"What Contributes Most to High Health Care Costs? Health Care Spending in High Resource Patients,\" February 2016", "American Medical Association, \"National Health Expenditures, 2016: Annual Spending Growth on the Downswing,\" 2018", "U.S. Centers for Medicare & Medicaid Services, \"National Health Expenditures 2017 Highlights\"", "Pew Charitable Trusts, \"A Look at Drug Spending in the U.S.,\" Aug. 28, 2018", "Altarum, \"Projections of the Prescription Drug Share of National Health Expenditures Including Non-Retail,\" May 2018", "Email, Peter Bach, director of the Center for Health Policy and Outcomes at Memorial Sloan Kettering Cancer Center, Feb. 20, 2019", "Email, Ani Turner, co-director of Sustainable Health Spending Strategies at Altarum, Feb. 20, 2019", "Email, Kaiser Family Foundation director for the Program for the Study of Health Reform and Private Insurance", "Cynthia Cox, Feb. 20, 2019", "Email, Gail Wilensky, senior fellow at the Project Hope health foundation, Feb. 20, 2019", "Email, Katherine Baicker, dean of the Harris School of Public Policy at the University of Chicago, Feb. 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]