["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On March 12, 2014, the Republican-controlled Wisconsin state Senate approved several pieces of legislation that dismayed Democrats.", "The same day, Senate Minority Leader Chris Larson of Milwaukee pounced on three of the bills, citing them in a fund-raising email he sent on behalf of a committee that works to elect Democrats to the Senate.", "One of the bills, Larson wrote, is \"denying veterans the right to recover their medical costs for cancers they developed while serving their country.\"", "Fund-raising letters often make startling claims, like \"denying\" rights.", "Let’s see how this one does on the Truth-O-Meter.", "The bill", "The bill Larson cites is due for a vote in the state Assembly on March 20, 2014. Gov. Scott Walker has not said whether he would sign it.", "The bill would change requirements for anyone who files a lawsuit claiming they contracted an illness, often cancer, as a result of exposure to asbestos.", "So, despite Larson’s claim, the bill does not target veterans.", "That being said, veterans, particularly those who served in the Navy, make up a large percentage of people with mesothelioma, one type of cancer caused by asbestos exposure. Some studies show that as many as 30 percent of all Americans with mesothelioma cancer are veterans who were exposed while on active duty, according to Mesothelioma.com.", "There are two ways that a person with asbestos-related cancer can seek to recover money for their medical costs and other damages:", "1. File a lawsuit against a company that manufactured or used asbestos.", "2. File a claim with one or more trusts that were set up by now-bankrupt companies to pay victims of asbestos-related illnesses.", "Under the bill, cancer victims suing an existing company would have to disclose whether they have also filed a claim with any of the asbestos trusts.", "And if they haven’t already done so, the judge handling the lawsuit could order them to file a claim with one or more of the trusts.", "Under that scenario, if the lawsuit is resolved in a settlement or at trial and it is determined that the cancer victim be paid damages, the parties or the jury could determine how much should be paid by the existing business being sued and how much, if any, should be paid by trusts.", "Opponents of the bill worry that a veteran could end up collecting less money, because the funds in some trusts have been depleted, while supporters see the possible apportionment of blame as a matter of fairness.", "Before we close, a little more from each side:", "-- Opponents of the bill include the American Legion, Wisconsin Veterans of Foreign Wars and the Military Order of the Purple Heart.", "They say the the bill could delay a trial for six months or more -- and given that Mesothelioma victims typically die within about a year or less of being diagnosed, a veteran could become incapacitated or die before the trial, hurting the chances of the veteran or the veteran’s family to collect damages.", "Moreover, if a jury decides an existing business is responsible for damages, the veteran stands a strong chance of collecting a full amount. But if the jury decides that a trust is responsible for some of the damages, it’s possible the veteran wouldn’t collect that entire amount because some trusts are depleted.", "-- Supporters of the bill include the National Federation of Independent Business, Wisconsin Manufacturers and Commerce and the AMVETS veterans group.", "They say there wouldn’t be any significant delays in asbestos trials because attorneys representing cancer victims would know before filing any lawsuit that they also have to file a claim with an asbestos trust. And even now, it can take up to a year before an asbestos lawsuit goes to trial, so many veterans videotape their testimony in case they die before the trial begins.", "The supporters also say the bill would stop so-called double dipping: a cancer victim collecting damages from the company they sue and then filing claims for more money with one or more of the trusts. Double dipping arguably depletes funds available for other cancer victims who have legitimate claims.", "Our rating", "Larson said the Republican-controlled Wisconsin Senate approved a bill \"denying veterans the right to recover their medical costs for cancers they developed while serving their country.\"", "The bill does not target veterans and does not deny their right to seek compensation, both from existing and now-bankrupt asbestos-related companies, for cancer they contracted as a result of serving in the military.", "But Larson’s claim contains an element of truth, in that the bill could result in some veterans collecting less money from legal actions than they could under the current system for seeking compensation.", "We rate Larson’s statement Mostly False.", "Wisconsin Legislative Council, memo, March 12, 2014", "Wisconsin Legislature, Assembly Bill 19", "Associated Press, \"Bill would put restrictions on asbestos suits,\" April 4, 2013", "Milwaukee Journal Sentinel, \"Senate debates bills on school snow days, campaign laws, early voting,\" March 11, 2014", "Milwaukee Journal Sentinel, \"Wisconsin Assembly passes measure that changes what doctors must tell patients for diagnoses,\" May 8, 2013", "Associated Press, \"Veterans call for end to asbestos lawsuit bill,\" March 17, 2014", "Milwaukee Journal Sentinel, \"Veterans oppose Wisconsin asbestos bill,\" Nov. 26, 2013", "Milwaukee Journal Sentinel, \"Bill protects Wisconsin businesses in asbestos lawsuits,\" Dec. 11, 2013", "Interview, veterans lobbyist and attorney Jason Johns, March 17 and 18, 2014", "Interview, asbestos litigation defense attorney Trevor Will, March 18, 2014", "Email interview, state Sen. Glenn Grothman, March 13, 2014", "Email interview, State Senate Democratic Committee executive director Beau Stafford, March 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]