["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The terrorist attacks of Sept. 11, 2001 may have forever changed the landscape of Lower Manhattan, but they didn’t stop more and more people from calling the area home.\n\nTen years since that fateful day, New York City Mayor Michael Bloomberg has a statistic to prove it: the population of Lower Manhattan has nearly doubled, surpassing the combined growth in three major American cities.\n\n\"Over the past 10 years, the number of people living in Lower Manhattan has nearly doubled,\" Bloomberg said during a Sept. 6 speech. \"In fact, Lower Manhattan has added more people over the last 10 years than Atlanta, Dallas and Philadelphia combined. In 2001, no one could have believed that that would happen.\"\n\nPolitiFact New Jersey found that Bloomberg’s numbers are accurate. Based on data from the U.S. Census Bureau, most of the area below Canal Street saw a net population increase of 26,870 between 2000 and 2010. The population in that area last year was 59,316 -- an increase of nearly 83 percent.\n\nAtlanta, Dallas and Philadelphia saw population increases during the same time period of 3,529, 9,236 and 8,456, respectively, according to census data. That’s a combined total of 21,221.\n\nLet’s explain how Bloomberg defines \"Lower Manhattan\" to reach his population estimate.\n\nTo back up the mayor’s point, Bloomberg spokesman Andrew Brent sent us a chart prepared by the city’s Department of City Planning.", "That chart breaks down population changes in 12 \"census tracts\" representing the area south of Canal Street, west of Centre Street and south of the Brooklyn Bridge. The changes in those census tracts totaled 26,870 new residents between 2000 and 2010.\n\nCanal Street is widely considered a dividing line between Lower Manhattan and the rest of the borough.\n\nHowever, we also found a separate analysis by the Department of City Planning that claims a smaller population increase of 19,611 for an area defined as \"Battery Park City-Lower Manhattan.\" Comprised of seven census tracts, that smaller area excludes several northern blocks closer to Canal Street.\n\nStill, that analysis cautions that \"(Neighborhood Tabulation Area) boundaries and their associated names may not definitively represent neighborhoods.\"\n\nJovana Rizzo, a City Planning spokeswoman, further confirmed in an email that the \"26,870 number is the more appropriate reflection of Lower Manhattan (south of Canal St).\" So Bloomberg’s figure of 26,870 new residents in Lower Manhattan is correct.\n\nNow, let’s talk about why people have moved there.\n\nEven before Sept. 11, Lower Manhattan was being transformed into more of a residential community. Office space in the financial district was being converted for residential use, industrial lofts in Tribeca were being revamped and new construction was under way in Battery Park City, according to Sharon Zukin, a sociology professor at Brooklyn College.\n\nDrawn by housing prices, waterfront access and other amenities, people were carving out a residential community where none existed before, Zukin said.\n\n\"They became emotionally attached to living in Lower Manhattan,\" said Zukin, referring to the existing residents on Sept. 11.\n\nMore residents came to Lower Manhattan as housing prices dipped in the years following Sept. 11, said Pace University professor Farrokh Hormozi, who once helped prepare a formerly ongoing university report on economic activity in Lower Manhattan.\n\nAfter the transformation began around 2004, the level of economic activity surpassed its pre-Sept. 11 levels by 2007, Hormozi said.\n\n\"It is a very interesting part of the City of New York,\" Hormozi said. \"It has something to offer and people are taking advantage of that.\"\n\nThe population increase in Lower Manhattan also coincided with \"a development boom that was fueled by two public incentive programs,\" including the availability of $1.6 billion in federal funding between 2001 and 2005, according to the Alliance for Downtown New York.\n\nThese days, the residential vacancy rate sits at 0.7 percent, according to the Alliance.\n\nOur ruling\n\nNearing the 10th anniversary of the Sept. 11, 2001 terrorist attacks, Bloomberg claimed the population in Lower Manhattan has nearly doubled, exceeding the combined growth in Atlanta, Dallas and Philadelphia.\n\nCensus data backs up his statement. Many people not only paid more attention to Lower Manhattan in the years following Sept. 11. They moved there.\n\nWe rate the statement True.", "To comment on this ruling, go to NJ.com.", "Mayor Bloomberg Delivers Major Address on the Rebirth of Lower Manhattan Since 9/11, Sept. 6, 2011\n\nEmail interview with Andrew Brent, spokesman for Mayor Michael Bloomberg, Sept. 6-7, 2011\n\nU.S. Census Bureau, 2010 Population Finder, accessed Sept. 6, 2011\n\nU.S. Census Bureau, Profile of General Demographic Characteristics: 2000 for Atlanta, accessed Sept. 6, 2011\n\nU.S. Census Bureau, Profile of General Demographic Characteristics: 2000 for Dallas, accessed Sept. 6, 2011\n\nU.S. Census Bureau, Profile of General Demographic Characteristics: 2000 for Philadelphia, accessed Sept. 6, 2011\n\nNew York City Department of City Planning, Results from the 2010 Census- Population Growth and Race/Hispanic Composition, accessed Sept. 6, 2011\n\nNew York City Department of City Planning, Total Population, 2000-2010 for Neighborhood Tabulation Areas, accessed Sept. 6, 2011\n\nNew York City Department of City Planning, New York City 2010 Neighborhood Tabulation Areas, accessed Sept. 6, 2011\n\nEmail exchange with Jovana Rizzo, New York City Department of City Planning, Sept. 8, 2011\n\nEmail exchange with Nicole Kolinsky, Alliance for Downtown New York, Sept. 8, 2011\n\nAlliance for Downtown New York, The State Of Lower Manhattan, Aug. 11, 2011\n\nAlliance for Downtown New York, Survey of Lower Manhattan Residents: Summary of Findings, May 2010\n\nInterview with Sharon Zukin, Brooklyn College and CUNY Graduate Center, Sept. 9, 2011\n\nInterview with Farrokh Hormozi, Pace University, Sept. 9, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]