["House Speaker Nancy Pelosi, D-Calif., introduced on May 12 a $3 trillion coronavirus response bill to provide further economic relief to the country.", "Three days later, the Democrat-controlled House passed it, the fifth piece of legislation to address the pandemic.", "The 1,800-page bill, dubbed the HEROES Act, would – among other programs – fund $3.6 billion in election security measures in response to activists' and politicians’ concern about safely holding elections amid a pandemic. Those initiatives have drawn attention from Charlie Kirk, president of the conservative group Turning Point USA.", "A post on Facebook of a screenshot of a tweet from Kirk has been shared more than 10,000 times. It reads, “Nancy Pelosi’s 3 TRILLION dollar ‘stimulus’ bill would ELIMINATE state requirements for Voter ID.”", "Voter identification requirements vary by state. According to the National Conference of State Legislatures, a bipartisan nongovernmental organization that informs legislatures on policy, “36 states have laws requesting or requiring voters to show some form of identification at the polls.”", "Fourteen states verify voters’ identities using other methods such as sworn signatures, photo IDs or a nonphoto ID such as a bank statement or utility bill that are “checked against information on file.” Some states have nondocumentary ID requirements. Those include “signing an affidavit or poll book” or “providing personal information,” according to the NCSL.", "What happens when a voter does not provide sufficient documentation varies by state. In some, voters without identifying documentation may cast a provisional ballot without further action. Other states require voters to return to the election office within days and provide their identifying documents.", "Opinion:Vote-by-mail delivers an array of problems", "Opinion:Republican leader: My state shows why voting by mail is secure and trustworthy", "If enacted, the HEROES Act would overrule those state laws as pertains to federal elections (meaning president and Congress) and simplify identification requirements across all states by adding a sworn written statement as acceptable identification.", "Section 160004 of the HEROES Act would amend the Help America Vote Act of 2002. A summary of the legislation says, “If a state has a voter identification requirement to cast a ballot in-person or by mail, an individual may make a sworn written statement attesting to their identity to fulfill the identification requirement.” The change would “not affect the Help America Vote Act’s requirements for certain first-time voters who submitted their voter registration by mail.”", "The amendment comes during lawmakers' struggle to figure out how to ensure fair and safe elections during a pandemic. As voting rights activists push for easier access, some states are attempting to tighten voting requirements.", "A group of voters sued North Carolina in early May over rules surrounding recently enacted provisions regarding absentee mail-in ballots. The group called on the state to \"provide prepaid postage on all absentee ballots\" and \"change a requirement for two witnesses to sign a ballot,\" the News & Observer reported. This comes after the state and federal courts of appeals blocked its voter ID requirement for the November election.", "These legal clashes are not unique to North Carolina. A federal judge ruled against a Texas law that required voters to be over the age of 65 to receive a mail-in ballot. In April, a federal appeals court panel deemed unconstitutional a Kansas law requiring people to provide proof of citizenship when registering to vote.", "The Associated Press reported in April that Kentucky legislators voted to pass a bill that requires voters, with few exceptions, to bring a government-issued photo ID to the polls despite ID-issuing offices being closed because of the pandemic.", "Kentucky state Sen. Robby Mills, the bill’s lead sponsor, defended the legislation, raising the possibility of offices reopening in the summer. Corey Shapiro, legal director of the American Civil Liberties Union of Kentucky, deemed the proposal a “voter suppression measure in the name of election security” because the bill probably would result in lower turnout among the poor, elderly, disabled and people of color. Shapiro said he is considering whether to take legal action against the measure.", "Opponents of measures such as the provisions included in the HEROES Act typically cite the need to protect against voter fraud.", "There has been virtually no evidence of widespread voter fraud in past elections.", "Vox reported on a Loyola Law School study by Justin Levitt, who worked with the Justice Department under the Obama administration, that found “only 35 credible allegations of in-person voter fraud among the 834 million ballots cast in the 2000-2014 elections.”", "The Brennan Center details several reports on voter fraud allegations on its site.", "Senate Majority Leader Mitch McConnell, R-Ky., has not specified a timeline for when the Senate would vote on the HEROES Act or propose new legislation. Many observers say there is no chance Pelosi’s bill will survive the Republican-controlled Senate.", "Although it is unlikely to pass the Senate, the HEROES Act would amend the Help America Vote Act of 2002 and allow a sworn signature as acceptable identification for voters on election days in all states, eliminating the need for voter IDs. The details are in the bill's Section 160004, which applies specifically to federal elections.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]