["The claim has been shared more than 2,000 times after it was published by an Australia-based Facebook user here on March 22, 2020.", "The post reads: “Those of you with pre-existing respiratory conditions such as COPD or asthma can contact your GP for a 'Rescue Pack'. It gives you a 5 day supply of a corticosteroid (prednisolone) and a 5 day supply of an antibiotic (usually amoxicillin or doxycycline) which can be started immediately if you develop any breathing issues.”", "The claim circulated online as the world continued to endure the effects of the COVID-19 pandemic. As of April 2, 2020, the virus has killed more than 40,000 people and infected more than 827,000 others worldwide, according to the World Health Organisation (WHO).", "Below is a screenshot of the misleading post:", "The claim was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter.", "The claim is false.", "“The Department of Health has been made aware of misinformation on social media regarding ‘rescue packs’ that contain steroid and antibiotic tablets being made available for people with pre-existing respiratory conditions such as asthma or chronic obstructive pulmonary disease (COPD),” a department spokesperson told AFP in an email on April 1. “Patients cannot receive a ‘rescue pack’ from their GP, unless previously prescribed.”", "The spokesperson added: “It is imperative for people with respiratory conditions to follow the health advice and management plan of their treating physician, and for everyone to be aware of false information that is sometimes posted on social media.”", "People with pre-existing medical conditions, such as cardiovascular disease, chronic respiratory disease or diabetes, are at greater risk for severe disease such as novel coronavirus, the WHO warned. The agency advised good hygiene, social distancing and other preventive measures as the novel coronavirus continues to spread globally.", "Health authorities in the United Kingdom and Ireland also debunked a similar rumour after it circulated online in their countries.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]