["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott has touted a strong Florida economy built up over his two terms in office. But Andrew Gillum, the Democratic candidate seeking to replace him, says the economy is \"propped up\" by low wages and people working multiple jobs just to make ends meet.", "In an interview on CBS Miami’s \"Facing South Florida,\" host Jim DeFede asked the Tallahassee mayor if he gave Scott any credit for the economy.", "\"I give him credit for an economy that is largely propped up on low-wage work,\" Gillum said. \"Of course you've got a low unemployment rate when people have got to work two and three jobs just to make ends meet.\"", "In a companion fact-check, we looked Gillum’s claim about low-wage work propping up Florida’s economy (Half True). Here, we will examine Gillum’s latter point about the low unemployment rate is propped up by people with multiple jobs.", "After the interview, the campaign of Gillum’s Republican rival, Ron DeSantis, cried \"Pants on Fire!\" to Gillum’s multiple jobs claim. The campaign was referencing our fact-check of a similar statement by Democratic congressional candidate Alexandria Ocasio-Cortez about the national unemployment rate.", "Is Gillum’s claim any better? No. It is similarly wrong.", "Florida does have nearly full employment, with an unemployment rate of 3.7 percent as of August 2018.", "Gillum doesn’t see that as positively as Scott. But his point that low unemployment indicates that people are working multiple low-wage jobs to make ends meet doesn’t hold up.", "Official unemployment rates are not affected by the number of jobs people hold.", "Nationally, only a small percentage of American workers are employed at more than one job, according to the Bureau of Labor Statistics. The number has hovered in the 4.7 to 5.2 percent range during the past 10 years.", "Florida’s percentage of residents with more than one job does not deviate from national trends.", "The number of jobs in Florida has risen 2.8 percentage points faster than the number of workers in Florida over the past eight years, based on data from the federal Household and Payroll surveys.", "Moody's Analytics senior economist Kwame Donaldson said that’s evidence some workers have more than one job. However, he said, Florida is ranked 26th in the United States in this measure. Nationally, the number of jobs rose 2.9 percentage points faster than the number of workers in that time period.", "Data about multiple job holders isn’t specific enough to draw conclusions about the quality of the jobs, according to Sean Snaith, the director of the University of Central Florida’s Institute for Economic Competitiveness.", "\"You can have multiple jobs even if your primary job is high-paying,\" Snaith said.", "Over the past year, the number of American workers who’ve held multiple jobs has ranged between 6 million and 7 million, compared to more than 148 million who are employed in a single job.", "The number of jobs people hold does not affect the BLS unemployment rate. People are counted as employed as long as they hold one job. They do not get counted again if they hold more than one.", "\"The claim about multiple jobs and unemployment is simply not true,\" Snaith said.", "Gillum said that unemployment was low because people were working multiple jobs.", "Unemployment rates are not influenced by how many jobs someone holds, and not many people hold more than one job.", "We rate this claim Pants on Fire.", "PolitiFact, \"Nelson, Scott fact-checked each other in their first Florida Senate debate. We fact-checked them,\" Oct. 2, 2018", "CBS Miami, \"Facing South Florida: One-On-One With Gubernatorial Candidate Andrew Gillum Part II,\" Sept. 30, 2018", "PolitiFact, \"Alexandria Ocasio-Cortez wrong on several counts about unemployment,\" July 18, 2018\nU.S. Bureau of Labor Statistics via Federal Reserve Bank of St. Louis \"Multiple jobholders, primary job full time, secondary job part time,\" accessed Oct. 3, 2018", "Florida International University Center for Labor Research & Studies, \"State of Working Florida 2017,\" September 2017", "Florida United Way, \"2017 Asset limited, income constrained,employed report,\" Feb. 14, 2018", "The Gainesville Sun, \"Florida’s job growth brisk, but largely at low wages,\" Aug. 4, 2018", "Tampa Bay Times, \"Wages remain stagnant in Florida despite super low unemployment. What’s going on?,\" Aug. 17, 2018", "PolitiFact, \"Scott-o-Meter: Create over 700,000 jobs,\" April 10, 2018", "Fla News Online, \"DeSantis hits Gillum for lowballing Florida’s economy,\" Sept. 30, 2018", "Email interview with Moody's Analytics senior economist Kwame Donaldson, Oct. 4, 2018", "Phone interview with Sean Snaith, director of the University of Central Florida’s Institute for Economic Competitiveness, Oct. 4, 2018", "Email exchange, Florida International University Center for Labor Research and Studies Director Judith Bernier, Oct. 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]