["About this rating", "On 1 June 2017, the satirical web site Babylon Bee jumped in on a recent uproar surrounding one of President Donald Trump's tweets. A little after midnight on 31 May 2017, Trump tweeted \"Despite the constant negative press covfefe,\" causing many to speculate and joke about the apparently mistyped final word. The Babylon Bee offered an exaggeratedly high-stakes rationale as to its origin.", "According to the story, Pentagon officials had to scramble after President Donald Trump made reference to \"covfefe\" on his Twitter account because it was \"one of the key passwords\" in the nuclear code:", "“We’re all just glad everyone thought it was an honest spelling error, or some kind of autocorrect fail,” stated Secretary of Defense James Mattis. “I recently said on Face the Nation that nothing keeps me awake at night. That was false. This very scenario keeps me awake at night.”", "“President Trump’s Twitter account keeps me awake at night,” he added.", "Trump's tweet (which has since been deleted) quickly spurred mockery online. A day later, White House Press Secretary attempted to downplay the issue saying: \"The president and a small group of people know exactly what he meant.\"", "The president also made light of the subject when he tweeted: \"Who can figure out the true meaning of 'covfefe' ??? Enjoy!\"", "The Babylon Bee bills itself as a \"trusted source for Christian news satire.\" Its body of work includes \"reports\" that police defused a protest by giving the demonstrators participation trophies, or that the Democratic National Convention featured convicted murderer and former abortion provider Kermit Gosnell as a \"surprise speaker\" in 2016. The article about covfefe is not to be taken seriously.", "Fabian, Jordan. \"Spicer Offers Cryptic Explanation For Trump 'Covfefe' Tweet.\" The Hill. 31 May 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]