["A video of a man speaking to a media organization about the recent PMC bank scam and the plight of the account holders is being shared on social media. He alleges that the government is giving protection to the bank chairman, bank manager, and politician involved in the fraud. It is being claimed that this man criticising the government is BJP Lok Sabha MP Bhanu Pratap Singh. “He is BJP Lok Sabha MP Advocate, Bhanu Prtapsinh A revolution is expected very soon. Applause to exposure.”, reads the message attached with the video posted by Facebook user Hasan Chaipillai Mohammed.", "He is BJP Lok Sabha MP Advocate, Bhanu Prtapsinh…. A revolution is expected very soon. Applause to exposure.", "Posted by Hasan Chaipillai Mohammed on Wednesday, 9 October 2019", "Several other people on Facebook shared this video with an identical narrative.", "The video is also circulating on WhatsApp.", "Alt News found that the man in the video is not BJP’s Jalaun MP Bhanu Pratap Singh but Rashtriya Janhit Sangharsh Party National President Bhanu Pratap Singh Verma.", "According to his Twitter profile, Verma is also an advocate at the Supreme Court of India. In the picture posted below, you can see the photograph of the same person.", "pic.twitter.com/KSxZm1zEnZ", "— Bhanu Pratap Singh (@BhanuPSinghRJSP) August 10, 2019", "Moreover, with a keyword search on YouTube, we found the full video on News MX’s channel.", "In conclusion, a video of a politician from Rashtriya Janhit Sangharsh Party with a similar name as BJP MP Bhanu Pratap Singh was falsely shared that the latter was criticising his own government for the PMC bank fraud.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]