["Michigan Gov. Gretchen Whitmer discusses details of her executive order on April 9, 2020, in Lansing (AP).", "• Michigan Gov. Gretchen Whitmer’s stay-at-home order does not ban the sale of car seats.", "• Initial confusion about the order led to some Michigan Walmart stores mistakenly prohibiting the sale of car seats.", "• Walmart said it clarified the policies for store managers in Michigan.", "Michigan Gov. Gretchen Whitmer’s aggressive steps to slow the spread of COVID-19 in her hard-hit state have earned her a lot of national attention.", "Back home in Michigan, they’re stirring up complaints from conservatives who say the Democratic governor is overstepping her power or banning the sale of things they need.", "On April 15, thousands of people clogged the streets of the state capital, Lansing, in their cars to protest the governor’s latest statewide stay-at-home order, which tightened restrictions on residents and businesses and extended them to April 30. The protest was organized by the Michigan Conservative Coalition.", "The governor is taking flak on social media, too, with critics claiming falsely that her order bans the sale of American flags and bug spray.", "Untrue claims that Whitmer banned the sale of car seats for infants began circulating on social media soon after she issued the order, which required large stores to close off their garden centers and sections selling paint, flooring and furniture, but didn’t affect baby supplies.", "An April 10 Twitter post from Tori Sachs, executive director of the conservative group Michigan Rising Action, showed a picture of car seats at a Walmart roped off by yellow caution tape and a sign that said: \"By order of the State of Michigan, items in this ‘non-essential’ area are not available for purchase. Please use Walmart.com for your needs until further notice.\"", "Sachs said in the tweet accompanying the photo: \"Per order from @GovWhitmer, people in Michigan are now banned from purchasing a new baby car seat in stores. This is dangerous and this order needs clarification immediately.\"", "The photo was originally shared by a Facebook user before it was tweeted by Sachs.", "Another Facebook user posted about a Walmart in Big Rapids, Mich., refusing to sell her a car seat that was in a restricted area on April 10.", "Fortunately for Michiganders in the market for one, the governor’s executive order did not ban the sale of car seats.", "\"To be clear, the EO asks stores over 50K square feet to close down sections of their store to protect against unnecessary traffic, like garden centers, furniture, paint, carpet/flooring,\" a Whitmer spokesperson said April 12 in a statement to a local TV channel. \"Child car seats aren't in any of those categories.\"", "The statement suggests the Michigan stores that instituted temporary bans on the sale of car seats misinterpreted a provision in Executive Order 2020-42 that required large stores to close off areas selling some products.", "The executive order says: \"For stores of more than 50,000 square feet: … Close areas of the store — by cordoning them off, placing signs in aisles, posting prominent signs, removing goods from shelves, or other appropriate means — that are dedicated to the following classes of goods: carpet or flooring; furniture; garden centers or plant nurseries; paint.\"", "Whitmer tweeted links to a frequently-asked-questions page repeatedly on April 12 in an effort to correct the misunderstandings about the executive order. It says:", "Q: Does Executive Order 2020-42 ban the purchasing of car seats for children?", "A: No. Car seats may be available for purchase.", "Whitmer also addressed the confusion and misinformation surrounding the order in an April 13 press conference and COVID-19 update.", "\"First and foremost, I want to be clear: Nothing in the stay-at-home order prohibits people from buying car seats for your children,\" she said. \"There’s no prohibition on that.\"", "Whitmer encouraged people to be cautious about whether what they see on social media is people sharing facts or just \"political posturing.\"", "Her office didn’t respond to requests for comment for this article.", "The average Walmart Supercenter is 187,000 square feet, meaning the Michigan Supercenters would need to adhere to the regulations about closing certain sections. But it is unclear why the two Michigan Walmarts cordoned off their car seats.", "Could it have been confusion about the term \"nurseries\"?", "Walmart did not respond to PolitiFact’s request for comment, but the retail chain has since clarified its policy on the sale of car seats in Michigan.", "\"Michigan customers are able to purchase baby car seats, baby furniture and other infant products at their local Walmart,\" a Walmart representative told Business Insider in a statement. \"We are reiterating this direction with store management to ensure consistent service to our customers across our Michigan stores. Customers are also welcome to purchase these items from the convenience of their home through Walmart.com.\"", "Sachs said on April 12 that she meant for her original tweet to raise awareness about the confusion Whitmer’s executive order caused throughout the state.", "\"My intention was for the order to be clarified so this didn't happen to another mom,\" Sachs said in a tweet. She added that after her tweet received media coverage and caught the attention of prominent public figures, Whitmer \"finally clarified.\"", "Sachs tweeted: \"Per order from @GovWhitmer, people in Michigan are now banned from purchasing a new baby car seat in stores.\"", "No part of the executive order bans the sale of car seats, but large stores are under orders to keep customers away from areas selling items in categories such as gardening, flooring and furniture. Two Michigan Walmarts cited the order in initially roping off and prohibiting the sale of car seats, but Walmart clarified for store managers that baby products can be sold in stores or online.", "Whitmer has repeatedly stated that the sale of car seats is not banned in Michigan.", "We rate this claim False.", "Tweet by Tori Sachs, April 10, 2020", "Tweet by Tori Sachs, April 12, 2020", "Michigan.gov, \"Executive Order 2020-42 (COVID-19),\" accessed April 15, 2020", "Detroit Free Press, \"Thousands converge on Lansing to protest Whitmer's stay home order,\" April 15, 2020", "Real Clear Politics, \"‘Operation Gridlock’ Protest Against Stay Home Order Blocks Traffic In Lansing, Michigan,\" April 15, 2020", "Michigan Conservative Coalition, Operation Gridlock announcement, accessed April 16, 2020", "The Detroit News, \"GOP research group aims to fight 'liberal activism' in Michigan,\" Sept. 18, 2019", "Fox 2 Detroit, \"Gov. Whitmer said curve is bending, warns lifting Stay Home order too soon could be disastrous and deadly,\" April 13, 2020", "Fox 47 Lansing & Jackson, \"Michigan executive order doesn't ban purchases of child car seats,\" April 12, 2020", "Michigan State Police Facebook video, \"Gov. Whitmer to Give Update on State's Response to COVID-19,\" April 13, 2020", "Business Insider, \"Walmart clarifies its policy on the sale of nonessential goods after a shopper said she was barred from buying a baby car seat,\" April 13, 2020", "Facebook post, April 10, 2020", "Facebook post, April 10, 2020", "MLive, \"Michigan’s updated coronavirus stay-at-home order will close garden centers and other parts of grocery stores,\" April 9, 2020", "Walmart, \"Our Retail Divisions,\" accessed April 16, 2020", "Michigan.gov, \"Executive Order 2020-42 FAQs,\" accessed April 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]