["The photo was published on Facebook on January 26, 2021.", "“A student of UCP passed away due to Baton charge of Security Guards outside UCP today. What did he do wrong?” reads the caption, written in English and Urdu.", "“You taught online, and can’t assess online? These goons are criminals. Security Guards which are meant to protect them are killing them. 6 more injured in Faisalabad. The dead body of late student is in Jinnah Hospital. Verily we belong to Allah, and verily to Him we return.”", "The post circulated as students mainly in the Pakistani city of Lahore protested against in-person exams because of the Covid-19 pandemic. Unverified reports also circulated that a student was killed in the demonstrations.", "The photo also circulated on Twitter alongside similar captions, including here, here and here.", "However, the photo was not taken during student protests in 2021.", "A reverse image search found that the photo was in fact taken by AFP photographer A Majeed after a Taliban attack at a school in the Pakistani city of Peshawar on December 16, 2014.", "Below is a screenshot comparison of the misleading Facebook post (L) and the AFP photo from 2014 (R):", "There have also been no verified reports of a student dying during the protests against in-person exams.", "“Any report about the death of student protesters is false. There have been no deaths,” Syed Mubashir, public relations officer for the Lahore police’s deputy inspector general, told AFP on January 29, 2021.", "Salman Sikandar, information secretary for the Progressive Students' Collective, also denied the claim.", "“There have been no deaths, however there are injuries” among students who joined the protests, Sikandar told AFP on January 29.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]