["About this rating", "On 14 February 2018, 17 people were killed in a mass shooting at a high school in Parkland, Florida, an affluent community north of Miami.", "Authorities named Nikolas Cruz — a 19-year-old former student of Marjory Stoneman Douglas High School — as the suspect in custody for the crime. Almost immediately after his name was made public, social media users, apparently inspired by nothing more than a Spanish-sounding surname, began spreading an unfounded claim that he is an undocumented DACA recipient. The Deferred Action for Childhood Arrivals program gives people who were brought into the United States as young children temporary authorization to remain legally and DACA recipients are often referred to as Dreamers after proposed legislation.", "However Cruz was adopted as a small child, along with his younger brother, by a couple with that surname and is not undocumented.", "Here are examples of such unverified claims that spread on social media in the hours after the tragedy:", "Source: Marjory Stoneman Douglas High School shooter, now in police custody after Parkland, Florida shooting, who has been identified as 19-year-old Nicolas Cruz - is a \"Dreamer\".", "— Craig R. Brittain for US Senate (R-AZ 2018) ? (@SenatorBrittain) February 14, 2018", "Calling it right now, #stonemanshooting suspect is a #DACA recipient as well as a person prohibited from possessing a weapon. Police radio reported his name as Nicholas Cruz.", "— The Color Of Crime (@Color_Of_Crime) February 14, 2018", "Was Florida Parkland shooter, Nicolas Cruz, another #DREAMER?pic.twitter.com/0JMk2bGfpG", "— Boston??Bobblehead (@DBloom451) February 14, 2018", "Of course no post-tragedy conspiracy theory would be complete without a healthy dose of xenophobia and paranoia:", "Shooter confirmed for half Mexican half Muslim and devoutly pro-Bernie, pro socialism, pro antifa and anti Trump #StonemanShooting #nicholascruz", "— the wolf (@IdentityWolf) February 14, 2018", "As has become the morbid pattern after mass shootings in the United States, people looked for clues that the shooter was motivated by an ideology counter to their own or expedient to their own political agendas. At the time of the shooting, lawmakers had been debating about immigration as a whole and the DACA program in particular, going so far as to shut down the government over the issue.", "Cruz's immigration status, of course, is a distraction that has no relation to the tragedy. In the 24-hour period since the shooting, potentially pertinent details of his life began surfacing including disturbing social media posts showing him posing with weapons and depicting acts of animal cruelty. He had been expelled from Douglas High School the preceding year for disciplinary issues. Douglas High students said they had believed, due to his troubling behavior, that if anyone was going to open fire at the school it would be Cruz. He had legally purchased an AR-15 firearm about a year ago.", "The unfounded claim that Cruz is a DACA recipient was hardly the only piece of false information circulating on social media in the immediate aftermath of the incident. A now-restricted Twitter account falsely purporting to belong to former Fox News host Bill O'Reilly spread a false image of a person who is not the suspect (the image's presence on message boards like 4chan predates the shooting):", "Quinn, Melissa.   \"17 People Killed in Shooting at South Florida High School.\"\r\n     Washington Examiner.   14 February 2018.", "Ogle, Connie, et al.   \"Florida School Shooting Suspect Was Ex-Student Who May Have Been Flagged as Threat.\"\r\n     Miami Herald.   14 February 2018.", "WMBB.   \"What We Know About Florida School Shooting Suspect Nikolaus Cruz.\"\r\n     14 February 2018.", "Date, Jack, et al. \"What We Know So Far About the Florida School Shooting Suspect.\"\r\n  ABC News. 15 February 2018.", "Hobbs, Stephen, et al. \"Nikolas Cruz: Troubled Suspect Had Been Expelled From Marjory Stoneman Douglas High School.\"\r\n  Sun Sentinel. 14 February 2018.", "Sullivan, Kevin, et al. \"Fla. Shooting Suspect Had a History of Explosive Anger, Depression, Killing Animals.\"\r\n  The Washington Post. 15 February 2018.", "This article was updated to note that Cruz was adopted and is not undocumented.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]