["About this rating", "An example sentence included in Google's search results for the definition of the word \"parasite\" illustrated how the term could be used in a derogatory fashion to describe a capitalist.", "However, Google itself does not define the word \"parasite\" as a \"capitalist.\"", "On Oct. 14, 2019, former U.S. Speaker of the House Newt Gingrich posted a message on Twitter criticizing Google for providing an inaccurate definition for the word \"parasite.\" According to Gingrich, Google defined the word \"parasite\" as a \"capitalist\":", "Google dictionary’s definition of parasite as a capitalist is inaccurate, disgusting and an absurdity given the wealth of the google founders. That would make them among the largest parasites.", "— Newt Gingrich (@newtgingrich) October 14, 2019", "Gingrich gets plenty of things wrong in this tweet. For starters, Google does not write its own dictionary entries. The search engine provides links and information from reputable dictionaries, such as the one compiled by Oxford University Press. Second, Gingrich's complaint is based on an example sentence showing a derogatory use of the word \"parasite,\" and not an actual definition.", "When we searched for the term \"parasite definition\" on Google, we were provided the following definition: \"an organism that lives in or on an organism of another species (its host) and benefits by deriving nutrients at the other's expense.\"", "Below is a screenshot of this search result. A few things are worth noting. First, Google includes the words \"From Oxford\" at the bottom left of this image, indicating the source of the provided information. If you click on the words \"From Oxford\" while performing this search on Google, you will be redirected to Lexico.com, a collaboration between Dictionary.com and Oxford University Press (OUP).", "Second, Google provides a usage example below its definitions:", "The problematic portion of this definition, according to Gingrich, can be seen when the information box is expanded. Google provides a second definition for the term \"parasite\" but this time shows how the word can be used in a derogatory fashion.", "Google provides the definition here as \"a person who habitually relies on or exploits others and gives nothing in return.\" They also give an example sentence of how \"parasite\" can be used in this derogatory manner: \"The capitalist is really a parasite on the workers.\"", "Danny Sullivan, Google's public search liaison, responded to Gingrich's complaint with some additional information. Sullivan explained the complaint was based on a usage example, not a definition, and that the information was taken from a third party, Lexico.com, and was not created by Google itself:", "Just to clarify: that's not the definition shown. That's a usage example shown with the second definition and one that comes from Oxford University Press, as indicated in the source line, which takes you to the original page. We'll pass this feedback along. pic.twitter.com/3zl3zSJLV3", "— Danny Sullivan (@dannysullivan) October 14, 2019", "In sum, Google did provide an example sentence for the word \"parasite\" that showed how the term could be used in a derogatory fashion to describe a capitalist. However, this comparison was not made in the actual definition for the word (as alleged by Gingrich), nor was this example sentence written by Google.", "Lexico.com.   \"Parasite.\"\r\n    Retrieved 14 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]