["The image appears in numerous social media posts, including this one on Facebook that claims it was taken in Nigeria’s southern Abia state. It has been shared more than 600 times since it was published on September 7, 2020.", "Although the Facebook account that published the image has a history of promoting humorous content, many of the comments suggest online users believe the road to be in Nigeria. Others were skeptical or dismissive, while some found it funny.", "Other parts of southern Nigeria are cited as locations for the road in similar claims on Facebook, such as this post, which reads: “Breeze destroy Obaseki newly constructed electioneering road (sic).”", "Godwin Obaseki is the governor of Edo state, in southern Nigeria, who is seeking reelection later this month.", "Photo shot in Thailand", "Although certain roads in Nigeria are indeed deplorable, like some in Abia as documented by online news site Premium Times, the picture in question was taken in Thailand.", "AFP Fact Check ran a reverse image search and found it was published with other photos in this 2019 article. According to the report, and this one here, the images show the road connecting Ban Huai Thom and Na Nong Daeng communities in Thailand’s Amnat Charoen province.", "The reports were based on the account of a Thai Facebook user called “Prince of Stream” who shared the images on August 31, 2019. The post’s Thai caption translates to English as: “This incident reflects the construction standard of roads near my house.”", "While the initial post attracted comments condemning the standard of construction, an update to it by the same Facebook user suggested the road was properly built but simply not designed to withstand flooding.", "The same set of photos posted by “Prince of Stream” was also published on Twitter on the same day in a tweet explaining how bad weather had struck the area where the road is found.", "ส่งถามกันมามากมายกับถนนเส้นบ้านห้วยทม-นาหนองแดง ต.ป่าก่อ อ.ชานุมาน จ.อำนาจเจริญ หลังโดนพายุ สภาพแบบนี้คนทำทางเรียกว่า \"ขนมชั้น\" ถ้าไม่ prime coat ก็ทำ prime coat บนพื้นที่เปียก สภาพชั้นทางเห็นชัดว่าแทบไม่มีหินเลย pic.twitter.com/tPqJzVKumz", "“After being hit by a storm like this, road workers call this Kanom Chan,” partly reads the tweet’s Thai caption in English. (Kahom Chan is a colourful layered type of Thai dessert and is intended in this context as a criticism of the quality of workmanship.) “Clearly the road was not coated correctly. They must have coated on a wet surface. Clearly seen here, the condition of the surface beneath has almost no rocks.\"", "AFP Fact Check used the 2019 article as well as natural features and objects seen in the images to find the location of the road.", "Using Google Maps Street View, we found a picture of the exact location in Thailand. Images from Google Maps were taken in 2015 before the construction of the road; we were unable to find any public information on when the road was built and if it was repaired, other than the Thai Facebook user saying it had been used for three to four years before the damage occured.", "Using the more updated Google satellite view from this year, the same portion of the damaged road, lying just north of the Kham Sida river, can be seen as a white stripe.", "AFP Fact Check also determined the license plate number seen in the images matches those in Thailand.", "A prototype of the plate number for private motorcycles appears among samples authorised since the 1990s.", "Using images from other countries to portray horrible situations in Nigeria is a growing trend among critics in the African nation. AFP Fact Check has previously debunked such claims here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]