["About this rating", "Scientists with the Japan Aerospace Exploration Agency (JAXA) confirmed on Dec. 14, 2020, that the asteroid explorer Hyabusu2 returned to Earth after successfully collecting and returning extraterrestrial material from Ryugu, an asteroid located 190 million miles away.", "In a video shared to Twitter, Hyabusa2 Project Manager Yuichi Tsuda confirmed samples from Ryugu safely returned to Earth within a capsule on Dec. 6. Hyabusu2 came into Earth’s sphere to drop off the capsule, as well as heat shields and a parachute. All items were recovered in Australia and analyzed before being transported to the JAXA Sagamihara Campus in Japan for further analysis two days later.", "“We have confirmed that the capsule contains a considerable amount of sand collected from Ryugu,” said Tsuda during the Dec. 15 online news conference. “Furthermore, the immediate analysis in Australia and the analysis after returning to Japan confirmed that we were able to collect gas that originates from Ryugu.”", "Hyabusu2 is an asteroid probe specifically designed to return asteroid samples. After 10 years of planning, the explorer was launched to deep space in December 2014 to help scientists better characterize and understand the origins of the solar system, and perhaps even life on Earth. The probe landed on the diamond-shaped asteroid Ryugu in June 2018.", "Ryugu measures nearly 3,000 feet in diameter and is considered a type C asteroid, which means that it is carbonaceous in nature and contains large quantities of carbon molecules. Researchers thought that organic matter and water could be found on the asteroid dating back to when the solar system was created around 4.6 billion years ago, according to the JAXA Institute of Space and Astronautical Science.", "Creative Commons", "It took JAXA researchers about a week to open the capsule and on Dec. 14, the team announced that it had found grains of black sand derived from Ryugu attached to the sample container. The following day, a news release from the JAXA National Research and Development team confirmed that gas was also collected from the sample that originated from Ryugu.", "Two analyses — one conducted in Australia and the second in Japan — found that the composition of the gas differed from atmospheric conditions on Earth, further confirming that the sample was taken from Ryugu and had not been tainted since its terrestrial arrival.", "The Hyabusu2 Ryugu return marked the world’s first sample of gaseous material from deep space.", "“The sample of the asteroid extraterrestrial material that we dreamed about is now in our hands,” said Tsuda, adding that the accomplishment is considered a “major scientific milestone.”", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]