["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "UN Women Goodwill Ambassador Emma Watson walks next to United Nations Secretary General Ban Ki-moon, while they attend the HeForShe campaign launch at the United Nations on September 20, 2014. (Getty Images)", "Every year around the world, millions of girls under the age of 18 get married, often without having any say in the decision. While this isn’t a bad deal in every instance, the statistics raise many red flags.", "In too many cases, the move comes at the price of a girl’s health, education and personal safety.", "The issue shows up in many pleas to improve the lot of women worldwide and was part of an impassioned speech at the United Nations by Harry Potter actress Emma Watson. Watson, who carries the title Goodwill Ambassador for UN Women, noted in a Sept 20 speech that if nothing is done, \"15.5 million girls will be married in the next 16 years as children.\"", "As we began checking that statement, we quickly figured out that Watson's wording was garbled. The correct expression would have been 15.5 million girls per year, and that would be starting in the year 2030, 16 years from now.", "A senior adviser at UN Women acknowledged the mistake.", "The upshot: Watson’s figure is a huge undercount. From an article cited by UN Women, more than 140 million women under 18 will get married by 2020.", "The primary source behind these figures is the UN Population Fund, which in turn relies on data from the Demographic and Health Survey and the Multiple Indicators Cluster Survey. These provide generally reliable information, and analysts at the Population Fund culled numbers from 48 developing nations on women between the ages of 20 and 24.", "Essentially, to measure how many females married young, you survey those who are 20 or older and ask them when they got married. By convention, anyone who marries under the age of 18 is considered to have wedded early.", "According to the Population Fund, in 2010, 14.2 million girls under 18 married each year. By 2030, they projected the rate would rise to 15.1 million per year.", "Why the annual increase? Sylvia Wong specializes in adolescent issues at the Population Fund. Wong said there’s a demographic bubble moving through the system.", "\"Many of these countries have extremely young populations with larger cohorts of younger girls, who have not yet married but may be at risk in the next 16 years,\" Wong said.", "Demographer Margaret Greene, author of a Ford Foundation report on gaps in the research on child marriage, said these figures are \"on target,\" but notes that the underlying picture is changing.", "\"Individual country studies conducted in the past couple of years show increases in (the) age at marriage, say from 14 to 16,\" Greene said. \"But since these ages are both under 18, you don't see many shifts in the overall percentage of child marriages.\"", "In fact, while the demographics might lead to a rise in the annual overall number, underage marriage actually is falling when you compare it to the total population of young women in each country.", "Using the same data as the Population Fund, two World Bank researchers noted in a 2012 article that \"it is widely acknowledged that child marriage is decreasing.\"", "They wrote that the  incidence of child marriage in South Asia and sub-Saharan Africa has gone down by about 20 percent in the past 30 years. The rate used to be over 50 percent. Today it is down to about 40 percent. They said \"progress has been made,\" but the gains have been slow.", "In this fact-check, our main goal is to examine how closely Watson’s statement tracks with current research. No one can say for sure what the rate of early marriage will be 16 years from now. Gayatri Koolwal is a development economist with Data 2X, a UN project aimed at improving the quality of data related to women. Koolwal said the underlying data is valid but urged a bit of caution.", "\"These projections over a long period of time are always tricky,\" Koolwal said. \"They don't account for a host of other factors, including economic, political, and health-related, that could affect demographic trends over the same period.\"", "Our ruling", "Watson said that at current rates, 15.5 million girls would be married as children in the next 16 years. Watson probably meant to say that 16 years from now, 15.5 million girls per year would be married as children.", "However, the estimate we found from the source cited by UN Women is a bit less than Watson said -- 15.1 rather than 15.5 million by 2030.", "The annual number masks two underlying trends. First, in some developing countries, the age of marriage is rising even if it remains below the threshold age of 18. Second and more important, the incidence of child marriage is falling. It just isn’t falling as quickly as the population of young girls is increasing.", "Watson severely undercounts the sheer number of young marriages that will take place between now and 2030. Based on current trends, there would be not just another 15 million, but another 125 million on top of that, a figure that would have bolstered her case. But either way, the statistic ignores that the incidence of child marriage is falling.", "On balance, Watson's claim is partly accurate but leaves out important details. We rate it Half True.", "Emma Watson, United Nations speech, Sept. 20, 2014", "UN News Centre, By 2020, more than 140 million girls will have become child brides , March 7, 2013", "International Center for Research on Women, Child marriage fact sheet", "Ford Foundation, Ending child marriage, January 2014", "Girls Not Brides, About child marriage", "United Nations Population Fund, Marrying too young, 2012", "Minh Cong Nguyen and Quentin Wodon,  World Bank,Child Marriage and Education: A Major Challenge, 2012", "Email interview, Sylvia Wong , adolescent and youth specialist, UN Population Fund, Sept. 25, 2014", "Email interview, Margaret Greene, demographer, Greeneworks, Sept. 26, 2014", "Email interview, Gayatri Koolwal, development economist, Data 2X, Sept. 26, 2014", "Email interview, Elizabeth Nyamayaro, senior advisor, UN Women, Sept. 26, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]