["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The high tide is encroaching on Marsha Hamlin, 58, and her daughter Courtney Hamlin, 23, who are vacationing from Indiana on Belleair Beach. (JIM DAMASKE | Times)", "Confusion about what a new law means for Florida beaches is prompting fears and political attacks.", "Advocacy group For Our Future Florida used HB 631 as a wedge in the U.S. Senate race, where Democratic incumbent Bill Nelson is facing a challenge from Republican Gov. Rick Scott, who signed the bill into law in March.", "\"On #EarthDay, we want to thank @SenBillNelson who has always fought for and defended the health of Florida’s coastlines and environment, while @FLGovScott just signed a bill that could make most of Florida’s beaches private,\" For Our Future Florida tweeted April 22.", "On #EarthDay, we want to thank @SenBillNelson who has always fought for and defended the health of Florida’s coastlines and environment, while @FLGovScott just signed a bill that could make most of Florida’s beaches private. pic.twitter.com/73MsfRdg49", "Please pause before cancelling your summer vacation. This claim needs a fact-check.", "In reality, more than half of Florida beaches are already privately owned. The new law, opposed by many environmental groups, affects the procedure for local governments that want to make private beaches public.", "Starting July 1, any city or county that wants to enact an ordinance to make private beaches public will have to go through the courts.", "The sound bite from For Our Future Florida rests on the notion that private beach owners will use the law to limit public access. But we don’t know how those owners will react.", "The law Scott signed isn’t going to turn beaches that are public now over to private ownership.", "What it will do is make it harder to guarantee public access on beaches that were already privately owned.", "Before the new law, local governments could adopt ordinances guaranteeing the public’s access to privately owned beach property. Those ordinances stemmed from a legal principle known as \"customary use.\"", "\"Customary use\" refers to the public’s historic access to the dry sand portion of the beach that may belong to a private property owner.", "\"The idea and custom goes all the way back to ancient Rome and falls under the same set of ideas as the sea belongs to everyone and all have an equal right to use it,\" said David Cullen, a lobbyist for the Sierra Club, which opposed the bill.", "For example, the owners of an oceanfront estate in South Beach may decide they do not like that beachgoers are setting up camp on the shoreside portion of their property. They install a fence and \"no trespassing\" signs to tell the public to stay away.", "The Florida Supreme Court ruled that if a private property owner tries to do this, then the local government could enact an ordinance guaranteeing the public’s use of that land under \"customary use,\" following their usual notice and hearing process. If landowners wanted to challenge the ordinance, they would have to sue the local government.", "Lawmakers drafted HB 631 to put more of the onus on the government and to establish a uniform process that includes all the stakeholders.", "A situation in the Panhandle’s Walton County, which passed ordinances based on this \"customary use\" doctrine in 2016, illustrates why some lawmakers supported the bill.", "After the ordinance was passed in Walton County, some beach property owners filed lawsuits to overturn it. The U.S. District Court for the Northern District of Florida upheld the county’s ordinance, but landowners appealed that decision.", "\"Without the courts involved on the front end, individual property owners could and did sue to challenge county ordinances around the state,\" said Rep. Paul Renner, R-Palm Coast, in a letter to the editor for the Palm Coast Observer website. \"The taxpayers were on the hook for legal fees to defend every individual case against the county and pay any damages awarded if the county got it wrong.\"", "Starting July 1, local governments that seek to adopt an ordinance that is premised on customary use rights must first notify all the owners of land that might be implicated, and then file a proceeding in court.", "The court will decide the question of whether the public has customary use rights in that specific area.", "The Sierra Club’s Cullen predicts the law will embolden people to stick fences and \"no trespassing\" signs on their properties. If that happens, local governments will have a bigger legal hurdle to clear before guaranteeing the public’s access to that area.", "That said, the new law does not affect any property or beach use rights. It doesn’t affect the rights the public had to use the dry sand beach before it was enacted, nor does it affect landowners’ rights.", "Law experts and leaders in the beach communities emphasized that the public should not feel compelled to change patterns of historic beach usage as a result of the law’s passage.", "\"If the public has customary use rights in a given area, the statute doesn’t change that in any way,\" said Alyson Flournoy, a University of Florida Levin College of Law professor. \"Those common law rights exist, whether or not there is an ordinance and whether or not there has been a judicial decision. The rights may be contested, but that doesn’t mean they are any more or less valid after July 1, 2018.\"", "For Our Future Florida said that Scott \"just signed a bill that could make most of Florida’s beaches private.\"", "The law does benefit private beach owners in a way. But this is a poor explanation that obscures critical facts.", "The law Scott signed would not result in turning more public beaches into private ones. In reality, when the law takes effect, it will make it harder for local governments to guarantee public access to beaches that are already private by throwing in a new judicial obstacle.", "It’s unclear at this point how the law will change private beach access, because that depends on the actions of local governments and private beach owners.", "We rate this claim Mostly False.", "Interviews, Blake Williams, spokesperson for For Our Future Florida, April 24 and 25", "Email exchange, Alyson C. Flournoy, law professor at the University of Florida Levin College of Law, April 23", "Email exchange, David Cullen, lobbyist for the Sierra Club, April 25, 2018", "Interview, Jay Liles, Policy Consultant at Florida Wildlife Federation, April 25, 2018", "Email exchange, Robin A. Sollie, executive director of the Tampa Bay Beaches Chamber of Commerce, April 23", "Interview, Holly Parker, Florida Regional Manager of the Surfrider Foundation, April 26, 2018", "Tampa Bay Times, New law Scott signed makes public access to beaches harder to establish, April 4, 2018", "Palm Coast Observer, The real story about beach access, after Florida HB 631, April 20, 2018", "The Walton Sun, Walton County to rewrite rules for public beach access following passage of HB 631, April 8", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]