["About this rating", "On 22 April 2017, a series of reports appeared with claims that House Oversight Committee chair and Utah Rep. Jason Chaffetz may soon resign over a bevy of yet-to-unfold scandals:", "Jason Chaffetz, chairman of the Congressional Oversight Committee, may soon resign. He told Politico that his resignation was not in any way related to scandal. “Not in any way shape or form. I’ve been given more enemas by more people over the last eight years than you can possibly imagine. From the Secret Service to the Democratic Party. I am who I am. If they had something really scandalous, it would’ve come out a long, long time ago.”", "Well, it would be true that “it would have come out a long, long time ago” had the FBI been investigating Russian money laundering by people involved in the American political process. But until Donald Trump came along, there weren’t really any major questions about such things in our political process. But we will get into that in a bit.", "Another revelation is that Jason Chaffetz “wants to spend more time with his family” because he is allegedly having an affair.", "Chaffetz has made news in recent days for announcing he will not seek re-election to the House of Representatives in 2018. He then told a Utah radio station on 20 April 2017 he may take it a step further and leave office before completing his term. To date, he has remained tightlipped on his reasons for departure, but has adamantly denied any looming scandal. Still, the announcements have prompted curiosity and speculation.", "We reached out to Chaffetz's spokeswoman, M.J. Henshaw, who referred us to a 20 April 2017 comment Chaffetz made when asked by Politico whether a scandal was brewing:", "Absolutely, positively not.", "Not in any way shape or form. I’ve been given more enemas by more people over the last eight years than you can possibly imagine. From the Secret Service to the Democratic Party. I am who I am. If they had something really scandalous, it would’ve come out a long, long time ago.", "Because the stories are about events that have not occurred and is as a result complete conjecture, there is no way to verify the claims. They cite only speculation based on loose observations and hearsay by Twitter gadflies known for posting unsourced (but sensational) rumors.", "The story cites what it refers to as a Daily Kos \"article,\" which is, in fact, a post from a blogger, meaning that it was not written (or vetted) by any of the web site's staffers. The blogger cites only Twitter posts by Claude Taylor (a travel photographer who says he worked as a White House staffer and claims to have reliable sources that tell him items of lurid gossip, which he then posts to social media) and Louise Mensch, a former member of British parliament who also has aggressively taken to Twitter to post her theories on the ongoing probe into Russian interference in the 2016 U.S. elections.", "It's unclear why Chaffetz wants to leave his post earlier than expected, but he has in the past expressed strong interest in running for Utah governor. In 2016, Chaffetz told the Deseret News:", "I’m not going to be here [in Washington, D.C.] forever. I would take a serious, serious look at running for governor. I want to go as hard and fast as I can in the House and then go home.", "Legitimate publications like the Washington Post and The Atlantic speculate Chaffetz is trying to shield his future political ambitions from ongoing investigations plaguing the current Congress and administration. Per the Atlantic:", "Even before Chaffetz announced his abrupt exit, his political luck had suffered a steep decline when Trump was elected. As oversight chairman, he was preparing to spend four years investigating President Hillary Clinton’s alleged scandals and misdeeds. Then the Republicans unexpectedly seized control of the White House, leaving Chaffetz with the unenviable task of policing his own party. It was a fraught job to begin with, and his casual attitude toward the Trump family’s potential conflicts of interest — demonstrated in his interview with me last month — has only increased the pressure on him.", "“Aside from Trump and Clinton,” one Utah Republican told me last month, “nobody’s fortunes changed more on presidential election night than Jason Chaffetz.”", "That seems to be in line with the fact that his campaign has registered two web domains (Jason2028.com and JasonChaffetz2028.com) that The Hill reported could indicate a White House run in the future.", "It seems unlikely that if Chaffetz was expecting a set of scandals to break, his campaign would make moves to secure web domains for future political runs. But because the claims are about events that have not happened, and no evidence is offered other than supposed unnamed sources, there is no proof they are true.", "Stahl, James. \"The Resignation of Jason Chaffetz: Sex and Russian Money Laundering.\"\r\n  AmericanNewsX.com. 22 April 2017.", "Sherman, Jake. \"Chaffetz Says ‘Absolutely’ No Scandal Is Forcing Him Out.\"\r\n  Politico. 20 April 2017.", "Mopshell. \"Why Is Chaffetz Resigning? It Will All Come Out in the Laundering.\"\r\n  DailyKos.com. 21 April 2017.", "Roche, Lisa Riley. “Rep. Jason Chaffetz Eyeing a New Title — Governor.”\r\n  Deseret News. 3 January 2016.", "Blake, Aaron. \"Jason Chaffetz and Devin Nunes Both Faced Investigating Trump. Now Both Are Stepping Aside.\"\r\n  The Washington Post. 20 April 2017.", "Coppins, McKay. \"Jason Chaffetz's Abrupt Exit.\"\r\n  The Atlantic. 19 April 2017.", "Firozi, Paulina. \"Chaffetz's Campaign Arm Registers 2028 Websites.\"\r\n  The Hill. 19 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]