["About this rating", "Several migrants housed in Tijuana waiting to cross the border were diagnosed with tuberculosis, HIV/AIDS or chickenpox.", "According to news reports, among the roughly 6,000 migrants housed at a stadium in Tijuana, only three cases of tuberculosis, four cases of HIV/AIDS, and four cases of chickenpox were confirmed.", "On 29 November 2018, a number of right-leaning websites published misleading headlines proclaiming that a whopping one-third of migrants who had traveled to the U.S.-Mexico border with a Central American caravan were suffering from serious communicable illnesses.", "Articles published by sites including Daily Wire and Lifezette carried misleading headlines such as \"One-Third of Migrant Caravan Sick: HIV, Tuberculosis, Chickenpox.\" However those articles did not support what their headlines implied.", "Those articles were cribbed from a 29 November 2018 Fox News report that quoted a health official in Tijuana. Although the report stated that roughly one-third of the caravan migrants were being treated for unspecified health complaints, only a handful were actually suffering from HIV/AIDS, tuberculosis or chickenpox:", "The spokesman told Fox News that out of 6,000 migrants currently residing in the city, over a third of them (2,267) are being treated for health-related issues.", "There are three confirmed cases of tuberculosis, four cases of HIV/AIDS and four separate cases of chickenpox, the spokesman said.", "At least 101 migrants have lice and multiple instances of skin infections, the department’s data shows.", "That's not to say health concerns relating to the migrants were not dire, however. The Associated Press reported that a common affliction among them was respiratory infection, and it was feared that crowded and unsanitary conditions could give rise to other serious medical issues. Many migrants also had injuries associated with walking great distances:", "Miguel Angel Luna Biffano, a health volunteer with the Nazarene Church Compassion Ministries, which has been accompanying the caravan since the migrants crossed into southern Mexico, said his aid group was dealing with lice and nit infestations as well as many respiratory infections. In the tropical south they had mostly treated dehydration and feet damaged and blistered from walking hundreds of miles.", "“The overcrowding here causes them to get into places where they shouldn’t like under the bleachers” where it’s filthy, Luna said. “There’s overcrowding and very few hygiene norms. ... With the water and the cold there are going to be too many infections, a lot of fevers. There is going to be a need for antibiotics.”", "Meantime, officials in Tijuana were warning that the city couldn't afford to care for the thousands of migrants much longer.", "The migrants had been housed at a sports stadium in Tijuana near the U.S.-Mexico border, many of them in a state of limbo waiting on U.S. authorities to let them cross into San Diego and give provide them a chance to make their cases for asylum. Most had traveled north with a caravan that originated in northern Honduras on 12 October 2018, and the fact that some of them had medical complaints was no surprise considering they had traveled largely on foot through Guatemala and Mexico.", "The caravan was the target of myriad conspiracy theories and misinformation and was regularly invoked as a scare tactic in the lead-up to the November 2018 U.S. midterm elections. Politicians referred to it as an \"invasion,\" and the U.S. government sent thousands of active duty soldiers to the border to support immigration authorities. Fear-mongering about the caravan  vacillated between characterizing migrants as \"gang members and some very bad people\" and referring to them as sickly and diseased.", "Mikelionis, Lukas, and Griff Jenkins.   \"One-Third of Migrants in Caravan Are Being Treated for Health Issues, Tijuana Health Official Says.\"\r\n    Fox News.   29 November 2018.", "Bump, Phillip.   \"What Is and Isn’t Happening with the Migrant Caravan in Southern Mexico.\"\r\n    The Washington Post.   29 October 2018.", "Sherman, Christopher.   \"Warnings Grow Over Unsanitary Conditions in Tijuana Shelter.\"\r\n    Associated Press.   29 November 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]