["About this rating", "For as long as we've been operating this web site (close to twenty years), the three most commonly and continuously circulated types of conspiracy theories have to do with claims that the President of the United States or some other federal agency is about to declare martial law, is readying mass internment facilities (i.e., concentration camps), or is preparing to use armed force against U.S. citizens.", "Another entry in the latter category comes courtesy of Dr. Jim Garrow, who posted on his Facebook page on 21 January 2013 that:", "I have just been informed by a former senior military leader that Obama is using a new \"litmus test\" in determining who will stay and who must go in his military leaders. Get ready to explode folks. \"The new litmus test of leadership in the military is if they will fire on US citizens or not\". Those who will not are being removed.", "How seriously should one take this warning that the military is being purged of those who won't agree to fire on U.S. citizens? Consider that:\n\n The only supporting evidence for this claim was a single, second-hand account from an anonymous source.\n Not a single reputable news outlet reported any such story.\n Not a single member of the U.S. military or the U.S. government has come forward to confirm the claim in the nearly three years since it originated.\n No evidence documents that the U.S. military has experienced a purging of leaders from its ranks for \"refusing to fire on U.S. citizens.\"\n This claim fits a common model of conspiracy theory which has been repeatedly espoused many times over (but has never proved true).\n The person spreading this warning is promulgating other discredited conspiracy theories, such as the claim that Adam Lanza did not use a version of an AR-15 rifle in the Sandy Hook shootings.  (See this article for a debunking of that rumor.)", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]