["About this rating", "In August 2019, we received multiple inquiries from readers asking about the veracity of an article that claimed Norway had made it legal for humans to marry animals.", "The June 2017 article was published on a Cameroonian blog called The Watch Dog Web and bore the headline \"Norway: The Marriage Between Humans and Animals Is [sic] Been Legalised!\" It's not clear what prompted a wave of social media sharing of the blog post more than two years later. Another website, My Africa Today, published a short version of the story on Aug. 22, but it's unlikely that accounts for the viral spread of The Watch Dog Web's version.", "Many of the Facebook and Twitter posts presented The Watch Dog Web's article, apparently in earnest, as a harbinger of a coming apocalypse. For example, a Facebook page called True Biblical Christians shared the article along with biblical verses concerning the city of Sodom, and \"the day when the son of man is revealed\":", "Others made similar claims, writing that the story was evidence that \"Jesus is soon to come,\" and \"the end is near,\" among other pronouncements:", "Rapture READY? Time is running out! https://t.co/5PsBb8Qb2H", "— Ann E Caffee (@copastoracafy) August 22, 2019", "The blog post read:", "\"According to an article published in the Norwegian newspaper Dagens Næringsliv of March 10, 2017, as well as several sites, Norway legalized marital unions between humans and domestic animals (bush animals and marine animals are excluded). Barbarä, a 23-year-old woman who was met by a team of journalists, would be the first to celebrate a zoocontractual union.", "\"Barbarä Trüdlosmek seems delighted to introduce her husband: Rudolf, an abandoned doberman she found in an animal shelter In January 2015 and with whom she claims to be bound by a sincere and reciprocal love. They have already married.\"", "The article was a hoax that ultimately derived from SecretNews, a French website that presents itself as satirical. Along with the English-language version that went viral in August 2019, The Watch Dog Web published a French-language version back in June 2017.", "That version was almost entirely copied from SecretNews's original November 2016 article. The graphic below shows a side-by-side comparison of a section of the original post (on the left) with the version published seven months later by The Watch Dog Web (on the right):", "The only difference between the content of the two versions was that The Watch Dog Web presented the fictional change in Norway's law as having already happened and the fictional \"Barbara\" as having already married her dog \"Rudolf,\" while SecretNews said those developments would be coming soon.", "Additionally, The Watch Dog Web falsely claimed to have based its report on a \"10 March 2017 article in the Norwegian newspaper Dagens Naeringsliv,\" a claim that SecretNews did not make but that likely added to the credibility of the story for some readers, especially since Dagens Naeringsliv is a real Norwegian newspaper.", "Finally, and most importantly, neither the English- nor French-language versions of The Watch Dog Web's article made it clear that the story had been lifted from a website that presents its content as \"satire.\" The Watch Dog Web did list \"SecretNews.fr\" as a source, underneath its own article, but did not link to the original. Therefore, only a reader who was willing to do some digging online or was already aware of SecretNews would know of the \"animal marriage\" story's satirical origins.", "By contrast, SecretNews does present its content as \"satire,\" although the disclaimer at the bottom of the website can only be reached if a reader scrolls down through a series of repeatedly refreshing advertisements, not something an average reader would do in the normal course of events. In any case, that disclaimer reads (translated from French):", "\"SecretNews is a free, independent, collaborative satirical publisher which involves several contributors. Most of the information presented on this website is probably false, published with a satirical and humorous aim. It should not be taken seriously.\"", "So a fictional story published in 2016 by a French website that labels its content \"satire\" was picked up by a Cameroonian blog in 2017, embellished and stripped of its \"satire\" disclaimer, and then translated into English. The latter went viral in August 2019, when American readers mistook it for real and shared it widely as supposed evidence of the imminent end of the world.", "TheWatchDogWeb.Wordpress.com.  \"Norway: The Marriage Between Humans and Animals Is Been Legalised!\"\r\n  6 June 2017.", "MyAfricaToday.com.  \"Norway: Marriage Between Humans and Animals Legalized.\"\r\n  22 August 2019.", "Delrue, Maxime.  \"Entre Satire et 'Attrape-Clics,' Voyage au Pays des Usines à Buzz.\"\r\n  Les Décodeurs/Le Monde.  12 May 2017.", "SecretNews.fr.  \"Norvège: Les Mariages Entre Humains et Animaux Bientôt Légalisés Sous Certaines Conditions.\"\r\n  20 November 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]