["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Friday, June 17, 2016 photo, homeless man David Brophy, right, talks to People Assisting The Homeless (PATH) outreach team members who are helping him acquire an ID card on a street near where he lives in Los Angeles. (AP Photo/Richard Vogel)", "California’s homeless crisis now ranks as one of the top concerns in the state, tied for first with jobs and the economy in a recent survey.", "Sacramento Mayor Darrell Steinberg, who chairs the governor’s commission on homelessness, has taken notice and promised greater urgency.", "He recently called for his city to spend $30 million to jump-start the mass production of tiny homes, structures 500 square feet or less.", "Steinberg said these no-frills structures could house thousands of homeless people in Sacramento and elsewhere, and help ease the state’s crisis, claiming \"90,000 Californians are unsheltered and homeless.\"", "That’s nearly the population of medium-sized cities, from Santa Barbara to Livermore to Redding. Is the state’s homeless crisis really as severe as Steinberg claimed?", "We set out on a fact check.", "Our research", "This isn’t the first time we’ve looked at Steinberg’s statements on homelessness.", "In July, during his push for a statewide ‘right to shelter’ law, we examined his claims about the share of unsheltered homeless people in California compared with New York City — and on the soaring rate of homeless deaths in two major cities in the state. We found his assertions were generally correct, but needed a few clarifications.", "To verify Steinberg’s statement about 90,000 unsheltered people, we reviewed a U.S. Department of Housing and Urban Development study called the 2018 Annual Homeless Assessment Report to Congress. Housing experts consider it the most comprehensive and current set of estimates for homeless populations nationwide.", "Released in December last year, the report shows California had nearly 130,000 homeless people both sheltered and unsheltered, a tally from a point-in-time count conducted in January 2018. That was the most of any state, far ahead of second-place New York with about 92,000 homeless people. Of course, more people live in California than any other state.", "Of California’s total, 89,543 were unsheltered, meaning they were not living in an emergency shelter or similar residence. Instead, they were found on the street, in a vehicle or abandoned building.", "This matches Steinberg’s statement.", "At nearly 69 percent, California’s share of unsheltered homeless people was the highest in the nation, the report found. Oregon had the second-highest share at about 62 percent.", "Steinberg’s spokesperson said the mayor relied on the HUD report.", "California has the nation's highest rate of unsheltered homeless people, according to the 2018 Annual Homeless Assessment Report to Congress.", "‘Double digit increases’ in homelessness", "Chris Martin, a legislative advocate on homelessness at the nonprofit Housing California, said Steinberg used the best figure available.", "He said a new HUD report is expected in December.", "Based on early survey results around the state this year, Martin said he anticipates at least a 10 percent jump in California’s overall homeless population when the report comes out. He did not have an estimate on how the unsheltered population might change.", "\"It’s bad,\" Martin said, of the overall totals. \"I’d say most communities around the state are seeing a double-digit increase.\"", "Martin pointed to one research group, HUB for Urban Initiatives, that estimates there’s been a nearly 24 percent spike in homelessness statewide from 2017 to 2019.", "He noted that the federal homeless counts represent a snapshot-in-time of a community’s homeless population.", "\"We usually estimate that two to three times the point-in-time number are homeless during the course of the year,\" added Sharon Rapport, director of the California State Policy Corporation for Supportive Housing, develops housing policy and makes housing loans.", "While the federal reports are issued each year, Rapport said the odd year counts are more comprehensive because not every jurisdiction did a survey in 2018. She said she expects the 2019 report to show a larger overall number of homeless people.", "\"Despite these flaws, it is the best data we have at this point,\" Rapport added.", "Our rating", "Sacramento Mayor Darrell Steinberg recently claimed \"90,000 Californians are unsheltered and homeless.\"", "He relied on the federal government’s 2018 Annual Homeless Assessment Report to Congress. It uses data from point-in-time counts, but it is considered the best and most current set of estimates for homeless populations nationwide.", "It backs up the mayor’s claim, showing California had nearly 130,000 homeless individuals in 2018, of which nearly 90,000 were unsheltered.", "We rated Steinberg’s statement True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Sacramento Mayor Darrell Steinberg, interview with Capital Public Radio, Oct. 24, 2019", "Mary Lynne Vellinga, spokesperson for Mayor Steinberg, email exchange, Oct. 30, 2019", "U.S. Department of Housing and Urban Development, The 2018 Annual Homeless Assessment Report to Congress, December 2018", "PolitiFact California, Fact-checking claims on California’s unsheltered homeless population, July 25, 2019", "Chris Martin, legislative advocate on homelessness, Housing California, email exchange, Oct. 30, 2019", "Sharron Rapport, director, California State Policy Corporation for Supportive Housing, email exchange Oct. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]